{
  "ground_truth": "He stands, grasps her shoulder for a moment, and walks away, while Charlie's brow is anxiously wrinkled. Mist wafts over the hands of the hordes of possessed standing outside as they slowly rock from side to side, beneath a full moon that glows between dark clouds. Something hangs overhead, looking down at the diner as Bob and Jeep walk in. Charlie stands staring at Michael, who slowly steps towards her, while Sandra grabs the baby and Michael aims the gun. Something flies down towards the diner as, standing beside Charlie, Audrey shakes her head. Outside, light washes over the possessed, and intense white light shines through the entrance as the door blasts open. Michael shoots Sandra in the head, causing her to jerk backward and drop the baby, which Jeep dives and catches. Gabriel steps out of the bright light, a tall, muscular man with enormous black wings, and spreads his wings, swinging a mace down to the baby. Holding him, Jeep rolls out of the way as the mace slashes a hole in the floor. Bob shoots at Gabriel while Jeep gives the baby to Charlie, and Gabriel spins, deflecting the bullets with his wings wrapped around him. Gabriel slices across Bob's chest, and Bob drops his gun, feeling his bloody chest, before Gabriel swipes him across the face, throwing him onto a cooker. Michael gives Jeep some keys, and Jeep, Charlie, and Audrey rush to a door and open it, finding the possessed standing with their heads bowed, a walkway between them. Jeep steps out holding a pistol, followed by Charlie holding the baby, and Audrey, as Jeep leads the way with his gun held out in front. The possessed stand motionless with mist floating above their bowed heads, while in the diner, Gabriel stands facing Michael, who shakes his head slightly. The possessed step aside as Jeep, Charlie, and Audrey walk between them and reach a figure with a bag over its head, standing in front of the police car. In the diner, Gabriel studies Michael while the figure with the bag over its head wheezes and whacks the hood of the police car with a stick. Jeep, Charlie, and Audrey get in the police car as Michael walks up to Gabriel, and Jeep drives them away while Michael steps right up to Gabriel, who studies him. Jeep keeps his eye on the wing mirror as he drives away. Michael clasps his hand against Gabriel's cheek, looks him in the face, and Gabriel's eyes moisten as he looks down, his lips moving as if grasping for words. Gabriel clutches Michael's hand and looks deep into his eyes before pushing him away. Michael readies his assault rifle as blades poke out of Gabriel's mace, and Gabriel spreads his wings and his chest, lunging towards Michael, who shoots and leaps out of the way.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "He remains, grips her shoulder for a minute, and strides away, while Charlie's forehead is anxiously furrowed. Vapor drifts over the hands of the throngs of possessed standing outside as they gradually sway from side to side, under a full moon that shines between dark clouds. Something suspends overhead, gazing down at the diner as Bob and Jeep enter. Charlie remains staring at Michael, who gradually steps toward her, while Sandra clutches the infant and Michael targets the firearm. Something descends towards the diner as, standing beside Charlie, Audrey shakes her head. Outside, light floods over the possessed, and intense white light gleams through the entrance as the door bursts open. Michael fires at Sandra in the head, causing her to jerk backward and drop the infant, which Jeep lunges and catches. Gabriel strides out of the bright light, a tall, muscular man with enormous black wings, and expands his wings, swinging a club down at the infant. Holding him, Jeep rolls out of the way as the club slices a gap in the floor. Bob fires at Gabriel while Jeep gives the infant to Charlie, and Gabriel revolves, deflecting the shots with his wings wrapped around him. Gabriel cuts across Bob's torso, and Bob drops his weapon, feeling his bloody torso, before Gabriel swipes him across the face, throwing him onto a stove. Michael gives Jeep some keys, and Jeep, Charlie, and Audrey rush to a door and open it, finding the possessed standing with their heads bowed, a path between them. Jeep steps out holding a revolver, followed by Charlie holding the infant, and Audrey, as Jeep leads the way with his firearm held out in front. The possessed stand motionless with mist drifting above their bowed heads, while in the diner, Gabriel stands facing Michael, who shakes his head slightly. The possessed step aside as Jeep, Charlie, and Audrey walk between them and reach a figure with a sack over its head, standing in front of the police vehicle. In the diner, Gabriel examines Michael while the figure with the sack over its head wheezes and strikes the hood of the police vehicle with a stick. Jeep, Charlie, and Audrey enter the police vehicle as Michael walks up to Gabriel, and Jeep drives them away while Michael steps right up to Gabriel, who examines him. Jeep keeps his gaze on the wing mirror as he drives away. Michael clasps his hand against Gabriel's cheek, looks him in the face, and Gabriel's eyes moisten as he looks down, his lips moving as if grasping for expressions. Gabriel grips Michael's hand and looks deep into his eyes before pushing him away. Michael readies his assault rifle as blades protrude from Gabriel's club, and Gabriel expands his wings and his chest, lunging towards Michael, who fires and leaps out of the way."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "He is stood, her shoulder is grasped by him for a moment, and away he walks, while Charlie anxiously wrinkles his brow. Over the hands of the hordes of possessed standing outside, mist is wafted as they are slowly rocked from side to side, beneath a full moon that is glowed upon by dark clouds. Overhead, something is hung, looking down at the diner as Bob and Jeep are walked in. Charlie is stood staring at Michael, who is slowly stepped towards by her, while the baby is grabbed by Sandra and the gun is aimed by Michael. Something is flown down towards the diner as, beside Charlie, Audrey is stood shaking her head. Outside, the possessed are washed over by light, and through the entrance, intense white light is shone as the door is blasted open. Sandra is shot in the head by Michael, causing her to be jerked backward and the baby to be dropped, which is dived for and caught by Jeep. Out of the bright light steps Gabriel, a tall, muscular man with enormous black wings, and his wings are spread by him, swinging a mace down to the baby. Holding him, Jeep is rolled out of the way as a hole is slashed in the floor by the mace. At Gabriel is shot by Bob while the baby is given to Charlie by Jeep, and bullets are deflected by Gabriel, who spins with his wings wrapped around him. Bob's chest is sliced across by Gabriel, and his gun is dropped by Bob, his bloody chest is felt, before his face is swiped by Gabriel, throwing him onto a cooker. Some keys are given to Jeep by Michael, and to a door, Jeep, Charlie, and Audrey rush and it is opened by them, finding the possessed standing with their heads bowed, a walkway between them. A pistol is held by Jeep as he steps out, followed by the baby being held by Charlie, and Audrey, as the way is led by Jeep with his gun held out in front. The possessed are stood motionless with mist floating above their bowed heads, while in the diner Michael is faced by Gabriel, who slightly shakes his head. As Jeep, Charlie, and Audrey are walked between by the possessed, a figure with a bag over its head is reached, standing in front of the police car. In the diner, Michael is studied by Gabriel while the hood of the police car is wheezed and whacked with a stick by the figure with the bag over its head. The police car is gotten in by Jeep, Charlie, and Audrey as Gabriel is walked up to by Michael, and they are driven away by Jeep while right up to Gabriel, Michael steps, who him is studied. The wing mirror is kept an eye on by Jeep as away he drives. Against Gabriel's cheek is clasped Michael's hand, he is looked in the face by him, and Gabriel's eyes are moistened as down he looks, his lips moving as if words are being grasped for. Michael's hand is clutched by Gabriel and into his eyes is looked deeply before he is pushed away. An assault rifle is readied by Michael as out of Gabriel's mace are poked blades, and Gabriel's wings and his chest are spread by him, lunging towards Michael, who is shot at and out of the way is leaped by him."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "He stands, briefly grasps her shoulder, and walks away, while Charlie's brow furrows with anxiety. Mist drifts over the hands of the possessed outside, swaying beneath a full moon glowing between dark clouds. Something looms overhead, watching the diner as Bob and Jeep enter. Charlie stares at Michael, who approaches her, while Sandra grabs the baby and Michael aims his gun. Something descends toward the diner as Audrey, beside Charlie, shakes her head. Outside, light envelops the possessed, and intense white light bursts through the entrance as the door blasts open. Michael shoots Sandra in the head, making her drop the baby, which Jeep catches. Gabriel emerges from the bright light, a tall, muscular man with large black wings, swinging a mace at the baby. Jeep rolls away, avoiding the mace that gouges the floor. Bob shoots at Gabriel while Jeep hands the baby to Charlie, and Gabriel deflects bullets with his wings. Gabriel slashes Bob's chest, making him drop his gun, then swipes his face, throwing him onto a cooker. Michael gives Jeep keys, and Jeep, Charlie, and Audrey rush to a door, finding the possessed with bowed heads, a path between them. Jeep steps out with a pistol, followed by Charlie with the baby, and Audrey, leading with his gun. The possessed remain still, mist above their heads, while in the diner, Gabriel faces Michael, who slightly shakes his head. The possessed part as Jeep, Charlie, and Audrey pass, reaching a figure with a bag over its head by the police car. In the diner, Gabriel studies Michael while the bagged figure wheezes and hits the police car hood with a stick. Jeep, Charlie, and Audrey enter the police car as Michael approaches Gabriel, and Jeep drives away while Michael confronts Gabriel. Jeep watches the wing mirror as he drives. Michael touches Gabriel's cheek, looking into his eyes, which moisten as he looks down, lips moving silently. Gabriel grips Michael's hand, gazes deeply, then pushes him away. Michael readies his rifle as blades extend from Gabriel's mace, and Gabriel lunges with wings spread, as Michael shoots and leaps aside."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "He stands, touches her shoulder, and leaves, while Charlie anxiously frowns. Mist drifts over the possessed outside, swaying under a full moon. Something watches the diner as Bob and Jeep enter. Charlie stares at Michael, who approaches her, while Sandra grabs the baby and Michael aims a gun. Something descends as Audrey shakes her head beside Charlie. Light floods the possessed, and a bright light bursts through the entrance. Michael shoots Sandra, making her drop the baby, which Jeep catches. Gabriel emerges, a tall man with black wings, swinging a mace at the baby. Jeep rolls away, avoiding the mace. Bob shoots Gabriel, who deflects bullets with his wings. Gabriel injures Bob, who drops his gun. Michael gives Jeep keys, and Jeep, Charlie, and Audrey open a door, finding the possessed with bowed heads. Jeep leads with a pistol, followed by Charlie with the baby, and Audrey. The possessed remain still as mist floats above them. In the diner, Gabriel faces Michael, who shakes his head. The possessed part for Jeep, Charlie, and Audrey, who reach a hooded figure by a police car. Gabriel studies Michael while the hooded figure hits the car. Jeep, Charlie, and Audrey enter the car as Michael approaches Gabriel, and Jeep drives away. Michael touches Gabriel's cheek, and Gabriel's eyes moisten. Gabriel holds Michael's hand, then pushes him away. Michael readies his rifle as Gabriel lunges, and Michael shoots, dodging."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "He stands there for a moment, grasping her shoulder gently before turning and walking away, leaving Charlie with an anxious expression, her brow deeply furrowed with worry. Outside, a misty fog drifts over the hands of the hordes of possessed individuals who stand eerily, slowly rocking from side to side beneath the luminous glow of a full moon that peeks through the dark, ominous clouds. Something mysterious and foreboding hangs overhead, casting its gaze down upon the diner as Bob and Jeep make their entrance. Charlie remains standing, her eyes fixed on Michael, who slowly and deliberately steps towards her, while Sandra, in a moment of urgency, grabs the baby, and Michael raises his gun with intent. Suddenly, something swoops down towards the diner, and Audrey, standing beside Charlie, shakes her head in disbelief. Outside, a brilliant light washes over the possessed, and an intense, blinding white light floods through the entrance as the door bursts open with force. Michael fires his gun, shooting Sandra in the head, causing her to jerk backward violently and drop the baby, which Jeep dives to catch just in time. Emerging from the bright light is Gabriel, a tall and muscular figure with enormous, imposing black wings, who spreads them wide and swings a deadly mace down towards the baby. Jeep, holding the baby securely, rolls out of the way as the mace crashes down, slashing a gaping hole in the floor. Bob fires his gun at Gabriel, while Jeep hands the baby over to Charlie for safekeeping. Gabriel spins around, skillfully deflecting the bullets with his wings wrapped protectively around him. With a swift motion, Gabriel slices across Bob's chest, causing him to drop his gun and clutch his bloody chest in pain, before Gabriel swipes him across the face, sending him flying onto a cooker. Michael hands Jeep a set of keys, and Jeep, along with Charlie and Audrey, rushes to a door, opening it to find the possessed standing with their heads bowed, creating a narrow walkway between them. Jeep steps out cautiously, holding a pistol at the ready, followed closely by Charlie, who cradles the baby, and Audrey, as Jeep leads the way with his gun held out in front for protection. The possessed remain motionless, with mist swirling above their bowed heads, while inside the diner, Gabriel stands facing Michael, who shakes his head slightly in a gesture of defiance. The possessed part to the sides as Jeep, Charlie, and Audrey walk between them, eventually reaching a mysterious figure with a bag over its head, standing ominously in front of the police car. Inside the diner, Gabriel continues to study Michael intently, while the figure with the bag over its head wheezes and strikes the hood of the police car with a stick. Jeep, Charlie, and Audrey quickly get into the police car as Michael approaches Gabriel, and Jeep drives them away, glancing back in the wing mirror to keep an eye on the situation. Michael steps right up to Gabriel, who studies him closely, and Michael places his hand gently against Gabriel's cheek, looking him directly in the eyes. Gabriel's eyes moisten with emotion as he looks down, his lips moving as if searching for the right words. Gabriel clutches Michael's hand tightly, looking deep into his eyes before pushing him away. Michael readies his assault rifle as sharp blades extend from Gabriel's mace, and Gabriel spreads his wings and chest wide, lunging towards Michael, who fires his weapon and leaps out of the way just in time."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "He stands there for a brief yet poignant moment, gently grasping her shoulder with a reassuring touch before pivoting and walking away, leaving Charlie behind with an anxious expression clouding her face. Her brow is deeply furrowed with unmistakable worry. Outside, something almost otherworldly unfolds as a misty fog drifts lazily over the outstretched hands of the hordes of possessed individuals, who stand eerily still. They slowly rock from side to side beneath the eerie, luminous glow of a full moon, which bravely peeks through the dark, ominous clouds that dominate the sky. There is something mysterious and foreboding hanging in the air, an uneasy presence casting its gaze down upon the diner as Bob and Jeep make their cautious entrance. Inside, Charlie remains standing resolute, her eyes firmly fixed on Michael. He is slowly and deliberately stepping in her direction, while Sandra, seized by an urgent impulse, grabs the baby. Meanwhile, Michael raises his gun with clear intent. Suddenly, something swoops down swiftly towards the diner, and Audrey, who stands beside Charlie, shakes her head in utter disbelief. Outside, a brilliant light washes dramatically over the possessed, and an intense, blinding white light floods forcefully through the entrance as the door bursts open with tremendous force. In a swift action, Michael fires his gun, shooting Sandra directly in the head, causing her to jerk backward violently and drop the baby, which Jeep, with quick reflexes, dives to catch just in time. Emerging from the radiant, bright light is Gabriel, a tall and muscular figure adorned with enormous, imposing black wings. He spreads them wide, and with a menacing sweep, swings a deadly mace down towards the vulnerable baby. Jeep, holding the baby securely, performs a quick roll out of the way as the mace crashes down violently, slashing a gaping hole in the floor. Bob, without hesitation, fires his gun at Gabriel, while Jeep hands the baby over to Charlie for safekeeping. In a remarkable display of skill, Gabriel spins around expertly, deflecting the bullets with his wings wrapped protectively around his powerful frame. With a quick, fluid motion, Gabriel slices across Bob's chest, causing him to drop his gun and clutch his bloody chest in agony. Gabriel then swipes him across the face, sending him flying onto a cooker. Michael, realizing the urgency, hands Jeep a set of keys, and Jeep, along with Charlie and Audrey, rushes to a nearby door. They open it to find the possessed standing silently with their heads bowed, creating a narrow, tense walkway between them. Jeep steps out cautiously, holding a pistol at the ready, followed closely by Charlie, who cradles the baby lovingly, and Audrey. Together, they proceed as Jeep leads the way with his gun held out in front for protection. The possessed remain eerily motionless, with mist swirling ominously above their bowed heads. Inside the diner, Gabriel stands facing Michael, who shakes his head slightly in a defiant gesture. The possessed part respectfully to the sides as Jeep, Charlie, and Audrey carefully walk between them, eventually reaching a mysterious figure with a bag over its head, standing ominously in front of the police car. Inside the diner, Gabriel continues to study Michael intently, while the figure with the bag over its head wheezes and strikes the hood of the police car with an old stick. Jeep, Charlie, and Audrey quickly get into the police car as Michael approaches Gabriel steadily, and Jeep drives them away, glancing back in the wing mirror to keep an eye on the unfolding situation. Michael steps right up to Gabriel, who studies him closely, and in a tender moment, Michael places his hand gently against Gabriel's cheek, looking him directly in the eyes. Gabriel's eyes moisten with emotion as he looks down searchingly, his lips moving as if seeking the right words. Gabriel clutches Michael's hand tightly, gazing deep into his eyes before pushing him away. Michael readies his assault rifle with precision as sharp blades extend menacingly from Gabriel's mace. Gabriel then spreads his wings and chest wide with a powerful motion, lunging swiftly towards Michael, who fires his weapon and skillfully leaps out of the way just in time."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "He stands up from his position, reaching out to grasp her shoulder gently for a brief moment before turning and walking away, leaving Charlie with an anxious expression, her brow furrowed in worry. Outside, a mist drifts over the hands of the possessed, who stand in large numbers, slowly swaying from side to side under the eerie glow of a full moon that peeks through the dark clouds above. Overhead, something ominous looms, casting its gaze down upon the diner as Bob and Jeep make their entrance. Inside, Charlie remains fixed in place, her eyes locked on Michael, who begins to move towards her with deliberate slowness, while Sandra, in a sudden motion, grabs the baby, and Michael raises his gun with intent. As something descends rapidly towards the diner, Audrey, standing beside Charlie, shakes her head in disbelief or denial. Outside, a brilliant light floods over the possessed, and an intense white light bursts through the entrance as the door is violently blown open. In a swift, decisive action, Michael fires his gun, hitting Sandra in the head, causing her to jerk backward and release the baby, which Jeep quickly dives to catch, ensuring its safety. Emerging from the blinding light, Gabriel, a tall and muscular figure with enormous black wings, steps forward and unfurls his wings, swinging a mace down towards the baby. Jeep, holding the baby securely, rolls out of harm's way just as the mace crashes into the floor, leaving a gaping hole. Bob, reacting quickly, fires his gun at Gabriel, while Jeep hands the baby over to Charlie. Gabriel, with a fluid motion, spins around, using his wings as a shield to deflect the incoming bullets. In a swift, brutal move, Gabriel slashes across Bob's chest, causing him to drop his gun and clutch his bleeding wound, before delivering a powerful swipe across Bob's face, sending him crashing onto a cooker. Michael, assessing the situation, hands Jeep a set of keys, prompting Jeep, Charlie, and Audrey to rush towards a door, which they open to reveal the possessed standing with their heads bowed, creating a narrow path between them. Jeep steps out first, holding a pistol at the ready, followed closely by Charlie, who cradles the baby, and Audrey, as Jeep leads them forward with his gun poised for action. The possessed remain eerily still, with mist swirling above their bowed heads, while inside the diner, Gabriel stands facing Michael, who gives a slight shake of his head. As Jeep, Charlie, and Audrey make their way through the path, the possessed part to allow them passage, leading them to a figure with a bag over its head, positioned in front of a police car. Inside the diner, Gabriel continues to scrutinize Michael, while outside, the figure with the bag over its head wheezes and strikes the hood of the police car with a stick. Jeep, Charlie, and Audrey quickly get into the police car as Michael approaches Gabriel, and Jeep drives them away, casting a glance at the wing mirror to ensure their escape. Michael steps right up to Gabriel, placing his hand gently against Gabriel's cheek, looking him directly in the eyes, causing Gabriel's eyes to well up with emotion as he looks down, his lips moving as if searching for words. Gabriel, in a moment of connection, clutches Michael's hand, gazing deeply into his eyes before abruptly pushing him away. Michael, preparing for the confrontation, readies his assault rifle as sharp blades extend from Gabriel's mace, and Gabriel spreads his wings wide, his chest expanding as he lunges towards Michael, who fires his weapon and leaps out of the way to avoid the attack."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "He stands, briefly grasps her shoulder, and walks away, leaving Charlie anxiously watching. Outside, mist envelops the possessed as they sway under a full moon. Overhead, something ominous looms as Bob and Jeep enter the diner. Charlie watches Michael approach her, while Sandra grabs the baby and Michael aims his gun. As something descends toward the diner, Audrey, beside Charlie, shakes her head. A bright light floods the entrance, blasting the door open, and Michael shoots Sandra, causing her to drop the baby, which Jeep catches. Gabriel emerges from the light, a tall, muscular figure with black wings, and swings a mace at the baby. Jeep rolls away, avoiding the mace's impact on the floor. Bob fires at Gabriel, who deflects the bullets with his wings, then slashes Bob's chest and throws him onto a cooker. Michael hands Jeep some keys, and Jeep, Charlie, and Audrey rush to a door, finding the possessed standing with bowed heads, creating a path. Jeep leads them out, holding a pistol, followed by Charlie with the baby and Audrey. The possessed remain motionless as they pass, while inside, Gabriel faces Michael. The trio reaches a figure with a bag over its head by a police car. In the diner, Gabriel and Michael exchange a tense look. The bagged figure wheezes and strikes the police car hood. Jeep, Charlie, and Audrey get into the car as Michael approaches Gabriel, and they drive away. Michael clasps Gabriel's cheek, and Gabriel's eyes moisten as he looks down, struggling for words. Gabriel grips Michael's hand, gazes into his eyes, then pushes him away. Michael readies his assault rifle as Gabriel's mace extends blades, and Gabriel lunges with wings spread. Michael shoots and leaps aside."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "He stands, a tall figure known for his quiet resilience, grasps her shoulder for a moment, and walks away, while Charlie's brow is anxiously wrinkled, reflecting her deep concern about the unfolding events. Mist wafts over the hands of the hordes of possessed, beings overtaken by a mysterious force, standing outside as they slowly rock from side to side, beneath a full moon that glows between dark clouds, a natural phenomenon often linked to supernatural occurrences. Something ominous hangs overhead, looking down at the diner, an isolated establishment in the middle of nowhere, as Bob and Jeep walk in. Charlie stands staring at Michael, a celestial warrior with a hidden past, who slowly steps towards her, while Sandra, in her desperate attempt to protect, grabs the baby and Michael aims the gun with precision acquired through countless battles. Something, likely a demonic entity, flies down towards the diner as, standing beside Charlie, Audrey shakes her head in disbelief at the chaos unraveling. Outside, heavenly light washes over the possessed, and intense white light shines through the entrance as the door blasts open. Michael, with the weight of grim duty, shoots Sandra in the head, causing her to jerk backward and drop the baby, which Jeep dives and catches in a moment of heroic reflex. Gabriel steps out of the bright light, a tall, muscular man with enormous black wings, known throughout ancient texts as an archangel, and spreads his wings, swinging a mace down to the baby. Holding him, Jeep rolls out of the way as the mace slashes a hole in the floor, a testament to Gabriel's formidable strength. Bob, determined to protect, shoots at Gabriel while Jeep gives the baby to Charlie, and Gabriel spins swiftly, deflecting the bullets with his wings wrapped around him, a defensive maneuver. Gabriel slices across Bob's chest, and Bob drops his gun, feeling his bloody chest, before Gabriel swipes him across the face, throwing him onto a cooker, incapacitating him. Michael gives Jeep some keys, knowing they're the only chance for escape, and Jeep, Charlie, and Audrey rush to a door and open it, finding the possessed standing with their heads bowed, a walkway between them eerily inviting passage. Jeep steps out holding a pistol, his newfound courage guiding him, followed by Charlie holding the baby, and Audrey, as Jeep leads the way with his gun held out in front, determined to protect his companions. The possessed stand motionless with mist floating above their bowed heads, creating an eerie atmosphere, while in the diner, Gabriel stands facing Michael, who shakes his head slightly, a gesture loaded with unspoken history. The possessed step aside as Jeep, Charlie, and Audrey walk between them and reach a figure with a bag over its head, standing in front of the police car, a symbol of a world turned upside down. In the diner, Gabriel studies Michael with the intensity of a brotherly connection, while the figure with the bag over its head wheezes and whacks the hood of the police car with a stick, as if signaling something. Jeep, Charlie, and Audrey get in the police car, a vehicle representative of authority now serving as their escape, as Michael walks up to Gabriel, and Jeep drives them away, knowing time is of the essence, while Michael steps right up to Gabriel, who studies him with a reflective gaze. Jeep keeps his eye on the wing mirror as he drives away, watching for any signs of pursuit. Michael clasps his hand against Gabriel's cheek, a gesture of unexpected tenderness, looks him in the face, and Gabriel's eyes moisten as he looks down, his lips moving as if grasping for words of reconciliation. Gabriel clutches Michael's hand and looks deep into his eyes before pushing him away, signaling a conflicted farewell. Michael readies his assault rifle, a weapon of modern warfare, as blades poke out of Gabriel's mace, an ancient weapon, and Gabriel spreads his wings and his chest, lunging towards Michael, who shoots and leaps out of the way, a move honed by countless encounters."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "He stands grasps her shoulder for a moment and walks away while Charlie's brow is anxiously wrinkled  Mist wafts over the hands of the hordes of possessed standing outside as they slowly rock from side to side beneath a full moon that glows between dark clouds  Something hangs overhead looking down at the diner as Bob and Jeep walk in  Holding him Jeep rolls out of the way as the mace slashes a hole in the floor  Bob shoots at Gabriel while Jeep gives the baby to Charlie and Gabriel spins deflecting the bullets with his wings wrapped around him  Gabriel slices across Bob's chest and Bob drops his gun feeling his bloody chest before Gabriel swipes him across the face throwing him onto a cooker  Michael gives Jeep some keys and Jeep  Charlie and Audrey rush to a door and open it finding the possessed standing with their heads bowed a walkway between them  Jeep steps out holding a pistol followed by Charlie holding the baby and Audrey as Jeep leads the way with his gun held out in front  The possessed stand motionless with mist floating above their bowed heads  while in the diner  Gabriel stands facing Michael who shakes his head slightly  The possessed step aside as Jeep  Charlie and Audrey walk between them and reach a figure with a bag over its head standing in front of the police car  In the diner Gabriel studies Michael while the figure with the bag over its head wheezes and whacks the hood of the police car with a stick  Jeep  Charlie and Audrey get in the police car as Michael walks up to Gabriel and Jeep drives them away while Michael steps right up to Gabriel who studies him  Charlie stands staring at Michael who slowly steps towards her while Sandra grabs the baby and Michael aims the gun  Something flies down towards the diner as standing beside Charlie  Audrey shakes her head  Outside light washes over the possessed and intense white light shines through the entrance as the door blasts open  Michael shoots Sandra in the head causing her to jerk backward and drop the baby which Jeep dives and catches  Gabriel steps out of the bright light  a tall muscular man with enormous black wings and spreads his wings swinging a mace down to the baby  Holding him Jeep rolls out of the way as the mace slashes a hole in the floor  Bob shoots at Gabriel while Jeep gives the baby to Charlie and Gabriel spins deflecting the bullets with his wings wrapped around him  Gabriel slices across Bob's chest and Bob drops his gun feeling his bloody chest before Gabriel swipes him across the face throwing him onto a cooker  Michael gives Jeep some keys and Jeep  Charlie and Audrey rush to a door and open it finding the possessed standing with their heads bowed a walkway between them  Jeep steps out holding a pistol followed by Charlie holding the baby and Audrey as Jeep leads the way with his gun held out in front  The possessed stand motionless with mist floating above their bowed heads  while in the diner  Gabriel stands facing Michael who shakes his head slightly  The possessed step aside as Jeep  Charlie and Audrey walk between them and reach a figure with a bag over its head standing in front of the police car  In the diner Gabriel studies Michael while the figure with the bag over its head wheezes and whacks the hood of the police car with a stick  Jeep  Charlie and Audrey get in the police car as Michael walks up to Gabriel and Jeep drives them away while Michael steps right up to Gabriel who studies him  Jeep keeps his eye on the wing mirror as he drives away  Michael clasps his hand against Gabriel's cheek looks him in the face and Gabriel's eyes moisten as he looks down his lips moving as if grasping for words  Gabriel clutches Michael's hand and looks deep into his eyes before pushing him away  Michael readies his assault rifle as blades poke out of Gabriel's mace and Gabriel spreads his wings and his chest lunging towards Michael who shoots and leaps out of the way"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "He stands grasps her shoulder for a moment and walks away while Charlie's brow is anxiously wrinkled. Mist wafts over the hands of the hordes of possessed standing outside as they slowly rock from side to side beneath a full moon that glows between dark clouds. Something hangs overhead looking down at the diner as Bob and Jeep walk in. Charlie stands staring at Michael who slowly steps towards her while Sandra grabs the baby and Michael aims the gun. Something flies down towards the diner as standing beside Charlie. Audrey shakes her head. Outside light washes over the possessed and intense white light shines through the entrance as the door blasts open. Michael shoots Sandra in the head causing her to jerk backward and drop the baby which Jeep dives and catches. Gabriel steps out of the bright light. a tall muscular man with enormous black wings and spreads his wings swinging a mace down to the baby. Holding him Jeep rolls out of the way as the mace slashes a hole in the floor. Bob shoots at Gabriel while Jeep gives the baby to Charlie and Gabriel spins deflecting the bullets with his wings wrapped around him. Gabriel slices across Bob's chest and Bob drops his gun feeling his bloody chest before Gabriel swipes him across the face throwing him onto a cooker. Michael gives Jeep some keys and Jeep. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Charlie and Audrey rush to a door and open it finding the possessed standing with their heads bowed a walkway between them. Jeep steps out holding a pistol followed by Charlie holding the baby and Audrey as Jeep leads the way with his gun held out in front. The possessed stand motionless with mist floating above their bowed heads. while in the diner. Gabriel stands facing Michael who shakes his head slightly. The possessed step aside as Jeep. Charlie and Audrey walk between them and reach a figure with a bag over its head standing in front of the police car. In the diner Gabriel studies Michael while the figure with the bag over its head wheezes and whacks the hood of the police car with a stick. Jeep. Charlie and Audrey get in the police car as Michael walks up to Gabriel and Jeep drives them away while Michael steps right up to Gabriel who studies him. Jeep keeps his eye on the wing mirror as he drives away. Michael clasps his hand against Gabriel's cheek looks him in the face and Gabriel's eyes moisten as he looks down his lips moving as if grasping for words. Gabriel clutches Michael's hand and looks deep into his eyes before pushing him away. Michael readies his assault rifle as blades poke out of Gabriel's mace and Gabriel spreads his wings and his chest lunging towards Michael who shoots and leaps out of the way."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "He stands grasps her shoulder for a moment and walks away while Charlie's brow is anxiously wrinkled. Mist wafts over the hands of the hordes of possessed standing outside as they slowly rock from side to side beneath a full moon that glows between dark clouds. Something hangs overhead looking down at the diner as Bob and Jeep walk in. Charlie stands staring at Michael who slowly steps towards her while Sandra grabs the baby and Michael aims the gun. Something flies down towards the diner as standing beside Charlie. Audrey shakes her head. Outside light washes over the possessed and intense white light shines through the entrance as the door blasts open. Michael shoots Sandra in the head causing her to jerk backward and drop the baby which Jeep dives and catches. Gabriel steps out of the bright light. a tall muscular man with enormous black wings and spreads his wings swinging a mace down to the baby. Holding him Jeep rolls out of the way as the mace slashes a hole in the floor. Bob shoots at Gabriel while Jeep gives the baby to Charlie and Gabriel spins deflecting the bullets with his wings wrapped around him. Gabriel slices across Bob's chest and Bob drops his gun feeling his bloody chest before Gabriel swipes him across the face throwing him onto a cooker. Michael gives Jeep some keys and Jeep. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. Charlie and Audrey rush to a door and open it finding the possessed standing with their heads bowed a walkway between them. Jeep steps out holding a pistol followed by Charlie holding the baby and Audrey as Jeep leads the way with his gun held out in front. The possessed stand motionless with mist floating above their bowed heads. while in the diner. Gabriel stands facing Michael who shakes his head slightly. The possessed step aside as Jeep. Charlie and Audrey walk between them and reach a figure with a bag over its head standing in front of the police car. In the diner Gabriel studies Michael while the figure with the bag over its head wheezes and whacks the hood of the police car with a stick. Jeep. Charlie and Audrey get in the police car as Michael walks up to Gabriel and Jeep drives them away while Michael steps right up to Gabriel who studies him. Jeep keeps his eye on the wing mirror as he drives away. Michael clasps his hand against Gabriel's cheek looks him in the face and Gabriel's eyes moisten as he looks down his lips moving as if grasping for words. Gabriel clutches Michael's hand and looks deep into his eyes before pushing him away. Michael readies his assault rifle as blades poke out of Gabriel's mace and Gabriel spreads his wings and his chest lunging towards Michael who shoots and leaps out of the way."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "He stands grasps her shoulder for a moment and walks away while Charlie's brow is anxiously wrinkled. Mist wafts over the hands of the hordes of possessed standing outside as they slowly rock from side to side beneath a full moon that glows between dark clouds. Something hangs overhead looking down at the diner as Bob and Jeep walk in. Charlie stands staring at Michael who slowly steps towards her while Sandra grabs the baby and Michael aims the gun. Something flies down towards the diner as standing beside Charlie. Audrey shakes her head. Outside light washes over the possessed and intense white light shines through the entrance as the door blasts open. In the diner Gabriel studies Michael while the figure with the bag over its head wheezes and whacks the hood of the police car with a stick. Jeep. Charlie and Audrey get in the police car as Michael walks up to Gabriel and Jeep drives them away while Michael steps right up to Gabriel who studies him. Jeep keeps his eye on the wing mirror as he drives away. Michael clasps his hand against Gabriel's cheek looks him in the face and Gabriel's eyes moisten as he looks down his lips moving as if grasping for words. Gabriel clutches Michael's hand and looks deep into his eyes before pushing him away. Michael readies his assault rifle as blades poke out of Gabriel's mace and Gabriel spreads his wings and his chest lunging towards Michael who shoots and leaps out of the way."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "He stands grasps her shoulder for a moment and walks away while Charlie's brow is anxiously wrinkled. Mist wafts over the hands of the hordes of possessed standing outside as they slowly rock from side to side beneath a full moon that glows between dark clouds. Something hangs overhead looking down at the diner as Bob and Jeep walk in. Michael clasps his hand against Gabriel's cheek looks him in the face and Gabriel's eyes moisten as he looks down his lips moving as if grasping for words. Gabriel clutches Michael's hand and looks deep into his eyes before pushing him away. Michael readies his assault rifle as blades poke out of Gabriel's mace and Gabriel spreads his wings and his chest lunging towards Michael who shoots and leaps out of the way."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The dog stands, grasps a tree for a moment, and walks away, while the kitten's brow is anxiously wrinkled. Mist wafts over the hands of the armies of possessed standing outside as they slowly rock from side to side, beneath a full moon that glows between dark clouds. A squirrel hangs overhead, looking down at the diner as the penguin and the giraffe walk in. The kitten stands staring at the dolphin, who slowly steps towards a tree, while the rabbit grabs the baby and the dolphin aims the gun. A ghost flies down towards the diner as, standing beside the kitten, the turtle shakes its head. Outside, light washes over the possessed, and intense white light shines through the entrance as the door blasts open. The dolphin shoots the rabbit in the head, causing her to jerk backward and drop the baby, which the giraffe dives and catches. The elephant steps out of the bright light, a tall, muscular man with enormous black wings, and spreads his wings, swinging a mace down to the baby. Holding him, the giraffe rolls out of the way as the mace slashes a hole in the floor. The penguin shoots at the elephant while the giraffe gives the baby to the kitten, and the elephant spins, deflecting the bullets with his wings wrapped around him. The elephant slices across the penguin's chest, and the penguin drops his gun, feeling his bloody chest, before the elephant swipes him across the face, throwing him onto a cooker. The dolphin gives the giraffe some keys, and the giraffe, the kitten, and the turtle rush to a door and open it, finding the possessed standing with their heads bowed, a walkway between them. The giraffe steps out holding a pistol, followed by the kitten holding the baby, and the turtle, as the giraffe leads the way with his gun held out in front. The possessed stand motionless with mist floating above their bowed heads, while in the diner, the elephant stands facing the dolphin, who shakes his head slightly. The possessed step aside as the giraffe, the kitten, and the turtle walk between them and reach a figure with a bag over its head, standing in front of the police car. In the diner, the elephant studies the dolphin while the figure with the bag over its head wheezes and whacks the hood of the police car with a stick. The giraffe, the kitten, and the turtle get in the police car as the dolphin walks up to the elephant, and the giraffe drives them away while the dolphin steps right up to the elephant, who studies him. The giraffe keeps his eye on the wing mirror as he drives away. The dolphin clasps his hand against the elephant's cheek, looks him in the face, and the elephant's eyes moisten as he looks down, his lips moving as if grasping for words. The elephant clutches the dolphin's hand and looks deep into his eyes before pushing him away. The dolphin readies his assault rifle as blades poke out of the elephant's mace, and the elephant spreads his wings and his chest, lunging towards the dolphin, who shoots and leaps out of the way."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "He stands, grasps her elbow for a moment, and walks away, while Charlie's brow is anxiously furrowed. Fog drifts over the fingers of the mob of enchanted standing outside as they slowly sway from side to side, beneath a glowing lantern that hovers between dark canopies. Something hangs overhead, looking down at the bakery as Bob and Jeep walk in. Charlie stands staring at Michael, who slowly steps towards her, while Sandra grabs the kitten and Michael aims the crossbow. Something swoops down towards the bakery as, standing beside Charlie, Audrey shakes her head. Outside, rays wash over the enchanted, and intense blue light shines through the entrance as the door bursts open. Michael shoots Sandra in the elbow, causing her to stagger backward and drop the kitten, which Jeep dives and catches. Gabriel steps out of the radiant glow, a tall, muscular man with enormous bronze wings, and spreads his wings, swinging a spear down to the kitten. Holding him, Jeep rolls out of the way as the spear carves a hole in the floor. Bob shoots at Gabriel while Jeep gives the kitten to Charlie, and Gabriel spins, deflecting the bullets with his wings wrapped around him. Gabriel slashes across Bob's chest, and Bob drops his spear, feeling his bloody chest, before Gabriel swipes him across the face, throwing him onto a countertop. Michael gives Jeep some tokens, and Jeep, Charlie, and Audrey rush to a door and open it, finding the enchanted standing with their heads bowed, a path between them. Jeep steps out holding a torch, followed by Charlie holding the kitten, and Audrey, as Jeep leads the way with his torch held out in front. The enchanted stand motionless with fog swirling above their bowed heads, while in the bakery, Gabriel stands facing Michael, who shakes his head slightly. The enchanted step aside as Jeep, Charlie, and Audrey walk between them and reach a figure with a mask over its head, standing in front of the fire truck. In the bakery, Gabriel studies Michael while the figure with the mask over its head wheezes and taps the hood of the fire truck with a rod. Jeep, Charlie, and Audrey get in the fire truck as Michael walks up to Gabriel, and Jeep drives them away while Michael steps right up to Gabriel, who studies him. Jeep keeps his eye on the side mirror as he drives away. Michael clasps his hand against Gabriel's shoulder, looks him in the face, and Gabriel's eyes glisten as he looks down, his lips moving as if grasping for words. Gabriel clutches Michael's hand and looks deep into his eyes before pushing him away. Michael readies his slingshot as blades poke out of Gabriel's spear, and Gabriel spreads his wings and his chest, lunging towards Michael, who shoots and leaps out of the way."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "He sits, pats her shoulder for a moment, and skips away, while Charlie's brow is anxiously furrowed. Mist drifts over the hands of the hordes of possessed standing outside as they slowly sway from side to side, beneath a full moon that shimmers between dark clouds. Something hovers overhead, gazing down at the diner as Bob and Jeep stroll in. Charlie stands staring at Michael, who slowly advances towards her, while Sandra lifts the baby and Michael points the gun. Something plummets down towards the diner as, standing beside Charlie, Audrey nods her head. Outside, light spills over the possessed, and intense white light beams through the entrance as the door shatters open. Michael punches Sandra in the head, causing her to jerk backward and toss the baby, which Jeep lunges and catches. Gabriel steps out of the bright light, a tall, muscular man with enormous black wings, and stretches his wings, sweeping a mace down to the baby. Holding him, Jeep jumps out of the way as the mace crushes a hole in the floor. Bob swings at Gabriel while Jeep hands the baby to Charlie, and Gabriel twirls, shielding the bullets with his wings wrapped around him. Gabriel carves across Bob's chest, and Bob drops his weapon, clutching his bloody chest, before Gabriel taps him across the face, launching him onto a cooker. Michael hands Jeep some keys, and Jeep, Charlie, and Audrey hurry to a door and unlock it, finding the possessed standing with their heads lowered, a pathway between them. Jeep steps out holding a shotgun, followed by Charlie holding the baby, and Audrey, as Jeep guides the way with his gun aimed in front. The possessed stand immobile with mist swirling above their lowered heads, while in the diner, Gabriel stands observing Michael, who nods his head slightly. The possessed shuffle aside as Jeep, Charlie, and Audrey move between them and approach a figure with a bag over its head, standing in front of the police car. In the diner, Gabriel examines Michael while the figure with the bag over its head coughs and taps the hood of the police car with a stick. Jeep, Charlie, and Audrey enter the police car as Michael approaches Gabriel, and Jeep speeds them away while Michael steps right up to Gabriel, who examines him. Jeep keeps his eye on the wing mirror as he speeds away. Michael brushes his hand against Gabriel's cheek, glances him in the face, and Gabriel's eyes glisten as he glances down, his lips moving as if searching for words. Gabriel grips Michael's hand and glances deep into his eyes before shoving him away. Michael lifts his assault rifle as blades extend out of Gabriel's mace, and Gabriel unfolds his wings and his chest, diving towards Michael, who fires and springs out of the way."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "It hovers, clasps its antenna for a moment, and floats away, while the chair's leg is nervously bent. Fog rolls over the elbows of the gazebos of enchanted parked outside as they slowly sway from toe to toe, beneath a crescent sun that hums between bright balloons. Anything hangs overhead, peering down at the library as the rabbit and stapler float in. The chair hovers gazing at the teapot, who slowly glides towards it, while the curtain snatches the robot and the teapot points the arrow. Anything soars down towards the library as, hovering beside the chair, the pencil nods its lid. Outdoors, dimness floods over the enchanted, and radiant purple dimness streams through the driveway as the window swings open. The teapot hurls the curtain in the lid, causing it to skip northward and drop the robot, which the stapler bounces and snags. The kite floats out of the dim light, a short, slender clover with tiny gray shoes, and folds its shoes, swinging a trumpet down to the robot. Lifting it, the stapler spins out of the path as the trumpet slices a crack in the ground. The rabbit hurls at the kite while the stapler gives the robot to the chair, and the kite twirls, deflecting the oranges with its shoes folded around it. The kite pierces along the rabbit's toe, and the rabbit drops its arrow, sensing its luscious toe, before the kite flicks it along the mouth, flinging it onto a pencil. The teapot gives the stapler some tiles, and the stapler, the chair, and the pencil scurry to a drawer and swing it, discovering the enchanted parked with their toes lifted, a hallway under them. The stapler floats in clutching a spoon, followed by the chair clutching the robot, and the pencil, as the stapler shows the trail with its spoon lifted out in back. The enchanted park motionlessly with fog drifting beneath their lifted toes, while in the library, the kite floats facing the teapot, who nods its lid gently. The enchanted park apart as the stapler, the chair, and the pencil float under them and find an animal with a box over its lid, parked beside the fire truck. In the library, the kite observes the teapot while the animal with the box over its lid coughs and taps the roof of the fire truck with a twig. The stapler, the chair, and the pencil hop in the fire truck as the teapot hovers up to the kite, and the stapler maneuvers them away while the teapot floats right up to the kite, who ponders it. The stapler keeps its nail on the beak mirror as it maneuvers away. The teapot grips its knob against the kite's nose, ponders it in the eyes, and the kite's toes moisten as it peers upward, its lids shifting as if seizing for notes. The kite grasps the teapot's knob and peers far into its eyes before shoving it away. The teapot steadies its net as strings peek out of the kite's trumpet, and the kite extends its shoes and its toe, lunging upon the teapot, who hurls and glides out of the path."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "She towers, nudges his knee for a second, and skips away, while Dave's fingers are nervously tapping. Fog drifts over the feet of the multitudes of enchanted kneeling inside as they gently sway from front to back, beneath a crescent moon that beams between light clouds. Someone hovers underneath, peering up at the restaurant as Alice and John tiptoe out. Dave glances at Sarah, who lazily crawls toward him, while Nancy releases the cat and Sarah tosses the rope. Someone drifts up from the restaurant as, standing behind Dave, Bella nods her head. Inside, shadow shimmers over the enchanted, and dim yellow light glitters through the window as the wall cracks open. Sarah hurls Nathan onto the floor, causing him to spin sideways and lift the cat, which John lunges and grabs. Max glides into the dim light, a short, slender woman with tiny red wings, and folds her wings, swinging a lance up to the cat. Cradling it, John tumbles into the corner as the lance pierces a gap in the ceiling. Alice throws at Max while John hands the cat to Dave, and Max twirls, blocking the arrows with her wings stretched outwards. Max thrusts across Alice's shoulder, and Alice releases her bow, feeling her bruised shoulder, before Max taps her on the arm, dragging her onto a sofa. Sarah passes John a map, and John, Dave, and Bella dash to a window and close it, seeing the enchanted kneeling with their eyes closed, a path behind them. John tiptoes in waving a lantern, followed by Dave cradling the cat, and Bella, as John points the way with his lantern held up high. The enchanted kneel quietly with fog hanging beneath their closed eyes, while in the restaurant, Max glances at Sarah, who nods slightly. The enchanted kneel together as John, Dave, and Bella shuffle among them and discover a guide with a helmet over its head, kneeling behind the car. In the restaurant, Max examines Sarah while the guide with the helmet over its head whistles and ticks the door of the car with a cane. John, Dave, and Bella clamber into the car as Sarah prances up to Max, and John speeds them away while Sarah strolls close to Max, who assesses her. John keeps his focus on the rear window as he speeds away. Sarah presses her palm against Max's shoulder, gazes her in the eyes, and Max's lips tremble as she peers up, her fingers twitching as if struggling for conviction. Max squeezes Sarah's palm and gazes deep into her soul before drawing her nearer. Sarah prepares her slingshot as nails emerge out of Max's lance, and Max flutters her wings and her back, lunging toward Sarah, who dodges and bounds out of reach."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "He stands, pats her knee for a moment, and skips away, while Charlie's brow is anxiously furrowed. Fog blows over the feet of the crowds of enchanted waiting indoors as they gently sway from back to front, beneath a crescent moon that flickers through scattered stars. Something floats underneath, glancing up at the café as Bob and Jeep hop in. Charlie stands staring at Michael, who lazily drifts toward her, while Sandra lifts the kitten and Michael swings the bat. Something glides up from beneath the café as, sitting beside Charlie, Audrey nods her head. Inside, sound echoes around the enchanted, and a bright blue glow beams under the entrance as the window slides open. Michael tosses Sandra in the shoulder, causing her to spin sideways and release the kitten, which Jeep jumps and snatches. Gabriel steps into the dull glow, a tall, slender man with enormous white wings, and stretches his wings, hurling a spear towards the kitten. Holding it, Jeep rolls to the side as the spear carves a gap in the ceiling. Bob throws a rock at Gabriel while Jeep hands the kitten to Charlie, and Gabriel swivels, deflecting the stones with his wings wrapped around him. Gabriel slashes across Bob's arm, and Bob drops his rock, clutching his cut arm, before Gabriel nudges him on the elbow, tossing him into a bookshelf. Michael hands Jeep some dice, and Jeep, Charlie, and Audrey scamper to a window and close it, finding the enchanted sitting with their hands folded, a bridge between them. Jeep steps out gripping a shovel, followed by Charlie carrying the kitten, and Audrey, as Jeep leads the way with his shovel raised high. The enchanted sit silently with fog wafting beneath their folded hands, while in the café, Gabriel stands turning from Michael, who shakes his head slowly. The enchanted open space as Jeep, Charlie, and Audrey stroll past them and reach a statue with a scarf over its head, standing behind the fire engine. In the café, Gabriel analyzes Michael while the statue with the scarf over its head coughs and taps the roof of the fire engine with a feather. Jeep, Charlie, and Audrey climb into the fire engine as Michael wanders away from Gabriel, and Jeep steers them away while Michael steps back from Gabriel, who considers him. Jeep keeps his eye on the dashboard mirror as he speeds away. Michael places his palm against Gabriel's shoulder, looks him in the eyes, and Gabriel's eyes glisten as he glances away, his lips trembling as if searching for words. Gabriel grips Michael's palm and looks deeply into his eyes before shoving him aside. Michael prepares his water gun as spikes extend out of Gabriel's spear, and Gabriel stretches his wings and his torso, lunging away from Michael, who sprays and darts aside."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "The cat sits, taps his ear for a second, and skips along, while Max's nose is lazily twitched. Fog drifts above the tails of the flock of cheerful grazing within as they gently sway back and forth, under a crescent sun that flickers between pale stars. Someone floats underneath, peering up at the bakery as Sam and Kite hop out. Max lounges gawking at Jordan, who quickly saunters towards him, while Lisa snatches the kitten and Jordan brandishes the bow. Someone swoops up towards the bakery as, sitting beside Max, Angie shrugs her shoulders. Inside, shadow drips over the cheerful, and dim pink shadow glimmers through the exit as the window bursts shut. Jordan tosses Lisa in the foot, prompting her to leap forward and toss the kitten, which Kite bounces and grabs. Apollo drifts into the dim shadow, a short, lean girl with tiny white feathers, and folds her feathers, flipping a violin up to the kitten. Hugging him, Kite slides into the air as the violin tears open a ceiling in the roof. Sam tosses at Apollo while Kite hands the kitten to Max, and Apollo twirls, bouncing the arrows with her feathers folded around her. Apollo scrapes across Sam's back, and Sam tosses his arrow, rubbing his clear back, before Apollo nudges him across the toes, flipping him onto a blanket. Jordan hands Kite two cups, and Kite, Max, and Angie dash to a ceiling and close it, discovering the cheerful grazing with their feet raised, a driveway beside them. Kite leaps in waving a slingshot, trailed by Max cradling the kitten, and Angie, as Kite dances the path with his slingshot hidden below his chest. The cheerful graze motionless with smoke spinning below their raised feet, while in the bakery, Apollo sits turning from Jordan, who nods his shoulders silently. The cheerful step together as Kite, Max, and Angie skip beside them and reach a creature with a scarf below its toe, sitting in front of the fire truck. In the bakery, Apollo examines Jordan while the creature with the scarf below its toe coughs and slaps the brake of the fire truck with a branch. Kite, Max, and Angie jump in the fire truck as Jordan stands down to Apollo, and Kite lifts them towards while Jordan strolls left down to Apollo, who watches him. Kite turns his nose on the steering wheel as he lifts towards. Jordan presses his elbow against Apollo's foot, stares her in the mouth, and Apollo's ears dry as she stares up, her teeth moving as if reaching for tunes. Apollo hugs Jordan's elbow and stares soft into his ears before hugging him away. Jordan holds his fishing rod as ropes stick into Apollo's violin, and Apollo folds her feathers and her back, sliding away from Jordan, who tosses and crawls into the air."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Michael stands, briefly touches Charlie's shoulder, and walks away as mist envelops the possessed outside the diner. Inside, tension escalates as Bob and Jeep enter. Michael approaches Charlie, and Sandra grabs the baby before being shot by Michael. Jeep catches the baby, and Gabriel emerges from bright light, wielding a mace. As Jeep evades Gabriel, Bob shoots at Gabriel, who deflects bullets with his wings. Gabriel injures Bob, and Michael hands Jeep keys to escape. Jeep, Charlie, and Audrey leave, encountering motionless possessed outside. In the diner, Michael faces Gabriel, who shows emotion before pushing Michael away. Gabriel attacks, and Michael dodges while Jeep drives away, keeping an eye on the rearview mirror."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Michael readies his assault rifle as blades poke out of Gabriel's mace and Gabriel spreads his wings and his chest lunging towards Michael who shoots and leaps out of the way Gabriel clutches Michael's hand and looks deep into his eyes before pushing him away  Michael clasps his hand against Gabriel's cheek looks him in the face and Gabriel's eyes moisten as he looks down his lips moving as if grasping for words  Jeep keeps his eye on the wing mirror as he drives away  Charlie and Audrey get in the police car as Michael walks up to Gabriel and Jeep drives them away while Michael steps right up to Gabriel who studies him  Jeep  In the diner Gabriel studies Michael while the figure with the bag over its head wheezes and whacks the hood of the police car with a stick  Charlie and Audrey walk between them and reach a figure with a bag over its head standing in front of the police car  The possessed step aside as Jeep  Gabriel stands facing Michael who shakes his head slightly  while in the diner  The possessed stand motionless with mist floating above their bowed heads  Jeep steps out holding a pistol followed by Charlie holding the baby and Audrey as Jeep leads the way with his gun held out in front  Charlie and Audrey rush to a door and open it finding the possessed standing with their heads bowed a walkway between them  Michael gives Jeep some keys and Jeep  Gabriel slices across Bob's chest and Bob drops his gun feeling his bloody chest before Gabriel swipes him across the face throwing him onto a cooker  Bob shoots at Gabriel while Jeep gives the baby to Charlie and Gabriel spins deflecting the bullets with his wings wrapped around him  Holding him Jeep rolls out of the way as the mace slashes a hole in the floor  a tall muscular man with enormous black wings and spreads his wings swinging a mace down to the baby  Gabriel steps out of the bright light  Michael shoots Sandra in the head causing her to jerk backward and drop the baby which Jeep dives and catches  Outside light washes over the possessed and intense white light shines through the entrance as the door blasts open  Audrey shakes her head  Something flies down towards the diner as standing beside Charlie  Charlie stands staring at Michael who slowly steps towards her while Sandra grabs the baby and Michael aims the gun  Something hangs overhead looking down at the diner as Bob and Jeep walk in  Mist wafts over the hands of the hordes of possessed standing outside as they slowly rock from side to side beneath a full moon that glows between dark clouds  He stands grasps her shoulder for a moment and walks away while Charlie's brow is anxiously wrinkled "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Jeep  a tall muscular man with enormous black wings and spreads his wings swinging a mace down to the baby  Michael shoots Sandra in the head causing her to jerk backward and drop the baby which Jeep dives and catches  Gabriel stands facing Michael who shakes his head slightly  In the diner Gabriel studies Michael while the figure with the bag over its head wheezes and whacks the hood of the police car with a stick  He stands grasps her shoulder for a moment and walks away while Charlie's brow is anxiously wrinkled  Michael clasps his hand against Gabriel's cheek looks him in the face and Gabriel's eyes moisten as he looks down his lips moving as if grasping for words  Charlie and Audrey walk between them and reach a figure with a bag over its head standing in front of the police car  Audrey shakes her head  Michael readies his assault rifle as blades poke out of Gabriel's mace and Gabriel spreads his wings and his chest lunging towards Michael who shoots and leaps out of the way Jeep steps out holding a pistol followed by Charlie holding the baby and Audrey as Jeep leads the way with his gun held out in front  Michael gives Jeep some keys and Jeep  Gabriel clutches Michael's hand and looks deep into his eyes before pushing him away  The possessed stand motionless with mist floating above their bowed heads  while in the diner  Charlie and Audrey rush to a door and open it finding the possessed standing with their heads bowed a walkway between them  Mist wafts over the hands of the hordes of possessed standing outside as they slowly rock from side to side beneath a full moon that glows between dark clouds  Gabriel steps out of the bright light  The possessed step aside as Jeep  Bob shoots at Gabriel while Jeep gives the baby to Charlie and Gabriel spins deflecting the bullets with his wings wrapped around him  Charlie and Audrey get in the police car as Michael walks up to Gabriel and Jeep drives them away while Michael steps right up to Gabriel who studies him  Gabriel slices across Bob's chest and Bob drops his gun feeling his bloody chest before Gabriel swipes him across the face throwing him onto a cooker  Something hangs overhead looking down at the diner as Bob and Jeep walk in  Charlie stands staring at Michael who slowly steps towards her while Sandra grabs the baby and Michael aims the gun  Holding him Jeep rolls out of the way as the mace slashes a hole in the floor  Jeep keeps his eye on the wing mirror as he drives away  Outside light washes over the possessed and intense white light shines through the entrance as the door blasts open  Something flies down towards the diner as standing beside Charlie "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Charlie and Audrey rush to a door and open it finding the possessed standing with their heads bowed a walkway between them  Jeep steps out holding a pistol followed by Charlie holding the baby and Audrey as Jeep leads the way with his gun held out in front  The possessed stand motionless with mist floating above their bowed heads  while in the diner  Gabriel stands facing Michael who shakes his head slightly  The possessed step aside as Jeep  Charlie and Audrey walk between them and reach a figure with a bag over its head standing in front of the police car  In the diner Gabriel studies Michael while the figure with the bag over its head wheezes and whacks the hood of the police car with a stick  Jeep  Charlie and Audrey get in the police car as Michael walks up to Gabriel and Jeep drives them away while Michael steps right up to Gabriel who studies him  Jeep keeps his eye on the wing mirror as he drives away  Michael clasps his hand against Gabriel's cheek looks him in the face and Gabriel's eyes moisten as he looks down his lips moving as if grasping for words  Gabriel clutches Michael's hand and looks deep into his eyes before pushing him away  Michael readies his assault rifle as blades poke out of Gabriel's mace and Gabriel spreads his wings and his chest lunging towards Michael who shoots and leaps out of the way He stands grasps her shoulder for a moment and walks away while Charlie's brow is anxiously wrinkled  Mist wafts over the hands of the hordes of possessed standing outside as they slowly rock from side to side beneath a full moon that glows between dark clouds  Something hangs overhead looking down at the diner as Bob and Jeep walk in  Charlie stands staring at Michael who slowly steps towards her while Sandra grabs the baby and Michael aims the gun  Something flies down towards the diner as standing beside Charlie  Audrey shakes her head  Outside light washes over the possessed and intense white light shines through the entrance as the door blasts open  Michael shoots Sandra in the head causing her to jerk backward and drop the baby which Jeep dives and catches  Gabriel steps out of the bright light  a tall muscular man with enormous black wings and spreads his wings swinging a mace down to the baby  Holding him Jeep rolls out of the way as the mace slashes a hole in the floor  Bob shoots at Gabriel while Jeep gives the baby to Charlie and Gabriel spins deflecting the bullets with his wings wrapped around him  Gabriel slices across Bob's chest and Bob drops his gun feeling his bloody chest before Gabriel swipes him across the face throwing him onto a cooker  Michael gives Jeep some keys and Jeep "
        }
      ]
    }
  ]
}