{
  "ground_truth": "The man talks to Estevez, then he drops them. He stares at the cops and complies as Estevez steps up to cuff him, but is spun around and used as a shield. Burton convulses and dances on the spot as they shake. Lights flicker, and his eyes are staring with a tight face. Burton shoots Estevez. Michael leaps to the ground, moves over, and shoots Burton with two handguns. Michael places his two guns in the bags, takes them to the police car, and drives off in it. Burton's body lies on the sidewalk. The squad car, identified by the number 1127 on its roof, drives past buildings with lights shutting off as he passes. A guy in his late 20s wakes with a start, looks around, switches on a light, and is on a chair. A small television is to his left. He comes out of a two-door trailer, shuts the door, and in the early morning light, walks away from the big gray trailer, passing under two strings of light bulbs with his hands stuffed in his jacket pockets. The green neon lights of the sign illuminate his features. Jeep turns back to the trailer, and she is pregnant. They sit on the swings facing in opposite directions, Charlie's belly very swollen, and Jeep wears a hangdog expression. He nods, she stares at him out of the corner of her eyes, then looks away. She rises from the swing, walks behind him, resting her hand momentarily on his shoulder before continuing on her way back to the trailer. He remains on the swing and doesn't move as she goes back inside through the second door. Jeep's father, Bob, keeps thumping the TV set inside the Paradise Falls diner and plays with a lighter. His chef is a tall, bald black guy who wears a crucifix and a couple of dog tags around his neck and has a hook for a left hand. A skimpily dressed young woman leans over a jukebox, and a woman at a table with a man stares at her and grunts. The man glances round and makes a move. Bob turns, as does Audrey, and Howard turns to wife Sandra. A guy in an SUV drives along a deserted freeway with a half-smoked cigarette in his mouth, wearing a brown beanie hat, a scarf around his neck, and a casual jacket. It's a sunny morning as he stubs out his cigarette, picks up his cellphone, and looks at it. He sees a sign for Paradise Falls, unfolds a map to study it, then lowers it and sees the diner up ahead. He pulls up in the forecourt and sees Charlie standing by a phone box, smoking a cigarette.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "The gentleman converses with Estevez, then he lets them fall. He gazes at the officers and obeys as Estevez advances to restrain him, but is turned around and utilized as a barrier. Burton convulses and gyrates on the spot as they quiver. Lights flutter, and his eyes are gazing with a taut visage. Burton fires at Estevez. Michael descends to the floor, maneuvers over, and fires at Burton with two pistols. Michael places his two pistols in the satchels, transports them to the police automobile, and departs in it. Burton's corpse lies on the footpath. The patrol vehicle, marked by the numeral 1127 on its roof, drives past edifices with lights turning off as he passes. A fellow in his late 20s awakens with a start, glances around, activates a lamp, and is on a chair. A small television is to his left. He emerges from a two-door trailer, closes the door, and in the early morning light, walks away from the large gray trailer, passing beneath two strands of light bulbs with his hands hidden in his jacket pockets. The green neon lights of the sign illuminate his visage. Jeep turns back to the trailer, and she is expectant. They repose on the swings facing in opposing directions, Charlie's belly very distended, and Jeep wears a dejected expression. He nods, she gazes at him out of the corner of her eyes, then looks away. She rises from the swing, walks behind him, resting her hand briefly on his shoulder before continuing on her way back to the trailer. He remains on the swing and doesn't move as she goes back inside through the second door. Jeep's father, Bob, keeps tapping the TV set inside the Paradise Falls eatery and fiddles with a lighter. His cook is a tall, bald black man who wears a crucifix and a couple of dog tags around his neck and has a hook for a left hand. A scantily dressed young woman leans over a jukebox, and a woman at a table with a man gazes at her and grumbles. The man glances around and makes a move. Bob turns, as does Audrey, and Howard turns to spouse Sandra. A dude in an SUV drives along a deserted expressway with a half-smoked cigarette in his mouth, wearing a brown beanie cap, a scarf around his neck, and a casual jacket. It's a sunny morning as he stubs out his cigarette, picks up his cellphone, and looks at it. He sees a sign for Paradise Falls, unfolds a chart to study it, then lowers it and sees the diner up ahead. He pulls up in the forecourt and sees Charlie standing by a phone booth, smoking a cigarette."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Estevez is talked to by the man, then they are dropped by him. The cops are stared at by him, and he complies as Estevez steps up to cuff him, but he spins around and uses him as a shield. Burton convulses and dances on the spot as they shake. Lights flicker, and his eyes stare with a tight face. Estevez is shot by Burton. The ground is leaped onto by Michael, who moves over and shoots Burton with two handguns. Two guns are placed in the bags by Michael, who takes them to the police car and drives off in it. The sidewalk is lied on by Burton's body. Buildings are driven past by the squad car, identified by the number 1127 on its roof, with lights shutting off as he passes. A guy in his late 20s wakes with a start, looks around, switches on a light, and sits on a chair. A small television is to his left. He comes out of a two-door trailer, shuts the door, and in the early morning light, walks away from the big gray trailer, passing under two strings of light bulbs with his hands stuffed in his jacket pockets. His features are illuminated by the green neon lights of the sign. The trailer is turned back to by Jeep, and she is pregnant. The swings are sat on by them, facing in opposite directions, with Charlie's belly very swollen, and Jeep wears a hangdog expression. He nods, and she stares at him out of the corner of her eyes, then looks away. The swing is risen from by her, she walks behind him, resting her hand momentarily on his shoulder before continuing on her way back to the trailer. The swing is remained on by him, and he doesn't move as she goes back inside through the second door. The TV set inside the Paradise Falls diner is thumped by Jeep's father, Bob, and he plays with a lighter. A crucifix and a couple of dog tags are worn around his neck by his tall, bald black chef who has a hook for a left hand. A jukebox is leaned over by a skimpily dressed young woman, and a woman at a table with a man stares at her and grunts. A glance is given and a move is made by the man. Bob turns, as does Audrey, and Sandra is turned to by Howard. A guy in an SUV drives along a deserted freeway with a half-smoked cigarette in his mouth, wearing a brown beanie hat, a scarf around his neck, and a casual jacket. It's a sunny morning as he stubs out his cigarette, picks up his cellphone, and looks at it. A sign for Paradise Falls is seen by him, and he unfolds a map to study it, then lowers it and sees the diner up ahead. The forecourt is pulled up in by him, and Charlie is seen standing by a phone box, smoking a cigarette."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "The man talks to Estevez, then drops them. He complies as Estevez cuffs him but is spun around and used as a shield. Burton convulses, lights flicker, and his eyes stare tightly. Burton shoots Estevez. Michael leaps, shoots Burton with two guns, places them in bags, and drives off in a police car. Burton's body lies on the sidewalk. The squad car, numbered 1127, passes buildings with lights shutting off. A guy in his late 20s wakes, switches on a light, and sits on a chair. A small TV is to his left. He exits a two-door trailer, walks away in the early morning, passing under light bulbs with hands in his jacket pockets. Green neon lights illuminate his features. Jeep turns back to the trailer, and she is pregnant. They sit on swings facing opposite directions, Charlie's belly swollen, and Jeep looks dejected. He nods, she glances at him, then looks away. She rises, walks behind him, touches his shoulder, and returns to the trailer. He remains on the swing as she enters through the second door. Jeep's father, Bob, thumps the TV inside the Paradise Falls diner and plays with a lighter. His chef, a tall, bald black man, wears a crucifix, dog tags, and has a hook for a left hand. A skimpily dressed young woman leans over a jukebox, and a woman at a table with a man grunts. The man glances and moves. Bob, Audrey, and Howard turn to Sandra. A guy in an SUV drives on a deserted freeway, wearing a brown beanie, scarf, and casual jacket. It's sunny as he stubs out his cigarette, checks his cellphone, sees a sign for Paradise Falls, unfolds a map, then spots the diner. He pulls up and sees Charlie by a phone box, smoking."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "The man talks to Estevez, then drops them. He complies as Estevez cuffs him but is used as a shield. Burton convulses, lights flicker, and he shoots Estevez. Michael shoots Burton with two guns, places them in bags, and drives off in a police car, number 1127. A man in his late 20s wakes, turns on a light, exits a trailer, and walks under light bulbs. The green neon sign illuminates him. Jeep turns back to the trailer, and she is pregnant. They sit on swings; Charlie's belly is swollen. She rises, touches his shoulder, and returns to the trailer. Jeep's father, Bob, thumps the TV in the diner. His chef, a tall black man with a hook hand, wears a crucifix and dog tags. A young woman leans over a jukebox, and a woman at a table grunts. A man in an SUV drives on a sunny morning, stubs out a cigarette, checks his phone, sees a sign for Paradise Falls, and pulls up at the diner, spotting Charlie by a phone box."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "The man engages in a conversation with Estevez, and shortly thereafter, he lets them fall from his grasp. He fixes his gaze on the police officers and obediently follows instructions as Estevez approaches to place handcuffs on him. However, in a sudden turn of events, he is spun around and used as a human shield. Meanwhile, Burton begins to convulse and perform an erratic dance on the spot as they tremble together. The lights flicker intermittently, and his eyes are wide open, staring intensely with a tense expression on his face. In a shocking moment, Burton fires a shot at Estevez. Michael quickly leaps to the ground, maneuvers over, and fires at Burton using two handguns simultaneously. Afterward, Michael carefully places his two firearms into the bags, carries them over to the police car, and drives away in it. Burton's lifeless body remains on the sidewalk. The squad car, easily identifiable by the number 1127 prominently displayed on its roof, drives past a series of buildings, with lights turning off as he passes by. \n\nA man, appearing to be in his late 20s, suddenly wakes up with a start, glances around the room, and switches on a light while seated on a chair. To his left, there is a small television. He exits a two-door trailer, closes the door behind him, and in the soft light of early morning, walks away from the large gray trailer. As he moves, he passes under two strings of light bulbs, his hands tucked into the pockets of his jacket. The green neon lights of a nearby sign cast an illuminating glow on his features. Jeep turns back toward the trailer, and it is evident that she is pregnant. They sit on the swings, facing in opposite directions; Charlie's belly is noticeably swollen, and Jeep wears an expression of dejection. He nods slightly, while she glances at him from the corner of her eyes before looking away. Rising from the swing, she walks behind him, briefly resting her hand on his shoulder before continuing her path back to the trailer. He remains seated on the swing, unmoving, as she reenters through the second door.\n\nInside the Paradise Falls diner, Jeep's father, Bob, persistently thumps the TV set and fiddles with a lighter. His chef, a tall, bald black man, wears a crucifix and a couple of dog tags around his neck, and notably, he has a hook for a left hand. A young woman, scantily dressed, leans over a jukebox, while a woman seated at a table with a man stares at her and grunts disapprovingly. The man glances around and makes a move. Bob turns, as does Audrey, and Howard turns to face his wife, Sandra. Meanwhile, a man in an SUV drives along a deserted freeway, a half-smoked cigarette dangling from his mouth. He wears a brown beanie hat, a scarf wrapped around his neck, and a casual jacket. It's a bright and sunny morning as he extinguishes his cigarette, picks up his cellphone, and examines it. He notices a sign for Paradise Falls, unfolds a map to study it closely, then lowers it to see the diner up ahead. He pulls into the forecourt and observes Charlie standing by a phone box, smoking a cigarette."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "The man finds himself engaged in an animated conversation with Estevez. Shortly afterward, he carelessly releases his grip, allowing them to fall from his grasp. He directs his unwavering gaze toward the police officers and dutifully obeys their instructions as Estevez approaches him with intent to place handcuffs on him. However, unexpectedly, events take a dramatic twist when he is forcibly spun around and utilized as a human shield. Meanwhile, Burton begins to convulse uncontrollably, performing a chaotic and erratic dance in place as they both tremble together. The lights flicker intermittently, casting an eerie atmosphere, and his eyes widen in shock as he stares intensely with a tense, apprehensive look on his face. In a startling and shocking turn of events, Burton fires a shot at Estevez. Michael, reacting with quick reflexes, swiftly leaps to the ground, skillfully maneuvers over, and fires at Burton using two handguns with both hands in a synchronized action. Afterward, with deliberate care, Michael places his two firearms into bags, diligently ensuring they are secure, then carries them over to the police car, commandeering it and driving away. Burton's lifeless body remains motionless on the sidewalk. The squad car, easily identifiable by the prominently displayed number 1127 on its roof, drives past a series of buildings, which darken one by one as he passes.\n\nIn another scene, a man, seemingly in his late 20s, suddenly awakens with a jolt, abruptly glances around the dimly lit room, and switches on a light while remaining seated on a chair. To his left, a small television sits quietly. He exits the confines of a two-door trailer, carefully closing the door behind him, and in the gentle light of early morning, walks away from the large, imposing gray trailer. As he moves with deliberate steps, he passes under two strings of light bulbs, his hands securely tucked into the pockets of his jacket for warmth. The green neon lights of a nearby sign cast an illuminating glow upon his features, highlighting his expressions. Jeep turns back toward the trailer, where it is evident that she is pregnant. They sit on swings, facing in opposite directions; Charlie's belly is noticeably swollen, signaling her impending motherhood, while Jeep wears an expression of deep dejection. He nods slightly, acknowledging something unspoken, while she glances at him from the corner of her eyes before looking away, perhaps lost in thought. Rising from the swing, she walks behind him and briefly rests her hand on his shoulder in a gesture of fleeting comfort before continuing her path back toward the trailer. He remains seated on the swing, unmoving, as she reenters through the second door.\n\nInside the Paradise Falls diner, Jeep's father, Bob, persistently thumps the TV set in a vain attempt to improve its reception and fiddles with a lighter, trying to make it work. His chef, who is a tall, bald black man, prominently displays a crucifix and a couple of dog tags around his neck. Notably, he has a hook for a left hand, a distinctive feature that sets him apart. A young woman, scantily dressed, leans seductively over a jukebox, while a woman seated at a table with a man stares at her intently, grunting disapprovingly. The man glances around, surveying the scene, and makes a move. Bob turns, as does Audrey, and Howard turns to face his wife, Sandra. Meanwhile, elsewhere, a man in an SUV drives along a deserted freeway, a half-smoked cigarette dangling casually from his mouth. He wears a brown beanie hat, a scarf wrapped snugly around his neck, and a casual jacket, perfectly suited for the bright and sunny morning. He extinguishes his cigarette with a flick, picks up his cellphone, and examines it with interest. He notices a sign for Paradise Falls, then unfolds a map to study it closely, taking note of the directions, and subsequently lowers it to see the diner up ahead. He pulls into the forecourt and observes Charlie, who is standing by a phone box, smoking a cigarette contemplatively."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "The man engages in a conversation with Estevez, during which he suddenly lets go of them, causing them to fall. He fixes his gaze on the police officers, maintaining eye contact and showing compliance as Estevez approaches to handcuff him. However, in a swift motion, he is spun around and used as a human shield. Meanwhile, Burton begins to convulse, his body jerking erratically as if dancing on the spot, while they both shake. The lights around them flicker intermittently, casting an eerie glow, and Burton's eyes remain wide open, his face tense and strained. In a sudden turn of events, Burton fires a shot at Estevez. Reacting quickly, Michael dives to the ground, rolls over to a better position, and fires at Burton with two handguns, neutralizing the threat. He then methodically places his two firearms into bags, carries them to the nearby police car, and gets into the driver's seat, driving away in the vehicle. Burton's lifeless body is left lying on the sidewalk. The squad car, identifiable by the number 1127 on its roof, cruises past a series of buildings, each one darkening as he drives by. Elsewhere, a man in his late 20s is jolted awake, his eyes darting around the room as he reaches to switch on a light, revealing that he is seated on a chair. To his left, a small television sits quietly. He exits a two-door trailer, carefully closing the door behind him, and steps into the early morning light. As he walks away from the large gray trailer, he passes beneath two strings of light bulbs, his hands tucked into the pockets of his jacket. The green neon lights of a nearby sign cast a glow on his features. Jeep, who is pregnant, turns back toward the trailer. They sit on swings facing opposite directions, with Charlie's belly noticeably swollen, while Jeep wears a downcast expression. He nods in acknowledgment, and she glances at him from the corner of her eyes before looking away. Rising from the swing, she walks behind him, briefly resting her hand on his shoulder before continuing her path back to the trailer. He remains seated on the swing, unmoving, as she reenters the trailer through the second door. Inside the Paradise Falls diner, Jeep's father, Bob, repeatedly thumps the TV set in frustration and fiddles with a lighter. His chef, a tall, bald black man adorned with a crucifix and a couple of dog tags around his neck, has a hook for a left hand. Nearby, a young woman dressed scantily leans over a jukebox, drawing the attention of a woman at a table with a man, who stares at her and grunts disapprovingly. The man at the table glances around and makes a move. Bob turns to look, as do Audrey and Howard, who turns to his wife, Sandra. Meanwhile, a man in an SUV drives along a deserted freeway, a half-smoked cigarette dangling from his mouth, wearing a brown beanie hat, a scarf wrapped around his neck, and a casual jacket. As the sunny morning unfolds, he stubs out his cigarette, picks up his cellphone, and examines it. Spotting a sign for Paradise Falls, he unfolds a map to study it, then lowers it to see the diner ahead. He pulls into the forecourt and notices Charlie standing by a phone box, smoking a cigarette."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "The man talks to Estevez before dropping them and complying with the police as Estevez approaches to cuff him. Suddenly, he is spun around and used as a shield, causing Burton to convulse and shoot Estevez. Michael quickly reacts by leaping to the ground, shooting Burton with two handguns, and then placing the guns in bags before driving off in a police car marked 1127. As the car passes buildings, lights shut off. Meanwhile, a man in his late 20s wakes up abruptly, turns on a light, and sits in a chair next to a small television. He exits a two-door trailer, walks away under strings of light bulbs with his hands in his jacket pockets, and is illuminated by green neon lights. Jeep, who is pregnant, turns back to the trailer. She and Charlie sit on swings facing opposite directions, with Charlie's belly swollen and Jeep looking dejected. After a brief exchange, Charlie rises, touches Jeep's shoulder, and returns to the trailer, leaving Jeep on the swing. Inside the Paradise Falls diner, Jeep's father, Bob, fiddles with a TV and a lighter. The chef, a tall, bald black man with a crucifix, dog tags, and a hook for a hand, works nearby. A skimpily dressed young woman leans over a jukebox, drawing attention from a woman at a table and her companion. Bob, Audrey, and Howard all turn to look as a man in an SUV drives along a deserted freeway. Wearing a brown beanie, scarf, and casual jacket, he stubs out a cigarette, checks his cellphone, and sees a sign for Paradise Falls. After studying a map, he spots the diner and pulls into the forecourt, noticing Charlie by a phone box, smoking a cigarette."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "The man talks to Estevez, a local police officer known for his negotiation skills, then he drops them. He stares at the cops stationed strategically around the area and complies as Estevez steps up to cuff him, but is suddenly spun around and used as a human shield, a tactic often explored in police training scenarios for handling armed suspects. Burton convulses and dances on the spot as they shake. Lights flicker, likely due to a short circuit caused by a bullet hitting the power line, and his eyes are staring with a tight face. Burton shoots Estevez, a scene reminiscent of many tense standoffs depicted in crime thrillers. Michael leaps to the ground, employs evasive maneuvers learned in his military training, moves over, and shoots Burton with two handguns. Michael places his two guns in the bags, tactical black ones often used by professionals for their durability, takes them to the police car, a standard issue Ford Crown Victoria, and drives off in it. Burton's body lies on the sidewalk, a stark reminder of the violent encounter. The squad car, identified by the number 1127 on its roof, drives past buildings with lights shutting off as he passes, possibly suggesting a power outage spreading through the district. \n\nA guy in his late 20s wakes with a start, possibly disoriented by a sudden noise, looks around, switches on a light, and is on a chair. A small television displays static to his left. He comes out of a two-door trailer, often used in these parts by traveling workers, shuts the door, and in the early morning light, walks away from the big gray trailer, passing under two strings of light bulbs strung for the upcoming local fair with his hands stuffed in his jacket pockets. The green neon lights of the sign, a relic from the 1950s, illuminate his features. Jeep turns back to the trailer, and she is visibly pregnant, nearing the end of her third trimester. They sit on the swings facing in opposite directions, Charlie's belly very swollen, and Jeep wears a hangdog expression, suggesting his fatigue from recent personal struggles. He nods, she stares at him out of the corner of her eyes, then looks away. She rises from the swing, walks behind him, resting her hand momentarily on his shoulder, a gesture of silent support, before continuing on her way back to the trailer. He remains on the swing and doesn't move as she goes back inside through the second door.\n\nJeep's father, Bob, a Vietnam War veteran, keeps thumping the TV set inside the Paradise Falls diner, a hub of community gatherings, and plays with a lighter emblazoned with military insignia. His chef is a tall, bald black guy who wears a crucifix and a couple of dog tags around his neck, indicating his military background, and has a hook for a left hand, a result of an injury sustained in service. A skimpily dressed young woman leans over a jukebox, a vintage model often maintained by local enthusiasts, and a woman at a table with a man stares at her and grunts disapprovingly. The man glances round and makes a move, possibly to intervene. Bob turns, as does Audrey, a long-time waitress at the diner, and Howard turns to his wife Sandra who sits next to him. \n\nA guy in an SUV drives along a deserted freeway, the early morning mist rising from the asphalt, with a half-smoked cigarette in his mouth, wearing a brown beanie hat, a scarf around his neck, and a casual jacket suggestive of his casual road-tripper style. It's a sunny morning as he stubs out his cigarette, picks up his cellphone, a model known for its robust battery life ideal for long trips, and looks at it. He sees a sign for Paradise Falls, famous for its scenic waterfall hiking trails, unfolds a map to study it, then lowers it and sees the diner up ahead. He pulls up in the forecourt and sees Charlie standing by a phone box, smoking a cigarette, a routine she finds comforting despite its health risks."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Lights flicker and his eyes are staring with a tight face  Burton shoots Estevez  Michael leaps to the ground moves over and shoots Burton with two handguns  Michael places his two guns in the bags takes them to the police car and drives off in it  Burton's body lies on the sidewalk  The squad car identified by the number 1127 on its roof drives past buildings with lights shutting off as he passes  A guy in his late 20s wakes with a start looks around switches on a light and is on a chair  A small television is to his left  He comes out of a twodoor trailer shuts the door and in the early morning light walks away from the big gray trailer passing under two strings of light bulbs with his hands stuffed in his jacket pockets  The green neon lights of the sign illuminate his features  Jeep turns back to the trailer and she is pregnant  They sit on the swings facing in opposite directions  Charlie's belly very swollen and Jeep wears a hangdog expression  He nods  she stares at him out of the corner of her eyes then looks away  The man talks to Estevez then he drops them  He stares at the cops and complies as Estevez steps up to cuff him but is spun around and used as a shield  Burton convulses and dances on the spot as they shake  Lights flicker and his eyes are staring with a tight face  Burton shoots Estevez  Michael leaps to the ground moves over and shoots Burton with two handguns  Michael places his two guns in the bags takes them to the police car and drives off in it  Burton's body lies on the sidewalk  The squad car identified by the number 1127 on its roof drives past buildings with lights shutting off as he passes  A guy in his late 20s wakes with a start looks around switches on a light and is on a chair  A small television is to his left  He comes out of a twodoor trailer shuts the door and in the early morning light walks away from the big gray trailer passing under two strings of light bulbs with his hands stuffed in his jacket pockets  The green neon lights of the sign illuminate his features  Jeep turns back to the trailer and she is pregnant  They sit on the swings facing in opposite directions  Charlie's belly very swollen and Jeep wears a hangdog expression  He nods  she stares at him out of the corner of her eyes then looks away  She rises from the swing walks behind him resting her hand momentarily on his shoulder before continuing on her way back to the trailer  He remains on the swing and doesn't move as she goes back inside through the second door  Jeep's father  Bob keeps thumping the TV set inside the Paradise Falls diner and plays with a lighter  His chef is a tall bald black guy who wears a crucifix and a couple of dog tags around his neck and has a hook for a left hand  A skimpily dressed young woman leans over a jukebox and a woman at a table with a man stares at her and grunts  The man glances round and makes a move  Bob turns as does Audrey and Howard turns to wife Sandra  A guy in an SUV drives along a deserted freeway with a halfsmoked cigarette in his mouth wearing a brown beanie hat a scarf around his neck and a casual jacket  It's a sunny morning as he stubs out his cigarette picks up his cellphone and looks at it  He sees a sign for Paradise Falls unfolds a map to study it then lowers it and sees the diner up ahead  He pulls up in the forecourt and sees Charlie standing by a phone box smoking a cigarette"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "The man talks to Estevez then he drops them. He stares at the cops and complies as Estevez steps up to cuff him but is spun around and used as a shield. Burton convulses and dances on the spot as they shake. Lights flicker and his eyes are staring with a tight face Burton shoots Estevez. Michael leaps to the ground moves over and shoots Burton with two handguns. Michael places his two guns in the bags takes them to the police car and drives off in it. Burton's body lies on the sidewalk. The squad car identified by the number 1127 on its roof drives past buildings with lights shutting off as he passes. A guy in his late 20s wakes with a start looks around switches on a light and is on a chair. A small television is to his left. He comes out of a twodoor trailer shuts the door and in the early morning light walks away from the big gray trailer passing under two strings of light bulbs with his hands stuffed in his jacket pockets. The green neon lights of the sign illuminate his features. Jeep turns back to the trailer and she is pregnant. They sit on the swings facing in opposite directions. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Charlie's belly very swollen and Jeep wears a hangdog expression. He nods. she stares at him out of the corner of her eyes then looks away. She rises from the swing walks behind him resting her hand momentarily on his shoulder before continuing on her way back to the trailer. He remains on the swing and does not move as she goes back inside through the second door. Jeep's father. Bob keeps thumping the TV set inside the Paradise Falls diner and plays with a lighter. His chef is a tall bald black guy who wears a crucifix and a couple of dog tags around his neck and has a hook for a left hand. A skimpily dressed young woman leans over a jukebox and a woman at a table with a man stares at her and grunts. The man glances round and makes a move. Bob turns as does Audrey and Howard turns to wife Sandra. A guy in an SUV drives along a deserted freeway with a halfsmoked cigarette in his mouth wearing a brown beanie hat a scarf around his neck and a casual jacket. It is a sunny morning as he stubs out his cigarette picks up his cellphone and looks at it. He sees a sign for Paradise Falls unfolds a map to study it then lowers it and sees the diner up ahead. He pulls up in the forecourt and sees Charlie standing by a phone box smoking a cigarette."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "The man talks to Estevez then he drops them. He stares at the cops and complies as Estevez steps up to cuff him but is spun around and used as a shield. Burton convulses and dances on the spot as they shake. Lights flicker and his eyes are staring with a tight face Burton shoots Estevez. Michael leaps to the ground moves over and shoots Burton with two handguns. Michael places his two guns in the bags takes them to the police car and drives off in it. Burton's body lies on the sidewalk. The squad car identified by the number 1127 on its roof drives past buildings with lights shutting off as he passes. A guy in his late 20s wakes with a start looks around switches on a light and is on a chair. A small television is to his left. He comes out of a twodoor trailer shuts the door and in the early morning light walks away from the big gray trailer passing under two strings of light bulbs with his hands stuffed in his jacket pockets. The green neon lights of the sign illuminate his features. Jeep turns back to the trailer and she is pregnant. They sit on the swings facing in opposite directions. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. Charlie's belly very swollen and Jeep wears a hangdog expression. He nods. she stares at him out of the corner of her eyes then looks away. She rises from the swing walks behind him resting her hand momentarily on his shoulder before continuing on her way back to the trailer. He remains on the swing and does not move as she goes back inside through the second door. Jeep's father. Bob keeps thumping the TV set inside the Paradise Falls diner and plays with a lighter. His chef is a tall bald black guy who wears a crucifix and a couple of dog tags around his neck and has a hook for a left hand. A skimpily dressed young woman leans over a jukebox and a woman at a table with a man stares at her and grunts. The man glances round and makes a move. Bob turns as does Audrey and Howard turns to wife Sandra. A guy in an SUV drives along a deserted freeway with a halfsmoked cigarette in his mouth wearing a brown beanie hat a scarf around his neck and a casual jacket. It is a sunny morning as he stubs out his cigarette picks up his cellphone and looks at it. He sees a sign for Paradise Falls unfolds a map to study it then lowers it and sees the diner up ahead. He pulls up in the forecourt and sees Charlie standing by a phone box smoking a cigarette."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "The man talks to Estevez then he drops them. He stares at the cops and complies as Estevez steps up to cuff him but is spun around and used as a shield. Burton convulses and dances on the spot as they shake. Lights flicker and his eyes are staring with a tight face Burton shoots Estevez. Michael leaps to the ground moves over and shoots Burton with two handguns. Michael places his two guns in the bags takes them to the police car and drives off in it. Burton's body lies on the sidewalk. His chef is a tall bald black guy who wears a crucifix and a couple of dog tags around his neck and has a hook for a left hand. A skimpily dressed young woman leans over a jukebox and a woman at a table with a man stares at her and grunts. The man glances round and makes a move. Bob turns as does Audrey and Howard turns to wife Sandra. A guy in an SUV drives along a deserted freeway with a halfsmoked cigarette in his mouth wearing a brown beanie hat a scarf around his neck and a casual jacket. It is a sunny morning as he stubs out his cigarette picks up his cellphone and looks at it. He sees a sign for Paradise Falls unfolds a map to study it then lowers it and sees the diner up ahead. He pulls up in the forecourt and sees Charlie standing by a phone box smoking a cigarette."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "The man talks to Estevez then he drops them. He stares at the cops and complies as Estevez steps up to cuff him but is spun around and used as a shield. Burton convulses and dances on the spot as they shake. It is a sunny morning as he stubs out his cigarette picks up his cellphone and looks at it. He sees a sign for Paradise Falls unfolds a map to study it then lowers it and sees the diner up ahead. He pulls up in the forecourt and sees Charlie standing by a phone box smoking a cigarette."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The cat talks to the doctor, then she drops them. She stares at the teachers and complies as the doctor steps up to cuff her, but is spun around and used as a shield. The dog convulses and dances on the spot as they shake. Lights flicker, and its eyes are staring with a tight face. The dog shoots the doctor. The bird leaps to the ground, moves over, and shoots the dog with two handguns. The bird places its two guns in the bags, takes them to the police car, and drives off in it. The dog's body lies on the sidewalk. The squad car, identified by the number 1127 on its roof, drives past buildings with lights shutting off as it passes. A fish in its late 20s wakes with a start, looks around, switches on a light, and is on a chair. A small television is to its left. It comes out of a two-door trailer, shuts the door, and in the early morning light, walks away from the big gray trailer, passing under two strings of light bulbs with its hands stuffed in its jacket pockets. The green neon lights of the sign illuminate its features. The rabbit turns back to the trailer, and he is pregnant. They sit on the swings facing in opposite directions, the cat's belly very swollen, and the rabbit wears a hangdog expression. He nods, she stares at him out of the corner of her eyes, then looks away. She rises from the swing, walks behind him, resting her hand momentarily on his shoulder before continuing on her way back to the trailer. He remains on the swing and doesn't move as she goes back inside through the second door. The rabbit's father, the horse, keeps thumping the TV set inside the Paradise Falls diner and plays with a lighter. His chef is a tall, bald black cat who wears a crucifix and a couple of dog tags around its neck and has a hook for a left hand. A skimpily dressed young bird leans over a jukebox, and a bird at a table with a rabbit stares at her and grunts. The rabbit glances round and makes a move. The horse turns, as does the butterfly, and the elephant turns to wife the turtle. An owl in an SUV drives along a deserted freeway with a half-smoked cigarette in its mouth, wearing a brown beanie hat, a scarf around its neck, and a casual jacket. It's a sunny morning as it stubs out its cigarette, picks up its cellphone, and looks at it. It sees a sign for Paradise Falls, unfolds a map to study it, then lowers it and sees the diner up ahead. It pulls up in the forecourt and sees the cat standing by a phone box, smoking a cigarette."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "The man talks to Estevez, then he drops them. He stares at the gardeners and complies as Estevez steps up to cuff him, but is spun around and used as a shield. Burton convulses and dances on the spot as they shake. Curtains flicker, and his eyes are staring with a tight face. Burton shoots Estevez. Michael leaps to the ground, moves over, and shoots Burton with two slingshots. Michael places his two slingshots in the baskets, takes them to the golf cart, and drives off in it. Burton's body lies on the pathway. The cart, identified by the number 1127 on its roof, drives past sculptures with curtains shutting off as he passes. A guy in his late 20s wakes with a start, looks around, switches on a lamp, and is on a bench. A small aquarium is to his left. He comes out of a two-door warehouse, shuts the door, and in the early morning light, walks away from the big gray warehouse, passing under two strings of lanterns with his hands stuffed in his jacket pockets. The green neon lights of the billboard illuminate his features. Jeep turns back to the warehouse, and she is pregnant. They sit on the benches facing in opposite directions, Charlie's belly very swollen, and Jeep wears a hangdog expression. He nods, she stares at him out of the corner of her eyes, then looks away. She rises from the bench, walks behind him, resting her hand momentarily on his shoulder before continuing on her way back to the warehouse. He remains on the bench and doesn't move as she goes back inside through the second door. Jeep's father, Bob, keeps thumping the radio inside the Paradise Falls boutique and plays with a flashlight. His chef is a tall, bald black guy who wears a crucifix and a couple of dog tags around his neck and has a hook for a left hand. A skimpily dressed young woman leans over a gramophone, and a woman at a table with a man stares at her and grunts. The man glances round and makes a move. Bob turns, as does Audrey, and Howard turns to wife Sandra. A guy in a scooter drives along a deserted highway with a half-smoked cigar in his mouth, wearing a brown beanie hat, a scarf around his neck, and a casual jacket. It's a sunny morning as he stubs out his cigar, picks up his tablet, and looks at it. He sees a sign for Paradise Falls, unfolds a blueprint to study it, then lowers it and sees the boutique up ahead. He pulls up in the forecourt and sees Charlie standing by a mail box, smoking a cigar."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "The man whispers to Estevez, then he kicks them. He glances at the cops and bows as Estevez hops up to tap him, but is twirled around and used as a mannequin. Burton giggles and hops on the spot as they shiver. Lights dim, and his eyes are blinking with a tight face. Burton hugs Estevez. Michael dives to the ground, hops over, and hugs Burton with two handguns. Michael tucks his two guns in the bags, takes them to the police car, and wanders off in it. Burton's body rests on the sidewalk. The squad car, identified by the number 1127 on its roof, glides past buildings with lights dimming as he passes. A guy in his late 20s jumps with a start, glances around, flicks on a light, and stands on a chair. A small television is to his left. He emerges from a two-door trailer, opens the door, and in the early morning light, skips away from the big gray trailer, passing under two strings of light bulbs with his hands dangling in his jacket pockets. The green neon lights of the sign cast his features. Jeep turns back to the trailer, and she is laughing. They rest on the swings facing in opposite directions, Charlie's belly very swollen, and Jeep wears a nervous expression. He shrugs, she sneaks a glance at him out of the corner of her eyes, then looks away. She rises from the swing, walks around him, patting her hand momentarily on his shoulder before hopping on her way back to the trailer. He stays on the swing and doesn't budge as she goes back inside through the second door. Jeep's father, Bob, keeps tapping the TV set inside the Paradise Falls diner and spins a lighter. His chef is a tall, bald black guy who wears a crucifix and a couple of dog tags around his neck and holds a spoon for a left hand. A skimpily dressed young woman crouches over a jukebox, and a woman at a table with a man glances at her and whistles. The man peers around and takes a seat. Bob laughs, as does Audrey, and Howard whispers to wife Sandra. A guy in an SUV wanders along a deserted freeway with a half-smoked cigarette in his mouth, wearing a brown beanie hat, a scarf around his neck, and a casual jacket. It's a sunny morning as he flicks his cigarette, dials his cellphone, and listens to it. He notices a sign for Paradise Falls, folds a map to study it, then lifts it and sees the diner up ahead. He rolls up in the forecourt and sees Charlie leaning by a phone box, reading a magazine."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "The toaster whispers to the vase, then it misplaces them. It gazes at the dolphins and obeys as the vase steps up to bind it, but is spun around and utilized as a lantern. The piano convulses and juggles on the spot as they rattle. Curtains flicker, and its feet are staring with a tight whisker. The piano juggles the vase. The window leaps to the carpet, scoots over, and juggles the piano with two umbrellas. The window hides its two umbrellas in the buckets, takes them to the refrigerator, and scooters off in it. The piano's shadow reclines on the tabletop. The recliner, identified by the number 4478 on its roof, scooters past bicycles with curtains shutting off as it passes. A refrigerator in its early 60s awakens with a start, gazes around, switches on a curtain, and is on a lamp. A large calculator is to its north. It emerges out of a two-window hammock, closes the window, and in the late evening shadows, jogs away from the small pink hammock, passing under two ribbons of lanterns with its fingers tucked in its hat sleeves. The blue aluminum curtains of the lantern brighten its toes. Blanket rotates back to the hammock, and he is asleep. They lounge on the hammocks facing in opposite rotations, Blanket's toes very bloated, and Blanket sports a sleepy smile. He winks, he gazes at it out of the corner of its lamps, then gazes away. He rises from the hammock, marches behind it, resting its toe momentarily on its ankle before continuing on its journey back to the hammock. It remains on the hammock and doesn't scoot as it marches back inside through the fourth window. Blanket's cousin, Spoon, keeps tapping the calculator inside the Crystal River cabin and fiddles with a camera. Its gardener is a short, hairy white refrigerator who sports a bracelet and a few bracelets around its ankle and has a spoon for a right toe. A lavishly dressed elderly spoon leans over a candle, and a spoon at a laptop with a chair gazes at him and sneezes. The chair peeks round and takes a gamble. Spoon spins, as does Muffin, and Quilt spins to husband Spoon. A spoon in a BMV pedals along a crowded junction with a fully burnt stick in its wrist, sporting a pink sombrero, a sock around its ankle, and a formal bracelet. It's a rainy evening as it extinguishes its stick, picks up its laptop, and gazes at it. It notices a bracelet for Crystal River, folds a brochure to examine it, then raises it and notices the cabin up above. It rolls up in the corridor and notices Blanket standing by a camera box, sleeping with a match."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "The cat whispers to Thompson, then it loses them. It gazes at the teachers and dances as Thompson tiptoes up to hug him, but is spun around and admired as a trophy. Fisherman wobbles and hops on the spot as they bounce. Bells jingle, and his eyes are blinking with a blank expression. Fisherman punches Thompson. Lionel springs to the ground, tiptoes over, and kicks Fisherman with two boots. Lionel places his two boots in the backpacks, hauls them to the racing bike, and rides off on it. Fisherman's body lies on the lawn. The racing bike, identified by the number 5432 on its tire, rides past statues with flags waving as he glides. A pigeon in her late 20s flutters with a start, peers around, switches on a flame, and is on a branch. A small painting is to his left. It flutters out of a two-door barn, closes the door, and in the early morning mist, hovers away from the big gray barn, passing under two rows of paper lanterns with its wings tucked in its wing pockets. The green neon glow of the sign casts shadows on its features. Owl turns back to the barn, and she is carrying a basket. They perch on the fences facing in opposite directions, Charlie's basket very full, and Owl wears a pensive expression. It nods, she glances at him out of the corner of her eyes, then looks away. She lifts from the fence, glides behind him, resting her wing momentarily on his shoulder before continuing on her way back to the barn. It remains on the fence and doesn't flutter as she goes back inside through the second door. Owl's mother, Jane, keeps tapping the lamp post inside the Moonlit Gardens barn and fiddles with a feather. Her gardener is a tall, bald black cat who wears a scarf and a couple of bracelets around his neck and has a peg for a right leg. A fancily dressed young monkey lounges over a terrace, and a shark at a pond with a turtle peers at her and snorts. The turtle glances round and makes a noise. Jane swivels, as does Melody, and George turns to sister Lily. A bear on a skateboard rolls along a deserted beach with a half-eaten sandwich in his mouth, wearing a purple baseball cap, a necklace around his neck, and a woolen sweater. It's a misty morning as he tosses his sandwich, picks up his compass, and peers at it. He notices a sign for Moonlit Gardens, unfolds a map to examine it, then lowers it and spots the barn up ahead. He zips up in the meadow and sees Charlie perched by a mailbox, holding a lollipop."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "The man whispers to Estevez, then he tosses them. He glares at the artists and agrees as Estevez leans in to hug him, but is twirled around and used as a umbrella. Burton shivers and twirls on the spot as they sway. Lamps dim, and his eyes are squinting with a wide smile. Burton tosses Estevez. Michael hops to the sidewalk, skips over, and tosses Burton with two briefcases. Michael stores his two briefcases in the boxes, drags them to the delivery truck, and sails off in it. Burton's shadow rests on the grass. The delivery truck, marked by the number 1127 on its windshield, cruises past trees with petals falling off as he passes. A guy in his late 20s jolts with a chill, scans around, flips on a fan, and is on a stool. A small radio is to his left. He steps out of a two-door van, swings the door, and in the early morning mist, strolls away from the big gray van, passing under two rows of paper lanterns with his hands tucked in his coat pockets. The red neon lights of the billboard define his features. Jeep turns back to the van, and she is carrying a backpack. They lounge on the benches facing in opposite directions, Charlie's backpack very large, and Jeep wears a puzzled expression. He shrugs, she glances at him from the corner of her vision, then turns away. She rises from the bench, strolls behind him, resting her hand briefly on his elbow before continuing on her path back to the van. He remains on the bench and doesn't shift as she slips inside through the second door. Jeep's father, Bob, keeps tapping the radio inside the Paradise Falls bakery and fiddles with a flashlight. His baker is a tall, bald black guy who wears a rosary and a couple of bracelets around his wrist and has a spatula for a left hand. A skimpily dressed young woman leans over a piano, and a woman at a booth with a man glances at her and sneezes. The man peeks around and takes a step. Bob swivels, as does Audrey, and Howard swivels to wife Sandra. A guy in an SUV cruises along a deserted highway with a half-eaten sandwich in his mouth, wearing a blue baseball cap, a necklace around his neck, and a formal blazer. It's a sunny afternoon as he finishes his sandwich, picks up his tablet, and glances at it. He spots a billboard for Paradise Falls, folds a newspaper to study it, then lowers it and sees the bakery up ahead. He halts in the plaza and sees Charlie standing by a bus stop, eating a sandwich."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "The rabbit whispers to Thompson, then she tosses them. She gazes at the chickens and resists as Thompson climbs down to cage her, but is spun around and used as a blanket. Harper vibrates and hops in the meadow as they shiver. Candles dim, and his ears are gazing with a relaxed foot. Harper barks Thompson. Jessica tumbles to the water, skips over, and barks Harper with two trombones. Jessica places her two trombones in the baskets, takes them to the flower wagon, and hops off in it. Harper's statue rests on the lawn. The flower wagon, identified by the number 4596 on its tire, flutters past mountains with shadows blinking on as she floats. A cat in her early 90s dozes with a chuckle, glances up, flips on a candle, and is on a tree. A large refrigerator is to her right. She climbs into a four-window cave, pulls the curtain, and in the late afternoon shadow, swims toward the small blue cave, passing over four strings of feathers with her wings wrapped in her sweater sleeves. The yellow flashing shadows of the mural camouflage her whiskers. Kite glides away from the cave, and he is invisible. They float on the clouds facing in identical directions, Maxine's backpack very spacious, and Kite wears a cheerful expression. He winks, she admires him out of the edge of her feathers, then glances up. She jumps off the cloud, swims around him, placing her toe briefly on his fin before continuing on her path toward the cave. He stays on the cloud and doesn't swim as he jumps inside through the first curtain. Kite's sister, Lynn, keeps thumping the radio inside the Rainbow Springs treehouse and toys with a flashlight. Her guard is a short, hairy white lady who wears a medallion and a couple of rings around her toes and has a horn for a right ear. A heavily dressed young man leans over a table, and a man at a sale with a lady admires him and whistles. The lady chuckles round and takes a nap. Lynn blinks, as does Spencer, and Robin blinks to husband Matt. An elephant in a balloon glides along a crowded trail with a fully eaten apple in its foot, wearing a green cap, a mitten around its toe, and a heavy coat. It's a cloudy evening as she munches her apple, picks up her telescope, and hears it. She hears a mural for Rainbow Springs, rolls a map to smudge it, then raises it and hears the treehouse down below. She floats down in the garden and hears Maxine sleeping by a typewriter, peeling an apple."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "The man initially complies with Estevez before turning him into a shield, leading to a shootout where Burton is killed. Michael takes Burton's guns, flees in a police car marked 1127, and passes buildings with flickering lights. A man in his late 20s wakes up in a trailer, exits, and walks under string lights. Jeep and a pregnant Charlie sit on swings; she leaves for the trailer after a brief exchange. At the Paradise Falls diner, Bob fiddles with a TV while his chef, a bald man with a hook hand, works. A skimpily dressed woman attracts attention, while a couple observes her. A man in an SUV, driving on a sunny morning, spots a sign for Paradise Falls, checks his map, and stops at the diner, noticing Charlie by a phone box smoking."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "He pulls up in the forecourt and sees Charlie standing by a phone box smoking a cigarette He sees a sign for Paradise Falls unfolds a map to study it then lowers it and sees the diner up ahead  It's a sunny morning as he stubs out his cigarette picks up his cellphone and looks at it  A guy in an SUV drives along a deserted freeway with a halfsmoked cigarette in his mouth wearing a brown beanie hat a scarf around his neck and a casual jacket  Bob turns as does Audrey and Howard turns to wife Sandra  The man glances round and makes a move  A skimpily dressed young woman leans over a jukebox and a woman at a table with a man stares at her and grunts  His chef is a tall bald black guy who wears a crucifix and a couple of dog tags around his neck and has a hook for a left hand  Bob keeps thumping the TV set inside the Paradise Falls diner and plays with a lighter  Jeep's father  He remains on the swing and doesn't move as she goes back inside through the second door  She rises from the swing walks behind him resting her hand momentarily on his shoulder before continuing on her way back to the trailer  she stares at him out of the corner of her eyes then looks away  He nods  Charlie's belly very swollen and Jeep wears a hangdog expression  They sit on the swings facing in opposite directions  Jeep turns back to the trailer and she is pregnant  The green neon lights of the sign illuminate his features  He comes out of a twodoor trailer shuts the door and in the early morning light walks away from the big gray trailer passing under two strings of light bulbs with his hands stuffed in his jacket pockets  A small television is to his left  A guy in his late 20s wakes with a start looks around switches on a light and is on a chair  The squad car identified by the number 1127 on its roof drives past buildings with lights shutting off as he passes  Burton's body lies on the sidewalk  Michael places his two guns in the bags takes them to the police car and drives off in it  Michael leaps to the ground moves over and shoots Burton with two handguns  Burton shoots Estevez  Lights flicker and his eyes are staring with a tight face  Burton convulses and dances on the spot as they shake  He stares at the cops and complies as Estevez steps up to cuff him but is spun around and used as a shield  The man talks to Estevez then he drops them "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "A guy in his late 20s wakes with a start looks around switches on a light and is on a chair  The man talks to Estevez then he drops them  He remains on the swing and doesn't move as she goes back inside through the second door  Bob keeps thumping the TV set inside the Paradise Falls diner and plays with a lighter  He sees a sign for Paradise Falls unfolds a map to study it then lowers it and sees the diner up ahead  Michael leaps to the ground moves over and shoots Burton with two handguns  A skimpily dressed young woman leans over a jukebox and a woman at a table with a man stares at her and grunts  Bob turns as does Audrey and Howard turns to wife Sandra  Jeep's father  They sit on the swings facing in opposite directions  The man glances round and makes a move  Charlie's belly very swollen and Jeep wears a hangdog expression  He nods  Burton's body lies on the sidewalk  she stares at him out of the corner of her eyes then looks away  He stares at the cops and complies as Estevez steps up to cuff him but is spun around and used as a shield  A guy in an SUV drives along a deserted freeway with a halfsmoked cigarette in his mouth wearing a brown beanie hat a scarf around his neck and a casual jacket  She rises from the swing walks behind him resting her hand momentarily on his shoulder before continuing on her way back to the trailer  He comes out of a twodoor trailer shuts the door and in the early morning light walks away from the big gray trailer passing under two strings of light bulbs with his hands stuffed in his jacket pockets  He pulls up in the forecourt and sees Charlie standing by a phone box smoking a cigarette The green neon lights of the sign illuminate his features  Burton convulses and dances on the spot as they shake  Lights flicker and his eyes are staring with a tight face  It's a sunny morning as he stubs out his cigarette picks up his cellphone and looks at it  Michael places his two guns in the bags takes them to the police car and drives off in it  Burton shoots Estevez  The squad car identified by the number 1127 on its roof drives past buildings with lights shutting off as he passes  A small television is to his left  Jeep turns back to the trailer and she is pregnant  His chef is a tall bald black guy who wears a crucifix and a couple of dog tags around his neck and has a hook for a left hand "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Charlie's belly very swollen and Jeep wears a hangdog expression  He nods  she stares at him out of the corner of her eyes then looks away  She rises from the swing walks behind him resting her hand momentarily on his shoulder before continuing on her way back to the trailer  He remains on the swing and doesn't move as she goes back inside through the second door  Jeep's father  Bob keeps thumping the TV set inside the Paradise Falls diner and plays with a lighter  His chef is a tall bald black guy who wears a crucifix and a couple of dog tags around his neck and has a hook for a left hand  A skimpily dressed young woman leans over a jukebox and a woman at a table with a man stares at her and grunts  The man glances round and makes a move  Bob turns as does Audrey and Howard turns to wife Sandra  A guy in an SUV drives along a deserted freeway with a halfsmoked cigarette in his mouth wearing a brown beanie hat a scarf around his neck and a casual jacket  It's a sunny morning as he stubs out his cigarette picks up his cellphone and looks at it  He sees a sign for Paradise Falls unfolds a map to study it then lowers it and sees the diner up ahead  He pulls up in the forecourt and sees Charlie standing by a phone box smoking a cigarette The man talks to Estevez then he drops them  He stares at the cops and complies as Estevez steps up to cuff him but is spun around and used as a shield  Burton convulses and dances on the spot as they shake  Lights flicker and his eyes are staring with a tight face  Burton shoots Estevez  Michael leaps to the ground moves over and shoots Burton with two handguns  Michael places his two guns in the bags takes them to the police car and drives off in it  Burton's body lies on the sidewalk  The squad car identified by the number 1127 on its roof drives past buildings with lights shutting off as he passes  A guy in his late 20s wakes with a start looks around switches on a light and is on a chair  A small television is to his left  He comes out of a twodoor trailer shuts the door and in the early morning light walks away from the big gray trailer passing under two strings of light bulbs with his hands stuffed in his jacket pockets  The green neon lights of the sign illuminate his features  Jeep turns back to the trailer and she is pregnant  They sit on the swings facing in opposite directions "
        }
      ]
    }
  ]
}