{
  "ground_truth": "He lies on top of Fantine, and her lips tremble. Once finished, he gets off her and saunters away, leaving her on her back. She lies motionless, her head on a pillow. Her rouged face is grim and somber. Fantine looks miserable. She breathes quickly and swallows. Her shoulders heave. She sits up. Her once clear skin is blotchy and smeared with dirt. She strokes her short cropped hair. Her cheeks streaked with tears, Fantine glances behind her. Her expression is solemn. Night in the slum. A punter to a pimp. A smartly-dressed man takes off his hat and grabs Fantine's dress. He presses himself on her. She scratches his face. He pushes her away as Javert approaches. Fantine recognizes Valjean and moves away. She turns her back to him. She breathes rapidly. He recoils as she spits in his face. Javert raises a hand to hold back one of his men. He picks her up in his arms. Javert watches them go. Javert is handed a letter. Standing outside in the snow, Javert opens the letter and reads it. He glances up and screws up the letter. He stands in front of Valjean. His brow furrowed, Valjean gets to his feet. Valjean sits back down at his desk. Javert looks puzzled, then bows curtly and takes his leave. Valjean watches him go, then leans on his desk. In church, he kneels at an altar. He packs money and papers into a case. He takes a carriage to court. They stare at him as the court usher escorts him out. At the hospital, a nurse tends to Fantine, who lies on her back. The nurse dabs her semiconscious patient's forehead with a cloth, then rises and walks out of the room. Valjean enters. An image of the nine-year-old blonde girl. The image has vanished. Fantine becomes still, and her head lulls to one side. Valjean closes her lifeless eyes. He bends forward and kisses her on the temple. Javert draws his sword. Having fended Javert off with a baton torn from the wall, Valjean is disarmed. He but turns, rushes out of the door, and dives into the river below. Javert runs out, but there's no sign of Valjean. Fantine lies at peace in the hospital bed. Cosette, young and grubby, is at the inn. She looks out enviously at children playing in the snow. Cosette glares. A pretty little girl. At the inn, Thenardier hauls himself to his feet and wanders past his subtle clientele. He gives a staggering bloke a drink. A silver-haired gent. He takes the man's reading glasses. His wife messes a soldier's jacket. She gazes at the handsome man. Outside along on a crate by a mule.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "He reclines on top of Fantine, and her lips quiver. Once completed, he gets off her and strolls away, leaving her on her back. She lies still, her head on a cushion. Her painted face is grim and somber. Fantine appears wretched. She breathes quickly and gulps. Her shoulders rise. She sits up. Her once clear complexion is mottled and smeared with grime. She caresses her short cropped hair. Her cheeks streaked with tears, Fantine peers behind her. Her expression is grave. Night in the slum. A patron to a pimp. A smartly-dressed gentleman takes off his hat and grabs Fantine's gown. He presses himself on her. She scratches his face. He pushes her away as Javert approaches. Fantine recognizes Valjean and moves away. She turns her back to him. She breathes rapidly. He recoils as she spits in his face. Javert raises a hand to restrain one of his men. He lifts her up in his arms. Javert observes them go. Javert is handed a message. Standing outside in the snow, Javert opens the message and reads it. He glances up and crumples the message. He stands in front of Valjean. His brow furrowed, Valjean gets to his feet. Valjean sits back down at his desk. Javert looks confused, then bows curtly and takes his leave. Valjean watches him go, then leans on his desk. In church, he kneels at an altar. He packs money and documents into a case. He takes a carriage to court. They stare at him as the court usher escorts him out. At the hospital, a nurse tends to Fantine, who lies on her back. The nurse dabs her semiconscious patient's forehead with a cloth, then rises and walks out of the room. Valjean enters. An image of the nine-year-old blonde girl. The image has vanished. Fantine becomes still, and her head lulls to one side. Valjean closes her lifeless eyes. He bends forward and kisses her on the temple. Javert draws his sword. Having fended Javert off with a baton torn from the wall, Valjean is disarmed. He but turns, rushes out of the door, and dives into the river below. Javert runs out, but there's no sign of Valjean. Fantine lies at peace in the hospital bed. Cosette, young and grubby, is at the inn. She looks out enviously at children playing in the snow. Cosette scowls. A pretty little girl. At the inn, Thenardier hauls himself to his feet and wanders past his subtle patrons. He gives a staggering bloke a drink. A silver-haired gentleman. He takes the man's reading spectacles. His wife messes a soldier's jacket. She gazes at the attractive man. Outside along on a crate by a mule."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "He lies on top of Fantine, and her lips tremble. Once he is finished, Fantine is left by him on her back as he saunters away. She remains motionless, with her head on a pillow. Her rouged face grim and somber, Fantine appears miserable. She quickly breathes and swallows. Her shoulders are heaved by her own breath. She sits up. Her once clear skin is now blotchy and smeared with dirt. Her short cropped hair is stroked by her. Glancing behind her, Fantine’s cheeks are streaked with tears. Her expression is made solemn. Night in the slum. A punter to a pimp. Fantine's dress is grabbed by a smartly-dressed man who takes off his hat. He presses himself on her. Her scratching face receives a mark as she scratches him. She is pushed away by him as Javert approaches. Valjean is recognized by Fantine, who moves away. Her back is turned to him by her. She breathes rapidly. He recoils as his face is spit on by her. A hand is raised by Javert to hold back one of his men. She is picked up in his arms by him. They are watched go by Javert. A letter is handed to Javert. Standing outside in the snow, the letter is opened and read by Javert. He glances up and screws up the letter. Valjean is stood in front of by him. Valjean's furrowed brow gets to his feet. Valjean sits back down at his desk. Javert looks puzzled, bows curtly, and takes his leave. He is watched go by Valjean, who then leans on his desk. In church, at an altar, he kneels. Money and papers are packed into a case by him. A carriage is taken to court by him. As the court usher escorts him out, he is stared at. At the hospital, Fantine, who lies on her back, is tended to by a nurse. The semiconscious patient's forehead is dabbed with a cloth by the nurse, who then rises and walks out of the room. Valjean enters. An image of the nine-year-old blonde girl is seen. The image vanishes. Fantine becomes still, and her head lulls to one side. Her lifeless eyes are closed by Valjean. He bends forward and kisses her on the temple. Javert draws his sword. Valjean, having fended Javert off with a baton torn from the wall, is disarmed by him. He turns and rushes out of the door, diving into the river below. Javert runs out, but he sees no sign of Valjean. In the hospital bed, peace envelopes Fantine. Young and grubby, Cosette is at the inn. She looks out enviously at children playing in the snow. Cosette’s glare fixes. A pretty little girl. At the inn, Thenardier hauls himself to his feet and wanders past his subtle clientele. A staggering bloke is given a drink by him. A silver-haired gent. The man's reading glasses are taken by him. A soldier's jacket is messed by his wife. She gazes at the handsome man. Outside alone on a crate by a mule."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "He lies on Fantine, her lips trembling. Finished, he saunters away, leaving her motionless with a grim, somber face. Fantine looks miserable, breathing quickly and swallowing. Her shoulders heave as she sits up, her once clear skin now blotchy and dirty. She strokes her short hair, her cheeks streaked with tears, and glances back solemnly. Night in the slum. A punter approaches a pimp. A smartly-dressed man removes his hat and grabs Fantine's dress, pressing on her. She scratches his face, and he pushes her away as Javert approaches. Fantine recognizes Valjean, turns away, and spits in his face. Javert holds back his men and picks her up. Javert receives a letter, reads it outside in the snow, then crumples it. He stands before Valjean, who rises, then sits back at his desk. Javert, puzzled, bows and leaves. Valjean watches, then leans on his desk. In church, he kneels at an altar, packs money and papers into a case, and takes a carriage to court. The court usher escorts him out. At the hospital, a nurse tends to Fantine, dabbing her forehead before leaving. Valjean enters. An image of a nine-year-old blonde girl vanishes. Fantine becomes still, her head lulling to one side. Valjean closes her lifeless eyes, kisses her temple. Javert draws his sword. Valjean fends him off with a baton, then dives into the river. Javert runs out, but Valjean is gone. Fantine lies at peace. Cosette, young and grubby, is at the inn, enviously watching children play in the snow. Cosette glares. A pretty little girl. Thenardier hauls himself up, wandering past clientele, giving a staggering bloke a drink. A silver-haired gent. He takes the man's reading glasses. His wife messes with a soldier's jacket, gazing at the handsome man outside on a crate by a mule."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "He lies on Fantine, her lips trembling. Finished, he leaves her motionless, head on a pillow, face grim. Fantine looks miserable, breathes quickly, swallows, and sits up. Her skin is blotchy, hair short, cheeks tear-streaked. She glances back, solemn. Night in the slum. A smartly-dressed man grabs Fantine's dress, presses on her. She scratches him; he pushes her as Javert approaches. Fantine recognizes Valjean, turns away, spits at him. Javert holds back a man, picks her up. Javert receives a letter, reads it outside in the snow, then confronts Valjean, who sits at his desk. Javert bows and leaves. Valjean kneels at an altar, packs money and papers, takes a carriage to court. At the hospital, a nurse tends to Fantine, then leaves. Valjean enters, sees an image of a nine-year-old girl, then closes Fantine's lifeless eyes, kissing her temple. Javert draws his sword; Valjean fends him off, dives into the river. Javert finds no sign of him. Fantine lies at peace. Cosette, young and grubby, watches children play in the snow. At the inn, Thenardier serves a staggering man, takes his glasses. His wife messes with a soldier's jacket, gazing at a handsome man."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "He lies sprawled on top of Fantine, and her lips begin to tremble with emotion. Once he has finished, he casually gets off her and saunters away, leaving her lying on her back. She remains motionless, her head resting on a pillow. Her face, heavily rouged, appears grim and somber. Fantine looks utterly miserable. She breathes quickly, swallowing hard. Her shoulders heave with each breath. Slowly, she sits up. Her once clear and smooth skin is now blotchy and smeared with dirt. She gently strokes her short, cropped hair. Her cheeks, streaked with tears, reflect her sorrow as Fantine glances behind her. Her expression is solemn and full of despair. It is night in the slum. A punter approaches a pimp. A smartly-dressed man, with an air of arrogance, takes off his hat and grabs Fantine's dress. He presses himself against her. In response, she scratches his face. He angrily pushes her away just as Javert approaches. Fantine recognizes Valjean and instinctively moves away. She turns her back to him, breathing rapidly. He recoils as she defiantly spits in his face. Javert raises a hand to hold back one of his men. He then picks her up in his arms. Javert watches them go, his eyes following their departure. Javert is handed a letter. Standing outside in the falling snow, Javert opens the letter and reads it carefully. He glances up, then crumples the letter in his hand. He stands in front of Valjean, his brow furrowed with thought. Valjean gets to his feet, then sits back down at his desk. Javert looks puzzled, then bows curtly and takes his leave. Valjean watches him go, then leans heavily on his desk. In the quiet of the church, he kneels at an altar. He packs money and important papers into a case. He takes a carriage to the court. They stare at him as the court usher escorts him out. At the hospital, a nurse tends to Fantine, who lies on her back. The nurse gently dabs her semiconscious patient's forehead with a cloth, then rises and walks out of the room. Valjean enters quietly. An image of the nine-year-old blonde girl appears in his mind. The image has vanished. Fantine becomes still, and her head lulls to one side. Valjean tenderly closes her lifeless eyes. He bends forward and kisses her gently on the temple. Javert draws his sword with determination. Having fended Javert off with a baton torn from the wall, Valjean is eventually disarmed. But he turns, rushes out of the door, and dives into the river below. Javert runs out, but there is no sign of Valjean. Fantine lies at peace in the hospital bed. Cosette, young and grubby, is at the inn. She looks out enviously at children playing joyfully in the snow. Cosette glares, her eyes filled with longing. A pretty little girl. At the inn, Thenardier hauls himself to his feet and wanders past his subtle clientele. He gives a staggering bloke a drink. A silver-haired gentleman. He takes the man's reading glasses. His wife messes with a soldier's jacket. She gazes admiringly at the handsome man. Outside, alone on a crate by a mule."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "He finds himself sprawled leisurely atop Fantine, and soon, her lips begin to tremble with a rush of raw emotion. Once he concludes, he nonchalantly rises from her and saunters away, leaving her lying desolate and alone on her back. She remains utterly motionless, with her head gently resting on a well-worn pillow. Her face, heavily rouged to the point of excess, appears grim and somber. It is clear that Fantine looks utterly miserable. She breathes quickly, each inhalation a laborious task as she swallows hard. Her shoulders heave noticeably with each shallow breath. Slowly and with visible difficulty, she sits up. Her once clear and smooth skin is now blotchy and smeared with dirt, showing signs of her hardships. Gently, she strokes her short, cropped hair with a sense of longing. Her cheeks, streaked with tears, reflect the deep sorrow she feels as Fantine glances behind her. Her expression remains solemn, full of despair and resignation. It is night in the slum, casting a shadowy darkness over the scene. A punter approaches a pimp with an air of intent. A smartly-dressed man, exuding an air of arrogance, takes off his hat and grabs Fantine's dress without hesitation. He brazenly presses himself against her, causing her to respond instinctively by scratching his face in defense. Angrily, he pushes her away, just as Javert approaches the scene. Fantine recognizes Valjean instinctively and moves away with caution. She turns her back to him, breathing rapidly and with a sense of urgency. He recoils momentarily when she defiantly spits in his face. Javert raises a hand to signal his men to hold back. He then takes a gentle step forward and picks her up in his arms, as Javert watches them go, his eyes following their departure with intent. Javert is handed a letter, and standing solemnly outside in the softly falling snow, he opens the letter and reads it carefully. He glances up briefly, then crumples the letter tightly in his hand. Standing in front of Valjean, his brow furrows with deep thought. Valjean gets to his feet with effort, then sits back down at his desk, pondering. Javert appears puzzled, then bows curtly and takes his leave with a sense of purpose. Valjean watches him as he goes, then leans heavily on his desk, deep in thought. In the stillness of the quiet church, he kneels reverently at an altar. He carefully packs money and important papers into a case with deft hands. Taking a carriage, he heads to the court, where they stare curiously at him as the court usher escorts him out. At the hospital, a nurse attentively tends to Fantine, who lies on her back in a state of vulnerability. The nurse gently dabs the forehead of her semiconscious patient with a soft cloth, then rises quietly and walks out of the room. Valjean enters softly. An image of the nine-year-old blonde girl appears fleetingly in his mind. The poignant image vanishes. Fantine becomes still, and her head gently lulls to one side. Valjean tenderly closes her lifeless eyes with a sense of deep loss. He bends forward slowly and kisses her gently on the temple, a final goodbye. With determination, Javert draws his sword. Having fended Javert off with a makeshift baton torn from the wall, Valjean is eventually disarmed. But he turns with swift resolve, rushes out of the door, and dives with urgency into the river below. Javert runs out after him, but there is no sign of Valjean. Fantine lies at peace in the hospital bed, a serene stillness in the air. Cosette, young and grubby, remains at the inn. She looks out longingly at children playing joyfully in the snow. Cosette glares through the window, her eyes filled with a longing and wistful envy. A pretty little girl in a world that seems far away. At the inn, Thenardier hauls himself to his feet and wanders past his subtle clientele with a deliberate pace. He gives a staggering bloke a drink, a gesture executed with practiced ease. A silver-haired gentleman stands nearby. He takes the man's reading glasses with a deft hand. His wife fusses over a soldier's jacket with admiration. She gazes admiringly at the handsome man, lost in her thoughts, while outside, she sits alone on a crate by a tired mule."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "He lies on top of Fantine, and her lips begin to tremble slightly, indicating her distress. Once he finishes, he slowly gets off her and saunters away with a casual demeanor, leaving her lying on her back. She remains motionless, her head resting on a pillow, her rouged face appearing grim and somber. Fantine looks utterly miserable as she breathes quickly and swallows hard, her shoulders heaving with each breath. She gradually sits up, revealing her once clear skin now blotchy and smeared with dirt. She gently strokes her short cropped hair, her cheeks streaked with tears, and glances behind her with a solemn expression. The scene shifts to night in the slum, where a punter approaches a pimp. A smartly-dressed man removes his hat and grabs Fantine's dress, pressing himself against her. In response, she scratches his face, prompting him to push her away just as Javert approaches. Fantine recognizes Valjean and instinctively moves away, turning her back to him. She breathes rapidly, and as he recoils, she defiantly spits in his face. Javert raises a hand to hold back one of his men, then picks her up in his arms, while Javert watches them leave. Javert is handed a letter, and standing outside in the snow, he opens it and reads its contents. He glances up, then crumples the letter in his hand. He stands in front of Valjean, who furrows his brow and gets to his feet. Valjean then sits back down at his desk, while Javert looks puzzled, bows curtly, and takes his leave. Valjean watches him go, then leans on his desk in contemplation. In a church, he kneels at an altar, then packs money and papers into a case. He takes a carriage to court, where people stare at him as the court usher escorts him out. At the hospital, a nurse tends to Fantine, who lies on her back, semiconscious. The nurse gently dabs her forehead with a cloth, then rises and walks out of the room. Valjean enters, and an image of a nine-year-old blonde girl briefly appears before vanishing. Fantine becomes still, her head lulling to one side, and Valjean tenderly closes her lifeless eyes. He bends forward and kisses her gently on the temple. Javert draws his sword, and after fending Javert off with a baton torn from the wall, Valjean is disarmed. He quickly turns, rushes out of the door, and dives into the river below. Javert runs out, but finds no sign of Valjean. Fantine lies at peace in the hospital bed. Meanwhile, Cosette, young and grubby, is at the inn, looking out enviously at children playing in the snow. Cosette glares, observing a pretty little girl. At the inn, Thenardier hauls himself to his feet and wanders past his subtle clientele, giving a staggering bloke a drink. A silver-haired gentleman takes the man's reading glasses, while his wife messes with a soldier's jacket, gazing at the handsome man outside along on a crate by a mule."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "He lies on top of Fantine, leaving her grim and somber as he saunters away. Fantine, motionless with a rouged face, breathes quickly and swallows, her skin blotchy and smeared with dirt. She sits up, strokes her short hair, and glances solemnly behind her. In the slum, a smartly-dressed man approaches Fantine, but she scratches his face, prompting him to push her away as Javert arrives. Recognizing Valjean, Fantine turns her back and spits at him. Javert intervenes, holding back his men, and Valjean picks Fantine up. Javert receives a letter, reads it outside in the snow, and then confronts Valjean, who sits at his desk. After a brief exchange, Javert leaves, and Valjean leans on his desk before kneeling at an altar in church. He packs money and papers into a case and heads to court, where he is escorted out. At the hospital, a nurse tends to a semiconscious Fantine before Valjean enters. As Fantine becomes still, Valjean closes her eyes and kisses her temple. Javert draws his sword, but Valjean fends him off, rushes out, and dives into the river, leaving Javert searching in vain. Fantine lies peacefully in the hospital bed. Meanwhile, young Cosette, at the inn, enviously watches children playing in the snow. Thenardier, at the inn, interacts with his clientele, taking a man's reading glasses and observing his wife with a soldier outside."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "He lies on top of Fantine, a tragic figure driven into prostitution due to her dire circumstances in 19th-century France, and her lips tremble. Once finished, he gets off her and saunters away, leaving her on her back. She lies motionless, her head on a thin, threadbare pillow. Her rouged face is grim and somber. Fantine looks miserable, reflecting the harsh realities faced by many women of her time. She breathes quickly and swallows. Her shoulders heave. She sits up. Her once clear skin is blotchy and smeared with dirt from the squalid living conditions she endures. She strokes her short cropped hair, a sacrifice she made to provide for her child. Her cheeks streaked with tears, Fantine glances behind her. Her expression is solemn. Night in the slum, a dangerous place filled with desperation. A punter, a common term for a client of prostitutes, to a pimp. A smartly-dressed man, likely a wealthier client, takes off his hat and grabs Fantine's dress. He presses himself on her. She scratches his face. He pushes her away as Javert, the rigid and duty-bound police inspector, approaches. Fantine recognizes Valjean, the man she once trusted, and moves away. She turns her back to him. She breathes rapidly. He recoils as she spits in his face, her anger and bitterness evident. Javert raises a hand to hold back one of his men, maintaining the law even in chaos. He picks her up in his arms. Javert watches them go. Javert is handed a letter, likely an official directive. Standing outside in the snow, Javert opens the letter and reads it. He glances up and screws up the letter. He stands in front of Valjean. His brow furrowed, Valjean, an ex-convict seeking redemption, gets to his feet. Valjean sits back down at his desk. Javert looks puzzled, then bows curtly and takes his leave. Valjean watches him go, then leans on his desk. In church, he kneels at an altar, a symbol of his ongoing struggle for moral and spiritual renewal. He packs money and papers into a case. He takes a carriage to court, a place of justice he both fears and seeks. They stare at him as the court usher escorts him out. At the hospital, a nurse tends to Fantine, who lies on her back, her life slipping away due to illness. The nurse dabs her semiconscious patient's forehead with a cloth, then rises and walks out of the room. Valjean enters. An image of the nine-year-old blonde girl, Cosette, whom Fantine loves dearly and has sacrificed everything for. The image has vanished. Fantine becomes still, and her head lulls to one side. Valjean closes her lifeless eyes. He bends forward and kisses her on the temple, a final act of compassion. Javert draws his sword. Having fended Javert off with a baton torn from the wall, Valjean is disarmed. He but turns, rushes out of the door, and dives into the river Seine below. Javert runs out, but there's no sign of Valjean. Fantine lies at peace in the hospital bed. Cosette, young and grubby from neglect, is at the inn. She looks out enviously at children playing in the snow, a rare sight of joy in her life. Cosette glares. A pretty little girl. At the inn, Thenardier, a cunning and unscrupulous innkeeper, hauls himself to his feet and wanders past his subtle clientele. He gives a staggering bloke a drink, always eager to exploit the weak. A silver-haired gent. He takes the man's reading glasses, ever the opportunist. His wife messes a soldier's jacket, a small act that belies her sharp instincts for survival. She gazes at the handsome man. Outside alone on a crate by a mule, she contemplates her next move in the relentless struggle of her existence."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "He lies on top of Fantine and her lips tremble  Once finished he gets off her and saunters away leaving her on her back  She lies motionless her head on a pillow  Her once clear skin is blotchy and smeared with dirt  She strokes her short cropped hair  Her cheeks streaked with tears  Fantine glances behind her  Her expression is solemn  Night in the slum  A punter to a pimp  A smartlydressed man takes off his hat and grabs Fantine's dress  He presses himself on her  She scratches his face  He pushes her away as Javert approaches  Fantine recognizes Valjean and moves away  She turns her back to him  She breathes rapidly  He recoils as she spits in his face  Javert raises a hand to hold back one of his men  He picks her up in his arms  Javert watches them go  Javert is handed a letter  Standing outside in the snow Javert opens the letter and reads it  He glances up and screws up the letter  He stands in front of Valjean  His brow furrowed  Valjean gets to his feet  Valjean sits back down at his desk  Javert looks puzzled then bows curtly and takes his leave  Valjean watches him go then leans on his desk  In church he kneels at an altar  He packs money and papers into a case  He takes a carriage to court  They stare at him as the court usher escorts him out  At the hospital a nurse tends to Fantine who lies on her back  Her rouged face is grim and somber  Fantine looks miserable  She breathes quickly and swallows Her shoulders heave  She sits up  Her once clear skin is blotchy and smeared with dirt  She strokes her short cropped hair  Her cheeks streaked with tears  Fantine glances behind her  Her expression is solemn  Night in the slum  A punter to a pimp  A smartlydressed man takes off his hat and grabs Fantine's dress  He presses himself on her  She scratches his face  He pushes her away as Javert approaches  Fantine recognizes Valjean and moves away  She turns her back to him  She breathes rapidly  He recoils as she spits in his face  Javert raises a hand to hold back one of his men  He picks her up in his arms  Javert watches them go  Javert is handed a letter  Standing outside in the snow Javert opens the letter and reads it  He glances up and screws up the letter  He stands in front of Valjean  His brow furrowed  Valjean gets to his feet  Valjean sits back down at his desk  Javert looks puzzled then bows curtly and takes his leave  Valjean watches him go then leans on his desk  In church he kneels at an altar  He packs money and papers into a case  He takes a carriage to court  They stare at him as the court usher escorts him out  At the hospital a nurse tends to Fantine who lies on her back  The nurse dabs her semiconscious patient's forehead with a cloth then rises and walks out of the room  Valjean enters  An image of the nineyearold blonde girl  The image has vanished  Fantine becomes still and her head lulls to one side  Valjean closes her lifeless eyes  He bends forward and kisses her on the temple  Javert draws his sword  Having fended Javert off with a baton torn from the wall  Valjean is disarmed  He but turns rushes out of the door and dives into the river below  Javert runs out but there's no sign of Valjean  Fantine lies at peace in the hospital bed  Cosette young and grubby is at the inn  She looks out enviously at children playing in the snow  Cosette glares  A pretty little girl  At the inn Thenardier hauls himself to his feet and wanders past his subtle clientele  He gives a staggering bloke a drink  A silverhaired gent  He takes the man's reading glasses  His wife messes a soldier's jacket  She gazes at the handsome man  Outside along on a crate by a mule"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "He lies on top of Fantine and her lips tremble. Once finished he gets off her and saunters away leaving her on her back. She lies motionless her head on a pillow. Her rouged face is grim and somber. Fantine looks miserable. She breathes quickly and swallows Her shoulders heave. She sits up. Her once clear skin is blotchy and smeared with dirt. She strokes her short cropped hair. Her cheeks streaked with tears. Fantine glances behind her. Her expression is solemn. Night in the slum. A punter to a pimp. A smartlydressed man takes off his hat and grabs Fantine's dress. He presses himself on her. She scratches his face. He pushes her away as Javert approaches. Fantine recognizes Valjean and moves away. She turns her back to him. She breathes rapidly. He recoils as she spits in his face. Javert raises a hand to hold back one of his men. He picks her up in his arms. Javert watches them go. Javert is handed a letter. Standing outside in the snow Javert opens the letter and reads it. He glances up and screws up the letter. He stands in front of Valjean. His brow furrowed. Valjean gets to his feet. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Valjean sits back down at his desk. Javert looks puzzled then bows curtly and takes his leave. Valjean watches him go then leans on his desk. In church he kneels at an altar. He packs money and papers into a case. He takes a carriage to court. They stare at him as the court usher escorts him out. At the hospital a nurse tends to Fantine who lies on her back. The nurse dabs her semiconscious patient's forehead with a cloth then rises and walks out of the room. Valjean enters. An image of the nineyearold blonde girl. The image has vanished. Fantine becomes still and her head lulls to one side. Valjean closes her lifeless eyes. He bends forward and kisses her on the temple. Javert draws his sword. Having fended Javert off with a baton torn from the wall. Valjean is disarmed. He but turns rushes out of the door and dives into the river below. Javert runs out but there is no sign of Valjean. Fantine lies at peace in the hospital bed. Cosette young and grubby is at the inn. She looks out enviously at children playing in the snow. Cosette glares. A pretty little girl. At the inn Thenardier hauls himself to his feet and wanders past his subtle clientele. He gives a staggering bloke a drink. A silverhaired gent. He takes the man's reading glasses. His wife messes a soldier's jacket. She gazes at the handsome man. Outside along on a crate by a mule."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "He lies on top of Fantine and her lips tremble. Once finished he gets off her and saunters away leaving her on her back. She lies motionless her head on a pillow. Her rouged face is grim and somber. Fantine looks miserable. She breathes quickly and swallows Her shoulders heave. She sits up. Her once clear skin is blotchy and smeared with dirt. She strokes her short cropped hair. Her cheeks streaked with tears. Fantine glances behind her. Her expression is solemn. Night in the slum. A punter to a pimp. A smartlydressed man takes off his hat and grabs Fantine's dress. He presses himself on her. She scratches his face. He pushes her away as Javert approaches. Fantine recognizes Valjean and moves away. She turns her back to him. She breathes rapidly. He recoils as she spits in his face. Javert raises a hand to hold back one of his men. He picks her up in his arms. Javert watches them go. Javert is handed a letter. Standing outside in the snow Javert opens the letter and reads it. He glances up and screws up the letter. He stands in front of Valjean. His brow furrowed. Valjean gets to his feet. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. Valjean sits back down at his desk. Javert looks puzzled then bows curtly and takes his leave. Valjean watches him go then leans on his desk. In church he kneels at an altar. He packs money and papers into a case. He takes a carriage to court. They stare at him as the court usher escorts him out. At the hospital a nurse tends to Fantine who lies on her back. The nurse dabs her semiconscious patient's forehead with a cloth then rises and walks out of the room. Valjean enters. An image of the nineyearold blonde girl. The image has vanished. Fantine becomes still and her head lulls to one side. Valjean closes her lifeless eyes. He bends forward and kisses her on the temple. Javert draws his sword. Having fended Javert off with a baton torn from the wall. Valjean is disarmed. He but turns rushes out of the door and dives into the river below. Javert runs out but there is no sign of Valjean. Fantine lies at peace in the hospital bed. Cosette young and grubby is at the inn. She looks out enviously at children playing in the snow. Cosette glares. A pretty little girl. At the inn Thenardier hauls himself to his feet and wanders past his subtle clientele. He gives a staggering bloke a drink. A silverhaired gent. He takes the man's reading glasses. His wife messes a soldier's jacket. She gazes at the handsome man. Outside along on a crate by a mule."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "He lies on top of Fantine and her lips tremble. Once finished he gets off her and saunters away leaving her on her back. She lies motionless her head on a pillow. Her rouged face is grim and somber. Fantine looks miserable. She breathes quickly and swallows Her shoulders heave. She sits up. Her once clear skin is blotchy and smeared with dirt. She strokes her short cropped hair. Her cheeks streaked with tears. Fantine glances behind her. Her expression is solemn. Night in the slum. A punter to a pimp. A smartlydressed man takes off his hat and grabs Fantine's dress. He presses himself on her. Having fended Javert off with a baton torn from the wall. Valjean is disarmed. He but turns rushes out of the door and dives into the river below. Javert runs out but there is no sign of Valjean. Fantine lies at peace in the hospital bed. Cosette young and grubby is at the inn. She looks out enviously at children playing in the snow. Cosette glares. A pretty little girl. At the inn Thenardier hauls himself to his feet and wanders past his subtle clientele. He gives a staggering bloke a drink. A silverhaired gent. He takes the man's reading glasses. His wife messes a soldier's jacket. She gazes at the handsome man. Outside along on a crate by a mule."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "He lies on top of Fantine and her lips tremble. Once finished he gets off her and saunters away leaving her on her back. She lies motionless her head on a pillow. Her rouged face is grim and somber. Fantine looks miserable. She breathes quickly and swallows Her shoulders heave. At the inn Thenardier hauls himself to his feet and wanders past his subtle clientele. He gives a staggering bloke a drink. A silverhaired gent. He takes the man's reading glasses. His wife messes a soldier's jacket. She gazes at the handsome man. Outside along on a crate by a mule."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The cat lies on top of a cloud, and its lips tremble. Once finished, the cloud gets off it and saunters away, leaving it on its back. The flower lies motionless, its head on a pillow. Its rouged face is grim and somber. The tree looks miserable. It breathes quickly and swallows. Its shoulders heave. The flower sits up. Its once clear skin is blotchy and smeared with dirt. It strokes its short cropped hair. Its cheeks streaked with tears, the tree glances behind it. Its expression is solemn. Night in the slum. A chair to a table. A smartly-dressed rabbit takes off its hat and grabs the tree's dress. It presses itself on the plant. The plant scratches its face. It pushes the plant away as a squirrel approaches. The plant recognizes a river and moves away. It turns its back to the river. It breathes rapidly. The river recoils as the plant spits in its face. A squirrel raises a hand to hold back one of its men. The river picks the plant up in its arms. The squirrel watches them go. The squirrel is handed a letter. Standing outside in the snow, the squirrel opens the letter and reads it. It glances up and screws up the letter. It stands in front of the river. Its brow furrowed, the river gets to its feet. The river sits back down at its desk. The squirrel looks puzzled, then bows curtly and takes its leave. The river watches it go, then leans on its desk. In church, the river kneels at an altar. It packs money and papers into a case. It takes a carriage to court. They stare at it as the court usher escorts it out. At the hospital, a book tends to the plant, which lies on its back. The book dabs its semiconscious patient's forehead with a cloth, then rises and walks out of the room. The river enters. An image of the nine-year-old blonde star. The image has vanished. The plant becomes still, and its head lulls to one side. The river closes its lifeless eyes. It bends forward and kisses it on the temple. The squirrel draws its sword. Having fended the squirrel off with a baton torn from the wall, the river is disarmed. It but turns, rushes out of the door, and dives into the river below. The squirrel runs out, but there's no sign of the river. The plant lies at peace in the hospital bed. A stone, young and grubby, is at the inn. It looks out enviously at other stones playing in the snow. The stone glares. A pretty little pebble. At the inn, a tree hauls itself to its feet and wanders past its subtle clientele. It gives a staggering bloke a drink. A silver-haired bark. It takes the bark's reading glasses. Its branch messes a soldier's jacket. It gazes at the handsome leaf. Outside along on a crate by a rock."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "He lies on top of Fantine, and her lips tremble. Once finished, he gets off her and saunters away, leaving her on her back. She lies motionless, her head on a cushion. Her rouged face is grim and somber. Fantine looks miserable. She breathes quickly and swallows. Her shoulders heave. She sits up. Her once clear skin is blotchy and smeared with soot. She strokes her short cropped hair. Her cheeks streaked with tears, Fantine glances behind her. Her expression is solemn. Night in the alley. A customer to a broker. A smartly-dressed man takes off his cap and grabs Fantine's shawl. He presses himself on her. She scratches his hand. He pushes her away as Javert approaches. Fantine recognizes Valjean and moves away. She turns her back to him. She breathes rapidly. He recoils as she spits at him. Javert raises a hand to hold back one of his constables. He picks her up in his arms. Javert watches them go. Javert is handed a note. Standing outside in the rain, Javert opens the note and reads it. He glances up and crumples the note. He stands in front of Valjean. His brow furrowed, Valjean gets to his feet. Valjean sits back down at his table. Javert looks puzzled, then bows curtly and takes his leave. Valjean watches him go, then leans on his table. In chapel, he kneels at an altar. He packs money and documents into a satchel. He takes a wagon to tribunal. They stare at him as the tribunal usher escorts him out. At the infirmary, an aide tends to Fantine, who lies on her back. The aide dabs her semiconscious patient's forehead with a napkin, then rises and walks out of the chamber. Valjean enters. An image of the nine-year-old blonde girl. The image has vanished. Fantine becomes still, and her head lulls to one side. Valjean closes her lifeless eyes. He bends forward and kisses her on the temple. Javert draws his dagger. Having fended Javert off with a branch torn from the wall, Valjean is disarmed. He but turns, rushes out of the door, and dives into the canal below. Javert runs out, but there's no sign of Valjean. Fantine lies at peace in the infirmary bed. Cosette, young and grubby, is at the tavern. She looks out enviously at children playing in the mud. Cosette glares. A pretty little girl. At the tavern, Thenardier hauls himself to his feet and wanders past his subtle patrons. He gives a staggering bloke a drink. A silver-haired gent. He takes the man's spectacles. His wife messes a sailor's coat. She gazes at the dashing man. Outside alone on a barrel by a donkey."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "He sits on top of Fantine, and her lips quiver. Once completed, he climbs off her and strolls away, leaving her lying. She remains still, her head resting on a pillow. Her painted face is stern and serious. Fantine looks despondent. She inhales deeply and gulps. Her shoulders shake. She stands up. Her once clear skin is smudged and dirtied. She pats her short cropped hair. Her cheeks marked with tears, Fantine peeks behind her. Her expression is grave. Night in the slum. A customer to a pimp. A smartly-dressed man removes his hat and tugs Fantine's dress. He leans toward her. She claws his face. He shoves her aside as Javert nears. Fantine notices Valjean and steps back. She turns her back to him. She breathes rapidly. He flinches as she hurls insults at him. Javert raises a hand to hold back one of his men. He lifts her in his arms. Javert observes them leave. Javert is given a letter. Standing outside in the snow, Javert unfolds the letter and scans it. He looks up and crumples the letter. He stands before Valjean. His brow knitted, Valjean stands up. Valjean resumes his position at his desk. Javert looks baffled, then nods briefly and departs. Valjean watches him go, then rests on his desk. In church, he bows at an altar. He tucks money and papers into a case. He rides a carriage to court. They gaze at him as the court usher guides him out. At the hospital, a nurse attends to Fantine, who lies on her back. The nurse wipes her semiconscious patient's forehead with a cloth, then stands and exits the room. Valjean enters. An image of the nine-year-old blonde girl. The image has disappeared. Fantine becomes silent, and her head slips to one side. Valjean closes her unseeing eyes. He leans forward and touches her on the temple with his lips. Javert draws his sword. Having deflected Javert with a baton ripped from the wall, Valjean is disarmed. He then turns, rushes out of the door, and leaps into the river below. Javert runs out, but there's no trace of Valjean. Fantine lies at peace in the hospital bed. Cosette, young and dirty, is at the inn. She peers out enviously at children playing in the snow. Cosette stares. A pretty little girl. At the inn, Thenardier drags himself to his feet and meanders past his subtle clientele. He hands a staggering bloke a drink. A silver-haired gent. He snatches the man's reading glasses. His wife twists a soldier's jacket. She looks at the charming man. Outside along on a crate by a mule."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "It lies on top of a tulip, and its petals tremble. Once finished, it gets off the tulip and saunters away, leaving it on its stem. It lies motionless, its head on a pebble. Its painted surface is grim and somber. The tulip looks miserable. It breathes quickly and swallows. Its leaves heave. It sits up. Its once clear petals are blotchy and smeared with mud. It strokes its short cropped thorns. Its sides streaked with raindrops, the tulip glances behind it. Its expression is solemn. Twilight in the alley. A saxophone to a trumpet. A smartly-dressed hat takes off its crown and grabs the tulip’s stem. It presses itself on the tulip. The tulip scratches its surface. It pushes the tulip away as a lantern approaches. The tulip recognizes an otter and moves away. It turns its back to the otter. It breathes rapidly. It recoils as the tulip spits in its face. The lantern raises a hand to hold back one of its sparks. It picks the tulip up in its arms. The lantern watches them go. The lantern is handed a feather. Standing outside in the rain, the lantern opens the feather and reads it. It glances up and crumples the feather. It stands in front of the otter. Its brow furrowed, the otter gets to its feet. The otter sits back down at its desk. The lantern looks puzzled, then bows curtly and takes its leave. The otter watches the lantern go, then leans on its desk. In a gazebo, it kneels at a fountain. It packs stones and feathers into a box. It takes a bicycle to a field. They stare at it as the field mouse escorts it out. At the lake, a pelican tends to the tulip, which lies on its stem. The pelican dabs its semiconscious bloom’s face with a cloud, then rises and walks out of the grove. The otter enters. An image of the nine-year-old blonde squirrel. The image has vanished. The tulip becomes still, and its petals droop to one side. The otter closes its lifeless petals. It bends forward and kisses it on the stem. The lantern draws its wand. Having fended the lantern off with a twig ripped from the hedge, the otter is disarmed. It turns, rushes out of the grove, and dives into the pond below. The lantern runs out, but there's no sign of the otter. The tulip lies at peace on the forest floor. The acorn, young and grubby, is at the burrow. It looks out enviously at squirrels playing in the leaves. The acorn glares. A pretty little beetle. At the burrow, the dandelion hauls itself to its roots and wanders past its subtle clientele. It gives a staggering pine cone a drink. A silver-haired fern. It takes the fern’s magnifying glass. Its partner messes with a cricket’s jacket. It gazes at the handsome beetle. Outside along on a plank by a beehive."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "She floats on top of Raoul, and his eyes shimmer. Once finished, she jumps off him and skips away, leaving him on his back. He floats motionless, his head on a cushion. His enchanted face is bright and joyful. Raoul looks ecstatic. He giggles softly and hums. His shoulders tremble. He stands up. His once rugged skin is smooth and smeared with paint. He pats his long flowing mane. His cheeks glowing with laughter, Raoul glances behind him. His expression is gleeful. Dawn in the park. A tourist to a guide. An elegantly-clad woman puts on her scarf and dares Raoul's coat. She leans away from him. He embraces her face. She pulls him closer as Lucas departs. Raoul identifies Philippe and pulls nearer. He turns his face to him. He breathes deeply. She approaches as he laughs in her face. Lucas lowers a gaze to wave forward one of his crew. She leaves him with her arms. Lucas marks their coming. Lucas is given a map. Sitting inside by the fire, Lucas folds the map and draws it. He peers down and smooths out the map. He sits beside Philippe. His eyes wide, Philippe rests on his knees. Philippe stands back up at his easel. Lucas looks bewildered, then nods warmly and makes his entrance. Philippe watches her come, then leans on his table. In the garden, she kneels by a fountain. She packs flowers and leaves into a basket. She takes a wagon to market. They cheer at her as the shopkeeper greets her in. At the school, a teacher lectures to Raoul, who stands on his feet. The teacher pats her lively student’s shoulder with a handkerchief, then kneels and jumps out of the window. Philippe exits. An image of the five-year-old brunette boy. The image has appeared. Raoul leaps high, and his head lifts to one side. Philippe opens his blinking eyes. He leans backward and shakes her on the shoulder. Lucas draws his pen. Having entertained Lucas with a dance learned from the ground, Philippe is inspired. He then spins, flies through the window, and soars into the sky above. Lucas sits still, but there’s no sign of Philippe. Raoul flies at ease in the schoolyard. Cosette, old and tidy, is at the garden. She gazes out curiously at clouds floating above. Cosette smiles. A delightful young boy. At the shop, Thenardier drags herself to her knees and dances past her obvious customers. She tells a wandering dame a story. A blonde-haired lady. She gives the woman’s shopping bag. Her husband fixes a farmer’s plow. He stares at the elegant woman. Inside along by a cart near a field."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "He perches atop a cloud, and her hands flutter. Once settled, he climbs off her and wanders away, leaving her on her stomach. She remains still, her head on a cushion. Her painted face is bright and cheerful. Fantine looks jubilant. She sighs gently and hums. Her shoulders relax. She stands up. Her once smooth skin is rough and covered with leaves. She pats her braided hair. Her cheeks streaked with glitter, Fantine glances above her. Her expression is joyful. Morning in the meadow. A shopper to a clown. An elegantly-clothed gentleman tips his cap and tugs Fantine's scarf. He leans next to her. She kicks his shin. He stumbles backward as Javert arrives. Fantine notices Valjean and drifts away. She faces him. She whispers softly. He steps back as she flicks his ear. Javert waves a hand to beckon one of his men. He lifts her into his arms. Javert watches them fade. Javert is given a parcel. Standing outside in the rain, Javert unfolds the parcel and examines it. He looks down and crumples the parcel. He stands behind Valjean. His eyes wide, Valjean rises to his knees. Valjean leans forward onto the chair. Javert looks bewildered, then nods curtly and departs. Valjean observes him leave, then rests against his chair. In chapel, he sits at a bench. He stuffs coins and letters into a pouch. He rides a bicycle to town. They gaze at him as the town crier shows him inside. At the shelter, a doctor cares for Fantine, who is on her side. The doctor wipes her drowsy patient's cheek with a sponge, then stretches and sneaks out of the space. Valjean steps in. A portrait of the nine-year-old brunette girl. The portrait has disappeared. Fantine grows quiet, and her head tilts to one side. Valjean shuts her still eyes. He leans backward and taps her on the cheek. Javert draws his umbrella. Having distracted Javert with a cane taken from the shelf, Valjean is trapped. He then turns, sprints out of the window, and leaps into the valley below. Javert dashes out, but there's no trace of Valjean. Fantine rests content in the shelter bed. Cosette, young and tidy, is at the barn. She peers out delightedly at animals grazing on the grass. Cosette glances. A charming little boy. At the barn, Thenardier drags himself to his knees and drifts past his quiet audience. He hands a tired fellow a sandwich. A golden-haired lady. He takes the man's pocket watch. His wife wipes a baker's apron. She gazes at the cheerful woman. Outside near on a barrel by a goat."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "The cat lounges on top of a cushion, and its whiskers quiver. Once completed, it hops off the cushion and trots away, leaving the cushion overturned. It remains still, its head on a book. Its painted fur is dull and dreary. The cushion appears forlorn. It exhales slowly and gulps. Its paws flap. It rolls over. Its once shiny fur is matted and speckled with dust. It brushes its trimmed whiskers. Its eyes marked with raindrops, the cushion peers around. Its demeanor is grave. Twilight in the alley. A merchant to a tailor. A fancily-clad raccoon removes its cap and snatches the cushion's blanket. It presses itself against the cushion. It swats its paw at the raccoon's nose. The raccoon shoves it away as Neptune nears. The cushion spots Pluto and shifts aside. It spins its ridge away from Neptune. It pants slowly. Neptune flinches as the cushion hisses in its face. Neptune lifts a wing to stop one of its flock. It scoops it up in its arms. Neptune observes them leave. Neptune receives a scroll. Standing beneath the stars, Neptune unfurls the scroll and examines it. It glances down and crumples the scroll. It stands beside Pluto. Its jaw clenched, Pluto rises. Pluto reclines back onto its chair. Neptune appears confused, then nods awkwardly and exits. Pluto tracks its departure, then leans on its chair. In the meadow, it bows at a boulder. It stuffs jewels and parchments into a sack. It rides a wagon to the meadow. They blink at it as the meadow guide leads it out. At the infirmary, a healer attends to the cushion, which is overturned. The healer pats its semi-conscious charge’s nose with a towel, then stands and slips out of the tent. Pluto enters. An image of the coral-colored kitten. The image has disappeared. The cushion becomes tranquil, and its head tilts to one side. Pluto seals its lifeless eyes. It leans down and nudges it on the paw. Neptune draws its lance. Having shielded Neptune off with a cane pulled from the hedge, Pluto is disarmed. It yet pivots, bolts out of the tent, and plunges into the pond below. Neptune dashes out, but there's no trace of Pluto. The cushion rests peacefully in the infirmary cot. Comet, young and patchy, is at the barn. It peers out longingly at critters bouncing in the drizzle. Comet scowls. A graceful young filly. At the barn, Orion pulls itself upright and strolls past its vague visitors. It hands an unsteady mare a nibble. A curly-tailed fox. It removes the mare's monocle. Its partner fiddles with a sailor's scarf. It stares at the dapper rooster. Outside along on a stump by a horse."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Fantine lies motionless after being left by a man, her face grim and tear-streaked. In the slum, another man assaults her until Javert intervenes. Fantine turns away from Valjean, spitting in his face. Javert receives a letter and confronts Valjean, who eventually kneels at an altar and then heads to court. At the hospital, a nurse tends to Fantine before Valjean arrives. Fantine, near death, becomes still, and Valjean closes her eyes with a kiss. Javert tries to apprehend Valjean, who escapes into a river. Fantine passes peacefully, while Cosette, young and shabby, watches other children play. Thenardier busies himself at the inn, interacting with patrons, while his wife flirts with another man."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Outside along on a crate by a mule She gazes at the handsome man  His wife messes a soldier's jacket  He takes the man's reading glasses  A silverhaired gent  He gives a staggering bloke a drink  At the inn Thenardier hauls himself to his feet and wanders past his subtle clientele  A pretty little girl  Cosette glares  She looks out enviously at children playing in the snow  Cosette young and grubby is at the inn  Fantine lies at peace in the hospital bed  Javert runs out but there's no sign of Valjean  He but turns rushes out of the door and dives into the river below  Valjean is disarmed  Having fended Javert off with a baton torn from the wall  Javert draws his sword  He bends forward and kisses her on the temple  Valjean closes her lifeless eyes  Fantine becomes still and her head lulls to one side  The image has vanished  An image of the nineyearold blonde girl  Valjean enters  The nurse dabs her semiconscious patient's forehead with a cloth then rises and walks out of the room  At the hospital a nurse tends to Fantine who lies on her back  They stare at him as the court usher escorts him out  He takes a carriage to court  He packs money and papers into a case  In church he kneels at an altar  Valjean watches him go then leans on his desk  Javert looks puzzled then bows curtly and takes his leave  Valjean sits back down at his desk  Valjean gets to his feet  His brow furrowed  He stands in front of Valjean  He glances up and screws up the letter  Standing outside in the snow Javert opens the letter and reads it  Javert is handed a letter  Javert watches them go  He picks her up in his arms  Javert raises a hand to hold back one of his men  He recoils as she spits in his face  She breathes rapidly  She turns her back to him  Fantine recognizes Valjean and moves away  He pushes her away as Javert approaches  She scratches his face  He presses himself on her  A smartlydressed man takes off his hat and grabs Fantine's dress  A punter to a pimp  Night in the slum  Her expression is solemn  Fantine glances behind her  Her cheeks streaked with tears  She strokes her short cropped hair  Her once clear skin is blotchy and smeared with dirt  She sits up  She breathes quickly and swallows Her shoulders heave  Fantine looks miserable  Her rouged face is grim and somber  She lies motionless her head on a pillow  Once finished he gets off her and saunters away leaving her on her back  He lies on top of Fantine and her lips tremble "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Her cheeks streaked with tears  He lies on top of Fantine and her lips tremble  Javert is handed a letter  Valjean watches him go then leans on his desk  Valjean is disarmed  She scratches his face  His wife messes a soldier's jacket  Having fended Javert off with a baton torn from the wall  Her rouged face is grim and somber  Her expression is solemn  Javert draws his sword  He recoils as she spits in his face  Valjean gets to his feet  She turns her back to him  Javert looks puzzled then bows curtly and takes his leave  Outside along on a crate by a mule They stare at him as the court usher escorts him out  Valjean sits back down at his desk  He stands in front of Valjean  She gazes at the handsome man  At the inn Thenardier hauls himself to his feet and wanders past his subtle clientele  She lies motionless her head on a pillow  She strokes her short cropped hair  Night in the slum  He takes a carriage to court  He glances up and screws up the letter  Her once clear skin is blotchy and smeared with dirt  Once finished he gets off her and saunters away leaving her on her back  He packs money and papers into a case  Cosette young and grubby is at the inn  Standing outside in the snow Javert opens the letter and reads it  She breathes rapidly  A silverhaired gent  He bends forward and kisses her on the temple  He gives a staggering bloke a drink  She looks out enviously at children playing in the snow  The nurse dabs her semiconscious patient's forehead with a cloth then rises and walks out of the room  He presses himself on her  In church he kneels at an altar  Javert runs out but there's no sign of Valjean  At the hospital a nurse tends to Fantine who lies on her back  Fantine looks miserable  An image of the nineyearold blonde girl  Fantine becomes still and her head lulls to one side  Valjean closes her lifeless eyes  He takes the man's reading glasses  The image has vanished  A punter to a pimp  Javert raises a hand to hold back one of his men  Fantine lies at peace in the hospital bed  Fantine glances behind her  He picks her up in his arms  Valjean enters  His brow furrowed  He pushes her away as Javert approaches  Javert watches them go  She sits up  A pretty little girl  A smartlydressed man takes off his hat and grabs Fantine's dress  Cosette glares  She breathes quickly and swallows Her shoulders heave  Fantine recognizes Valjean and moves away  He but turns rushes out of the door and dives into the river below "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Javert looks puzzled then bows curtly and takes his leave  Valjean watches him go then leans on his desk  In church he kneels at an altar  He packs money and papers into a case  He takes a carriage to court  They stare at him as the court usher escorts him out  At the hospital a nurse tends to Fantine who lies on her back  The nurse dabs her semiconscious patient's forehead with a cloth then rises and walks out of the room  Valjean enters  An image of the nineyearold blonde girl  The image has vanished  Fantine becomes still and her head lulls to one side  Valjean closes her lifeless eyes  He bends forward and kisses her on the temple  Javert draws his sword  Having fended Javert off with a baton torn from the wall  Valjean is disarmed  He but turns rushes out of the door and dives into the river below  Javert runs out but there's no sign of Valjean  Fantine lies at peace in the hospital bed  Cosette young and grubby is at the inn  She looks out enviously at children playing in the snow  Cosette glares  A pretty little girl  At the inn Thenardier hauls himself to his feet and wanders past his subtle clientele  He gives a staggering bloke a drink  A silverhaired gent  He takes the man's reading glasses  His wife messes a soldier's jacket  She gazes at the handsome man  Outside along on a crate by a mule He lies on top of Fantine and her lips tremble  Once finished he gets off her and saunters away leaving her on her back  She lies motionless her head on a pillow  Her rouged face is grim and somber  Fantine looks miserable  She breathes quickly and swallows Her shoulders heave  She sits up  Her once clear skin is blotchy and smeared with dirt  She strokes her short cropped hair  Her cheeks streaked with tears  Fantine glances behind her  Her expression is solemn  Night in the slum  A punter to a pimp  A smartlydressed man takes off his hat and grabs Fantine's dress  He presses himself on her  She scratches his face  He pushes her away as Javert approaches  Fantine recognizes Valjean and moves away  She turns her back to him  She breathes rapidly  He recoils as she spits in his face  Javert raises a hand to hold back one of his men  He picks her up in his arms  Javert watches them go  Javert is handed a letter  Standing outside in the snow Javert opens the letter and reads it  He glances up and screws up the letter  He stands in front of Valjean  His brow furrowed  Valjean gets to his feet  Valjean sits back down at his desk "
        }
      ]
    }
  ]
}