{
  "ground_truth": "A beam of light shines out from a lighthouse and sweeps across a shimmering blue ocean. The woman, Kate Armstrong, raises her eyebrows. In a tidy restaurant kitchen, Kate, a pretty brunette in her late 30s, ties a dazzling white chef's apron around her waist. She checks some orders attached to a shelf. Kate steps into a walk-in fridge and leans wearily against a rack. In the restaurant, she chats to a middle-aged couple. Mr. and Mrs. Peterson leave. Kate shakes hands with another couple and makes her way back through the restaurant. Ken and his wife walk off. In the kitchen, to her chefs, the busy chefs carry on with what they're doing. Holding two plates of food, Kate turns around, her lips pursed as she contemplates their response. Snow falls as Kate walks along a New York street. Her long hair, previously tied up in a bun, now hangs loose under a black beret. She steps through her front door into a modest apartment. She drops her keys into a bowl on top of a cabinet and places some mail down beside it. She checks her phone messages. Kate's fast asleep in bed. Kate blearily raises her head and reaches out and turns off her alarm clock. It's half past four. At a fish market, Kate's cooking at home. Kate wears a blue apron over her black top and jeans. She hurries to answer the phone. Kate walks down a flight of stairs in her apartment building. Seeing a neighbor, she turns back. Kate carries on down the stairs, as Sean goes into his apartment. She walks back up the curving staircase to her apartment. She unlocks the door and opens it, stands beside it for a few seconds then closes it again. At her therapist's, Kate garnishes a plate of food. She sits down as he tucks in. Kate turns away. At the restaurant, the waitress collides with a colleague. Pregnant Leah takes the bottle. The waitress, Bernadette, gets it. Kate reluctantly walks over to the phone. Kate turns away from the hubbub of the kitchen as she listens. Her eyes fill with tears. Kate runs down a hospital corridor. She stops at the reception desk and speaks to a nurse, who points to a room opposite. Kate walks into the room, where young Zoe is lying in bed, her eyes closed. Kate walks around the bed and looks down sadly at her niece, who has grazes above and below her right eye. A balding doctor in his 40s stands in the open doorway. Dr. Barton pats Kate on the shoulder and walks away. She stares through the window at the sleeping Zoe. Kate's asleep on a chair next to Zoe's bed.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "A ray of illumination gleams out from a beacon and sweeps across a glistening azure sea. The lady, Kate Armstrong, lifts her eyebrows. In an orderly eatery kitchen, Kate, an attractive brunette in her late 30s, ties a radiant white chef's apron around her waist. She checks some requests attached to a ledge. Kate steps into a walk-in cooler and leans tiredly against a shelf. In the eatery, she converses with a middle-aged pair. Mr. and Mrs. Peterson depart. Kate shakes hands with another pair and makes her way back through the eatery. Ken and his spouse stroll away. In the kitchen, to her cooks, the occupied cooks carry on with what they're doing. Holding two dishes of cuisine, Kate turns around, her lips pursed as she considers their reaction. Snow descends as Kate walks along a New York roadway. Her long hair, formerly tied up in a bun, now hangs free under a black beret. She steps through her front entrance into a modest flat. She drops her keys into a bowl on top of a cupboard and places some correspondence down beside it. She checks her phone messages. Kate's fast asleep in bed. Kate drowsily lifts her head and reaches out and turns off her alarm clock. It's half past four. At a fish market, Kate's cooking at home. Kate wears a blue apron over her black top and jeans. She hurries to answer the phone. Kate walks down a flight of stairs in her flat building. Seeing a neighbor, she turns back. Kate continues down the stairs, as Sean goes into his flat. She walks back up the winding staircase to her flat. She unlocks the entrance and opens it, stands beside it for a few seconds then shuts it again. At her therapist's, Kate adorns a dish of cuisine. She sits down as he tucks in. Kate turns away. At the eatery, the waitress collides with a colleague. Expectant Leah takes the bottle. The waitress, Bernadette, gets it. Kate reluctantly walks over to the phone. Kate turns away from the commotion of the kitchen as she listens. Her eyes fill with tears. Kate runs down a hospital corridor. She stops at the reception desk and speaks to a nurse, who points to a room opposite. Kate walks into the room, where young Zoe is lying in bed, her eyes closed. Kate walks around the bed and looks down sadly at her niece, who has grazes above and below her right eye. A balding physician in his 40s stands in the open doorway. Dr. Barton pats Kate on the shoulder and walks away. She stares through the window at the sleeping Zoe. Kate's asleep on a chair next to Zoe's bed."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "A beam of light is shone out from a lighthouse and is swept across a shimmering blue ocean. Kate Armstrong, the woman, has her eyebrows raised by surprise. In a tidy restaurant kitchen, a dazzling white chef's apron is tied around Kate's waist by her, a pretty brunette in her late 30s. Some orders attached to a shelf are checked by her. A walk-in fridge is stepped into by Kate, and a rack is leaned against by her wearily. In the restaurant, a chat is struck by her with a middle-aged couple. Mr. and Mrs. Peterson are left by her. Hands are shaken by Kate with another couple, and her way is made back through the restaurant by her. Ken and his wife are walked off by themselves. In the kitchen, the busy chefs are carried on with what they're doing by them. Two plates of food are held by Kate as she turns around, her lips pursed while the response is contemplated by her. Snow is fallen as a New York street is walked along by Kate. Her long hair, previously tied up in a bun, is now hung loose under a black beret by her. Her front door is stepped through by her into a modest apartment. Her keys are dropped into a bowl on top of a cabinet, and some mail is placed down beside it by her. Her phone messages are checked by her. Kate is fast asleep in bed. Her head is raised blearily by her, and the alarm clock is reached out to and turned off by her. It's half past four. At a fish market, cooking is done by Kate at home. A blue apron is worn by Kate over her black top and jeans. The phone is hurried to by her to answer it. A flight of stairs in her apartment building is walked down by Kate. Seeing a neighbor, turning back is done by her. The stairs are carried on down by Kate, as her apartment is entered by Sean. The curving staircase is walked back up by her to her apartment. The door is unlocked and opened by her; standing beside it for a few seconds is done by her, then it is closed again. At her therapist's, a plate of food is garnished by Kate. Sitting down is done by her as the therapist tucks in. Turning away is done by Kate. At the restaurant, a collision is caused by the waitress with a colleague. A bottle is taken by pregnant Leah. It is gotten by the waitress, Bernadette. Kate reluctantly walks over to the phone. The hubbub of the kitchen is turned away from by Kate as she listens. Tears fill her eyes. A hospital corridor is run down by Kate. The reception desk is stopped at by her, and a nurse, who points to a room opposite, is spoken to by her. The room is walked into by Kate, where young Zoe is lying in bed, her eyes closed. The bed is walked around by Kate, and she looks down sadly at her niece, who bears grazes above and below her right eye. A balding doctor in his 40s stands in the open doorway. Kate is patted on the shoulder by Dr. Barton, and walking away is done by him. Through the window, staring at the sleeping Zoe is done by her. Kate is asleep on a chair next to Zoe's bed."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "A lighthouse beam sweeps across a shimmering blue ocean. Kate Armstrong, a pretty brunette in her late 30s, ties a white chef's apron in a tidy restaurant kitchen and checks orders. She leans wearily in a walk-in fridge. In the restaurant, she chats with Mr. and Mrs. Peterson, then shakes hands with another couple. In the kitchen, busy chefs continue working. Holding two plates, Kate contemplates their response. Snow falls as she walks along a New York street, her hair loose under a black beret. At home, she drops her keys and mail, checks phone messages, and falls asleep. At 4:30, she turns off her alarm. At a fish market, she cooks at home, wearing a blue apron. She answers the phone, walks down her apartment stairs, sees a neighbor, and returns. At her therapist's, she garnishes a plate and turns away. At the restaurant, a waitress collides with a colleague. Pregnant Leah takes a bottle. Bernadette gets it. Kate reluctantly answers the phone, tears filling her eyes. She runs down a hospital corridor, speaks to a nurse, and enters a room where young Zoe lies in bed with grazes. Dr. Barton pats Kate's shoulder and leaves. Kate stares at sleeping Zoe and falls asleep on a chair next to her."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "A lighthouse beam sweeps over a shimmering ocean. Kate Armstrong raises her eyebrows. In a clean restaurant kitchen, brunette Kate, late 30s, ties on a white chef’s apron. She checks orders, enters a walk-in fridge, leans tiredly on a rack. She chats with the Petersons, who leave. She shakes hands with another couple. Ken and his wife leave. In the kitchen, chefs continue working. Holding two plates, Kate turns, lips pursed. Snow falls as she walks a New York street, hair loose under a black beret. At home, she drops keys in a bowl, places mail down, checks her phone. Asleep, she wakes at 4:30, turns off her alarm. At a fish market, then cooking at home, she wears a blue apron over black top and jeans. She hurries to the phone, walks downstairs, sees a neighbor, turns back. Sean enters his apartment. She goes upstairs, unlocks and briefly opens her door. At therapy, Kate garnishes a plate, sits as her therapist eats, then turns away. At the restaurant, a waitress bumps into a colleague. Pregnant Leah takes a bottle; Bernadette gets it. Kate reluctantly answers the phone, listens, tearful. She runs through a hospital, speaks to a nurse, enters Zoe’s room. Zoe lies in bed, grazes on her face. Kate sadly watches her. Dr. Barton pats her shoulder and leaves. Kate gazes out the window, later asleep by Zoe’s side."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "A brilliant beam of light emanates from the towering lighthouse, casting its glow across the vast, shimmering expanse of the blue ocean. The woman, Kate Armstrong, raises her eyebrows in response to the sight. In a meticulously organized restaurant kitchen, Kate, a striking brunette in her late 30s, carefully ties a dazzlingly white chef's apron securely around her waist. She meticulously checks several orders that are neatly attached to a shelf. Kate steps into a spacious walk-in fridge and leans wearily against a sturdy rack. In the bustling restaurant, she engages in a friendly chat with a middle-aged couple. Mr. and Mrs. Peterson eventually take their leave. Kate shakes hands with another couple and makes her way back through the lively restaurant. Ken and his wife walk off in another direction. In the kitchen, the busy chefs continue diligently with their tasks. Holding two plates of food, Kate turns around, her lips pursed thoughtfully as she contemplates their response. Snow gently falls as Kate walks along a bustling New York street. Her long hair, which was previously tied up in a neat bun, now hangs loose under a stylish black beret. She steps through her front door into a modest, cozy apartment. She drops her keys into a bowl perched on top of a cabinet and places some mail down beside it. She checks her phone messages with a quick glance. Kate is fast asleep in her bed. She blearily raises her head and reaches out to turn off her alarm clock. It's half past four in the morning. At a bustling fish market, Kate is cooking at home. She wears a blue apron over her black top and jeans. She hurries to answer the ringing phone. Kate walks down a flight of stairs in her apartment building. Upon seeing a neighbor, she turns back momentarily. Kate continues down the stairs as Sean goes into his apartment. She then walks back up the curving staircase to her own apartment. She unlocks the door and opens it, stands beside it for a few seconds, then closes it again. At her therapist's office, Kate garnishes a plate of food with precision. She sits down as he begins to eat. Kate turns away, lost in thought. At the restaurant, a waitress collides with a colleague. Pregnant Leah takes the bottle, and the waitress, Bernadette, retrieves it. Kate reluctantly walks over to the phone. She turns away from the bustling hubbub of the kitchen as she listens intently. Her eyes fill with tears. Kate runs down a hospital corridor with urgency. She stops at the reception desk and speaks to a nurse, who points to a room opposite. Kate walks into the room, where young Zoe is lying in bed, her eyes closed. Kate walks around the bed and looks down sadly at her niece, who has grazes above and below her right eye. A balding doctor in his 40s stands in the open doorway. Dr. Barton gently pats Kate on the shoulder and walks away. She stares through the window at the sleeping Zoe. Kate is asleep on a chair next to Zoe's bed."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "A brilliant, radiant beam of light emanates majestically from the towering lighthouse, casting its bright, guiding glow across the vast, shimmering expanse of the deep blue ocean. The woman, Kate Armstrong, raises her eyebrows in response to this awe-inspiring sight. In a meticulously organized restaurant kitchen, Kate, a striking brunette in her late 30s, carefully and methodically ties a dazzlingly white chef's apron securely around her waist. She meticulously checks several orders that are neatly attached to a shelf above the counter. With a purposeful stride, Kate steps into the spacious walk-in fridge and leans wearily against a sturdy, metallic rack. In the bustling, lively restaurant, she engages in a friendly chat with a middle-aged couple. Mr. and Mrs. Peterson eventually take their leave, continuing their evening. Kate shakes hands warmly with another couple and makes her way back through the lively restaurant space, filled with the hum of conversation. Ken and his wife walk off slowly in another direction. In the kitchen, the busy, focused chefs continue diligently with their tasks, chopping and stirring with precision. Holding two beautifully plated dishes, Kate turns around, her lips pursed thoughtfully as she contemplates the diners' response. Snow gently falls like a soft blanket as Kate walks along a bustling New York street. Her long, flowing hair, which was previously tied up in a neat, tidy bun, now hangs loose under a stylish black beret. She steps through her front door into a modest, cozy apartment filled with warmth. She drops her keys into a decorative bowl perched on top of a wooden cabinet and places some mail down beside it. She checks her phone messages with a quick, efficient glance. Later, Kate is fast asleep in her comfortable bed. She blearily raises her head, bleary-eyed, and reaches out to turn off her alarm clock. It's half past four in the early morning. At a bustling fish market, Kate is cooking at home. She wears a blue apron over her black top and jeans, moving with practiced ease. She hurries to answer the ringing phone. Kate walks down a flight of stairs in her apartment building. Upon seeing a neighbor, she turns back momentarily. Kate continues down the stairs, even as Sean goes into his apartment. She then walks back up the curving staircase to her own apartment. She unlocks the door and opens it, stands beside it for a few contemplative seconds, then closes it again. At her therapist's office, Kate garnishes a plate of food with precision and artistry. She sits down quietly as he begins to eat. Kate turns away, lost in her own introspective thoughts. At the restaurant, a waitress collides with a colleague, both bustling through their busy shifts. Pregnant Leah takes the bottle, and the waitress, Bernadette, retrieves it without missing a beat. Kate reluctantly walks over to the phone. She turns away from the bustling hubbub of the kitchen as she listens intently. Her eyes fill with tears, glistening with emotion. With urgency in her steps, Kate runs down a hospital corridor. She stops at the bustling reception desk and speaks to a nurse, who points to a room opposite. Kate walks into the dimly lit room, where young Zoe is lying still in bed, her eyes gently closed. Kate walks slowly around the bed and looks down sadly at her niece, who has grazes above and below her right eye. A balding doctor in his 40s stands in the open doorway, exuding a calm presence. Dr. Barton gently pats Kate on the shoulder, offering silent comfort, then walks away. She stares thoughtfully through the window at the sleeping Zoe. Kate is later asleep on a chair next to Zoe's bed, her presence a silent vigil."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "A beam of light emerges from the lighthouse, casting its glow across the shimmering blue ocean, creating a rhythmic sweep that illuminates the water's surface. Kate Armstrong, observing this scene, raises her eyebrows in a moment of contemplation. In the tidy restaurant kitchen, Kate, a pretty brunette in her late 30s, meticulously ties a dazzling white chef's apron around her waist, ensuring it is snug and secure. She then turns her attention to the orders attached to a shelf, scanning them with a practiced eye to prioritize her tasks. With a slight sigh, she steps into the walk-in fridge, feeling the cool air envelop her as she leans wearily against a rack, taking a brief moment to gather her thoughts. Back in the restaurant, she engages in a friendly chat with a middle-aged couple, Mr. and Mrs. Peterson, exchanging pleasantries before they leave. As they depart, Kate shakes hands with another couple, offering a warm farewell, and makes her way back through the bustling restaurant. Ken and his wife walk off, and in the kitchen, the chefs continue their work with focused intensity. Holding two plates of food, Kate turns around, her lips pursed in concentration as she contemplates the chefs' response to her dishes. Snowflakes gently fall as Kate walks along a New York street, her long hair, previously tied up in a bun, now cascading loosely under a black beret. She steps through her front door into her modest apartment, the warmth of the space welcoming her. She drops her keys into a bowl atop a cabinet, the metallic clink echoing softly, and places some mail down beside it. She checks her phone messages, scrolling through them with a quick glance. Later, Kate is fast asleep in bed, her breathing steady and calm. As the alarm clock rings, she blearily raises her head, reaching out to silence it, noting the time is half past four. At a fish market, she is seen cooking at home, wearing a blue apron over her black top and jeans, moving with efficiency. The phone rings, and she hurries to answer it, her steps quick and purposeful. Descending a flight of stairs in her apartment building, she spots a neighbor and momentarily turns back, acknowledging them with a nod. She continues down the stairs as Sean enters his apartment, then retraces her steps back up the curving staircase to her own apartment. She unlocks the door, opens it, and stands beside it for a few seconds, lost in thought, before closing it again. At her therapist's office, Kate garnishes a plate of food with precision, then sits down as the therapist begins to eat, turning away to give him privacy. In the restaurant, a waitress collides with a colleague, causing a brief commotion. Pregnant Leah takes the bottle, and the waitress, Bernadette, retrieves it. Kate reluctantly approaches the phone, her steps hesitant, and turns away from the kitchen's hubbub as she listens to the call, her eyes welling with tears. She then runs down a hospital corridor, her footsteps echoing in the sterile environment, stopping at the reception desk to speak with a nurse who points to a room opposite. Kate walks into the room, where young Zoe lies in bed, her eyes closed, and Kate walks around the bed, looking down sadly at her niece, noting the grazes above and below her right eye. A balding doctor in his 40s, Dr. Barton, stands in the open doorway, offering a comforting pat on Kate's shoulder before walking away. Kate stares through the window at the sleeping Zoe, her heart heavy with concern. Eventually, Kate falls asleep on a chair next to Zoe's bed, her head resting against the backrest, as the room remains quiet and still."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "A beam of light from a lighthouse sweeps across a shimmering blue ocean as Kate Armstrong, a pretty brunette in her late 30s, raises her eyebrows. In a tidy restaurant kitchen, she ties a dazzling white chef's apron around her waist, checks some orders, and steps into a walk-in fridge, leaning wearily against a rack. After chatting with a middle-aged couple, Mr. and Mrs. Peterson, and shaking hands with another couple, she returns to the kitchen, where she observes her busy chefs while holding two plates of food, contemplating their response. Snow falls as Kate walks along a New York street, her long hair now loose under a black beret. She enters her modest apartment, drops her keys into a bowl, places some mail beside it, and checks her phone messages before falling asleep. At half past four, she blearily turns off her alarm clock. Later, at a fish market, she cooks at home wearing a blue apron over her black top and jeans, hurrying to answer the phone. She descends a flight of stairs in her apartment building, briefly interacts with a neighbor, and then returns to her apartment. At her therapist's, she garnishes a plate of food, sits down as he eats, and then turns away. Back at the restaurant, a waitress collides with a colleague, and pregnant Leah takes a bottle. Kate reluctantly answers the phone, turns away from the kitchen's hubbub, and her eyes fill with tears. She rushes down a hospital corridor, speaks to a nurse at the reception desk, and enters a room where her niece Zoe lies in bed with grazes above and below her right eye. Dr. Barton, a balding doctor in his 40s, pats Kate on the shoulder and leaves. Kate stares through the window at the sleeping Zoe and eventually falls asleep on a chair next to her bed."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "A beam of light, emanating from the historic Montauk Point Lighthouse known for guiding countless ships safely through treacherous waters, shines out and sweeps across a shimmering blue ocean. The woman, Kate Armstrong, raises her eyebrows in thought. In a tidy restaurant kitchen, Kate, a pretty brunette chef in her late 30s renowned for her culinary skills, ties a dazzling white chef's apron around her waist. She checks some orders attached to a shelf with the precision of someone who has trained in the prestigious culinary schools of Paris. Kate steps into a walk-in fridge designed to store perishables at optimal temperatures and leans wearily against a rack. In the restaurant, she chats to a middle-aged couple, patrons enjoying their anniversary dinner. Mr. and Mrs. Peterson leave, expressing their compliments on the meal. Kate shakes hands with another couple and makes her way back through the bustling restaurant, known for its innovative menu. Ken and his wife walk off, satisfied with their dining experience. In the kitchen, to her chefs, the busy chefs carry on with what they're doing, maintaining the rhythm of a well-practiced team. Holding two plates of food crafted with fresh, locally sourced ingredients, Kate turns around, her lips pursed as she contemplates their response with the scrutiny of a chef dedicated to her craft. Snow falls as Kate walks along a New York street, the city's iconic skyline silhouetted in the distance. Her long hair, previously tied up in a bun, now hangs loose under a black beret, reminiscent of the Parisian fashion she admires. She steps through her front door into a modest apartment located on the Upper East Side, decorated simply but tastefully. She drops her keys into a bowl on top of a cabinet and places some mail down beside it, bills and postcards mingling together. She checks her phone messages. Kate's fast asleep in bed, exhausted from another long day. Kate blearily raises her head and reaches out to turn off her alarm clock. It's half past four, the early hour a testament to her demanding schedule as a chef. At a bustling fish market, known for its fresh catches from the Atlantic, Kate's cooking at home. Kate wears a blue apron over her black top and jeans, a casual look for her personal kitchen endeavors. She hurries to answer the phone, wondering if it might be an important call about the restaurant. Kate walks down a flight of stairs in her pre-war apartment building, the creaky wooden steps echoing underfoot. Seeing a neighbor, she turns back, not in the mood for small talk. Kate carries on down the stairs, as Sean, a friendly neighbor she's known for years, goes into his apartment. She walks back up the curving staircase to her apartment. She unlocks the door and opens it, stands beside it for a few seconds considering the solitude, then closes it again. At her therapist's, an inviting room filled with calming artwork, Kate garnishes a plate of food with the flair of a perfectionist. She sits down as he tucks in, appreciating her culinary creation. Kate turns away, lost in her thoughts. At the restaurant, the waitress collides with a colleague, a common mishap in the fast-paced environment. Pregnant Leah takes the bottle, ensuring it's stored safely. The waitress, Bernadette, gets it, her quick reflexes preventing a spill. Kate reluctantly walks over to the phone, expecting yet another call that demands her attention. Kate turns away from the hubbub of the kitchen as she listens to news that instantly changes her day. Her eyes fill with tears, a rare moment of vulnerability. Kate runs down a hospital corridor, her footsteps echoing loudly in the quiet halls. She stops at the reception desk and speaks to a nurse, who points to a room opposite, where family waits. Kate walks into the room, where young Zoe, her spirited niece who loves to draw, is lying in bed, her eyes closed. Kate walks around the bed and looks down sadly at Zoe, who has grazes above and below her right eye from the recent accident. A balding doctor in his 40s, known to many families for his compassionate care, stands in the open doorway. Dr. Barton pats Kate on the shoulder, offering silent support, and walks away. She stares through the window at the sleeping Zoe, feeling the weight of uncertainty. Kate's asleep on a chair next to Zoe's bed, keeping vigil through the night."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "A beam of light shines out from a lighthouse and sweeps across a shimmering blue ocean  The woman Kate Armstrong raises her eyebrows  In a tidy restaurant kitchen Kate a pretty brunette in her late 30s ties a dazzling white chef's apron around her waist  She checks some orders attached to a shelf  Kate steps into a walkin fridge and leans wearily against a rack  In the restaurant she chats to a middleaged couple  Mr and Mrs Peterson leave  Kate wears a blue apron over her black top and jeans  She hurries to answer the phone  Kate walks down a flight of stairs in her apartment building  Seeing a neighbor she turns back  Kate carries on down the stairs as Sean goes into his apartment  She walks back up the curving staircase to her apartment  She unlocks the door and opens it stands beside it for a few seconds then closes it again  At her therapist's Kate garnishes a plate of food  She sits down as he tucks in  Kate turns away  At the restaurant the waitress collides with a colleague  Pregnant Leah takes the bottle  The waitress Bernadette gets it  Kate reluctantly walks over to the phone  Kate turns away from the hubbub of the kitchen as she listens  Her eyes fill with tears  Kate runs down a hospital corridor  She stops at the reception desk and speaks to a nurse who points to a room opposite  Kate walks into the room where young Zoe is lying in bed her eyes closed  Kate walks around the bed and looks down sadly at her niece who has grazes above and below her right eye  A balding doctor in his 40s stands in the open doorway  Dr Barton pats Kate on the shoulder and walks away  Kate shakes hands with another couple and makes her way back through the restaurant  Ken and his wife walk off  In the kitchen to her chefs the busy chefs carry on with what they're doing  Holding two plates of food Kate turns around her lips pursed as she contemplates their response  Snow falls as Kate walks along a New York street  Her long hair previously tied up in a bun now hangs loose under a black beret  She steps through her front door into a modest apartment  She drops her keys into a bowl on top of a cabinet and places some mail down beside it  She checks her phone messages  Kate's fast asleep in bed  Kate blearily raises her head and reaches out and turns off her alarm clock  It's half past four  At a fish market Kate's cooking at home  Kate wears a blue apron over her black top and jeans  She hurries to answer the phone  Kate walks down a flight of stairs in her apartment building  Seeing a neighbor she turns back  Kate carries on down the stairs as Sean goes into his apartment  She walks back up the curving staircase to her apartment  She unlocks the door and opens it stands beside it for a few seconds then closes it again  At her therapist's Kate garnishes a plate of food  She sits down as he tucks in  Kate turns away  At the restaurant the waitress collides with a colleague  Pregnant Leah takes the bottle  The waitress Bernadette gets it  Kate reluctantly walks over to the phone  Kate turns away from the hubbub of the kitchen as she listens  Her eyes fill with tears  Kate runs down a hospital corridor  She stops at the reception desk and speaks to a nurse who points to a room opposite  Kate walks into the room where young Zoe is lying in bed her eyes closed  Kate walks around the bed and looks down sadly at her niece who has grazes above and below her right eye  A balding doctor in his 40s stands in the open doorway  Dr Barton pats Kate on the shoulder and walks away  She stares through the window at the sleeping Zoe  Kate's asleep on a chair next to Zoe's bed"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "A beam of light shines out from a lighthouse and sweeps across a shimmering blue ocean. The woman Kate Armstrong raises her eyebrows. In a tidy restaurant kitchen Kate a pretty brunette in her late 30s ties a dazzling white chef's apron around her waist. She checks some orders attached to a shelf. Kate steps into a walkin fridge and leans wearily against a rack. In the restaurant she chats to a middleaged couple. Mr and Mrs Peterson leave. Kate shakes hands with another couple and makes her way back through the restaurant. Ken and his wife walk off. In the kitchen to her chefs the busy chefs carry on with what they are doing. Holding two plates of food Kate turns around her lips pursed as she contemplates their response. Snow falls as Kate walks along a New York street. Her long hair previously tied up in a bun now hangs loose under a black beret. She steps through her front door into a modest apartment. She drops her keys into a bowl on top of a cabinet and places some mail down beside it. She checks her phone messages. Kate's fast asleep in bed. Kate blearily raises her head and reaches out and turns off her alarm clock. It is half past four. At a fish market Kate's cooking at home. Kate wears a blue apron over her black top and jeans. She hurries to answer the phone. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. Kate walks down a flight of stairs in her apartment building. Seeing a neighbor she turns back. Kate carries on down the stairs as Sean goes into his apartment. She walks back up the curving staircase to her apartment. She unlocks the door and opens it stands beside it for a few seconds then closes it again. At her therapist's Kate garnishes a plate of food. She sits down as he tucks in. Kate turns away. At the restaurant the waitress collides with a colleague. Pregnant Leah takes the bottle. The waitress Bernadette gets it. Kate reluctantly walks over to the phone. Kate turns away from the hubbub of the kitchen as she listens. Her eyes fill with tears. Kate runs down a hospital corridor. She stops at the reception desk and speaks to a nurse who points to a room opposite. Kate walks into the room where young Zoe is lying in bed her eyes closed. Kate walks around the bed and looks down sadly at her niece who has grazes above and below her right eye. A balding doctor in his 40s stands in the open doorway. Dr Barton pats Kate on the shoulder and walks away. She stares through the window at the sleeping Zoe. Kate's asleep on a chair next to Zoe's bed."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "A beam of light shines out from a lighthouse and sweeps across a shimmering blue ocean. The woman Kate Armstrong raises her eyebrows. In a tidy restaurant kitchen Kate a pretty brunette in her late 30s ties a dazzling white chef's apron around her waist. She checks some orders attached to a shelf. Kate steps into a walkin fridge and leans wearily against a rack. In the restaurant she chats to a middleaged couple. Mr and Mrs Peterson leave. Kate shakes hands with another couple and makes her way back through the restaurant. Ken and his wife walk off. In the kitchen to her chefs the busy chefs carry on with what they are doing. Holding two plates of food Kate turns around her lips pursed as she contemplates their response. Snow falls as Kate walks along a New York street. Her long hair previously tied up in a bun now hangs loose under a black beret. She steps through her front door into a modest apartment. She drops her keys into a bowl on top of a cabinet and places some mail down beside it. She checks her phone messages. Kate's fast asleep in bed. Kate blearily raises her head and reaches out and turns off her alarm clock. It is half past four. At a fish market Kate's cooking at home. Kate wears a blue apron over her black top and jeans. She hurries to answer the phone. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Kate walks down a flight of stairs in her apartment building. Seeing a neighbor she turns back. Kate carries on down the stairs as Sean goes into his apartment. She walks back up the curving staircase to her apartment. She unlocks the door and opens it stands beside it for a few seconds then closes it again. At her therapist's Kate garnishes a plate of food. She sits down as he tucks in. Kate turns away. At the restaurant the waitress collides with a colleague. Pregnant Leah takes the bottle. The waitress Bernadette gets it. Kate reluctantly walks over to the phone. Kate turns away from the hubbub of the kitchen as she listens. Her eyes fill with tears. Kate runs down a hospital corridor. She stops at the reception desk and speaks to a nurse who points to a room opposite. Kate walks into the room where young Zoe is lying in bed her eyes closed. Kate walks around the bed and looks down sadly at her niece who has grazes above and below her right eye. A balding doctor in his 40s stands in the open doorway. Dr Barton pats Kate on the shoulder and walks away. She stares through the window at the sleeping Zoe. Kate's asleep on a chair next to Zoe's bed."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "A beam of light shines out from a lighthouse and sweeps across a shimmering blue ocean. The woman Kate Armstrong raises her eyebrows. In a tidy restaurant kitchen Kate a pretty brunette in her late 30s ties a dazzling white chef's apron around her waist. She checks some orders attached to a shelf. Kate steps into a walkin fridge and leans wearily against a rack. In the restaurant she chats to a middleaged couple. Mr and Mrs Peterson leave. Kate shakes hands with another couple and makes her way back through the restaurant. Ken and his wife walk off. In the kitchen to her chefs the busy chefs carry on with what they are doing. Holding two plates of food Kate turns around her lips pursed as she contemplates their response. Kate reluctantly walks over to the phone. Kate turns away from the hubbub of the kitchen as she listens. Her eyes fill with tears. Kate runs down a hospital corridor. She stops at the reception desk and speaks to a nurse who points to a room opposite. Kate walks into the room where young Zoe is lying in bed her eyes closed. Kate walks around the bed and looks down sadly at her niece who has grazes above and below her right eye. A balding doctor in his 40s stands in the open doorway. Dr Barton pats Kate on the shoulder and walks away. She stares through the window at the sleeping Zoe. Kate's asleep on a chair next to Zoe's bed."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "A beam of light shines out from a lighthouse and sweeps across a shimmering blue ocean. The woman Kate Armstrong raises her eyebrows. In a tidy restaurant kitchen Kate a pretty brunette in her late 30s ties a dazzling white chef's apron around her waist. She checks some orders attached to a shelf. Kate steps into a walkin fridge and leans wearily against a rack. A balding doctor in his 40s stands in the open doorway. Dr Barton pats Kate on the shoulder and walks away. She stares through the window at the sleeping Zoe. Kate's asleep on a chair next to Zoe's bed."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "A beam of light shines out from a lighthouse and sweeps across a shimmering blue ocean. The cat, Lucy Whiskers, raises her eyebrows. In a tidy restaurant kitchen, Lucy, a pretty brunette in her late 30s, ties a dazzling white chef's apron around her waist. She checks some orders attached to a shelf. Lucy steps into a walk-in fridge and leans wearily against a rack. In the restaurant, she chats to a middle-aged couple. Mr. and Mrs. Smith leave. Lucy shakes hands with another couple and makes her way back through the restaurant. Alex and his wife walk off. In the kitchen, to her chefs, the busy dogs carry on with what they're doing. Holding two plates of food, Lucy turns around, her lips pursed as she contemplates their response. Snow falls as Lucy walks along a New York street. Her long hair, previously tied up in a bun, now hangs loose under a black beret. She steps through her front door into a modest apartment. She drops her keys into a bowl on top of a cabinet and places some mail down beside it. She checks her phone messages. Lucy's fast asleep in bed. Lucy blearily raises her head and reaches out and turns off her alarm clock. It's half past four. At a fish market, Lucy's cooking at home. Lucy wears a blue apron over her black top and jeans. She hurries to answer the phone. Lucy walks down a flight of stairs in her apartment building. Seeing a neighbor, she turns back. Lucy carries on down the stairs, as Max goes into his apartment. She walks back up the curving staircase to her apartment. She unlocks the door and opens it, stands beside it for a few seconds then closes it again. At her therapist's, Lucy garnishes a plate of food. She sits down as he tucks in. Lucy turns away. At the restaurant, the cat collides with a colleague. Pregnant Clara takes the bottle. The goat, Sandra, gets it. Lucy reluctantly walks over to the phone. Lucy turns away from the hubbub of the kitchen as she listens. Her eyes fill with tears. Lucy runs down a hospital corridor. She stops at the reception desk and speaks to a nurse, who points to a room opposite. Lucy walks into the room, where young Max is lying in bed, his eyes closed. Lucy walks around the bed and looks down sadly at her nephew, who has grazes above and below his right eye. A balding robot in his 40s stands in the open doorway. Dr. Tinman pats Lucy on the shoulder and walks away. She stares through the window at the sleeping Max. Lucy's asleep on a chair next to Max's bed."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "A beam of light shines out from a streetlamp and sweeps across a shimmering blue lake. The woman, Kate Armstrong, raises her eyebrows. In a tidy home kitchen, Kate, a pretty brunette in her late 30s, ties a dazzling white painter's smock around her waist. She checks some orders attached to a bulletin board. Kate steps into a pantry and leans wearily against a stack of boxes. In the dining room, she chats to a middle-aged couple. Mr. and Mrs. Peterson leave. Kate shakes hands with another couple and makes her way back through the dining room. Ken and his wife walk off. In the kitchen, to her assistants, the busy assistants carry on with what they're doing. Holding two bouquets of flowers, Kate turns around, her lips pursed as she contemplates their response. Rain falls as Kate walks along a London street. Her long hair, previously tied up in a braid, now hangs loose under a red cap. She steps through her front door into a cozy townhouse. She drops her keys into a basket on top of a coffee table and places some letters down beside it. She checks her voicemail. Kate's fast asleep on the couch. Kate blearily raises her head and reaches out and turns off her phone alarm. It's half past four. At a fruit market, Kate's painting at home. Kate wears a green apron over her white top and slacks. She hurries to answer the doorbell. Kate walks down a flight of stairs in her townhouse building. Seeing a neighbor, she turns back. Kate carries on down the stairs, as Sean goes into his office. She walks back up the steep staircase to her townhouse. She unlocks the door and opens it, stands beside it for a few seconds then closes it again. At her therapist's, Kate decorates a card. She sits down as he opens it. Kate turns away. At the cafe, the barista collides with a colleague. Expectant Leah takes the mug. The barista, Bernadette, gets it. Kate reluctantly walks over to the letterbox. Kate turns away from the chatter of the kitchen as she listens. Her eyes fill with tears. Kate runs down a school corridor. She stops at the reception desk and speaks to a teacher, who points to a room opposite. Kate walks into the room, where young Zoe is lying on a couch, her eyes closed. Kate walks around the couch and looks down sadly at her niece, who has scratches above and below her right eye. A balding janitor in his 40s stands in the open doorway. Mr. Barton pats Kate on the shoulder and walks away. She stares through the window at the sleeping Zoe. Kate's asleep on a bean bag next to Zoe's couch."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "A beam of light flickers out from a lighthouse and dances across a shimmering blue ocean. The woman, Kate Armstrong, lowers her eyebrows. In a tidy restaurant kitchen, Kate, a pretty brunette in her late 30s, discards a dazzling white chef's apron from her waist. She alters some orders attached to a shelf. Kate strolls into a walk-in fridge and lounges wearily against a rack. In the restaurant, she whispers to a middle-aged couple. Mr. and Mrs. Peterson vanish. Kate hugs another couple and drifts her way back through the restaurant. Ken and his wife vanish. In the kitchen, to her chefs, the busy chefs pause to see what she's doing. Holding two plates of food, Kate spins around, her lips parted as she ponders their response. Snow settles as Kate skips along a New York street. Her long hair, previously tied up in a bun, now sways loose under a black beret. She strolls through her front door into a modest apartment. She tosses her keys into a bowl on top of a cabinet and slides some mail down beside it. She swipes her phone messages. Kate's wide awake in bed. Kate sleepily lowers her head and pulls away and turns on her alarm clock. It's half past four. At a fish market, Kate's knitting at home. Kate wears a blue apron over her black top and jeans. She ambles to ignore the phone. Kate jumps down a flight of stairs in her apartment building. Seeing a neighbor, she advances back. Kate pauses on the stairs, as Sean disappears into his apartment. She jogs back up the curving staircase to her apartment. She locks the door and shuts it, stares beside it for a few seconds then opens it again. At her therapist's, Kate reorganizes a plate of food. She stands up as he digs in. Kate turns back. At the restaurant, the waitress embraces a colleague. Pregnant Leah drops the bottle. The waitress, Bernadette, loses it. Kate eagerly strolls over to the phone. Kate turns towards the hubbub of the kitchen as she laughs. Her eyes widen with delight. Kate sits on a hospital bench. She rushes past the reception desk and ignores a nurse, who gestures to a room opposite. Kate dances into the room, where young Zoe is dozing in bed, her eyes open. Kate hops around the bed and smiles down delightedly at her niece, who has grazes above and below her right eye. A balding doctor in his 40s leans in the open doorway. Dr. Barton whispers to Kate and rushes away. She glances through the window at the sleeping Zoe. Kate's wide awake on a chair next to Zoe's bed."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "A bottle cap beams out from a candlestick and sweeps across a shimmering yellow meadow. The dog, Max Turner, raises its bookmarks. In a cluttered garage workshop, Max, a handsome redhead in its late 50s, ties a dazzling red mechanic’s belt around its hips. It checks some tools attached to a pegboard. Max steps into a walk-in closet and leans wearily against a dresser. In the workshop, it chats to a teenage giraffe. Mr. and Mrs. Penguin leave. Max shakes hands with another giraffe and makes its way back through the workshop. Bob and his iguana walk off. In the office, to its assistants, the busy assistants carry on with what they're doing. Holding two trays of screws, Max turns around, its wheels whirring as it contemplates their response. Confetti falls as Max skates along a London lane. Its short fur, previously tied up in a knot, now hangs loose under a blue visor. It steps through its back gate into a spacious shed. It drops its leash into a bucket on top of a crate and places some pebbles down beside it. It checks its radio signals. Max’s fast asleep on a hammock. Max blearily raises its antenna and reaches out and turns off its lamp. It's half past eight. At a grocery store, Max’s sewing at home. Max wears a yellow apron over its green jacket and shorts. It hurries to answer the signal. Max walks down a ramp in its treehouse. Seeing a neighbor, it turns back. Max carries on down the ramp, as Kelly goes into its cabin. It walks back up the twisting ladder to its treehouse. It unlocks the hatch and opens it, stands beside it for a few seconds then closes it again. At its instructor’s, Max decorates a piece of wood. It sits down as he drills in. Max turns away. At the workshop, the assistant collides with a partner. Sleepy Jake takes the hammer. The assistant, Terrence, gets it. Max reluctantly walks over to the signal. Max turns away from the noise of the office as it listens. Its ears fill with water. Max speeds down a library hallway. It stops at the information desk and speaks to a librarian, who points to a shelf opposite. Max walks into the section, where tiny Emma is sitting in a chair, its pages closed. Max walks around the chair and looks down sadly at its cousin, who has stamps above and below its left corner. A bearded nurse in his 60s stands in the open archway. Nurse Wilson pats Max on the wing and rolls away. It stares through the mirror at the resting Emma. Max’s asleep on a sofa next to Emma’s chair."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "A puff of smoke billows out from a chimney and floats across a chilly gray lake. The cat, Lucy Thompson, flicks her ears. In a cluttered garage workshop, Lucy, a sleek tabby in her mid-20s, slips a worn-out brown mechanic's apron over her shoulders. She examines some blueprints pinned to a wall. Lucy strolls into a storage closet and rests casually against a shelf. In the garage, she banters with an elderly pair. Mr. and Mrs. Jennings wander off. Lucy waves at another pair and meanders back through the garage. Tom and his brother stride away. In the workshop, to her mechanics, the diligent mechanics carry on with what they're doing. Cradling two tools, Lucy spins around, her eyes narrowed as she ponders their feedback. Leaves flutter as Lucy strolls along a London street. Her short fur, previously tucked under a cap, now sways freely above a red beanie. She slips through her front door into a cozy attic. She tosses her wallet into a dish on top of a dresser and stacks some letters beside it. She reviews her text messages. Lucy's dozing on a couch. Lucy groggily lifts her paw and reaches out and shuts off her alarm clock. It's nearly six. At a bakery, Lucy's baking at home. Lucy dons a red apron over her white shirt and slacks. She rushes to answer the doorbell. Lucy climbs up a ladder in her attic. Seeing a friend, she turns back. Lucy continues up the ladder, as Jerry enters his attic. She descends back down the spiral staircase to her attic. She unbolts the window and swings it open, stands beside it for a few seconds then shuts it again. At her counselor's, Lucy sprinkles parsley on a dish. She perches down as he digs in. Lucy turns sideways. At the workshop, the barista bumps into a colleague. Expecting Lisa takes the wrench. The barista, Annabelle, retrieves it. Lucy hesitantly approaches the door. Lucy turns her back to the clamor of the workshop as she listens. Her ears droop with sorrow. Lucy jogs down a school hallway. She pauses at the front desk and converses with a teacher, who gestures to a classroom across the hall. Lucy steps into the classroom, where young Max is seated in a chair, his eyes closed. Lucy moves around the chair and observes quietly her nephew, who has bruises on his left cheek. A bespectacled teacher in his 50s leans against the doorway. Mr. Collins taps Lucy on the back and steps away. She gazes through the doorway at the resting Max. Lucy's napping on a bench next to Max's chair."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "A ray of sunshine beams out from a tower and drifts across a glittering green meadow. The woman, Kate Armstrong, wrinkles her nose. In a cluttered workshop attic, Kate, a striking blonde in her late 30s, knots a bright red painter's smock around her hips. She inspects some sketches pinned to a board. Kate strolls into a walk-in pantry and slumps lazily against a stack. In the workshop, she converses with a middle-aged duo. Mr. and Mrs. Peterson depart. Kate high-fives another duo and makes her way back through the workshop. Ken and his wife saunter away. In the attic, to her colleagues, the busy artisans continue with what they're crafting. Holding two canvases, Kate spins around, her lips slightly parted as she muses over their feedback. Leaves fall as Kate strides along a Parisian avenue. Her long hair, previously braided, now cascades freely under a red fedora. She steps through her front gate into a quaint cottage. She tosses her keys into a basket on top of a dresser and sets some flyers down beside it. She checks her email inbox. Kate's sound asleep on the couch. Kate groggily lifts her head and stretches out to silence her radio alarm. It's half past six. At an open-air market, Kate's sculpting at home. Kate dons a yellow smock over her white blouse and skirt. She rushes to answer the doorbell. Kate descends a spiral staircase in her townhouse. Seeing a passerby, she steps back. Kate proceeds down the staircase, as Sean enters his loft. She ascends the winding staircase to her cottage. She unfastens the gate and swings it open, stands beside it momentarily then latches it again. At her mentor's, Kate arranges a bouquet. She sits as he admires it. Kate turns aside. At the workshop, the assistant bumps into a peer. Expectant Leah takes the jar. The assistant, Bernadette, retrieves it. Kate hesitantly approaches the computer. Kate turns away from the clamor of the attic as she listens. Her eyes glisten with emotion. Kate sprints down a clinic hallway. She halts at the info desk and chats with a receptionist, who gestures to a suite across. Kate enters the suite, where young Zoe is resting on a couch, her eyes shut. Kate circles the couch and gazes down compassionately at her niece, who has bruises above and below her right cheek. A graying therapist in his 40s stands in the open archway. Dr. Barton gives Kate a reassuring squeeze on the arm and departs. She gazes through the window at the resting Zoe. Kate dozes on a bench next to Zoe's couch."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "A shadow of darkness escapes from a barn and dances across a dusty red desert. The cat, Max Winter, lowers its ears. In a cluttered bakery attic, Max, a scruffy tabby in its early 5s, puts a tattered green painter’s smock over its shoulders. It reviews some letters pinned to a board. Max steps into a garden shed and sits cheerfully against a wheelbarrow. In the bakery, it sings to a young trio of singers. Mr. and Mrs. Johnson arrive. Max waves feet with another trio and loses its path through the bakery. Tim and his sibling run on. In the attic, to its gardeners, the relaxed gardeners snooze on with what they're undoing. Holding five cups of ink, Max spins around, its whiskers drooping as it evaluates their whisper. Dust blows as Max skips along a London forest. Its short fur, previously clipped short in a braid, now stands straight under a torn cap. It jumps through its portal window into a large mansion. It throws its hat into a jar on top of a box and places some action figures down beside it. It opens its computer letters. Max's wide awake in a barn. Max quickly lowers its tail and stretches out and switches on its stereo. It's half past ten. At a laundry factory, Max's riding at school. Max wears a red tunic over its white shirt and leggings. It strolls to open the drawer. Max skips down a path of cliffs in its mansion town. Seeing a companion, it turns away. Max pauses up the cliffs, as Drew leaves into its mansion. It skips back down the twisting cliffside to its mansion. It locks the window and closes it, stands inside it for a few minutes then opens it again. At its mechanic's, Max balances a cup of ink. It stands up as he gulps in. Max steps forward. At the bakery, the ticketmaster crashes with a stranger. Exhausted Molly takes the globe. The ticketmaster, Sabrina, finds it. Max eagerly skips near to the drawer. Max steps forward from the messy attic as it reads. Its paws fill with laughter. Max crawls up a school hallway. It pauses at the vending machine and laughs to a chef, who dances to a table next. Max crawls into the table, where old Tony is standing on a sofa, its paws open. Max crawls around the sofa and looks up joyfully at its uncle, who has bruises above and below its left leg. A hairy plumber in his 70s dances in the closed window. Dr. Lewis taps Max on the foot and dances closer. It laughs through the fence at the standing Tony. Max's awake on a sofa next to Tony’s table."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "A lighthouse beam sweeps across the ocean as Kate Armstrong prepares for her job as a chef in a bustling restaurant. In her late 30s and a brunette, she manages the kitchen and engages with patrons like Mr. and Mrs. Peterson. Amid the busyness, Kate contemplates diners' reactions while serving dishes. Later, snow falls as she walks through New York streets to her modest apartment, where she checks messages and falls asleep. Waking at 4:30 AM, she cooks at home, answers calls, and navigates her apartment building. At her therapist's, she garnishes food, then turns away, distracted. A commotion in her restaurant kitchen leads to a phone call that brings tears. Rushing to a hospital, she finds her injured niece Zoe and watches over her. Dr. Barton consoles Kate as she sits beside Zoe, asleep in the hospital room."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Kate's asleep on a chair next to Zoe's bed She stares through the window at the sleeping Zoe  Dr Barton pats Kate on the shoulder and walks away  A balding doctor in his 40s stands in the open doorway  Kate walks around the bed and looks down sadly at her niece who has grazes above and below her right eye  Kate walks into the room where young Zoe is lying in bed her eyes closed  She stops at the reception desk and speaks to a nurse who points to a room opposite  Kate runs down a hospital corridor  Her eyes fill with tears  Kate turns away from the hubbub of the kitchen as she listens  Kate reluctantly walks over to the phone  The waitress Bernadette gets it  Pregnant Leah takes the bottle  At the restaurant the waitress collides with a colleague  Kate turns away  She sits down as he tucks in  At her therapist's Kate garnishes a plate of food  She unlocks the door and opens it stands beside it for a few seconds then closes it again  She walks back up the curving staircase to her apartment  Kate carries on down the stairs as Sean goes into his apartment  Seeing a neighbor she turns back  Kate walks down a flight of stairs in her apartment building  She hurries to answer the phone  Kate wears a blue apron over her black top and jeans  At a fish market Kate's cooking at home  It's half past four  Kate blearily raises her head and reaches out and turns off her alarm clock  Kate's fast asleep in bed  She checks her phone messages  She drops her keys into a bowl on top of a cabinet and places some mail down beside it  She steps through her front door into a modest apartment  Her long hair previously tied up in a bun now hangs loose under a black beret  Snow falls as Kate walks along a New York street  Holding two plates of food Kate turns around her lips pursed as she contemplates their response  In the kitchen to her chefs the busy chefs carry on with what they're doing  Ken and his wife walk off  Kate shakes hands with another couple and makes her way back through the restaurant  Mr and Mrs Peterson leave  In the restaurant she chats to a middleaged couple  Kate steps into a walkin fridge and leans wearily against a rack  She checks some orders attached to a shelf  In a tidy restaurant kitchen Kate a pretty brunette in her late 30s ties a dazzling white chef's apron around her waist  The woman Kate Armstrong raises her eyebrows  A beam of light shines out from a lighthouse and sweeps across a shimmering blue ocean "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "She steps through her front door into a modest apartment  She drops her keys into a bowl on top of a cabinet and places some mail down beside it  Kate reluctantly walks over to the phone  She hurries to answer the phone  A beam of light shines out from a lighthouse and sweeps across a shimmering blue ocean  She checks her phone messages  Ken and his wife walk off  Kate walks around the bed and looks down sadly at her niece who has grazes above and below her right eye  She sits down as he tucks in  At the restaurant the waitress collides with a colleague  She walks back up the curving staircase to her apartment  The waitress Bernadette gets it  Holding two plates of food Kate turns around her lips pursed as she contemplates their response  Kate blearily raises her head and reaches out and turns off her alarm clock  Kate steps into a walkin fridge and leans wearily against a rack  Her long hair previously tied up in a bun now hangs loose under a black beret  She checks some orders attached to a shelf  Kate runs down a hospital corridor  Seeing a neighbor she turns back  In the kitchen to her chefs the busy chefs carry on with what they're doing  Her eyes fill with tears  The woman Kate Armstrong raises her eyebrows  She stops at the reception desk and speaks to a nurse who points to a room opposite  A balding doctor in his 40s stands in the open doorway  She stares through the window at the sleeping Zoe  Pregnant Leah takes the bottle  Snow falls as Kate walks along a New York street  At her therapist's Kate garnishes a plate of food  At a fish market Kate's cooking at home  Kate wears a blue apron over her black top and jeans  She unlocks the door and opens it stands beside it for a few seconds then closes it again  It's half past four  In the restaurant she chats to a middleaged couple  Kate's asleep on a chair next to Zoe's bed Kate shakes hands with another couple and makes her way back through the restaurant  Kate turns away from the hubbub of the kitchen as she listens  Kate turns away  In a tidy restaurant kitchen Kate a pretty brunette in her late 30s ties a dazzling white chef's apron around her waist  Kate's fast asleep in bed  Kate walks into the room where young Zoe is lying in bed her eyes closed  Dr Barton pats Kate on the shoulder and walks away  Kate walks down a flight of stairs in her apartment building  Mr and Mrs Peterson leave  Kate carries on down the stairs as Sean goes into his apartment "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Kate walks down a flight of stairs in her apartment building  Seeing a neighbor she turns back  Kate carries on down the stairs as Sean goes into his apartment  She walks back up the curving staircase to her apartment  She unlocks the door and opens it stands beside it for a few seconds then closes it again  At her therapist's Kate garnishes a plate of food  She sits down as he tucks in  Kate turns away  At the restaurant the waitress collides with a colleague  Pregnant Leah takes the bottle  The waitress Bernadette gets it  Kate reluctantly walks over to the phone  Kate turns away from the hubbub of the kitchen as she listens  Her eyes fill with tears  Kate runs down a hospital corridor  She stops at the reception desk and speaks to a nurse who points to a room opposite  Kate walks into the room where young Zoe is lying in bed her eyes closed  Kate walks around the bed and looks down sadly at her niece who has grazes above and below her right eye  A balding doctor in his 40s stands in the open doorway  Dr Barton pats Kate on the shoulder and walks away  She stares through the window at the sleeping Zoe  Kate's asleep on a chair next to Zoe's bed A beam of light shines out from a lighthouse and sweeps across a shimmering blue ocean  The woman Kate Armstrong raises her eyebrows  In a tidy restaurant kitchen Kate a pretty brunette in her late 30s ties a dazzling white chef's apron around her waist  She checks some orders attached to a shelf  Kate steps into a walkin fridge and leans wearily against a rack  In the restaurant she chats to a middleaged couple  Mr and Mrs Peterson leave  Kate shakes hands with another couple and makes her way back through the restaurant  Ken and his wife walk off  In the kitchen to her chefs the busy chefs carry on with what they're doing  Holding two plates of food Kate turns around her lips pursed as she contemplates their response  Snow falls as Kate walks along a New York street  Her long hair previously tied up in a bun now hangs loose under a black beret  She steps through her front door into a modest apartment  She drops her keys into a bowl on top of a cabinet and places some mail down beside it  She checks her phone messages  Kate's fast asleep in bed  Kate blearily raises her head and reaches out and turns off her alarm clock  It's half past four  At a fish market Kate's cooking at home  Kate wears a blue apron over her black top and jeans  She hurries to answer the phone "
        }
      ]
    }
  ]
}