{
  "ground_truth": "Words appear. Wearing 50 black and white striped uniforms, prisoners march in lockstep single file across the dirt, each man holding the shoulders of the man in front. A prison guard in a dark blue overcoat squints at them as they pass, while nearby, one prisoner lies motionless at another guard's feet. The line of prisoners continues away from a wall 30 feet high, with guards on either side of them, as they march toward a stark building, where a smoke stack reaches into the sky. On a dirt road populated by a few rundown establishments, a Nash sedan stops. The driver's door opens and a tall man with bony features steps out wearing a badge. He opens the back door and helps a raven-haired man in handcuffs step out. Both wearing long overcoats, they walk across the street toward the prison. At the middle of a long high wall, a metal entry gate sits under a lookout tower. As they're near the entrance, the officer gives the convict a little shove. The metal gate opens. Just inside, an older guard opens a steel door. As the metal gate closes behind them, the two men pass the guard with no more than a nod from the arriving officer. Inside the prison, an inmate's central room is filled with work benches, each with its own sewing machine. A prisoner with graying temples lifts a box labeled Mayer Thread Company from a stack. As he carries it across the room, he glances at a presiding guard. With slight length, the inmate brings the box past another guard to a work bench. Reaching the bench, he joins a sandy-haired prisoner and sets the box down. They tear off the outer tape. Sitting across from them, a younger inmate glances up. The two men dig through large spools of white thread. They each pull out a gun, and using the spools to conceal them, pass them to the young inmate and a man sitting next to him. They stealthily tuck the weapons in their pants. From the same box, the older inmate and the sandy-haired man retrieve guns of their own. Crossing between two rows of work benches, the sandy-haired man drops a load of shirts concealing his weapon and grabs one of the guards. The younger inmate punches another guard in the face and holds his gun to his throat. A stocky prisoner repeatedly strikes a guard with a pipe as the older inmate follows closely behind. Each of the escaping prisoners leads their hostage to the door. The rest of the befuddled inmates stand at their benches. The younger inmate jabs his captive in the gut. Now the newly arrived convict stands behind his presiding officer and another guard at a door.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Words manifest. Wearing 50 ebony and alabaster striped outfits, prisoners parade in lockstep single file across the soil, each man grasping the shoulders of the man in front. A prison warden in a dark navy overcoat squints at them as they pass, while nearby, one prisoner lies motionless at another warden's feet. The line of prisoners proceeds away from a wall 30 feet high, with wardens on either side of them, as they march toward a stark edifice, where a smoke chimney reaches into the atmosphere. On a dirt track populated by a few dilapidated establishments, a Nash sedan halts. The driver's door opens and a tall man with angular features steps out wearing a badge. He opens the back door and assists a raven-haired man in handcuffs step out. Both wearing long overcoats, they walk across the street toward the penitentiary. At the middle of a long high wall, a metal entrance gate sits under a lookout tower. As they're near the entrance, the officer gives the convict a little shove. The metal gate opens. Just inside, an older warden opens a steel door. As the metal gate closes behind them, the two men pass the warden with no more than a nod from the arriving officer. Inside the prison, an inmate's central room is filled with work benches, each with its own sewing machine. A prisoner with graying temples lifts a box labeled Mayer Thread Company from a stack. As he carries it across the chamber, he glances at a supervising warden. With slight length, the inmate brings the box past another warden to a work bench. Reaching the bench, he joins a sandy-haired prisoner and sets the box down. They tear off the outer tape. Sitting across from them, a younger inmate glances up. The two men dig through large spools of white thread. They each pull out a firearm, and using the spools to conceal them, pass them to the young inmate and a man sitting next to him. They stealthily tuck the weapons in their trousers. From the same box, the older inmate and the sandy-haired man retrieve firearms of their own. Crossing between two rows of work benches, the sandy-haired man drops a load of shirts concealing his weapon and grabs one of the wardens. The younger inmate punches another warden in the face and holds his gun to his throat. A stocky prisoner repeatedly strikes a warden with a pipe as the older inmate follows closely behind. Each of the escaping prisoners leads their hostage to the door. The rest of the bewildered inmates stand at their benches. The younger inmate jabs his captive in the gut. Now the newly arrived convict stands behind his supervising officer and another warden at a door."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Words are seen. Fifty black and white striped uniforms are worn by prisoners who are marched in lockstep single file across the dirt, with each man holding the shoulders of the man in front. A prison guard in a dark blue overcoat squints at them as they pass, while nearby, one motionless prisoner is at another guard's feet. The line of prisoners is continued away from a wall 30 feet high, with guards on either side of them, as they are marched toward a stark building, where a smoke stack reaches into the sky. On a dirt road populated by a few rundown establishments, a Nash sedan is stopped. The driver's door is opened, and a tall man with bony features steps out wearing a badge. He opens the back door and helps a raven-haired man in handcuffs to step out. Both wearing long overcoats, they are walked across the street toward the prison. At the middle of a long high wall, a metal entry gate is under a lookout tower. As they're near the entrance, the convict is given a little shove by the officer. The metal gate is opened. Just inside, a steel door is opened by an older guard. As the metal gate closes behind them, they pass the guard with no more than a nod given by the arriving officer. Inside the prison, an inmate's central room is filled with work benches, each with its own sewing machine. A box labeled Mayer Thread Company is lifted from a stack by a prisoner with graying temples. As he carries it across the room, a presiding guard is glanced at by him. With slight length, the box is brought past another guard to a work bench by the inmate. Reaching the bench, a sandy-haired prisoner is joined by him, and the box is set down by them. The outer tape is torn off by them. Sitting across from them, a younger inmate glances up. Large spools of white thread are dug through by the two men. They each pull out a gun, and using the spools to conceal them, they pass them to the young inmate and a man sitting next to him. The weapons are stealthily tucked in their pants by them. From the same box, guns of their own are retrieved by the older inmate and the sandy-haired man. Between two rows of work benches, a load of shirts concealing his weapon is dropped, and one of the guards is grabbed by the sandy-haired man. Another guard is punched in the face by the younger inmate, and his gun is held to his throat. A guard is repeatedly struck with a pipe by a stocky prisoner as the older inmate follows closely behind. Each of the escaping prisoners leads a hostage to the door. The rest of the befuddled inmates are standing at their benches. His captive is jabbed in the gut by the younger inmate. Now behind his presiding officer and another guard at a door stands the newly arrived convict."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Words appear. In 50 black and white striped uniforms, prisoners march single file in lockstep across the dirt, each grasping the shoulders of the man ahead. A prison guard in a dark blue coat squints as they pass, while one prisoner lies still at another guard's feet. They move away from a 30-foot-high wall, surrounded by guards, heading toward a stark building with a smoke stack. On a dirt road, a Nash sedan stops. The driver, a tall man with bony features and a badge, exits and helps a handcuffed raven-haired man out. Both in long overcoats, they approach the prison. A metal entry gate lies under a lookout tower. Nearing the entrance, the officer nudges the convict. The gate opens. Inside, an older guard opens a steel door. As it closes behind them, the officer nods to the guard. Within the prison, a central room has work benches with sewing machines. A prisoner with graying hair lifts a Mayer Thread Company box, glancing at a guard as he carries it. He joins a sandy-haired inmate, setting the box down. They tear off the outer tape. A younger inmate looks up. The two men dig through large thread spools, pulling guns concealed by the spools, and pass them to the young inmate and another man. They quickly hide the weapons in their pants. The older inmate and sandy-haired man retrieve guns too. The sandy-haired man, crossing benches, drops shirts hiding his gun and grabs a guard. The young inmate punches a guard, holding a gun to his throat. A stocky prisoner beats a guard with a pipe as the older inmate follows. Each escaping prisoner leads a hostage to the door, while confused inmates remain at the benches. The young inmate jabs his captive. Now, the new convict stands behind his officer and another guard at a door."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Fifty prisoners in black and white stripes march single file, holding shoulders, under the watch of guards. They approach a building with a smoke stack, away from a 30-foot wall lined with guards. A Nash sedan stops by rundown establishments; a tall, bony, badged man exits, helping a handcuffed, raven-haired man. Both in overcoats, they head to the prison's metal gate under a lookout tower. Nearing the entrance, the officer gently pushes the convict; the gate opens. Inside, an older guard nods as they pass into a room with work benches and sewing machines. A prisoner with graying temples carries a Mayer Thread Company box, joining a sandy-haired inmate at a bench. They open the box, revealing guns hidden by thread spools, and pass them to two younger inmates, who conceal them. The older and sandy-haired inmates retrieve guns too. The sandy-haired man discreetly grabs a guard, while another inmate assaults a guard with a pipe. The escaping prisoners lead hostages to the door, as confused inmates remain at their benches. The younger inmate jabs his captive, while the newly arrived convict stands behind his officer and another guard."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Words manifest on the screen. Clad in 50 identical uniforms adorned with black and white stripes, a procession of prisoners strides in unison, marching single file across the dusty ground. Each man firmly grips the shoulders of the individual in front of him, creating a continuous human chain. Observing them with narrowed eyes as they pass by, a prison guard dressed in a dark blue overcoat stands vigilantly. Nearby, a motionless prisoner lies at the feet of another guard. The line of prisoners proceeds past a towering wall standing 30 feet tall, flanked by guards on either side, as they make their way toward a stark, imposing building topped by a smoke stack that stretches high into the sky. On a nearby dirt road lined with a few rundown establishments, a Nash sedan comes to a stop. The car's driver's door swings open, and a tall man with pronounced bony features emerges, bearing a badge that signifies his authority. He then opens the back door of the vehicle to assist a raven-haired individual wearing handcuffs to step out. Both men, clad in long overcoats, proceed to walk purposefully across the street in the direction of the prison. At the center of a lengthy, high wall, a sturdy metal entry gate is situated beneath a looming lookout tower. As they approach the entrance, the officer gives the convict a slight shove forward. The metal gate creaks open. Just inside, an older guard steps forward to open a formidable steel door. As the metal gate closes silently behind them, the two men pass by the guard with only a subtle nod of acknowledgment from the arriving officer. Inside the confines of the prison, the central room is occupied by rows of work benches, each equipped with its own sewing machine. A prisoner with graying temples lifts a box labeled with the name Mayer Thread Company from a nearby stack. As he transports it across the room, he casts a cautious glance at a supervising guard. With deliberate movements, he carries the box past yet another guard to a designated work bench. Upon reaching the bench, he joins a sandy-haired prisoner and places the box down with care. Together, they proceed to tear off the outer tape. Sitting across from them, a younger inmate looks up with a glance. The two men delve into the box, extracting large spools of white thread, which they use to conceal the firearms they each retrieve. They discreetly pass these hidden weapons to the young inmate and the man seated next to him, who stealthily tuck the guns into their pants. From the same box, the older inmate and the sandy-haired man procure firearms for themselves. Navigating between the rows of work benches, the sandy-haired man drops a pile of shirts that conceals his weapon and swiftly seizes one of the guards. Simultaneously, the younger inmate delivers a punch to another guard’s face, pressing his firearm to the guard’s throat. Meanwhile, a stocky prisoner repeatedly beats a guard with a metal pipe, followed closely by the older inmate. Each of the prisoners attempting to escape leads their respective hostage toward the door, while the remaining inmates stand bewildered at their benches. The younger inmate delivers a sharp jab to his captive’s gut. At that moment, the newly arrived convict stands strategically behind his escorting officer and an additional guard stationed at a door."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Words appear gradually on the screen, forming a vivid scene. Arrayed in 50 identical prison uniforms, adorned with striking black and white stripes, a procession of inmates strides forward in perfect synchronization, marching in a single-file line across the dusty, barren ground. Each man maintains a firm grip on the shoulders of the person directly in front, creating an unbroken human chain of individuals. Watching them intently with narrowed eyes as they pass by, a vigilant prison guard, adorned in a dark blue overcoat, stands steadfastly nearby. Close by, unmoving on the ground, lies a prisoner at the feet of another guard. The line of inmates advances past a towering wall, which rises majestically to a height of 30 feet, flanked by guards on either side, as they move toward a stark and imposing building crowned with a smoke stack that stretches high into the sky. On a nearby dusty dirt road, lined with a handful of rundown establishments, a Nash sedan rolls to a stop. The driver's door of the vehicle swings open, revealing a tall man with pronounced bony features, who emerges displaying a badge that clearly signifies his authority. He then proceeds to open the back door of the sedan, assisting a raven-haired individual, restrained in handcuffs, to step out of the car. Both men, clad in long, heavy overcoats, purposefully stride across the street, heading directly toward the foreboding prison structure. At the very center of a lengthy, high wall stands a sturdy metal entry gate, situated directly beneath a looming and intimidating lookout tower. As they approach the entrance, the officer gives the convict a gentle but firm shove forward. The metal gate emits a creaking sound as it swings open. Just inside, an older guard steps forward to unlock a formidable steel door. The metal gate closes silently behind them, and the two men pass by the guard with nothing but a subtle nod of acknowledgment from the officer who has just arrived. Within the confines of the prison's central room, rows of work benches are neatly arranged, each one equipped with its own sewing machine. A prisoner with graying temples lifts a box prominently labeled with the name Mayer Thread Company from a nearby stack. As he transports it across the room, he casts a cautious, watchful glance at a supervising guard. With deliberate, careful movements, he carries the box past yet another guard to a designated work bench. Upon reaching the bench, he joins a fellow inmate with sandy hair and sets the box down with meticulous care. Together, they proceed to peel away the outer tape. Sitting across from them, a younger inmate glances up momentarily. The two men delve into the box, extracting large spools of white thread, cleverly using them to conceal the firearms that they discreetly retrieve. They surreptitiously pass these hidden weapons to the young inmate and the man seated next to him, who stealthily tuck the guns into their pants. From the same box, the older inmate and the sandy-haired man procure firearms for themselves. Navigating carefully between the rows of work benches, the sandy-haired man drops a pile of shirts that effectively masks his weapon and swiftly seizes one of the unsuspecting guards. Simultaneously, the younger inmate delivers a forceful punch to another guard's face, pressing his firearm firmly to the guard's throat. Meanwhile, a stocky prisoner unleashes a series of heavy blows with a metal pipe against a guard, followed closely by the older inmate. Each of the prisoners attempting escape leads their respective hostage toward the door, while the remaining inmates stand bewildered, rooted to their spots at the benches. The younger inmate delivers a sharp, stinging jab to his captive's gut. At that exact moment, the newly arrived convict stands strategically positioned behind his escorting officer and an additional guard stationed at a door."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Words appear on the screen, setting the somber scene as fifty prisoners, each clad in identical black and white striped uniforms, march with synchronized precision in a single file line across the dirt. Each man places his hands deliberately on the shoulders of the man in front of him, maintaining their formation as they proceed. As they march past, a prison guard, standing with an air of authority, watches them intently, his eyes narrowing to assess their movement. Nearby, the still form of a prisoner lies unmoving at the feet of another guard, adding an ominous note to the atmosphere. The prisoners continue their march, distancing themselves from a towering concrete wall thirty feet high that looms ominously behind them, and flanked by vigilant guards on either side, they head purposefully toward a stark, foreboding building. This structure features a smoke stack extending upward into the sky, hinting at its industrial purpose. Meanwhile, on a worn dirt road dotted with a few dilapidated establishments, a Nash sedan comes to a halt. The driver's door swings open, and a tall man, his bony features accentuated by the light, steps out with an assertive grace, a badge displayed prominently on his attire. He proceeds to open the back door of the vehicle and extends a helping hand to a raven-haired man restrained by the grip of handcuffs, aiding him as he steps out of the car. Both men clad in long overcoats, adding an air of formality to the scene, stride purposefully across the street in the direction of the prison. As they approach the center of the long, imposing high wall of the prison, they arrive at a sturdy metal entry gate positioned beneath a commanding lookout tower. Nearing the entrance, the officer applies a gentle but firm shove to the convict, prompting him forward. With a metallic groan, the gate opens to admit them. Just inside the threshold, an older guard stands ready, pulling open a heavy steel door to grant them further access. As the metal gate clanks shut with finality behind them, the two men proceed past the guard, exchanging nothing more than a minimal nod from the newly arrived officer. Beyond the entrance, the prison interior reveals a central room dedicated to inmate labor, filled with rows of work benches, each paired with a sewing machine for the inmates' use. A prisoner distinguished by graying temples approaches a stack and retrieves a box labeled Mayer Thread Company, lifting it with measured effort. As he carries the box across the room, his eyes momentarily flicker to meet those of a presiding guard, ensuring his actions go unnoticed. With subtle care, the inmate passes another guard and places the box on a work bench. There, he joins a sandy-haired prisoner, and together, they peel away the outer layer of tape sealing the box. Across the table, a younger inmate glances up, taking in their actions. Delving into the box, the two men extract large spools of white thread. Concealed within these spools are hidden guns, which they deftly pass to the young inmate and to a man seated beside him, who both discreetly tuck the weapons into their pants to avoid detection. From the depths of the same box, the older inmate and the sandy-haired man also retrieve firearms for themselves. The sandy-haired man, concealing his weapon within a load of shirts, navigates between two rows of work benches. In a swift, decisive movement, he seizes one of the guards. Concurrently, the younger inmate unleashes a punch to the face of another guard, pressing the barrel of his gun menacingly against the man's throat. Simultaneously, a stocky prisoner repeatedly and forcefully strikes a guard with a pipe, as the older inmate trails closely, supporting the assault. Each escaping prisoner maneuvers a captive guard to the door, effectively leveraging them as hostages while the remaining inmates, confused and unsure of their role in the chaos, remain standing at their benches, observing the commotion. In a final act of defiance, the younger inmate delivers a jab to his captive's gut. Meanwhile, the recently arrived convict positions himself strategically behind his accompanying officer and another guard at the door, preparing for the next phase of their unfolding plan."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Prisoners, wearing black and white striped uniforms, march in lockstep across the dirt, each holding the shoulders of the man in front, as a prison guard squints at them. Meanwhile, a prisoner lies motionless at another guard's feet. The marching line veers away from a 30-foot high wall, flanked by guards, toward a stark building topped with a smoking chimney. On a dirt road lined with rundown establishments, a Nash sedan arrives. A tall, bony-featured man with a badge steps out and assists a handcuffed, raven-haired man. Both in long overcoats, they walk across the street to the prison entrance, where the officer nudges the convict. The gate opens, and they pass a guard with a nod, entering through a steel door. Inside, prisoners work at benches with sewing machines. One prisoner with graying temples carries a box labeled Mayer Thread Company, glances at a guard, and sets it on a bench shared with a sandy-haired inmate. They remove tape from the box, revealing large spools of white thread. Concealed within, they retrieve guns and discreetly pass them to two younger inmates, who stash the weapons in their pants. The older and sandy-haired inmates arm themselves, and the sandy-haired man distracts a guard by dropping shirts and seizing him, while another inmate punches a guard and holds him at gunpoint. A stocky prisoner attacks a guard with a pipe as the older inmate follows. Each escaping prisoner takes a hostage to the door, leaving the remaining inmates confused at their benches, while the younger inmate assaults his captive. Meanwhile, the newly arrived convict stands behind his officer and another guard at a door."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Words appear. Wearing 50 black and white striped uniforms that resemble those historically used in early 20th-century American prisons, prisoners march in lockstep single file across the dirt of a stark and oppressive landscape, each man holding the shoulders of the man in front. A prison guard in a dark blue overcoat, standard for officers of that era, squints at them as they pass, while nearby, one prisoner lies motionless at another guard's feet, a grim reminder of the harsh conditions often faced by inmates. The line of prisoners continues away from a wall 30 feet high, reminiscent of fortress-like prison walls designed to prevent escape, with guards on either side of them, as they march toward a stark building, where a smoke stack reaches into the sky, likely from the prison’s industrial laundry or workshop facilities. On a dirt road populated by a few rundown establishments that hint at the economic decline surrounding prison areas, a Nash sedan, a classic American car from the early 20th century, stops. The driver's door opens and a tall man with bony features steps out wearing a badge, indicating his authority as a law enforcement officer. He opens the back door and helps a raven-haired man in handcuffs step out, an image suggesting a transfer of a new inmate. Both wearing long overcoats suited for the chilly air, they walk across the street toward the prison. At the middle of a long high wall, a metal entry gate sits under a lookout tower equipped with searchlights, designed for constant surveillance. As they're near the entrance, the officer gives the convict a little shove, demonstrating the often harsh treatment of prisoners. The metal gate opens with a creak. Just inside, an older guard opens a steel door, heavy and reinforced to prevent unauthorized entries or exits. As the metal gate closes behind them, the two men pass the guard with no more than a nod from the arriving officer, a gesture of routine procedure. Inside the prison, an inmate's central room is filled with work benches, each with its own sewing machine, as prisons often operated workshops to produce goods. A prisoner with graying temples lifts a box labeled Mayer Thread Company, a common supplier of textile materials at the time, from a stack. As he carries it across the room, he glances at a presiding guard, wary of the ever-present supervision. With slight length, the inmate brings the box past another guard to a work bench. Reaching the bench, he joins a sandy-haired prisoner and sets the box down. They tear off the outer tape with precision borne from covert planning. Sitting across from them, a younger inmate glances up, his eyes scanning for signs of trouble. The two men dig through large spools of white thread. They each pull out a gun, cleverly hidden among the spools, and using the spools to conceal them, pass them to the young inmate and a man sitting next to him, demonstrating the dangerous ingenuity of prison smuggling operations. They stealthily tuck the weapons in their pants, readying themselves for the ensuing chaos. From the same box, the older inmate and the sandy-haired man retrieve guns of their own. Crossing between two rows of work benches, the sandy-haired man drops a load of shirts concealing his weapon and grabs one of the guards, initiating their escape plan. The younger inmate punches another guard in the face, a calculated act of defiance, and holds his gun to his throat, the power dynamics suddenly shifting. A stocky prisoner repeatedly strikes a guard with a pipe, a makeshift weapon often found in such tense environments, as the older inmate follows closely behind, capitalizing on the confusion. Each of the escaping prisoners leads their hostage to the door, a premeditated strategy for bargaining. The rest of the befuddled inmates stand at their benches, caught in the shock of the moment. The younger inmate jabs his captive in the gut, emphasizing their desperation. Now the newly arrived convict stands behind his presiding officer and another guard at a door, an ironic reversal of roles amidst the chaos."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Inside the prison an inmate's central room is filled with work benches each with its own sewing machine Words appear At the middle of a long high wall a metal entry gate sits under a lookout tower Wearing 50 black and white striped uniforms prisoners march in lockstep single file across the dirt each man holding the shoulders of the man in front A prison guard in a dark blue overcoat squints at them as they pass while nearby one prisoner lies motionless at another guard's feet The line of prisoners continues away from a wall 30 feet high with guards on either side of them as they march toward a stark building where a smoke stack reaches into the sky On a dirt road populated by a few rundown establishments a Nash sedan stops The two men dig through large spools of white thread The driver's door opens and a tall man with bony features steps out wearing a badge He opens the back door and helps a ravenhaired man in handcuffs step out Wearing 50 black and white striped uniforms prisoners march in lockstep single file across the dirt each man holding the shoulders of the man in front Both wearing long overcoats they walk across the street toward the prison At the middle of a long high wall a metal entry gate sits under a lookout tower As they are near the entrance the officer gives the convict a little shove The younger inmate punches another guard in the face and holds his gun to his throat The metal gate opens They each pull out a gun and using the spools to conceal them pass them to the young inmate and a man sitting next to him Just inside an older guard opens a steel door The line of prisoners continues away from a wall 30 feet high with guards on either side of them as they march toward a stark building where a smoke stack reaches into the sky They tear off the outer tape Words appear As the metal gate closes behind them the two men pass the guard with no more than a nod from the arriving officer Inside the prison an inmate's central room is filled with work benches each with its own sewing machine A prisoner with graying temples lifts a box labeled Mayer Thread Company from a stack As he carries it across the room he glances at a presiding guard With slight length the inmate brings the box past another guard to a work bench Reaching the bench he joins a sandyhaired prisoner and sets the box down They tear off the outer tape Sitting across from them a younger inmate glances up The two men dig through large spools of white thread The younger inmate jabs his captive in the gut Reaching the bench he joins a sandyhaired prisoner and sets the box down They each pull out a gun and using the spools to conceal them pass them to the young inmate and a man sitting next to him They stealthily tuck the weapons in their pants From the same box the older inmate and the sandyhaired man retrieve guns of their own Crossing between two rows of work benches the sandyhaired man drops a load of shirts concealing his weapon and grabs one of the guards The younger inmate punches another guard in the face and holds his gun to his throat A stocky prisoner repeatedly strikes a guard with a pipe as the older inmate follows closely behind Each of the escaping prisoners leads their hostage to the door The rest of the befuddled inmates stand at their benches A prison guard in a dark blue overcoat squints at them as they pass while nearby one prisoner lies motionless at another guard's feet On a dirt road populated by a few rundown establishments a Nash sedan stops From the same box the older inmate and the sandyhaired man retrieve guns of their own The younger inmate jabs his captive in the gut The rest of the befuddled inmates stand at their benches Both wearing long overcoats they walk across the street toward the prison Now the newly arrived convict stands behind his presiding officer and another guard at a door"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Words appear. Wearing 50 black and white striped uniforms prisoners march in lockstep single file across the dirt each man holding the shoulders of the man in front. A prison guard in a dark blue overcoat squints at them as they pass while nearby one prisoner lies motionless at another guard's feet. The line of prisoners continues away from a wall 30 feet high with guards on either side of them as they march toward a stark building where a smoke stack reaches into the sky. On a dirt road populated by a few rundown establishments a Nash sedan stops. The driver's door opens and a tall man with bony features steps out wearing a badge. He opens the back door and helps a ravenhaired man in handcuffs step out. Both wearing long overcoats they walk across the street toward the prison. At the middle of a long high wall a metal entry gate sits under a lookout tower. As they are near the entrance the officer gives the convict a little shove. The metal gate opens. Just inside an older guard opens a steel door. As the metal gate closes behind them the two men pass the guard with no more than a nod from the arriving officer. Inside the prison an inmate's central room is filled with work benches each with its own sewing machine. A prisoner with graying temples lifts a box labeled Mayer Thread Company from a stack. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. As he carries it across the room he glances at a presiding guard. With slight length the inmate brings the box past another guard to a work bench. Reaching the bench he joins a sandyhaired prisoner and sets the box down. They tear off the outer tape. Sitting across from them a younger inmate glances up. The two men dig through large spools of white thread. They each pull out a gun and using the spools to conceal them pass them to the young inmate and a man sitting next to him. They stealthily tuck the weapons in their pants. From the same box the older inmate and the sandyhaired man retrieve guns of their own. Crossing between two rows of work benches the sandyhaired man drops a load of shirts concealing his weapon and grabs one of the guards. The younger inmate punches another guard in the face and holds his gun to his throat. A stocky prisoner repeatedly strikes a guard with a pipe as the older inmate follows closely behind. Each of the escaping prisoners leads their hostage to the door. The rest of the befuddled inmates stand at their benches. The younger inmate jabs his captive in the gut. Now the newly arrived convict stands behind his presiding officer and another guard at a door."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Words appear. Wearing 50 black and white striped uniforms prisoners march in lockstep single file across the dirt each man holding the shoulders of the man in front. A prison guard in a dark blue overcoat squints at them as they pass while nearby one prisoner lies motionless at another guard's feet. The line of prisoners continues away from a wall 30 feet high with guards on either side of them as they march toward a stark building where a smoke stack reaches into the sky. On a dirt road populated by a few rundown establishments a Nash sedan stops. The driver's door opens and a tall man with bony features steps out wearing a badge. He opens the back door and helps a ravenhaired man in handcuffs step out. Both wearing long overcoats they walk across the street toward the prison. At the middle of a long high wall a metal entry gate sits under a lookout tower. As they are near the entrance the officer gives the convict a little shove. The metal gate opens. Just inside an older guard opens a steel door. As the metal gate closes behind them the two men pass the guard with no more than a nod from the arriving officer. Inside the prison an inmate's central room is filled with work benches each with its own sewing machine. A prisoner with graying temples lifts a box labeled Mayer Thread Company from a stack. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. As he carries it across the room he glances at a presiding guard. With slight length the inmate brings the box past another guard to a work bench. Reaching the bench he joins a sandyhaired prisoner and sets the box down. They tear off the outer tape. Sitting across from them a younger inmate glances up. The two men dig through large spools of white thread. They each pull out a gun and using the spools to conceal them pass them to the young inmate and a man sitting next to him. They stealthily tuck the weapons in their pants. From the same box the older inmate and the sandyhaired man retrieve guns of their own. Crossing between two rows of work benches the sandyhaired man drops a load of shirts concealing his weapon and grabs one of the guards. The younger inmate punches another guard in the face and holds his gun to his throat. A stocky prisoner repeatedly strikes a guard with a pipe as the older inmate follows closely behind. Each of the escaping prisoners leads their hostage to the door. The rest of the befuddled inmates stand at their benches. The younger inmate jabs his captive in the gut. Now the newly arrived convict stands behind his presiding officer and another guard at a door."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Words appear. Wearing 50 black and white striped uniforms prisoners march in lockstep single file across the dirt each man holding the shoulders of the man in front. A prison guard in a dark blue overcoat squints at them as they pass while nearby one prisoner lies motionless at another guard's feet. The line of prisoners continues away from a wall 30 feet high with guards on either side of them as they march toward a stark building where a smoke stack reaches into the sky. On a dirt road populated by a few rundown establishments a Nash sedan stops. The driver's door opens and a tall man with bony features steps out wearing a badge. He opens the back door and helps a ravenhaired man in handcuffs step out. Both wearing long overcoats they walk across the street toward the prison. From the same box the older inmate and the sandyhaired man retrieve guns of their own. Crossing between two rows of work benches the sandyhaired man drops a load of shirts concealing his weapon and grabs one of the guards. The younger inmate punches another guard in the face and holds his gun to his throat. A stocky prisoner repeatedly strikes a guard with a pipe as the older inmate follows closely behind. Each of the escaping prisoners leads their hostage to the door. The rest of the befuddled inmates stand at their benches. The younger inmate jabs his captive in the gut. Now the newly arrived convict stands behind his presiding officer and another guard at a door."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Words appear. Wearing 50 black and white striped uniforms prisoners march in lockstep single file across the dirt each man holding the shoulders of the man in front. A prison guard in a dark blue overcoat squints at them as they pass while nearby one prisoner lies motionless at another guard's feet. Each of the escaping prisoners leads their hostage to the door. The rest of the befuddled inmates stand at their benches. The younger inmate jabs his captive in the gut. Now the newly arrived convict stands behind his presiding officer and another guard at a door."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Words appear. Wearing 50 black and white striped uniforms, dancers march in lockstep single file across the dirt, each cat holding the shoulders of the cat in front. A zookeeper in a dark blue overcoat squints at them as they pass, while nearby, one dancer lies motionless at another zookeeper's feet. The line of dancers continues away from a wall 30 feet high, with zookeepers on either side of them, as they march toward a stark building, where a smoke stack reaches into the sky. On a dirt road populated by a few rundown establishments, a Nash sedan stops. The driver's door opens and a tall giraffe with bony features steps out wearing a badge. The giraffe opens the back door and helps a raven-haired rabbit in handcuffs step out. Both wearing long overcoats, they walk across the street toward the zoo. At the middle of a long high wall, a metal entry gate sits under a lookout tower. As they're near the entrance, the giraffe gives the rabbit a little shove. The metal gate opens. Just inside, an older penguin opens a steel door. As the metal gate closes behind them, the two animals pass the penguin with no more than a nod from the arriving giraffe. Inside the zoo, an otter's central room is filled with work benches, each with its own sewing machine. A dancer with graying temples lifts a box labeled Mayer Thread Company from a stack. As the dancer carries it across the room, the dancer glances at a presiding penguin. With slight length, the dancer brings the box past another penguin to a work bench. Reaching the bench, the dancer joins a sandy-haired dancer and sets the box down. They tear off the outer tape. Sitting across from them, a younger otter glances up. The two dancers dig through large spools of white thread. They each pull out a banana, and using the spools to conceal them, pass them to the young otter and a raccoon sitting next to the otter. They stealthily tuck the bananas in their pants. From the same box, the older dancer and the sandy-haired dancer retrieve bananas of their own. Crossing between two rows of work benches, the sandy-haired dancer drops a load of shirts concealing the banana and grabs one of the penguins. The younger otter punches another penguin in the face and holds the banana to the penguin's throat. A stocky dancer repeatedly strikes a penguin with a pipe as the older dancer follows closely behind. Each of the escaping dancers leads their hostage to the door. The rest of the befuddled otters stand at their benches. The younger otter jabs the captive in the gut. Now the newly arrived rabbit stands behind its presiding giraffe and another penguin at a door."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Words appear. Wearing 50 blue and yellow striped uniforms, prisoners march in lockstep single file across the gravel, each man holding the knees of the man in front. A prison guard in a light green raincoat squints at them as they pass, while nearby, one prisoner lies motionless at another guard's boots. The line of prisoners continues away from a hedge 30 feet high, with guards on either side of them, as they march toward a stark castle, where a fountain reaches into the sky. On a gravel path populated by a few rundown cabins, a Ford truck stops. The driver's door opens and a tall man with bony features steps out wearing a scarf. He opens the back door and helps a blond-haired man in handcuffs step out. Both wearing long trench coats, they walk across the lawn toward the prison. At the middle of a long high fence, a wooden entry gate sits under a flagpole. As they're near the entrance, the officer gives the convict a little shove. The wooden gate opens. Just inside, an older guard opens a glass door. As the wooden gate closes behind them, the two men pass the guard with no more than a nod from the arriving officer. Inside the prison, an inmate's central room is filled with dining tables, each with its own typewriter. A prisoner with graying temples lifts a box labeled Mayer Ink Company from a stack. As he carries it across the room, he glances at a lounging guard. With slight haste, the inmate brings the box past another guard to a dining table. Reaching the table, he joins a sandy-haired prisoner and sets the box down. They tear off the outer wrapping. Sitting across from them, a younger inmate glances up. The two men dig through large reams of white paper. They each pull out a book, and using the reams to conceal them, pass them to the young inmate and a man sitting next to him. They stealthily tuck the books in their jackets. From the same box, the older inmate and the sandy-haired man retrieve books of their own. Crossing between two rows of dining tables, the sandy-haired man drops a load of newspapers concealing his book and grabs one of the guards. The younger inmate punches another guard in the face and holds his book to his throat. A stocky prisoner repeatedly strikes a guard with a baton as the older inmate follows closely behind. Each of the escaping prisoners leads their hostage to the door. The rest of the befuddled inmates stand at their tables. The younger inmate jabs his captive in the ribs. Now the newly arrived convict stands behind his presiding officer and another guard at a door."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Words manifest. Wearing 50 black and white striped uniforms, prisoners sway in place single file along the dirt, each man patting the head of the man in front. A prison guard in a dark blue overcoat gestures at them as they proceed, while nearby, one prisoner dances at another guard's feet. The line of prisoners hesitates away from a wall 30 feet high, with guards on either side of them, as they wander toward a stark building, where a smoke stack drifts into the sky. On a dirt road frequented by a few rundown establishments, a Nash sedan idles. The driver's door swings open and a tall man with bony features crouches out wearing a badge. He shuts the back door and watches a raven-haired man in handcuffs step out. Both wearing long overcoats, they skip across the street toward the prison. At the middle of a long high wall, a metal entry gate perches under a lookout tower. As they're near the entrance, the officer passes the convict a gentle wave. The metal gate slides. Just inside, an older guard closes a steel door. As the metal gate seals behind them, the two men greet the guard with more than a nod from the arriving officer. Inside the prison, an inmate's central room is adorned with work benches, each hosting its own sewing machine. A prisoner with graying temples drops a box labeled Mayer Thread Company from a stack. As he rolls it across the room, he stares at a presiding guard. With slight hesitation, the inmate places the box beside another guard on a work bench. Reaching the bench, he links up with a sandy-haired prisoner and lifts the box down. They carve off the outer tape. Sitting across from them, a younger inmate sneaks a peek. The two men peer through large spools of white thread. They each extract a coin, and using the spools to conceal them, slide them to the young inmate and a man seated next to him. They quietly tuck the coins in their pockets. From the same box, the older inmate and the sandy-haired man retrieve coins of their own. Dodging between two rows of work benches, the sandy-haired man spills a load of shirts hiding his coin and taps one of the guards. The younger inmate pats another guard on the back and holds his coin to his chin. A stocky prisoner gently nudges a guard with a pipe as the older inmate drifts closely behind. Each of the wandering prisoners directs their companion to the door. The rest of the mystified inmates linger at their benches. The younger inmate jabs his companion in the arm. Now the newly arrived convict stands before his presiding officer and another guard at a door."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Symbols appear. Wearing 50 red and blue polka-dotted costumes, acrobats march in lockstep double file across the grass, each bird holding the wings of the bird in front. A ringmaster in a bright yellow raincoat squints at them as they pass, while nearby, one acrobat lies motionless at another clown's feet. The line of acrobats continues away from a fence 30 feet high, with clowns on either side of them, as they march toward a bright tent, where a flagpole reaches into the sky. On a sandy path populated by a few colorful kiosks, a Ford truck stops. The passenger's door opens and a short squirrel with fluffy features jumps out wearing a helmet. He opens the front door and helps a bald eagle in mittens hop out. Both wearing short capes, they skip across the sand toward the circus. At the middle of a long high rope, a wooden entry ladder sits under a ticket booth. As they're near the entrance, the dancer gives the bird a little push. The wooden ladder unfolds. Just inside, a younger clown opens a curtain. As the wooden ladder folds behind them, the two squirrels pass the clown with no more than a wave from the hopping dancer. Inside the circus, a lion's central area is filled with picnic tables, each with its own popcorn maker. An acrobat with black stripes lifts a basket labeled Flora Seeds Company from a pile. As he carries it across the area, he peeks at a supervising clown. With slight speed, the acrobat brings the basket past another clown to a picnic table. Reaching the table, he joins a curly-haired acrobat and sets the basket down. They rip off the outer paper. Sitting across from them, a younger acrobat peeks up. The two squirrels dig through large sacks of popcorn. They each pull out a trumpet, and using the sacks to conceal them, pass them to the young acrobat and a bird sitting next to her. They stealthily tuck the instruments in their shoes. From the same basket, the older acrobat and the curly-haired squirrel retrieve trumpets of their own. Crossing between two rows of picnic tables, the curly-haired squirrel drops a pile of hats concealing her instrument and grabs one of the clowns. The younger acrobat kicks another clown in the knees and holds her trumpet to his chest. A tiny acrobat repeatedly jabs a clown with a cane as the older squirrel follows closely behind. Each of the escaping squirrels leads their clown to the exit. The rest of the blinking acrobats stand at their tables. The younger squirrel jabs her captive in the ankle. Now the newly arrived bird stands behind his supervising dancer and another clown at a curtain."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Words appear. Wearing 50 red and yellow checkered costumes, dancers glide in single file across the stage, each person balancing on the shoulders of the person in front. A choreographer in a bright purple tuxedo peers at them as they pass, while nearby, one dancer crouches excitedly at another director's feet. The line of dancers continues away from a curtain 30 feet high, with instructors on either side of them, as they glide toward a gleaming building, where a flagpole reaches into the sky. On a dirt path populated by a few cheerful audiences, a Buick convertible pauses. The passenger door swings open and a short woman with delicate features tiptoes out wearing a sash. She swings the back door open and assists a blonde-haired woman with a bouquet tiptoe out. Both wearing long capes, they skip across the street toward the theater. At the middle of a wide stone arch, a wooden ticket booth sits under a marquee. As they're near the entrance, the patron gives the performer a little pat. The wooden booth swings open. Just inside, a young manager swings open a velvet curtain. As the wooden booth shuts behind them, the two women pass the manager with no more than a wink from the entering patron. Inside the theater, a performer's rehearsal space is filled with music stands, each with its own sheet music. A dancer with scarlet ribbons lifts a crate labeled Harmony Music Company from a pile. As she dances it across the room, she winks at a watching choreographer. With slight flourish, the performer swings the crate past another instructor to a music stand. Reaching the stand, she joins a curly-haired dancer and sets the crate down. They peel off the outer wrapping. Sitting across from them, a younger performer glances up. The two women dig through large spools of colored fabric. They each pull out a mask, and using the spools to conceal them, pass them to the young performer and a woman sitting next to her. They skillfully slip the masks in their pockets. From the same crate, the older performer and the curly-haired woman retrieve masks of their own. Dancing between two rows of music stands, the curly-haired woman drops a pile of scarves concealing her mask and taps one of the instructors. The younger performer shakes another instructor's hand and whispers something in their ear. A tall dancer repeatedly claps a hand as the older performer follows closely behind. Each of the sneaky dancers guides their companion to the door. The rest of the amazed performers glance at their stands. The younger dancer gestures triumphantly toward her companion. Now the recently arrived performer stands behind her watching patron and another manager at a curtain."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Words emerge. Wearing 50 polka-dotted capes, dancers twirl in pirouette single file across the carpet, each performer gripping the elbows of the performer in front. A choreographer in a bright red scarf peers at them as they spin, while nearby, one dancer lounges lazily at another instructor's feet. The line of dancers spins away from a hedge 30 feet wide, with instructors on either side of them, as they twirl toward a whimsical cottage, where a lighthouse stretches into the horizon. On a gravel path adorned by a few vintage boutiques, a Vespa scooter halts. The rider's seat pops open and a short woman with angular features jumps out wearing a sash. She swings open the sidecar and assists a blonde-haired woman in bracelets to climb out. Both wearing trench coats, they skip across the sidewalk toward the studio. At the middle of a long tall hedge, a wooden archway sits under a trellis. As they're near the entrance, the leader gives the dancer a gentle nudge. The wooden archway swings open. Just inside, an elderly usher opens a velvet curtain. As the archway swings shut behind them, the two women glide past the usher with no more than a wink from the entering leader. Inside the studio, a dancer's rehearsal hall is filled with art easels, each with its own palette. A painter with curly whiskers lifts a crate labeled Kingston Brush Supply from a pile. As he shuffles it across the hall, he winks at a supervising conductor. With slight poise, the painter brings the crate past another conductor to an easel. Reaching the easel, he joins a red-haired artist and places the crate down. They peel off the outer wrapping. Sitting across from them, a younger artist peers up. The two men sift through massive canvases of blue paint. They each extract a violin, and using the canvases to cloak them, hand them to the young artist and a woman sitting beside him. They slyly stow the instruments in their coats. From the same crate, the older painter and the red-haired artist procure violins of their own. Weaving between two lines of easels, the red-haired artist drops a bundle of sketches concealing his instrument and clutches one of the conductors. The younger artist elbows another conductor in the chest and holds his violin under his chin. A lanky painter repeatedly taps a conductor with a brush as the older painter follows closely behind. Each of the ensemble painters guides their companion to the curtain. The rest of the perplexed artists stand at their easels. The younger artist tickles his companion in the ribs. Now the newly arrived dancer stands beside her supervising instructor and another conductor at a curtain."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Text Transformed:\n\nShapes materialize. Sporting 50 green and yellow dotted capes, dancers hop in zigzag formation through the fog, each person gripping the ears of the person ahead. A park ranger in a bright red poncho peers at them as they drift, while nearby, one dancer twirls energetically at another ranger's toes. The ribbon of dancers extends away from a tower 30 meters tall, with rangers flanking them, as they hop toward a vibrant house, where a rainbow stretches into the heavens. On a gravel path surrounded by a few bustling stalls, a Ford pickup halts. The passenger's window slides down and a short woman with smooth curves climbs out holding a trumpet. She shuts the trunk and assists a golden-haired woman with leg irons climb out. Both sporting short ponchos, they glide along the pavement toward the zoo. At the center of a wide low fence, a wooden swing gate rests beneath a lamp post. As they're nearing the access point, the trumpet player gives the jazz singer a gentle nudge. The wooden gate swings wide. Just past, a youthful ranger swings open a brass door. As the wooden gate closes behind them, the two women drift past the ranger with only a shake of the head from the incoming trumpet player. Inside the zoo, an aviary's core chamber buzzes with feeding troughs, each with its own water dish. A dancer with silver eyebrows lifts a jar labeled Dawson Seed Farm from a stack. As she hoists it across the hall, she spots a supervising ranger. With a brief nod, the dancer brings the jar past another ranger to a feeding trough. Reaching the trough, she joins a curly-haired dancer and places the jar down. They peel off the outer label. Sitting opposite them, a fresher dancer peers up. The two women sift through sizable piles of sunflower seeds. They each extract a pebble, and using the seeds to obscure them, pass them to the fresh dancer and a woman across from her. They discreetly pocket the stones in their socks. From the same jar, the silver-browed dancer and the curly-haired woman acquire pebbles of their own. Traversing between two rows of feeding troughs, the curly-haired woman spills a heap of fruits hiding her pebble and snares one of the rangers. The fresher dancer pokes a different ranger in the knee and presses her pebble to his chin. A lanky dancer consistently taps a ranger with a feather as the silver-browed dancer trails closely behind. Each of the leaping dancers escorts their companion to the hatch. The rest of the puzzled dancers linger at their troughs. The fresher dancer nudges her friend in the side. Now the freshly arrived jazz singer stands beside her supervising trumpet player and another ranger at a hatch."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Prisoners in black and white uniforms march in line, each holding the shoulders of the man in front, watched by guards. They head toward a stark building with a smoke stack. Meanwhile, a tall officer escorts a handcuffed, raven-haired convict to the prison, where they pass through a gate under a lookout tower with a nod. Inside, the inmates' room is filled with benches and sewing machines. An inmate with graying hair carries a box labeled Mayer Thread Company and joins a sandy-haired prisoner, where they retrieve hidden guns. Concealing the weapons with spools of thread, they pass them to nearby inmates. The sandy-haired man drops shirts over his weapon, grabs a guard, and the younger inmate punches another guard, holding him at gunpoint. A stocky prisoner attacks a guard with a pipe. Each escaping prisoner takes a hostage, while the remaining inmates stand bewildered. The newly arrived convict stands behind his officer and another guard at the door."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Now the newly arrived convict stands behind his presiding officer and another guard at a door The younger inmate jabs his captive in the gut The rest of the befuddled inmates stand at their benches Each of the escaping prisoners leads their hostage to the door A stocky prisoner repeatedly strikes a guard with a pipe as the older inmate follows closely behind The younger inmate punches another guard in the face and holds his gun to his throat Crossing between two rows of work benches the sandyhaired man drops a load of shirts concealing his weapon and grabs one of the guards From the same box the older inmate and the sandyhaired man retrieve guns of their own They stealthily tuck the weapons in their pants They each pull out a gun and using the spools to conceal them pass them to the young inmate and a man sitting next to him The two men dig through large spools of white thread Sitting across from them a younger inmate glances up They tear off the outer tape Reaching the bench he joins a sandyhaired prisoner and sets the box down With slight length the inmate brings the box past another guard to a work bench As he carries it across the room he glances at a presiding guard A prisoner with graying temples lifts a box labeled Mayer Thread Company from a stack Inside the prison an inmate's central room is filled with work benches each with its own sewing machine As the metal gate closes behind them the two men pass the guard with no more than a nod from the arriving officer Just inside an older guard opens a steel door The metal gate opens As they are near the entrance the officer gives the convict a little shove At the middle of a long high wall a metal entry gate sits under a lookout tower Both wearing long overcoats they walk across the street toward the prison He opens the back door and helps a ravenhaired man in handcuffs step out The driver's door opens and a tall man with bony features steps out wearing a badge On a dirt road populated by a few rundown establishments a Nash sedan stops The line of prisoners continues away from a wall 30 feet high with guards on either side of them as they march toward a stark building where a smoke stack reaches into the sky A prison guard in a dark blue overcoat squints at them as they pass while nearby one prisoner lies motionless at another guard's feet Wearing 50 black and white striped uniforms prisoners march in lockstep single file across the dirt each man holding the shoulders of the man in front Words appear"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Sitting across from them a younger inmate glances up A prisoner with graying temples lifts a box labeled Mayer Thread Company from a stack The metal gate opens Crossing between two rows of work benches the sandyhaired man drops a load of shirts concealing his weapon and grabs one of the guards Each of the escaping prisoners leads their hostage to the door He opens the back door and helps a ravenhaired man in handcuffs step out The driver's door opens and a tall man with bony features steps out wearing a badge As the metal gate closes behind them the two men pass the guard with no more than a nod from the arriving officer Just inside an older guard opens a steel door As he carries it across the room he glances at a presiding guard As they are near the entrance the officer gives the convict a little shove A stocky prisoner repeatedly strikes a guard with a pipe as the older inmate follows closely behind Now the newly arrived convict stands behind his presiding officer and another guard at a door They stealthily tuck the weapons in their pants With slight length the inmate brings the box past another guard to a work bench The rest of the befuddled inmates stand at their benches Wearing 50 black and white striped uniforms prisoners march in lockstep single file across the dirt each man holding the shoulders of the man in front Inside the prison an inmate's central room is filled with work benches each with its own sewing machine They tear off the outer tape A prison guard in a dark blue overcoat squints at them as they pass while nearby one prisoner lies motionless at another guard's feet Reaching the bench he joins a sandyhaired prisoner and sets the box down They each pull out a gun and using the spools to conceal them pass them to the young inmate and a man sitting next to him The younger inmate jabs his captive in the gut On a dirt road populated by a few rundown establishments a Nash sedan stops The younger inmate punches another guard in the face and holds his gun to his throat Both wearing long overcoats they walk across the street toward the prison At the middle of a long high wall a metal entry gate sits under a lookout tower From the same box the older inmate and the sandyhaired man retrieve guns of their own Words appear The line of prisoners continues away from a wall 30 feet high with guards on either side of them as they march toward a stark building where a smoke stack reaches into the sky The two men dig through large spools of white thread"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "With slight length the inmate brings the box past another guard to a work bench Reaching the bench he joins a sandyhaired prisoner and sets the box down They tear off the outer tape Sitting across from them a younger inmate glances up The two men dig through large spools of white thread They each pull out a gun and using the spools to conceal them pass them to the young inmate and a man sitting next to him They stealthily tuck the weapons in their pants From the same box the older inmate and the sandyhaired man retrieve guns of their own Crossing between two rows of work benches the sandyhaired man drops a load of shirts concealing his weapon and grabs one of the guards The younger inmate punches another guard in the face and holds his gun to his throat A stocky prisoner repeatedly strikes a guard with a pipe as the older inmate follows closely behind Each of the escaping prisoners leads their hostage to the door The rest of the befuddled inmates stand at their benches The younger inmate jabs his captive in the gut Now the newly arrived convict stands behind his presiding officer and another guard at a door Words appear Wearing 50 black and white striped uniforms prisoners march in lockstep single file across the dirt each man holding the shoulders of the man in front A prison guard in a dark blue overcoat squints at them as they pass while nearby one prisoner lies motionless at another guard's feet The line of prisoners continues away from a wall 30 feet high with guards on either side of them as they march toward a stark building where a smoke stack reaches into the sky On a dirt road populated by a few rundown establishments a Nash sedan stops The driver's door opens and a tall man with bony features steps out wearing a badge He opens the back door and helps a ravenhaired man in handcuffs step out Both wearing long overcoats they walk across the street toward the prison At the middle of a long high wall a metal entry gate sits under a lookout tower As they are near the entrance the officer gives the convict a little shove The metal gate opens Just inside an older guard opens a steel door As the metal gate closes behind them the two men pass the guard with no more than a nod from the arriving officer Inside the prison an inmate's central room is filled with work benches each with its own sewing machine A prisoner with graying temples lifts a box labeled Mayer Thread Company from a stack As he carries it across the room he glances at a presiding guard"
        }
      ]
    }
  ]
}