{
  "ground_truth": "Outside, Homer bashes a cop with the butt of his rifle, uses him as a shield, and fires. Inside, a young female teller hurries to Dillinger, and they head back down the stairs. Outside, Homer shoots up the police car as another police car arrives down the block. Red waits in his car as the robbers exit with four hostages. Down the road, lawmen aim rifles over the car's hood. Dillinger and his men, using their hostages as shields, cross to the getaway car. Dillinger aims at the police over the president's shoulder, and an officer fires first. Homer aims his automatic rifle, and with Dillinger, they shoot up the other police car, taking out a couple of lawmen. Their car speeds off with Dillinger and Homer on the running boards with their hostages. As they drive down the street, the tails of the crooks' overcoats flap in the breeze. The car comes to a stop under a bridge. Dillinger faces Homer's hostage, and the two hostages run off. Dillinger notices his young hostage shivering, wraps his overcoat around her, and guides her into the backseat. Red drives off. In the car, Dillinger hands the teller his hat. The car heads down a dirt road leading toward a forest of leafless trees. Homer sits next to the young teller. Pete cracks up. Now in the woods, they tie the president and the young teller to a tree. The bank robbers leave their hostages and stride out of the trees. Reaching their car, they get in and drive away. Now, in a marble hearing room, a square-jawed man faces a committee and tilts his ear toward the chairman. The mustached senator looks Director Hoover in the eye, and Hoover whispers to a bespectacled man. Hoover marches out with the bespectacled Suydam and a slender young man. As they walk down a hall, Suydam takes notes. Hoover looks to his young associate. Now a fedora sits on a burgundy leather couch by Purvis, who gazes off thoughtfully. As Hoover exits a nearby office, Purvis stands. They cross an FBI bullpen and step onto a sunny veranda, where reporters gather. Hoover faces a microphone and motions for Purvis to take his place at the mic. Purvis squints decisively at the reporters. Now at his supper club, Dillinger grins as he dines with his friends. He checks his watch and looks toward the door. Rubbing the tip of his nose, he shifts his gaze to the dance floor where a brunette in a red dress dances with a man. Dillinger keeps his eyes fixed on her. His attention shifts as a scrawny guy with glasses approaches. Dillinger stands and shakes his hand. The scrawny Alvin takes a seat beside Dillinger and leans close.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Outside, Homer strikes a cop with the butt of his firearm, uses him as a shield, and discharges. Inside, a young female teller rushes to Dillinger, and they head back down the stairs. Outside, Homer shoots up the patrol car as another patrol car arrives down the block. Red waits in his automobile as the thieves exit with four captives. Down the road, lawmen aim rifles over the vehicle's hood. Dillinger and his men, using their captives as shields, cross to the getaway automobile. Dillinger aims at the police over the president's shoulder, and an officer discharges first. Homer aims his automatic firearm, and with Dillinger, they shoot up the other patrol car, taking out a couple of lawmen. Their automobile speeds off with Dillinger and Homer on the running boards with their captives. As they drive down the street, the tails of the crooks' overcoats flap in the breeze. The car comes to a halt under a bridge. Dillinger faces Homer's captive, and the two captives run off. Dillinger notices his young captive trembling, wraps his overcoat around her, and guides her into the backseat. Red drives off. In the car, Dillinger hands the teller his cap. The automobile heads down a dirt road leading toward a forest of leafless trees. Homer sits next to the young teller. Pete laughs. Now in the woods, they tie the president and the young teller to a tree. The bank thieves leave their captives and stride out of the trees. Reaching their car, they get in and drive away. Now, in a marble hearing room, a square-jawed man faces a committee and tilts his ear toward the chairman. The mustached senator looks Director Hoover in the eye, and Hoover whispers to a bespectacled man. Hoover marches out with the bespectacled Suydam and a slender young man. As they walk down a hall, Suydam takes notes. Hoover looks to his young associate. Now a fedora sits on a burgundy leather couch by Purvis, who gazes off pensively. As Hoover exits a nearby office, Purvis stands. They cross an FBI bullpen and step onto a sunny veranda, where reporters gather. Hoover faces a microphone and motions for Purvis to take his place at the mic. Purvis squints decisively at the reporters. Now at his supper club, Dillinger grins as he dines with his friends. He checks his watch and looks toward the door. Rubbing the tip of his nose, he shifts his gaze to the dance floor where a brunette in a red dress dances with a man. Dillinger keeps his eyes fixed on her. His attention shifts as a skinny guy with spectacles approaches. Dillinger stands and shakes his hand. The skinny Alvin takes a seat beside Dillinger and leans close."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Outside, a cop is bashed by Homer with the butt of his rifle, used as a shield, and shots are fired by him. Inside, Dillinger is hurried to by a young female teller, and they head back down the stairs. Outside, the police car is shot up by Homer as another police car arrives down the block. Red waits in his car as the robbers exit with four hostages. Down the road, rifles are aimed by lawmen over the car's hood. Using their hostages as shields, Dillinger and his men cross to the getaway car. Dillinger aims at the police over the president's shoulder, and an officer fires first. An automatic rifle is aimed by Homer, and with Dillinger, they shoot up the other police car, taking out a couple of lawmen. Their car speeds off with Dillinger and Homer on the running boards with their hostages. As they drive down the street, the tails of the crooks' overcoats flap in the breeze. Under a bridge, the car is brought to a stop. Homer's hostage is faced by Dillinger, and the two hostages run off. Dillinger notices his young hostage shivering, wraps his overcoat around her, and guides her into the backseat. The car is driven off by Red. In the car, the teller is handed Dillinger's hat. The car heads down a dirt road leading toward a forest of leafless trees. Next to the young teller sits Homer. Pete cracks up. Now in the woods, the president and the young teller are tied to a tree. The hostages are left by the bank robbers as they stride out of the trees. Reaching their car, they get in and drive away. Now, in a marble hearing room, a square-jawed man faces a committee and tilts his ear toward the chairman. Director Hoover looks the mustached senator in the eye and whispers to a bespectacled man. Hoover, accompanied by the bespectacled Suydam and a slender young man, marches out. Notes are taken by Suydam as they walk down a hall. Hoover looks to his young associate. Now a fedora is placed on a burgundy leather couch by Purvis, who gazes off thoughtfully. As Hoover exits a nearby office, Purvis stands. They cross an FBI bullpen and step onto a sunny veranda, where reporters gather. Hoover faces a microphone and motions for Purvis to take his place at the mic. The reporters are squinted at decisively by Purvis. Now at his supper club, Dillinger, grinning, dines with his friends. His watch is checked, and he looks toward the door. The tip of his nose is rubbed, and his gaze shifts to the dance floor where a brunette in a red dress dances with a man. The woman is kept in his view by Dillinger. His attention shifts as a scrawny guy with glasses approaches. He stands and shakes Alvin's hand. Beside Dillinger, the scrawny Alvin takes a seat and leans close."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Outside, Homer strikes a cop with his rifle, uses him as a shield, and fires. Inside, a young female teller rushes to Dillinger, and they head downstairs. Outside, Homer shoots at the police car as another one arrives. Red waits in his car as the robbers leave with four hostages. Down the road, lawmen aim rifles over the car's hood. Dillinger and his men, using hostages as shields, reach the getaway car. Dillinger aims over the president's shoulder; an officer fires first. Homer and Dillinger shoot at the police car, taking out a couple of officers. Their car speeds off with Dillinger and Homer on the running boards with their hostages. As they drive, the crooks' coat tails flap. The car stops under a bridge. Dillinger faces Homer's hostage; two hostages flee. Noticing his young hostage shivering, Dillinger wraps her in his overcoat and guides her into the backseat. Red drives off. Dillinger hands the teller his hat as the car heads down a dirt road toward a forest. Homer sits next to the young teller, and Pete laughs. In the woods, they tie the president and the young teller to a tree and leave. Reaching their car, they drive off. In a marble hearing room, a square-jawed man faces a committee and leans toward the chairman. A mustached senator gazes at Director Hoover, who whispers to a bespectacled man. Hoover exits with Suydam and a slender young man, as Suydam takes notes. Hoover looks at his young associate. Now, a fedora rests on a leather couch by Purvis, who gazes thoughtfully. As Hoover exits an office, Purvis stands. They cross an FBI bullpen to a veranda where reporters are gathered. Hoover motions for Purvis to address the reporters. Purvis squints resolutely at them. At his supper club, Dillinger smiles, dines with friends, checks his watch, and looks toward the door. Rubbing his nose, he shifts his gaze to the dance floor, where a brunette in a red dress dances. Dillinger keeps his eyes on her. His attention changes as a thin guy with glasses approaches. Dillinger stands to shake hands with Alvin, who sits beside him and leans in."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Outside, Homer assaults a cop, uses him as a shield, and fires. Inside, a teller joins Dillinger, and they descend the stairs. Homer shoots a police car as another arrives. Red waits while robbers take four hostages. Lawmen aim rifles, Dillinger and men use hostages as shields to reach the car. Dillinger shoots at police, Homer supports, and they escape on running boards, coats flapping. Their car stops under a bridge. Dillinger releases Homer's hostage, noticing his young hostage shivering, wraps her in his coat. Red drives off. In the car, Dillinger gives his hat to the teller. They head down a dirt road into a forest. In the woods, they tie the president and teller to a tree, then leave. In a hearing room, a man listens to a senator, who speaks to Hoover. Hoover exits with Suydam and another man. Walking down the hall, Suydam takes notes. Hoover looks at his young associate. A fedora sits by Purvis, who gazes thoughtfully. Hoover exits an office, Purvis stands. They cross the FBI bullpen to a veranda with reporters. Hoover gestures for Purvis to speak. Purvis squints at reporters. At his club, Dillinger dines with friends, checks his watch, and observes a brunette in a red dress dancing. As a scrawny Alvin approaches, Dillinger stands and shakes his hand. Alvin sits beside Dillinger and leans in."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Outside, in the bustling streets, Homer aggressively strikes a police officer with the butt of his rifle, subsequently using the officer as a human shield while he fires shots. Simultaneously, inside the building, a young female teller hurriedly approaches Dillinger, and together, they swiftly make their way back down the stairs. Meanwhile, outside, chaos ensues as Homer relentlessly shoots at the police car, just as another squad car arrives from down the block. Red waits calmly in his vehicle as the group of robbers emerges, taking four hostages with them. Down the road, resolute lawmen position themselves, aiming rifles over the hoods of their cars. With their hostages strategically placed as shields, Dillinger and his men methodically advance toward their getaway car. In a tense moment, Dillinger takes aim at the officers over the president's shoulder, prompting one of the officers to fire first. Homer, with precision, raises his automatic rifle and joins Dillinger in shooting at the other police car, successfully incapacitating a couple of lawmen. The robbers' getaway car speeds off swiftly, with Dillinger and Homer hanging onto the running boards, hostage in tow. As the car accelerates down the street, the tails of the criminals' overcoats flutter dramatically in the breeze. Eventually, the vehicle halts under the cover of a bridge. Dillinger turns to face Homer's hostage, and at that moment, the two hostages are released and make their escape. Noticing his young hostage trembling from the cold, Dillinger compassionately wraps his overcoat around her and guides her into the backseat. Without delay, Red drives off into the distance. Inside the car, Dillinger courteously hands his hat to the young teller. The vehicle continues its journey down a dirt road, leading into a dense forest of leafless trees. Homer sits closely beside the young teller. Pete, filled with amusement, begins to chuckle. Once they are deep within the woods, they securely tie the president and the young teller to a sturdy tree. The bank robbers leave the hostages behind and confidently stride away through the trees. Reaching their car, they climb in and drive off into the horizon. In a stark contrast, within the imposing setting of a marble hearing room, a square-jawed man resolutely faces a committee, subtly tilting his ear toward the chairman's direction. The mustached senator, looking directly into Director Hoover's eyes, receives a whispered message from Hoover to a bespectacled man nearby. With determination, Hoover strides out with both the bespectacled Suydam and a slender young man. As they proceed down a long hallway, Suydam diligently takes notes. Hoover directs his attention to his young associate. Now, a fedora rests on a burgundy leather couch beside Purvis, who gazes off thoughtfully. As Hoover exits a nearby office, Purvis quickly stands. Together, they cross an active FBI bullpen and step onto a bright, sunny veranda, where a group of eager reporters is gathered. Hoover positions himself in front of a microphone and gestures for Purvis to take his place at the mic. Purvis squints decisively at the assembled reporters. Meanwhile, back at his supper club, Dillinger is seen grinning broadly as he enjoys a meal with his friends. He checks the time on his watch and then looks expectantly toward the door. With a subtle motion, he rubs the tip of his nose before shifting his gaze to the lively dance floor, where a brunette in an eye-catching red dress sways gracefully with her dance partner. Dillinger's eyes remain fixated on her, captivated by her presence. His attention is momentarily diverted as a scrawny guy with glasses begins to approach him. Dillinger promptly stands and extends a handshake to the man. The scrawny Alvin takes a seat beside Dillinger and leans in closely, sharing a private exchange."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "In the bustling and lively streets outside, Homer forcefully and aggressively strikes a police officer with the butt of his rifle. He then uses the officer as a makeshift human shield while he strategically fires off several shots. At the very same time, inside the building, a young female bank teller hurriedly approaches Dillinger; together, they swiftly and decisively make their way back down the stairs. Meanwhile, outside, chaos reigns as Homer continues to relentlessly and methodically shoot at a police car just as another squad car arrives from further down the block. Red patiently waits with composure in his vehicle as the group of robbers emerges, taking with them four hostages. Down the road, resolute lawmen firmly position themselves, aiming their rifles over the hoods of their cars. Using their hostages as strategic shields, Dillinger and his men cautiously and methodically advance toward their waiting getaway car. In a particularly tense moment, Dillinger carefully takes aim at the officers over the shoulder of the president, which prompts one of the officers to fire first. Homer, with precise accuracy, raises his automatic rifle and joins Dillinger in firing at the other police car, effectively incapacitating a couple of lawmen. The robbers' getaway car speeds off with urgency, with Dillinger and Homer daringly hanging onto the running boards, their hostage in tow. As the car races down the street, the tails of the criminals' overcoats dramatically flutter in the breeze. Eventually, the vehicle comes to a stop under the relative cover of a bridge. Dillinger turns to face Homer's hostage, and at that pivotal moment, the two hostages are released and make their escape. Noticing that his young hostage is trembling from the cold, Dillinger compassionately wraps his overcoat around her and gently guides her into the backseat. Without any delay, Red drives off into the vast distance. Within the car, Dillinger courteously hands over his hat to the young teller. The vehicle continues its journey down a narrow dirt road that leads into a dense forest of leafless trees. Homer sits closely beside the young teller, and Pete, filled with amusement, begins to chuckle softly. Once they are deep and concealed within the woods, they securely tie the president and the young teller to a sturdy tree. The bank robbers then leave the hostages behind and confidently stride away through the trees. Reaching their previously parked car, they swiftly climb in and drive off into the distant horizon. In stark contrast, within the imposing and formal setting of a marble hearing room, a square-jawed man resolutely faces a serious committee, subtly tilting his ear toward the chairman's direction. The mustached senator, looking directly and intently into Director Hoover's eyes, receives a whispered message from Hoover to a bespectacled man nearby. With determined purpose, Hoover strides out accompanied by both the bespectacled Suydam and a slender young man. As they proceed down a long hallway, Suydam diligently takes notes. Hoover directs his attention to his young associate. Meanwhile, a fedora rests unassumingly on a burgundy leather couch beside Purvis, who gazes off thoughtfully into the distance. As Hoover exits a nearby office, Purvis quickly stands to attention. Together, they cross a bustling and active FBI bullpen and step onto a bright, sunny veranda, where a group of eager reporters awaits. Hoover positions himself confidently in front of a microphone and gestures for Purvis to take his place at the mic. Purvis squints decisively at the assembled reporters, preparing to address them. Meanwhile, back at his vibrant supper club, Dillinger is seen grinning broadly as he delights in a meal with his friends. He discreetly checks the time on his watch and then looks expectantly toward the door. With a subtle motion, he gently rubs the tip of his nose before shifting his gaze to the lively dance floor. There, a brunette in an eye-catching, vibrant red dress sways gracefully with her dance partner, captivating Dillinger’s full attention. His eyes remain fixated on her, utterly captivated by her presence. His attention is momentarily diverted as a scrawny man with glasses begins to approach him. Dillinger promptly stands up and extends a welcoming handshake to the man. The scrawny Alvin takes a seat beside Dillinger and leans in closely, engaging in a private exchange with him."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Outside, Homer grips the butt of his rifle tightly and swings it with force, connecting it with the side of a cop, causing the officer to reel from the impact. He then maneuvers the cop's body in front of him, positioning him as a shield against potential threats. With skillful precision, Homer opens fire, aiming at targets in the vicinity. Meanwhile, inside the building, a young female teller, her movements rapid and purposeful, makes her way to Dillinger. Together, they make a quick retreat, hurrying down the stairs to join the unfolding chaos outside. Homer, with calculated intent, aims his weapon at a police car and unleashes a barrage of bullets, the sound of gunfire echoing as another police vehicle approaches from down the block. In the getaway car, Red sits patiently, his eyes scanning the surroundings as the robbers emerge from the building, escorting four hostages. Down the road, lawmen position themselves strategically, their rifles poised over the car's hood, ready for confrontation. With their hostages strategically used as human shields, Dillinger and his men make their way cautiously to the getaway car. Dillinger, with steely focus, takes aim over one hostage's shoulder, targeting the officers, but an officer anticipates and fires first. Homer, standing firm, levels his automatic rifle alongside Dillinger, and together, they shower the other police car with gunfire, successfully incapacitating a couple of lawmen. The getaway car abruptly speeds off, with both Dillinger and Homer precariously holding onto the running boards, their hostages still in tow for protection. As they drive rapidly down the street, the loose tails of the crooks' overcoats catch the wind, flapping wildly in their wake. The car ultimately comes to a sudden halt under a bridge, its occupants momentarily catching their breath. Dillinger turns to address Homer's hostage face-to-face, granting them the opportunity to flee, and watches as the two hostages seize the moment and run to safety. Noticing the slight tremble of his young hostage, Dillinger removes his overcoat, draping it over her shoulders to provide comfort and warmth before gently guiding her into the backseat. Red, without hesitation, resumes driving. Inside the moving vehicle, Dillinger offers his hat to the teller as a gesture of reassurance. The car follows a dirt road that meanders toward a forest filled with stark, leafless trees. Homer remains seated beside the young teller, observing silently, while Pete succumbs to laughter, finding humor in the situation. Once enveloped by the woods, they secure the president and the young teller to a tree, ensuring they are bound and unable to escape. With their mission complete, the bank robbers leave their hostages secured and confidently stride out from the cover of the trees. Reaching their vehicle, they slip inside and drive away, leaving the scene behind. Transitioning to a marble hearing room, a man with a strong, square jaw stands facing a committee. He leans slightly, tilting his ear toward the chairman to better catch the whispered exchange. A mustached senator fixes his gaze on Director Hoover, who in response leans in to whisper something discreetly to a bespectacled man. Hoover then exits the room with a sense of urgency, accompanied by the bespectacled Suydam and a slender young man. As they proceed down a hall, Suydam diligently takes notes, documenting the conversation. Hoover turns his attention to his young associate, considering his thoughts. Meanwhile, elsewhere, a fedora rests on a plush burgundy leather couch beside Purvis, who sits in contemplation, lost in thought. As Hoover exits a nearby office, Purvis quickly stands, joining Hoover as they traverse the bustling FBI bullpen and step out onto a sunlit veranda. Reporters are gathered there, poised to capture every word. Hoover turns to face the waiting microphone and signals for Purvis to step forward and speak. With a deliberate squint, Purvis addresses the reporters with determination. In a different setting, within the lively ambiance of his supper club, Dillinger sits grinning, delighting in the company of his friends. Amidst laughter and conversation, he discreetly checks his watch, casting a glance toward the entrance. Subtly rubbing the tip of his nose, he shifts his focus to the dance floor, where a captivating brunette in a striking red dress sways gracefully with a partner. Dillinger's gaze remains fixed on her, captivated by her presence. However, his attention is soon diverted as a scrawny man with glasses approaches. Recognizing him, Dillinger stands, extending his hand in greeting. He shakes hands with the scrawny Alvin, who then takes a seat beside him, leaning in closer to converse."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Outside, Homer uses a cop as a shield while firing and then shoots at the police car as another arrives. Inside, a young female teller hurries to Dillinger, and they head outside together. Red waits in his car as the robbers, using four hostages as shields, cross to the getaway car as lawmen aim rifles at them. Dillinger shoots from behind a hostage, prompting an exchange of gunfire with the police that takes out some lawmen. With Dillinger and Homer clinging to the sides and hostages in tow, their car speeds away, the tails of their overcoats flapping in the wind. Under a bridge, Dillinger releases Homer's hostage, covers a shivering young hostage with his coat, and guides her into the backseat before driving off. Inside the car, Dillinger hands the teller his hat. They travel down a dirt road into a forest where they tie the president and the young teller to a tree before leaving. After exiting the woods, the robbers drive away. \n\nIn a marble hearing room, Director Hoover whispers to a colleague before leaving with his associates. They walk down a hall with Suydam taking notes. Meanwhile, Purvis, sitting nearby, raises his gaze thoughtfully. As Hoover exits an office, Purvis stands, and together, they cross an FBI bullpen and step onto a sunny veranda where reporters are gathered. Hoover motions for Purvis to address the reporters at the microphone, and Purvis squints decisively. Later at his supper club, Dillinger dines with friends, checks his watch, and looks toward the dance floor where a brunette in a red dress dances. Fixating on her, he rubs his nose, then greets a scrawny Alvin who approaches, shaking hands before Alvin takes a seat beside him."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Outside the chaotic scene, Homer, one of John Dillinger's trusted gang members known for his reckless courage, bashes a cop with the butt of his rifle, using him as a shield, and fires. Inside, a young female bank teller, caught in the whirlwind of a notorious bank heist, hurries to Dillinger, the infamous Depression-era bank robber, and they head back down the stairs. Outside, Homer shoots up the police car as another police car, part of the increased security due to the rise in bank robberies, arrives down the block. Red, the gang's getaway driver notorious for his high-speed maneuvers, waits in his car as the robbers exit with four hostages. Down the road, lawmen aim rifles over the car's hood, a common tactic used by law enforcement during the gang's heists. Dillinger and his men, using their hostages as shields to prevent the police from firing freely, cross to the getaway car. Dillinger aims at the police over the president's shoulder—a reference to the bank president, often taken hostage to ensure compliance—and an officer fires first. Homer, with his automatic rifle, and Dillinger shoot up the other police car, taking out a couple of lawmen who were part of the newly formed FBI unit focused on capturing Dillinger. Their car speeds off with Dillinger and Homer on the running boards with their hostages. As they drive down the street, the tails of the crooks' overcoats flap in the breeze, reminiscent of the dramatic escapes often depicted in newsreels of the time. The car comes to a stop under a bridge, a strategic location to evade police helicopters. Dillinger faces Homer's hostage, and the two hostages run off into the night. Dillinger notices his young hostage shivering, wraps his overcoat around her, an act of unexpected compassion noted in many of his escapades, and guides her into the backseat. Red drives off. In the car, Dillinger hands the teller his hat, a symbol of the gentlemanly demeanor he sometimes displayed, despite his criminal activities. The car heads down a dirt road leading toward a forest of leafless trees, a haunting image reflecting the barren landscape of the Midwest during the Great Depression. Homer sits next to the young teller. Pete, another gang member, cracks up at the absurdity of their escape. Now in the woods, they tie the president and the young teller to a tree, leaving them as they often did with hostages to slow down any immediate pursuit. The bank robbers leave their hostages and stride out of the trees. Reaching their car, they get in and drive away into the rural expanse. Now, in a marble hearing room, a square-jawed man faces a committee, a scene underscored by growing public pressure for action against organized crime, and tilts his ear toward the chairman. The mustached senator looks Director J. Edgar Hoover in the eye, and Hoover whispers to a bespectacled man, Suydam, his trusted aide. Hoover marches out with the bespectacled Suydam and a slender young man, a rising figure in the Bureau. As they walk down a hall, Suydam takes notes diligently, capturing details of the discussion. Hoover looks to his young associate, a reflection of his strategy to cultivate a new generation of agents. Now a fedora sits on a burgundy leather couch by Agent Melvin Purvis, known for his relentless pursuit of Dillinger, who gazes off thoughtfully. As Hoover exits a nearby office, Purvis stands, ready to discuss the latest developments. They cross an FBI bullpen and step onto a sunny veranda, where reporters gather, eager for news on the high-profile cases. Hoover faces a microphone and motions for Purvis, a key figure in the Bureau's efforts, to take his place at the mic. Purvis squints decisively at the reporters, embodying the determination that made him a prominent agent. Now at his supper club, Dillinger grins as he dines with his friends, relishing his infamy. He checks his watch and looks toward the door, calculating the timing of his next move. Rubbing the tip of his nose, a habitual gesture illustrating his ever-present alertness, he shifts his gaze to the dance floor where a brunette in a red dress, possibly a new romantic interest, dances with a man. Dillinger keeps his eyes fixed on her, drawn by her charm. His attention shifts as a scrawny guy with glasses approaches, recognized as Alvin Karpis, another notorious criminal of the era. Dillinger stands and shakes his hand, indicating a meeting of criminal minds. The scrawny Alvin takes a seat beside Dillinger and leans close, discussing plans that would further cement their legendary status in the annals of American crime."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Dillinger stands and shakes his hand Outside Homer bashes a cop with the butt of his rifle uses him as a shield and fires Pete cracks up Inside a young female teller hurries to Dillinger and they head back down the stairs Outside Homer shoots up the police car as another police car arrives down the block Red waits in his car as the robbers exit with four hostages Down the road lawmen aim rifles over the car's hood Dillinger and his men using their hostages as shields cross to the getaway car Dillinger aims at the police over the president's shoulder and an officer fires first Homer aims his automatic rifle and with Dillinger they shoot up the other police car taking out a couple of lawmen Now at his supper club Dillinger grins as he dines with his friends Their car speeds off with Dillinger and Homer on the running boards with their hostages As they drive down the street the tails of the crooks' overcoats flap in the breeze The car comes to a stop under a bridge In the car Dillinger hands the teller his hat Dillinger faces Homer's hostage and the two hostages run off They cross an FBI bullpen and step onto a sunny veranda where reporters gather Dillinger notices his young hostage shivering wraps his overcoat around her and guides her into the backseat Red drives off Now in the woods they tie the president and the young teller to a tree In the car Dillinger hands the teller his hat The car heads down a dirt road leading toward a forest of leafless trees Homer sits next to the young teller Pete cracks up Now in the woods they tie the president and the young teller to a tree The bank robbers leave their hostages and stride out of the trees Reaching their car they get in and drive away Now in a marble hearing room a squarejawed man faces a committee and tilts his ear toward the chairman The mustached senator looks Director Hoover in the eye and Hoover whispers to a bespectacled man Hoover marches out with the bespectacled Suydam and a slender young man Hoover marches out with the bespectacled Suydam and a slender young man His attention shifts as a scrawny guy with glasses approaches As they walk down a hall Suydam takes notes Hoover looks to his young associate Now a fedora sits on a burgundy leather couch by Purvis who gazes off thoughtfully As Hoover exits a nearby office Purvis stands They cross an FBI bullpen and step onto a sunny veranda where reporters gather Hoover faces a microphone and motions for Purvis to take his place at the mic Purvis squints decisively at the reporters Now at his supper club Dillinger grins as he dines with his friends Outside Homer shoots up the police car as another police car arrives down the block Now in a marble hearing room a squarejawed man faces a committee and tilts his ear toward the chairman Homer aims his automatic rifle and with Dillinger they shoot up the other police car taking out a couple of lawmen He checks his watch and looks toward the door The scrawny Alvin takes a seat beside Dillinger and leans close The car heads down a dirt road leading toward a forest of leafless trees Rubbing the tip of his nose he shifts his gaze to the dance floor where a brunette in a red dress dances with a man Dillinger keeps his eyes fixed on her His attention shifts as a scrawny guy with glasses approaches Dillinger stands and shakes his hand Outside Homer bashes a cop with the butt of his rifle uses him as a shield and fires Their car speeds off with Dillinger and Homer on the running boards with their hostages Inside a young female teller hurries to Dillinger and they head back down the stairs Now a fedora sits on a burgundy leather couch by Purvis who gazes off thoughtfully The scrawny Alvin takes a seat beside Dillinger and leans close Dillinger aims at the police over the president's shoulder and an officer fires first Red drives off"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Outside Homer bashes a cop with the butt of his rifle uses him as a shield and fires. Inside a young female teller hurries to Dillinger and they head back down the stairs. Outside Homer shoots up the police car as another police car arrives down the block. Red waits in his car as the robbers exit with four hostages. Down the road lawmen aim rifles over the car's hood. Dillinger and his men using their hostages as shields cross to the getaway car. Dillinger aims at the police over the president's shoulder and an officer fires first. Homer aims his automatic rifle and with Dillinger they shoot up the other police car taking out a couple of lawmen. Their car speeds off with Dillinger and Homer on the running boards with their hostages. As they drive down the street the tails of the crooks' overcoats flap in the breeze. The car comes to a stop under a bridge. Dillinger faces Homer's hostage and the two hostages run off. Dillinger notices his young hostage shivering wraps his overcoat around her and guides her into the backseat. Red drives off. In the car Dillinger hands the teller his hat. The car heads down a dirt road leading toward a forest of leafless trees. Homer sits next to the young teller. Pete cracks up. Now in the woods they tie the president and the young teller to a tree. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. The bank robbers leave their hostages and stride out of the trees. Reaching their car they get in and drive away. Now in a marble hearing room a squarejawed man faces a committee and tilts his ear toward the chairman. The mustached senator looks Director Hoover in the eye and Hoover whispers to a bespectacled man. Hoover marches out with the bespectacled Suydam and a slender young man. As they walk down a hall Suydam takes notes. Hoover looks to his young associate. Now a fedora sits on a burgundy leather couch by Purvis who gazes off thoughtfully. As Hoover exits a nearby office Purvis stands. They cross an FBI bullpen and step onto a sunny veranda where reporters gather. Hoover faces a microphone and motions for Purvis to take his place at the mic. Purvis squints decisively at the reporters. Now at his supper club Dillinger grins as he dines with his friends. He checks his watch and looks toward the door. Rubbing the tip of his nose he shifts his gaze to the dance floor where a brunette in a red dress dances with a man. Dillinger keeps his eyes fixed on her. His attention shifts as a scrawny guy with glasses approaches. Dillinger stands and shakes his hand. The scrawny Alvin takes a seat beside Dillinger and leans close."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Outside Homer bashes a cop with the butt of his rifle uses him as a shield and fires. Inside a young female teller hurries to Dillinger and they head back down the stairs. Outside Homer shoots up the police car as another police car arrives down the block. Red waits in his car as the robbers exit with four hostages. Down the road lawmen aim rifles over the car's hood. Dillinger and his men using their hostages as shields cross to the getaway car. Dillinger aims at the police over the president's shoulder and an officer fires first. Homer aims his automatic rifle and with Dillinger they shoot up the other police car taking out a couple of lawmen. Their car speeds off with Dillinger and Homer on the running boards with their hostages. As they drive down the street the tails of the crooks' overcoats flap in the breeze. The car comes to a stop under a bridge. Dillinger faces Homer's hostage and the two hostages run off. Dillinger notices his young hostage shivering wraps his overcoat around her and guides her into the backseat. Red drives off. In the car Dillinger hands the teller his hat. The car heads down a dirt road leading toward a forest of leafless trees. Homer sits next to the young teller. Pete cracks up. Now in the woods they tie the president and the young teller to a tree. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. The bank robbers leave their hostages and stride out of the trees. Reaching their car they get in and drive away. Now in a marble hearing room a squarejawed man faces a committee and tilts his ear toward the chairman. The mustached senator looks Director Hoover in the eye and Hoover whispers to a bespectacled man. Hoover marches out with the bespectacled Suydam and a slender young man. As they walk down a hall Suydam takes notes. Hoover looks to his young associate. Now a fedora sits on a burgundy leather couch by Purvis who gazes off thoughtfully. As Hoover exits a nearby office Purvis stands. They cross an FBI bullpen and step onto a sunny veranda where reporters gather. Hoover faces a microphone and motions for Purvis to take his place at the mic. Purvis squints decisively at the reporters. Now at his supper club Dillinger grins as he dines with his friends. He checks his watch and looks toward the door. Rubbing the tip of his nose he shifts his gaze to the dance floor where a brunette in a red dress dances with a man. Dillinger keeps his eyes fixed on her. His attention shifts as a scrawny guy with glasses approaches. Dillinger stands and shakes his hand. The scrawny Alvin takes a seat beside Dillinger and leans close."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Outside Homer bashes a cop with the butt of his rifle uses him as a shield and fires. Inside a young female teller hurries to Dillinger and they head back down the stairs. Outside Homer shoots up the police car as another police car arrives down the block. Red waits in his car as the robbers exit with four hostages. Down the road lawmen aim rifles over the car's hood. Dillinger and his men using their hostages as shields cross to the getaway car. Dillinger aims at the police over the president's shoulder and an officer fires first. Homer aims his automatic rifle and with Dillinger they shoot up the other police car taking out a couple of lawmen. Their car speeds off with Dillinger and Homer on the running boards with their hostages. As they drive down the street the tails of the crooks' overcoats flap in the breeze. Hoover faces a microphone and motions for Purvis to take his place at the mic. Purvis squints decisively at the reporters. Now at his supper club Dillinger grins as he dines with his friends. He checks his watch and looks toward the door. Rubbing the tip of his nose he shifts his gaze to the dance floor where a brunette in a red dress dances with a man. Dillinger keeps his eyes fixed on her. His attention shifts as a scrawny guy with glasses approaches. Dillinger stands and shakes his hand. The scrawny Alvin takes a seat beside Dillinger and leans close."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Outside Homer bashes a cop with the butt of his rifle uses him as a shield and fires. Inside a young female teller hurries to Dillinger and they head back down the stairs. Outside Homer shoots up the police car as another police car arrives down the block. Red waits in his car as the robbers exit with four hostages. Dillinger keeps his eyes fixed on her. His attention shifts as a scrawny guy with glasses approaches. Dillinger stands and shakes his hand. The scrawny Alvin takes a seat beside Dillinger and leans close."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Outside, a giraffe bashes a firefighter with the butt of its rifle, uses him as a shield, and fires. Inside, a young female chef hurries to a lion, and they head back down the stairs. Outside, the giraffe shoots up the police car as another police car arrives down the block. A raccoon waits in his car as the robbers exit with four hostages. Down the road, sailors aim rifles over the car's hood. The lion and its companions, using their hostages as shields, cross to the getaway car. The lion aims at the police over the penguin's shoulder, and an artist fires first. The giraffe aims its automatic rifle, and with the lion, they shoot up the other police car, taking out a couple of sailors. Their car speeds off with the lion and the giraffe on the running boards with their hostages. As they drive down the street, the tails of the musicians' overcoats flap in the breeze. The car comes to a stop under a bridge. The lion faces the giraffe's hostage, and the two hostages run off. The lion notices its young hostage shivering, wraps its overcoat around her, and guides her into the backseat. The raccoon drives off. In the car, the lion hands the chef its hat. The car heads down a dirt road leading toward a forest of leafless trees. The giraffe sits next to the young chef. A kangaroo cracks up. Now in the woods, they tie the penguin and the young chef to a tree. The bank robbers leave their hostages and stride out of the trees. Reaching their car, they get in and drive away. Now, in a marble hearing room, a square-jawed squirrel faces a committee and tilts its ear toward the chairman. The mustached pirate looks a conductor in the eye, and the conductor whispers to a bespectacled owl. The conductor marches out with the bespectacled Suydam and a slender young walrus. As they walk down a hall, Suydam takes notes. The conductor looks to his young associate. Now a fedora sits on a burgundy leather couch by a gazelle, who gazes off thoughtfully. As the conductor exits a nearby office, the gazelle stands. They cross an FBI bullpen and step onto a sunny veranda, where reporters gather. The conductor faces a microphone and motions for the gazelle to take its place at the mic. The gazelle squints decisively at the reporters. Now at its supper club, the lion grins as it dines with its friends. It checks its watch and looks toward the door. Rubbing the tip of its nose, it shifts its gaze to the dance floor where a brunette in a red dress dances with a zebra. The lion keeps its eyes fixed on her. Its attention shifts as a scrawny wolf with glasses approaches. The lion stands and shakes its paw. The scrawny penguin takes a seat beside the lion and leans close."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Outside, Homer bashes a firefighter with the butt of his shovel, uses him as a barrier, and fires. Inside, a young female florist hurries to Dillinger, and they head back down the escalator. Outside, Homer shoots up the taxi as another taxi arrives down the block. Red waits in his wagon as the robbers exit with four tourists. Down the road, lawmen aim slingshots over the wagon's hood. Dillinger and his men, using their tourists as barriers, cross to the escape wagon. Dillinger aims at the lawmen over the coach's shoulder, and a guard fires first. Homer aims his automatic slingshot, and with Dillinger, they shoot up the other taxi, taking out a couple of guards. Their wagon speeds off with Dillinger and Homer on the running boards with their tourists. As they drive down the avenue, the tails of the crooks' raincoats flap in the breeze. The wagon comes to a stop under a billboard. Dillinger faces Homer's tourist, and the two tourists run off. Dillinger notices his young tourist shivering, wraps his raincoat around her, and guides her into the backseat. Red drives off. In the wagon, Dillinger hands the florist his cap. The wagon heads down a gravel path leading toward a forest of evergreen trees. Homer sits next to the young florist. Pete cracks up. Now in the park, they tie the coach and the young florist to a bench. The bank robbers leave their tourists and stride out of the park. Reaching their wagon, they get in and drive away. Now, in a granite courtroom, a square-jawed man faces a tribunal and tilts his ear toward the chairman. The bearded senator looks Director Hoover in the eye, and Hoover whispers to a bespectacled man. Hoover marches out with the bespectacled Suydam and a slender young man. As they walk down a corridor, Suydam takes notes. Hoover looks to his young associate. Now a trilby sits on a teal leather ottoman by Purvis, who gazes off thoughtfully. As Hoover exits a nearby chamber, Purvis stands. They cross a federal bullpen and step onto a sunny balcony, where photographers gather. Hoover faces a megaphone and motions for Purvis to take his place at the mic. Purvis squints decisively at the photographers. Now at his jazz club, Dillinger grins as he dines with his pals. He checks his watch and looks toward the entrance. Rubbing the tip of his nose, he shifts his gaze to the stage where a brunette in a blue dress dances with a gentleman. Dillinger keeps his eyes fixed on her. His attention shifts as a lanky guy with glasses approaches. Dillinger stands and shakes his hand. The lanky Alvin takes a seat beside Dillinger and leans close."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Outside, Homer nudges a cop with the butt of his rifle, pulls him as a decoy, and waves. Inside, a young female teller skips to Dillinger, and they glide back down the stairs. Outside, Homer taps on the police car as another police car glides down the block. Red lounges in his car as the robbers saunter out with four hostages. Down the road, lawmen throw rifles over the car's hood. Dillinger and his men, using their hostages as decoys, stroll to the getaway car. Dillinger glances at the police over the president's shoulder, and an officer gestures first. Homer lowers his automatic rifle, and with Dillinger, they wave at the other police car, misleading a couple of lawmen. Their car rolls off with Dillinger and Homer on the running boards with their hostages. As they cruise down the street, the tails of the crooks’ overcoats sway in the breeze. The car arrives under a bridge. Dillinger faces Homer's hostage, and the two hostages drift off. Dillinger observes his young hostage shivering, drapes his overcoat around her, and ushers her into the backseat. Red strolls off. In the car, Dillinger offers the teller his hat. The car cruises down a dirt road leading toward a forest of leafless trees. Homer sits beside the young teller. Pete bursts out laughing. Now in the woods, they lean the president and the young teller against a tree. The bank robbers abandon their hostages and meander out of the trees. Reaching their car, they hop in and roll away. Now, in a marble hearing room, a square-jawed man faces a committee and nods his head toward the chairman. The mustached senator stares Director Hoover in the eye, and Hoover murmurs to a bespectacled man. Hoover strides out with the bespectacled Suydam and a slender young man. As they walk down a hall, Suydam scribbles notes. Hoover glances at his young associate. Now a fedora rests on a burgundy leather couch by Purvis, who gazes off dreamily. As Hoover exits a nearby office, Purvis rises. They pace an FBI bullpen and step onto a sunny veranda, where reporters linger. Hoover faces a microphone and gestures for Purvis to take his place at the mic. Purvis narrows his eyes at the reporters. Now at his supper club, Dillinger beams as he chats with his friends. He taps his watch and glances toward the door. Scratching the tip of his nose, he swivels his gaze to the dance floor where a brunette in a red dress sways with a man. Dillinger keeps his eyes locked on her. His focus shifts as a scrawny guy with glasses ambles over. Dillinger rises and nods his hand. The scrawny Alvin settles into a seat beside Dillinger and leans back."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Outside, a chandelier bashes a postman with the butt of its broom, uses it as a cushion, and fires. Inside, an ancient male detective hurries to a cat, and they head back down the elevator. Outside, a chandelier shoots up the bicycle as another bicycle arrives down the staircase. A tree waits in its bucket as the magicians exit with four lampshades. Down the tunnel, elves aim trombones over the igloo's hood. A cat and its birds, using their lampshades as cushions, cross to the escape skateboard. The cat aims at the elves over the giraffe's knee, and a snail fires first. A chandelier aims its automatic broom, and with the cat, they shoot up the other bicycle, taking out a couple of elves. Their skateboard speeds off with the cat and the chandelier on the running boards with their lampshades. As they drive down the corridor, the tails of the raisins' pajamas flap in the breeze. The skateboard comes to a stop under a hammock. The cat faces the chandelier's lampshade, and the two lampshades run off. The cat notices its ancient lampshade shivering, wraps its pajamas around it, and guides it into the backseat. A tree drives off. In the skateboard, the cat hands the detective its umbrella. The skateboard heads down a gravel path leading toward a forest of toothpick bushes. A chandelier sits next to the ancient detective. A lion cracks up. Now in the desert, they tie the giraffe and the ancient detective to a cactus. The swamp creatures leave their lampshades and stride out of the bushes. Reaching their skateboard, they get in and drive away. Now, in a cardboard dining room, a round-eared cloud faces a gnome and tilts its chin toward the princess. The whiskered wizard looks Farmer McGregor in the belly, and McGregor whispers to a monocled butterfly. McGregor marches out with the monocled Bloom and a stout ancient clown. As they waddle down a mine, Bloom takes photographs. McGregor looks to its ancient comrade. Now a shoe sits on a teal velvet chair by Watson, who gazes off thoughtfully. As McGregor exits a nearby chapel, Watson stands. They cross a CIA aquarium and step onto a gloomy pier, where tourists gather. McGregor faces a ladybug and motions for Watson to take its place at the bug. Watson squints decisively at the tourists. Now at its beach shack, the cat grins as it sings with its enemies. It checks its calendar and looks toward the window. Rubbing the tip of its tail, it shifts its gaze to the courtyard where a squirrel in a green hat brews with a sword. The cat keeps its toes fixed on it. Its attention shifts as a stout mouse with headphones approaches. The cat stands and shakes its foot. The stout Marvin takes a pillow beside the cat and leans far."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Outside, Lisa dribbles a balloon with the edge of her umbrella, waves it as a flag, and fiddles. Inside, an elderly male chef rushes to Capone, and they wander back up the elevator. Outside, Lisa taps on the fire truck as another ambulance arrives around the corner. Blue waits on his skateboard as the jugglers parade with seven performers. Along the avenue, tourists hold cameras on the vehicle's roof. Capone and his crew, using their performers as umbrellas, dash to the escape bike. Capone glances at the tourists over the mayor's shoulder, and a spectator snaps first. Lisa glances through her magnifying glass, and with Capone, they scribble on the other ambulance, doodling a couple of tourists. Their skateboard rolls off with Capone and Lisa on the handlebars with their performers. As they coast along the boulevard, the straps of the magicians' capes flutter in the gust. The skateboard halts below an archway. Capone faces Lisa’s performer, and the three performers skip away. Capone observes his elderly performer shivering, drapes his cape around her, and nudges her into the back basket. Blue skates away. On the skateboard, Capone passes the chef a scarf. The skateboard glides along a gravel path leading toward a grove of leafless bushes. Lisa kneels beside the elderly chef. Sarah cracks up. Now in the pasture, they tie the mayor and the elderly chef to a post. The acrobats abandon their performers and float out of the bushes. Arriving at their skateboard, they hop on and zip away. Now, in a sand courtroom, a round-faced woman faces an audience and leans her nose toward the leader. The bearded detective glances at Professor Eastwood in the mouth, and Eastwood murmurs to a bald woman. Eastwood glides out with the bald Remick and a chunky elder woman. As they glide across a foyer, Remick sketches notes. Eastwood glances at his elder companion. Now, a sombrero perches on a teal velvet chair by Jennings, who peers off dreamily. As Eastwood vanishes into a distant lounge, Jennings rises. They shuffle across a CIA base and descend onto a rainy balcony, where tourists chat. Eastwood faces a megaphone and gestures for Jennings to replace him at the horn. Jennings blinks uncertainly at the tourists. Now at a lavish concert hall, Capone chuckles as he paints with his mentors. He reads his map and glances toward the stage. Scratching the top of his cap, he directs his focus to the orchestra pit where a blonde in a green jacket sways with a violinist. Capone keeps his gaze locked on him. His curiosity shifts as a lanky girl with freckles ambles over. Capone rises and pats her elbow. The lanky Eliza grabs a stool beside Capone and nods slowly."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Outside, Homer flicks a gardener with the edge of his umbrella, uses him as a bench, and whistles. Inside, a young female dancer skips to Dillinger, and they drift back up the escalator. Outside, Homer scribbles on the fire truck as another ice cream truck strolls down the avenue. Red lounges in his bicycle as the robbers prance with four tourists. Down the lane, lawmen balance binoculars over the bicycle's basket. Dillinger and his men, using their tourists as benches, hop to the getaway horse. Dillinger winks at the firemen over the baker's shoulder, and an officer claps first. Homer directs his water pistol, and with Dillinger, they doodle on the other fire truck, distracting a couple of firemen. Their horse gallops off with Dillinger and Homer on the saddlebags with their tourists. As they glide down the boulevard, the wings of the crooks' capes flutter in the gust. The horse gallops to a halt under a canopy. Dillinger gazes at Homer's tourist, and the two tourists skip away. Dillinger notices his young tourist giggling, drapes his cape around her, and nudges her onto the merry-go-round. Red pedals away. On the horse, Dillinger gives the dancer his scarf. The horse trots down a cobblestone path leading toward a grove of evergreen trees. Homer rests next to the young dancer. Pete bursts out laughing. Now in the meadow, they paint the baker and the young dancer onto a boulder. The bank artists leave their tourists and saunter out of the grove. Reaching their horse, they hop in and gallop away. Now, in a granite conference room, a sharp-chinned lady faces a council and tilts her elbow toward the chairman. The bearded senator stares Director Hoover in the eye, and Hoover hums to a spectacled lady. Hoover springs out with the spectacled Suydam and a slender young lady. As they skip down a corridor, Suydam doodles. Hoover turns to his young companion. Now a top hat lounges on a velvet leather armchair by Purvis, who gazes off dreamily. As Hoover exits a nearby lounge, Purvis hops up. They twirl through an FBI parlor and skip onto a sunny terrace, where tourists assemble. Hoover gazes at a telescope and gestures for Purvis to take his place at the binoculars. Purvis blinks decisively at the tourists. Now at his garden party, Dillinger giggles as he picnics with his buddies. He taps his wrist and scans toward the window. Scratching the tip of his shoe, he shifts his gaze to the carousel where a brunette in a blue skirt spins with a lady. Dillinger keeps his eyes glued on her. His focus drifts as a lanky girl with earrings approaches. Dillinger jumps up and claps her hand. The lanky Alice settles beside Dillinger and giggles softly."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Beyond the garden, Hector tickles a firefighter with the feather of his umbrella, uses him as an cushion, and whistles. Nearby, an old male florist lounges to Lancelot, and they jump back up the elevator. Beyond the garden, Hector paints over the bicycle as another bicycle glides up the hill. Blue dozes in his scooter as the dancers enter with three kittens. Down the path, chefs toss frisbees over the scooter's trunk. Lancelot and his crew, using their kittens as hats, float to the vacation bus. Lancelot points at the chefs over the king's spoon, and a chef giggles last. Hector points his electric umbrella, and with Lancelot, they paint over the other bicycle, removing a pair of chefs. Their scooter glides off with Lancelot and Hector on the bumpers with their kittens. As they glide up the avenue, the edges of the bakers' aprons glide in the wind. The scooter arrives to a pause under a tunnel. Lancelot turns to Hector's kitten, and the duo of kittens leap away. Lancelot notices his old kitten laughing, unfolds his apron around her, and leads her into the trunk. Blue glides away. In the scooter, Lancelot hands the florist his scarf. The scooter paths up a muddy alley heading toward a sea of mossy boulders. Hector lounges next to the old florist. Mike falls over. Now in the mountains, they wrap the king and the old florist to a ladder. The musicians abandon their kittens and trot out of the boulders. Reaching their scooter, they hop in and glide away. Now, in a velvet lobby, a long-winded lady waves a fan and tilts her nose toward the attorney. The bemused judge watches Captain Dooling in the knee, and Dooling chants to a hairless lady. Dooling dances out with the hairless Bartholomew and a rotund old lady. As they skip through a corridor, Bartholomew hums rhymes. Dooling turns to his old friend. Now a top hat lies on a sapphire wooden stool by Grant, who peers closely lazily. As Dooling enters a distant room, Grant leaps. They skip an ESPN playground and hop onto a rainy meadow, where tourists swarm. Dooling waves at a cello and snaps for Grant to twirl his hips at the cello. Grant dozes sleepily at the tourists. Then at his library, Lancelot cries as he reads with his cats. He fixes his trousers and glances toward the window. Scratching the rim of his ear, he tilts his gaze to the picnic table where a blonde in a purple skirt naps with a lady. Lancelot keeps his feet fixed on her. His focus drifts as a burly wolf with ribbons jogs. Lancelot stretches and swings his tail. The burly Jason stretches a spot beside Lancelot and hops up."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Outside, Homer attacks a cop, uses him as a shield, and fires. Inside, a female teller rushes to Dillinger, and they head downstairs. Homer shoots a police car as another arrives. Red waits in his car as the robbers exit with hostages. Lawmen aim rifles; Dillinger and his gang use hostages as shields to reach the getaway car. A shootout ensues, and the robbers escape, with Dillinger and Homer on the running boards, hostages in tow. They stop under a bridge, release hostages, and drive away. In a marble hearing room, Director Hoover faces a committee. He exits with Suydam and a young man, discussing notes. Purvis, in deep thought, stands as Hoover exits an office, and they head to a veranda where Purvis addresses reporters. At the supper club, Dillinger dines with friends, watches a woman dance, and greets Alvin, who joins him."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "The scrawny Alvin takes a seat beside Dillinger and leans close Dillinger stands and shakes his hand His attention shifts as a scrawny guy with glasses approaches Dillinger keeps his eyes fixed on her Rubbing the tip of his nose he shifts his gaze to the dance floor where a brunette in a red dress dances with a man He checks his watch and looks toward the door Now at his supper club Dillinger grins as he dines with his friends Purvis squints decisively at the reporters Hoover faces a microphone and motions for Purvis to take his place at the mic They cross an FBI bullpen and step onto a sunny veranda where reporters gather As Hoover exits a nearby office Purvis stands Now a fedora sits on a burgundy leather couch by Purvis who gazes off thoughtfully Hoover looks to his young associate As they walk down a hall Suydam takes notes Hoover marches out with the bespectacled Suydam and a slender young man The mustached senator looks Director Hoover in the eye and Hoover whispers to a bespectacled man Now in a marble hearing room a squarejawed man faces a committee and tilts his ear toward the chairman Reaching their car they get in and drive away The bank robbers leave their hostages and stride out of the trees Now in the woods they tie the president and the young teller to a tree Pete cracks up Homer sits next to the young teller The car heads down a dirt road leading toward a forest of leafless trees In the car Dillinger hands the teller his hat Red drives off Dillinger notices his young hostage shivering wraps his overcoat around her and guides her into the backseat Dillinger faces Homer's hostage and the two hostages run off The car comes to a stop under a bridge As they drive down the street the tails of the crooks' overcoats flap in the breeze Their car speeds off with Dillinger and Homer on the running boards with their hostages Homer aims his automatic rifle and with Dillinger they shoot up the other police car taking out a couple of lawmen Dillinger aims at the police over the president's shoulder and an officer fires first Dillinger and his men using their hostages as shields cross to the getaway car Down the road lawmen aim rifles over the car's hood Red waits in his car as the robbers exit with four hostages Outside Homer shoots up the police car as another police car arrives down the block Inside a young female teller hurries to Dillinger and they head back down the stairs Outside Homer bashes a cop with the butt of his rifle uses him as a shield and fires"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Dillinger faces Homer's hostage and the two hostages run off Rubbing the tip of his nose he shifts his gaze to the dance floor where a brunette in a red dress dances with a man The car comes to a stop under a bridge He checks his watch and looks toward the door Dillinger keeps his eyes fixed on her Hoover faces a microphone and motions for Purvis to take his place at the mic Dillinger notices his young hostage shivering wraps his overcoat around her and guides her into the backseat Dillinger and his men using their hostages as shields cross to the getaway car Hoover looks to his young associate Purvis squints decisively at the reporters As Hoover exits a nearby office Purvis stands Down the road lawmen aim rifles over the car's hood As they drive down the street the tails of the crooks' overcoats flap in the breeze The bank robbers leave their hostages and stride out of the trees Red waits in his car as the robbers exit with four hostages As they walk down a hall Suydam takes notes Reaching their car they get in and drive away The mustached senator looks Director Hoover in the eye and Hoover whispers to a bespectacled man Homer sits next to the young teller The scrawny Alvin takes a seat beside Dillinger and leans close Now at his supper club Dillinger grins as he dines with his friends Now a fedora sits on a burgundy leather couch by Purvis who gazes off thoughtfully Outside Homer bashes a cop with the butt of his rifle uses him as a shield and fires Dillinger stands and shakes his hand Red drives off Now in the woods they tie the president and the young teller to a tree Outside Homer shoots up the police car as another police car arrives down the block His attention shifts as a scrawny guy with glasses approaches They cross an FBI bullpen and step onto a sunny veranda where reporters gather Hoover marches out with the bespectacled Suydam and a slender young man Now in a marble hearing room a squarejawed man faces a committee and tilts his ear toward the chairman Dillinger aims at the police over the president's shoulder and an officer fires first Their car speeds off with Dillinger and Homer on the running boards with their hostages In the car Dillinger hands the teller his hat The car heads down a dirt road leading toward a forest of leafless trees Pete cracks up Inside a young female teller hurries to Dillinger and they head back down the stairs Homer aims his automatic rifle and with Dillinger they shoot up the other police car taking out a couple of lawmen"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "The bank robbers leave their hostages and stride out of the trees Reaching their car they get in and drive away Now in a marble hearing room a squarejawed man faces a committee and tilts his ear toward the chairman The mustached senator looks Director Hoover in the eye and Hoover whispers to a bespectacled man Hoover marches out with the bespectacled Suydam and a slender young man As they walk down a hall Suydam takes notes Hoover looks to his young associate Now a fedora sits on a burgundy leather couch by Purvis who gazes off thoughtfully As Hoover exits a nearby office Purvis stands They cross an FBI bullpen and step onto a sunny veranda where reporters gather Hoover faces a microphone and motions for Purvis to take his place at the mic Purvis squints decisively at the reporters Now at his supper club Dillinger grins as he dines with his friends He checks his watch and looks toward the door Rubbing the tip of his nose he shifts his gaze to the dance floor where a brunette in a red dress dances with a man Dillinger keeps his eyes fixed on her His attention shifts as a scrawny guy with glasses approaches Dillinger stands and shakes his hand The scrawny Alvin takes a seat beside Dillinger and leans close Outside Homer bashes a cop with the butt of his rifle uses him as a shield and fires Inside a young female teller hurries to Dillinger and they head back down the stairs Outside Homer shoots up the police car as another police car arrives down the block Red waits in his car as the robbers exit with four hostages Down the road lawmen aim rifles over the car's hood Dillinger and his men using their hostages as shields cross to the getaway car Dillinger aims at the police over the president's shoulder and an officer fires first Homer aims his automatic rifle and with Dillinger they shoot up the other police car taking out a couple of lawmen Their car speeds off with Dillinger and Homer on the running boards with their hostages As they drive down the street the tails of the crooks' overcoats flap in the breeze The car comes to a stop under a bridge Dillinger faces Homer's hostage and the two hostages run off Dillinger notices his young hostage shivering wraps his overcoat around her and guides her into the backseat Red drives off In the car Dillinger hands the teller his hat The car heads down a dirt road leading toward a forest of leafless trees Homer sits next to the young teller Pete cracks up Now in the woods they tie the president and the young teller to a tree"
        }
      ]
    }
  ]
}