{
  "ground_truth": "He changes direction. The underground chase is as furious as the race above. Mitchell crashes through some supports. The roof starts to cave in on Bond. The crowds cheer enthusiastically. Mitchell's on a ladder to the surface as Bond picks himself up and keeps going. Fireworks signify that the race has a winner. The track is invaded. Amidst the tears and celebrations, Bond emerges from a manhole. Mitchell barges his way through the throng. Bond follows. He fires towards Bond, hitting a woman, then scrambles over a barrier onto the racetrack. 007 sprints in pursuit. The chase moves through a courtyard, then through a door and upstairs. Mitchell barges into an elderly woman lifting a crate of fruit on a rope. The crate crashes to the ground. Mitchell leaps across tiled rooftops, his pursuer following relentlessly. He takes a massive leap between buildings. Cluster around the shot civilian. A round strikes nearby as Bond leaps. He lands, slides down the tiles, then jumps again, landing heavily on a ledge. His quarry is on a roof across from and above him. He jumps down onto a balcony, leaps onto another, and holds himself up on the metal railings. He bursts into a room, runs through the apartment, and sees Mitchell climbing onto another roof a short distance away. He jumps from a window onto the roof of a bus. He gets to his feet and jumps from the vehicle onto another ledge, then shins off a drainpipe. Face set grimly, he's now on the same roof as his target. Mitchell arrives at the top of an empty tower. He leaps for a flight of steps dislodging recently. Bond follows and fires as the double agent runs out of sight. Bond pulls on the bell ropes, then heads up to the belfry, gun up and ready. Mitchell attacks from a perch outside the tower. Bond grabs his arm and hits out with an elbow. Both fall through a glass roof and onto a scaffold beneath. Bond's gun falls to the floor far below. Hanging by one hand, Bond tries to pull down the scaffolding beneath his adversary. Mitchell falls but grabs onto a rope. It swings, knocking over a pane of glass which shatters, sending vicious shards raining down. The rope gantry swings and the crate of bricks falls from the other end. Bond also grabs a rope. The two men end up facing each other, dangling on ropes at either end of the steel gantry. They trade blows and smash into a scaffold which topples over, pulling on the rope, hauling them into the glass roof. Mitchell falls onto the scaffold. Leg caught in a rope, Bond plummets, but is stopped just before hitting the ground near the gun.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "He alters course. The subterranean pursuit is as intense as the contest above. Mitchell collides with some pillars. The ceiling begins to collapse on Bond. The mobs acclaim zealously. Mitchell's on a ladder to the surface as Bond raises himself and continues. Pyrotechnics indicate that the contest has a victor. The course is overrun. Amidst the sobs and festivities, Bond surfaces from a manhole. Mitchell forces his path through the multitude. Bond trails. He shoots towards Bond, striking a woman, then clambers over a barricade onto the racecourse. 007 dashes in pursuit. The pursuit transitions through a courtyard, then through a portal and upstairs. Mitchell pushes into an elderly lady hoisting a box of produce on a cord. The box plummets to the earth. Mitchell vaults across ceramic rooftops, his chaser tailing persistently. He takes a vast leap between edifices. Cluster around the shot civilian. A bullet hits nearby as Bond vaults. He alights, slides down the ceramics, then jumps again, landing roughly on a ledge. His prey is on a rooftop across from and above him. He jumps down onto a balcony, leaps onto another, and supports himself on the metallic railings. He bursts into a chamber, runs through the flat, and observes Mitchell ascending onto another rooftop a brief distance away. He jumps from a casement onto the roof of a coach. He rises to his feet and jumps from the conveyance onto another ledge, then climbs off a drainpipe. Face set grimly, he's now on the identical roof as his mark. Mitchell arrives at the peak of an unoccupied tower. He leaps for a series of steps dislodging recently. Bond follows and shoots as the double agent disappears. Bond pulls on the chime cords, then heads up to the bell chamber, firearm up and prepared. Mitchell assaults from a perch outside the tower. Bond seizes his limb and strikes with an elbow. Both tumble through a glass ceiling and onto a scaffold beneath. Bond's firearm falls to the floor far below. Dangling by one hand, Bond attempts to pull down the scaffolding beneath his opponent. Mitchell descends but clutches onto a cord. It swings, toppling over a pane of glass which fractures, sending vicious fragments raining down. The cord gantry swings and the crate of bricks descends from the opposite end. Bond also seizes a cord. The two men end up facing each other, suspending on cords at either end of the steel gantry. They exchange strikes and crash into a scaffold which tips over, pulling on the cord, hauling them into the glass ceiling. Mitchell falls onto the scaffold. Limb ensnared in a cord, Bond plummets, but is halted just before hitting the earth near the firearm."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Direction is changed by him. The underground chase is as furious as the race above. Some supports are crashed through by Mitchell. Bond is started to be caved in on by the roof. Enthusiastic cheers are given by the crowds. On a ladder to the surface is Mitchell as Bond is picked up by himself and keeps going. That the race has a winner is signified by fireworks. The track is invaded by spectators. Amidst the tears and celebrations, from a manhole emerges Bond. His way through the throng is barged by Mitchell. He is followed by Bond. Towards Bond, he fires, hitting a woman, then a barrier onto the racetrack is scrambled over by him. In pursuit, sprints 007. Through a courtyard, the chase moves, then through a door and upstairs. Into an elderly woman lifting a crate of fruit on a rope, Mitchell barges. To the ground crashes the crate. Across tiled rooftops, Mitchell leaps, relentlessly following his pursuer. A massive leap between buildings is taken by him. Around the shot civilian, people cluster. Nearby, a round strikes as Bond leaps. He lands, tiles are slid down by him, then jumps again, and heavily on a ledge he lands. Across from and above him, on a roof, is his quarry. Onto a balcony, he jumps down, leaps onto another, and on the metal railings, he holds himself up. Into a room, he bursts, runs through the apartment, and onto another roof a short distance away sees Mitchell climbing. From a window, he jumps onto the roof of a bus. To his feet, he gets and from the vehicle jumps onto another ledge, then off a drainpipe shins. Grimly set face, on the same roof as his target, he is now. At the top of an empty tower, Mitchell arrives. For a flight of steps, he leaps dislodging recently. Him, Bond follows and as the double agent runs out of sight, fires. The bell ropes are pulled on by Bond, then up to the belfry, gun up and ready, he heads. From a perch outside the tower, Mitchell attacks. His arm is grabbed by Bond and with an elbow hits out. Through a glass roof and onto a scaffold beneath, both fall. The floor far below is where Bond's gun falls. Hanging by one hand, to pull down the scaffolding beneath his adversary, Bond tries. But onto a rope Mitchell falls, grabbing onto it. Over a pane of glass, it swings, which shatters, sending vicious shards raining down. The rope gantry swings and from the other end, the crate of bricks falls. A rope is also grabbed by Bond. At either end of the steel gantry, facing each other, dangling on ropes, the two men end up. Blows are traded and into a scaffold which topples over, they smash, on the rope pulling, into the glass roof hauling them. Onto the scaffold, Mitchell falls. Plummeting, Bond’s leg caught in a rope, but just before hitting the ground near the gun, he is stopped."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "He changes direction. The underground chase is as intense as the one above. Mitchell crashes through supports, causing the roof to cave in on Bond. The crowd cheers. Mitchell climbs a ladder to the surface as Bond continues. Fireworks announce the race winner. Amidst celebrations, Bond emerges from a manhole. Mitchell pushes through the crowd, firing and hitting a woman, then scrambles onto the racetrack. Bond pursues through a courtyard, up stairs, and onto rooftops. Mitchell collides with an elderly woman, dropping her fruit crate. He leaps across rooftops, with Bond in relentless pursuit. A shot hits near Bond as he jumps, landing heavily on a ledge. His target is on a higher roof. Bond jumps onto a bus, then onto a ledge, and climbs a drainpipe. Now on the same roof, Mitchell reaches an empty tower. Bond follows, firing as Mitchell disappears. Bond pulls bell ropes and heads to the belfry, gun ready. Mitchell attacks from outside. Bond grabs his arm, and they fall through a glass roof onto a scaffold. Bond's gun drops far below. Hanging by one hand, Bond tries to pull down the scaffolding. Mitchell falls but grabs a rope, knocking over glass shards. Both men end up facing each other, dangling on ropes. They trade blows, smashing into a scaffold, which topples and pulls them into the glass roof. Mitchell falls onto the scaffold. Bond, leg caught in a rope, plummets but stops just before hitting the ground near the gun."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "He changes direction. The underground chase is as intense as above. Mitchell crashes through supports, causing the roof to cave in on Bond. Crowds cheer. Mitchell climbs a ladder as Bond continues. Fireworks signal a race winner. Amidst celebrations, Bond emerges from a manhole. Mitchell pushes through the crowd, firing and hitting a woman, then jumps onto the racetrack. Bond pursues through a courtyard, upstairs, and into an elderly woman, dropping her crate. Mitchell leaps across rooftops, pursued relentlessly. He jumps between buildings. A round hits nearby as Bond leaps, landing heavily on a ledge. His target is on a roof above. Bond jumps onto a balcony, then into a room, seeing Mitchell on another roof. He jumps onto a bus, then a ledge, and climbs a drainpipe. Now on the same roof, Mitchell reaches an empty tower. He leaps for steps. Bond follows, firing as Mitchell disappears. Bond pulls bell ropes, heads to the belfry, gun ready. Mitchell attacks from outside. Bond grabs his arm, both fall through a glass roof onto a scaffold. Bond's gun falls below. Hanging by one hand, Bond pulls the scaffolding. Mitchell falls, grabs a rope, knocking over glass. The rope gantry swings, and bricks fall. Bond grabs a rope. They face each other, trading blows, smashing into a scaffold, pulling them into the glass roof. Mitchell falls onto the scaffold. Bond, leg caught in a rope, plummets but stops near the gun."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "He abruptly changes his direction, altering the course of his movement. The underground chase is every bit as intense and furious as the high-speed race taking place above ground. In the chaos, Mitchell crashes through some structural supports, causing the roof to begin caving in on Bond. Meanwhile, the crowds above cheer with enthusiastic fervor. Mitchell finds himself on a ladder leading to the surface, while Bond, undeterred, picks himself up and continues his relentless pursuit. Fireworks explode in the sky, signifying that the race has a winner. The track is soon invaded by a throng of people. Amidst the tears of joy and celebrations, Bond emerges from a manhole, determined and focused. Mitchell forcefully pushes his way through the dense crowd. Bond follows closely behind. In the ensuing chaos, Mitchell fires a shot towards Bond, tragically hitting a woman, then scrambles over a barrier onto the racetrack. Agent 007 sprints in hot pursuit. The chase moves swiftly through a courtyard, then through a door and up a flight of stairs. Mitchell barges into an elderly woman who is lifting a crate of fruit with a rope. The crate crashes to the ground, scattering fruit everywhere. Mitchell leaps across the tiled rooftops, with his relentless pursuer following closely behind. He takes a massive leap between buildings. A crowd clusters around the shot civilian. A round strikes nearby as Bond leaps, landing and sliding down the tiles before jumping again, landing heavily on a ledge. His quarry is now on a roof across from and above him. Bond jumps down onto a balcony, then leaps onto another, holding himself up on the metal railings. He bursts into a room, runs through the apartment, and sees Mitchell climbing onto another roof a short distance away. Bond jumps from a window onto the roof of a bus. He quickly gets to his feet and jumps from the vehicle onto another ledge, then shins off a drainpipe. With his face set grimly, he is now on the same roof as his target. Mitchell arrives at the top of an empty tower. He leaps for a flight of steps that have recently been dislodged. Bond follows and fires as the double agent runs out of sight. Bond pulls on the bell ropes, then heads up to the belfry, gun raised and ready. Mitchell attacks from a perch outside the tower. Bond grabs his arm and strikes out with an elbow. Both men fall through a glass roof and onto a scaffold beneath. Bond's gun falls to the floor far below. Hanging by one hand, Bond tries to pull down the scaffolding beneath his adversary. Mitchell falls but manages to grab onto a rope. It swings, knocking over a pane of glass which shatters, sending vicious shards raining down. The rope gantry swings, and the crate of bricks falls from the other end. Bond also grabs a rope. The two men end up facing each other, dangling on ropes at either end of the steel gantry. They trade blows and smash into a scaffold, which topples over, pulling on the rope and hauling them into the glass roof. Mitchell falls onto the scaffold. With his leg caught in a rope, Bond plummets but is stopped just before hitting the ground near the gun."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "He suddenly and without warning alters his direction, changing the course of his movement entirely. The underground chase is as intense and furious as the high-speed race unfolding above ground. Amidst the pandemonium, Mitchell crashes through some structural supports, causing the roof to begin collapsing in on Bond. Meanwhile, the crowds above are cheering with unrestrained and enthusiastic fervor. Mitchell finds himself on a ladder leading to the surface, while Bond, undeterred by the chaos around him, picks himself up from the debris and continues his relentless pursuit. In the night sky, fireworks explode, signifying that the race has reached a conclusion and a winner has been crowned. The track is soon overwhelmed by a throng of jubilant people. Amidst the tears of joy and exuberant celebrations, Bond emerges from a manhole, looking both determined and intensely focused. Mitchell forcefully pushes his way through the dense and tightly packed crowd. Bond follows closely behind, never letting him out of sight. In the ensuing chaos, Mitchell fires a shot towards Bond, tragically hitting a woman, and then hastily scrambles over a barrier onto the racetrack. Agent 007 sprints in hot pursuit, maintaining the chase. The pursuit moves swiftly through a courtyard, passing through a door and up a flight of stairs. Mitchell barges into an elderly woman who is lifting a crate of fruit with a rope. The crate crashes to the ground, scattering fruit in all directions. Mitchell leaps across the tiled rooftops with his relentless pursuer following closely and not giving up. He takes a massive leap between buildings. A crowd clusters around the shot civilian. A round strikes nearby as Bond leaps, landing and sliding down the tiles before jumping again and landing heavily on a ledge. His quarry is now positioned on a roof across from and above him. Bond jumps down onto a balcony, then leaps onto another, holding himself up on the metal railings. He bursts into a room, runs through the apartment, and sees Mitchell climbing onto another roof just a short distance away. Bond jumps from a window onto the roof of a bus. He swiftly gets to his feet and jumps from the vehicle onto another ledge, then shins off a drainpipe. With his face set grimly, he is now on the same roof as his target. Mitchell arrives at the top of an empty tower. He leaps for a flight of steps that have recently been dislodged. Bond follows closely and fires as the double agent runs out of sight. Bond pulls on the bell ropes for support, then heads up to the belfry, gun raised and ready for action. Mitchell attacks from a perch outside the tower, catching Bond by surprise. Bond grabs his arm and strikes out with a powerful elbow. Both men fall through a glass roof and land on a scaffold beneath them. Bond's gun falls to the floor far below. Hanging by one hand, Bond tries to pull down the scaffolding beneath his adversary. Mitchell falls but manages to grab onto a rope. It swings, knocking over a pane of glass which shatters, sending vicious shards raining down. The rope gantry swings, and the crate of bricks falls from the other end. Bond also grabs a rope. The two men end up facing each other, dangling precariously on ropes at either end of the steel gantry. They trade blows and smash into a scaffold, which topples over, pulling on the rope and hauling them into the glass roof. Mitchell falls onto the scaffold. With his leg caught in a rope, Bond plummets but is stopped just before hitting the ground close to the gun."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "He abruptly changes direction, pivoting with determination as the underground chase becomes as intense and furious as the race taking place above ground. In the chaos, Mitchell crashes through some structural supports, causing the roof to start caving in on Bond, who is momentarily caught off guard. Meanwhile, the crowds above cheer enthusiastically, their excitement undiminished by the unfolding drama below. As Mitchell climbs a ladder to the surface, Bond picks himself up from the debris and continues his relentless pursuit. Fireworks explode in the sky, signifying that the race has a winner, and the track is quickly invaded by jubilant spectators. Amidst the tears and celebrations, Bond emerges from a manhole, scanning the throng for his target. Mitchell, determined to escape, barges his way through the crowd, with Bond following closely behind. In a desperate attempt to slow Bond down, Mitchell fires a shot, which tragically hits a woman, then scrambles over a barrier onto the racetrack. Bond, undeterred, sprints in pursuit, his focus unwavering. The chase leads them through a courtyard, then through a door and up a flight of stairs. As they ascend, Mitchell collides with an elderly woman who is lifting a crate of fruit on a rope, causing the crate to crash to the ground. Undeterred, Mitchell leaps across tiled rooftops, with Bond following relentlessly, never losing sight of his quarry. Mitchell takes a massive leap between buildings, while a concerned crowd clusters around the shot civilian below. As a round strikes nearby, Bond leaps after Mitchell, landing and sliding down the tiles before jumping again and landing heavily on a ledge. His quarry is now on a roof across from and above him. Bond jumps down onto a balcony, then leaps onto another, holding himself up on the metal railings before bursting into a room. He runs through the apartment, catching sight of Mitchell climbing onto another roof a short distance away. Without hesitation, Bond jumps from a window onto the roof of a bus, quickly getting to his feet and jumping from the vehicle onto another ledge, then shinning off a drainpipe. With his face set grimly, he finds himself on the same roof as his target. Mitchell arrives at the top of an empty tower and leaps for a flight of steps, dislodging them recently. Bond follows, firing his weapon as the double agent runs out of sight. Bond pulls on the bell ropes, then heads up to the belfry, his gun raised and ready for action. Mitchell attacks from a perch outside the tower, but Bond grabs his arm and strikes out with an elbow. Both men fall through a glass roof, landing on a scaffold beneath them. Bond's gun falls to the floor far below, out of reach. Hanging by one hand, Bond tries to pull down the scaffolding beneath his adversary. Mitchell falls but manages to grab onto a rope, which swings and knocks over a pane of glass, shattering it and sending vicious shards raining down. The rope gantry swings, causing a crate of bricks to fall from the other end. Bond also grabs a rope, and the two men end up facing each other, dangling on ropes at either end of the steel gantry. They trade blows, smashing into a scaffold that topples over, pulling on the rope and hauling them into the glass roof. Mitchell falls onto the scaffold, while Bond, with his leg caught in a rope, plummets but is stopped just before hitting the ground near the gun."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "The underground chase mirrors the intensity of the race above as Mitchell crashes through supports, causing the roof to cave in on Bond. Amidst the cheering crowds and fireworks signaling the race's end, Bond emerges from a manhole and pursues Mitchell, who fires and hits a woman before scrambling onto the racetrack. Bond follows through a courtyard, up stairs, and across rooftops, relentlessly pursuing Mitchell. As Mitchell leaps between buildings, Bond follows, landing heavily on a ledge. The chase continues as Bond jumps onto a bus roof, then onto a ledge, and climbs a drainpipe to reach the same roof as Mitchell. Mitchell reaches an empty tower and leaps for a flight of steps, with Bond in close pursuit. Bond pulls on bell ropes and heads to the belfry, where Mitchell attacks. They both fall through a glass roof onto a scaffold, with Bond's gun dropping far below. Hanging by one hand, Bond tries to destabilize the scaffolding, causing Mitchell to fall and grab a rope, which swings and shatters a pane of glass. Both men end up facing each other, dangling on ropes at either end of a steel gantry. They trade blows, smashing into a scaffold that topples and pulls them into the glass roof. Mitchell falls onto the scaffold, while Bond, with his leg caught in a rope, plummets but is stopped just before hitting the ground near the gun."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "He changes direction, adjusting his route like a practiced agent evading capture. The underground chase is as furious as the Palio di Siena, the historic horse race above attracting thousands of spectators each year. Mitchell, a cunning double agent, crashes through some supports. The roof starts to cave in on Bond, the renowned MI6 operative. The crowds cheer enthusiastically, swept up in the excitement of the centuries-old event. Mitchell's on a ladder to the surface as Bond picks himself up and keeps going with characteristic determination. Fireworks, a signature part of the race's celebratory conclusion, signify that the race has a winner. The track is invaded by jubilant onlookers. Amidst the tears and celebrations that follow such an event, Bond emerges from a manhole, his presence unnoticed by the exuberant fans. Mitchell barges his way through the throng, showing no regard for the festival’s festive spirit. Bond follows, undeterred. Mitchell fires towards Bond, hitting a woman, causing panic among the crowd, then scrambles over a barrier onto the racetrack. 007, whose code name has become synonymous with high-stakes pursuits, sprints in pursuit. The chase moves through a courtyard, then through a door and upstairs, typical of the labyrinthine ancient architecture. Mitchell barges into an elderly woman lifting a crate of fruit on a rope, a common sight in these historic markets. The crate crashes to the ground, scattering fruit everywhere. Mitchell leaps across tiled rooftops, his agility a testament to his training, with his pursuer following relentlessly. He takes a massive leap between buildings, a risky move in this tightly packed urban environment. Cluster around the shot civilian, onlookers attempt to assist, their concern apparent as a round strikes nearby. Bond leaps, a feat requiring both courage and skill. He lands, slides down the tiles, then jumps again, landing heavily on a ledge. His quarry is on a roof across from and above him, navigating the uneven terrain effortlessly. He jumps down onto a balcony, leaps onto another, and holds himself up on the metal railings, showing incredible upper body strength. He bursts into a room, runs through the apartment, and sees Mitchell climbing onto another roof a short distance away, his escape seemingly within reach. He jumps from a window onto the roof of a bus, which is part of a local transit system disrupted by the ongoing chase. He gets to his feet and jumps from the vehicle onto another ledge, then shins off a drainpipe, moving with a daring that matches his formidable reputation. Face set grimly, he's now on the same roof as his target, focused on apprehending the rogue agent. Mitchell arrives at the top of an empty tower, reminiscent of the medieval structures found throughout European cities. He leaps for a flight of steps dislodging recently, creating noise that echoes around the historical setting. Bond follows and fires as the double agent runs out of sight, driven to complete his mission. Bond pulls on the bell ropes of the ancient tower, creating a cacophony that reverberates through the air, then heads up to the belfry, gun up and ready, prepared for a confrontation. Mitchell attacks from a perch outside the tower, a position that gives him a temporary advantage. Bond grabs his arm and hits out with an elbow, executing a move well-practiced in combat training. Both fall through a glass roof and onto a scaffold beneath, an unexpected turn that complicates the already dangerous situation. Bond's gun falls to the floor far below, adding to the tension. Hanging by one hand, Bond tries to pull down the scaffolding beneath his adversary, using the environment to his advantage. Mitchell falls but grabs onto a rope, his life hanging literally by a thread. It swings, knocking over a pane of glass which shatters, sending vicious shards raining down in a perilous display. The rope gantry swings and the crate of bricks falls from the other end, a dramatic shift in the balance of the scene. Bond also grabs a rope, the only thing stopping him from plummeting to the ground. The two men end up facing each other, dangling on ropes at either end of the steel gantry, trading blows as they smash into a scaffold which topples over, pulling on the rope, hauling them into the glass roof in a final test of endurance. Mitchell falls onto the scaffold, his escape thwarted. Leg caught in a rope, Bond plummets, but is stopped just before hitting the ground near the gun, narrowly avoiding disaster."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "He changes direction  The underground chase is as furious as the race above  Mitchell crashes through some supports  The roof starts to cave in on Bond  The crowds cheer enthusiastically  Mitchell's on a ladder to the surface as Bond picks himself up and keeps going  Fireworks signify that the race has a winner  He lands slides down the tiles then jumps again landing heavily on a ledge  His quarry is on a roof across from and above him  He jumps down onto a balcony leaps onto another and holds himself up on the metal railings  He bursts into a room runs through the apartment and sees Mitchell climbing onto another roof a short distance away  He jumps from a window onto the roof of a bus  He gets to his feet and jumps from the vehicle onto another ledge then shins off a drainpipe  Face set grimly he's now on the same roof as his target  Mitchell arrives at the top of an empty tower  He leaps for a flight of steps dislodging recently  Bond follows and fires as the double agent runs out of sight  Bond pulls on the bell ropes then heads up to the belfry gun up and ready  Mitchell attacks from a perch outside the tower  Bond grabs his arm and hits out with an elbow  Both fall through a glass roof and onto a scaffold beneath  Bond's gun falls to the floor far below  Hanging by one hand Bond tries to pull down the scaffolding beneath his adversary  Mitchell falls but grabs onto a rope  It swings knocking over a pane of glass which shatters sending vicious shards raining down  The rope gantry swings and the crate of bricks falls from the other end  Bond also grabs a rope  The two men end up facing each other dangling on ropes at either end of the steel gantry  They trade blows and smash into a scaffold which topples over pulling on the rope hauling them into the glass roof  Mitchell falls onto the scaffold  The track is invaded  Amidst the tears and celebrations Bond emerges from a manhole  Mitchell barges his way through the throng  Bond follows  He fires towards Bond hitting a woman then scrambles over a barrier onto the racetrack  007 sprints in pursuit  The chase moves through a courtyard then through a door and upstairs  Mitchell barges into an elderly woman lifting a crate of fruit on a rope  The crate crashes to the ground  Mitchell leaps across tiled rooftops his pursuer following relentlessly  He takes a massive leap between buildings  Cluster around the shot civilian  A round strikes nearby as Bond leaps  He lands slides down the tiles then jumps again landing heavily on a ledge  His quarry is on a roof across from and above him  He jumps down onto a balcony leaps onto another and holds himself up on the metal railings  He bursts into a room runs through the apartment and sees Mitchell climbing onto another roof a short distance away  He jumps from a window onto the roof of a bus  He gets to his feet and jumps from the vehicle onto another ledge then shins off a drainpipe  Face set grimly he's now on the same roof as his target  Mitchell arrives at the top of an empty tower  He leaps for a flight of steps dislodging recently  Bond follows and fires as the double agent runs out of sight  Bond pulls on the bell ropes then heads up to the belfry gun up and ready  Mitchell attacks from a perch outside the tower  Bond grabs his arm and hits out with an elbow  Both fall through a glass roof and onto a scaffold beneath  Bond's gun falls to the floor far below  Hanging by one hand Bond tries to pull down the scaffolding beneath his adversary  Mitchell falls but grabs onto a rope  It swings knocking over a pane of glass which shatters sending vicious shards raining down  The rope gantry swings and the crate of bricks falls from the other end  Bond also grabs a rope  The two men end up facing each other dangling on ropes at either end of the steel gantry  They trade blows and smash into a scaffold which topples over pulling on the rope hauling them into the glass roof  Mitchell falls onto the scaffold  Leg caught in a rope  Bond plummets but is stopped just before hitting the ground near the gun"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "He changes direction. The underground chase is as furious as the race above. Mitchell crashes through some supports. The roof starts to cave in on Bond. The crowds cheer enthusiastically. Mitchell's on a ladder to the surface as Bond picks himself up and keeps going. Fireworks signify that the race has a winner. The track is invaded. Amidst the tears and celebrations Bond emerges from a manhole. Mitchell barges his way through the throng. Bond follows. He fires towards Bond hitting a woman then scrambles over a barrier onto the racetrack. 007 sprints in pursuit. The chase moves through a courtyard then through a door and upstairs. Mitchell barges into an elderly woman lifting a crate of fruit on a rope. The crate crashes to the ground. Mitchell leaps across tiled rooftops his pursuer following relentlessly. He takes a massive leap between buildings. Cluster around the shot. civilian. A round strikes nearby as Bond leaps. He lands slides down the tiles then jumps again landing heavily on a ledge. His quarry is on a roof across from and above him. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. He jumps down onto a balcony leaps onto another and holds himself up on the metal railings. He bursts into a room runs through the apartment and sees Mitchell climbing onto another roof a short distance away. He jumps from a window onto the roof of a bus. He gets to his feet and jumps from the vehicle onto another ledge then shins off a drainpipe. Face set grimly he is now on the same roof as his target. Mitchell arrives at the top of an empty tower. He leaps for a flight of steps dislodging recently. Bond follows and fires as the double agent runs out of sight. Bond pulls on the bell ropes then heads up to the belfry gun up and ready. Mitchell attacks from a perch outside the tower. Bond grabs his arm and hits out with an elbow. Both fall through a glass roof and onto a scaffold beneath. Bond's gun falls to the floor far below. Hanging by one hand Bond tries to pull down the scaffolding beneath his adversary. Mitchell falls but grabs onto a rope. It swings knocking over a pane of glass which shatters sending vicious shards raining down. The rope gantry swings and the crate of bricks falls from the other end. Bond also grabs a rope. The two men end up facing each other dangling on ropes at either end of the steel gantry. They trade blows and smash into a scaffold which topples over pulling on the rope hauling them into the glass roof. Mitchell falls onto the scaffold. Leg caught in a rope. Bond plummets but is stopped just before hitting the ground near the gun."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "He changes direction. The underground chase is as furious as the race above. Mitchell crashes through some supports. The roof starts to cave in on Bond. The crowds cheer enthusiastically. Mitchell's on a ladder to the surface as Bond picks himself up and keeps going. Fireworks signify that the race has a winner. The track is invaded. Amidst the tears and celebrations Bond emerges from a manhole. Mitchell barges his way through the throng. Bond follows. He fires towards Bond hitting a woman then scrambles over a barrier onto the racetrack. 007 sprints in pursuit. The chase moves through a courtyard then through a door and upstairs. Mitchell barges into an elderly woman lifting a crate of fruit on a rope. The crate crashes to the ground. Mitchell leaps across tiled rooftops his pursuer following relentlessly. He takes a massive leap between buildings. Cluster around the shot. civilian. A round strikes nearby as Bond leaps. He lands slides down the tiles then jumps again landing heavily on a ledge. His quarry is on a roof across from and above him. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. He jumps down onto a balcony leaps onto another and holds himself up on the metal railings. He bursts into a room runs through the apartment and sees Mitchell climbing onto another roof a short distance away. He jumps from a window onto the roof of a bus. He gets to his feet and jumps from the vehicle onto another ledge then shins off a drainpipe. Face set grimly he is now on the same roof as his target. Mitchell arrives at the top of an empty tower. He leaps for a flight of steps dislodging recently. Bond follows and fires as the double agent runs out of sight. Bond pulls on the bell ropes then heads up to the belfry gun up and ready. Mitchell attacks from a perch outside the tower. Bond grabs his arm and hits out with an elbow. Both fall through a glass roof and onto a scaffold beneath. Bond's gun falls to the floor far below. Hanging by one hand Bond tries to pull down the scaffolding beneath his adversary. Mitchell falls but grabs onto a rope. It swings knocking over a pane of glass which shatters sending vicious shards raining down. The rope gantry swings and the crate of bricks falls from the other end. Bond also grabs a rope. The two men end up facing each other dangling on ropes at either end of the steel gantry. They trade blows and smash into a scaffold which topples over pulling on the rope hauling them into the glass roof. Mitchell falls onto the scaffold. Leg caught in a rope. Bond plummets but is stopped just before hitting the ground near the gun."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "He changes direction. The underground chase is as furious as the race above. Mitchell crashes through some supports. The roof starts to cave in on Bond. The crowds cheer enthusiastically. Mitchell's on a ladder to the surface as Bond picks himself up and keeps going. Fireworks signify that the race has a winner. The track is invaded. Amidst the tears and celebrations Bond emerges from a manhole. Mitchell barges his way through the throng. Bond follows. He fires towards Bond hitting a woman then scrambles over a barrier onto the racetrack. Bond's gun falls to the floor far below. Hanging by one hand Bond tries to pull down the scaffolding beneath his adversary. Mitchell falls but grabs onto a rope. It swings knocking over a pane of glass which shatters sending vicious shards raining down. The rope gantry swings and the crate of bricks falls from the other end. Bond also grabs a rope. The two men end up facing each other dangling on ropes at either end of the steel gantry. They trade blows and smash into a scaffold which topples over pulling on the rope hauling them into the glass roof. Mitchell falls onto the scaffold. Leg caught in a rope. Bond plummets but is stopped just before hitting the ground near the gun."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "He changes direction. The underground chase is as furious as the race above. Mitchell crashes through some supports. The roof starts to cave in on Bond. The crowds cheer enthusiastically. The two men end up facing each other dangling on ropes at either end of the steel gantry. They trade blows and smash into a scaffold which topples over pulling on the rope hauling them into the glass roof. Mitchell falls onto the scaffold. Leg caught in a rope. Bond plummets but is stopped just before hitting the ground near the gun."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The squirrel changes direction. The underground chase is as furious as the race above. The elephant crashes through some supports. The roof starts to cave in on the pirate. The crowds cheer enthusiastically. The giraffe's on a ladder to the surface as the pirate picks himself up and keeps going. Fireworks signify that the race has a winner. The track is invaded. Amidst the tears and celebrations, the pirate emerges from a manhole. The giraffe barges his way through the throng. The pirate follows. The giraffe fires towards the pirate, hitting a woman, then scrambles over a barrier onto the racetrack. The rabbit sprints in pursuit. The chase moves through a courtyard, then through a door and upstairs. The giraffe barges into an elderly woman lifting a crate of fruit on a rope. The crate crashes to the ground. The giraffe leaps across tiled rooftops, his pursuer following relentlessly. The giraffe takes a massive leap between buildings. Cluster around the shot civilian. A round strikes nearby as the pirate leaps. The pirate lands, slides down the tiles, then jumps again, landing heavily on a ledge. His quarry is on a roof across from and above him. The pirate jumps down onto a balcony, leaps onto another, and holds himself up on the metal railings. The moose bursts into a room, runs through the apartment, and sees the giraffe climbing onto another roof a short distance away. The moose jumps from a window onto the roof of a bus. The moose gets to his feet and jumps from the vehicle onto another ledge, then shins off a drainpipe. Face set grimly, the moose is now on the same roof as his target. The giraffe arrives at the top of an empty tower. The giraffe leaps for a flight of steps dislodging recently. The moose follows and fires as the double agent runs out of sight. The moose pulls on the bell ropes, then heads up to the belfry, gun up and ready. The giraffe attacks from a perch outside the tower. The moose grabs his arm and hits out with an elbow. Both fall through a glass roof and onto a scaffold beneath. The moose's gun falls to the floor far below. Hanging by one hand, the moose tries to pull down the scaffolding beneath his adversary. The giraffe falls but grabs onto a rope. It swings, knocking over a pane of glass which shatters, sending vicious shards raining down. The rope gantry swings and the crate of bricks falls from the other end. The moose also grabs a rope. The two entities end up facing each other, dangling on ropes at either end of the steel gantry. They trade blows and smash into a scaffold which topples over, pulling on the rope, hauling them into the glass roof. The giraffe falls onto the scaffold. Leg caught in a rope, the moose plummets, but is stopped just before hitting the ground near the gun."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "He changes direction. The cavernous chase is as furious as the race above. Mitchell crashes through some columns. The ceiling starts to cave in on Bond. The spectators cheer enthusiastically. Mitchell's on a staircase to the surface as Bond picks himself up and keeps going. Lanterns signify that the race has a winner. The stage is invaded. Amidst the applause and celebrations, Bond emerges from a drainage pipe. Mitchell barges his way through the crowd. Bond follows. He fires towards Bond, hitting a man, then scrambles over a fence onto the track. 007 sprints in pursuit. The chase moves through an arcade, then through a gate and upstairs. Mitchell barges into an elderly man lifting a basket of vegetables on a pulley. The basket crashes to the ground. Mitchell leaps across thatched rooftops, his pursuer following relentlessly. He takes a massive leap between structures. Cluster around the struck civilian. A round strikes nearby as Bond leaps. He lands, slides down the tiles, then jumps again, landing heavily on a veranda. His quarry is on a roof across from and above him. He jumps down onto a terrace, leaps onto another, and holds himself up on the wooden railings. He bursts into a chamber, runs through the dwelling, and sees Mitchell climbing onto another roof a short distance away. He jumps from a window onto the roof of a tram. He gets to his feet and jumps from the vehicle onto another platform, then shins off a rain gutter. Face set grimly, he's now on the same roof as his target. Mitchell arrives at the top of an abandoned silo. He leaps for a flight of steps dislodging recently. Bond follows and fires as the double agent runs out of sight. Bond pulls on the bell chains, then heads up to the spire, gun up and ready. Mitchell attacks from a perch outside the silo. Bond grabs his arm and hits out with a knee. Both fall through a glass canopy and onto a rig beneath. Bond's gun falls to the floor far below. Hanging by one hand, Bond tries to pull down the rigging beneath his adversary. Mitchell falls but grabs onto a cable. It swings, knocking over a pane of glass which shatters, sending vicious shards raining down. The rope gantry swings and the sack of bricks falls from the other end. Bond also grabs a cable. The two men end up facing each other, dangling on cables at either end of the metal framework. They trade blows and smash into a rig which topples over, pulling on the cable, hauling them into the glass canopy. Mitchell falls onto the rig. Leg caught in a cable, Bond plummets, but is stopped just before hitting the ground near the gun."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "He reverses his course. The underground chase is as frantic as the race above. Mitchell slides through some supports. The roof begins to light up on Bond. The crowds boo enthusiastically. Mitchell's on a ladder to the surface as Bond dusts himself off and waits. Fireworks display that the race has a victor. The track is vacated. Amidst the laughter and celebrations, Bond surfaces from a manhole. Mitchell dances his way through the throng. Bond hesitates. He whistles towards Bond, startling a woman, then tiptoes over a barrier onto the racetrack. 007 strolls in pursuit. The chase meanders through a courtyard, then through a door and upstairs. Mitchell apologizes to an elderly woman lowering a crate of fruit on a rope. The crate floats to the ground. Mitchell slides across tiled rooftops, his pursuer trailing lazily. He takes a tiny hop between buildings. Gather around the shot civilian. A round splashes nearby as Bond skips. He lands, climbs up the tiles, then hops again, resting lightly on a ledge. His quarry is on a roof across from and above him. He climbs down onto a balcony, hops onto another, and lounges himself on the metal railings. He creeps into a room, ambles through the apartment, and sees Mitchell jumping onto another roof a short distance away. He steps from a window onto the roof of a bus. He kneels and rolls from the vehicle onto another ledge, then swings off a drainpipe. Smiling calmly, he's now on the same roof as his target. Mitchell reaches the top of an empty tower. He slides for a flight of steps assembling recently. Bond pauses and listens as the double agent stands out of sight. Bond skips on the bell ropes, then descends to the belfry, gun lowered and relaxed. Mitchell observes from a perch outside the tower. Bond taps his arm and hugs with an elbow. Both float through a glass roof and onto a scaffold beneath. Bond's gun lifts to the floor far below. Dangling by one leg, Bond tries to sway the scaffolding beneath his adversary. Mitchell swings but holds onto a rope. It swings, illuminating a pane of glass which spills, sending soft shards sprinkling down. The rope gantry swings and the crate of feathers descends from the other end. Bond also hugs a rope. The two men end up avoiding each other, dangling on ropes at either end of the steel gantry. They exchange pleasantries and bump into a scaffold which settles, releasing the rope, drawing them into the glass roof. Mitchell bounces onto the scaffold. Leg freed from a rope, Bond floats, but is stopped just before hovering to the ground near the gun."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "The mailbox shifts orientation. The subterranean pursuit is as intense as the competition below. The zebra barrels through some fences. The ceiling begins to collapse on the notebook. The cacti applaud enthusiastically. The zebra's on a bookshelf to the ocean as the notebook steadies itself and keeps advancing. Firecrackers indicate that the contest has a victor. The trail is overrun. Amidst the acorns and jubilation, the notebook emerges from a thimble. The zebra shoves its way through the procession. The notebook follows. It fires towards the notebook, hitting a sandwich, then scrambles over a ladder onto the airstrip. The cup dashes in pursuit. The pursuit progresses through an atrium, then through an archway and upstairs. The zebra collides into an ancient television lifting a jar of honey on a wire. The jar crashes to the sidewalk. The zebra vaults across mosaic shingles, its shadow trailing relentlessly. It takes a monumental leap between gardens. Group around the wounded celery. A sphere strikes nearby as the notebook catapults. It lands, slides down the shingles, then springs again, landing forcefully on a balcony. Its goal is on a chimney across from and above it. It descends onto a canopy, vaults onto another, and steadies itself on the wooden balustrades. It bursts into a cupboard, races through the dwelling, and sees the zebra climbing onto another awning a short distance away. It jumps from a skylight onto the roof of a carriage. It rises to its knees and jumps from the vehicle onto another cornice, then swings off a vine. Expression fixed sternly, it's now on the same awning as its prey. The zebra arrives at the pinnacle of an empty monument. It lunges for a stair rail, dislodging freshly. The notebook follows and fires as the triple musician runs out of view. The notebook tugs on the velvet ropes, then advances up to the tower, camera up and alert. The zebra strikes from a launch outside the monument. The notebook clutches its elbow and strikes out with a knee. Both plunge through a transparent roof and onto a platform beneath. The notebook's lens falls to the carpet far below. Dangling by one wrist, the notebook attempts to wrench down the trellis beneath its rival. The zebra descends but clutches onto a ribbon. It sways, toppling over a sheet of timber which splinters, sending sharp fragments raining down. The ribbon gantry swings, and the crate of marbles tumbles from the other end. The notebook also seizes a ribbon. The two envelopes end up confronting each other, swinging on ribbons at either extremity of the aluminum gantry. They exchange hits and crash into a structure which tips over, pulling on the ribbon, dragging them into the timber roof. The zebra drops onto the platform. Boot snagged in a ribbon, the notebook descends, but is halted just before colliding with the soil near the lens."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "She alters her path. The underwater pursuit is as intense as the game below. Thompson skids through some obstacles. The ceiling begins to collapse on Smith. The audience applauds warmly. Thompson is on a staircase to the surface as Smith dusts himself off and advances. Fireworks indicate that the competition has a champion. The field is invaded. Amidst the laughter and festivities, Smith appears from a tunnel. Thompson elbows his way through the mob. Smith shadowed. She aims towards Smith, striking a man, then scrambles over a fence onto the racetrack. 007 dashes in pursuit. The pursuit continues through a plaza, then through a gate and upstairs. Thompson collides with an elderly man lifting a basket of vegetables on a pulley. The basket smashes to the ground. Thompson vaults across shingled rooftops, her chaser trailing tirelessly. She takes an enormous leap between buildings. Gather around the injured civilian. A shot strikes nearby as Smith leaps. She lands, slides down the shingles, then jumps again, landing hard on a platform. Her target is on a roof across from and above her. She jumps down onto a porch, leaps onto another, and suspends herself from the metal bars. She bursts into a chamber, sprints through the flat, and sees Thompson climbing onto another roof a short distance away. She jumps from a window onto the top of a bus. She gets to her feet and jumps from the vehicle onto another platform, then slides down a gutter. Face set determinedly, she's now on the same roof as her target. Thompson reaches the top of an empty tower. She vaults for a set of stairs loosening. Smith shadows and aims as the double agent rushes out of view. Smith tugs on the bell strings, then heads up to the steeple, weapon poised and ready. Thompson strikes from a ledge outside the tower. Smith seizes her arm and strikes out with a knee. Both tumble through a glass ceiling and onto a scaffold beneath. Smith's weapon drops to the floor far below. Hanging by one hand, Smith tries to pull down the scaffolding beneath her rival. Thompson tumbles but grabs onto a cable. It swings, knocking over a piece of glass which shatters, sending dangerous fragments cascading down. The cable gantry swings and the box of bricks drops from the other end. Smith also grabs a cable. The two women end up facing each other, swinging on cables at either end of the steel gantry. They exchange punches and crash into a scaffold which collapses, tugging on the cable, drawing them into the glass ceiling. Thompson lands onto the scaffold. Leg trapped in a cable, Smith plummets, but is halted just before hitting the ground near the weapon."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "He alters his course. The subterranean escapade is as intense as the contest above. Mitchell careens into some barriers. The ceiling begins to collapse above Bond. The spectators applaud eagerly. Mitchell's on a staircase to the surface as Bond dusts himself off and continues. Lanterns indicate that the contest has ended. The path is swarmed. Amidst the cries and revelry, Bond appears from a trapdoor. Mitchell pushes his way through the crowd. Bond tails him. He aims toward Bond, striking a man, then vaults over a fence onto the parade route. 007 dashes after him. The pursuit weaves through an archway, then through a gate and upstairs. Mitchell collides with a young man hoisting a basket of flowers on a cord. The basket plummets to the earth. Mitchell bounds over clay rooftops, his pursuer trailing doggedly. He executes an enormous leap between structures. Cluster around the injured pedestrian. A round impacts nearby as Bond vaults. He lands, skids down the shingles, then springs again, alighting forcefully on a terrace. His target is on a roof across from and above him. He descends onto a ledge, bounds onto another, and hoists himself up on the iron bars. He bursts into a corridor, rushes through the flat, and spots Mitchell ascending onto another rooftop a short distance away. He jumps from a window onto the roof of a tram. He rises to his feet and leaps from the transport onto a terrace, then slides off a flagpole. Expression stern, he's now on the same roof as his quarry. Mitchell reaches the top of an abandoned turret. He jumps for a staircase detaching easily. Bond follows and aims as the rogue disappears from view. Bond tugs on the flag ropes, then heads up to the steeple, weapon raised and alert. Mitchell attacks from a landing outside the tower. Bond seizes his arm and strikes out with a knee. Both crash through a wooden roof and onto a platform beneath. Bond's weapon tumbles to the ground far below. Clinging with one hand, Bond attempts to dislodge the platform beneath his foe. Mitchell slips but manages to grab onto a wire. It swings, toppling a pane of wood which splinters, sending sharp splinters raining down. The wire pulley swings and the basket of tools falls from the opposite end. Bond also grabs a wire. The two men end up facing each other, dangling on wires at either end of the wooden pulley. They exchange strikes and slam into a platform which collapses, pulling on the wire, dragging them into the wooden roof. Mitchell lands onto the platform. Leg ensnared in a wire, Bond plunges, but is halted just short of hitting the ground near the weapon."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "She follows a donkey. The forest parade is as sleepy as the dance below. Sarah sails through some trees. The branch starts to grow over on Alex. The pigeons sing quietly. Sarah's on a bridge to the meadow as Alex dusts herself off and sits down. Balloons suggest that the dance has a judge. The path is deserted. Amidst the laughter and naps, Alex emerges from a tunnel. Sarah swims her way through the flood. Alex watches. She dances away from Alex, tripping a clown, then tiptoes over a fence into the marketplace. An owl glides in apathy. The waltz drifts into a library, then into a closet and downstairs. Sarah floats into an agile monkey balancing a box of flowers on a cable. The box bounces to the ocean. Sarah dives across wooden beaches, her observer floating listlessly. She makes a minor skip between fences. Gather around the painted clown. A stone skips nearby as Alex skips. She leaps, climbs down the trees, then skips again, landing carefully on a vine. Her companion is on a tree opposite and below her. She skips down onto a patio, bounds onto another, and displays herself holding the golden ropes. She slips into a waterfall, dances through the cave, and observes Sarah balancing onto another beach a long distance away. She hops from a gate onto the trunk of a car. She lands on her toes and skips from the machine onto another vine, then hops off a ladder. Eyes wide joyfully, she's now on the same hill as her friend. Sarah lands at the base of an occupied tower. She hops for a carpet of flowers singing endlessly. Alex watches and dances while the guide turns into light. Alex tugs on the noisy weeds, then moves down to the meadow, heart calm and tranquil. Sarah balances from a cliff within the tower. Alex holds her nose and falls out with a whisper. Both float into a bubble pond and onto a hammock beneath. Alex's hat flies into the sky far above. Swinging by one finger, Alex tries to hold up the hammock beneath her foe. Sarah floats but laughs onto a feather. It drifts, swinging onto a pillow which smothers, sending gentle feathers floating up. The hammock flips and the crate of feathers flies from the other end. Alex also grabs an umbrella. The two squirrels float around each other, dangling on vines at either end of the silken hammock. They trade ticks and glide into a meadow which swings up, releasing the vine, leading them into the bubble pond. Sarah floats onto the meadow. Toe caught in a vine, Alex drifts, but is held just before missing the lake near the hat."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Bond and Mitchell engage in an intense underground chase, crashing through supports and nearly causing the roof to collapse. As fireworks signify a race's end, Bond emerges from a manhole, continuing to pursue Mitchell. Amidst chaos, Mitchell fires, wounding a woman, and leaps onto a racetrack, with Bond in relentless pursuit. Their chase progresses through various locations, including rooftops and courtyards, with Bond narrowly avoiding danger. Finally, they reach an empty tower, where Mitchell leaps for stairs. Bond follows, firing as Mitchell vanishes. In the tower's belfry, Mitchell attacks from a perch, leading to both men crashing through a glass roof onto a scaffold. Bond loses his gun, and they trade blows while dangling on ropes. The scaffold topples, sending both into a glass roof, with Mitchell falling and Bond's leg caught in a rope, stopping him just before reaching the ground near his gun."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Bond plummets but is stopped just before hitting the ground near the gun Leg caught in a rope  Mitchell falls onto the scaffold  They trade blows and smash into a scaffold which topples over pulling on the rope hauling them into the glass roof  The two men end up facing each other dangling on ropes at either end of the steel gantry  Bond also grabs a rope  The rope gantry swings and the crate of bricks falls from the other end  It swings knocking over a pane of glass which shatters sending vicious shards raining down  Mitchell falls but grabs onto a rope  Hanging by one hand Bond tries to pull down the scaffolding beneath his adversary  Bond's gun falls to the floor far below  Both fall through a glass roof and onto a scaffold beneath  Bond grabs his arm and hits out with an elbow  Mitchell attacks from a perch outside the tower  Bond pulls on the bell ropes then heads up to the belfry gun up and ready  Bond follows and fires as the double agent runs out of sight  He leaps for a flight of steps dislodging recently  Mitchell arrives at the top of an empty tower  Face set grimly he's now on the same roof as his target  He gets to his feet and jumps from the vehicle onto another ledge then shins off a drainpipe  He jumps from a window onto the roof of a bus  He bursts into a room runs through the apartment and sees Mitchell climbing onto another roof a short distance away  He jumps down onto a balcony leaps onto another and holds himself up on the metal railings  His quarry is on a roof across from and above him  He lands slides down the tiles then jumps again landing heavily on a ledge  A round strikes nearby as Bond leaps  Cluster around the shot civilian  He takes a massive leap between buildings  Mitchell leaps across tiled rooftops his pursuer following relentlessly  The crate crashes to the ground  Mitchell barges into an elderly woman lifting a crate of fruit on a rope  The chase moves through a courtyard then through a door and upstairs  007 sprints in pursuit  He fires towards Bond hitting a woman then scrambles over a barrier onto the racetrack  Bond follows  Mitchell barges his way through the throng  Amidst the tears and celebrations Bond emerges from a manhole  The track is invaded  Fireworks signify that the race has a winner  Mitchell's on a ladder to the surface as Bond picks himself up and keeps going  The crowds cheer enthusiastically  The roof starts to cave in on Bond  Mitchell crashes through some supports  The underground chase is as furious as the race above  He changes direction "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "The crate crashes to the ground  He changes direction  The chase moves through a courtyard then through a door and upstairs  Bond also grabs a rope  Mitchell falls onto the scaffold  Mitchell arrives at the top of an empty tower  Face set grimly he's now on the same roof as his target  Both fall through a glass roof and onto a scaffold beneath  He gets to his feet and jumps from the vehicle onto another ledge then shins off a drainpipe  Bond pulls on the bell ropes then heads up to the belfry gun up and ready  Leg caught in a rope  He lands slides down the tiles then jumps again landing heavily on a ledge  They trade blows and smash into a scaffold which topples over pulling on the rope hauling them into the glass roof  Mitchell attacks from a perch outside the tower  Bond follows  Fireworks signify that the race has a winner  He takes a massive leap between buildings  A round strikes nearby as Bond leaps  Hanging by one hand Bond tries to pull down the scaffolding beneath his adversary  He fires towards Bond hitting a woman then scrambles over a barrier onto the racetrack  Mitchell barges into an elderly woman lifting a crate of fruit on a rope  Amidst the tears and celebrations Bond emerges from a manhole  Bond grabs his arm and hits out with an elbow  The roof starts to cave in on Bond  He leaps for a flight of steps dislodging recently  The two men end up facing each other dangling on ropes at either end of the steel gantry  Mitchell barges his way through the throng  Mitchell falls but grabs onto a rope  It swings knocking over a pane of glass which shatters sending vicious shards raining down  His quarry is on a roof across from and above him  The underground chase is as furious as the race above  The crowds cheer enthusiastically  007 sprints in pursuit  He bursts into a room runs through the apartment and sees Mitchell climbing onto another roof a short distance away  Cluster around the shot civilian  Mitchell's on a ladder to the surface as Bond picks himself up and keeps going  He jumps from a window onto the roof of a bus  The track is invaded  Bond's gun falls to the floor far below  Bond follows and fires as the double agent runs out of sight  Mitchell crashes through some supports  Mitchell leaps across tiled rooftops his pursuer following relentlessly  The rope gantry swings and the crate of bricks falls from the other end  Bond plummets but is stopped just before hitting the ground near the gun He jumps down onto a balcony leaps onto another and holds himself up on the metal railings "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "He bursts into a room runs through the apartment and sees Mitchell climbing onto another roof a short distance away  He jumps from a window onto the roof of a bus  He gets to his feet and jumps from the vehicle onto another ledge then shins off a drainpipe  Face set grimly he's now on the same roof as his target  Mitchell arrives at the top of an empty tower  He leaps for a flight of steps dislodging recently  Bond follows and fires as the double agent runs out of sight  Bond pulls on the bell ropes then heads up to the belfry gun up and ready  Mitchell attacks from a perch outside the tower  Bond grabs his arm and hits out with an elbow  Both fall through a glass roof and onto a scaffold beneath  Bond's gun falls to the floor far below  Hanging by one hand Bond tries to pull down the scaffolding beneath his adversary  Mitchell falls but grabs onto a rope  It swings knocking over a pane of glass which shatters sending vicious shards raining down  The rope gantry swings and the crate of bricks falls from the other end  Bond also grabs a rope  The two men end up facing each other dangling on ropes at either end of the steel gantry  They trade blows and smash into a scaffold which topples over pulling on the rope hauling them into the glass roof  Mitchell falls onto the scaffold  Leg caught in a rope  Bond plummets but is stopped just before hitting the ground near the gun He changes direction  The underground chase is as furious as the race above  Mitchell crashes through some supports  The roof starts to cave in on Bond  The crowds cheer enthusiastically  Mitchell's on a ladder to the surface as Bond picks himself up and keeps going  Fireworks signify that the race has a winner  The track is invaded  Amidst the tears and celebrations Bond emerges from a manhole  Mitchell barges his way through the throng  Bond follows  He fires towards Bond hitting a woman then scrambles over a barrier onto the racetrack  007 sprints in pursuit  The chase moves through a courtyard then through a door and upstairs  Mitchell barges into an elderly woman lifting a crate of fruit on a rope  The crate crashes to the ground  Mitchell leaps across tiled rooftops his pursuer following relentlessly  He takes a massive leap between buildings  Cluster around the shot civilian  A round strikes nearby as Bond leaps  He lands slides down the tiles then jumps again landing heavily on a ledge  His quarry is on a roof across from and above him  He jumps down onto a balcony leaps onto another and holds himself up on the metal railings "
        }
      ]
    }
  ]
}