{
  "ground_truth": "They cycle by a road as Joe looks down awkwardly. The old yellow Coupe pulls up and Louis gets out, with Joe and Alice watching him intensely. Louis walks over to them, removes his shades, and, with heavy sideburns, steps inside the house, then immediately comes back out. Alice follows Louis back into the house, leaving an awkward looking Joe standing on the veranda, but she comes back out to Joe, who looks surprised and steps towards her. Filming a scene, Martin shoots zombie Cary as Alice watches, with the wrecked train in the distance behind them. Joe takes the camera and sets it up to film the crash site in the distance while news crew helicopters hover in the air above the scene. The film makers look down at the destruction, and Joe looks down with a troubled expression. At the crash site, Air Force personnel are busy clearing up the cargo of strange white cubes, repacking them into crates, which are loaded onto military lorries. Joe's dad Jack is there with Air Force Colonel Nelec, who goes, leaving Jack unsatisfied as he looks around and sees men carefully making a plaster of Paris mold. Back at the police station, he talks to Sheriff Pruitt, who goes, leaving Jack looking nonplussed. The sheriff drives his car into a gas station and pulls up by the pumps. He goes into the shop and finds the clerk playing with a new Sony Walkman; Breen can't hear him, so the sheriff lobs a candy bar at him. The sheriff pays for his petrol and the candy bar, then goes back outside, fills his patrol car, and opens the candy bar. His attention is caught by some odd noises and he looks around, surprised, as a pack of dogs runs across the filling station forecourt. The sheriff's patrol car starts malfunctioning, prompting him to check it out. Hearing something move nearby, the sheriff goes to investigate, keeping a hand on his gun. He nearly leaps out of his skin as a dumpster flies past him, while in the shop, Breen is oblivious as his Walkman drowns out all the sound. Over his shoulder, the sheriff's car jolts violently. Suddenly, the lights flicker and Breen looks round, pulling his headphones off as he looks out of the window. The lights continue flickering as Breen, looking apprehensive, slowly makes his way outside to find the front of the sheriff's car smashed in by a violent impact. Breen walks around the wrecked patrol car, observing steam rising from its ruptured radiator, and picks the petrol pump's nozzle out of a large pool of gasoline on the ground. Hearing something behind him, he turns around and looks completely terrified.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "They bicycle by a street as Joe gazes down awkwardly. The aged yellow Coupe halts and Louis exits, with Joe and Alice observing him intensely. Louis strolls over to them, removes his sunglasses, and, with heavy sideburns, steps inside the dwelling, then promptly returns. Alice follows Louis back into the dwelling, leaving an awkward-looking Joe standing on the porch, but she returns to Joe, who appears surprised and steps towards her. Filming a sequence, Martin captures zombie Cary as Alice observes, with the wrecked train in the distance behind them. Joe takes the camera and positions it to film the crash site in the distance while news crew helicopters hover in the sky above the scene. The filmmakers gaze down at the devastation, and Joe gazes down with a troubled expression. At the crash location, Air Force personnel are occupied clearing up the cargo of peculiar white cubes, repacking them into crates, which are loaded onto military trucks. Joe's father Jack is there with Air Force Colonel Nelec, who departs, leaving Jack unsatisfied as he looks around and sees men carefully creating a plaster of Paris mold. Back at the police station, he converses with Sheriff Pruitt, who departs, leaving Jack looking nonplussed. The sheriff drives his vehicle into a gas station and halts by the pumps. He enters the shop and finds the clerk playing with a new Sony Walkman; Breen can't hear him, so the sheriff tosses a candy bar at him. The sheriff pays for his petrol and the candy bar, then exits, fills his patrol vehicle, and opens the candy bar. His attention is captured by some strange noises and he looks around, surprised, as a pack of dogs runs across the filling station forecourt. The sheriff's patrol vehicle starts malfunctioning, prompting him to inspect it. Hearing something move nearby, the sheriff goes to investigate, keeping a hand on his firearm. He nearly leaps out of his skin as a dumpster flies past him, while in the shop, Breen is oblivious as his Walkman drowns out all the sound. Over his shoulder, the sheriff's vehicle jolts violently. Suddenly, the lights flicker and Breen looks round, removing his headphones as he looks out of the window. The lights continue flickering as Breen, looking apprehensive, slowly makes his way outside to find the front of the sheriff's vehicle smashed in by a violent impact. Breen walks around the wrecked patrol vehicle, observing steam rising from its ruptured radiator, and picks the petrol pump's nozzle out of a large pool of gasoline on the ground. Hearing something behind him, he turns around and looks completely terrified."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "By a road, a cycle is done by them as Joe is looked down at awkwardly. Up pulls the old yellow Coupe, and out gets Louis, watched intensely by Joe and Alice. Over to them walks Louis, shades are removed by him, and, with heavy sideburns, inside the house he steps, then immediately back out he comes. Back into the house, Louis is followed by Alice, leaving an awkward-looking Joe standing on the veranda, but out to Joe she comes, surprising him as he steps towards her. A scene is filmed by Martin, shooting zombie Cary while Alice watches, with the wrecked train in the distance behind them. The camera is taken by Joe and set up to film the crash site in the distance while above the scene news crew helicopters hover in the air. Down at the destruction look the filmmakers, and with a troubled expression, Joe looks down. At the crash site, the Air Force personnel clear up the cargo of strange white cubes, repack them into crates, and load them onto military lorries. Jack, Joe’s dad, is there with Air Force Colonel Nelec, who leaves, leaving Jack unsatisfied as around he looks and sees men carefully making a plaster of Paris mold. At the police station, Jack speaks with Sheriff Pruitt, who leaves, leaving Jack looking nonplussed. Into a gas station, the sheriff drives his car and pulls up by the pumps. He enters the shop and finds the clerk, Breen, playing with a new Sony Walkman; Breen doesn't hear him, so a candy bar is lobbed at him by the sheriff. For his petrol and the candy bar, the sheriff pays, then outside he goes, fills his patrol car, and opens the candy bar. By some odd noises, his attention is caught, and around he looks, surprised, as a pack of dogs runs across the filling station forecourt. The sheriff's patrol car malfunctions, prompting a check by him. Hearing something moving nearby, he investigates, keeping a hand on his gun. Nearly out of his skin he leaps as a dumpster flies past, while Breen in the shop remains oblivious as his Walkman drowns out all sound. Over his shoulder, the sheriff's car jolts violently. Suddenly, the lights flicker and around Breen looks, pulling his headphones off as out of the window he looks. The lights continue flickering as, looking apprehensive, outside Breen slowly makes his way, finding the front of the sheriff's car smashed in by a violent impact. Around the wrecked patrol car Breen walks, observing steam rising from its ruptured radiator, and out of a large pool of gasoline on the ground, the petrol pump's nozzle is picked by him. Hearing something behind him, around he turns, looking completely terrified."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "They cycle by a road as Joe looks down awkwardly. The old yellow Coupe arrives, and Louis gets out, with Joe and Alice watching intently. Louis approaches, removes his shades, and, with heavy sideburns, enters the house, then quickly exits. Alice follows him inside, leaving Joe awkwardly on the veranda, but she returns, surprising Joe as he steps toward her. Filming a scene, Martin shoots zombie Cary with Alice watching, the wrecked train visible in the distance. Joe sets up the camera to film the crash site while news helicopters hover above. The filmmakers observe the destruction, and Joe looks troubled. At the crash site, Air Force personnel clear strange white cubes, repacking them into crates for military lorries. Joe's dad, Jack, is there with Colonel Nelec, who leaves, leaving Jack unsatisfied as he sees men making a plaster mold. At the police station, Jack talks to Sheriff Pruitt, who leaves, leaving Jack nonplussed. The sheriff drives to a gas station, enters the shop, and finds the clerk, Breen, using a new Sony Walkman. Unable to hear, Breen gets a candy bar thrown at him. The sheriff pays for petrol and the candy bar, fills his car, and opens the candy bar. Odd noises catch his attention as dogs run across the forecourt. The patrol car malfunctions, prompting the sheriff to investigate, hand on his gun. He jumps as a dumpster flies past, while Breen, oblivious, listens to his Walkman. The sheriff's car jolts violently, lights flicker, and Breen, apprehensive, removes his headphones and looks outside. The lights flicker as Breen cautiously exits to find the sheriff's car smashed by a violent impact. Breen inspects the wrecked car, steam rising from its radiator, and picks up the petrol nozzle from a gasoline pool. Hearing something, he turns, terrified."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Joe cycles awkwardly by the road as the old yellow Coupe arrives. Louis exits, watched by Joe and Alice, removes his shades, and enters the house, then returns. Alice follows him inside, leaving Joe on the veranda, but she soon returns, surprising Joe. Martin films zombie Cary with Alice watching, the wrecked train visible behind. Joe sets up the camera to film the crash site while news helicopters hover. At the site, Air Force personnel repack strange white cubes into crates for military lorries. Joe's dad Jack, with Colonel Nelec, is unsatisfied as he observes men making a plaster mold. At the police station, Jack talks to Sheriff Pruitt, who leaves, leaving Jack nonplussed. The sheriff drives to a gas station, finds clerk Breen with a Walkman, and throws a candy bar to get his attention. After paying, he fills his car and opens the candy bar. Hearing odd noises, he sees dogs running across the forecourt. His car malfunctions, prompting investigation. A dumpster flies past, startling him, while Breen, oblivious with his Walkman, notices flickering lights and removes his headphones. Outside, he finds the sheriff's car smashed, steam rising from the radiator, and a gasoline pool. Hearing something, he turns, terrified."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "As they cycle along the road, Joe glances downward with an awkward demeanor. Meanwhile, an old yellow Coupe comes to a stop, and Louis steps out, capturing the intense attention of both Joe and Alice. Louis strides over to them, removes his sunglasses, revealing his heavy sideburns, and enters the house. However, he quickly reemerges. Alice follows Louis back into the house, leaving Joe standing awkwardly on the veranda. She soon returns to Joe, who appears surprised and takes a step toward her. In the midst of filming a scene, Martin captures footage of zombie Cary while Alice observes, with the wrecked train looming in the background. Joe takes hold of the camera and positions it to capture the crash site in the distance, as news crew helicopters hover above the scene. The filmmakers gaze down at the destruction, and Joe's expression is troubled as he looks downward. At the crash site, Air Force personnel are diligently clearing away the cargo of peculiar white cubes, repacking them into crates, which are then loaded onto military lorries. Joe's father, Jack, is present alongside Air Force Colonel Nelec, who departs, leaving Jack feeling unsatisfied as he surveys the scene and notices men carefully crafting a plaster of Paris mold. Back at the police station, Jack converses with Sheriff Pruitt, who also departs, leaving Jack looking perplexed. The sheriff drives his car into a gas station and pulls up beside the pumps. He enters the shop and finds the clerk, Breen, engrossed in a new Sony Walkman, unable to hear him. In response, the sheriff tosses a candy bar at Breen. After paying for his petrol and the candy bar, the sheriff returns outside, fills his patrol car, and opens the candy bar. His attention is suddenly drawn to some peculiar noises, and he looks around in surprise as a pack of dogs dashes across the filling station forecourt. The sheriff's patrol car begins to malfunction, prompting him to investigate. Hearing a noise nearby, the sheriff cautiously moves to investigate, keeping a hand on his gun. He nearly jumps out of his skin as a dumpster flies past him, while inside the shop, Breen remains oblivious, his Walkman drowning out all sound. Over the sheriff's shoulder, his car jolts violently. Suddenly, the lights flicker, and Breen turns around, pulling off his headphones as he peers out the window. The lights continue to flicker as Breen, now looking apprehensive, slowly makes his way outside to discover the front of the sheriff's car smashed in by a violent impact. Breen walks around the wrecked patrol car, observing steam rising from its ruptured radiator, and retrieves the petrol pump's nozzle from a large pool of gasoline on the ground. Hearing something behind him, he turns around, his face a mask of terror."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "As they pedal their bicycles along the winding road, Joe glances downward with an awkward and somewhat uneasy demeanor. Meanwhile, an old, faded yellow Coupe comes to a halt nearby, and Louis steps out, capturing the intense and undivided attention of both Joe and Alice. With a confident stride, Louis approaches them, takes off his sunglasses, revealing his distinctive heavy sideburns, and then proceeds to enter the house. However, he quickly reemerges a moment later. Alice follows Louis back into the house, leaving Joe standing awkwardly and a bit uncertain on the veranda. She soon returns to Joe, who appears surprised and takes a tentative step toward her. In the midst of filming an intense scene, Martin is capturing footage of a zombie Cary while Alice observes with interest, with the wrecked train looming ominously in the background. Joe takes hold of the camera, adjusting its position carefully to capture the crash site in the distance, as news crew helicopters hover persistently above the scene. The filmmakers gaze downward at the destruction, and Joe's expression is troubled and contemplative as he looks down. At the crash site, Air Force personnel are fully engaged in diligently clearing away the cargo of peculiar white cubes. They repack these cubes into crates, which are then systematically loaded onto awaiting military lorries. Joe's father, Jack, is present, standing alongside Air Force Colonel Nelec, who soon departs, leaving Jack feeling unsatisfied and somewhat uneasy as he surveys the scene. He notices men carefully crafting a plaster of Paris mold. Back at the police station, Jack has a conversation with Sheriff Pruitt, who also departs, leaving Jack looking perplexed and thoughtful. The sheriff drives his car into a gas station and pulls up beside the fuel pumps. He enters the small shop and finds the clerk, Breen, completely engrossed in a new Sony Walkman, unable to hear anything around him. In response, the sheriff tosses a candy bar at Breen to get his attention. After paying for his petrol and the candy bar, the sheriff returns outside, where he fills his patrol car and opens the candy bar. His attention is suddenly captured by some peculiar and unexpected noises, and he looks around in surprise as a pack of dogs dashes across the filling station forecourt. The sheriff's patrol car unexpectedly begins to malfunction, prompting him to investigate. Hearing a noise nearby, the sheriff cautiously moves to investigate further, keeping a hand securely on his gun. He nearly jumps out of his skin as a dumpster flies past him, while inside the shop, Breen remains completely oblivious, his Walkman drowning out all other sounds. Over the sheriff's shoulder, his car jolts violently. Suddenly, the lights begin to flicker, and Breen turns around, pulling off his headphones as he peers out the window. The lights continue to flicker as Breen, now looking apprehensive and somewhat alarmed, slowly makes his way outside to discover the front of the sheriff's car smashed in by a violent impact. Breen walks around the wrecked patrol car, observing steam rising from its ruptured radiator, and retrieves the petrol pump's nozzle from a large, glistening pool of gasoline on the ground. Hearing something unsettling behind him, he turns around, his face a mask of terror and fear."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "As they cycle along the road, Joe glances downward with an awkward demeanor, his eyes momentarily avoiding the path ahead. Meanwhile, an old yellow Coupe comes to a halt nearby, and Louis steps out, drawing the focused attention of both Joe and Alice, who watch him with intense curiosity. Louis strides over to them, his presence marked by the removal of his shades, revealing his face framed by heavy sideburns. He then proceeds to enter the house, only to reemerge almost immediately. Alice, observing Louis's actions, decides to follow him back into the house, leaving Joe standing alone on the veranda, his expression tinged with awkwardness. However, Alice soon returns to Joe, who, caught off guard by her reappearance, takes a step toward her, his surprise evident. In another scene, Martin is in the midst of filming, capturing zombie Cary on camera as Alice stands by, watching intently, with the wrecked train looming in the background. Joe takes charge of the camera, carefully setting it up to capture the distant crash site, while news crew helicopters hover above, their presence a constant reminder of the unfolding events. The filmmakers cast their gaze downward, taking in the scene of destruction, and Joe's expression mirrors their concern, his face troubled by what he sees. At the crash site, Air Force personnel are diligently at work, clearing away the cargo of peculiar white cubes, methodically repacking them into crates that are then loaded onto military lorries. Joe's father, Jack, is present, engaged in conversation with Air Force Colonel Nelec, who departs, leaving Jack with a sense of dissatisfaction as he surveys the scene, noticing men meticulously crafting a plaster of Paris mold. Back at the police station, Jack engages in a discussion with Sheriff Pruitt, who eventually leaves, leaving Jack with a puzzled expression. The sheriff then drives his car to a gas station, pulling up beside the pumps. He enters the shop, where he finds the clerk, Breen, absorbed in the music from a new Sony Walkman, oblivious to the sheriff's presence. To get Breen's attention, the sheriff tosses a candy bar at him. After paying for his petrol and the candy bar, the sheriff returns outside, fills his patrol car, and unwraps the candy bar. His attention is suddenly drawn to some unusual noises, prompting him to look around in surprise as a pack of dogs dashes across the forecourt of the filling station. The sheriff's patrol car begins to malfunction, leading him to investigate the issue. As he hears something moving nearby, he cautiously approaches, keeping a hand on his gun for safety. He is startled when a dumpster unexpectedly flies past him, while inside the shop, Breen remains oblivious, his Walkman drowning out all external sounds. Over the sheriff's shoulder, his car jolts violently, causing the lights to flicker. Breen, noticing the flickering lights, removes his headphones and looks around, apprehensively making his way outside. There, he discovers the front of the sheriff's car has been smashed in by a violent impact. Breen circles the wrecked patrol car, observing the steam rising from its ruptured radiator, and retrieves the petrol pump's nozzle from a large pool of gasoline on the ground. Hearing a noise behind him, he turns around, his face a mask of terror as he confronts the unknown."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "They cycle by a road as Joe looks down awkwardly. An old yellow Coupe arrives, and Louis steps out, prompting Joe and Alice to watch him closely. Louis approaches them, removes his shades, and briefly enters the house before returning outside. Alice follows him inside, leaving Joe awkwardly on the veranda, but soon returns, surprising Joe as he steps toward her. Meanwhile, Martin films a scene with zombie Cary, with Alice observing and a wrecked train visible in the background. Joe takes the camera to capture the crash site, where news helicopters hover above. The filmmakers survey the destruction, and Joe appears troubled. At the crash site, Air Force personnel clear strange white cubes, repacking them into crates for military transport. Joe's dad, Jack, is there with Colonel Nelec, who departs, leaving Jack unsatisfied as he observes men making a plaster of Paris mold. Back at the police station, Jack discusses with Sheriff Pruitt, who leaves, leaving Jack looking puzzled. The sheriff drives to a gas station, enters the shop, and finds the clerk, Breen, absorbed in his new Sony Walkman. Unable to get Breen's attention, the sheriff throws a candy bar at him, pays for his petrol and the candy bar, and returns outside to fill his patrol car. As he opens the candy bar, he notices odd noises and sees a pack of dogs running across the forecourt. His patrol car malfunctions, prompting him to investigate with his hand on his gun. A dumpster suddenly flies past him, startling him, while Breen remains oblivious with his Walkman on. The sheriff's car jolts violently, causing the lights to flicker. Breen, noticing the flickering lights, removes his headphones and looks outside. He cautiously exits the shop to find the sheriff's car severely damaged. Breen inspects the wrecked car, observing steam from the radiator, and retrieves the petrol pump nozzle from a gasoline pool. Hearing a noise behind him, he turns around, terrified."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "They cycle by a road that winds through the outskirts of Lillian, Ohio, as Joe looks down awkwardly, perhaps feeling the weight of the recent events. The old yellow Coupe, a vintage vehicle reminiscent of 1930s designs, pulls up and Louis, known for his distinctive fashion sense, gets out, with Joe and Alice watching him intensely. Louis walks over to them, removes his shades, a nod to his usual cool demeanor, and, with heavy sideburns, steps inside the house, then immediately comes back out, suggesting urgency or hesitation. Alice follows Louis back into the house, leaving an awkward looking Joe standing on the veranda, which creaks slightly under his weight, but she comes back out to Joe, who looks surprised and steps towards her. Filming a scene for their amateur movie project inspired by classic horror films, Martin shoots zombie Cary as Alice watches, with the wrecked train, a relic from a recent mysterious accident, in the distance behind them. Joe takes the camera and sets it up to film the crash site in the distance while news crew helicopters, buzzing like mechanical bees, hover in the air above the scene. The filmmakers look down at the destruction, a grim testament to the chaos, and Joe looks down with a troubled expression, burdened by thoughts of what they might have witnessed. At the crash site, Air Force personnel, clad in their distinctive uniforms, are busy clearing up the cargo of strange white cubes, extraterrestrial in appearance, repacking them into crates, which are loaded onto military lorries, reflecting the high-security nature of the operation. Joe's dad Jack is there with Air Force Colonel Nelec, whose authoritative presence suggests a man accustomed to secrecy, who goes, leaving Jack unsatisfied as he looks around and sees men carefully making a plaster of Paris mold, possibly for investigating unknown biological materials. Back at the police station, he talks to Sheriff Pruitt, who goes, leaving Jack looking nonplussed, as if aware that there is more occurring than meets the eye. The sheriff drives his car into a gas station, a local stop-off known for its eccentric attendant, and pulls up by the pumps. He goes into the shop and finds the clerk playing with a new Sony Walkman, a cutting-edge gadget in 1979; Breen can't hear him, so the sheriff lobs a candy bar at him. The sheriff pays for his petrol and the candy bar, then goes back outside, fills his patrol car, and opens the candy bar, an impulse snack purchase. His attention is caught by some odd noises and he looks around, surprised, as a pack of dogs runs across the filling station forecourt, possibly spooked by something unseen. The sheriff's patrol car starts malfunctioning, possibly due to electromagnetic interference, prompting him to check it out. Hearing something move nearby, the sheriff goes to investigate, keeping a hand on his gun, a testament to his cautious nature. He nearly leaps out of his skin as a dumpster flies past him, an impossible feat in normal circumstances, while in the shop, Breen is oblivious as his Walkman, now a bestseller, drowns out all the sound. Over his shoulder, the sheriff's car jolts violently, as though hit by a powerful unseen force. Suddenly, the lights flicker, a common effect of electrical disturbances, and Breen looks round, pulling his headphones off as he looks out of the window. The lights continue flickering as Breen, looking apprehensive, slowly makes his way outside to find the front of the sheriff's car smashed in by a violent impact, resembling a scene from a disaster film. Breen walks around the wrecked patrol car, observing steam rising from its ruptured radiator, a sign of severe mechanical distress, and picks the petrol pump's nozzle out of a large pool of gasoline on the ground, a hazardous spill. Hearing something behind him, he turns around and looks completely terrified, as though he might glimpse a glimpse of the unknown."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "They cycle by a road as Joe looks down awkwardly  The old yellow Coupe pulls up and Louis gets out with Joe and Alice watching him intensely  Louis walks over to them removes his shades and with heavy sideburns steps inside the house then immediately comes back out  The sheriff drives his car into a gas station and pulls up by the pumps  He goes into the shop and finds the clerk playing with a new Sony Walkman  Breen can't hear him so the sheriff lobs a candy bar at him  The sheriff pays for his petrol and the candy bar then goes back outside fills his patrol car and opens the candy bar  His attention is caught by some odd noises and he looks around surprised as a pack of dogs runs across the filling station forecourt  The sheriff's patrol car starts malfunctioning prompting him to check it out  Hearing something move nearby the sheriff goes to investigate keeping a hand on his gun  He nearly leaps out of his skin as a dumpster flies past him  while in the shop  Breen is oblivious as his Walkman drowns out all the sound  Over his shoulder the sheriff's car jolts violently  Suddenly the lights flicker and Breen looks round pulling his headphones off as he looks out of the window  The lights continue flickering as Breen looking apprehensive slowly makes his way outside to find the front of the sheriff's car smashed in by a violent impact  Alice follows Louis back into the house leaving an awkward looking Joe standing on the veranda but she comes back out to Joe who looks surprised and steps towards her  Filming a scene Martin shoots zombie Cary as Alice watches with the wrecked train in the distance behind them  Joe takes the camera and sets it up to film the crash site in the distance while news crew helicopters hover in the air above the scene  The film makers look down at the destruction and Joe looks down with a troubled expression  At the crash site Air Force personnel are busy clearing up the cargo of strange white cubes repacking them into crates which are loaded onto military lorries  Joe's dad Jack is there with Air Force Colonel Nelec who goes leaving Jack unsatisfied as he looks around and sees men carefully making a plaster of Paris mold  Back at the police station he talks to Sheriff Pruitt who goes leaving Jack looking nonplussed  The sheriff drives his car into a gas station and pulls up by the pumps  He goes into the shop and finds the clerk playing with a new Sony Walkman  Breen can't hear him so the sheriff lobs a candy bar at him  The sheriff pays for his petrol and the candy bar then goes back outside fills his patrol car and opens the candy bar  His attention is caught by some odd noises and he looks around surprised as a pack of dogs runs across the filling station forecourt  The sheriff's patrol car starts malfunctioning prompting him to check it out  Hearing something move nearby the sheriff goes to investigate keeping a hand on his gun  He nearly leaps out of his skin as a dumpster flies past him  while in the shop  Breen is oblivious as his Walkman drowns out all the sound  Over his shoulder the sheriff's car jolts violently  Suddenly the lights flicker and Breen looks round pulling his headphones off as he looks out of the window  The lights continue flickering as Breen looking apprehensive slowly makes his way outside to find the front of the sheriff's car smashed in by a violent impact  Breen walks around the wrecked patrol car observing steam rising from its ruptured radiator and picks the petrol pump's nozzle out of a large pool of gasoline on the ground  Hearing something behind him he turns around and looks completely terrified"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "They cycle by a road as Joe looks down awkwardly. The old yellow Coupe pulls up and Louis gets out with Joe and Alice watching him intensely. Louis walks over to them removes his shades and with heavy sideburns steps inside the house then immediately comes back out. Alice follows Louis back into the house leaving an awkward looking Joe standing on the veranda but she comes back out to Joe who looks surprised and steps towards her. Filming a scene Martin shoots zombie Cary as Alice watches with the wrecked train in the distance behind them. Joe takes the camera and sets it up to film the crash site in the distance while news crew helicopters hover in the air above the scene. The film makers look down at the destruction and Joe looks down with a troubled expression. At the crash site Air Force personnel are busy clearing up the cargo of strange white cubes repacking them into crates which are loaded onto military lorries. Joe's dad Jack is there with Air Force Colonel Nelec who goes leaving Jack unsatisfied as he looks around and sees men carefully making a plaster of Paris mold. Back at the police station he talks to Sheriff Pruitt who goes leaving Jack looking nonplussed. The sheriff drives his car into a gas station and pulls up by the pumps. He goes into the shop and finds the clerk playing with a new Sony Walkman. Breen cannot hear him so the sheriff lobs a candy bar at him. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. The sheriff pays for his petrol and the candy bar then goes back outside fills his patrol car and opens the candy bar. His attention is caught by some odd noises and he looks around surprised as a pack of dogs runs across the filling station forecourt. The sheriff's patrol car starts malfunctioning prompting him to check it out. Hearing something move nearby the sheriff goes to investigate keeping a hand on his gun. He nearly leaps out of his skin as a dumpster flies past him. while in the shop. Breen is oblivious as his Walkman drowns out all the sound. Over his shoulder the sheriff's car jolts violently. Suddenly the lights flicker and Breen looks round pulling his headphones off as he looks out of the window. The lights continue flickering as Breen looking apprehensive slowly makes his way outside to find the front of the sheriff's car smashed in by a violent impact. Breen walks around the wrecked patrol car observing steam rising from its ruptured radiator and picks the petrol pump's nozzle out of a large pool of gasoline on the ground. Hearing something behind him. he turns around and looks completely terrified."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "They cycle by a road as Joe looks down awkwardly. The old yellow Coupe pulls up and Louis gets out with Joe and Alice watching him intensely. Louis walks over to them removes his shades and with heavy sideburns steps inside the house then immediately comes back out. Alice follows Louis back into the house leaving an awkward looking Joe standing on the veranda but she comes back out to Joe who looks surprised and steps towards her. Filming a scene Martin shoots zombie Cary as Alice watches with the wrecked train in the distance behind them. Joe takes the camera and sets it up to film the crash site in the distance while news crew helicopters hover in the air above the scene. The film makers look down at the destruction and Joe looks down with a troubled expression. At the crash site Air Force personnel are busy clearing up the cargo of strange white cubes repacking them into crates which are loaded onto military lorries. Joe's dad Jack is there with Air Force Colonel Nelec who goes leaving Jack unsatisfied as he looks around and sees men carefully making a plaster of Paris mold. Back at the police station he talks to Sheriff Pruitt who goes leaving Jack looking nonplussed. The sheriff drives his car into a gas station and pulls up by the pumps. He goes into the shop and finds the clerk playing with a new Sony Walkman. Breen cannot hear him so the sheriff lobs a candy bar at him. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. The sheriff pays for his petrol and the candy bar then goes back outside fills his patrol car and opens the candy bar. His attention is caught by some odd noises and he looks around surprised as a pack of dogs runs across the filling station forecourt. The sheriff's patrol car starts malfunctioning prompting him to check it out. Hearing something move nearby the sheriff goes to investigate keeping a hand on his gun. He nearly leaps out of his skin as a dumpster flies past him. while in the shop. Breen is oblivious as his Walkman drowns out all the sound. Over his shoulder the sheriff's car jolts violently. Suddenly the lights flicker and Breen looks round pulling his headphones off as he looks out of the window. The lights continue flickering as Breen looking apprehensive slowly makes his way outside to find the front of the sheriff's car smashed in by a violent impact. Breen walks around the wrecked patrol car observing steam rising from its ruptured radiator and picks the petrol pump's nozzle out of a large pool of gasoline on the ground. Hearing something behind him. he turns around and looks completely terrified."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "They cycle by a road as Joe looks down awkwardly. The old yellow Coupe pulls up and Louis gets out with Joe and Alice watching him intensely. Louis walks over to them removes his shades and with heavy sideburns steps inside the house then immediately comes back out. Alice follows Louis back into the house leaving an awkward looking Joe standing on the veranda but she comes back out to Joe who looks surprised and steps towards her. Filming a scene Martin shoots zombie Cary as Alice watches with the wrecked train in the distance behind them. Joe takes the camera and sets it up to film the crash site in the distance while news crew helicopters hover in the air above the scene. The film makers look down at the destruction and Joe looks down with a troubled expression. Over his shoulder the sheriff's car jolts violently. Suddenly the lights flicker and Breen looks round pulling his headphones off as he looks out of the window. The lights continue flickering as Breen looking apprehensive slowly makes his way outside to find the front of the sheriff's car smashed in by a violent impact. Breen walks around the wrecked patrol car observing steam rising from its ruptured radiator and picks the petrol pump's nozzle out of a large pool of gasoline on the ground. Hearing something behind him. he turns around and looks completely terrified."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "They cycle by a road as Joe looks down awkwardly. The old yellow Coupe pulls up and Louis gets out with Joe and Alice watching him intensely. Louis walks over to them removes his shades and with heavy sideburns steps inside the house then immediately comes back out. Breen walks around the wrecked patrol car observing steam rising from its ruptured radiator and picks the petrol pump's nozzle out of a large pool of gasoline on the ground. Hearing something behind him. he turns around and looks completely terrified."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "They cycle by a road as a giraffe looks down awkwardly. The old yellow Coupe pulls up and a penguin gets out, with a giraffe and a fox watching him intensely. The penguin walks over to them, removes his shades, and, with heavy sideburns, steps inside the house, then immediately comes back out. The fox follows the penguin back into the house, leaving an awkward looking giraffe standing on the veranda, but the fox comes back out to the giraffe, who looks surprised and steps towards her. Filming a scene, a squirrel shoots zombie Cary as the fox watches, with the wrecked train in the distance behind them. The giraffe takes the camera and sets it up to film the crash site in the distance while news crew helicopters hover in the air above the scene. The film makers look down at the destruction, and the giraffe looks down with a troubled expression. At the crash site, dolphins are busy clearing up the cargo of strange white cubes, repacking them into crates, which are loaded onto military lorries. The giraffe's dad is there with Air Force Colonel Nelec, who goes, leaving the dad unsatisfied as he looks around and sees squirrels carefully making a plaster of Paris mold. Back at the police station, he talks to a bear, who goes, leaving the dad looking nonplussed. The bear drives his car into a gas station and pulls up by the pumps. He goes into the shop and finds the clerk playing with a new Sony Walkman; the clerk can't hear him, so the bear lobs a candy bar at him. The bear pays for his petrol and the candy bar, then goes back outside, fills his patrol car, and opens the candy bar. His attention is caught by some odd noises and he looks around, surprised, as a pack of cats runs across the filling station forecourt. The bear's patrol car starts malfunctioning, prompting him to check it out. Hearing something move nearby, the bear goes to investigate, keeping a hand on his gun. He nearly leaps out of his skin as a dumpster flies past him, while in the shop, the clerk is oblivious as his Walkman drowns out all the sound. Over his shoulder, the bear's car jolts violently. Suddenly, the lights flicker and the clerk looks round, pulling his headphones off as he looks out of the window. The lights continue flickering as the clerk, looking apprehensive, slowly makes his way outside to find the front of the bear's car smashed in by a violent impact. The clerk walks around the wrecked patrol car, observing steam rising from its ruptured radiator, and picks the petrol pump's nozzle out of a large pool of gasoline on the ground. Hearing something behind him, he turns around and looks completely terrified."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "They cycle by a trail as Joe looks down awkwardly. The old yellow skateboard pulls up and Louis gets out, with Joe and Alice watching him intensely. Louis walks over to them, removes his cap, and, with heavy earmuffs, steps inside the barn, then immediately comes back out. Alice follows Louis back into the barn, leaving an awkward looking Joe standing on the patio, but she comes back out to Joe, who looks surprised and steps towards her. Filming a scene, Martin shoots zombie Cary as Alice watches, with the collapsed bridge in the distance behind them. Joe takes the telescope and sets it up to film the crash site in the distance while news crew drones hover in the air above the scene. The film makers look down at the destruction, and Joe looks down with a troubled expression. At the crash site, Air Force personnel are busy clearing up the cargo of strange white barrels, repacking them into cartons, which are loaded onto military tractors. Joe's dad Jack is there with Air Force Colonel Nelec, who goes, leaving Jack unsatisfied as he looks around and sees men carefully making a plaster of Paris statue. Back at the fire station, he talks to Sheriff Pruitt, who goes, leaving Jack looking nonplussed. The sheriff drives his motorcycle into a cafe and pulls up by the tables. He goes into the store and finds the clerk playing with a new Sony camera; Breen can't hear him, so the sheriff lobs a magazine at him. The sheriff pays for his milkshake and the magazine, then goes back outside, fills his patrol motorcycle, and opens the magazine. His attention is caught by some odd noises and he looks around, surprised, as a pack of squirrels runs across the garden center forecourt. The sheriff's patrol motorcycle starts malfunctioning, prompting him to check it out. Hearing something move nearby, the sheriff goes to investigate, keeping a hand on his flashlight. He nearly leaps out of his skin as a refrigerator flies past him, while in the store, Breen is oblivious as his camera drowns out all the sound. Over his shoulder, the sheriff's motorcycle jolts violently. Suddenly, the lights flicker and Breen looks round, pulling his headphones off as he looks out of the window. The lights continue flickering as Breen, looking apprehensive, slowly makes his way outside to find the front of the sheriff's motorcycle smashed in by a violent impact. Breen walks around the wrecked patrol motorcycle, observing steam rising from its ruptured engine, and picks the milkshake's straw out of a large pool of coffee on the ground. Hearing something behind him, he turns around and looks completely terrified."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "They stroll by a road as Joe glances up nervously. The old yellow Coupe comes to a stop and Louis exits, with Joe and Alice observing him attentively. Louis strides over to them, adjusts his cap, and, with impressive sideburns, steps outside the house, then immediately heads back in. Alice trails Louis out of the house, leaving a puzzled-looking Joe standing on the veranda, but she returns to Joe, who appears startled and shuffles towards her. Filming a scene, Martin captures zombie Cary as Alice observes, with the broken train in the distance behind them. Joe grabs the camera and places it to document the crash site in the distance while news crew helicopters whirl in the air above the scene. The film makers gaze at the destruction, and Joe stares down with a concerned expression. At the crash site, Air Force personnel are absorbed in cataloguing the cargo of strange white cubes, organizing them into crates, which are driven onto military lorries. Joe's dad Jack is there with Air Force Colonel Nelec, who departs, leaving Jack unsatisfied as he glances around and notices men carefully crafting a ceramic mold. Back at the police station, he converses with Sheriff Pruitt, who departs, leaving Jack looking puzzled. The sheriff maneuvers his car into a gas station and halts by the pumps. He enters the shop and spots the clerk experimenting with a new Sony Walkman; Breen doesn't notice him, so the sheriff tosses a candy bar at him. The sheriff settles up for his beverage and the candy bar, then exits, refuels his patrol car, and unwraps the candy bar. His attention is captured by some peculiar sounds and he glances around, astonished, as a group of cats sprints across the filling station forecourt. The sheriff’s patrol car ceases functioning, compelling him to inspect it. Hearing something shift nearby, the sheriff proceeds to explore, maintaining a hand on his flashlight. He nearly loses his composure as a shopping cart rolls past him, while in the shop, Breen remains unaware as his Walkman mutes all sound. Beyond his shoulder, the sheriff's car bucks violently. Suddenly, the lights dim and Breen glances around, removing his headphones as he peers out of the window. The lights continue fading as Breen, looking anxious, cautiously moves outside to find the front of the sheriff's car mangled by a significant collision. Breen ambles around the damaged patrol car, noticing vapor rising from its punctured radiator, and lifts the petrol pump's handle out of a large puddle of gasoline on the ground. Hearing something behind him, he pivots and appears utterly terrified."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "The dolphins glide by a boulevard as Sarah looks down awkwardly. The ancient blue Bicycle rolls up and Robert gets out, with Sarah and Emily watching him intensely. Robert strolls over to them, removes his hat, and, with heavy eyebrows, steps inside the cabin, then immediately comes back out. Emily trails Robert back into the cabin, leaving an awkward looking Sarah standing on the porch, but she comes back out to Sarah, who looks surprised and steps towards her. Filming a scene, Oliver shoots robot George as Emily watches, with the shattered submarine in the distance behind them. Sarah takes the microphone and sets it up to film the crash site in the distance while news crew blimps hover in the air above the scene. The explorers look down at the wreckage, and Sarah looks down with a troubled expression. At the crash site, Navy personnel are busy clearing up the cargo of strange orange pyramids, repacking them into bags, which are loaded onto military carts. Sarah’s uncle Mike is there with Navy Captain Adams, who goes, leaving Mike unsatisfied as he looks around and sees workers carefully making a clay model. Back at the fire station, he talks to Chief Gardner, who goes, leaving Mike looking nonplussed. The chief drives his bicycle into a repair station and pulls up by the hoses. He goes into the cafe and finds the cashier playing with a new Panasonic boombox; Riley can't hear him, so the chief lobs a donut at him. The chief pays for his tea and the donut, then goes back outside, fills his bike, and opens the donut. His attention is caught by some odd noises and he looks around, surprised, as a pack of cats runs across the repair station forecourt. The chief's bike starts malfunctioning, prompting him to check it out. Hearing something move nearby, the chief goes to investigate, keeping a hand on his radio. He nearly leaps out of his skin as a barrel rolls past him, while in the cafe, Riley is oblivious as his boombox drowns out all the sound. Over his shoulder, the chief's bicycle jolts violently. Suddenly, the lights flicker and Riley looks round, pulling his earphones off as he looks out of the door. The lights continue flickering as Riley, looking apprehensive, slowly makes his way outside to find the front of the chief's bicycle smashed in by a violent impact. Riley walks around the broken bike, observing smoke rising from its damaged bumper, and picks the water hose’s nozzle out of a large puddle of milk on the ground. Hearing something behind him, he turns around and looks completely terrified."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "They drift by a river as Max gazes up curiously. The ancient red Sedan accelerates and Steve hops in, with Max and Emma observing him casually. Steve glides over to them, puts on his hat, and, with bushy eyebrows, rolls inside the garage, then promptly strolls back out. Emma trails Steve back into the garage, leaving a confused Max lingering on the balcony, but she returns to Max, who looks startled and sidles towards her. Recording a sequence, Oliver sketches ghost Brian as Emma observes, with the dilapidated bridge in the distance behind them. Max grips the microphone and arranges it to capture the wreckage in the distance while rescue team drones soar in the sky above the scene. The directors gaze up at the chaos, and Max gazes up with a pensive expression. At the wreckage site, Navy personnel are occupied sorting the shipment of bizarre black spheres, loading them into trucks, which are driven onto civilian trailers. Max's uncle Dave is there with Navy Admiral Carter, who departs, leaving Dave displeased as he gazes around and notices women carefully crafting a clay sculpture. Back at the fire station, he murmurs to Chief Williams, who departs, leaving Dave looking bewildered. The chief pedals his bike into a garage and coasts up to the chargers. He strides into the store and discovers the cashier fiddling with a shiny Game Boy; Mason can't see him, so the chief tosses a magazine at him. The chief pays for his diesel and the magazine, then strolls back outside, charges his bike, and unwraps the magazine. His concentration is captured by some mysterious sights and he glances around, bewildered, as a flock of birds flutters over the parking lot tarmac. The chief's bike begins malfunctioning, prompting him to examine it. Listening to something shuffle nearby, the chief rushes to inspect, keeping a finger on his whistle. He nearly collapses as a wheelbarrow glides past him, while in the store, Mason is indifferent as his Game Boy absorbs all his attention. Over his shoulder, the chief's bike rattles violently. Abruptly, the lights dim and Mason peers around, sliding his earbuds off as he peeks out of the door. The lights persist dimming as Mason, looking nervous, gingerly advances outside to discover the side of the chief's bike crushed in by a fierce collision. Mason ambles around the smashed bike, observing smoke rising from its punctured tire, and lifts the water hose's nozzle out of a vast puddle of oil on the pavement. Hearing a noise behind him, he pivots and looks completely horrified."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "They float down a river as Joe glances up shyly. The old yellow bicycle skids to a stop and Louis hops off, with Joe and Alice observing him curiously. Louis saunters over to them, takes off his cap, and, with thick glasses, marches into the garage, then promptly returns outside. Alice trails Louis back into the garage, leaving an uneasy looking Joe standing on the patio, but she returns to Joe, who looks startled and strides towards her. Recording a scene, Martin snaps a zombie Cary as Alice observes, with the overturned boat in the distance behind them. Joe grabs the telescope and positions it to film the floating debris in the distance while news crew hot air balloons drift in the sky above. The film makers glance up at the chaos, and Joe gazes up with a confused expression. At the wreckage site, Air Force personnel are busy collecting the bundles of peculiar blue spheres, packaging them into baskets, which are hoisted onto military trucks. Joe's dad Jack is there with Air Force Colonel Nelec, who departs, leaving Jack dissatisfied as he glances around and notices men meticulously creating a clay sculpture. Back at the library, he converses with Librarian Pruitt, who departs, leaving Jack looking bewildered. The librarian rides his bicycle into a coffee shop and parks by the kiosks. He strolls into the bistro and notices the server tinkering with an old cassette player; Breen doesn't notice him, so the librarian tosses a brochure at him. The librarian pays for his tea and the brochure, then heads back outside, sips his drink, and unwraps the brochure. His focus is drawn by some strange echoes and he glances around, startled, as a flock of birds flies across the parking lot. The librarian's bicycle starts wobbling, prompting him to inspect it. Hearing something shift nearby, the librarian proceeds to explore, keeping a hand on his flashlight. He nearly stumbles backward as a cart rolls past him, while in the bistro, Breen remains unaware as his cassette player muffles all noise. Behind him, the librarian's bicycle wobbles fiercely. Abruptly, the lamps blink and Breen turns around, removing his earphones as he peers out of the doorway. The lamps continue blinking as Breen, looking uneasy, slowly steps outside to discover the front of the librarian's bicycle bent by a heavy blow. Breen circles the damaged bicycle, observing steam rising from its dented frame, and plucks the bicycle lock out of a large puddle of water on the floor. Hearing something behind him, he pivots around and appears utterly horrified."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "They float over a river as Max gazes up cheerfully. The shiny green Motorcycle zooms in and Clara leaps up, with Max and Emma staring at her indifferently. Clara skips over to them, dons her hat, and, with long braids, dances into the garden, then quickly pirouettes back out. Emma trails Clara back into the garden, leaving a cheerful-looking Max lounging on the terrace, but she pirouettes back out to Max, who looks amused and jumps away from her. Painting a portrait, Oliver sketches alien Ralph as Emma observes, with the tumbled tower in the background behind them. Max snatches the sketchbook and positions it to capture the ruin in the background while media drones drift beneath the sky above the area. The illustrators peer up at the chaos, and Max peers up with a joyous demeanor. At the ruin's edge, Navy officers are busy stacking up the load of peculiar black globes, restocking them into barrels, which are stacked onto civilian trucks. Max's uncle Oliver is there with Navy Captain Julian, who skips, leaving Oliver impressed as he peers around and spots women carefully creating a clay sculpture. Back at the firehouse, he whispers to Chief Rogers, who skips, leaving Oliver looking dazzled. The chief rides his van into a repair shop and parks by the garage. He runs into the café and spots the cook juggling with an old Panasonic cassette player; Green can't see him, so the chief tosses a soda can at him. The chief purchases his snacks and the soda can, then shuffles back inside, powers his ambulance, and unwraps the soda can. His gaze is caught by some familiar tunes and he listens closely, shocked, as a flock of birds swoops over the parking lot entrance. The chief's ambulance begins thriving, prompting him to inspect it. Sensing something float nearby, the chief rushes to discover, keeping an eye on his hat. He nearly bursts into laughter as a balloon flutters past him, while in the café, Green is unaware as his cassette player drowns out all the tunes. Over his elbow, the chief's van bounces gently. Instantly, the music increases and Green glances forward, slipping his headphones down as he peers into the doorway. The music continues increasing as Green, feeling bold, quickly shuffles outdoors to find the back of the chief's van dented out by a gentle poke. Green shuffles around the intact ambulance, watching mist falling from its warm engine, and drops the repair tool's spout in a tiny puddle of juice on the floor. Seeing nothing ahead of him, he steps forward and looks completely thrilled."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Joe and Alice watch Louis exit an old yellow Coupe and enter a house. Alice follows him inside, leaving Joe awkwardly on the veranda until she returns. During a film shoot, Martin films zombie Cary with a train wreck in the background. Joe sets up the camera to capture the crash site as news helicopters hover above. At the crash site, Air Force personnel clear white cubes, loading them onto military trucks. Joe's dad, Jack, interacts with Colonel Nelec and Sheriff Pruitt, both leaving him unsatisfied. The sheriff visits a gas station, where clerk Breen is distracted by his Walkman. After filling his patrol car, the sheriff hears noises and investigates with his gun ready. A dumpster flies past him, but Breen remains oblivious. The sheriff's car malfunctions, and lights flicker, drawing Breen's attention. He exits to find the car's front smashed and gasoline pooling. Turning around, he faces something terrifying."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Hearing something behind him he turns around and looks completely terrified Breen walks around the wrecked patrol car observing steam rising from its ruptured radiator and picks the petrol pump's nozzle out of a large pool of gasoline on the ground  The lights continue flickering as Breen looking apprehensive slowly makes his way outside to find the front of the sheriff's car smashed in by a violent impact  Suddenly the lights flicker and Breen looks round pulling his headphones off as he looks out of the window  Over his shoulder the sheriff's car jolts violently  Breen is oblivious as his Walkman drowns out all the sound  while in the shop  He nearly leaps out of his skin as a dumpster flies past him  Hearing something move nearby the sheriff goes to investigate keeping a hand on his gun  The sheriff's patrol car starts malfunctioning prompting him to check it out  His attention is caught by some odd noises and he looks around surprised as a pack of dogs runs across the filling station forecourt  The sheriff pays for his petrol and the candy bar then goes back outside fills his patrol car and opens the candy bar  Breen can't hear him so the sheriff lobs a candy bar at him  He goes into the shop and finds the clerk playing with a new Sony Walkman  The sheriff drives his car into a gas station and pulls up by the pumps  Back at the police station he talks to Sheriff Pruitt who goes leaving Jack looking nonplussed  Joe's dad Jack is there with Air Force Colonel Nelec who goes leaving Jack unsatisfied as he looks around and sees men carefully making a plaster of Paris mold  At the crash site Air Force personnel are busy clearing up the cargo of strange white cubes repacking them into crates which are loaded onto military lorries  The film makers look down at the destruction and Joe looks down with a troubled expression  Joe takes the camera and sets it up to film the crash site in the distance while news crew helicopters hover in the air above the scene  Filming a scene Martin shoots zombie Cary as Alice watches with the wrecked train in the distance behind them  Alice follows Louis back into the house leaving an awkward looking Joe standing on the veranda but she comes back out to Joe who looks surprised and steps towards her  Louis walks over to them removes his shades and with heavy sideburns steps inside the house then immediately comes back out  The old yellow Coupe pulls up and Louis gets out with Joe and Alice watching him intensely  They cycle by a road as Joe looks down awkwardly "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "The sheriff's patrol car starts malfunctioning prompting him to check it out  Suddenly the lights flicker and Breen looks round pulling his headphones off as he looks out of the window  Breen is oblivious as his Walkman drowns out all the sound  Hearing something move nearby the sheriff goes to investigate keeping a hand on his gun  while in the shop  He goes into the shop and finds the clerk playing with a new Sony Walkman  He nearly leaps out of his skin as a dumpster flies past him  His attention is caught by some odd noises and he looks around surprised as a pack of dogs runs across the filling station forecourt  At the crash site Air Force personnel are busy clearing up the cargo of strange white cubes repacking them into crates which are loaded onto military lorries  They cycle by a road as Joe looks down awkwardly  Over his shoulder the sheriff's car jolts violently  Back at the police station he talks to Sheriff Pruitt who goes leaving Jack looking nonplussed  Breen walks around the wrecked patrol car observing steam rising from its ruptured radiator and picks the petrol pump's nozzle out of a large pool of gasoline on the ground  Joe takes the camera and sets it up to film the crash site in the distance while news crew helicopters hover in the air above the scene  The old yellow Coupe pulls up and Louis gets out with Joe and Alice watching him intensely  Breen can't hear him so the sheriff lobs a candy bar at him  Louis walks over to them removes his shades and with heavy sideburns steps inside the house then immediately comes back out  Alice follows Louis back into the house leaving an awkward looking Joe standing on the veranda but she comes back out to Joe who looks surprised and steps towards her  Hearing something behind him he turns around and looks completely terrified The film makers look down at the destruction and Joe looks down with a troubled expression  Filming a scene Martin shoots zombie Cary as Alice watches with the wrecked train in the distance behind them  Joe's dad Jack is there with Air Force Colonel Nelec who goes leaving Jack unsatisfied as he looks around and sees men carefully making a plaster of Paris mold  The sheriff drives his car into a gas station and pulls up by the pumps  The sheriff pays for his petrol and the candy bar then goes back outside fills his patrol car and opens the candy bar  The lights continue flickering as Breen looking apprehensive slowly makes his way outside to find the front of the sheriff's car smashed in by a violent impact "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "The sheriff pays for his petrol and the candy bar then goes back outside fills his patrol car and opens the candy bar  His attention is caught by some odd noises and he looks around surprised as a pack of dogs runs across the filling station forecourt  The sheriff's patrol car starts malfunctioning prompting him to check it out  Hearing something move nearby the sheriff goes to investigate keeping a hand on his gun  He nearly leaps out of his skin as a dumpster flies past him  while in the shop  Breen is oblivious as his Walkman drowns out all the sound  Over his shoulder the sheriff's car jolts violently  Suddenly the lights flicker and Breen looks round pulling his headphones off as he looks out of the window  The lights continue flickering as Breen looking apprehensive slowly makes his way outside to find the front of the sheriff's car smashed in by a violent impact  Breen walks around the wrecked patrol car observing steam rising from its ruptured radiator and picks the petrol pump's nozzle out of a large pool of gasoline on the ground  Hearing something behind him he turns around and looks completely terrified They cycle by a road as Joe looks down awkwardly  The old yellow Coupe pulls up and Louis gets out with Joe and Alice watching him intensely  Louis walks over to them removes his shades and with heavy sideburns steps inside the house then immediately comes back out  Alice follows Louis back into the house leaving an awkward looking Joe standing on the veranda but she comes back out to Joe who looks surprised and steps towards her  Filming a scene Martin shoots zombie Cary as Alice watches with the wrecked train in the distance behind them  Joe takes the camera and sets it up to film the crash site in the distance while news crew helicopters hover in the air above the scene  The film makers look down at the destruction and Joe looks down with a troubled expression  At the crash site Air Force personnel are busy clearing up the cargo of strange white cubes repacking them into crates which are loaded onto military lorries  Joe's dad Jack is there with Air Force Colonel Nelec who goes leaving Jack unsatisfied as he looks around and sees men carefully making a plaster of Paris mold  Back at the police station he talks to Sheriff Pruitt who goes leaving Jack looking nonplussed  The sheriff drives his car into a gas station and pulls up by the pumps  He goes into the shop and finds the clerk playing with a new Sony Walkman  Breen can't hear him so the sheriff lobs a candy bar at him "
        }
      ]
    }
  ]
}