{
  "ground_truth": "He sets Tex down on the bank of a river and runs back into the jungle. Forrest drops another wounded soldier down at the bank of the river next to Tex and then runs back toward the jungle. Forrest grabs the third wounded soldier up from the ground and turns him over. It is Dallas. Forrest pulls Lt. Dan over his shoulder and runs through the jungle. Forrest falls down. Forrest gets up as Lt. Dan yells. Lt. Dan fires his pistol at the unseen enemy as Forrest pulls him away. Forrest drops Lt. Dan down at the bank, next to the other wounded soldiers. Lt. Dan grabs Forrest by the shirt, angry. Forrest gets up and runs as Lt. Dan yells after him. Forrest runs through the jungle searching for Bubba. Forrest slows down and looks around carefully. Bubba looks up as he lies on the ground. Bubba holds a palm frond over his wound. Forrest removes the frond to look at the wound. Bubba's chest has been blown open. Forrest looks around as he hears the voices of the enemy. Forrest carries Bubba through the jungle. The sound of approaching planes fills the air. The roar of approaching planes is deafening. Forrest looks up in fear. Three planes dive down toward the jungle. They fire napalm as the jungle explodes with massive fireballs. Forrest runs, carrying Bubba. The fireballs explode behind him. The entire jungle area is in flames as Forrest runs. Forrest carries Bubba to the bank of the river. Lt. Dan and the other wounded soldiers wait for a rescue helicopter. Forrest looks down at Bubba. A soldier releases a smoke canister. The helicopter flies overhead. Forrest continues with his life story. A man is sitting next to Forrest on the bus bench. Forrest holds two ice cream cones in his hands as he is wheeled on a rolling stretcher. Forrest's butt sticks up and is bandaged. Forrest, lying on his stomach, is wheeled to his bed. Forrest looks at Lt. Dan lying on the bed. Forrest holds out an ice cream cone for Lt. Dan. Lt. Dan, annoyed, takes the ice cream cone and drops it into his bedpan. Forrest slides himself onto his bed. A nurse reaches toward Lt. Dan. The male nurse places Lt. Dan's hands on a pull-up bar, then picks up Lt. Dan, whose legs have been amputated. Another nurse wheels the rolling bed under Lt. Dan. The male nurse sets Lt. Dan down on the rolling bed. A soldier reads the names from a pile of letters. Forrest looks up at Lt. Dan as he is wheeled away. The soldier hands Forrest a large pile of letters. Forrest looks down at the pile of letters.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "He places Tex down on the shore of a stream and dashes back into the forest. Forrest places another injured trooper down at the shore of the stream adjacent to Tex and then dashes back toward the forest. Forrest seizes the third injured trooper up from the earth and turns him over. It is Dallas. Forrest pulls Lt. Dan over his shoulder and dashes through the forest. Forrest tumbles down. Forrest rises as Lt. Dan shouts. Lt. Dan fires his handgun at the unseen adversary as Forrest pulls him away. Forrest places Lt. Dan down at the shore, next to the other injured troopers. Lt. Dan grabs Forrest by the garment, furious. Forrest rises and dashes as Lt. Dan shouts after him. Forrest dashes through the forest searching for Bubba. Forrest slows down and observes around cautiously. Bubba glances up as he reclines on the earth. Bubba holds a palm leaf over his injury. Forrest removes the leaf to observe the injury. Bubba's torso has been blasted open. Forrest observes around as he hears the voices of the adversary. Forrest carries Bubba through the forest. The noise of nearing aircraft fills the atmosphere. The roar of nearing aircraft is deafening. Forrest glances up in terror. Three aircraft plunge down toward the forest. They fire napalm as the forest detonates with enormous fireballs. Forrest dashes, carrying Bubba. The fireballs detonate behind him. The entire forest region is in flames as Forrest dashes. Forrest carries Bubba to the shore of the stream. Lt. Dan and the other injured troopers wait for a rescue chopper. Forrest glances down at Bubba. A trooper releases a smoke container. The chopper flies overhead. Forrest continues with his life narrative. A man is seated adjacent to Forrest on the bus bench. Forrest holds two ice cream cones in his hands as he is wheeled on a rolling gurney. Forrest's rear protrudes up and is bandaged. Forrest, lying on his abdomen, is wheeled to his cot. Forrest glances at Lt. Dan lying on the cot. Forrest extends an ice cream cone for Lt. Dan. Lt. Dan, irritated, takes the ice cream cone and tosses it into his bedpan. Forrest slides himself onto his cot. A nurse reaches toward Lt. Dan. The male nurse places Lt. Dan's hands on a pull-up bar, then lifts Lt. Dan, whose limbs have been amputated. Another nurse wheels the rolling cot under Lt. Dan. The male nurse places Lt. Dan down on the rolling cot. A trooper reads the names from a stack of missives. Forrest glances up at Lt. Dan as he is wheeled away. The trooper hands Forrest a large stack of missives. Forrest glances down at the stack of missives."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Tex was set down on the bank of a river by him, and the jungle was run back into by him. Another wounded soldier was dropped down at the bank of the river next to Tex by Forrest, and then the jungle was run back toward by him. The third wounded soldier was grabbed up from the ground by Forrest and turned over. Dallas is discovered by him. Lt. Dan is pulled over Forrest's shoulder, and the jungle is run through by them. Forrest falls down. Lt. Dan yells as Forrest gets up. The pistol is fired by Lt. Dan at the unseen enemy as he is pulled away by Forrest. Lt. Dan is dropped down at the bank, next to the other wounded soldiers by Forrest. Forrest's shirt is grabbed angrily by Lt. Dan. Lt. Dan yells after him as Forrest gets up and runs. Bubba is searched for by Forrest running through the jungle. He slows down and looks around carefully. As he lies on the ground, Bubba looks up. A palm frond is held over his wound by Bubba. The frond is removed by Forrest to look at the wound. Bubba's chest has been blown open. Forrest hears the voices of the enemy as he looks around. Bubba is carried through the jungle by Forrest. The air is filled with the sound of approaching planes. The roar of approaching planes deafens them. In fear, Forrest looks up. The jungle is dived toward by three planes. Napalm is fired as the jungle explodes with massive fireballs. Bubba is carried by Forrest as he runs. The fireballs explode behind him. Flames engulf the entire jungle area as Forrest runs. Bubba is carried to the bank of the river by Forrest. A rescue helicopter is awaited by Lt. Dan and the other wounded soldiers. Down at Bubba, Forrest looks. A smoke canister is released by a soldier. Overhead, a helicopter flies. His life story is continued by Forrest. Next to Forrest on the bus bench sits a man. Two ice cream cones are held in Forrest's hands as a rolling stretcher wheels him on. His bandaged butt sticks up. Forrest, lying on his stomach, is wheeled to his bed. At Lt. Dan lying on the bed, Forrest looks. An ice cream cone is held out for Lt. Dan by Forrest. The ice cream cone is taken by Lt. Dan, annoyed, and dropped into his bedpan. Onto his bed, Forrest slides himself. Toward Lt. Dan, a nurse reaches. Lt. Dan's hands are placed on a pull-up bar by the male nurse, who then picks him up, as his legs have been amputated. The rolling bed is wheeled under Lt. Dan by another nurse. Lt. Dan is set down on the rolling bed by the male nurse. From a pile of letters, the names are read by a soldier. At Lt. Dan, as he is wheeled away, Forrest looks up. A large pile of letters is handed to Forrest by the soldier. At the pile of letters, Forrest looks down."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "He sets Tex down by a riverbank and runs back into the jungle. Forrest brings another wounded soldier to the river beside Tex, then returns. He lifts a third soldier—Dallas—from the ground. Forrest hoists Lt. Dan over his shoulder and runs. He falls but gets up as Lt. Dan yells. Lt. Dan fires at unseen enemies while Forrest drags him away. Forrest lays Lt. Dan with the others. Lt. Dan grabs Forrest's shirt angrily. Forrest runs as Lt. Dan shouts. Searching for Bubba, Forrest slows and scans the area. Bubba, on the ground, holds a palm frond to his wound. Forrest lifts it to reveal Bubba’s open chest wound. Hearing enemy voices, Forrest carries Bubba through the jungle. The deafening roar of three incoming planes fills the air. They drop napalm, setting the jungle ablaze. Forrest runs with Bubba as fireballs erupt behind them. He reaches the riverbank where Lt. Dan and the others await rescue. A soldier releases a smoke canister. A helicopter passes overhead. Forrest resumes telling his life story. On a bus bench, he holds two ice cream cones. Later, he’s wheeled on a stretcher, his bandaged butt exposed. Lying on his stomach, Forrest sees Lt. Dan in bed and offers him an ice cream cone. Lt. Dan takes it and drops it in a bedpan. Forrest shifts onto his bed. A nurse reaches for Lt. Dan. A male nurse lifts Lt. Dan—his legs amputated—onto a rolling bed. Another nurse moves it beneath him. A soldier reads names from letters. Forrest looks at Lt. Dan being wheeled away. The soldier hands Forrest a stack of letters. He looks down at them."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Forrest sets Tex by the river and runs back into the jungle. He drops another wounded soldier next to Tex and returns to the jungle. Forrest finds the third soldier, Dallas, and carries Lt. Dan over his shoulder. Forrest falls, gets up, and as Lt. Dan fires at the enemy, he pulls him away. He drops Lt. Dan by the river with the others. Lt. Dan angrily grabs Forrest, who runs back into the jungle for Bubba. Forrest finds Bubba wounded, removes a palm frond from his chest, and carries him as enemy planes fire napalm, setting the jungle ablaze. Forrest reaches the riverbank with Bubba, where Lt. Dan and others await rescue. A helicopter arrives as Forrest continues his story. On a bus bench, Forrest holds two ice cream cones. Wheeled on a stretcher, his bandaged butt sticks up. Forrest offers Lt. Dan an ice cream cone, which he drops into a bedpan. A nurse helps Lt. Dan, now legless, onto a rolling bed. A soldier reads names from letters, handing Forrest a pile. Forrest looks at the letters as Lt. Dan is wheeled away."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "He carefully sets Tex down on the grassy bank of a flowing river and quickly runs back into the dense, green jungle. With determination, Forrest gently places another wounded soldier down at the riverbank right next to Tex, and then he swiftly turns and runs back toward the jungle once more. Forrest reaches the third wounded soldier, lifting him up from the ground and turning him over to see his face. It is Dallas. With urgency, Forrest hoists Lt. Dan over his shoulder and dashes through the thick jungle. Suddenly, Forrest stumbles and falls to the ground. He quickly gets back up as Lt. Dan yells out in frustration. Lt. Dan, filled with anger, fires his pistol at the unseen enemy as Forrest pulls him away to safety. Forrest carefully lays Lt. Dan down at the riverbank, right next to the other wounded soldiers. Lt. Dan, visibly upset, grabs Forrest by the shirt, his anger evident. Forrest quickly gets up and runs as Lt. Dan continues to yell after him. Forrest races through the jungle, desperately searching for Bubba. He slows down, looking around cautiously. Bubba, lying on the ground, looks up at him. Bubba is holding a large palm frond over his wound. Forrest gently removes the frond to examine the wound. Bubba's chest has been severely blown open. Forrest looks around anxiously as he hears the distant voices of the enemy. With determination, Forrest carries Bubba through the jungle. The sound of approaching planes fills the air, growing louder and more intense. The roar of the planes is deafening. Forrest looks up in fear as three planes dive down toward the jungle. They unleash napalm, and the jungle erupts with massive fireballs. Forrest runs as fast as he can, carrying Bubba. The fireballs explode violently behind him. The entire jungle area is engulfed in flames as Forrest runs with all his might. He carries Bubba to the safety of the riverbank. Lt. Dan and the other wounded soldiers are there, waiting anxiously for a rescue helicopter. Forrest looks down at Bubba with concern. A soldier releases a smoke canister to signal for help. The helicopter flies overhead, its blades whirring loudly. Forrest continues with his life story. A man is sitting next to Forrest on the bus bench, listening intently. Forrest holds two ice cream cones in his hands as he is wheeled on a rolling stretcher. His butt sticks up, bandaged from his injuries. Lying on his stomach, Forrest is wheeled to his bed. He looks over at Lt. Dan, who is lying on the bed next to him. Forrest offers an ice cream cone to Lt. Dan. Lt. Dan, clearly annoyed, takes the ice cream cone and drops it into his bedpan. Forrest carefully slides himself onto his bed. A nurse reaches toward Lt. Dan to assist him. The male nurse places Lt. Dan's hands on a pull-up bar, then lifts him up, as Lt. Dan's legs have been amputated. Another nurse wheels the rolling bed under Lt. Dan. The male nurse gently sets Lt. Dan down on the rolling bed. A soldier reads the names from a pile of letters. Forrest looks up at Lt. Dan as he is wheeled away. The soldier hands Forrest a large pile of letters. Forrest looks down at the pile of letters, contemplating their contents."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "With meticulous care and precision, he gently sets Tex down on the lush, grassy bank of a swiftly flowing river and, without wasting a moment, sprints back into the dense, vibrant green jungle that looms behind him. Determined and focused, Forrest tenderly lays another injured soldier down at the riverbank, placing him right beside Tex. Then, with the same swiftness, he turns on his heel and dashes back toward the thick jungle once more. When Forrest arrives at the side of the third wounded soldier, he carefully lifts him from the ground, turning him over to see his face more clearly. It is Dallas. Acting with urgency, Forrest hoists Lt. Dan over his shoulder and makes a desperate dash through the tangled, thick jungle undergrowth. Suddenly, Forrest stumbles and falls heavily to the ground, but he quickly gets back on his feet as Lt. Dan shouts out in frustration. Filled with a deep-seated anger, Lt. Dan fires his pistol wildly at the unseen enemy while Forrest pulls him away to safety. Forrest takes great care as he lays Lt. Dan down on the riverbank, placing him beside the other wounded soldiers. Lt. Dan, visibly upset and angered, grabs Forrest firmly by the shirt, his fury apparent. Forrest quickly rises to his feet and runs off as Lt. Dan continues to shout after him. Forrest races with urgency through the jungle, frantically searching for Bubba. He slows his pace, looking around with heightened caution. On the ground, Bubba looks up at him, holding a large palm frond over his wound. Forrest gently removes the frond to assess the severity of the injury. Bubba's chest has been severely blown open. Anxiously, Forrest glances around as he hears the distant and ominous voices of the enemy. With unwavering resolve, Forrest lifts Bubba and carries him through the jungle. The sound of approaching planes fills the air, growing louder and more intense, and the roar becomes deafening. Forrest looks up in fear as three planes dive down toward the jungle. They release napalm, causing the jungle to erupt with massive, fiery explosions. Forrest runs as fast as he can, carrying Bubba, as the fireballs explode violently behind him. The entire jungle area is quickly engulfed in flames as Forrest runs with all his might. He manages to carry Bubba to the relative safety of the riverbank. There, Lt. Dan and the other wounded soldiers are waiting anxiously for a rescue helicopter to arrive. Looking down at Bubba with growing concern, Forrest observes a soldier releasing a smoke canister to signal for help. The helicopter flies overhead, its blades whirring loudly in the sky. Forrest continues recounting his life story. A man sitting next to Forrest on the bus bench listens intently, engrossed in the tale. As Forrest is wheeled on a rolling stretcher, he holds two ice cream cones in his hands. His buttocks are bandaged, sticking up from the stretcher due to his injuries. Lying on his stomach, Forrest is wheeled to his bed. He glances over at Lt. Dan, who is lying in the bed next to his. Forrest offers an ice cream cone to Lt. Dan, who, clearly annoyed, takes the ice cream cone and casually drops it into his bedpan. Forrest carefully slides himself onto his own bed. A nurse reaches over to assist Lt. Dan. A male nurse places Lt. Dan's hands on a pull-up bar, then lifts him up, as Lt. Dan's legs have been amputated. Another nurse wheels the rolling bed beneath Lt. Dan. The male nurse gently and carefully sets Lt. Dan down on the rolling bed. Nearby, a soldier reads aloud from a pile of letters. Forrest looks up at Lt. Dan as he is wheeled away. The soldier hands Forrest a substantial pile of letters. Forrest looks down contemplatively at the pile of letters in his hands, pondering their contents."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "He gently places Tex down on the bank of a river, ensuring he is positioned safely, before quickly turning and sprinting back into the dense jungle. With urgency, Forrest carefully lowers another wounded soldier onto the riverbank beside Tex, making sure they are both secure, and then swiftly pivots to dash back toward the jungle once more. Upon reaching the third wounded soldier, Forrest bends down, carefully lifts him from the ground, and turns him over to reveal that it is Dallas. With determination, Forrest hoists Lt. Dan over his shoulder, adjusting his grip to ensure a firm hold, and begins to run through the jungle. As he navigates the uneven terrain, Forrest stumbles and falls but quickly regains his footing, spurred on by Lt. Dan's urgent yells. Lt. Dan, with a sense of urgency, fires his pistol at the unseen enemy while Forrest continues to pull him away from danger. Reaching the riverbank, Forrest gently lowers Lt. Dan next to the other wounded soldiers. In a moment of frustration, Lt. Dan grabs Forrest by the shirt, his anger evident. Forrest, undeterred, rises to his feet and sprints back into the jungle as Lt. Dan's voice echoes behind him. As he runs, Forrest's eyes scan the jungle, searching intently for Bubba. Slowing his pace, he carefully surveys his surroundings. Bubba, lying on the ground, looks up at Forrest, holding a palm frond over his wound. Forrest gently removes the frond to assess the severity of the wound, revealing that Bubba's chest has been blown open. Alert to the danger, Forrest listens intently to the enemy voices nearby. With urgency, he lifts Bubba and carries him through the jungle. The sound of approaching planes grows louder, filling the air with a deafening roar. Forrest glances upward, fear etched on his face, as three planes dive toward the jungle, releasing napalm that ignites massive fireballs. With the jungle ablaze behind him, Forrest runs, carrying Bubba to safety. The entire area is engulfed in flames as he races to the riverbank. There, Lt. Dan and the other wounded soldiers await a rescue helicopter. Forrest looks down at Bubba, concern in his eyes. A soldier releases a smoke canister, signaling for help, as the helicopter flies overhead. Transitioning to another scene, Forrest continues narrating his life story while sitting on a bus bench next to a man. In a hospital setting, Forrest holds two ice cream cones in his hands as he is wheeled on a rolling stretcher, his bandaged buttocks sticking up. Lying on his stomach, he is wheeled to his bed, where he notices Lt. Dan lying nearby. With a gesture of friendship, Forrest offers an ice cream cone to Lt. Dan, who, despite his annoyance, takes it and drops it into his bedpan. Forrest then carefully slides himself onto his bed. A nurse reaches toward Lt. Dan, and a male nurse assists by placing Lt. Dan's hands on a pull-up bar, then lifting him, as his legs have been amputated. Another nurse positions a rolling bed beneath Lt. Dan, and the male nurse gently sets him down on it. Meanwhile, a soldier reads names from a pile of letters, and Forrest looks up at Lt. Dan as he is wheeled away. The soldier hands Forrest a large pile of letters, and Forrest looks down, contemplating the stack in his hands."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Forrest sets Tex down by the riverbank and repeatedly returns to the jungle to rescue more wounded soldiers, including Dallas and Lt. Dan. Despite falling, Forrest perseveres, carrying Lt. Dan through enemy fire to the riverbank, where Lt. Dan angrily confronts him. Undeterred, Forrest searches for Bubba, eventually finding him severely wounded. As enemy planes approach, Forrest fearfully carries Bubba through the jungle, narrowly escaping the napalm explosions. He reaches the riverbank, where Lt. Dan and others await rescue. A helicopter arrives as Forrest reflects on his life story.\n\nLater, Forrest is on a bus bench, holding two ice cream cones. In a hospital, he is wheeled on a stretcher with a bandaged backside. He offers an ice cream cone to Lt. Dan, who dismissively drops it into his bedpan. Forrest then transfers himself to his bed. A nurse assists Lt. Dan, who has lost his legs, by placing him on a rolling bed. As Lt. Dan is wheeled away, a soldier hands Forrest a large pile of letters, which he examines thoughtfully."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "He sets Tex down on the bank of a river, likely resembling the dense waterways of Vietnam during the war, and runs back into the jungle. Forrest, a soldier serving in the Vietnam War, drops another wounded soldier down at the bank of the river next to Tex and then runs back toward the jungle. Forrest grabs the third wounded soldier up from the ground and turns him over. It is Dallas, a fellow comrade. Forrest pulls Lt. Dan, a commanding officer known for his fierce demeanor and resilience, over his shoulder and runs through the jungle. Forrest falls down. Forrest gets up as Lt. Dan yells, echoing the chaos of combat. Lt. Dan fires his pistol at the unseen enemy, likely the Viet Cong, as Forrest pulls him away. Forrest drops Lt. Dan down at the bank, next to the other wounded soldiers. Lt. Dan grabs Forrest by the shirt, angry, possibly frustrated by the loss and chaos surrounding them. Forrest gets up and runs as Lt. Dan yells after him. Forrest runs through the jungle searching for Bubba, his best friend and fellow soldier. Forrest slows down and looks around carefully. Bubba, critically injured, looks up as he lies on the ground. Bubba holds a palm frond over his wound, a desperate attempt to staunch the bleeding. Forrest removes the frond to look at the wound. Bubba's chest has been blown open, a grim reminder of the brutality of war. Forrest looks around as he hears the voices of the enemy. Forrest carries Bubba through the jungle. The sound of approaching planes, likely American aircraft sent for support, fills the air. The roar of approaching planes is deafening. Forrest looks up in fear. Three planes dive down toward the jungle. They fire napalm, a devastating incendiary weapon, as the jungle explodes with massive fireballs. Forrest runs, carrying Bubba. The fireballs explode behind him. The entire jungle area is in flames as Forrest runs. Forrest carries Bubba to the bank of the river. Lt. Dan and the other wounded soldiers wait for a rescue helicopter, their only hope for survival. Forrest looks down at Bubba, knowing the end is near. A soldier releases a smoke canister, a signal for the rescue team. The helicopter flies overhead, ready to evacuate the injured. Forrest continues with his life story. A man is sitting next to Forrest on the bus bench, listening to his tales. Forrest holds two ice cream cones in his hands as he is wheeled on a rolling stretcher, recovering from his injuries. Forrest's butt sticks up and is bandaged, showing the aftermath of his sacrifice. Forrest, lying on his stomach, is wheeled to his bed. Forrest looks at Lt. Dan lying on the bed, without his legs, shattered by the war. Forrest holds out an ice cream cone for Lt. Dan. Lt. Dan, annoyed but outwardly stoic, takes the ice cream cone and drops it into his bedpan. Forrest slides himself onto his bed. A nurse reaches toward Lt. Dan, determined to help him recover. The male nurse places Lt. Dan's hands on a pull-up bar, then picks up Lt. Dan, whose legs have been amputated due to severe injuries. Another nurse wheels the rolling bed under Lt. Dan. The male nurse sets Lt. Dan down on the rolling bed. A soldier reads the names from a pile of letters, a bittersweet connection to home. Forrest looks up at Lt. Dan as he is wheeled away. The soldier hands Forrest a large pile of letters, written by his beloved mother. Forrest looks down at the pile of letters, feeling the warmth and connection to his family despite the distance."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "He sets Tex down on the bank of a river and runs back into the jungle  Forrest drops another wounded soldier down at the bank of the river next to Tex and then runs back toward the jungle  Forrest grabs the third wounded soldier up from the ground and turns him over  It is Dallas  Forrest pulls Lt Dan over his shoulder and runs through the jungle  Forrest falls down  Forrest gets up as Lt Dan yells  The roar of approaching planes is deafening  Forrest looks up in fear  Three planes dive down toward the jungle  They fire napalm as the jungle explodes with massive fireballs  Forrest runs carrying Bubba  The fireballs explode behind him  The entire jungle area is in flames as Forrest runs  Forrest carries Bubba to the bank of the river  Lt Dan and the other wounded soldiers wait for a rescue helicopter  Forrest looks down at Bubba  A soldier releases a smoke canister  The helicopter flies overhead  Forrest continues with his life story  A man is sitting next to Forrest on the bus bench  Forrest holds two ice cream cones in his hands as he is wheeled on a rolling stretcher  Forrest's butt sticks up and is bandaged  Forrest lying on his stomach is wheeled to his bed  Forrest looks at Lt Dan lying on the bed  Forrest holds out an ice cream cone for Lt Dan  Lt Dan annoyed takes the ice cream cone and drops it into his bedpan  Forrest slides himself onto his bed  A nurse reaches toward Lt Dan  The male nurse places Lt Dan's hands on a pullup bar then picks up Lt Dan whose legs have been amputated  Another nurse wheels the rolling bed under Lt Dan  The male nurse sets Lt Dan down on the rolling bed  Lt Dan fires his pistol at the unseen enemy as Forrest pulls him away  Forrest drops Lt Dan down at the bank next to the other wounded soldiers  Lt Dan grabs Forrest by the shirt  angry Forrest gets up and runs as Lt Dan yells after him  Forrest runs through the jungle searching for Bubba  Forrest slows down and looks around carefully  Bubba looks up as he lies on the ground  Bubba holds a palm frond over his wound  Forrest removes the frond to look at the wound  Bubba's chest has been blown open  Forrest looks around as he hears the voices of the enemy  Forrest carries Bubba through the jungle  The sound of approaching planes fills the air  The roar of approaching planes is deafening  Forrest looks up in fear  Three planes dive down toward the jungle  They fire napalm as the jungle explodes with massive fireballs  Forrest runs carrying Bubba  The fireballs explode behind him  The entire jungle area is in flames as Forrest runs  Forrest carries Bubba to the bank of the river  Lt Dan and the other wounded soldiers wait for a rescue helicopter  Forrest looks down at Bubba  A soldier releases a smoke canister  The helicopter flies overhead  Forrest continues with his life story  A man is sitting next to Forrest on the bus bench  Forrest holds two ice cream cones in his hands as he is wheeled on a rolling stretcher  Forrest's butt sticks up and is bandaged  Forrest lying on his stomach is wheeled to his bed  Forrest looks at Lt Dan lying on the bed  Forrest holds out an ice cream cone for Lt Dan  Lt Dan annoyed takes the ice cream cone and drops it into his bedpan  Forrest slides himself onto his bed  A nurse reaches toward Lt Dan  The male nurse places Lt Dan's hands on a pullup bar then picks up Lt Dan whose legs have been amputated  Another nurse wheels the rolling bed under Lt Dan  The male nurse sets Lt Dan down on the rolling bed  A soldier reads the names from a pile of letters  Forrest looks up at Lt Dan as he is wheeled away  The soldier hands Forrest a large pile of letters  Forrest looks down at the pile of letters"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "He sets Tex down on the bank of a river and runs back into the jungle. Forrest drops another wounded soldier down at the bank of the river next to Tex and then runs back toward the jungle. Forrest grabs the third wounded soldier up from the ground and turns him over. It is Dallas. Forrest pulls Lt Dan over his shoulder and runs through the jungle. Forrest falls down. Forrest gets up as Lt Dan yells. Lt Dan fires his pistol at the unseen enemy as Forrest pulls him away. Forrest drops Lt Dan down at the bank next to the other wounded soldiers. Lt Dan grabs Forrest by the shirt. angry Forrest gets up and runs as Lt Dan yells after him. Forrest runs through the jungle searching for Bubba. Forrest slows down and looks around carefully. Bubba looks up as he lies on the ground. Bubba holds a palm frond over his wound. Forrest removes the frond to look at the wound. Bubba's chest has been blown open. Forrest looks around as he hears the voices of the enemy. Forrest carries Bubba through the jungle. The sound of approaching planes fills the air. The roar of approaching planes is deafening. Forrest looks up in fear. Three planes dive down toward the jungle. They fire napalm as the jungle explodes with massive fireballs. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. Forrest runs carrying Bubba. The fireballs explode behind him. The entire jungle area is in flames as Forrest runs. Forrest carries Bubba to the bank of the river. Lt Dan and the other wounded soldiers wait for a rescue helicopter. Forrest looks down at Bubba. A soldier releases a smoke canister. The helicopter flies overhead. Forrest continues with his life story. A man is sitting next to Forrest on the bus bench. Forrest holds two ice cream cones in his hands as he is wheeled on a rolling stretcher. Forrest's butt sticks up and is bandaged. Forrest lying on his stomach is wheeled to his bed. Forrest looks at Lt Dan lying on the bed. Forrest holds out an ice cream cone for Lt Dan. Lt Dan annoyed takes the ice cream cone and drops it into his bedpan. Forrest slides himself onto his bed. A nurse reaches toward Lt Dan. The male nurse places Lt Dan's hands on a pullup bar then picks up Lt Dan whose legs have been amputated. Another nurse wheels the rolling bed under Lt Dan. The male nurse sets Lt Dan down on the rolling bed. A soldier reads the names from a pile of letters. Forrest looks up at Lt Dan as he is wheeled away. The soldier hands Forrest a large pile of letters. Forrest looks down at the pile of letters."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "He sets Tex down on the bank of a river and runs back into the jungle. Forrest drops another wounded soldier down at the bank of the river next to Tex and then runs back toward the jungle. Forrest grabs the third wounded soldier up from the ground and turns him over. It is Dallas. Forrest pulls Lt Dan over his shoulder and runs through the jungle. Forrest falls down. Forrest gets up as Lt Dan yells. Lt Dan fires his pistol at the unseen enemy as Forrest pulls him away. Forrest drops Lt Dan down at the bank next to the other wounded soldiers. Lt Dan grabs Forrest by the shirt. angry Forrest gets up and runs as Lt Dan yells after him. Forrest runs through the jungle searching for Bubba. Forrest slows down and looks around carefully. Bubba looks up as he lies on the ground. Bubba holds a palm frond over his wound. Forrest removes the frond to look at the wound. Bubba's chest has been blown open. Forrest looks around as he hears the voices of the enemy. Forrest carries Bubba through the jungle. The sound of approaching planes fills the air. The roar of approaching planes is deafening. Forrest looks up in fear. Three planes dive down toward the jungle. They fire napalm as the jungle explodes with massive fireballs. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. Forrest runs carrying Bubba. The fireballs explode behind him. The entire jungle area is in flames as Forrest runs. Forrest carries Bubba to the bank of the river. Lt Dan and the other wounded soldiers wait for a rescue helicopter. Forrest looks down at Bubba. A soldier releases a smoke canister. The helicopter flies overhead. Forrest continues with his life story. A man is sitting next to Forrest on the bus bench. Forrest holds two ice cream cones in his hands as he is wheeled on a rolling stretcher. Forrest's butt sticks up and is bandaged. Forrest lying on his stomach is wheeled to his bed. Forrest looks at Lt Dan lying on the bed. Forrest holds out an ice cream cone for Lt Dan. Lt Dan annoyed takes the ice cream cone and drops it into his bedpan. Forrest slides himself onto his bed. A nurse reaches toward Lt Dan. The male nurse places Lt Dan's hands on a pullup bar then picks up Lt Dan whose legs have been amputated. Another nurse wheels the rolling bed under Lt Dan. The male nurse sets Lt Dan down on the rolling bed. A soldier reads the names from a pile of letters. Forrest looks up at Lt Dan as he is wheeled away. The soldier hands Forrest a large pile of letters. Forrest looks down at the pile of letters."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "He sets Tex down on the bank of a river and runs back into the jungle. Forrest drops another wounded soldier down at the bank of the river next to Tex and then runs back toward the jungle. Forrest grabs the third wounded soldier up from the ground and turns him over. It is Dallas. Forrest pulls Lt Dan over his shoulder and runs through the jungle. Forrest falls down. Forrest gets up as Lt Dan yells. Lt Dan fires his pistol at the unseen enemy as Forrest pulls him away. Forrest drops Lt Dan down at the bank next to the other wounded soldiers. Lt Dan grabs Forrest by the shirt. angry Forrest gets up and runs as Lt Dan yells after him. Forrest runs through the jungle searching for Bubba. Forrest lying on his stomach is wheeled to his bed. Forrest looks at Lt Dan lying on the bed. Forrest holds out an ice cream cone for Lt Dan. Lt Dan annoyed takes the ice cream cone and drops it into his bedpan. Forrest slides himself onto his bed. A nurse reaches toward Lt Dan. The male nurse places Lt Dan's hands on a pullup bar then picks up Lt Dan whose legs have been amputated. Another nurse wheels the rolling bed under Lt Dan. The male nurse sets Lt Dan down on the rolling bed. A soldier reads the names from a pile of letters. Forrest looks up at Lt Dan as he is wheeled away. The soldier hands Forrest a large pile of letters. Forrest looks down at the pile of letters."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "He sets Tex down on the bank of a river and runs back into the jungle. Forrest drops another wounded soldier down at the bank of the river next to Tex and then runs back toward the jungle. Forrest grabs the third wounded soldier up from the ground and turns him over. It is Dallas. Forrest pulls Lt Dan over his shoulder and runs through the jungle. The male nurse sets Lt Dan down on the rolling bed. A soldier reads the names from a pile of letters. Forrest looks up at Lt Dan as he is wheeled away. The soldier hands Forrest a large pile of letters. Forrest looks down at the pile of letters."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The fox sets Tex down on the bank of a river and runs back into the jungle. The squirrel drops another wounded soldier down at the bank of the river next to Tex and then runs back toward the jungle. The rabbit grabs the third wounded soldier up from the ground and turns him over. It is Dallas. The owl pulls Lt. Dan over its shoulder and runs through the jungle. The bear falls down. The duck gets up as Lt. Dan yells. Lt. Dan fires his pistol at the unseen enemy as the kangaroo pulls him away. The giraffe drops Lt. Dan down at the bank, next to the other wounded soldiers. Lt. Dan grabs the turtle by the shirt, angry. The peacock gets up and runs as Lt. Dan yells after it. The dog runs through the jungle searching for Bubba. The horse slows down and looks around carefully. Bubba looks up as he lies on the ground. Bubba holds a palm frond over his wound. The elephant removes the frond to look at the wound. Bubba's chest has been blown open. The penguin looks around as it hears the voices of the enemy. The lion carries Bubba through the jungle. The sound of approaching planes fills the air. The roar of approaching planes is deafening. The panda looks up in fear. Three planes dive down toward the jungle. They fire napalm as the jungle explodes with massive fireballs. The walrus runs, carrying Bubba. The fireballs explode behind it. The entire jungle area is in flames as the dolphin runs. The cat carries Bubba to the bank of the river. Lt. Dan and the other wounded soldiers wait for a rescue helicopter. The parrot looks down at Bubba. A monkey releases a smoke canister. The helicopter flies overhead. The cheetah continues with its life story. A snake is sitting next to the owl on the bus bench. The unicorn holds two ice cream cones in its hands as it is wheeled on a rolling stretcher. The frog's butt sticks up and is bandaged. The koala, lying on its stomach, is wheeled to its bed. The hamster looks at Lt. Dan lying on the bed. The zebra holds out an ice cream cone for Lt. Dan. Lt. Dan, annoyed, takes the ice cream cone and drops it into his bedpan. The hedgehog slides itself onto its bed. A nurse reaches toward Lt. Dan. The male nurse places Lt. Dan's hands on a pull-up bar, then picks up Lt. Dan, whose legs have been amputated. Another nurse wheels the rolling bed under Lt. Dan. The male nurse sets Lt. Dan down on the rolling bed. A raccoon reads the names from a pile of letters. The kangaroo looks up at Lt. Dan as he is wheeled away. The raccoon hands the bull a large pile of letters. The fox looks down at the pile of letters."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "He sets Tex down on the shore of a lake and runs back into the meadow. Forrest drops another wounded soldier down at the shore of the lake next to Tex and then runs back toward the meadow. Forrest grabs the third wounded soldier up from the ground and turns him over. It is Dallas. Forrest pulls Lt. Dan over his shoulder and runs through the meadow. Forrest trips. Forrest gets up as Lt. Dan yells. Lt. Dan fires his slingshot at the unseen enemy as Forrest pulls him away. Forrest drops Lt. Dan down at the shore, next to the other wounded soldiers. Lt. Dan grabs Forrest by the jacket, angry. Forrest gets up and runs as Lt. Dan yells after him. Forrest runs through the meadow searching for Bubba. Forrest slows down and looks around carefully. Bubba looks up as he lies on the ground. Bubba holds a piece of fabric over his wound. Forrest removes the fabric to look at the wound. Bubba's chest has been severely injured. Forrest looks around as he hears the voices of the enemy. Forrest carries Bubba through the meadow. The sound of approaching trains fills the air. The rumble of approaching trains is deafening. Forrest looks up in fear. Three trains charge down toward the meadow. They release fireworks as the meadow erupts with massive sparks. Forrest runs, carrying Bubba. The sparks explode behind him. The entire meadow area is ablaze as Forrest runs. Forrest carries Bubba to the shore of the lake. Lt. Dan and the other wounded soldiers wait for a rescue plane. Forrest looks down at Bubba. A soldier releases a flare. The plane flies overhead. Forrest continues with his life story. A man is sitting next to Forrest on the park bench. Forrest holds two snow cones in his hands as he is wheeled on a rolling gurney. Forrest's back sticks up and is bandaged. Forrest, lying on his stomach, is wheeled to his bed. Forrest looks at Lt. Dan lying on the couch. Forrest holds out a snow cone for Lt. Dan. Lt. Dan, annoyed, takes the snow cone and drops it into his hat. Forrest slides himself onto his cot. A nurse reaches toward Lt. Dan. The male nurse places Lt. Dan's hands on a pull-up bar, then picks up Lt. Dan, whose legs have been replaced. Another nurse wheels the rolling cot under Lt. Dan. The male nurse sets Lt. Dan down on the rolling cot. A soldier reads the names from a stack of cards. Forrest looks up at Lt. Dan as he is wheeled away. The soldier hands Forrest a large stack of cards. Forrest looks down at the stack of cards."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "He plants Tex down on the bank of a river and leaps back into the jungle. Forrest places another wounded soldier down at the bank of the river next to Tex and then dashes back toward the jungle. Forrest lifts the third wounded soldier up from the ground and spins him around. It is Dallas. Forrest hoists Lt. Dan over his shoulder and skips through the jungle. Forrest tumbles down. Forrest bounces up as Lt. Dan shouts. Lt. Dan throws his pistol at the unseen enemy as Forrest hauls him away. Forrest places Lt. Dan down at the bank, next to the other wounded soldiers. Lt. Dan shakes Forrest by the shirt, angry. Forrest bounces up and leaps as Lt. Dan shouts after him. Forrest races through the jungle searching for Bubba. Forrest slows down and squints around carefully. Bubba glances up as he sits on the ground. Bubba twirls a palm frond over his wound. Forrest plucks the frond to inspect the wound. Bubba's chest has been blown open. Forrest scans around as he hears the voices of the enemy. Forrest hoists Bubba through the jungle. The sound of approaching planes fills the air. The roar of approaching planes is thunderous. Forrest glances up in fear. Three planes soar down toward the jungle. They drop napalm as the jungle erupts with massive fireballs. Forrest dashes, hoisting Bubba. The fireballs burst behind him. The entire jungle area is ablaze as Forrest speeds through. Forrest hoists Bubba to the bank of the river. Lt. Dan and the other wounded soldiers anticipate a rescue helicopter. Forrest glances down at Bubba. A soldier hurls a smoke canister. The helicopter hovers overhead. Forrest continues with his life story. A man is lounging next to Forrest on the bus bench. Forrest juggles two ice cream cones in his hands as he is propelled on a rolling stretcher. Forrest's rear protrudes and is bandaged. Forrest, lounging on his stomach, is wheeled to his bed. Forrest glances at Lt. Dan lounging on the bed. Forrest extends an ice cream cone for Lt. Dan. Lt. Dan, irritated, snags the ice cream cone and plops it into his bedpan. Forrest maneuvers himself onto his bed. A nurse extends a hand toward Lt. Dan. The male nurse places Lt. Dan's hands on a pull-up bar, then hoists Lt. Dan, whose legs have been amputated. Another nurse steers the rolling bed under Lt. Dan. The male nurse positions Lt. Dan down on the rolling bed. A soldier declaims the names from a pile of letters. Forrest stares up at Lt. Dan as he is rolled away. The soldier passes Forrest a large pile of letters. Forrest gazes down at the pile of letters."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "The mailbox sets a lamp down on the edge of a skateboard and skips back into the library. The violin drops another injured painting down at the edge of the skateboard next to the lamp and then skips back toward the library. The violin grabs the third injured painting up from the floor and spins it around. It is a cactus. The violin hauls a toaster over its shoulder and skips through the library. The violin stumbles down. The violin stands up as the toaster yells. The toaster fires a flute at the invisible pancake as the violin pulls it away. The violin drops the toaster down at the edge, next to the other injured paintings. The toaster grabs the violin by the scarf, irate. The violin stands and skips as the toaster yells after it. The violin skips through the library searching for a refrigerator. The violin slows down and scans around carefully. The refrigerator looks up as it reclines on the floor. The refrigerator holds a newspaper over its crack. The violin removes the newspaper to inspect the crack. The refrigerator's shell has been blown open. The violin glances around as it hears the whispers of the pancake. The violin carries the refrigerator through the library. The noise of approaching dolphins fills the air. The roar of approaching dolphins is overwhelming. The violin glances up in dread. Three dolphins plunge down toward the library. They release glitter as the library erupts with enormous fireworks. The violin skips, carrying the refrigerator. The fireworks burst behind it. The entire library space is ablaze as the violin skips. The violin carries the refrigerator to the edge of the skateboard. The toaster and the other injured paintings wait for a rescue unicycle. The violin glances down at the refrigerator. A squirrel releases a bubble machine. The unicycle glides overhead. The violin continues with its tale. A cat is lounging next to the violin on the piano bench. The violin clutches two pizzas in its hands as it is rolled on a sliding ladder. The violin's radio protrudes and is bandaged. The violin, lying on its side, is rolled to its hammock. The violin glances at the toaster lying in the hammock. The violin offers up a pizza to the toaster. The toaster, irritated, takes the pizza and drops it into its teacup. The violin slides itself onto its hammock. A rabbit reaches toward the toaster. The female rabbit places the toaster's paws on a trapeze bar, then hoists up the toaster, whose wheels have been detached. Another rabbit rolls the sliding hammock under the toaster. The female rabbit places the toaster down on the sliding hammock. A squirrel reads the addresses from a stack of envelopes. The violin glances up at the toaster as it is rolled away. The squirrel hands the violin a hefty stack of envelopes. The violin glances down at the stack of envelopes."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "She places Rex down on the edge of a mountain and skips back into the desert. Charlotte drops another sleeping dog down at the edge of the mountain next to Rex and then skips back toward the desert. Charlotte scoops the third sleeping dog up from the sand and spins him around. It is Cuba. Charlotte pushes Mr. Lee over her back and skips through the desert. Charlotte slips down. Charlotte stands up as Mr. Lee laughs. Mr. Lee waves his hat at the unseen crowd as Charlotte pulls him away. Charlotte places Mr. Lee down at the edge, next to the other sleeping dogs. Mr. Lee taps Charlotte on the shoulder, amused. Charlotte stands up and skips as Mr. Lee laughs after her. Charlotte skips through the desert searching for Luna. Charlotte slows down and glances around cautiously. Luna gazes upward as she rests on the sand. Luna waves a feather over her injury. Charlotte removes the feather to examine the injury. Luna's side has been burned open. Charlotte glances around as she hears the shouts of the crowd. Charlotte hauls Luna through the desert. The sound of departing trucks fills the air. The rumble of departing trucks is thunderous. Charlotte gazes upward in awe. Three trucks dive down toward the desert. They release confetti as the desert erupts with colorful explosions. Charlotte skips, carrying Luna. The confetti bursts behind her. The entire desert area is covered in colors as Charlotte skips. Charlotte hauls Luna to the edge of the mountain. Mr. Lee and the other sleeping dogs wait for a supply wagon. Charlotte glances down at Luna. A child releases a balloon. The wagon flies nearby. Charlotte continues with her dream tale. A woman is sitting across from Charlotte on the park bench. Charlotte holds two lollipops in her hands as she is dragged on a sliding mat. Charlotte's head sticks up and is bandaged. Charlotte, lying on her back, is slid to her chair. Charlotte gazes at Mr. Lee resting in the chair. Charlotte offers a lollipop to Mr. Lee. Mr. Lee, delighted, accepts the lollipop and tosses it into his backpack. Charlotte pulls herself onto her chair. A teacher reaches toward Mr. Lee. The female teacher places Mr. Lee's hands on a pull-up rope, then lifts Mr. Lee, whose arms have been bandaged. Another teacher slides the sliding mat under Mr. Lee. The female teacher places Mr. Lee down on the sliding mat. A child recites the names from a stack of comics. Charlotte gazes at Mr. Lee as he is slid away. The child gives Charlotte a large stack of comics. Charlotte gazes down at the stack of comics."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "He places Tex down on the edge of a meadow and darts back into the forest. Forrest lowers another injured sailor down at the edge of the meadow next to Tex and then hurries back toward the forest. Forrest hoists the third injured sailor off the ground and flips him over. It is Dallas. Forrest drags Lt. Dan across his hip and dashes through the forest. Forrest stumbles. Forrest rises as Lt. Dan shouts. Lt. Dan swings his club at the invisible foe as Forrest drags him away. Forrest places Lt. Dan down at the edge, next to the other injured sailors. Lt. Dan grasps Forrest by the jacket, furious. Forrest stands up and dashes as Lt. Dan shouts after him. Forrest races through the forest searching for Bubba. Forrest decelerates and scans cautiously. Bubba peers up as he sits on the ground. Bubba balances a bamboo stick over his injury. Forrest removes the stick to inspect the injury. Bubba's side has been blown apart. Forrest glances around as he hears the chatter of the foe. Forrest lifts Bubba through the forest. The noise of arriving boats fills the air. The roar of arriving boats is thunderous. Forrest glances up in terror. Three boats glide down toward the forest. They release flares as the forest erupts with massive light shows. Forrest dashes, carrying Bubba. The light shows erupt behind him. The entire forest area is ablaze as Forrest sprints. Forrest hauls Bubba to the edge of the meadow. Lt. Dan and the other injured sailors wait for a rescue balloon. Forrest glances down at Bubba. A sailor pops open a confetti tube. The balloon floats overhead. Forrest continues with his life tale. A man is sitting next to Forrest on the park bench. Forrest holds two lollipops in his hands as he is rolled on a moving cart. Forrest's shoulder sticks up and is wrapped. Forrest, lying on his back, is rolled to his cot. Forrest glances at Lt. Dan lying on the cot. Forrest offers a lollipop to Lt. Dan. Lt. Dan, irritated, accepts the lollipop and tosses it into his briefcase. Forrest shifts himself onto his cot. A medic reaches toward Lt. Dan. The male medic places Lt. Dan's hands on a lifting strap, then elevates Lt. Dan, whose arms have been removed. Another medic rolls the movable cot under Lt. Dan. The male medic lowers Lt. Dan onto the movable cot. A sailor recites the addresses from a pile of papers. Forrest glances up at Lt. Dan as he is rolled away. The sailor hands Forrest an enormous pile of papers. Forrest gazes down at the pile of papers."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "He places Jake down on the edge of a lake and dashes back into the desert. Oliver sets another exhausted traveler down at the edge of the lake beside Jake and then dashes back toward the desert. Oliver lifts the fourth exhausted traveler off the sand and flips him over. It is Jordan. Oliver hoists Sgt. Rick over his shoulder and sprints through the desert. Oliver collapses. Oliver stands up as Sgt. Rick shouts. Sgt. Rick swings his slingshot at the invisible intruders as Oliver drags him away. Oliver sets Sgt. Rick down at the shore, beside the other exhausted travelers. Sgt. Rick grasps Oliver by the collar, furious. Oliver leaps up and dashes as Sgt. Rick shouts after him. Oliver sprints through the desert searching for Alex. Oliver slows and scans the surroundings carefully. Alex gazes up while resting on the sand. Alex holds a cactus leaf over his injury. Oliver removes the leaf to inspect the injury. Alex’s side has been ripped apart. Oliver glances around as he hears the whispers of the intruders. Oliver hauls Alex through the desert. The noise of incoming jets fills the atmosphere. The thunder of incoming jets is deafening. Oliver glances up in terror. Three jets dive toward the desert. They release fireworks as the desert erupts with massive fireballs. Oliver sprints, hauling Alex. The fireballs detonate behind him. The entire desert region is ablaze as Oliver sprints. Oliver hauls Alex to the edge of the lake. Sgt. Rick and the other exhausted travelers anticipate a rescue balloon. Oliver gazes down at Alex. A traveler deploys a signal flare. The balloon floats overhead. Oliver proceeds with his chronicle. A stranger is perched next to Oliver on the train seat. Oliver clutches two snow cones in his hands as he is transported on a mobile cot. Oliver's knee protrudes and is wrapped. Oliver, lying on his side, is transported to his cot. Oliver glances at Sgt. Rick reclining on the cot. Oliver offers a snow cone to Sgt. Rick. Sgt. Rick, irritated, takes the snow cone and tosses it into his water pitcher. Oliver shifts onto his cot. A doctor reaches toward Sgt. Rick. The female doctor places Sgt. Rick's fingers on a trapeze bar, then lifts Sgt. Rick, whose feet have been removed. Another doctor maneuvers the mobile cot beneath Sgt. Rick. The female doctor positions Sgt. Rick on the mobile cot. A traveler announces the titles from a stack of scrolls. Oliver glances up at Sgt. Rick as he is moved away. The traveler presents Oliver with a towering stack of scrolls. Oliver gazes down at the stack of scrolls."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Forrest sets Tex by a riverbank and rushes back into the jungle to rescue more wounded soldiers. After carrying and dropping Lt. Dan with the others, despite Lt. Dan's protests and gunfire at unseen enemies, Forrest continues searching for Bubba. Finding Bubba severely injured, Forrest carries him as planes drop napalm, engulfing the jungle in flames. Reaching the riverbank, they await rescue. Later, Forrest, with bandaged wounds, is seen with ice cream cones and offers one to Lt. Dan, who dismissively drops it in his bedpan. Nurses assist Lt. Dan, whose legs are amputated, onto a rolling bed. Forrest receives a stack of letters as he watches Lt. Dan being wheeled away."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Forrest looks down at the pile of letters The soldier hands Forrest a large pile of letters  Forrest looks up at Lt Dan as he is wheeled away  A soldier reads the names from a pile of letters  The male nurse sets Lt Dan down on the rolling bed  Another nurse wheels the rolling bed under Lt Dan  The male nurse places Lt Dan's hands on a pullup bar then picks up Lt Dan whose legs have been amputated  A nurse reaches toward Lt Dan  Forrest slides himself onto his bed  Lt Dan annoyed takes the ice cream cone and drops it into his bedpan  Forrest holds out an ice cream cone for Lt Dan  Forrest looks at Lt Dan lying on the bed  Forrest lying on his stomach is wheeled to his bed  Forrest's butt sticks up and is bandaged  Forrest holds two ice cream cones in his hands as he is wheeled on a rolling stretcher  A man is sitting next to Forrest on the bus bench  Forrest continues with his life story  The helicopter flies overhead  A soldier releases a smoke canister  Forrest looks down at Bubba  Lt Dan and the other wounded soldiers wait for a rescue helicopter  Forrest carries Bubba to the bank of the river  The entire jungle area is in flames as Forrest runs  The fireballs explode behind him  Forrest runs carrying Bubba  They fire napalm as the jungle explodes with massive fireballs  Three planes dive down toward the jungle  Forrest looks up in fear  The roar of approaching planes is deafening  The sound of approaching planes fills the air  Forrest carries Bubba through the jungle  Forrest looks around as he hears the voices of the enemy  Bubba's chest has been blown open  Forrest removes the frond to look at the wound  Bubba holds a palm frond over his wound  Bubba looks up as he lies on the ground  Forrest slows down and looks around carefully  Forrest runs through the jungle searching for Bubba  angry Forrest gets up and runs as Lt Dan yells after him  Lt Dan grabs Forrest by the shirt  Forrest drops Lt Dan down at the bank next to the other wounded soldiers  Lt Dan fires his pistol at the unseen enemy as Forrest pulls him away  Forrest gets up as Lt Dan yells  Forrest falls down  Forrest pulls Lt Dan over his shoulder and runs through the jungle  It is Dallas  Forrest grabs the third wounded soldier up from the ground and turns him over  Forrest drops another wounded soldier down at the bank of the river next to Tex and then runs back toward the jungle  He sets Tex down on the bank of a river and runs back into the jungle "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "A soldier releases a smoke canister  Three planes dive down toward the jungle  Bubba looks up as he lies on the ground  Lt Dan grabs Forrest by the shirt  The sound of approaching planes fills the air  Lt Dan and the other wounded soldiers wait for a rescue helicopter  Forrest drops another wounded soldier down at the bank of the river next to Tex and then runs back toward the jungle  He sets Tex down on the bank of a river and runs back into the jungle  Forrest removes the frond to look at the wound  It is Dallas  Forrest carries Bubba to the bank of the river  angry Forrest gets up and runs as Lt Dan yells after him  Forrest looks at Lt Dan lying on the bed  Forrest looks up in fear  Bubba's chest has been blown open  Forrest looks down at the pile of letters The soldier hands Forrest a large pile of letters  Forrest looks around as he hears the voices of the enemy  Forrest looks up at Lt Dan as he is wheeled away  A nurse reaches toward Lt Dan  Forrest looks down at Bubba  The helicopter flies overhead  The male nurse places Lt Dan's hands on a pullup bar then picks up Lt Dan whose legs have been amputated  The fireballs explode behind him  A man is sitting next to Forrest on the bus bench  Forrest runs through the jungle searching for Bubba  The entire jungle area is in flames as Forrest runs  The roar of approaching planes is deafening  Forrest continues with his life story  Forrest drops Lt Dan down at the bank next to the other wounded soldiers  Forrest holds out an ice cream cone for Lt Dan  Forrest gets up as Lt Dan yells  The male nurse sets Lt Dan down on the rolling bed  A soldier reads the names from a pile of letters  Another nurse wheels the rolling bed under Lt Dan  Bubba holds a palm frond over his wound  Forrest grabs the third wounded soldier up from the ground and turns him over  Forrest pulls Lt Dan over his shoulder and runs through the jungle  Forrest slows down and looks around carefully  Forrest lying on his stomach is wheeled to his bed  They fire napalm as the jungle explodes with massive fireballs  Lt Dan annoyed takes the ice cream cone and drops it into his bedpan  Forrest slides himself onto his bed  Forrest carries Bubba through the jungle  Forrest's butt sticks up and is bandaged  Forrest falls down  Forrest runs carrying Bubba  Lt Dan fires his pistol at the unseen enemy as Forrest pulls him away  Forrest holds two ice cream cones in his hands as he is wheeled on a rolling stretcher "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "The fireballs explode behind him  The entire jungle area is in flames as Forrest runs  Forrest carries Bubba to the bank of the river  Lt Dan and the other wounded soldiers wait for a rescue helicopter  Forrest looks down at Bubba  A soldier releases a smoke canister  The helicopter flies overhead  Forrest continues with his life story  A man is sitting next to Forrest on the bus bench  Forrest holds two ice cream cones in his hands as he is wheeled on a rolling stretcher  Forrest's butt sticks up and is bandaged  Forrest lying on his stomach is wheeled to his bed  Forrest looks at Lt Dan lying on the bed  Forrest holds out an ice cream cone for Lt Dan  Lt Dan annoyed takes the ice cream cone and drops it into his bedpan  Forrest slides himself onto his bed  A nurse reaches toward Lt Dan  The male nurse places Lt Dan's hands on a pullup bar then picks up Lt Dan whose legs have been amputated  Another nurse wheels the rolling bed under Lt Dan  The male nurse sets Lt Dan down on the rolling bed  A soldier reads the names from a pile of letters  Forrest looks up at Lt Dan as he is wheeled away  The soldier hands Forrest a large pile of letters  Forrest looks down at the pile of letters He sets Tex down on the bank of a river and runs back into the jungle  Forrest drops another wounded soldier down at the bank of the river next to Tex and then runs back toward the jungle  Forrest grabs the third wounded soldier up from the ground and turns him over  It is Dallas  Forrest pulls Lt Dan over his shoulder and runs through the jungle  Forrest falls down  Forrest gets up as Lt Dan yells  Lt Dan fires his pistol at the unseen enemy as Forrest pulls him away  Forrest drops Lt Dan down at the bank next to the other wounded soldiers  Lt Dan grabs Forrest by the shirt  angry Forrest gets up and runs as Lt Dan yells after him  Forrest runs through the jungle searching for Bubba  Forrest slows down and looks around carefully  Bubba looks up as he lies on the ground  Bubba holds a palm frond over his wound  Forrest removes the frond to look at the wound  Bubba's chest has been blown open  Forrest looks around as he hears the voices of the enemy  Forrest carries Bubba through the jungle  The sound of approaching planes fills the air  The roar of approaching planes is deafening  Forrest looks up in fear  Three planes dive down toward the jungle  They fire napalm as the jungle explodes with massive fireballs  Forrest runs carrying Bubba "
        }
      ]
    }
  ]
}