{
  "ground_truth": "David averts his gaze, his lips parted, then shifts his eyes and shrugs. Charlie glances away and eyes David, who presses his lips in a disappointed line. Our view then hovers above a stately, high-ceilinged reading room, where a center aisle separates dozens of large tables arranged perpendicularly to it. The mustached adjustment officer sits at one table with his hands folded, and as men quietly work at other tables around him, some writing in slim books of their own, he shifts his contemplative eyes, then rises and walks down the aisle. Next, rain falls on the sidewalk in front of a ragtag neighborhood bar; inside, David sits at the bar writing multiple iterations of Elise's phone number on a napkin. The mustached officer sits beside him, and David glances down, shifting his jaw and glaring indignantly at Harry, who glances skyward, then over his shoulder, and lays a ticket on the bar. As Harry stands, David takes the ticket, and Harry dons his newsboy cap and leaves. David stares contemplatively at the ticket. On a ferry, passengers ride inside a covered seating area, and a couple at the handrail gaze out at the city skyline. David finds Harry leaning against the railing at the boat's stern, gives a nod, and gazes at the city. David then heads down a crowded sidewalk and as he walks amid the flowing pedestrians, the screen fades to black. David lies on his back in bed and gazes out a window with a faraway look, sunlight bathing his face as he rests his hands on his stomach. Shifting his gaze to the clock on his bedside table, he reaches over and turns off the alarm, then drops his head back on the pillow, his chest heaving. Our view sweeps down the front of his towering apartment building as David exits, briefcase in hand, and starts down the sidewalk. In Madison Square Park, dead leaves litter the ground, and David makes his way across, then waits at his bus stop. An M6 pulls up and he climbs aboard, sliding his pass through the reader and pausing in the aisle, his hopeful eyes finding the empty pair of seats occupied three years earlier by Elise. He heads to them and sits as the bus pulls away from the curb. Outside, sunlight yawns across the side of a high-rise, and David gazes out his window at a passing scaffold creating a canopied sidewalk by a construction site. A short distance ahead, he notices a dark-haired woman striding down the sidewalk. As the bus cruises past, he sees that it's Elise; Elise turns down a street behind the bus as it pulls over, and David hurries off and races back up the sidewalk after her.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "David diverts his eyes, his mouth open, then moves his eyes and shrugs. Charlie peeks away and observes David, who presses his mouth in a disappointed line. Our view then drifts above a grand, high-ceilinged library room, where a central passage divides dozens of large desks positioned perpendicularly to it. The mustached adjustment officer sits at one desk with his hands clasped, and as men quietly work at other desks around him, some writing in slim books of their own, he moves his thoughtful eyes, then rises and walks down the passage. Next, rain falls on the pavement in front of a dilapidated neighborhood tavern; inside, David sits at the counter writing multiple versions of Elise's phone number on a napkin. The mustached officer sits beside him, and David peers down, shifting his jaw and glowering indignantly at Harry, who looks upward, then over his shoulder, and places a ticket on the counter. As Harry stands, David takes the ticket, and Harry puts on his newsboy cap and departs. David stares thoughtfully at the ticket. On a ferry, passengers ride inside a covered seating area, and a pair at the handrail gaze out at the city skyline. David finds Harry leaning against the railing at the boat's stern, gives a nod, and gazes at the city. David then heads down a crowded pavement and as he walks amid the flowing pedestrians, the screen dissolves to black. David lies on his back in bed and gazes out a window with a distant look, sunlight bathing his face as he rests his hands on his stomach. Moving his gaze to the clock on his bedside table, he reaches over and turns off the alarm, then drops his head back on the pillow, his chest heaving. Our view sweeps down the front of his towering apartment building as David exits, briefcase in hand, and starts down the pavement. In Madison Square Park, dead leaves scatter the ground, and David makes his way across, then waits at his bus stop. An M6 arrives and he climbs aboard, sliding his pass through the reader and pausing in the passageway, his hopeful eyes finding the vacant pair of seats occupied three years earlier by Elise. He heads to them and sits as the bus pulls away from the sidewalk. Outside, sunlight stretches across the side of a high-rise, and David gazes out his window at a passing scaffold creating a canopied pavement by a construction site. A short distance ahead, he notices a dark-haired woman striding down the pavement. As the bus cruises past, he sees that it's Elise; Elise turns down a street behind the bus as it halts, and David hurries off and races back up the pavement after her."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Gazes are averted by David, his lips parted, then his eyes are shifted and a shrug is given by him. Away is glanced by Charlie who then eyes David, whose lips are pressed in a disappointed line. Our view then is hovered above by us, above a stately, high-ceilinged reading room, where dozens of large tables are separated by a center aisle, and these tables are arranged perpendicularly to it. At one table, the mustached adjustment officer sits with his hands folded, and as quiet work is done by men at other tables around him, some writing in slim books of their own, contemplative eyes are shifted by him, then he rises and the aisle is walked down by him. Next, rain is made to fall on the sidewalk in front of a ragtag neighborhood bar; inside, David is found sitting at the bar writing multiple iterations of Elise's phone number on a napkin. Beside him sits the mustached officer, and David's gaze is glanced down, his jaw is shifted and Harry is glared at indignantly by him, who skyward glances, then his shoulder is looked over, and a ticket is laid on the bar. As Harry stands, the ticket is taken by David, and Harry dons his newsboy cap and makes his departure. Contemplatively, the ticket is stared at by David. Inside a covered seating area on a ferry, passengers are ridden by, and out at the city skyline, a couple at the handrail gazes. Harry is found by David leaning against the railing at the boat's stern, and a nod is given by David, and at the city, he gazes. David then is seen heading down a crowded sidewalk and as he is walked amid by the flowing pedestrians, blackness fades the screen to. On his back in bed lies David and out a window, he gazes with a faraway look, his face being bathed by sunlight as his hands are rested on his stomach. The clock on his bedside table is shifted to by his gaze, over it is reached and the alarm is turned off by him, then his head is dropped back on the pillow, and his chest heaves. Down the front of his towering apartment building, our view is swept as the exit is made by David, briefcase in hand, and down the sidewalk, he starts. In Madison Square Park, the ground is littered with dead leaves, and across it, David makes his way, then at his bus stop, he waits. An M6 is pulled up and aboard he climbs, his pass being slid through the reader and a pause is made in the aisle, by his hopeful eyes finding the empty pair of seats that three years earlier were occupied by Elise. To them, he heads and sits as the bus is pulled away from the curb. Outside, across the side of a high-rise, sunlight is yawned, and out his window, David gazes at a passing scaffold creating a canopied sidewalk by a construction site. A dark-haired woman striding down the sidewalk is noticed a short distance ahead by him. As past it cruises the bus, Elise is seen by him; down a street behind the bus, Elise is turned as over it pulls, and after her, the sidewalk is raced back up by David hurrying off."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "David averts his gaze and shrugs, while Charlie, glancing away, eyes him. Our view shifts to a stately reading room with large tables arranged perpendicularly around a central aisle. A mustached adjustment officer sits with folded hands, watching men write in slim books. He rises and walks down the aisle. In a ragtag bar, rain falls outside; inside, David writes Elise's phone number on a napkin. The mustached officer joins him, and David glares indignantly at Harry, who glances skyward before laying a ticket on the bar. Harry leaves, and David stares at the ticket. On a ferry, David meets Harry at the stern and nods at the city skyline. David walks down a crowded sidewalk, the screen fading to black. In bed, he gazes out a window, sunlight on his face, then turns off his alarm. The view sweeps down his apartment building as he exits with a briefcase, crossing Madison Square Park to his bus stop. An M6 arrives, and he boards, pausing to look at the seats once occupied by Elise. He sits as the bus departs, gazing at a scaffold-covered sidewalk. He spots a dark-haired woman on the sidewalk and realizes it's Elise. As the bus stops, he races after her."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "David averts his gaze, shrugs as Charlie watches, and presses his lips in disappointment. The scene shifts to a grand reading room with tables split by a central aisle. A mustached officer sits, observes, then walks the aisle. Rain falls by a bar where David writes Elise's number on a napkin. The officer joins him, and David, glancing indignantly, accepts a ticket from Harry, who leaves. On a ferry, David finds Harry at the stern, nodding as they gaze at the city. David walks a crowded sidewalk, the screen fades. Lying in bed, he turns off the alarm, then exits his apartment with a briefcase. In Madison Square Park, he boards an M6, recalling Elise who sat there three years ago. Noticing a woman down the sidewalk, he realizes it’s Elise, jumps off the bus, and races after her."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "David's gaze shifts away, his lips slightly parted, before he redirects his eyes and gives a nonchalant shrug. Charlie momentarily looks away but soon turns his eyes back to David, who responds by pressing his lips together in a line that unmistakably conveys disappointment. Our perspective then ascends to reveal a grand, high-ceilinged reading room, where a central aisle elegantly divides numerous large tables that are meticulously arranged perpendicular to its path. The mustached adjustment officer is seated at one of these tables, his hands resting calmly folded, as men quietly engage in their own tasks at surrounding tables, some immersed in writing within their slender personal books. The officer eventually shifts his thoughtful eyes, rises from his seat, and proceeds to walk with purpose down the aisle. Subsequently, rain gently begins to fall, dotting the sidewalk in front of a modest, ragtag neighborhood bar; inside, David is seated at the bar, diligently scribbling several iterations of Elise's phone number on a napkin. The mustached officer finds a seat beside him, prompting David to glance downward, clenching his jaw in defiance and casting an indignant glare at Harry, who, in response, glances skyward and then over his shoulder, methodically placing a ticket on the bar. As Harry stands to depart, David grasps the ticket, while Harry adjusts his newsboy cap and leaves the scene. David remains behind, thoughtfully staring at the now-acquired ticket. \n\nOn a ferry, passengers settle comfortably inside a covered seating area, while a couple stands at the handrail, gazing out at the sprawling city skyline. David soon discovers Harry leaning casually against the railing at the rear of the boat, gives a nod of acknowledgment, and allows his gaze to drift toward the cityscape. Afterwards, David proceeds along a bustling sidewalk and, as he moves fluidly through the crowd of pedestrians, the screen gradually fades to black. \n\nAs the scene shifts, David is shown lying on his back in bed, his eyes fixed on the window with a distant expression, sunlight streaming across his face as he rests his hands on his stomach. He shifts his focus momentarily to the clock on his bedside table, reaches out to switch off the alarm, and then lets his head drop back onto the pillow, his chest rising and falling with a deep breath. Our view then glides down the front facade of his towering apartment building as David exits, briefcase in hand, and begins his walk down the sidewalk. In Madison Square Park, dead leaves carpet the ground, adding a touch of autumn to his path, as David makes his way across and patiently waits at his bus stop. The M6 bus approaches, and David climbs aboard, sliding his bus pass through the reader and pausing in the aisle, his hopeful eyes seeking the emptiness of the pair of seats that Elise occupied three years prior. He approaches them, takes a seat, and as the bus pulls away from the curb, he continues to reflect. Outside the window, sunlight stretches languidly across the side of a high-rise building, while David gazes pensively out at the passing scaffold that forms a sheltered walkway alongside a construction site. A short distance ahead, his attention is caught by a dark-haired woman striding purposefully down the sidewalk. As the bus cruises past, he realizes the woman is Elise; she turns down a street just behind the bus as it pulls over, prompting David to hastily disembark and sprint back up the sidewalk in pursuit."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "David's gaze drifts away, his lips part slightly, for a moment, before he redirects his eyes and gives a casual, seemingly indifferent shrug. Charlie glances away temporarily, but soon he turns his eyes back toward David, who reacts by pressing his lips together in a firm line that unmistakably conveys a sense of disappointment. Our perspective then ascends, offering a broader view to reveal an expansive, high-ceilinged reading room. In this grand space, a central aisle elegantly divides numerous large tables, which are meticulously arranged in a perpendicular manner to its path. The mustached adjustment officer sits at one of these tables, his hands resting calmly folded and composed, as men quietly engage in their own tasks at the surrounding tables, some deeply absorbed in writing within their slender personal books. Eventually, the officer shifts his thoughtful eyes, rises with intention from his seat, and proceeds to walk with purpose down the aisle. Subsequently, rain begins to gently fall, creating sporadic dots on the sidewalk in front of a modest, ragtag neighborhood bar. Inside, David is seated at the bar, diligent in his task of scribbling several iterations of Elise's phone number on a napkin. The mustached officer finds a seat beside him, an action that prompts David to glance downward, clenching his jaw in defiance while casting an indignant glare at Harry. In response, Harry glances skyward, then over his shoulder, before methodically placing a ticket on the bar. As Harry stands to depart, David reaches out to grasp the ticket, while Harry adjusts his newsboy cap and leaves the scene. David remains behind, thoughtfully and pensively staring at the ticket he has now acquired.\n\nOn a ferry, passengers are settled comfortably inside a covered seating area, while a couple stands at the handrail, looking out at the expansive city skyline that sprawls across the horizon. David soon discovers Harry, who is leaning casually against the railing at the rear of the boat, gives a nod of acknowledgment, and allows his gaze to wander toward the sweeping cityscape. Afterwards, David proceeds along a bustling sidewalk, moving fluidly through the crowd of pedestrians, and as he does so, the screen gradually fades to black.\n\nAs the scene transitions, David is shown lying on his back in bed, his eyes fixed on the window with a distant, contemplative expression. Sunlight streams across his face, casting gentle patterns as it moves, while he rests his hands comfortably on his stomach. He shifts his focus momentarily to the clock on his bedside table, reaches out to switch off the alarm, and then lets his head fall back heavily onto the pillow, his chest rising and falling with a deep, soothing breath. Our view then glides smoothly down the front facade of his towering apartment building as David exits, briefcase in hand, and begins his walk down the sidewalk. In Madison Square Park, dead leaves form a carpet on the ground, adding a crisp touch of autumn to his path, as David makes his way across it and patiently waits at his bus stop. The M6 bus approaches, and David climbs aboard, sliding his bus pass through the reader and pausing in the aisle, his hopeful eyes searching for the emptiness of the pair of seats that Elise occupied three years prior. He approaches them, takes a seat, and as the bus moves away from the curb, he continues his reflections. Outside the window, sunlight stretches languidly across the side of a high-rise building, while David gazes pensively out at the passing scaffold that forms a sheltered walkway alongside a construction site. A short distance ahead, his attention is captured by a dark-haired woman striding purposefully down the sidewalk. As the bus cruises past, realization dawns that the woman is Elise; she turns down a street just behind the bus as it pulls over, prompting David to hastily disembark and sprint back up the sidewalk in pursuit."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "David initially diverts his eyes away, his lips slightly parted as if forming unspoken words, and just when he shifts his gaze back, his shoulders lift in a nonchalant shrug. Meanwhile, Charlie looks away momentarily before directing his eyes toward David once more, observing as David's facial expression changes, his lips pressed tightly into a line that conveys disappointment. Our viewpoint then transitions to an aerial perspective above a grand reading room characterized by its high ceiling, where we see a central aisle flanked by several long tables positioned at right angles to it. The focus moves to a mustached adjustment officer seated at one of these tables, his hands lying still and folded, while other men around him engage in their quiet tasks, some engrossed in their slim personal books. The officer, deep in contemplation, shifts his gaze thoughtfully before deciding to stand up, leisurely making his way down the central aisle. In the next scene, raindrops patter on the pavement outside a run-down neighborhood bar, setting a somber mood. Inside, David is perched at the bar scribbling various combinations of Elise's phone number onto a napkin. The mustached officer joins the scene, taking a seat beside David, who casts a sidelong glance downward, his jaw shifting as he shoots a defiant glare toward Harry. Harry's eyes travel upward to the ceiling before he glances back over his shoulder, reaching out to place a ticket on the bar counter. As Harry stands to leave, David picks up the ticket, while Harry, now adorned with a newsboy cap, exits the establishment. David lingers, examining the ticket with a pensive expression. The setting then shifts to the interior of a ferry, where passengers occupy a covered seating area, and a couple stands at the handrail, their gaze fixed on the unfolding city skyline. Within this scene, David discovers Harry positioned at the stern, leaning against the railing. Acknowledging Harry with a nod, David shifts his focus to the panoramic view of the city. Subsequently, David navigates through a throng of pedestrians on a bustling sidewalk, and as he moves through the human tide, the screen fades to black. The next moment reveals David lying on his back in bed, gazing out of the window with a distant, introspective expression, as soft sunlight floods over his face. His hands rest on his stomach, and after a moment, he turns his head to check the time on his bedside clock, reaching over to silence the alarm before allowing his head to fall back on the pillow, his chest rising and falling with each breath. The scene transitions as our perspective descends the façade of his towering apartment building, capturing the moment David exits, briefcase in hand, and begins his walk down the sidewalk. He traverses Madison Square Park, where scattered, dead leaves cover the ground, and eventually arrives at his bus stop. As the M6 bus halts in front of him, David boards, sliding his pass through the reader with ease. He pauses in the aisle, his eyes filled with hope as they land on the pair of seats that Elise had occupied three years earlier. He makes his way to these seats and settles in as the bus resumes its journey, pulling away from the curb. Outside, sunlight casts its warm embrace against the side of a high-rise building, while David gazes through his window at a scaffold forming an awning over the sidewalk beside a construction site. In the distance, he notices a woman with dark hair walking purposefully along the sidewalk. As the bus draws nearer, David recognizes Elise, who turns and disappears down a street behind the moving bus. Acting quickly, David leaps from his seat, disembarks, and sprints back along the sidewalk in a determined attempt to catch up with her."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "David initially avoids eye contact with Charlie, expressing disappointment with a shrug, as Charlie briefly glances at him. The scene transitions to a view above a grand reading room, where a mustached adjustment officer sits contemplatively at a table among others working quietly. He soon rises and walks down the central aisle. In a shift to a rainy street outside a dilapidated bar, we find David inside repeatedly writing Elise's phone number on a napkin. The mustached officer joins him, and after a brief interaction, leaves a ticket before departing. David studies the ticket thoughtfully.\n\nOn a ferry, passengers enjoy the city skyline; David finds Harry at the stern, acknowledges him, and observes the view. Later, David walks through a bustling sidewalk that fades to black. He is next seen lying in bed, contemplating the window view, bathed in sunlight. After turning off his alarm, he leaves his apartment with a briefcase. David crosses Madison Square Park, waits at a bus stop, and boards an M6. His hopeful gaze lands on seats once occupied by Elise. He sits down as the bus departs, observing a construction site through the window, until he spots Elise walking on the sidewalk. Seizing the moment, David quickly exits the bus and hurries after her as she turns a corner."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "David averts his gaze, his lips parted, then shifts his eyes and shrugs. Charlie glances away and eyes David, who presses his lips in a disappointed line suggestive of recent unresolved tensions. Our view then hovers above a stately, high-ceilinged reading room reminiscent of the grand reading room at the New York Public Library, where a center aisle separates dozens of large tables arranged perpendicularly to it. The mustached adjustment officer, who has a reputation for thoroughness, sits at one table with his hands folded, and as men quietly work at other tables around him, some writing in slim books of their own that recall the journals kept by early 20th-century explorers, he shifts his contemplative eyes, then rises and walks down the aisle. Next, rain falls on the sidewalk in front of a ragtag neighborhood bar, a favorite haunt of the city's bohemian crowd; inside, David sits at the bar writing multiple iterations of Elise's phone number on a napkin. The mustached officer sits beside him, and David glances down, shifting his jaw and glaring indignantly at Harry, who glances skyward, as if seeking divine inspiration, then over his shoulder, and lays a ticket on the bar. As Harry stands, David takes the ticket, which signifies an unresolved obligation, and Harry dons his newsboy cap, evocative of 1920s street fashion, and leaves. David stares contemplatively at the ticket. On a ferry, reminiscent of the iconic Staten Island ferry that offers views of New York City's skyline, passengers ride inside a covered seating area, and a couple at the handrail gaze out at the city skyline. David finds Harry leaning against the railing at the boat's stern, gives a nod, and gazes at the city, the skyscrapers rising like a concrete forest. David then heads down a crowded sidewalk, reminiscent of the bustling avenues of Manhattan, and as he walks amid the flowing pedestrians, the screen fades to black. David lies on his back in bed and gazes out a window with a faraway look, sunlight bathing his face as he rests his hands on his stomach. Shifting his gaze to the clock on his bedside table, he reaches over and turns off the alarm, then drops his head back on the pillow, his chest heaving with the weight of another unfulfilled day. Our view sweeps down the front of his towering apartment building, a modern structure dominating the skyline, as David exits, briefcase in hand, and starts down the sidewalk. In Madison Square Park, known for its historic public spaces and art installations, dead leaves litter the ground, and David makes his way across, then waits at his bus stop. An M6, a route that traverses the heart of the city, pulls up and he climbs aboard, sliding his pass through the reader and pausing in the aisle, his hopeful eyes finding the empty pair of seats occupied three years earlier by Elise. He heads to them and sits as the bus pulls away from the curb. Outside, sunlight yawns across the side of a high-rise, a common sight in the ever-evolving cityscape, and David gazes out his window at a passing scaffold creating a canopied sidewalk by a construction site, a testament to the city's constant renewal. A short distance ahead, he notices a dark-haired woman striding down the sidewalk. As the bus cruises past, he sees that it's Elise; Elise turns down a street behind the bus as it pulls over, and David hurries off and races back up the sidewalk after her."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Next rain falls on the sidewalk in front of a ragtag neighborhood bar inside sunlight yawns across the side of a highrise and David gazes out his window at a passing scaffold creating a canopied sidewalk by a construction site David averts his gaze his lips parted then shifts his eyes and shrugs The mustached adjustment officer sits at one table with his hands folded and as men quietly work at other tables around him some writing in slim books of their own he shifts his contemplative eyes then rises and walks down the aisle Charlie glances away and eyes David who presses his lips in a disappointed line Our view then hovers above a stately highceilinged reading room where a center aisle separates dozens of large tables arranged perpendicularly to it The mustached adjustment officer sits at one table with his hands folded and as men quietly work at other tables around him some writing in slim books of their own he shifts his contemplative eyes then rises and walks down the aisle David averts his gaze his lips parted then shifts his eyes and shrugs David stares contemplatively at the ticket Next rain falls on the sidewalk in front of a ragtag neighborhood bar inside David sits at the bar writing multiple iterations of Elise's phone number on a napkin The mustached officer sits beside him and David glances down shifting his jaw and glaring indignantly at Harry who glances skyward then over his shoulder and lays a ticket on the bar As the bus cruises past he sees that it is Elise As Harry stands David takes the ticket and Harry dons his newsboy cap and leaves On a ferry passengers ride inside a covered seating area and a couple at the handrail gaze out at the city skyline David stares contemplatively at the ticket On a ferry passengers ride inside a covered seating area and a couple at the handrail gaze out at the city skyline A short distance ahead he notices a darkhaired woman striding down the sidewalk David finds Harry leaning against the railing at the boat's stern gives a nod and gazes at the city David then heads down a crowded sidewalk and as he walks amid the flowing pedestrians the screen fades to black As Harry stands David takes the ticket and Harry dons his newsboy cap and leaves David lies on his back in bed and gazes out a window with a faraway look sunlight bathing his face as he rests his hands on his stomach Outside Shifting his gaze to the clock on his bedside table he reaches over and turns off the alarm then drops his head back on the pillow his chest heaving Our view sweeps down the front of his towering apartment building as David exits briefcase in hand and starts down the sidewalk In Madison Square Park dead leaves litter the ground and David makes his way across then waits at his bus stop An M6 pulls up and he climbs aboard sliding his pass through the reader and pausing in the aisle his hopeful eyes finding the empty pair of seats occupied three years earlier by Elise Our view then hovers above a stately highceilinged reading room where a center aisle separates dozens of large tables arranged perpendicularly to it The mustached officer sits beside him and David glances down shifting his jaw and glaring indignantly at Harry who glances skyward then over his shoulder and lays a ticket on the bar He heads to them and sits as the bus pulls away from the curb Outside sunlight yawns across the side of a highrise and David gazes out his window at a passing scaffold creating a canopied sidewalk by a construction site A short distance ahead he notices a darkhaired woman striding down the sidewalk As the bus cruises past he sees that it is Elise Elise turns down a street behind the bus as it pulls over and David hurries off and races back up the sidewalk after her"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "David averts his gaze his lips parted then shifts his eyes and shrugs. Charlie glances away and eyes David who presses his lips in a disappointed line. Our view then hovers above a stately highceilinged reading room where a center aisle separates dozens of large tables arranged perpendicularly to it. The mustached adjustment officer sits at one table with his hands folded and as men quietly work at other tables around him some writing in slim books of their own he shifts his contemplative eyes then rises and walks down the aisle. Next rain falls on the sidewalk in front of a ragtag neighborhood bar inside. David sits at the bar writing multiple iterations of Elise's phone number on a napkin. The mustached officer sits beside him and David glances down shifting his jaw and glaring indignantly at Harry who glances skyward then over his shoulder and lays a ticket on the bar. As Harry stands David takes the ticket and Harry dons his newsboy cap and leaves. David stares contemplatively at the ticket. On a ferry passengers ride inside a covered seating area and a couple at the handrail gaze out at the city skyline. David finds Harry leaning against the railing at the boat's stern gives a nod and gazes at the city. David then heads down a crowded sidewalk and as he walks amid the flowing pedestrians the screen fades to black. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. David lies on his back in bed and gazes out a window with a faraway look. sunlight bathing his face as he rests his hands on his stomach. Shifting his gaze to the clock on his bedside table he reaches over and turns off the alarm then drops his head back on the pillow his chest heaving. Our view sweeps down the front of his towering apartment building as David exits briefcase in hand and starts down the sidewalk. In Madison Square Park dead leaves litter the ground and David makes his way across then waits at his bus stop. An M6 pulls up and he climbs aboard sliding his pass through the reader and pausing in the aisle his hopeful eyes finding the empty pair of seats occupied three years earlier by Elise. He heads to them and sits as the bus pulls away from the curb. Outside. sunlight yawns across the side of a highrise and David gazes out his window at a passing scaffold creating a canopied sidewalk by a construction site. A short distance ahead he notices a darkhaired woman striding down the sidewalk. As the bus cruises past he sees that it is Elise. Elise turns down a street behind the bus as it pulls over and David hurries off and races back up the sidewalk after her."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "David averts his gaze his lips parted then shifts his eyes and shrugs. Charlie glances away and eyes David who presses his lips in a disappointed line. Our view then hovers above a stately highceilinged reading room where a center aisle separates dozens of large tables arranged perpendicularly to it. The mustached adjustment officer sits at one table with his hands folded and as men quietly work at other tables around him some writing in slim books of their own he shifts his contemplative eyes then rises and walks down the aisle. Next rain falls on the sidewalk in front of a ragtag neighborhood bar inside. David sits at the bar writing multiple iterations of Elise's phone number on a napkin. The mustached officer sits beside him and David glances down shifting his jaw and glaring indignantly at Harry who glances skyward then over his shoulder and lays a ticket on the bar. As Harry stands David takes the ticket and Harry dons his newsboy cap and leaves. David stares contemplatively at the ticket. On a ferry passengers ride inside a covered seating area and a couple at the handrail gaze out at the city skyline. David finds Harry leaning against the railing at the boat's stern gives a nod and gazes at the city. David then heads down a crowded sidewalk and as he walks amid the flowing pedestrians the screen fades to black. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. David lies on his back in bed and gazes out a window with a faraway look. sunlight bathing his face as he rests his hands on his stomach. Shifting his gaze to the clock on his bedside table he reaches over and turns off the alarm then drops his head back on the pillow his chest heaving. Our view sweeps down the front of his towering apartment building as David exits briefcase in hand and starts down the sidewalk. In Madison Square Park dead leaves litter the ground and David makes his way across then waits at his bus stop. An M6 pulls up and he climbs aboard sliding his pass through the reader and pausing in the aisle his hopeful eyes finding the empty pair of seats occupied three years earlier by Elise. He heads to them and sits as the bus pulls away from the curb. Outside. sunlight yawns across the side of a highrise and David gazes out his window at a passing scaffold creating a canopied sidewalk by a construction site. A short distance ahead he notices a darkhaired woman striding down the sidewalk. As the bus cruises past he sees that it is Elise. Elise turns down a street behind the bus as it pulls over and David hurries off and races back up the sidewalk after her."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "David averts his gaze his lips parted then shifts his eyes and shrugs. Charlie glances away and eyes David who presses his lips in a disappointed line. Our view then hovers above a stately highceilinged reading room where a center aisle separates dozens of large tables arranged perpendicularly to it. The mustached adjustment officer sits at one table with his hands folded and as men quietly work at other tables around him some writing in slim books of their own he shifts his contemplative eyes then rises and walks down the aisle. Next rain falls on the sidewalk in front of a ragtag neighborhood bar inside. David sits at the bar writing multiple iterations of Elise's phone number on a napkin. He heads to them and sits as the bus pulls away from the curb. Outside. sunlight yawns across the side of a highrise and David gazes out his window at a passing scaffold creating a canopied sidewalk by a construction site. A short distance ahead he notices a darkhaired woman striding down the sidewalk. As the bus cruises past he sees that it is Elise. Elise turns down a street behind the bus as it pulls over and David hurries off and races back up the sidewalk after her."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "David averts his gaze his lips parted then shifts his eyes and shrugs. Charlie glances away and eyes David who presses his lips in a disappointed line. Our view then hovers above a stately highceilinged reading room where a center aisle separates dozens of large tables arranged perpendicularly to it. As the bus cruises past he sees that it is Elise. Elise turns down a street behind the bus as it pulls over and David hurries off and races back up the sidewalk after her."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Jennifer averts her gaze, her lips parted, then shifts her eyes and shrugs. The dog glances away and eyes Jennifer, who presses her lips in a disappointed line. Our view then hovers above a stately, high-ceilinged reading room, where a center aisle separates dozens of large tables arranged perpendicularly to it. The elephant sits at one table with its hands folded, and as filmmakers quietly work at other tables around it, some writing in slim books of their own, the elephant shifts its contemplative eyes, then rises and walks down the aisle. Next, rain falls on the sidewalk in front of a ragtag neighborhood bar; inside, Jennifer sits at the bar writing multiple iterations of Elise's phone number on a napkin. The elephant sits beside her, and Jennifer glances down, shifting her jaw and glaring indignantly at the giraffe, who glances skyward, then over its shoulder, and lays a ticket on the bar. As the giraffe stands, Jennifer takes the ticket, and the giraffe dons its newsboy cap and leaves. Jennifer stares contemplatively at the ticket. On a ferry, passengers ride inside a covered seating area, and a unicorn at the handrail gazes out at the city skyline. Jennifer finds the giraffe leaning against the railing at the boat's stern, gives a nod, and gazes at the city. Jennifer then heads down a crowded sidewalk and as she walks amid the flowing pedestrians, the screen fades to black. Jennifer lies on her back in bed and gazes out a window with a faraway look, sunlight bathing her face as she rests her hands on her stomach. Shifting her gaze to the clock on her bedside table, she reaches over and turns off the alarm, then drops her head back on the pillow, her chest heaving. Our view sweeps down the front of her towering apartment building as Jennifer exits, briefcase in hand, and starts down the sidewalk. In Madison Square Park, dead leaves litter the ground, and Jennifer makes her way across, then waits at her bus stop. An M6 pulls up and she climbs aboard, sliding her pass through the reader and pausing in the aisle, her hopeful eyes finding the empty pair of seats occupied three years earlier by Elise. She heads to them and sits as the bus pulls away from the curb. Outside, sunlight yawns across the side of a high-rise, and Jennifer gazes out her window at a passing scaffold creating a canopied sidewalk by a construction site. A short distance ahead, she notices a dark-haired woman striding down the sidewalk. As the bus cruises past, she sees that it's Elise; Elise turns down a street behind the bus as it pulls over, and Jennifer hurries off and races back up the sidewalk after her."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "David averts his gaze, his lips parted, then shifts his eyes and shrugs. Charlie glances away and eyes David, who presses his lips in a disappointed line. Our view then hovers above a stately, high-ceilinged dance hall, where a center aisle separates dozens of large pianos arranged perpendicularly to it. The mustached adjustment officer sits at one piano with his hands folded, and as men quietly work at other pianos around him, some composing in slim sheets of their own, he shifts his contemplative eyes, then rises and walks down the aisle. Next, snow falls on the path in front of a ragtag neighborhood bakery; inside, David sits at the counter writing multiple iterations of Elise's phone number on a coaster. The mustached officer sits beside him, and David glances down, shifting his jaw and glaring indignantly at Harry, who glances skyward, then over his shoulder, and lays a menu on the counter. As Harry stands, David takes the menu, and Harry dons his beret and leaves. David stares contemplatively at the menu. On a cable car, passengers ride inside a covered seating area, and a couple at the railing gaze out at the mountain range. David finds Harry leaning against the railing at the car's rear, gives a nod, and gazes at the mountains. David then heads down a bustling boardwalk and as he walks amid the flowing tourists, the screen fades to black. David lies on his back in bed and gazes out a window with a faraway look, moonlight bathing his face as he rests his hands on his stomach. Shifting his gaze to the watch on his bedside table, he reaches over and turns off the lamp, then drops his head back on the pillow, his chest heaving. Our view sweeps down the front of his towering hotel building as David exits, backpack in hand, and starts down the boardwalk. In Bryant Park, paper wrappers litter the ground, and David makes his way across, then waits at his tram stop. An F14 pulls up and he climbs aboard, sliding his card through the reader and pausing in the aisle, his hopeful eyes finding the empty pair of seats occupied three years earlier by Elise. He heads to them and sits as the tram pulls away from the station. Outside, moonlight stretches across the side of a skyscraper, and David gazes out his window at a passing crane creating a canopied boardwalk by a construction site. A short distance ahead, he notices a dark-haired woman striding down the boardwalk. As the tram cruises past, he sees that it's Elise; Elise turns down a lane behind the tram as it pulls over, and David hurries off and races back up the boardwalk after her."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "David lowers his gaze, his lips tightened, then blinks his eyes and waves. Charlie swivels away and observes David, who curls his lips in a thoughtful line. Our view then drifts above a stately, high-ceilinged reading room, where a center aisle divides dozens of large tables arranged perpendicularly to it. The mustached adjustment officer reclines at one table with his hands clasped, and as men quietly sketch at other tables around him, some doodling in notebooks of their own, he narrows his contemplative eyes, then stretches and strolls down the aisle. Next, rain trickles on the sidewalk in front of a ragtag neighborhood bar; inside, David leans at the bar doodling multiple versions of Elise's phone number on a napkin. The mustached officer reclines beside him, and David glances down, twitching his jaw and nodding knowingly at Harry, who glances groundward, then over his shoulder, and places a ticket on the bar. As Harry sits, David accepts the ticket, and Harry adjusts his newsboy cap and departs. David peers thoughtfully at the ticket. On a ferry, passengers sit inside a covered seating area, and a couple at the handrail gaze out at the city skyline. David discovers Harry relaxing against the railing at the boat's stern, gives a wave, and peers at the city. David then ambles down a bustling sidewalk and as he strolls amid the flowing pedestrians, the screen fades to black. David lies on his side in bed and peers at a window with a distant look, sunlight filtering across his face as he clasps his hands on his stomach. Shifting his gaze to the clock on his bedside table, he reaches over and silences the alarm, then drops his head back on the pillow, his chest settling. Our view glides down the front of his towering apartment building as David emerges, briefcase in hand, and saunters down the sidewalk. In Madison Square Park, dead leaves scatter the ground, and David ambles across, then pauses at his bus stop. An M6 arrives and he hops aboard, inserting his pass through the reader and hesitating in the aisle, his hopeful eyes noting the empty pair of seats occupied three years earlier by Elise. He approaches them and sits as the bus glides away from the curb. Outside, sunlight stretches across the side of a high-rise, and David peers out his window at a passing scaffold creating a canopied sidewalk by a construction site. A short distance ahead, he notices a dark-haired woman sauntering down the sidewalk. As the bus cruises past, he recognizes that it's Elise; Elise turns down a street behind the bus as it halts, and David scurries off and marches back up the sidewalk after her."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Martin averts his gaze, his lips parted, then shifts his eyes and shrugs. Oliver glances away and eyes Martin, who presses his lips in a disappointed line. Our view then hovers above a bustling, high-ceilinged dining hall, where a central pathway separates dozens of large benches arranged perpendicularly to it. The bearded security officer sits at one bench with his hands folded, and as women quietly work at other benches around him, some writing in thick journals of their own, he shifts his contemplative eyes, then rises and walks down the pathway. Next, snow falls on the sidewalk in front of a vibrant neighborhood bakery; inside, Martin sits at the counter writing multiple iterations of Jasmine's address on a napkin. The bearded officer sits beside him, and Martin glances down, shifting his jaw and glaring indignantly at Jack, who glances skyward, then over his shoulder, and lays a receipt on the counter. As Jack stands, Martin takes the receipt, and Jack dons his baseball cap and leaves. Martin stares contemplatively at the receipt. On a tram, commuters ride inside a covered seating area, and a duo at the window gaze out at the mountain range. Martin finds Jack leaning against the railing at the tram's rear, gives a nod, and gazes at the mountains. Martin then heads down a bustling alleyway and as he walks amid the flowing shoppers, the screen fades to black. Martin lies on his back in bed and gazes out a skylight with a faraway look, moonlight bathing his face as he rests his hands on his chest. Shifting his gaze to the calendar on his bedside table, he reaches over and turns off the lamp, then drops his head back on the pillow, his chest heaving. Our view sweeps down the front of his towering office building as Martin exits, suitcase in hand, and starts down the alleyway. In Central Park, loose pebbles litter the ground, and Martin makes his way across, then waits at his taxi stand. A taxi pulls up and he climbs aboard, sliding his card through the reader and pausing in the aisle, his hopeful eyes finding the empty pair of seats occupied three years earlier by Jasmine. He heads to them and sits as the taxi pulls away from the curb. Outside, moonlight stretches across the side of a tower, and Martin gazes out his window at a passing crane creating a shaded walkway by a demolition site. A short distance ahead, he notices a blonde woman striding down the alleyway. As the taxi cruises past, he sees that it's Jasmine; Jasmine turns down a lane behind the taxi as it pulls over, and Martin hurries off and races back up the alleyway after her."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Michael turns his attention, his eyebrows raised, then adjusts his sightline and nods. Sam diverts his focus and observes Michael, who knits his brows in a disappointed manner. Our perspective then glides above a grand, high-ceilinged dining hall, where a center aisle divides scores of large chairs arranged perpendicularly to it. The bearded librarian reclines at one chair with his arms crossed, and as women quietly read at other chairs around him, some sketching in thin notebooks of their own, he redirects his thoughtful gaze, then stands up and meanders down the aisle. Next, snow drifts onto the pavement in front of a quaint suburban bakery; inside, Michael stands by the counter sketching multiple versions of Sarah's email address on a brochure. The bearded librarian stands beside him, and Michael peers down, flexing his jaw and scowling resolutely at George, who glances to the side, then over his shoulder and sets a card on the counter. As George sits, Michael grabs the card, and George adjusts his backpack and departs. Michael gazes pensively at the card. On a tram, travelers sit inside an enclosed dining area, and a pair at the railing admire the mountain view. Michael discovers George reclining against the railing at the vehicle's stern, gives a wave, and takes in the mountains. Michael then wanders down a bustling avenue and as he strolls amid the thronging shoppers, the scene dissolves to black. Michael reclines on his bed and looks out a window with a distant expression, moonlight illuminating his face as he rests his hands behind his head. Redirecting his focus to the clock on his nightstand, he leans over and silences the alarm, then drops his head back on the mattress, his breath slowing. Our view descends down the front of his massive office building as Michael enters, laptop in hand, and strolls down the sidewalk. In Central Park, dry petals are scattered across the earth, and Michael navigates across, then pauses at his tram stop. An M3 approaches and he hops aboard, swiping his card through the reader and pausing in the entrance, his curious gaze locating the vacant pair of seats occupied four years earlier by Sarah. He approaches them and reclines as the tram pulls away from the curb. Outside, moonlight stretches across the side of a low-rise, and Michael peers out his window at a passing crane creating a sheltered pathway by a demolition site. A short distance further, he spots a blond man sprinting up the avenue. As the tram glides past, he recognizes that it's Sarah; Sarah veers down a road behind the tram as it halts, and Michael leaps off and dashes back down the avenue after her."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "David averts his gaze, his lips zipped, then tilts his head and winks. Charlie looks away and peeks at David, who scrunches his lips in a curious line. Our view then drifts above a lavish, low-ceilinged dining room, where a central path separates dozens of tiny chairs arranged diagonally to it. The mustached fishing officer lounges at one chair with his arms crossed, and as men loudly chat at other chairs around him, some painting in thick journals of their own, he closes his imaginative eyes, then jumps and prances down the path. Next, snow drifts onto the pavement in front of a posh suburban café; inside, David stands by the counter sketching multiple versions of Elise's doodle on a placemat. The mustached officer stands beside him, and David glances up, tilting his chin and grinning mischievously at Harry, who glances downward, then under his arm, and places a badge on the counter. As Harry squats, David collects the badge, and Harry flips his bowler hat and dances out. David grins dreamily at the badge. On a tram, riders stand inside an open seating zone, and a couple at the railing squint out at the mountain skyline. David finds Harry perched against the railing at the train's caboose, gives a salute, and squints at the village. David then strolls down a deserted walkway and as he ambles amid the drifting leaves, the screen shifts to white. David lies on his side on the rug and stares at the ceiling with a dreamy look, moonlight draping his face as he rests his hands on his knees. Turning his gaze to the calendar on his bedside wall, he leans over and quiets the music, then drops his head onto the floor, his shoulders shaking. Our view ascends down the side of his towering office building as David slides out, backpack in hand, and hops up the stairs. In Broadway Park, fresh blossoms decorate the field, and David dances his way across, then waits at his taxi stand. An M6 rolls by and he hops aboard, waving his ticket in front of the driver and twirling in the aisle, his joyful eyes spotting the crowded pair of buckets occupied three years earlier by Elise. He dances to them and lounges as the taxi drives away from the pavement. Outside, moonlight leaps across the side of a skyscraper, and David peeks out his door at a passing balloon creating a floating market by a carnival. A short distance ahead, he notices a red-haired man sprinting up the road. As the taxi strolls by, he realizes it's Elise; Elise turns up an alley before the taxi as it pulls over, and David tiptoes out and skips back down the road after her."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Victor turns his head, his fingers clenched, then drops his chin and laughs. Oliver peeks upward and examines Victor, who squeezes his hands in a frustrated ball. Our perspective then floats beneath an ornate, low-ceilinged dining hall, where a side path connects dozens of tiny stools placed diagonally to it. The bespectacled harmony pilot sits at one stool with his arms crossed, and as women loudly sing at other stools around him, some doodling in thick papers of their own, he lifts his cheerful nose, then sinks and tiptoes down the path. Next, snow drifts on the rooftop behind a pristine suburban café; outside, Victor leans on the counter drawing intricate designs of Clara's silhouette on a placemat. The bespectacled pilot stands opposite him, and Victor glances up, shaking his foot and smiling warmly at George, who squints westward, then under his chair, and drops a coin on the counter. As George dances, Victor grabs the coin, and George adjusts his top hat and naps. Victor mumbles softly to the coin. On a tram, commuters stand outside an open platform, and a pair by the railing sigh at the ocean horizon. Victor locates George slumped against the bench at the vessel's prow, gives a wave, and points at the ocean. Victor then hops up a vacant staircase and as he climbs with the drifting cyclists, the display blurs to white. Victor sprawls on his side in a hammock and glances through a rooftop with a curious expression, moonlight covering his hair as he taps his knees on a cushion. Moving his head to the lamp on his table lamp, he reaches below and lights the candle, then raises his feet off the carpet, his eyes blinking. Our perspective dances over the edge of his crumbling farmhouse as Victor enters, satchel in hand, and skips up the staircase. In Lincoln Park Zoo, fresh snow covers the water, and Victor jogs his way around, then sprints at his tram station. An F3 rolls in and he leaps aboard, tossing his coin across the floor and stopping near the window, his weary ears hearing the crowded section vacated two days earlier by Clara. He drifts to them and stands as the tram slides away from the bay. Inside, moonlight skips across the front of a greenhouse, and Victor peers through his entrance at a moving trolley forming an open rooftop by a parking lot. A long distance behind, he spies a red-haired child leaping up the rooftop. As the tram tours past, he recognizes that it's Clara; Clara jumps across a path beyond the tram as it glides onward, and Victor leaps out and sprints forward down the rooftop after her."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "David looks away and shrugs as Charlie observes him, noting David's disappointment. In a large reading room, an adjustment officer sits contemplatively before walking down an aisle. Meanwhile, David writes Elise's phone number repeatedly at a bar. The officer, Harry, joins him, leaving a ticket as he departs, prompting David to reflect on the ticket's significance. On a ferry, David finds Harry at the railing, signaling acknowledgment before looking at the cityscape. Later, David, lying in bed, turns off his alarm and heads out with a briefcase. He traverses Madison Square Park, boards a bus, and yearns for the presence of Elise, who sat there three years ago. Noticing a woman on the street resembling Elise, he rushes off the bus to follow her."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Elise turns down a street behind the bus as it pulls over and David hurries off and races back up the sidewalk after her As the bus cruises past he sees that it is Elise A short distance ahead he notices a darkhaired woman striding down the sidewalk sunlight yawns across the side of a highrise and David gazes out his window at a passing scaffold creating a canopied sidewalk by a construction site Outside He heads to them and sits as the bus pulls away from the curb An M6 pulls up and he climbs aboard sliding his pass through the reader and pausing in the aisle his hopeful eyes finding the empty pair of seats occupied three years earlier by Elise In Madison Square Park dead leaves litter the ground and David makes his way across then waits at his bus stop Our view sweeps down the front of his towering apartment building as David exits briefcase in hand and starts down the sidewalk Shifting his gaze to the clock on his bedside table he reaches over and turns off the alarm then drops his head back on the pillow his chest heaving sunlight bathing his face as he rests his hands on his stomach David lies on his back in bed and gazes out a window with a faraway look David then heads down a crowded sidewalk and as he walks amid the flowing pedestrians the screen fades to black David finds Harry leaning against the railing at the boat's stern gives a nod and gazes at the city On a ferry passengers ride inside a covered seating area and a couple at the handrail gaze out at the city skyline David stares contemplatively at the ticket As Harry stands David takes the ticket and Harry dons his newsboy cap and leaves The mustached officer sits beside him and David glances down shifting his jaw and glaring indignantly at Harry who glances skyward then over his shoulder and lays a ticket on the bar David sits at the bar writing multiple iterations of Elise's phone number on a napkin Next rain falls on the sidewalk in front of a ragtag neighborhood bar inside The mustached adjustment officer sits at one table with his hands folded and as men quietly work at other tables around him some writing in slim books of their own he shifts his contemplative eyes then rises and walks down the aisle Our view then hovers above a stately highceilinged reading room where a center aisle separates dozens of large tables arranged perpendicularly to it Charlie glances away and eyes David who presses his lips in a disappointed line David averts his gaze his lips parted then shifts his eyes and shrugs"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Our view sweeps down the front of his towering apartment building as David exits briefcase in hand and starts down the sidewalk David sits at the bar writing multiple iterations of Elise's phone number on a napkin He heads to them and sits as the bus pulls away from the curb Elise turns down a street behind the bus as it pulls over and David hurries off and races back up the sidewalk after her sunlight bathing his face as he rests his hands on his stomach David finds Harry leaning against the railing at the boat's stern gives a nod and gazes at the city An M6 pulls up and he climbs aboard sliding his pass through the reader and pausing in the aisle his hopeful eyes finding the empty pair of seats occupied three years earlier by Elise David then heads down a crowded sidewalk and as he walks amid the flowing pedestrians the screen fades to black Shifting his gaze to the clock on his bedside table he reaches over and turns off the alarm then drops his head back on the pillow his chest heaving In Madison Square Park dead leaves litter the ground and David makes his way across then waits at his bus stop Charlie glances away and eyes David who presses his lips in a disappointed line David lies on his back in bed and gazes out a window with a faraway look A short distance ahead he notices a darkhaired woman striding down the sidewalk The mustached officer sits beside him and David glances down shifting his jaw and glaring indignantly at Harry who glances skyward then over his shoulder and lays a ticket on the bar On a ferry passengers ride inside a covered seating area and a couple at the handrail gaze out at the city skyline Our view then hovers above a stately highceilinged reading room where a center aisle separates dozens of large tables arranged perpendicularly to it As the bus cruises past he sees that it is Elise Next rain falls on the sidewalk in front of a ragtag neighborhood bar inside Outside As Harry stands David takes the ticket and Harry dons his newsboy cap and leaves David stares contemplatively at the ticket David averts his gaze his lips parted then shifts his eyes and shrugs The mustached adjustment officer sits at one table with his hands folded and as men quietly work at other tables around him some writing in slim books of their own he shifts his contemplative eyes then rises and walks down the aisle sunlight yawns across the side of a highrise and David gazes out his window at a passing scaffold creating a canopied sidewalk by a construction site"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "David lies on his back in bed and gazes out a window with a faraway look sunlight bathing his face as he rests his hands on his stomach Shifting his gaze to the clock on his bedside table he reaches over and turns off the alarm then drops his head back on the pillow his chest heaving Our view sweeps down the front of his towering apartment building as David exits briefcase in hand and starts down the sidewalk In Madison Square Park dead leaves litter the ground and David makes his way across then waits at his bus stop An M6 pulls up and he climbs aboard sliding his pass through the reader and pausing in the aisle his hopeful eyes finding the empty pair of seats occupied three years earlier by Elise He heads to them and sits as the bus pulls away from the curb Outside sunlight yawns across the side of a highrise and David gazes out his window at a passing scaffold creating a canopied sidewalk by a construction site A short distance ahead he notices a darkhaired woman striding down the sidewalk As the bus cruises past he sees that it is Elise Elise turns down a street behind the bus as it pulls over and David hurries off and races back up the sidewalk after her David averts his gaze his lips parted then shifts his eyes and shrugs Charlie glances away and eyes David who presses his lips in a disappointed line Our view then hovers above a stately highceilinged reading room where a center aisle separates dozens of large tables arranged perpendicularly to it The mustached adjustment officer sits at one table with his hands folded and as men quietly work at other tables around him some writing in slim books of their own he shifts his contemplative eyes then rises and walks down the aisle Next rain falls on the sidewalk in front of a ragtag neighborhood bar inside David sits at the bar writing multiple iterations of Elise's phone number on a napkin The mustached officer sits beside him and David glances down shifting his jaw and glaring indignantly at Harry who glances skyward then over his shoulder and lays a ticket on the bar As Harry stands David takes the ticket and Harry dons his newsboy cap and leaves David stares contemplatively at the ticket On a ferry passengers ride inside a covered seating area and a couple at the handrail gaze out at the city skyline David finds Harry leaning against the railing at the boat's stern gives a nod and gazes at the city David then heads down a crowded sidewalk and as he walks amid the flowing pedestrians the screen fades to black"
        }
      ]
    }
  ]
}