{
  "ground_truth": "Forrest continues to speak into the microphone as the crowd grows restless. Hilary plugs in the right patch cord, and Forrest looks at the massive crowd, who are silent. Abbie Hoffman steps over to Forrest, pats him on the shoulder, raises his fist into the air, and the crowd cheers. Abbie steps away from Forrest. Jenny wades out into the reflection pool and waves her hand into the air. Forrest recognizes her and rushes off the stage as Jenny makes her way out into the pool. Forrest jumps down into the crowd and runs. Jenny smiles as she tries to run through the water, and the crowd parts as Forrest runs into the pool. Jenny rushes toward him, and the massive crowd cheers for the embracing couple in the pool. Forrest and Jenny walk past the protesters who are camping out on the lawn. Forrest stands at an open window and looks at the White House. A Black Panther, named RUBEN, steps over and pulls the shades down. Another Black Panther named MASAI grabs Forrest and pats him down. Jenny rushes over to Forrest and pulls Forrest off Wesley. Jenny tries to help Wesley as he moans on the floor, but Wesley knocks Jenny's hand away and gets up, holding his bloody lip. Jenny steps out the door as Forrest picks up his hat, and the group of Black Panthers glare at Forrest. Forrest turns and walks out of the room as protesters hold a candlelight vigil behind them. Forrest and Jenny walk past the White House in silence. Jenny touches Forrest's uniform as she stands in the rain, hitchhiking. A car pulls over to pick her up, and Jenny and other girls get into the car. A hippie gives Jenny a sugar cube of acid as they sit in front of a roaring fire. Jenny and two other girls sing on the sidewalk and collect change from the passersby as Jenny plays the guitar. Forrest and Jenny walk through the park, and Jenny carries a backpack as she prepares to board a bus back to Berkeley. Forrest looks down at Jenny and pulls his Medal of Honor from around his neck, placing it in Jenny's hand. Jenny looks up at him, and they hug each other. Wesley waits for Jenny as she turns and walks up to him, and they walk toward the entrance of the bus. Forrest smiles as Jenny looks at him. Jenny climbs up into the bus, and Wesley glares at Forrest. Jenny, through the near window of the bus, knocks on the window. Forrest turns and looks as Jenny waves to him. Forrest looks up and smiles sadly. Jenny gives Forrest the peace sign as the bus pulls away, and Forrest gives Jenny the peace sign in return.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Forrest persists to talk into the microphone as the throng becomes impatient. Hilary connects in the correct patch cable, and Forrest glances at the enormous crowd, who are quiet. Abbie Hoffman moves over to Forrest, taps him on the shoulder, lifts his fist into the sky, and the crowd applauds. Abbie moves away from Forrest. Jenny wades out into the reflection pool and waves her hand into the air. Forrest identifies her and dashes off the platform as Jenny makes her way out into the pool. Forrest leaps down into the throng and sprints. Jenny grins as she attempts to run through the water, and the crowd parts as Forrest runs into the pool. Jenny dashes toward him, and the enormous crowd applauds for the embracing duo in the pool. Forrest and Jenny walk past the demonstrators who are camping out on the lawn. Forrest stands at an open window and gazes at the White House. A Black Panther, named RUBEN, moves over and pulls the curtains down. Another Black Panther named MASAI seizes Forrest and taps him down. Jenny rushes over to Forrest and pulls Forrest off Wesley. Jenny attempts to assist Wesley as he groans on the floor, but Wesley knocks Jenny's hand away and stands up, clutching his bloody lip. Jenny steps out the door as Forrest picks up his hat, and the group of Black Panthers glower at Forrest. Forrest turns and walks out of the room as demonstrators hold a candlelight vigil behind them. Forrest and Jenny walk past the White House in quiet. Jenny touches Forrest's uniform as she stands in the rain, hitchhiking. A vehicle pulls over to collect her, and Jenny and other girls get into the vehicle. A hippie gives Jenny a sugar cube of acid as they sit in front of a roaring fire. Jenny and two other girls sing on the pavement and collect coins from the passersby as Jenny plays the guitar. Forrest and Jenny walk through the park, and Jenny carries a backpack as she prepares to board a bus back to Berkeley. Forrest glances down at Jenny and pulls his Medal of Honor from around his neck, placing it in Jenny's hand. Jenny looks up at him, and they embrace each other. Wesley waits for Jenny as she turns and walks up to him, and they walk toward the entrance of the bus. Forrest grins as Jenny looks at him. Jenny climbs up into the bus, and Wesley glowers at Forrest. Jenny, through the near pane of the bus, knocks on the window. Forrest turns and glances as Jenny waves to him. Forrest looks up and smiles sadly. Jenny gives Forrest the peace sign as the bus pulls away, and Forrest gives Jenny the peace sign in return."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Forrest continues to speak into the microphone as the crowd is made restless. The right patch cord is plugged in by Hilary, and the massive crowd, who are silent, is looked at by Forrest. Forrest is stepped over to by Abbie Hoffman, who pats him on the shoulder, raises his fist into the air, and is cheered by the crowd. Forrest is stepped away from by Abbie. The reflection pool is waded out into by Jenny, and her hand is waved into the air. She is recognized by Forrest, and the stage is rushed off by him as Jenny makes her way out into the pool. The crowd is jumped down into by Forrest, and he is run through. Jenny smiles as the water is tried to be run through by her, and Forrest is run into the pool as the crowd parts. He is rushed toward by Jenny, and the embracing couple in the pool is cheered for by the massive crowd. Protesters, who are camping out on the lawn, are walked past by Forrest and Jenny. An open window is stood at by Forrest, and the White House is looked at by him. Ruben, a Black Panther, steps over and pulls down the shades. Forrest is grabbed and patted down by another Black Panther named MASAI. Jenny rushes over to Forrest and pulls Forrest off Wesley. Wesley moans on the floor as Jenny tries to help him, but her hand is knocked away by Wesley, and he gets up, holding his bloody lip. The door is stepped out of by Jenny as his hat is picked up by Forrest, and Forrest is glared at by the group of Black Panthers. The room is walked out of by Forrest as a candlelight vigil is held behind them by protesters. The White House is walked past in silence by Forrest and Jenny. Forrest's uniform is touched by Jenny as she stands in the rain, hitchhiking. A car pulls over to pick her up, and Jenny and other girls get into the car. Jenny is given a sugar cube of acid by a hippie as they sit in front of a roaring fire. The sidewalk is sung on by Jenny and two other girls, and change is collected from the passersby as the guitar is played by Jenny. Forrest and Jenny walk through the park, and a backpack is carried by Jenny as she prepares to board a bus back to Berkeley. Jenny is looked down at by Forrest, and his Medal of Honor is pulled from around his neck, placing it in Jenny's hand. He is looked up at by Jenny, and they hug each other. Jenny is waited for by Wesley as she turns and walks up to him, and the entrance of the bus is walked toward by them. He is smiled at by Forrest as Jenny looks at him. Jenny climbs up into the bus, and Forrest is glared at by Wesley. The near window of the bus is knocked on by Jenny. She is looked at by Forrest as she waves to him. Jenny is looked up and smiled at sadly by Forrest. The peace sign is given to Forrest by Jenny as the bus pulls away, and Jenny is given the peace sign in return by Forrest."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Forrest speaks into the microphone as the crowd grows restless. Hilary plugs in the right patch cord, and Forrest faces the silent crowd. Abbie Hoffman pats Forrest's shoulder, raises his fist, and the crowd cheers. Abbie steps away. Jenny wades into the reflection pool, waving. Forrest recognizes her, rushes off the stage, and runs through the crowd. Jenny smiles, running through the water, and the crowd parts as Forrest joins her. They embrace in the pool, cheered by the crowd. Forrest and Jenny walk past protesters camping on the lawn. Forrest stands at an open window, looking at the White House. Ruben, a Black Panther, pulls the shades down. Masai, another Panther, pats Forrest down. Jenny pulls Forrest off Wesley, who moans on the floor, then knocks Jenny's hand away, holding his bloody lip. Jenny exits as Forrest picks up his hat, and the Black Panthers glare. Forrest leaves as protesters hold a candlelight vigil. Forrest and Jenny walk past the White House silently. Jenny touches Forrest's uniform, hitchhiking in the rain. A car stops, and Jenny and others get in. A hippie gives Jenny a sugar cube of acid by a fire. Jenny and two girls sing on the sidewalk, collecting change as Jenny plays guitar. Forrest and Jenny walk through the park; Jenny carries a backpack, ready to board a bus to Berkeley. Forrest gives Jenny his Medal of Honor. They hug, and Jenny walks to Wesley, heading to the bus. Forrest smiles as Jenny looks back. She climbs into the bus, and Wesley glares at Forrest. Jenny knocks on the window, waves, and Forrest smiles sadly. They exchange peace signs as the bus departs."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Forrest speaks into the microphone as the crowd grows restless. Hilary plugs in the right cord, and the silent crowd watches. Abbie Hoffman pats Forrest, raises his fist, and the crowd cheers. Jenny wades into the reflection pool, waves, and Forrest rushes off the stage. He runs through the crowd into the pool, and they embrace as the crowd cheers. They walk past protesters camping on the lawn. Forrest looks at the White House, and Black Panther RUBEN pulls the shades down. MASAI pats Forrest down. Jenny pulls Forrest off Wesley, who moans on the floor, then knocks Jenny's hand away. Jenny leaves as Forrest picks up his hat, and Black Panthers glare at him. They walk past the White House in silence. Jenny hitchhikes in the rain, and a car picks her up. A hippie gives her acid by a fire. Jenny sings and collects change on the sidewalk. Forrest and Jenny walk through the park, and she prepares to board a bus to Berkeley. Forrest gives her his Medal of Honor, and they hug. Wesley waits for Jenny, and they walk to the bus. Jenny waves to Forrest from the bus window. Forrest smiles sadly, and they exchange peace signs as the bus departs."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Forrest continues to speak into the microphone, his voice echoing across the open space, as the crowd begins to grow increasingly restless and impatient. Meanwhile, Hilary carefully plugs in the correct patch cord, ensuring everything is set up properly. Forrest then turns his gaze toward the massive crowd, who have fallen silent in anticipation. At this moment, Abbie Hoffman steps over to Forrest, giving him a reassuring pat on the shoulder. With a spirited gesture, Abbie raises his fist into the air, prompting the crowd to erupt into cheers. After this, Abbie steps away from Forrest, leaving him to face the crowd alone. \n\nJenny, meanwhile, wades out into the reflection pool, her hand waving energetically in the air. Forrest, recognizing her instantly, rushes off the stage with urgency as Jenny continues to make her way further into the pool. Without hesitation, Forrest jumps down into the crowd and begins to run toward her. Jenny smiles brightly as she attempts to run through the water, and the crowd parts to make way for Forrest as he enters the pool. Jenny rushes toward him, and the massive crowd erupts into cheers for the couple embracing in the pool. \n\nForrest and Jenny then walk past the protesters who are camping out on the lawn, their presence a testament to the ongoing demonstrations. Forrest finds himself standing at an open window, gazing thoughtfully at the White House. A Black Panther, named RUBEN, approaches and pulls the shades down, blocking the view. Another Black Panther, named MASAI, steps forward, grabbing Forrest and patting him down. Jenny quickly rushes over to Forrest, pulling him away from Wesley. She tries to help Wesley, who is moaning on the floor, but he knocks her hand away and stands up, holding his bloody lip. Jenny steps out the door as Forrest picks up his hat, and the group of Black Panthers glare at him with suspicion. Forrest turns and walks out of the room, while protesters hold a candlelight vigil behind them. \n\nForrest and Jenny walk past the White House in silence, the weight of the moment hanging between them. Jenny touches Forrest's uniform gently as she stands in the rain, hitchhiking. A car pulls over to pick her up, and Jenny, along with other girls, gets into the vehicle. A hippie offers Jenny a sugar cube of acid as they sit in front of a roaring fire, the flames casting flickering shadows. Jenny and two other girls sing on the sidewalk, collecting change from passersby as Jenny strums the guitar. \n\nForrest and Jenny walk through the park, and Jenny carries a backpack, preparing to board a bus back to Berkeley. Forrest looks down at Jenny, and with a heartfelt gesture, he pulls his Medal of Honor from around his neck, placing it gently in Jenny's hand. Jenny looks up at him, and they share a warm embrace. Wesley waits for Jenny as she turns and walks up to him, and together they head toward the entrance of the bus. Forrest smiles as Jenny looks back at him. Jenny climbs up into the bus, and Wesley glares at Forrest with a hint of animosity. Through the near window of the bus, Jenny knocks on the glass. Forrest turns to look as Jenny waves to him. Forrest looks up, his expression tinged with sadness, and smiles. Jenny gives Forrest the peace sign as the bus begins to pull away, and Forrest returns the gesture, giving Jenny the peace sign in return."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Forrest continues to speak directly into the microphone, his voice resonating and echoing across the vast open space. Meanwhile, the crowd in front of him begins to grow increasingly restless and impatient, their murmurs creating a low hum of anticipation. At the same time, Hilary is diligently working behind the scenes, carefully plugging in the correct patch cord to ensure everything is set up properly and without a hitch. Once Forrest is confident everything is in place, he turns his gaze toward the massive crowd, who have collectively fallen silent, hanging on his every word. At this pivotal moment, Abbie Hoffman steps over to Forrest, providing him with a reassuring pat on the shoulder. With a spirited and bold gesture, Abbie raises his fist high into the air, prompting the crowd to erupt spontaneously into cheers and applause. After this energizing display, Abbie steps away from Forrest, leaving him alone to face the eagerly awaiting crowd.\n\nMeanwhile, Jenny is making her own bold move as she wades out into the reflection pool, her hand waving energetically in the air to get Forrest's attention. Forrest, recognizing her instantly despite the distance, feels an urgent need to reach her and rushes off the stage with determination and haste. As Jenny continues on her path further into the pool, Forrest, without a moment’s hesitation, jumps down into the crowd and begins to run toward her with all his might. Jenny beams with a bright smile as she attempts to run through the water toward him. The crowd, sensing the moment's significance, parts to make way for Forrest as he enters the pool. Jenny rushes toward him with open arms, and the massive crowd erupts once again into cheers for the couple, now embracing joyfully in the pool.\n\nAfter this blissful reunion, Forrest and Jenny walk past the protesters who are camping out on the lawn, a sight that serves as a testament to the ongoing demonstrations and the charged atmosphere of the time. Forrest soon finds himself standing at an open window, gazing thoughtfully at the White House in the distance. A Black Panther, named RUBEN, approaches him and decisively pulls the shades down, blocking Forrest’s view. Another Black Panther, named MASAI, steps forward, grabbing Forrest firmly and patting him down as a precaution. Jenny, sensing the tension, quickly rushes over to Forrest, pulling him away from Wesley. Despite her efforts to help Wesley, who is moaning on the floor in pain, he knocks her hand away and stands up defiantly, holding his bloody lip. Jenny then steps out the door while Forrest picks up his hat, and the group of Black Panthers glare at him suspiciously. Forrest turns and walks out of the room, while protesters outside hold a solemn candlelight vigil behind them.\n\nAs Forrest and Jenny walk past the White House in contemplative silence, the weight of the moment hangs heavily between them. Jenny reaches out and touches Forrest's uniform gently as she stands in the rain, waiting for a ride. Eventually, a car pulls over to pick her up, and Jenny, along with other girls, climbs into the vehicle. Sitting around a roaring fire, a hippie offers Jenny a sugar cube of acid as the flames cast flickering shadows around them. Later, Jenny and two other girls sing on the sidewalk, collecting change from passersby as Jenny strums the guitar, her voice mingling with the sounds of the bustling street.\n\nForrest and Jenny share a moment as they walk through the park. Jenny, her backpack slung over her shoulder, is preparing to board a bus back to Berkeley. Looking down at Jenny with a mixture of pride and sadness, Forrest makes a heartfelt gesture. He removes his Medal of Honor from around his neck and places it gently in Jenny's hand, a keepsake of their time together. Jenny looks up at Forrest, and they share a warm embrace, which conveys their deep bond. Nearby, Wesley waits for Jenny as she turns and walks up to him, and together they head toward the entrance of the waiting bus. Forrest smiles fondly as Jenny looks back at him one last time. As Jenny climbs up into the bus, Wesley glares at Forrest with a hint of animosity. From the near window of the bus, Jenny knocks on the glass, and Forrest turns to look as Jenny waves at him. With a bittersweet smile, Forrest looks up, acknowledging her gesture. Jenny gives Forrest the peace sign as the bus begins to pull away, and Forrest returns the gesture, offering Jenny the peace sign in return as she departs."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Forrest continues to speak into the microphone, his voice echoing across the open space, as the crowd before him grows increasingly restless, shifting and murmuring among themselves. Meanwhile, Hilary carefully selects the correct patch cord, ensuring it is the right one, and plugs it in with precision. Forrest, now with the microphone working properly, looks out at the massive crowd, which has fallen silent, their attention fully captured. Abbie Hoffman approaches Forrest with a confident stride, reaches out to pat him on the shoulder in a gesture of camaraderie, and then raises his fist triumphantly into the air, prompting the crowd to erupt into cheers. Abbie then steps away from Forrest, leaving him on the stage. At the same time, Jenny wades into the reflection pool, the water rippling around her legs, and waves her hand energetically into the air. Forrest, scanning the scene, recognizes her familiar figure and, filled with urgency, rushes off the stage, his feet moving quickly as Jenny continues to make her way further into the pool. Forrest leaps down into the crowd, navigating through the sea of people, and runs with determination. Jenny, her face lighting up with a smile, attempts to run through the water, her movements slowed by the resistance, while the crowd instinctively parts to create a path for Forrest as he charges into the pool. Jenny rushes toward him, her arms outstretched, and the massive crowd erupts into cheers once more, celebrating the reunion of the embracing couple in the pool. Together, Forrest and Jenny walk past the protesters who are camping out on the lawn, their presence a backdrop to the unfolding events. Forrest finds himself standing at an open window, gazing out at the iconic White House, its silhouette stark against the sky. A Black Panther named RUBEN approaches with a purposeful stride and pulls the shades down, obscuring the view. Another Black Panther, MASAI, steps forward, grabs Forrest, and conducts a quick pat-down, ensuring there are no threats. Jenny, sensing the tension, rushes over to Forrest and pulls him away from Wesley, who is on the floor moaning in pain. Jenny attempts to assist Wesley, reaching out to help, but he knocks her hand away with a dismissive gesture and struggles to his feet, holding his bloody lip as a sign of the altercation. Jenny, feeling the weight of the situation, steps out the door, and Forrest, after retrieving his hat from the floor, follows her, while the group of Black Panthers fix their glares on him, their eyes filled with suspicion. Forrest turns, his expression resolute, and walks out of the room, leaving behind the protesters who are holding a candlelight vigil, their flickering flames casting a warm glow. Forrest and Jenny walk past the White House in silence, the gravity of their surroundings palpable. Jenny, standing in the rain, reaches out to touch Forrest's uniform, her fingers brushing against the fabric as she stands by the roadside, hitchhiking. A car pulls over, its tires splashing through puddles, and Jenny, along with other girls, climbs into the vehicle, seeking refuge from the rain. Inside, a hippie offers Jenny a sugar cube of acid, which she accepts as they sit in front of a roaring fire, the flames dancing in the night. Later, Jenny and two other girls stand on the sidewalk, their voices harmonizing as they sing, and they collect change from the passersby, Jenny strumming a guitar to accompany their melody. Forrest and Jenny walk through the park, the path winding beneath their feet, and Jenny carries a backpack, her mind set on boarding a bus back to Berkeley. Forrest, feeling a surge of emotion, looks down at Jenny and, with a heartfelt gesture, pulls his Medal of Honor from around his neck, placing it gently into Jenny's hand. Jenny looks up at him, her eyes filled with gratitude, and they embrace each other tightly. Wesley waits nearby, his presence a reminder of the journey ahead, as Jenny turns and walks up to him, and together they head toward the entrance of the bus. Forrest watches, a smile playing on his lips, as Jenny looks back at him one last time. Jenny climbs up into the bus, her steps deliberate, while Wesley casts a glare in Forrest's direction. Through the near window of the bus, Jenny knocks, capturing Forrest's attention, and he turns to see her waving. Forrest looks up, his expression a mix of sadness and acceptance, and Jenny gives him the peace sign as the bus begins to pull away. In response, Forrest raises his hand, returning the peace sign, a silent farewell as the distance between them grows."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Forrest continues speaking into the microphone as the crowd grows restless. Hilary connects the right patch cord, prompting Forrest to look at the now-silent massive crowd. Abbie Hoffman approaches, pats Forrest on the shoulder, raises his fist, and the crowd cheers before Abbie steps away. Jenny wades into the reflection pool, waving, and Forrest recognizes her, rushing off the stage and into the pool as the crowd parts. Jenny smiles and runs through the water to meet him, and the crowd cheers as they embrace. They walk past protesters camping on the lawn. Later, Forrest stands at an open window looking at the White House when a Black Panther named Ruben pulls the shades down, and another, Masai, pats Forrest down. Jenny rushes over, pulling Forrest off Wesley, who moans on the floor, then knocks Jenny's hand away as he gets up with a bloody lip. Jenny exits as Forrest retrieves his hat, and the Black Panthers glare at him. Forrest leaves the room, passing protesters holding a candlelight vigil. He and Jenny walk silently past the White House. Jenny touches Forrest's uniform while hitchhiking in the rain, and a car stops to pick her up. Inside, a hippie gives her a sugar cube of acid by a roaring fire. Jenny and two other girls sing on the sidewalk, collecting change as she plays the guitar. Forrest and Jenny walk through the park, where she prepares to board a bus back to Berkeley. Forrest gives her his Medal of Honor, and they hug. Wesley waits as Jenny approaches him, and they head toward the bus entrance. Jenny climbs aboard, and Wesley glares at Forrest. Through the bus window, Jenny knocks and waves, and Forrest smiles sadly. As the bus pulls away, they exchange peace signs."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Forrest, standing on a makeshift stage in Washington D.C. during the Vietnam War protest, continues to speak into the microphone as the crowd grows restless. Hilary, known for her technical skill at large events, plugs in the right patch cord, and Forrest looks at the massive crowd gathered on the National Mall, who are silent. Abbie Hoffman, a prominent counterculture icon of the 1960s, steps over to Forrest, pats him on the shoulder, raises his fist into the air as a symbol of solidarity, and the crowd cheers. Abbie, wearing his signature colorful attire, steps away from Forrest. Jenny, wading out into the famous Reflecting Pool near the Lincoln Memorial, waves her hand into the air. Forrest, spotting her favorite white dress contrasting against the water, recognizes her and rushes off the stage as Jenny makes her way deeper into the pool. Forrest jumps down into the crowd and runs, his heart racing with excitement. Jenny smiles, her hair dampening as she tries to run through the water, and the crowd parts, allowing Forrest to run into the pool. Jenny rushes toward him, and the massive crowd, filled with anti-war demonstrators, cheers for the embracing couple in the pool. Forrest and Jenny, hand in hand, walk past the protesters who are camping out on the lawn with signs and banners. Forrest stands at an open window and looks at the White House, the symbol of executive power in the U.S. A Black Panther, an activist from the revolutionary civil rights group, named RUBEN, steps over and pulls the shades down. Another Black Panther named MASAI, known for his imposing presence, grabs Forrest and pats him down. Jenny, concerned, rushes over to Forrest and pulls Forrest off Wesley, a fellow activist embroiled in heated arguments. Jenny tries to help Wesley as he moans on the floor, but Wesley, frustrated and in pain, knocks Jenny's hand away and gets up, holding his bloody lip. Jenny steps out the door as Forrest picks up his hat, and the group of Black Panthers, who are wary of outsiders, glare at Forrest. Forrest turns and walks out of the room as protesters, in a silent demonstration, hold a candlelight vigil behind them. Forrest and Jenny walk past the White House in silence, aware of its political significance. Jenny touches Forrest's uniform, a reminder of his service in Vietnam, as she stands in the rain, hitchhiking. A car, driven by a carefree traveler of the era, pulls over to pick her up, and Jenny and other girls, seeking new horizons, get into the car. A hippie, emblematic of the 1960s counterculture, gives Jenny a sugar cube of acid as they sit in front of a roaring campfire. Jenny and two other girls, embracing a bohemian lifestyle, sing on the sidewalk and collect change from the passersby in Washington Square Park as Jenny plays the guitar. Forrest and Jenny walk through the park, and Jenny carries a backpack as she prepares to board a bus back to Berkeley, a hub of student activism and free speech. Forrest looks down at Jenny and pulls his Medal of Honor, a prestigious military award he earned for bravery, from around his neck, placing it in Jenny's hand. Jenny, touched by the gesture, looks up at him, and they hug each other. Wesley waits for Jenny as she turns and walks up to him, and they walk toward the entrance of the bus, ready to embark on a new chapter. Forrest smiles as Jenny looks at him. Jenny climbs up into the bus, and Wesley, feeling protective, glares at Forrest. Jenny, through the near window of the bus, knocks on the window with a wistful look. Forrest turns and looks as Jenny waves to him. Forrest looks up and smiles sadly, filled with a mix of emotions. Jenny gives Forrest the peace sign, a symbol of love and harmony, as the bus pulls away, and Forrest gives Jenny the peace sign in return, acknowledging their enduring connection."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Forrest continues to speak into the microphone as the crowd grows restless  Abbie steps away from Forrest  Jenny wades out into the reflection pool and waves her hand into the air  Forrest recognizes her and rushes off the stage as Jenny makes her way out into the pool  Forrest jumps down into the crowd and runs  Jenny smiles as she tries to run through the water and the crowd parts as Forrest runs into the pool  Jenny rushes toward him and the massive crowd cheers for the embracing couple in the pool  Forrest and Jenny walk past the protesters who are camping out on the lawn  Forrest stands at an open window and looks at the White House  A Black Panther named RUBEN steps over and pulls the shades down  Another Black Panther named MASAI grabs Forrest and pats him down  Jenny rushes over to Forrest and pulls Forrest off Wesley  Jenny tries to help Wesley as he moans on the floor but Wesley knocks Jenny's hand away and gets up holding his bloody lip  Jenny steps out the door as Forrest picks up his hat and the group of Black Panthers glare at Forrest  Forrest turns and walks out of the room as protesters hold a candlelight vigil behind them  Forrest and Jenny walk past the White House in silence  Jenny touches Forrest's uniform as she stands in the rain hitchhiking  Hilary plugs in the right patch cord and Forrest looks at the massive crowd who are silent  Abbie Hoffman steps over to Forrest pats him on the shoulder raises his fist into the air and the crowd cheers  Abbie steps away from Forrest  Jenny wades out into the reflection pool and waves her hand into the air  Forrest recognizes her and rushes off the stage as Jenny makes her way out into the pool  Forrest jumps down into the crowd and runs  Jenny smiles as she tries to run through the water and the crowd parts as Forrest runs into the pool  Jenny rushes toward him and the massive crowd cheers for the embracing couple in the pool  Forrest and Jenny walk past the protesters who are camping out on the lawn  Forrest stands at an open window and looks at the White House  A Black Panther named RUBEN steps over and pulls the shades down  Another Black Panther named MASAI grabs Forrest and pats him down  Jenny rushes over to Forrest and pulls Forrest off Wesley  Jenny tries to help Wesley as he moans on the floor but Wesley knocks Jenny's hand away and gets up holding his bloody lip  Jenny steps out the door as Forrest picks up his hat and the group of Black Panthers glare at Forrest  Forrest turns and walks out of the room as protesters hold a candlelight vigil behind them  Forrest and Jenny walk past the White House in silence  Jenny touches Forrest's uniform as she stands in the rain hitchhiking  A car pulls over to pick her up and Jenny and other girls get into the car  A hippie gives Jenny a sugar cube of acid as they sit in front of a roaring fire  Jenny and two other girls sing on the sidewalk and collect change from the passersby as Jenny plays the guitar  Forrest and Jenny walk through the park and Jenny carries a backpack as she prepares to board a bus back to Berkeley  Forrest looks down at Jenny and pulls his Medal of Honor from around his neck placing it in Jenny's hand  Jenny looks up at him and they hug each other  Wesley waits for Jenny as she turns and walks up to him and they walk toward the entrance of the bus  Forrest smiles as Jenny looks at him  Jenny climbs up into the bus and Wesley glares at Forrest  Jenny through the near window of the bus knocks on the window  Forrest turns and looks as Jenny waves to him  Forrest looks up and smiles sadly  Jenny gives Forrest the peace sign as the bus pulls away and Forrest gives Jenny the peace sign in return"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Forrest continues to speak into the microphone as the crowd grows restless. Hilary plugs in the right patch cord and Forrest looks at the massive crowd who are silent. Abbie Hoffman steps over to Forrest pats him on the shoulder raises his fist into the air and the crowd cheers. Abbie steps away from Forrest. Jenny wades out into the reflection pool and waves her hand into the air. Forrest recognizes her and rushes off the stage as Jenny makes her way out into the pool. Forrest jumps down into the crowd and runs. Jenny smiles as she tries to run through the water and the crowd parts as Forrest runs into the pool. Jenny rushes toward him and the massive crowd cheers for the embracing couple in the pool. Forrest and Jenny walk past the protesters who are camping out on the lawn. Forrest stands at an open window and looks at the White House. A Black Panther named RUBEN steps over and pulls the shades down. Another Black Panther named MASAI grabs Forrest and pats him down. Jenny rushes over to Forrest and pulls Forrest off Wesley. Jenny tries to help Wesley as he moans on the floor but Wesley knocks Jenny's hand away and gets up holding his bloody lip. Jenny steps out the door as Forrest picks up his hat and the group of Black Panthers glare at Forrest. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. Forrest turns and walks out of the room as protesters hold a candlelight vigil behind them. Forrest and Jenny walk past the White House in silence. Jenny touches Forrest's uniform as she stands in the rain hitchhiking. A car pulls over to pick her up and Jenny and other girls get into the car. A hippie gives Jenny a sugar cube of acid as they sit in front of a roaring fire. Jenny and two other girls sing on the sidewalk and collect change from the passersby as Jenny plays the guitar. Forrest and Jenny walk through the park and Jenny carries a backpack as she prepares to board a bus back to Berkeley. Forrest looks down at Jenny and pulls his Medal of Honor from around his neck placing it in Jenny's hand. Jenny looks up at him and they hug each other. Wesley waits for Jenny as she turns and walks up to him and they walk toward the entrance of the bus. Forrest smiles as Jenny looks at him. Jenny climbs up into the bus and Wesley glares at Forrest. Jenny through the near window of the bus knocks on the window. Forrest turns and looks as Jenny waves to him. Forrest looks up and smiles sadly. Jenny gives Forrest the peace sign as the bus pulls away and Forrest gives Jenny the peace sign in return."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Forrest continues to speak into the microphone as the crowd grows restless. Hilary plugs in the right patch cord and Forrest looks at the massive crowd who are silent. Abbie Hoffman steps over to Forrest pats him on the shoulder raises his fist into the air and the crowd cheers. Abbie steps away from Forrest. Jenny wades out into the reflection pool and waves her hand into the air. Forrest recognizes her and rushes off the stage as Jenny makes her way out into the pool. Forrest jumps down into the crowd and runs. Jenny smiles as she tries to run through the water and the crowd parts as Forrest runs into the pool. Jenny rushes toward him and the massive crowd cheers for the embracing couple in the pool. Forrest and Jenny walk past the protesters who are camping out on the lawn. Forrest stands at an open window and looks at the White House. A Black Panther named RUBEN steps over and pulls the shades down. Another Black Panther named MASAI grabs Forrest and pats him down. Jenny rushes over to Forrest and pulls Forrest off Wesley. Jenny tries to help Wesley as he moans on the floor but Wesley knocks Jenny's hand away and gets up holding his bloody lip. Jenny steps out the door as Forrest picks up his hat and the group of Black Panthers glare at Forrest. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Forrest turns and walks out of the room as protesters hold a candlelight vigil behind them. Forrest and Jenny walk past the White House in silence. Jenny touches Forrest's uniform as she stands in the rain hitchhiking. A car pulls over to pick her up and Jenny and other girls get into the car. A hippie gives Jenny a sugar cube of acid as they sit in front of a roaring fire. Jenny and two other girls sing on the sidewalk and collect change from the passersby as Jenny plays the guitar. Forrest and Jenny walk through the park and Jenny carries a backpack as she prepares to board a bus back to Berkeley. Forrest looks down at Jenny and pulls his Medal of Honor from around his neck placing it in Jenny's hand. Jenny looks up at him and they hug each other. Wesley waits for Jenny as she turns and walks up to him and they walk toward the entrance of the bus. Forrest smiles as Jenny looks at him. Jenny climbs up into the bus and Wesley glares at Forrest. Jenny through the near window of the bus knocks on the window. Forrest turns and looks as Jenny waves to him. Forrest looks up and smiles sadly. Jenny gives Forrest the peace sign as the bus pulls away and Forrest gives Jenny the peace sign in return."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Forrest continues to speak into the microphone as the crowd grows restless. Hilary plugs in the right patch cord and Forrest looks at the massive crowd who are silent. Abbie Hoffman steps over to Forrest pats him on the shoulder raises his fist into the air and the crowd cheers. Abbie steps away from Forrest. Jenny wades out into the reflection pool and waves her hand into the air. Forrest recognizes her and rushes off the stage as Jenny makes her way out into the pool. Forrest jumps down into the crowd and runs. Jenny smiles as she tries to run through the water and the crowd parts as Forrest runs into the pool. Jenny looks up at him and they hug each other. Wesley waits for Jenny as she turns and walks up to him and they walk toward the entrance of the bus. Forrest smiles as Jenny looks at him. Jenny climbs up into the bus and Wesley glares at Forrest. Jenny through the near window of the bus knocks on the window. Forrest turns and looks as Jenny waves to him. Forrest looks up and smiles sadly. Jenny gives Forrest the peace sign as the bus pulls away and Forrest gives Jenny the peace sign in return."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Forrest continues to speak into the microphone as the crowd grows restless. Hilary plugs in the right patch cord and Forrest looks at the massive crowd who are silent. Abbie Hoffman steps over to Forrest pats him on the shoulder raises his fist into the air and the crowd cheers. Abbie steps away from Forrest. Forrest turns and looks as Jenny waves to him. Forrest looks up and smiles sadly. Jenny gives Forrest the peace sign as the bus pulls away and Forrest gives Jenny the peace sign in return."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Forrest continues to speak into the microphone as the crow grows restless. A squirrel plugs in the right patch cord, and a rabbit looks at the massive crowd, who are silent. A dolphin steps over to the rabbit, pats him on the shoulder, raises her fist into the air, and the crowd cheers. The dolphin steps away from the rabbit. A penguin wades out into the reflection pool and waves his hand into the air. A turtle recognizes her and rushes off the stage as the penguin makes her way out into the pool. The turtle jumps down into the crowd and runs. The penguin smiles as she tries to run through the water, and the crowd parts as a turtle runs into the pool. A horse rushes toward him, and the massive crowd cheers for the embracing couple in the pool. A moose and a fox walk past the protesters who are camping out on the lawn. The fox stands at an open window and looks at the White House. A Black Panther, named BELLA, steps over and pulls the shades down. Another Black Panther named TONY grabs a giraffe and pats him down. An elephant rushes over to the giraffe and pulls the giraffe off a flamingo. The elephant tries to help the flamingo as he moans on the floor, but the flamingo knocks the elephant's hand away and gets up, holding his bloody lip. A hummingbird steps out the door as a parrot picks up his hat, and the group of Black Panthers glare at the parrot. A hedgehog turns and walks out of the room as protesters hold a candlelight vigil behind them. A chimpanzee and a koala walk past the White House in silence. A cat touches the koala's uniform as she stands in the rain, hitchhiking. A car pulls over to pick her up, and a duck and other girls get into the car. A grasshopper gives the duck a sugar cube of acid as they sit in front of a roaring fire. The duck and two other girls sing on the sidewalk and collect change from the passersby as the duck plays the guitar. A tiger and a lion walk through the park, and the lion carries a backpack as she prepares to board a bus back to Berkeley. A kangaroo looks down at the lion and pulls his Medal of Honor from around his neck, placing it in the lion's hand. The lion looks up at him, and they hug each other. A panda waits for the lion as he turns and walks up to him, and they walk toward the entrance of the bus. A bear smiles as the lion looks at him. The lion climbs up into the bus, and a sheep glares at the bear. The lion, through the near window of the bus, knocks on the window. The bear turns and looks as the lion waves to him. The bear looks up and smiles sadly. The lion gives the bear the peace sign as the bus pulls away, and the bear gives the lion the peace sign in return."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Forrest continues to speak into the megaphone as the crowd grows restless. Hilary plugs in the correct light bulb, and Forrest looks at the massive audience, who are silent. Abbie Hoffman steps over to Forrest, pats him on the shoulder, raises his hat into the air, and the crowd cheers. Abbie steps away from Forrest. Jenny wades out into the fountain and waves her flag into the air. Forrest recognizes her and rushes off the podium as Jenny makes her way out into the fountain. Forrest jumps down into the audience and runs. Jenny smiles as she tries to run through the fountain, and the crowd parts as Forrest runs into the fountain. Jenny rushes toward him, and the massive audience cheers for the embracing couple in the fountain. Forrest and Jenny walk past the travelers who are camping out on the grass. Forrest stands at an open door and looks at the Capitol Building. A guard, named RUBEN, steps over and pulls the curtains down. Another guard named MASAI grabs Forrest and pats him down. Jenny rushes over to Forrest and pulls Forrest off Wesley. Jenny tries to help Wesley as he moans on the carpet, but Wesley knocks Jenny's hand away and gets up, holding his bruised cheek. Jenny steps out the door as Forrest picks up his scarf, and the group of guards glare at Forrest. Forrest turns and walks out of the hallway as travelers hold a candlelight procession behind them. Forrest and Jenny walk past the Capitol Building in silence. Jenny touches Forrest's jacket as she stands in the drizzle, hitchhiking. A truck pulls over to pick her up, and Jenny and other women get into the truck. A hippie gives Jenny a graham cracker of LSD as they sit in front of a crackling fire. Jenny and two other women sing on the pier and collect change from the passersby as Jenny plays the ukulele. Forrest and Jenny walk through the garden, and Jenny carries a suitcase as she prepares to board a train back to Chicago. Forrest looks down at Jenny and pulls his Purple Heart from around his neck, placing it in Jenny's hand. Jenny looks up at him, and they hug each other. Wesley waits for Jenny as she turns and walks up to him, and they walk toward the entrance of the train. Forrest smiles as Jenny looks at him. Jenny climbs up into the train, and Wesley glares at Forrest. Jenny, through the near window of the train, knocks on the window. Forrest turns and looks as Jenny waves to him. Forrest looks up and smiles sadly. Jenny gives Forrest the thumbs up as the train pulls away, and Forrest gives Jenny the thumbs up in return."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Forrest continues to whisper into the microphone as the crowd becomes agitated. Hilary unplugs the correct patch cord, and Forrest surveys the massive crowd, who remain quiet. Abbie Hoffman strolls over to Forrest, taps him on the shoulder, lowers his fist to the ground, and the crowd murmurs. Abbie shuffles away from Forrest. Jenny meanders out into the reflection pool and twirls her hand above her head. Forrest identifies her and strolls off the stage as Jenny drifts her way out into the pool. Forrest tiptoes down into the crowd and strolls. Jenny grins as she wades through the water, and the crowd converges as Forrest strolls into the pool. Jenny saunters toward him, and the massive crowd whispers for the embracing couple in the pool. Forrest and Jenny stroll past the protesters who are lounging on the lawn. Forrest sits at an open window and peers at the White House. A Black Panther, named RUBEN, strolls over and lifts the shades up. Another Black Panther named MASAI hugs Forrest and shakes him down. Jenny ambles over to Forrest and nudges Forrest off Wesley. Jenny attempts to comfort Wesley as he groans on the floor, but Wesley swats Jenny's hand away and stands up, clutching his bruised lip. Jenny slips out the door as Forrest retrieves his hat, and the group of Black Panthers watch Forrest intently. Forrest twists and slips out of the room as protesters sing a candlelight vigil behind them. Forrest and Jenny stroll past the White House in silence. Jenny taps Forrest's uniform as she dances in the rain, hitchhiking. A car speeds over to pick her up, and Jenny and other girls hop into the car. A hippie hands Jenny a brownie as they sit in front of a blazing fire. Jenny and two other girls skip on the sidewalk and gather change from the passersby as Jenny strums the guitar. Forrest and Jenny wander through the park, and Jenny tosses a backpack as she prepares to hop onto a bus back to Berkeley. Forrest glances down at Jenny and retrieves his Medal of Honor from around his neck, dropping it in Jenny's hand. Jenny gazes up at him, and they embrace each other. Wesley watches Jenny as she spins and trots up to him, and they meander toward the entrance of the bus. Forrest grins as Jenny glances at him. Jenny skips up into the bus, and Wesley scowls at Forrest. Jenny, through the near window of the bus, taps on the window. Forrest swivels and glances as Jenny beckons to him. Forrest gazes up and sighs sadly. Jenny flashes Forrest the peace sign as the bus rolls away, and Forrest flashes Jenny the peace sign in reply."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Cameron continues to sing into the megaphone as the festival grows vibrant. Samantha connects the wrong jumper cable, and Cameron glances at the tiny festival, who are whispering. Lionel Messi strolls over to Cameron, taps him on the elbow, raises his hat into the breeze, and the festival applauds. Lionel strolls away from Cameron. Melanie paddles out into the fountain and waves her umbrella into the breeze. Cameron identifies her and dashes off the platform as Melanie makes her way into the fountain. Cameron leaps down into the festival and dashes. Melanie grins as she attempts to dash through the puddle, and the festival splits as Cameron dashes into the fountain. Melanie dashes toward him, and the tiny festival applauds for the hugging duo in the fountain. Cameron and Melanie stroll past the tourists who are picnicking on the grass. Cameron stands at a closed door and stares at the Eiffel Tower. A ballerina, named OLIVER, dances over and draws the curtains down. Another ballerina named SIMON catches Cameron and massages him down. Melanie dashes over to Cameron and pushes Cameron off David. Melanie attempts to assist David as he whimpers on the bed, but David swats Melanie's umbrella away and jumps up, clutching his bruised nose. Melanie saunters out the gate as Cameron picks up his scarf, and the troupe of ballerinas scowl at Cameron. Cameron spins and marches out of the corridor as tourists hold a shadow show behind them. Cameron and Melanie stroll past the Eiffel Tower in hush. Melanie brushes Cameron's tie as she stands in the sun, carpooling. A boat stops to scoop her up, and Melanie and other dancers leap into the boat. A sailor hands Melanie a lemon wedge of salt as they lounge in front of a crackling sea. Melanie and two other dancers hum on the staircase and gather coins from the onlookers as Melanie strums the violin. Cameron and Melanie wander through the garden, and Melanie hauls a suitcase as she gets ready to hop onto a donkey back to Boston. Cameron gazes up at Melanie and tugs his Silver Star from around his ankle, placing it in Melanie's umbrella. Melanie gazes down at him, and they squeeze each other. David lingers for Melanie as she spins and strolls up to him, and they skip toward the exit of the donkey. Cameron grins as Melanie gazes at him. Melanie clambers up onto the donkey, and David scowls at Cameron. Melanie, through the distant railing of the donkey, taps on the railing. Cameron spins and gazes as Melanie claps to him. Cameron gazes down and grins wistfully. Melanie shows Cameron the ceasefire symbol as the donkey glides away, and Cameron shows Melanie the ceasefire symbol in reply."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Raymond continues to whistle into the microphone as the orchestra grows restless. Patricia unplugs the wrong patch cord, and Raymond glances at the tiny orchestra, who are silent. George Carlin sneaks over to Raymond, taps him on the elbow, waves his hat in the air, and the orchestra applauds. George sneaks away from Raymond. Lucy swims out into the reflection pool and waves her foot into the air. Raymond notices her and strolls off the stage as Lucy makes her way out into the pool. Raymond skips down into the orchestra and jogs. Lucy laughs as she tries to jog through the water, and the orchestra parts as Raymond jogs into the pool. Lucy strolls toward him, and the tiny orchestra applauds for the dancing pair in the pool. Raymond and Lucy jog past the musicians who are jamming out on the lawn. Raymond sits at an open door and stares at the Capitol. A Beatnik, named DANNY, sneaks over and draws the curtains up. Another Beatnik named TONY nudges Raymond and hugs him down. Lucy strolls over to Raymond and nudges Raymond off Charles. Lucy tries to drag Charles as he grins on the floor, but Charles pushes Lucy's knee away and sits up, biting his bloody tongue. Lucy sneaks out the window as Raymond puts on his cap, and the group of Beatniks whisper at Raymond. Raymond spins and jogs out of the window as musicians hold a candlelight vigil next to them. Raymond and Lucy jog past the Capitol in silence. Lucy pats Raymond's hat as she walks in the drizzle, skipping. A van skids over to greet her, and Lucy and other kids leap into the van. An artist hands Lucy a popsicle of glue as they relax in front of a glowing lantern. Lucy and two other kids dance on the street and gather tokens from the passersby as Lucy strums the banjo. Raymond and Lucy jog through the square, and Lucy holds a handbag as she decides to board a train back to Boston. Raymond glances down at Lucy and removes his Badge of Courage from around his neck, placing it in Lucy's bag. Lucy gazes up at him, and they nod at each other. Charles watches for Lucy as she spins and skips up to him, and they skip toward the gate of the train. Raymond giggles as Lucy gazes at him. Lucy climbs up into the train, and Charles whispers at Raymond. Lucy, through the near window of the train, taps on the window. Raymond spins and gazes as Lucy nods to him. Raymond gazes up and giggles sadly. Lucy shows Raymond the thumbs up as the train skids away, and Raymond nods at Lucy in return."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Forrest continues to whisper into the megaphone as the parade grows animated. Hilary swaps in the left ribbon cable, and Forrest glances at the miniature parade, who are shouting. Abbie Hoffman steps beside Forrest, taps him on the elbow, lifts his leg into the air, and the parade applauds. Abbie drifts away from Forrest. Jenny paddles out into the fountain and claps her hands into the air. Forrest identifies her and leaps off the stage as Jenny glides her way into the fountain. Forrest tiptoes down into the parade and wanders. Jenny grins as she attempts to leap through the water, and the parade disperses as Forrest hops into the fountain. Jenny races toward him, and the miniature parade applauds for the hugging duo in the fountain. Forrest and Jenny skip past the tourists who are picnicking on the field. Forrest stands at an open door and peeks at the Capitol Building. A Black Panther, named RUBEN, drifts over and slides the curtains up. Another Black Panther named MASAI pulls Forrest and hugs him. Jenny dashes over to Forrest and pushes Forrest off Wesley. Jenny tries to aid Wesley as he whispers on the chair, but Wesley swats Jenny's arm away and stands up, holding his bruised nose. Jenny slips through the door as Forrest grabs his glove, and the assembly of Black Panthers scowl at Forrest. Forrest turns and tiptoes out of the hallway as tourists hold a flashlight vigil behind them. Forrest and Jenny skip past the Capitol Building in silence. Jenny brushes Forrest's jacket as she stands in the sun, skateboarding. A bicycle pulls up to drop her off, and Jenny and other girls hop onto the bicycle. A hippie hands Jenny a lemon wedge as they sit in front of a flickering lantern. Jenny and two other girls dance on the pavement and receive flowers from the passersby as Jenny plays the ukulele. Forrest and Jenny skip through the plaza, and Jenny carries a suitcase as she prepares to board a ferry back to Berkeley. Forrest glances down at Jenny and removes his Silver Star from around his wrist, placing it in Jenny's pocket. Jenny looks up at him, and they embrace each other. Wesley waits for Jenny as she turns and skips up to him, and they walk toward the entrance of the ferry. Forrest grins as Jenny glances at him. Jenny climbs up into the ferry, and Wesley scowls at Forrest. Jenny, through the close window of the ferry, taps on the pane. Forrest turns and glances as Jenny gestures to him. Forrest looks up and grins wistfully. Jenny gives Forrest a thumbs-up as the ferry sails away, and Forrest gives Jenny a thumbs-up in return."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Gwendolyn continues to whistle through the megaphone as the forest sings quietly. Oliver digs in the left plant pot, and Gwendolyn stares at the tiny ocean, which are laughing. Bertie Badger dances over to Gwendolyn, taps her on the elbow, tilts his nose to the ground, and the ocean dances. Bertie dances away from Gwendolyn. Carla tiptoes out into the puddle garden and flutters her scarf in the breeze. Gwendolyn recognizes her and hops off the tower as Carla strolls out into the meadow. Gwendolyn tumbles up into the ocean and strolls. Carla giggles as she struggles to skip through the field, and the ocean swings as Gwendolyn skips into the meadow. Carla glides toward him, and the tiny ocean dances for the laughing duo in the meadow. Gwendolyn and Carla stroll past the picnickers who are lounging on the roof. Gwendolyn sits at a closed door and glances at the Castle. A Green Knight, named BOB, prances over and opens the shutters up. Another Green Knight named SAMMY nudges Gwendolyn and shakes her down. Carla sprints over to Gwendolyn and nudges Gwendolyn off Harold. Carla pretends to assist Harold as he sings on the ceiling, but Harold pushes Carla's foot away and leaps up, fixing his broken knee. Carla slips out the window as Gwendolyn places her scarf, and the herd of Green Knights chuckle at Gwendolyn. Gwendolyn spins and dances out of the chamber as picnickers carry a lantern vigil ahead of them. Gwendolyn and Carla stroll past the Castle in music. Carla brushes Gwendolyn's bracelet as she sits in the sun, painting. A train races by to lift her up, and Carla and other boys jump into the train. A clown hands Carla a spoonful of honey as they nap in front of a whistling wave. Carla and three other boys dance on the rooftop and collect feathers from the strangers as Carla strums the banjo. Gwendolyn and Carla skip through the field, and Carla holds a suitcase as she finishes making a kite back to Paris. Gwendolyn glances up at Carla and tugs his Crown of Laurels from around his waist, giving it in Carla's shoe. Carla stares down at him, and they tickle each other. Harold yawns for Carla as she spins and skips down to him, and they skip toward the doorway of the train. Gwendolyn whistles as Carla sniffs at him. Carla leaps down into the train, and Harold laughs at Gwendolyn. Carla, through the far chimney of the train, taps on the chimney. Gwendolyn spins and cheers as Carla flutters to him. Gwendolyn stares down and whistles happily. Carla hands Gwendolyn the friendship bracelet as the train races away, and Gwendolyn hands Carla the friendship bracelet in exchange."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Forrest speaks into the microphone to a restless crowd. Hilary connects the right patch cord, and the silent crowd watches. Abbie Hoffman cheers with the crowd's applause. Jenny wades into the reflection pool, and Forrest, recognizing her, runs off the stage to join her. The crowd cheers as they embrace in the pool. Forrest and Jenny pass protesters on the lawn. Inside, Black Panthers confront Forrest, but Jenny intervenes during a scuffle with Wesley. As protesters hold a vigil, Forrest and Jenny leave the White House silently. Jenny hitchhikes in the rain, gets picked up by a car, and is offered acid by a hippie. She sings on the sidewalk for change. Later, Forrest gives Jenny his Medal of Honor as she prepares to board a bus to Berkeley. They embrace, and Jenny joins Wesley. From the bus, Jenny waves, and Forrest returns the peace sign as the bus departs."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Jenny gives Forrest the peace sign as the bus pulls away and Forrest gives Jenny the peace sign in return Forrest looks up and smiles sadly  Forrest turns and looks as Jenny waves to him  Jenny through the near window of the bus knocks on the window  Jenny climbs up into the bus and Wesley glares at Forrest  Forrest smiles as Jenny looks at him  Wesley waits for Jenny as she turns and walks up to him and they walk toward the entrance of the bus  Jenny looks up at him and they hug each other  Forrest looks down at Jenny and pulls his Medal of Honor from around his neck placing it in Jenny's hand  Forrest and Jenny walk through the park and Jenny carries a backpack as she prepares to board a bus back to Berkeley  Jenny and two other girls sing on the sidewalk and collect change from the passersby as Jenny plays the guitar  A hippie gives Jenny a sugar cube of acid as they sit in front of a roaring fire  A car pulls over to pick her up and Jenny and other girls get into the car  Jenny touches Forrest's uniform as she stands in the rain hitchhiking  Forrest and Jenny walk past the White House in silence  Forrest turns and walks out of the room as protesters hold a candlelight vigil behind them  Jenny steps out the door as Forrest picks up his hat and the group of Black Panthers glare at Forrest  Jenny tries to help Wesley as he moans on the floor but Wesley knocks Jenny's hand away and gets up holding his bloody lip  Jenny rushes over to Forrest and pulls Forrest off Wesley  Another Black Panther named MASAI grabs Forrest and pats him down  A Black Panther named RUBEN steps over and pulls the shades down  Forrest stands at an open window and looks at the White House  Forrest and Jenny walk past the protesters who are camping out on the lawn  Jenny rushes toward him and the massive crowd cheers for the embracing couple in the pool  Jenny smiles as she tries to run through the water and the crowd parts as Forrest runs into the pool  Forrest jumps down into the crowd and runs  Forrest recognizes her and rushes off the stage as Jenny makes her way out into the pool  Jenny wades out into the reflection pool and waves her hand into the air  Abbie steps away from Forrest  Abbie Hoffman steps over to Forrest pats him on the shoulder raises his fist into the air and the crowd cheers  Hilary plugs in the right patch cord and Forrest looks at the massive crowd who are silent  Forrest continues to speak into the microphone as the crowd grows restless "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Forrest looks down at Jenny and pulls his Medal of Honor from around his neck placing it in Jenny's hand  Wesley waits for Jenny as she turns and walks up to him and they walk toward the entrance of the bus  Jenny smiles as she tries to run through the water and the crowd parts as Forrest runs into the pool  Forrest and Jenny walk through the park and Jenny carries a backpack as she prepares to board a bus back to Berkeley  Jenny rushes over to Forrest and pulls Forrest off Wesley  Forrest continues to speak into the microphone as the crowd grows restless  A car pulls over to pick her up and Jenny and other girls get into the car  Jenny steps out the door as Forrest picks up his hat and the group of Black Panthers glare at Forrest  Forrest recognizes her and rushes off the stage as Jenny makes her way out into the pool  Forrest and Jenny walk past the protesters who are camping out on the lawn  Jenny through the near window of the bus knocks on the window  Jenny touches Forrest's uniform as she stands in the rain hitchhiking  Forrest and Jenny walk past the White House in silence  Jenny gives Forrest the peace sign as the bus pulls away and Forrest gives Jenny the peace sign in return Forrest turns and walks out of the room as protesters hold a candlelight vigil behind them  Jenny and two other girls sing on the sidewalk and collect change from the passersby as Jenny plays the guitar  Jenny tries to help Wesley as he moans on the floor but Wesley knocks Jenny's hand away and gets up holding his bloody lip  Hilary plugs in the right patch cord and Forrest looks at the massive crowd who are silent  Forrest turns and looks as Jenny waves to him  A hippie gives Jenny a sugar cube of acid as they sit in front of a roaring fire  A Black Panther named RUBEN steps over and pulls the shades down  Forrest smiles as Jenny looks at him  Another Black Panther named MASAI grabs Forrest and pats him down  Abbie Hoffman steps over to Forrest pats him on the shoulder raises his fist into the air and the crowd cheers  Abbie steps away from Forrest  Forrest looks up and smiles sadly  Jenny looks up at him and they hug each other  Forrest jumps down into the crowd and runs  Jenny wades out into the reflection pool and waves her hand into the air  Jenny rushes toward him and the massive crowd cheers for the embracing couple in the pool  Forrest stands at an open window and looks at the White House  Jenny climbs up into the bus and Wesley glares at Forrest "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Forrest turns and walks out of the room as protesters hold a candlelight vigil behind them  Forrest and Jenny walk past the White House in silence  Jenny touches Forrest's uniform as she stands in the rain hitchhiking  A car pulls over to pick her up and Jenny and other girls get into the car  A hippie gives Jenny a sugar cube of acid as they sit in front of a roaring fire  Jenny and two other girls sing on the sidewalk and collect change from the passersby as Jenny plays the guitar  Forrest and Jenny walk through the park and Jenny carries a backpack as she prepares to board a bus back to Berkeley  Forrest looks down at Jenny and pulls his Medal of Honor from around his neck placing it in Jenny's hand  Jenny looks up at him and they hug each other  Wesley waits for Jenny as she turns and walks up to him and they walk toward the entrance of the bus  Forrest smiles as Jenny looks at him  Jenny climbs up into the bus and Wesley glares at Forrest  Jenny through the near window of the bus knocks on the window  Forrest turns and looks as Jenny waves to him  Forrest looks up and smiles sadly  Jenny gives Forrest the peace sign as the bus pulls away and Forrest gives Jenny the peace sign in return Forrest continues to speak into the microphone as the crowd grows restless  Hilary plugs in the right patch cord and Forrest looks at the massive crowd who are silent  Abbie Hoffman steps over to Forrest pats him on the shoulder raises his fist into the air and the crowd cheers  Abbie steps away from Forrest  Jenny wades out into the reflection pool and waves her hand into the air  Forrest recognizes her and rushes off the stage as Jenny makes her way out into the pool  Forrest jumps down into the crowd and runs  Jenny smiles as she tries to run through the water and the crowd parts as Forrest runs into the pool  Jenny rushes toward him and the massive crowd cheers for the embracing couple in the pool  Forrest and Jenny walk past the protesters who are camping out on the lawn  Forrest stands at an open window and looks at the White House  A Black Panther named RUBEN steps over and pulls the shades down  Another Black Panther named MASAI grabs Forrest and pats him down  Jenny rushes over to Forrest and pulls Forrest off Wesley  Jenny tries to help Wesley as he moans on the floor but Wesley knocks Jenny's hand away and gets up holding his bloody lip  Jenny steps out the door as Forrest picks up his hat and the group of Black Panthers glare at Forrest "
        }
      ]
    }
  ]
}