{
  "ground_truth": "Benjamin turns the ship's wheel while Mike grips a cigar between his teeth. Grinning, Mike takes the helm and sharply steers the boat left. Later, Mike and Benjamin stand at the bar in a shady watering hole, where Mike sips his liquor. He removes his shirt to reveal tattoos over his torso, strikes a boxing pose showing off the tattoos, and kisses his tattooed bicep. Mike grins at Benjamin just as a bevy of prostitutes gathers on the stairs, and a beautiful woman steps forward. They climb the stairs, and the woman emerges wearily from beneath the rapidly moving covers under the sheets, after which he leaves. Benjamin then trots down the stairs and out through the back door, past two scantily clad hookers, disappearing into a crowded back alley. His father, Thomas, leaves a hooker outside an adjacent building and spots Benjamin. Thomas's motorcar pulls up beside Benjamin as he strolls down a rain-washed street. Thomas, sporting a neat mustache, opens a door to Benjamin, who climbs in, and the car pulls away as Thomas turns to regard his son and smiles. A waiter addresses them while Thomas and Benjamin sit at a table. Two whiskeys are served, and Thomas looks away as they clink glasses, smiling wryly as Benjamin sputters on the whiskey. Later, as the bar staff are clearing up, Thomas raises his glass, coughs his whiskey, and grimaces, while Benjamin slugs his whiskey. Thomas then delivers Benjamin to his front gate, where he raises his fedora and teeters towards the front door. Benjamin staggers through the darkened hallway, where Queenie stands with her arms folded, and he spasms and vomits. Daisy, now about nine years old, is woken very early by Benjamin tiptoeing into her room. She nods, joins Benjamin outside in the early morning light, and Benjamin sprints on ahead of Daisy. They arrive at Captain Mike's tugboat, where the tattooed mariner lies in a deep, alcohol-induced slumber. Mike eventually comes round, and Benjamin shakes his head while Mike eyes Daisy. Mike rubs his bare, tattooed chest, sits up, and shoves a cigar in his mouth as the tug makes its way along the river through thick fog. Benjamin and Daisy stand at the prow, looking out, and Benjamin, wearing a woolen hat, glances back at Daisy. In the wheelhouse, Mike sips coffee from an enamel mug, peers through the window, and sees an ocean liner passing the other way. Daisy and Benjamin climb the steps up to the wheelhouse, Daisy waves to the larger vessel, and she and Benjamin share a smile. In the hospital, Caroline turns to Daisy, who stares towards the window as lightning flashes outside. Caroline sits down with the diary and reads. Benjamin stares at himself in the mirror, then at Mrs. Maple, who sits motionless in a chair with her head resting against the seat back, her eyes dull and her mouth slightly open.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Benjamin rotates the vessel's helm while Mike clutches a stogie between his teeth. Smiling, Mike seizes the wheel and swiftly maneuvers the craft port. Later, Mike and Benjamin linger at the tavern in a dim drinking establishment, where Mike sips his spirits. He removes his shirt to expose tattoos over his torso, poses in a pugilistic stance flaunting the tattoos, and kisses his tattooed bicep. Mike smirks at Benjamin just as a group of courtesans congregates on the stairs, and a gorgeous woman steps forward. They ascend the stairs, and the woman appears wearily from beneath the quickly shifting blankets under the sheets, after which he departs. Benjamin then trots down the stairs and out through the back entrance, past two scantily clad strumpets, vanishing into a bustling back alley. His father, Thomas, leaves a strumpet outside an adjacent building and notices Benjamin. Thomas's automobile pulls up beside Benjamin as he ambles down a rain-soaked street. Thomas, wearing a tidy mustache, opens a door to Benjamin, who climbs in, and the vehicle pulls away as Thomas turns to regard his offspring and smiles. A waiter addresses them while Thomas and Benjamin sit at a table. Two whiskeys are served, and Thomas looks away as they clink glasses, smiling wryly as Benjamin sputters on the whiskey. Later, as the bar staff are tidying up, Thomas raises his glass, coughs his whiskey, and grimaces, while Benjamin gulps his whiskey. Thomas then delivers Benjamin to his front gate, where he tips his fedora and totters towards the front door. Benjamin staggers through the shadowed hallway, where Queenie stands with her arms folded, and he convulses and regurgitates. Daisy, now about nine years old, is roused very early by Benjamin tiptoeing into her room. She nods, joins Benjamin outside in the early morning light, and Benjamin sprints on ahead of Daisy. They arrive at Captain Mike's tugboat, where the tattooed sailor lies in a deep, alcohol-induced slumber. Mike eventually comes round, and Benjamin shakes his head while Mike eyes Daisy. Mike rubs his bare, tattooed chest, sits up, and shoves a stogie in his mouth as the tug makes its way along the river through thick mist. Benjamin and Daisy stand at the bow, looking out, and Benjamin, wearing a woolen cap, glances back at Daisy. In the wheelhouse, Mike sips coffee from an enamel mug, peers through the window, and sees an ocean liner passing the other way. Daisy and Benjamin climb the steps up to the wheelhouse, Daisy waves to the larger vessel, and she and Benjamin share a smile. In the hospital, Caroline turns to Daisy, who gazes towards the window as lightning flashes outside. Caroline sits down with the journal and reads. Benjamin stares at himself in the mirror, then at Mrs. Maple, who sits motionless in a chair with her head resting against the seat back, her eyes dull and her mouth slightly open."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The ship's wheel is turned by Benjamin while a cigar is gripped between Mike's teeth. Grinning, the helm is taken by Mike who sharply steers the boat left. Later, the bar at a shady watering hole is stood at by Mike and Benjamin, where his liquor is sipped by Mike. His shirt is removed by him to reveal tattoos over his torso, and a boxing pose is struck by him showing off the tattoos, and his tattooed bicep is kissed by him. Benjamin is grinned at by Mike just as a bevy of prostitutes gathers on the stairs, and a beautiful woman steps forward. The stairs are climbed by them, and the woman wearily emerges from beneath the rapidly moving covers under the sheets, after which he leaves. The stairs are then trotted down by Benjamin and out through the back door, past two scantily clad hookers, disappearing into a crowded back alley. A hooker outside an adjacent building is left by his father, Thomas, who spots Benjamin. Beside Benjamin, Thomas's motorcar pulls up as the street, washed by rain, is strolled down by him. A door is opened by Thomas, who sports a neat mustache, to Benjamin, who climbs in, and away, the car pulls as his son is regarded by Thomas, who smiles. While a waiter addresses them, Thomas and Benjamin sit at a table. Two whiskeys are served, and away, Thomas looks as their glasses are clinked and a wry smile is offered by him as the whiskey is sputtered on by Benjamin. Later, as the bar staff clear up, his glass is raised by Thomas, who coughs on his whiskey and grimaces, while the whiskey is slugged by Benjamin. Benjamin is then delivered to his front gate by Thomas, where his fedora is raised and towards the front door, he teeters. Through the darkened hallway, Benjamin staggers, where Queenie stands with her arms folded, and spasms and vomiting occur. Daisy, now about nine years old, is woken very early by Benjamin who tiptoes into her room. A nod is given by her, and outside in the early morning light, she joins Benjamin, and ahead of Daisy, Benjamin sprints. Captain Mike's tugboat is arrived at by them, where the tattooed mariner lies in a deep, alcohol-induced slumber. Mike eventually comes round, and Benjamin shakes his head while Daisy is eyed by Mike. His bare, tattooed chest is rubbed by Mike, and sitting up, a cigar is shoved into his mouth by him as the river is plied by the tug through thick fog. At the prow, Benjamin and Daisy stand looking out, and wearing a woolen hat, back at Daisy, Benjamin glances. In the wheelhouse, coffee is sipped by Mike from an enamel mug, and the window is peered through by him to see an ocean liner passing the other way. Daisy and Benjamin climb the steps up to the wheelhouse, waving to the larger vessel is done by Daisy, and a smile is shared by her and Benjamin. In the hospital, Caroline turns to Daisy, who stares towards the window as lightning flashes outside. The diary is sat down with by Caroline, who reads. Himself in the mirror is stared at by Benjamin, then at Mrs. Maple, who sits motionless in a chair with her head resting against the seat back, her eyes dull and her mouth slightly open."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Benjamin turns the ship's wheel while Mike grips a cigar. Grinning, Mike takes the helm, steering the boat left. Later, at a shady bar, Mike sips his liquor, reveals his tattooed torso, poses, and kisses his bicep. Mike grins at Benjamin as a group of prostitutes gathers, and a beautiful woman steps forward. They climb the stairs; the woman emerges wearily from beneath the sheets as he leaves. Benjamin exits through a back door, past scantily clad prostitutes, into a crowded alley. His father, Thomas, leaves a prostitute outside a nearby building and spots Benjamin. Thomas’s motorcar arrives, and Benjamin climbs in. They sit at a table, receive whiskeys, and clink glasses; Benjamin sputters on his drink. Later, with the bar staff clearing up, Thomas coughs on his whiskey, grimaces, while Benjamin drinks his. Thomas delivers Benjamin to his front gate, who teeters toward the door. Benjamin staggers down a dark hallway and vomits as Queenie watches. Daisy, now about nine, wakes early when Benjamin enters her room. She joins him outside, and they head to Captain Mike's tugboat, where Mike lies in an alcohol-induced slumber. Mike wakes, and Benjamin shakes his head as Mike eyes Daisy. Mike rubs his tattooed chest, inserts a cigar, and the tug moves along the river in thick fog. Benjamin and Daisy stand at the prow, and Benjamin glances back at Daisy. In the wheelhouse, Mike sips coffee and sees an ocean liner. Daisy and Benjamin climb to the wheelhouse; Daisy waves, and they share a smile. At the hospital, Caroline turns to Daisy, who stares as lightning flashes. Caroline reads the diary as Benjamin stares at his reflection, then at Mrs. Maple, motionless in a chair."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Benjamin turns the ship's wheel while Mike grips a cigar. Mike steers the boat left, grinning. Later, at a bar, Mike sips liquor, removes his shirt to reveal tattoos, strikes a boxing pose, and kisses his bicep. A group of prostitutes arrives, and a beautiful woman steps forward. She and Mike climb stairs, and after she emerges from beneath sheets, Mike leaves. Benjamin exits past two scantily clad prostitutes into a back alley. His father, Thomas, sees Benjamin as he walks on a rain-washed street. Thomas, sporting a mustache, opens the car door for Benjamin, who climbs in. At a table, they drink whiskey, and Benjamin sputters while Thomas smiles wryly. Later, as staff clean up, Thomas coughs at his whiskey, while Benjamin drinks his. Thomas delivers Benjamin home, where he vomits in the hallway as Queenie watches. Daisy, around nine, is woken by Benjamin. They join outside, and Benjamin sprints ahead to Captain Mike's tugboat. Mike lies in an alcohol-induced slumber but awakens to Benjamin shaking his head. Mike rubs his tattooed chest, smokes a cigar, and the tug moves through fog as Benjamin and Daisy stand at the prow. In the wheelhouse, Mike sips coffee and sees an ocean liner pass. Daisy waves to the vessel, sharing a smile with Benjamin. In the hospital, Caroline reads the diary as Daisy stares at flashing lightning. Benjamin looks at himself in the mirror, while Mrs. Maple sits motionless with dull eyes and an open mouth."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Benjamin carefully maneuvers the ship's wheel while Mike, with a cigar clenched firmly between his teeth, maintains a steady grip. With a wide, mischievous grin, Mike confidently takes control of the helm and expertly steers the vessel sharply to the left. Sometime later, Mike and Benjamin find themselves standing at the bar in a dimly lit, somewhat disreputable watering hole. Here, Mike leisurely sips his liquor with a sense of satisfaction. With a flourish, he removes his shirt, revealing an array of intricate tattoos adorning his torso. He playfully strikes a boxing pose to show off these tattoos and then plants a kiss on his tattooed bicep. As Mike grins broadly at Benjamin, a lively group of prostitutes begins to gather on the stairs, and a particularly striking woman steps forward. They ascend the stairs together, and shortly thereafter, the woman emerges wearily from beneath the rapidly moving covers under the sheets, after which he departs. Benjamin then makes his way quickly down the stairs and exits through the back door, passing by two scantily clad hookers and vanishing into a bustling, crowded back alley. His father, Thomas, is seen leaving the company of a hooker outside a nearby building and soon spots Benjamin. Thomas's motorcar pulls up alongside Benjamin as he strolls down a rain-washed street. Thomas, sporting a neatly trimmed mustache, opens the car door invitingly for Benjamin, who climbs in, and the vehicle smoothly pulls away. Thomas turns to regard his son with a smile of fondness. In a cozy setting, a waiter addresses them while Thomas and Benjamin sit at a table. Two whiskeys are promptly served, and as they clink glasses, Thomas looks away, smiling wryly while Benjamin amusingly sputters on the strong whiskey. As the bar staff begin to clear up at the end of the evening, Thomas raises his glass, coughs on his whiskey, and grimaces momentarily, while Benjamin boldly slugs his. Thomas then escorts Benjamin to his front gate, where Benjamin raises his fedora in a gentlemanly gesture and teeters toward the front door. Benjamin staggers through the dimly lit hallway, where Queenie stands with her arms folded, watching him with concern as he suddenly spasms and vomits. Daisy, now around nine years of age, is awoken very early in the morning by the sound of Benjamin tiptoeing into her room. She acknowledges him with a nod, and together they step outside into the soft, early morning light. Benjamin sprints eagerly ahead of Daisy as they make their way to Captain Mike's tugboat, where the tattooed mariner lies in a deep, alcohol-induced slumber. Eventually, Mike rouses himself, and Benjamin shakes his head in mild disbelief while Mike eyes Daisy curiously. Mike rubs his bare, tattooed chest, sits up, and casually shoves a cigar into his mouth as the tugboat makes its way steadily along the river, navigating through the thick fog. Benjamin and Daisy stand together at the prow, looking out over the water, and Benjamin, wearing a snug woolen hat, glances back at Daisy with a smile. In the wheelhouse, Mike sips steaming coffee from an enamel mug and peers through the window, noticing an ocean liner passing in the opposite direction. Daisy and Benjamin climb the steps up to the wheelhouse, and Daisy waves cheerfully to the larger vessel as she and Benjamin exchange warm smiles. Inside a hospital, Caroline turns her attention to Daisy, who stares pensively toward the window as lightning flashes dramatically outside. Caroline sits down with a sense of purpose, opens the diary, and begins to read. Benjamin, standing before a mirror, stares intently at his reflection before turning his gaze to Mrs. Maple, who sits motionless in a chair, her head resting against the seat back, her eyes staring dully, and her mouth slightly open."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Benjamin, focused and precise, gingerly maneuvers the large ship's wheel, while Mike, with a robust cigar clamped firmly between his teeth, maintains his steady hold. Grinning widely with mischievous confidence, Mike seizes control of the helm with assurance, expertly steering the vessel into a sharp left turn. As time passes, Mike and Benjamin unexpectedly find themselves standing at the bar in a dimly lit, somewhat disreputable watering hole renowned for its unsavory patrons and lively atmosphere. In this shadowy setting, Mike leisurely sips his strong liquor with a sense of deep satisfaction. With a flourish, he dramatically removes his shirt to reveal a striking array of intricate tattoos that adorn his torso. He playfully strikes a boxing pose to showcase these ornate tattoos and then plants a proud kiss on his tattooed bicep. As Mike flashes a broad grin at Benjamin, a lively group of prostitutes begins to gather energetically on the stairs, and a particularly striking woman takes center stage. Together, they ascend the stairs, and shortly, the woman emerges, appearing weary from beneath the rapidly moving sheets, before Mike makes his exit. Benjamin then swiftly descends the stairs and exits through the back door, casually passing by two scantily clad hookers before vanishing into a bustling, crowded back alley. His father, Thomas, is seen emerging from the company of a hooker outside a nearby building and soon spots Benjamin. Without hesitation, Thomas's motorcar pulls up alongside Benjamin as he strolls leisurely down the rain-washed street. Sporting a neatly trimmed mustache, Thomas opens the car door with an inviting gesture for Benjamin, who climbs in, and the vehicle smoothly pulls away. Thomas turns to regard his son, smiling with fondness and warmth. In a cozy, intimate setting, a waiter approaches them as Thomas and Benjamin sit together at a small table. Two whiskeys are promptly served by the attentive waiter, and as they clink their glasses together, Thomas looks away, smiling wryly, while Benjamin amusingly sputters on the strong-tasting whiskey. As the diligent bar staff begin to clear up at the end of the evening, Thomas raises his glass again, coughs gently on his whiskey, and grimaces momentarily, while Benjamin boldly slugs back his drink. Thomas then escorts Benjamin to his front gate, where Benjamin raises his fedora in a gentlemanly gesture and teeters slightly as he makes his way to the front door. Benjamin staggers down the dimly lit hallway, where Queenie stands with her arms folded, watching him with a look of concern as he suddenly spasms and vomits. Daisy, now approximately nine years old, is awoken in the very early hours of the morning by the sound of Benjamin tiptoeing quietly into her room. She acknowledges him with a nod, and together they step outside into the soft, gentle light of the early morning. Benjamin sprints eagerly ahead of Daisy as they make their way determinedly to Captain Mike's tugboat, where the tattooed mariner lies in a deep, alcohol-induced slumber. Eventually, Mike rouses himself from his deep sleep, and Benjamin shakes his head in mild disbelief while Mike eyes Daisy with curiosity. Mike rubs his bare, tattooed chest thoughtfully, sits up, and casually shoves a cigar into his mouth as the tugboat makes its way steadily along the river, navigating through the thick and enveloping fog. Benjamin and Daisy stand together at the prow, gazing out thoughtfully over the water, and Benjamin, wearing a snug woolen hat, glances back at Daisy with a warm, inviting smile. In the wheelhouse, Mike sips steaming hot coffee from an enamel mug while peering through the window, noticing an ocean liner passing majestically in the opposite direction. Daisy and Benjamin climb the steps leading up to the wheelhouse, and Daisy waves cheerfully to the larger vessel as she and Benjamin exchange warm, heartfelt smiles. Inside the confines of a hospital, Caroline turns her attention to Daisy, who stares pensively toward the window as lightning flashes dramatically outside. With a sense of purpose, Caroline sits down, opens a diary, and begins to read aloud. Meanwhile, Benjamin, standing before a mirror, stares intently at his own reflection before turning his gaze to Mrs. Maple, who sits motionless in a chair, her head resting against the seat back, her eyes staring dully ahead, and her mouth slightly open."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Benjamin turns the ship's wheel with measured precision, while Mike clutches a cigar tightly between his teeth. With a grin spreading across his face, Mike takes over the helm and quickly, yet with a practiced hand, steers the boat sharply to the left. In a dimly lit bar later, Mike and Benjamin stand casually, and Mike, with a relaxed demeanor, takes a sip of his liquor. He then decisively removes his shirt, unveiling an intricate array of tattoos sprawling across his torso. Striking an exaggerated boxing pose, he proudly displays his tattoos, flexing his muscles, and then kisses his bicep, which also bears ornate ink. As Mike grins at Benjamin, a group of women on the stairs catches his attention, and from among them, a particularly beautiful woman steps forward. Together, they make their way up the stairs, and the scene shifts to the woman emerging from under rapidly moving sheets, looking weary, as Mike departs. Benjamin then makes a brisk descent down the stairs, brushing past two scantily clad women at the back door, and disappears swiftly into a bustling back alley. Meanwhile, his father, Thomas, exits another building nearby, leaving behind one of the women, and his eyes fall on Benjamin. Thomas's motorcar rolls up beside Benjamin as he strolls along a street glistening with rainwater. Wearing a neatly trimmed mustache, Thomas opens the car door for Benjamin, who climbs in, and the car smoothly pulls away from the curb. Inside, Thomas turns to look at his son with a smile, and then the two of them sit at a table as a waiter approaches. Two glasses of whiskey are set before them, and as they clink their glasses together, Thomas looks away, smiling wryly, while Benjamin struggles with the strong drink, sputtering. Later, amid the hectic clearing-up of the bar staff, Thomas raises his glass once more, takes a sip, coughs from the burn of the whiskey, and grimaces, whereas Benjamin drinks his with more ease. Thomas then drives Benjamin to his front gate, where Benjamin raises his fedora in farewell and makes an unsteady path towards the front door. Once inside, he staggers through the dimly lit hallway, only to be met by Queenie, who stands with her arms crossed, watching him as he suddenly spasms and empties the contents of his stomach. Meanwhile, Daisy, about nine years old at this point, is gently woken from her slumber by the early intrusion of Benjamin tiptoeing into her room. She acknowledges him with a nod and joins him outside in the fresh early morning air. Benjamin, filled with youthful energy, sprints ahead of Daisy as they head towards Captain Mike's tugboat. Lying in a deep sleep influenced by alcohol, the tattooed mariner, Mike, slowly comes to consciousness. Benjamin shakes his head in disapproval while Mike's eyes dart towards Daisy. As he rubs his bare, tattooed chest, Mike sits up and stuffs a cigar into his mouth, even as the tugboat makes its silent journey along the fog-laden river. Standing at the boat's prow, Benjamin and Daisy gaze out at the dense mist surrounding them. Benjamin, with a woolen hat snug on his head, turns to look back at Daisy. In the wheelhouse, Mike, cradling an enamel mug in his hands, sips coffee while peering through the window to see an ocean liner passing by in the opposite direction. Daisy and Benjamin climb the steps leading to the wheelhouse, and Daisy, full of childlike enthusiasm, waves to the larger vessel. She and Benjamin exchange a smile, sharing the simple joy of the moment. In a hospital room, Caroline turns her attention to Daisy, who looks intently towards the window, mesmerized by the lightning flashing outside. Caroline sits beside her, opens a diary, and begins to read. Meanwhile, Benjamin stares at his own reflection in a mirror, then shifts his gaze to Mrs. Maple, who sits in a chair, her posture relaxed, with her head resting back, eyes unfocused, and mouth slightly parted in stillness."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Benjamin and Mike navigate the ship, with Mike taking over the wheel and sharply steering left. Later, they are at a bar where Mike shows off his tattoos, strikes a pose, and kisses his bicep as a group of prostitutes arrives, including a beautiful woman. Following a brief encounter, Mike leaves, and Benjamin sneaks out through a back alley. His father, Thomas, spots him from a motorcar and offers him a ride. They share a drink at a bar, with Thomas smiling wryly as Benjamin struggles with his whiskey. The night ends with Thomas dropping Benjamin off at home, where he is met by Queenie after staggering in and vomiting. \n\nIn the early morning, Benjamin wakes Daisy, now nine years old, and they head to Captain Mike's tugboat. They find Mike asleep from drinking. As Mike wakes, the tugboat sets off through foggy waters, with Benjamin and Daisy standing at the prow. Inside the wheelhouse, Mike drinks coffee while watching an ocean liner pass by. Daisy waves to the liner, sharing a smile with Benjamin. Elsewhere, in a hospital, Caroline begins reading from a diary while Daisy looks outside as lightning flashes. Benjamin reflects in a mirror before noticing Mrs. Maple sitting motionless nearby."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Benjamin, navigating the open seas on a ship that had long been part of his family's maritime legacy, turns the ship's wheel while Mike grips a hand-rolled cigar between his teeth, a habit picked up during his years in the navy. Grinning with the confidence of a seasoned sailor, Mike takes the helm and sharply steers the boat left, performing a maneuver reminiscent of his adventurous days on the high seas. Later, Mike and Benjamin stand at the bar in a shady watering hole known among seafarers for its dim lighting and sea-themed décor, where Mike sips his liquor, a locally distilled rum renowned for its strong notes. He removes his shirt to reveal tattoos over his torso, inked during his travels across various ports, strikes a boxing pose showing off the tattoos, and kisses his tattooed bicep with the bravado of someone who has seen and done much. Mike grins at Benjamin just as a bevy of prostitutes, regulars at this seedy maritime haunt, gathers on the stairs, and a beautiful woman, known as the Pearl of the Port, steps forward. They climb the stairs, and the woman emerges wearily from beneath the rapidly moving covers under the sheets, after which he leaves. \n\nBenjamin, with the practiced stealth of a man accustomed to nocturnal escapes, then trots down the stairs and out through the back door, past two scantily clad hookers who nod knowingly, disappearing into a crowded back alley, bustling with the lively chaos typical of the dockside. His father, Thomas, a former merchant navy officer with a keen eye for his son's exploits, leaves a hooker outside an adjacent building and spots Benjamin. Thomas's motorcar, a classic Model T Ford with gleaming fenders, pulls up beside Benjamin as he strolls down a rain-washed street, glistening under the gas lamps' glow. Thomas, sporting a neat mustache reminiscent of the bygone era of gentlemen sailors, opens a door to Benjamin, who climbs in, and the car pulls away as Thomas turns to regard his son and smiles, a shared moment of silent understanding. A waiter, impeccably dressed in a crisp white shirt, addresses them while Thomas and Benjamin sit at a table. Two whiskeys, aged to perfection in oak barrels, are served, and Thomas looks away as they clink glasses, smiling wryly as Benjamin sputters on the whiskey, a harsh initiation into adulthood. Later, as the bar staff are clearing up, Thomas raises his glass, coughs his whiskey, and grimaces from its potent burn, while Benjamin slugs his whiskey with newfound stamina. \n\nThomas then delivers Benjamin to his front gate, where he raises his fedora, a nod to his days of dignified voyages, and teeters towards the front door. Benjamin staggers through the darkened hallway, where Queenie, the matriarchal figure who raised him like a son, stands with her arms folded, and he spasms and vomits, a shameful end to a night of excess. Daisy, now about nine years old and full of innocent curiosity, is woken very early by Benjamin tiptoeing into her room. She nods, joins Benjamin outside in the early morning light that promises a new day, and Benjamin sprints on ahead of Daisy, energized by the crisp morning air. They arrive at Captain Mike's tugboat, a sturdy vessel known for its reliable engine and colorful past, where the tattooed mariner lies in a deep, alcohol-induced slumber. Mike eventually comes round, and Benjamin shakes his head while Mike eyes Daisy with protective affection. Mike rubs his bare, tattooed chest, sits up, and shoves a cigar in his mouth as the tug makes its way along the river through thick fog, navigating waters that have seen countless tales. \n\nBenjamin and Daisy stand at the prow, looking out with wide eyes and adventurous spirits, and Benjamin, wearing a woolen hat hand-knitted by Queenie, glances back at Daisy. In the wheelhouse, Mike sips coffee from an enamel mug, a cherished gift from an old shipmate, peers through the window, and sees an ocean liner passing the other way, its massive structure dwarfing their humble tug. Daisy and Benjamin climb the steps up to the wheelhouse, Daisy waves to the larger vessel, a nod to dreams of grand voyages, and she and Benjamin share a smile, a bond forged in shared adventures. In the hospital, Caroline turns to Daisy, who stares towards the window as lightning flashes outside, casting eerie shadows across the room. Caroline sits down with the diary, a chronicle of past adventures and dreams, and reads. Benjamin stares at himself in the mirror, contemplating the passage of time, then at Mrs. Maple, who sits motionless in a chair with her head resting against the seat back, her eyes dull and her mouth slightly open, a silent testament to a life slowly ebbing away."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "In the hospital Caroline turns to Daisy who stares towards the window as lightning flashes outside Benjamin turns the ship's wheel while Mike grips a cigar between his teeth Daisy and Benjamin climb the steps up to the wheelhouse Grinning Mike takes the helm and sharply steers the boat left In the wheelhouse Mike sips coffee from an enamel mug peers through the window and sees an ocean liner passing the other way Later Mike and Benjamin stand at the bar in a shady watering hole where Mike sips his liquor He removes his shirt to reveal tattoos over his torso strikes a boxing pose showing off the tattoos and kisses his tattooed bicep Mike grins at Benjamin just as a bevy of prostitutes gathers on the stairs and a beautiful woman steps forward He removes his shirt to reveal tattoos over his torso strikes a boxing pose showing off the tattoos and kisses his tattooed bicep Benjamin turns the ship's wheel while Mike grips a cigar between his teeth Daisy now about nine years old is woken very early by Benjamin tiptoeing into her room They climb the stairs and the woman emerges wearily from beneath the rapidly moving covers under the sheets after which he leaves Benjamin then trots down the stairs and out through the back door past two scantily clad hookers disappearing into a crowded back alley His father Thomas leaves a hooker outside an adjacent building and spots Benjamin Thomas's motorcar pulls up beside Benjamin as he strolls down a rainwashed street Mike grins at Benjamin just as a bevy of prostitutes gathers on the stairs and a beautiful woman steps forward Thomas sporting a neat mustache opens a door to Benjamin who climbs in and the car pulls away as Thomas turns to regard his son and smiles Mike eventually comes round and Benjamin shakes his head while Mike eyes Daisy A waiter addresses them while Thomas and Benjamin sit at a table Two whiskeys are served and Thomas looks away as they clink glasses smiling wryly as Benjamin sputters on the whiskey Benjamin staggers through the darkened hallway where Queenie stands with her arms folded and he spasms and vomits Later as the bar staff are clearing up Thomas raises his glass coughs his whiskey and grimaces while Benjamin slugs his whiskey Thomas then delivers Benjamin to his front gate where he raises his fedora and teeters towards the front door Thomas sporting a neat mustache opens a door to Benjamin who climbs in and the car pulls away as Thomas turns to regard his son and smiles Benjamin staggers through the darkened hallway where Queenie stands with her arms folded and he spasms and vomits Daisy now about nine years old is woken very early by Benjamin tiptoeing into her room Thomas's motorcar pulls up beside Benjamin as he strolls down a rainwashed street She nods joins Benjamin outside in the early morning light and Benjamin sprints on ahead of Daisy They arrive at Captain Mike's tugboat where the tattooed mariner lies in a deep alcoholinduced slumber Mike eventually comes round and Benjamin shakes his head while Mike eyes Daisy Mike rubs his bare tattooed chest sits up and shoves a cigar in his mouth as the tug makes its way along the river through thick fog Caroline sits down with the diary and reads Later Mike and Benjamin stand at the bar in a shady watering hole where Mike sips his liquor Benjamin and Daisy stand at the prow looking out and Benjamin wearing a woolen hat glances back at Daisy In the wheelhouse Mike sips coffee from an enamel mug peers through the window and sees an ocean liner passing the other way Daisy and Benjamin climb the steps up to the wheelhouse Daisy waves to the larger vessel and she and Benjamin share a smile In the hospital Caroline turns to Daisy who stares towards the window as lightning flashes outside Caroline sits down with the diary and reads Benjamin stares at himself in the mirror then at Mrs Maple who sits motionless in a chair with her head resting against the seat back her eyes dull and her mouth slightly open"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Benjamin turns the ship's wheel while Mike grips a cigar between his teeth. Grinning Mike takes the helm and sharply steers the boat left. Later Mike and Benjamin stand at the bar in a shady watering hole where Mike sips his liquor. He removes his shirt to reveal tattoos over his torso strikes a boxing pose showing off the tattoos and kisses his tattooed bicep. Mike grins at Benjamin just as a bevy of prostitutes gathers on the stairs and a beautiful woman steps forward. They climb the stairs and the woman emerges wearily from beneath the rapidly moving covers under the sheets after which he leaves Benjamin then trots down the stairs and out through the back door past two scantily clad hookers disappearing into a crowded back alley. His father Thomas leaves a hooker outside an adjacent building and spots Benjamin. Thomas's motorcar pulls up beside Benjamin as he strolls down a rainwashed street. Thomas sporting a neat mustache opens a door to Benjamin who climbs in and the car pulls away as Thomas turns to regard his son and smiles. A waiter addresses them while Thomas and Benjamin sit at a table. Two whiskeys are served and Thomas looks away as they clink glasses smiling wryly as Benjamin sputters on the whiskey. Later as the bar staff are clearing up Thomas raises his glass coughs his whiskey and grimaces while Benjamin slugs his whiskey. Thomas then delivers Benjamin to his front gate where he raises his fedora and teeters towards the front door. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Benjamin staggers through the darkened hallway where Queenie stands with her arms folded and he spasms and vomits. Daisy now about nine years old is woken very early by Benjamin tiptoeing into her room. She nods joins Benjamin outside in the early morning light and Benjamin sprints on ahead of Daisy. They arrive at Captain Mike's tugboat where the tattooed mariner lies in a deep alcoholinduced slumber. Mike eventually comes round and Benjamin shakes his head while Mike eyes Daisy. Mike rubs his bare tattooed chest sits up and shoves a cigar in his mouth as the tug makes its way along the river through thick fog. Benjamin and Daisy stand at the prow looking out and Benjamin wearing a woolen hat glances back at Daisy. In the wheelhouse Mike sips coffee from an enamel mug peers through the window and sees an ocean liner passing the other way. Daisy and Benjamin climb the steps up to the wheelhouse. Daisy waves to the larger vessel and she and Benjamin share a smile. In the hospital Caroline turns to Daisy who stares towards the window as lightning flashes outside. Caroline sits down with the diary and reads. Benjamin stares at himself in the mirror then at Mrs Maple who sits motionless in a chair with her head resting against the seat back her eyes dull and her mouth slightly open."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Benjamin turns the ship's wheel while Mike grips a cigar between his teeth. Grinning Mike takes the helm and sharply steers the boat left. Later Mike and Benjamin stand at the bar in a shady watering hole where Mike sips his liquor. He removes his shirt to reveal tattoos over his torso strikes a boxing pose showing off the tattoos and kisses his tattooed bicep. Mike grins at Benjamin just as a bevy of prostitutes gathers on the stairs and a beautiful woman steps forward. They climb the stairs and the woman emerges wearily from beneath the rapidly moving covers under the sheets after which he leaves Benjamin then trots down the stairs and out through the back door past two scantily clad hookers disappearing into a crowded back alley. His father Thomas leaves a hooker outside an adjacent building and spots Benjamin. Thomas's motorcar pulls up beside Benjamin as he strolls down a rainwashed street. Thomas sporting a neat mustache opens a door to Benjamin who climbs in and the car pulls away as Thomas turns to regard his son and smiles. A waiter addresses them while Thomas and Benjamin sit at a table. Two whiskeys are served and Thomas looks away as they clink glasses smiling wryly as Benjamin sputters on the whiskey. Later as the bar staff are clearing up Thomas raises his glass coughs his whiskey and grimaces while Benjamin slugs his whiskey. Thomas then delivers Benjamin to his front gate where he raises his fedora and teeters towards the front door. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. Benjamin staggers through the darkened hallway where Queenie stands with her arms folded and he spasms and vomits. Daisy now about nine years old is woken very early by Benjamin tiptoeing into her room. She nods joins Benjamin outside in the early morning light and Benjamin sprints on ahead of Daisy. They arrive at Captain Mike's tugboat where the tattooed mariner lies in a deep alcoholinduced slumber. Mike eventually comes round and Benjamin shakes his head while Mike eyes Daisy. Mike rubs his bare tattooed chest sits up and shoves a cigar in his mouth as the tug makes its way along the river through thick fog. Benjamin and Daisy stand at the prow looking out and Benjamin wearing a woolen hat glances back at Daisy. In the wheelhouse Mike sips coffee from an enamel mug peers through the window and sees an ocean liner passing the other way. Daisy and Benjamin climb the steps up to the wheelhouse. Daisy waves to the larger vessel and she and Benjamin share a smile. In the hospital Caroline turns to Daisy who stares towards the window as lightning flashes outside. Caroline sits down with the diary and reads. Benjamin stares at himself in the mirror then at Mrs Maple who sits motionless in a chair with her head resting against the seat back her eyes dull and her mouth slightly open."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Benjamin turns the ship's wheel while Mike grips a cigar between his teeth. Grinning Mike takes the helm and sharply steers the boat left. Later Mike and Benjamin stand at the bar in a shady watering hole where Mike sips his liquor. He removes his shirt to reveal tattoos over his torso strikes a boxing pose showing off the tattoos and kisses his tattooed bicep. Mike grins at Benjamin just as a bevy of prostitutes gathers on the stairs and a beautiful woman steps forward. They climb the stairs and the woman emerges wearily from beneath the rapidly moving covers under the sheets after which he leaves Benjamin then trots down the stairs and out through the back door past two scantily clad hookers disappearing into a crowded back alley. His father Thomas leaves a hooker outside an adjacent building and spots Benjamin. In the wheelhouse Mike sips coffee from an enamel mug peers through the window and sees an ocean liner passing the other way. Daisy and Benjamin climb the steps up to the wheelhouse. Daisy waves to the larger vessel and she and Benjamin share a smile. In the hospital Caroline turns to Daisy who stares towards the window as lightning flashes outside. Caroline sits down with the diary and reads. Benjamin stares at himself in the mirror then at Mrs Maple who sits motionless in a chair with her head resting against the seat back her eyes dull and her mouth slightly open."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Benjamin turns the ship's wheel while Mike grips a cigar between his teeth. Grinning Mike takes the helm and sharply steers the boat left. Later Mike and Benjamin stand at the bar in a shady watering hole where Mike sips his liquor. In the hospital Caroline turns to Daisy who stares towards the window as lightning flashes outside. Caroline sits down with the diary and reads. Benjamin stares at himself in the mirror then at Mrs Maple who sits motionless in a chair with her head resting against the seat back her eyes dull and her mouth slightly open."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "A dolphin turns the ship's wheel while a kangaroo grips a cigar between his teeth. Grinning, the kangaroo takes the helm and sharply steers the boat left. Later, the kangaroo and the dolphin stand at the bar in a shady watering hole, where the kangaroo sips his liquor. The dolphin removes his shirt to reveal tattoos over his torso, strikes a boxing pose showing off the tattoos, and kisses his tattooed bicep. The kangaroo grins at the dolphin just as a bevy of flamingos gathers on the stairs, and a beautiful snake steps forward. They climb the stairs, and the snake emerges wearily from beneath the rapidly moving covers under the sheets, after which the dolphin leaves. An eagle then trots down the stairs and out through the back door, past two scantily clad penguins, disappearing into a crowded back alley. His father, a lion, leaves a penguin outside an adjacent building and spots the eagle. The lion's motorcar pulls up beside the eagle as he strolls down a rain-washed street. The lion, sporting a neat mustache, opens a door to the eagle, who climbs in, and the car pulls away as the lion turns to regard his son and smiles. A giraffe addresses them while the lion and the eagle sit at a table. Two whiskeys are served, and the lion looks away as they clink glasses, smiling wryly as the eagle sputters on the whiskey. Later, as the bar staff are clearing up, the lion raises his glass, coughs his whiskey, and grimaces, while the eagle slugs his whiskey. The lion then delivers the eagle to his front gate, where he raises his fedora and teeters towards the front door. The eagle staggers through the darkened hallway, where a panda stands with her arms folded, and he spasms and vomits. A butterfly, now about nine years old, is woken very early by the eagle tiptoeing into her room. She nods, joins the eagle outside in the early morning light, and the eagle sprints on ahead of the butterfly. They arrive at Captain Kangaroo's tugboat, where the tattooed mariner lies in a deep, alcohol-induced slumber. The kangaroo eventually comes round, and the eagle shakes his head while the kangaroo eyes the butterfly. The kangaroo rubs his bare, tattooed chest, sits up, and shoves a cigar in his mouth as the tug makes its way along the river through thick fog. The eagle and the butterfly stand at the prow, looking out, and the eagle, wearing a woolen hat, glances back at the butterfly. In the wheelhouse, the kangaroo sips coffee from an enamel mug, peers through the window, and sees an ocean liner passing the other way. The butterfly and the eagle climb the steps up to the wheelhouse, the butterfly waves to the larger vessel, and she and the eagle share a smile. In the hospital, a turtle turns to the butterfly, who stares towards the window as lightning flashes outside. The turtle sits down with the diary and reads. The eagle stares at himself in the mirror, then at a fox, who sits motionless in a chair with her head resting against the seat back, her eyes dull and her mouth slightly open."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Benjamin turns the bicycle handlebars while Mike grips a lollipop between his teeth. Grinning, Mike takes the handlebars and sharply steers the scooter left. Later, Mike and Benjamin stand at the juice bar in a bustling café, where Mike sips his smoothie. He removes his jacket to reveal patches over his torso, strikes a yoga pose showing off the patches, and kisses his patched elbow. Mike grins at Benjamin just as a group of dancers gathers on the escalator, and a glamorous woman steps forward. They ascend the escalator, and the woman emerges wearily from beneath the rapidly moving curtains behind the stage, after which he leaves. Benjamin then skips down the escalator and out through the side exit, past two brightly dressed performers, disappearing into a crowded market street. His father, Thomas, leaves a performer outside an adjacent gallery and spots Benjamin. Thomas's bicycle pulls up beside Benjamin as he strolls down a rain-washed street. Thomas, sporting a neat mustache, opens a gate to Benjamin, who climbs in, and the bicycle pulls away as Thomas turns to regard his son and smiles. A server addresses them while Thomas and Benjamin sit at a counter. Two milkshakes are served, and Thomas looks away as they clink glasses, smiling wryly as Benjamin sputters on the milkshake. Later, as the café staff are clearing up, Thomas raises his glass, coughs his milkshake, and grimaces, while Benjamin slurps his milkshake. Thomas then delivers Benjamin to his front porch, where he raises his cap and teeters towards the front door. Benjamin staggers through the dim hallway, where Queenie stands with her arms folded, and he spasms and hiccups. Daisy, now about nine years old, is woken very early by Benjamin tiptoeing into her room. She nods, joins Benjamin outside in the early morning light, and Benjamin hops on ahead of Daisy. They arrive at Captain Mike's rowboat, where the marked mariner lies in a deep, nap-induced slumber. Mike eventually comes round, and Benjamin shakes his head while Mike eyes Daisy. Mike rubs his bare, marked chest, sits up, and shoves a lollipop in his mouth as the rowboat makes its way along the river through thick fog. Benjamin and Daisy stand at the bow, looking out, and Benjamin, wearing a beanie, glances back at Daisy. In the cabin, Mike sips tea from a ceramic cup, peers through the window, and sees a cruise ship passing the other way. Daisy and Benjamin climb the steps up to the cabin, Daisy waves to the larger vessel, and she and Benjamin share a smile. In the clinic, Caroline turns to Daisy, who stares towards the window as lightning flashes outside. Caroline sits down with the photo album and reads. Benjamin stares at himself in the mirror, then at Mrs. Maple, who sits motionless in a chair with her head resting against the seat back, her eyes dull and her mouth slightly open."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Benjamin spins the ship's wheel while Mike balances a cigar between his teeth. Chuckling, Mike relinquishes the helm and gently nudges the boat to the right. Later, Mike and Benjamin sit at the bar in a shady watering hole, where Mike gulps his liquor. He dons his shirt to cover tattoos over his torso, adopts a dancing pose showing off the tattoos, and pats his tattooed bicep. Mike winks at Benjamin just as a group of musicians gathers on the stairs, and a beautiful woman moves forward. They descend the stairs, and the woman emerges elegantly from beneath the still covers under the sheets, after which he remains. Benjamin then skips down the stairs and out through the back door, past two fully dressed hookers, blending into a crowded back alley. His father, Thomas, escorts a hooker outside an adjacent building and notices Benjamin. Thomas's motorcar idles beside Benjamin as he hops down a rain-washed street. Thomas, sporting a neat mustache, closes a door to Benjamin, who leaps in, and the car speeds away as Thomas turns to ignore his son and scowls. A waiter ignores them while Thomas and Benjamin stand at a table. Two whiskeys are taken, and Thomas laughs away as they clink glasses, smiling wryly as Benjamin gulps the whiskey. Later, as the bar staff are setting up, Thomas lowers his glass, sips his whiskey, and grins, while Benjamin savors his whiskey. Thomas then follows Benjamin to his front gate, where he lowers his fedora and slides towards the front door. Benjamin leaps through the darkened hallway, where Queenie stands with her arms outstretched, and he dances and sings. Daisy, now about nine years old, is awoken very late by Benjamin stomping into her room. She nods, trails Benjamin inside in the late evening light, and Benjamin skateboards on ahead of Daisy. They leave at Captain Mike's tugboat, where the tattooed mariner sits in a deep, alcohol-induced trance. Mike eventually drifts away, and Benjamin nods his head while Mike gazes at Daisy. Mike scratches his bare, tattooed chest, lies down, and tosses a cigar into his mouth as the tug drifts along the river through thick fog. Benjamin and Daisy sit at the prow, gazing out, and Benjamin, sporting a woolen hat, peers back at Daisy. In the wheelhouse, Mike gulps coffee from an enamel mug, gazes through the window, and watches an ocean liner drifting the other way. Daisy and Benjamin descend the steps up to the wheelhouse, Daisy dances to the larger vessel, and she and Benjamin share a frown. In the hospital, Caroline gestures to Daisy, who stares towards the window as lightning dazzles outside. Caroline stands up with the diary and writes. Benjamin peeks at himself in the mirror, then at Mrs. Maple, who sits animated in a chair with her head leaning against the seat back, her eyes bright and her mouth slightly closed."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Jonathan rotates the castle's turret while Oliver clenches a sandwich between his toes. Laughing, Oliver takes the throne and abruptly guides the horse left. Later, Oliver and Jonathan stand at the bakery in a dimly lit tavern, where Oliver sips his juice. He removes his hat to reveal paintings over his legs, strikes a dancing pose showing off the paintings, and kisses his painted knee. Oliver chuckles at Jonathan just as a swarm of accountants gathers on the roof, and a mesmerizing statue steps forward. They climb the ladders, and the statue emerges wearily from beneath the swiftly moving branches under the vines, after which he departs. Jonathan then skips down the ladders and out through the side window, past two fully dressed librarians, vanishing into a deserted front yard. His brother, Robert, leaves a librarian outside an adjacent barn and spots Jonathan. Robert's bicycle pulls up beside Jonathan as he ambles down a cloudless avenue. Robert, sporting a rugged beard, opens a drawer to Jonathan, who climbs in, and the bicycle pulls away as Robert turns to regard his sibling and laughs. A chef addresses them while Robert and Jonathan sit on a bench. Two lemonades are served, and Robert looks away as they clink mugs, smiling broadly as Jonathan chokes on the lemonade. Later, as the store clerks are tidying up, Robert raises his mug, chokes on his lemonade, and scowls, while Jonathan quaffs his lemonade. Robert then delivers Jonathan to his farm gate, where he raises his helmet and stumbles towards the main entrance. Jonathan stumbles through the dimly lit corridor, where Sylvia stands with her hands folded, and he jerks and sneezes. Violet, now about nine years old, is woken very early by Jonathan tiptoeing into her nursery. She nods, joins Jonathan outside in the early morning light, and Jonathan dashes on ahead of Violet. They arrive at Captain Oliver's fishing boat, where the painted aviator lies in a deep, pizza-induced slumber. Oliver eventually wakes up, and Jonathan shakes his foot while Oliver eyes Violet. Oliver rubs his bare, painted back, sits up, and stuffs a sandwich in his mouth as the boat makes its way along the stream through dense mist. Jonathan and Violet stand at the bow, gazing out, and Jonathan, wearing a cotton cap, glances back at Violet. In the observatory, Oliver sips tea from a ceramic pot, peers through the lens, and sees a submarine passing the other way. Violet and Jonathan climb the ladders up to the observatory, Violet waves to the larger craft, and she and Jonathan share a grin. In the museum, Felicity turns to Violet, who glares towards the wall as thunder rumbles outside. Felicity sits down with the journal and reads. Jonathan stares at himself in the lens, then at Miss Olive, who sits still in a recliner with her head resting against the armrest, her eyes dull and her mouth slightly ajar."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Alexander rotates the car's steering wheel while Daniel chomps on a pencil between his lips. Chuckling, Daniel seizes the pedals and lazily maneuvers the tractor right. Later, Daniel and Alexander perch at the counter in a dim bistro, where Daniel gulps his soda. He slips off his jacket to display scratches over his abdomen, assumes a dancer's pose flaunting the scratches, and pats his scratched forearm. Daniel chuckles at Alexander just as a gaggle of musicians gathers by the windows, and a handsome man steps backward. They descend the ladder, and the man crawls wearily from beneath the static blankets under the sheets, after which he vanishes. Alexander then skips up the ladder and out through the front gate, past two brightly clad musicians, fading into a bustling front plaza. His uncle, Robert, abandons a musician outside an adjacent restaurant and finds Alexander. Robert’s truck halts beside Alexander as he marches down a sun-baked path. Robert, sporting a bushy beard, swings a gate to Alexander, who clambers in, and the truck speeds away as Robert peers at his nephew and laughs. A chef chats with them while Robert and Alexander rest at a booth. Two sodas are served, and Robert gazes away as they tap glasses, laughing softly as Alexander gulps the soda. Later, as the restaurant staff are arranging things, Robert raises his bottle, sneezes his soda, and smirks, while Alexander downs his soda. Robert then escorts Alexander to his front walkway, where he lifts his cap and wobbles towards the entrance. Alexander trips through the dim living room, where Auntie stands with her hands on her hips, and he hiccups and retches. Emily, now about six years old, is disturbed very early by Alexander gliding into her space. She shakes her head, accompanies Alexander outside in the dim light, and Alexander jogs on past Emily. They reach Captain Daniel's rowboat, where the tattooed wanderer reclines in a deep, dream-induced slumber. Daniel eventually stirs, and Alexander cackles while Daniel gazes at Emily. Daniel scratches his bare, tattooed arm, stands up, and bites on a pipe as the rowboat drifts along the river through heavy mist. Alexander and Emily linger at the bow, gazing out, and Alexander, wearing a leather cap, peers back at Emily. In the control cabin, Daniel drinks tea from a china cup, squints through the glass, and notices a cargo ship gliding the opposite way. Emily and Alexander climb the stairs up to the control cabin, Emily nods to the larger vessel, and she and Alexander exchange a grin. In the clinic, Charlotte turns to Emily, who glares towards the curtain as shadows flicker outside. Charlotte leans back with the diary and scans. Alexander glances at himself in the reflection, then at Mrs. Olive, who slouches rigidly in a recliner with her head leaning against the headrest, her eyes vacant and her mouth barely closed."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Benjamin twirls the compass while Mike clenches a muffin between his fingers. Grinning, Mike claims the tiller and gently pushes the canoe backward. Later, Mike and Benjamin stand at the vendor in a dim tavern, where Mike nibbles his muffin. He tosses his scarf to reveal bracelets over his wrists, performs a dance move showing off the bracelets, and pats his bracelet-covered wrist. Mike grins at Benjamin just as a flock of pigeons descends on the railing, and a graceful duck waddles forward. They descend the ladder, and the duck emerges sleepily from beneath the rapidly changing umbrellas above the benches, after which he departs. Benjamin then strides down the ladder and out through the side entrance, past two colorfully dressed performers, vanishing into a bustling crowded hallway. His father, Thomas, leaves a performer outside a nearby café and notices Benjamin. Thomas's bicycle stops beside Benjamin as he saunters down a sunlit avenue. Thomas, sporting a tidy beard, swings a window, inviting Benjamin, who climbs in, and the bicycle glides away as Thomas turns to regard his son and chuckles. A chef addresses them while Thomas and Benjamin sit at a park bench. Two lemonades are delivered, and Thomas looks away as they tap bottles, chuckling softly as Benjamin sneezes on the lemonade. Later, as the park staff are packing up, Thomas raises his bottle, sneezes his lemonade, and winces, while Benjamin gulps his lemonade. Thomas then escorts Benjamin to his garden gate, where he lifts his cap and wobbles towards the porch. Benjamin sways through the dimly lit corridor, where Queenie stands with her arms crossed, and he twitches and hiccups. Daisy, now about nine years old, is woken very early by Benjamin tiptoeing through her doorway. She nods, joins Benjamin outside in the early morning light, and Benjamin jogs on ahead of Daisy. They arrive at Captain Mike's longboat, where the decorated sailor dozes in a deep, muffin-induced nap. Mike eventually stirs, and Benjamin shakes his shoulders while Mike observes Daisy. Mike scratches his bare, decorated shoulder, sits up, and thrusts a muffin in his mouth as the tug edges its way along the stream through heavy mist. Benjamin and Daisy stand at the stern, looking out, and Benjamin, wearing a knitted scarf, glances back at Daisy. In the cabin, Mike sips hot chocolate from a ceramic cup, peers through the curtain, and sees a ferry passing the other way. Daisy and Benjamin climb the slope up to the cabin, Daisy waves to the larger craft, and she and Benjamin share a laugh. In the clinic, Caroline turns to Daisy, who stares towards the curtain as fireworks burst outside. Caroline sits down with the novel and skims. Benjamin stares at himself in the reflection, then at Mrs. Maple, who sits motionless on a stool with her head leaning against the wall, her eyes vacant and her mouth slightly closed."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Arthur rotates the steering chair while Charlie clutches a balloon between his hands. Chuckling, Charlie seizes the skateboard and wildly propels the wagon right. Later, Charlie and Arthur lounge at the buffet in a dimly-lit café, where Charlie gulps his smoothie. He takes off his jacket to expose drawings over his chest, strikes a dancing pose flaunting the drawings, and blows a kiss at his drawn elbow. Charlie chuckles at Arthur just as a gathering of acrobats dances on the platform, and a stunning acrobat steps backward. They descend the platform, and the acrobat slips cautiously from beneath the swiftly drifting blankets under the napkins, after which he departs. Arthur then prances down the platform and out through the front gate, past two elegantly dressed jesters, vanishing into a bustling side street. His uncle, George, leaves a jester outside an adjacent garden and notices Arthur. George's bicycle rolls up beside Arthur as he shuffles down a snow-covered avenue. George, flaunting a wild hairstyle, hands a map to Arthur, who hops on, and the bicycle glides away as George turns to observe his nephew and chuckles. A chef greets them while George and Arthur relax at a counter. Two sodas are delivered, and George glances aside as they tap cups, chuckling softly as Arthur splutters on the soda. Later, as the kitchen staff are tidying up, George lifts his cup, sneezes his soda, and cringes, while Arthur swigs his soda. George then escorts Arthur to his cottage door, where he tips his beanie and tumbles toward the porchway. Arthur zigzags through the shadowy corridor, where Millie waits with her hands clasped, and he quivers and spills. Eve, now about nine years old, is roused quite late by Arthur creeping into her attic. She shakes her head, follows Arthur outside in the late twilight, and Arthur gallops on ahead of Eve. They reach Pilot Charlie's sailboat, where the painted skipper snores in a deep, nap-induced rest. Charlie gradually awakens, and Arthur shakes his fist while Charlie glares at Eve. Charlie pats his bare, painted belly, stands up, and wedges a lollipop in his lips as the sail maneuvers its path along the canal through light mist. Arthur and Eve stand at the stern, gazing out, and Arthur, wearing a straw scarf, peeks back at Eve. In the cabin, Charlie gulps lemonade from a tin cup, squints through the screen, and notices a freighter drifting the opposite direction. Eve and Arthur slide the ladder up to the cabin, Eve salutes to the larger barge, and she and Arthur exchange a grin. In the library, Victoria glances at Eve, who peers towards the ceiling as raindrops splash inside. Victoria leans down with the notebook and recites. Arthur gazes at himself in the portrait, then at Mrs. Pine, who sits quietly in a hammock with her head resting against the chair back, her eyes vacant and her lips slightly parted."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Benjamin takes the ship's wheel from Mike, who steers sharply left. Later, they are at a shady bar where Mike shows off his tattoos and flirts, while Benjamin leaves quietly into an alley. His father, Thomas, spots him and invites him into a motorcar, leading to a bar where they clink glasses over whiskey, with Benjamin struggling to drink. Thomas drops him at home, and Benjamin stumbles inside to be met by Queenie and later vomits. Early the next morning, Benjamin wakes Daisy, and they head to Captain Mike's tugboat. Mike wakes from a drunken sleep, and they set off on the river in fog. Benjamin and Daisy share a moment at the prow and wave to an ocean liner. In a hospital, Caroline reads a diary while Daisy stares out as lightning flashes. Benjamin then looks at himself and at Mrs. Maple, who sits silent, eyes dull."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Benjamin stares at himself in the mirror then at Mrs Maple who sits motionless in a chair with her head resting against the seat back her eyes dull and her mouth slightly open Caroline sits down with the diary and reads In the hospital Caroline turns to Daisy who stares towards the window as lightning flashes outside Daisy waves to the larger vessel and she and Benjamin share a smile Daisy and Benjamin climb the steps up to the wheelhouse In the wheelhouse Mike sips coffee from an enamel mug peers through the window and sees an ocean liner passing the other way Benjamin and Daisy stand at the prow looking out and Benjamin wearing a woolen hat glances back at Daisy Mike rubs his bare tattooed chest sits up and shoves a cigar in his mouth as the tug makes its way along the river through thick fog Mike eventually comes round and Benjamin shakes his head while Mike eyes Daisy They arrive at Captain Mike's tugboat where the tattooed mariner lies in a deep alcoholinduced slumber She nods joins Benjamin outside in the early morning light and Benjamin sprints on ahead of Daisy Daisy now about nine years old is woken very early by Benjamin tiptoeing into her room Benjamin staggers through the darkened hallway where Queenie stands with her arms folded and he spasms and vomits Thomas then delivers Benjamin to his front gate where he raises his fedora and teeters towards the front door Later as the bar staff are clearing up Thomas raises his glass coughs his whiskey and grimaces while Benjamin slugs his whiskey Two whiskeys are served and Thomas looks away as they clink glasses smiling wryly as Benjamin sputters on the whiskey A waiter addresses them while Thomas and Benjamin sit at a table Thomas sporting a neat mustache opens a door to Benjamin who climbs in and the car pulls away as Thomas turns to regard his son and smiles Thomas's motorcar pulls up beside Benjamin as he strolls down a rainwashed street His father Thomas leaves a hooker outside an adjacent building and spots Benjamin They climb the stairs and the woman emerges wearily from beneath the rapidly moving covers under the sheets after which he leaves Benjamin then trots down the stairs and out through the back door past two scantily clad hookers disappearing into a crowded back alley Mike grins at Benjamin just as a bevy of prostitutes gathers on the stairs and a beautiful woman steps forward He removes his shirt to reveal tattoos over his torso strikes a boxing pose showing off the tattoos and kisses his tattooed bicep Later Mike and Benjamin stand at the bar in a shady watering hole where Mike sips his liquor Grinning Mike takes the helm and sharply steers the boat left Benjamin turns the ship's wheel while Mike grips a cigar between his teeth"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "They arrive at Captain Mike's tugboat where the tattooed mariner lies in a deep alcoholinduced slumber Thomas then delivers Benjamin to his front gate where he raises his fedora and teeters towards the front door A waiter addresses them while Thomas and Benjamin sit at a table Benjamin stares at himself in the mirror then at Mrs Maple who sits motionless in a chair with her head resting against the seat back her eyes dull and her mouth slightly open Benjamin and Daisy stand at the prow looking out and Benjamin wearing a woolen hat glances back at Daisy His father Thomas leaves a hooker outside an adjacent building and spots Benjamin They climb the stairs and the woman emerges wearily from beneath the rapidly moving covers under the sheets after which he leaves Benjamin then trots down the stairs and out through the back door past two scantily clad hookers disappearing into a crowded back alley Two whiskeys are served and Thomas looks away as they clink glasses smiling wryly as Benjamin sputters on the whiskey She nods joins Benjamin outside in the early morning light and Benjamin sprints on ahead of Daisy Daisy waves to the larger vessel and she and Benjamin share a smile Later as the bar staff are clearing up Thomas raises his glass coughs his whiskey and grimaces while Benjamin slugs his whiskey Mike rubs his bare tattooed chest sits up and shoves a cigar in his mouth as the tug makes its way along the river through thick fog Grinning Mike takes the helm and sharply steers the boat left Daisy now about nine years old is woken very early by Benjamin tiptoeing into her room In the hospital Caroline turns to Daisy who stares towards the window as lightning flashes outside Benjamin staggers through the darkened hallway where Queenie stands with her arms folded and he spasms and vomits Later Mike and Benjamin stand at the bar in a shady watering hole where Mike sips his liquor Mike eventually comes round and Benjamin shakes his head while Mike eyes Daisy Caroline sits down with the diary and reads Mike grins at Benjamin just as a bevy of prostitutes gathers on the stairs and a beautiful woman steps forward Daisy and Benjamin climb the steps up to the wheelhouse Thomas's motorcar pulls up beside Benjamin as he strolls down a rainwashed street Thomas sporting a neat mustache opens a door to Benjamin who climbs in and the car pulls away as Thomas turns to regard his son and smiles Benjamin turns the ship's wheel while Mike grips a cigar between his teeth He removes his shirt to reveal tattoos over his torso strikes a boxing pose showing off the tattoos and kisses his tattooed bicep In the wheelhouse Mike sips coffee from an enamel mug peers through the window and sees an ocean liner passing the other way"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Benjamin staggers through the darkened hallway where Queenie stands with her arms folded and he spasms and vomits Daisy now about nine years old is woken very early by Benjamin tiptoeing into her room She nods joins Benjamin outside in the early morning light and Benjamin sprints on ahead of Daisy They arrive at Captain Mike's tugboat where the tattooed mariner lies in a deep alcoholinduced slumber Mike eventually comes round and Benjamin shakes his head while Mike eyes Daisy Mike rubs his bare tattooed chest sits up and shoves a cigar in his mouth as the tug makes its way along the river through thick fog Benjamin and Daisy stand at the prow looking out and Benjamin wearing a woolen hat glances back at Daisy In the wheelhouse Mike sips coffee from an enamel mug peers through the window and sees an ocean liner passing the other way Daisy and Benjamin climb the steps up to the wheelhouse Daisy waves to the larger vessel and she and Benjamin share a smile In the hospital Caroline turns to Daisy who stares towards the window as lightning flashes outside Caroline sits down with the diary and reads Benjamin stares at himself in the mirror then at Mrs Maple who sits motionless in a chair with her head resting against the seat back her eyes dull and her mouth slightly open Benjamin turns the ship's wheel while Mike grips a cigar between his teeth Grinning Mike takes the helm and sharply steers the boat left Later Mike and Benjamin stand at the bar in a shady watering hole where Mike sips his liquor He removes his shirt to reveal tattoos over his torso strikes a boxing pose showing off the tattoos and kisses his tattooed bicep Mike grins at Benjamin just as a bevy of prostitutes gathers on the stairs and a beautiful woman steps forward They climb the stairs and the woman emerges wearily from beneath the rapidly moving covers under the sheets after which he leaves Benjamin then trots down the stairs and out through the back door past two scantily clad hookers disappearing into a crowded back alley His father Thomas leaves a hooker outside an adjacent building and spots Benjamin Thomas's motorcar pulls up beside Benjamin as he strolls down a rainwashed street Thomas sporting a neat mustache opens a door to Benjamin who climbs in and the car pulls away as Thomas turns to regard his son and smiles A waiter addresses them while Thomas and Benjamin sit at a table Two whiskeys are served and Thomas looks away as they clink glasses smiling wryly as Benjamin sputters on the whiskey Later as the bar staff are clearing up Thomas raises his glass coughs his whiskey and grimaces while Benjamin slugs his whiskey Thomas then delivers Benjamin to his front gate where he raises his fedora and teeters towards the front door"
        }
      ]
    }
  ]
}