{
  "ground_truth": "Several people come out, among them Neff, carrying his briefcase. Lola sees him and stands up, and as he is about to pass through the anteroom without recognizing her, she stops him. Neff looks at her a little startled. He pushes the swing door open and holds it for her. As she passes in front of him, his eyes narrow in uneasy speculation. Neff comes up level with Lola and leads her towards his office, with the camera following them. He opens the door of his office and holds it for her, and she enters. Lou Schwartz, one of the other salesmen, is working at his desk, but Lola enters, with Neff following after her. Lou gets up and goes out. Neff stares at her tensely, and she turns again to the window so he won't see that she is crying. Neff gets up and goes to her. In the foreground, Neff and Lola are having dinner, with the usual activity of Olvera Street—sidewalk peddlers, guitar players, etc.—in the background.",
  "iterations": {
    "1": "Several people come out, among them Neff, carrying his briefcase. Lola sees him and stands up, and as he is about to pass through the anteroom without recognizing her, she stops him. Neff looks at her a little startled. He pushes the swing door open and holds it for her. As she passes in front of him, his eyes narrow in uneasy speculation. Neff comes up level with Lola and leads her towards his office, with the camera following them. He opens the door of his office and holds it for her, and she enters. Lou Schwartz, one of the other salesmen, is working at his desk, but Lola enters, with Neff following after her. Lou gets up and goes out. Neff stares at her tensely, and she turns again to the window so he won't see that she is crying. Neff gets up and goes to her.",
    "2": "Several people come out, among them Neff, carrying his briefcase. Lola sees him and stands up, and as he is about to pass through the anteroom without recognizing her, she stops him. Neff looks at her a little startled. He pushes the swing door open and holds it for her. As she passes in front of him, his eyes narrow in uneasy speculation. Neff comes up level with Lola and leads her towards his office, with the camera following them. He opens the door of his office and holds it for her, and she enters. Lou Schwartz, one of the other salesmen, is working at his desk, but Lola enters, with Neff following after her. Lou gets up and goes out. Neff stares at her tensely, and she turns again to the window so he won't see that she is crying.",
    "3": "Several people come out, among them Neff, carrying his briefcase. Lola sees him and stands up, and as he is about to pass through the anteroom without recognizing her, she stops him. Neff looks at her a little startled. He pushes the swing door open and holds it for her. As she passes in front of him, his eyes narrow in uneasy speculation. Neff comes up level with Lola and leads her towards his office, with the camera following them. He opens the door of his office and holds it for her, and she enters. Lou Schwartz, one of the other salesmen, is working at his desk, but Lola enters, with Neff following after her. Lou gets up and goes out.",
    "4": "Several people come out, among them Neff, carrying his briefcase. Lola sees him and stands up, and as he is about to pass through the anteroom without recognizing her, she stops him. Neff looks at her a little startled. He pushes the swing door open and holds it for her. As she passes in front of him, his eyes narrow in uneasy speculation. Neff comes up level with Lola and leads her towards his office, with the camera following them. He opens the door of his office and holds it for her, and she enters. Lou Schwartz, one of the other salesmen, is working at his desk, but Lola enters, with Neff following after her.",
    "5": "Several people come out, among them Neff, carrying his briefcase. Lola sees him and stands up, and as he is about to pass through the anteroom without recognizing her, she stops him. Neff looks at her a little startled. He pushes the swing door open and holds it for her. As she passes in front of him, his eyes narrow in uneasy speculation. Neff comes up level with Lola and leads her towards his office, with the camera following them. He opens the door of his office and holds it for her, and she enters.",
    "6": "Several people come out, among them Neff, carrying his briefcase. Lola sees him and stands up, and as he is about to pass through the anteroom without recognizing her, she stops him. Neff looks at her a little startled. He pushes the swing door open and holds it for her. As she passes in front of him, his eyes narrow in uneasy speculation. Neff comes up level with Lola and leads her towards his office, with the camera following them.",
    "7": "Several people come out, among them Neff, carrying his briefcase. Lola sees him and stands up, and as he is about to pass through the anteroom without recognizing her, she stops him. Neff looks at her a little startled. He pushes the swing door open and holds it for her. As she passes in front of him, his eyes narrow in uneasy speculation.",
    "8": "Several people come out, among them Neff, carrying his briefcase. Lola sees him and stands up, and as he is about to pass through the anteroom without recognizing her, she stops him. Neff looks at her a little startled. He pushes the swing door open and holds it for her.",
    "9": "Several people come out, among them Neff, carrying his briefcase. Lola sees him and stands up, and as he is about to pass through the anteroom without recognizing her, she stops him. Neff looks at her a little startled.",
    "10": "Several people come out, among them Neff, carrying his briefcase. Lola sees him and stands up, and as he is about to pass through the anteroom without recognizing her, she stops him."
  }
}