{
  "ground_truth": "The Queen looks at notes on the palace gates, one of which is a crying face, and after reading the third message, she looks down but turns to face the crowd with a grateful smile before turning back to the notes. She flinches, quickly composes herself, and moves on as the crowd of onlookers watches her looking at the flowers. The Queen looks increasingly upset as she tries to maintain her composure but keeps moving along, looking at more flowers and notes. She stops, turns back to the crowd, and smiles before walking up to the barriers to meet the people. Various young women stand at the front, and the Queen moves slowly along and smiles at them. She stops in front of a little girl who holds a bouquet of flowers, which the girl hands to the Queen, and the Queen smiles and continues to move along. A group of older women curtsy as the Queen passes them, and as she walks, Prince Philip follows close by, with more women curtsying as she moves along. In an ornate hall, Robin walks past some TV lighting and camera equipment and approaches the Queen, who sits on a sofa next to Philip. The Queen takes a pen from her purse and writes on a sheet of paper, walks to a nearby table, puts the sheet down, studies it for a moment, and then walks up to a podium that has been placed in front of a window. Philip strolls to another side of the room and watches the TV crew and the Queen as a young makeup woman applies powder to the Queen's nose with crowds visible outside the window. Video footage outside Buckingham Palace shows that the TV lights are set up inside a hall in Buckingham Palace. Back inside, Charles enters and stands next to Prince Philip, while the makeup woman finishes applying powder to the Queen's face.",
  "iterations": {
    "1": "The Queen looks at notes on the palace gates, one of which is a crying face, and after reading the third message, she looks down but turns to face the crowd with a grateful smile before turning back to the notes. She flinches, quickly composes herself, and moves on as the crowd of onlookers watches her looking at the flowers. The Queen looks increasingly upset as she tries to maintain her composure but keeps moving along, looking at more flowers and notes. She stops, turns back to the crowd, and smiles before walking up to the barriers to meet the people. Various young women stand at the front, and the Queen moves slowly along and smiles at them. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. She stops in front of a little girl who holds a bouquet of flowers, which the girl hands to the Queen, and the Queen smiles and continues to move along. A group of older women curtsy as the Queen passes them, and as she walks, Prince Philip follows close by, with more women curtsying as she moves along. In an ornate hall, Robin walks past some TV lighting and camera equipment and approaches the Queen, who sits on a sofa next to Philip. The Queen takes a pen from her purse and writes on a sheet of paper, walks to a nearby table, puts the sheet down, studies it for a moment, and then walks up to a podium that has been placed in front of a window. Philip strolls to another side of the room and watches the TV crew and the Queen as a young makeup woman applies powder to the Queen's nose with crowds visible outside the window. Video footage outside Buckingham Palace shows that the TV lights are set up inside a hall in Buckingham Palace. Back inside, Charles enters and stands next to Prince Philip, while the makeup woman finishes applying powder to the Queen's face.",
    "2": "The Queen looks at notes on the palace gates, one of which is a crying face, and after reading the third message, she looks down but turns to face the crowd with a grateful smile before turning back to the notes. She flinches, quickly composes herself, and moves on as the crowd of onlookers watches her looking at the flowers. The Queen looks increasingly upset as she tries to maintain her composure but keeps moving along, looking at more flowers and notes. She stops, turns back to the crowd, and smiles before walking up to the barriers to meet the people. Various young women stand at the front, and the Queen moves slowly along and smiles at them. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. She stops in front of a little girl who holds a bouquet of flowers, which the girl hands to the Queen, and the Queen smiles and continues to move along. A group of older women curtsy as the Queen passes them, and as she walks, Prince Philip follows close by, with more women curtsying as she moves along. In an ornate hall, Robin walks past some TV lighting and camera equipment and approaches the Queen, who sits on a sofa next to Philip. The Queen takes a pen from her purse and writes on a sheet of paper, walks to a nearby table, puts the sheet down, studies it for a moment, and then walks up to a podium that has been placed in front of a window. Philip strolls to another side of the room and watches the TV crew and the Queen as a young makeup woman applies powder to the Queen's nose with crowds visible outside the window. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. Video footage outside Buckingham Palace shows that the TV lights are set up inside a hall in Buckingham Palace. Back inside, Charles enters and stands next to Prince Philip, while the makeup woman finishes applying powder to the Queen's face.",
    "3": "The Queen looks at notes on the palace gates, one of which is a crying face, and after reading the third message, she looks down but turns to face the crowd with a grateful smile before turning back to the notes. She flinches, quickly composes herself, and moves on as the crowd of onlookers watches her looking at the flowers. The Queen looks increasingly upset as she tries to maintain her composure but keeps moving along, looking at more flowers and notes. She stops, turns back to the crowd, and smiles before walking up to the barriers to meet the people. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. Various young women stand at the front, and the Queen moves slowly along and smiles at them. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. She stops in front of a little girl who holds a bouquet of flowers, which the girl hands to the Queen, and the Queen smiles and continues to move along. A group of older women curtsy as the Queen passes them, and as she walks, Prince Philip follows close by, with more women curtsying as she moves along. In an ornate hall, Robin walks past some TV lighting and camera equipment and approaches the Queen, who sits on a sofa next to Philip. The Queen takes a pen from her purse and writes on a sheet of paper, walks to a nearby table, puts the sheet down, studies it for a moment, and then walks up to a podium that has been placed in front of a window. Philip strolls to another side of the room and watches the TV crew and the Queen as a young makeup woman applies powder to the Queen's nose with crowds visible outside the window. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. Video footage outside Buckingham Palace shows that the TV lights are set up inside a hall in Buckingham Palace. Back inside, Charles enters and stands next to Prince Philip, while the makeup woman finishes applying powder to the Queen's face.",
    "4": "The Queen looks at notes on the palace gates, one of which is a crying face, and after reading the third message, she looks down but turns to face the crowd with a grateful smile before turning back to the notes. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. She flinches, quickly composes herself, and moves on as the crowd of onlookers watches her looking at the flowers. The Queen looks increasingly upset as she tries to maintain her composure but keeps moving along, looking at more flowers and notes. She stops, turns back to the crowd, and smiles before walking up to the barriers to meet the people. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. Various young women stand at the front, and the Queen moves slowly along and smiles at them. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. She stops in front of a little girl who holds a bouquet of flowers, which the girl hands to the Queen, and the Queen smiles and continues to move along. A group of older women curtsy as the Queen passes them, and as she walks, Prince Philip follows close by, with more women curtsying as she moves along. In an ornate hall, Robin walks past some TV lighting and camera equipment and approaches the Queen, who sits on a sofa next to Philip. The Queen takes a pen from her purse and writes on a sheet of paper, walks to a nearby table, puts the sheet down, studies it for a moment, and then walks up to a podium that has been placed in front of a window. Philip strolls to another side of the room and watches the TV crew and the Queen as a young makeup woman applies powder to the Queen's nose with crowds visible outside the window. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. Video footage outside Buckingham Palace shows that the TV lights are set up inside a hall in Buckingham Palace. Back inside, Charles enters and stands next to Prince Philip, while the makeup woman finishes applying powder to the Queen's face.",
    "5": "The Queen looks at notes on the palace gates, one of which is a crying face, and after reading the third message, she looks down but turns to face the crowd with a grateful smile before turning back to the notes. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. She flinches, quickly composes herself, and moves on as the crowd of onlookers watches her looking at the flowers. The Queen looks increasingly upset as she tries to maintain her composure but keeps moving along, looking at more flowers and notes. She stops, turns back to the crowd, and smiles before walking up to the barriers to meet the people. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. Various young women stand at the front, and the Queen moves slowly along and smiles at them. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. She stops in front of a little girl who holds a bouquet of flowers, which the girl hands to the Queen, and the Queen smiles and continues to move along. A group of older women curtsy as the Queen passes them, and as she walks, Prince Philip follows close by, with more women curtsying as she moves along. In an ornate hall, Robin walks past some TV lighting and camera equipment and approaches the Queen, who sits on a sofa next to Philip. The Queen takes a pen from her purse and writes on a sheet of paper, walks to a nearby table, puts the sheet down, studies it for a moment, and then walks up to a podium that has been placed in front of a window. Philip strolls to another side of the room and watches the TV crew and the Queen as a young makeup woman applies powder to the Queen's nose with crowds visible outside the window. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. Video footage outside Buckingham Palace shows that the TV lights are set up inside a hall in Buckingham Palace. Back inside, Charles enters and stands next to Prince Philip, while the makeup woman finishes applying powder to the Queen's face.",
    "6": "The Queen looks at notes on the palace gates, one of which is a crying face, and after reading the third message, she looks down but turns to face the crowd with a grateful smile before turning back to the notes. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. She flinches, quickly composes herself, and moves on as the crowd of onlookers watches her looking at the flowers. The Queen looks increasingly upset as she tries to maintain her composure but keeps moving along, looking at more flowers and notes. She stops, turns back to the crowd, and smiles before walking up to the barriers to meet the people. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. Various young women stand at the front, and the Queen moves slowly along and smiles at them. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. She stops in front of a little girl who holds a bouquet of flowers, which the girl hands to the Queen, and the Queen smiles and continues to move along. A group of older women curtsy as the Queen passes them, and as she walks, Prince Philip follows close by, with more women curtsying as she moves along. In an ornate hall, Robin walks past some TV lighting and camera equipment and approaches the Queen, who sits on a sofa next to Philip. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. The Queen takes a pen from her purse and writes on a sheet of paper, walks to a nearby table, puts the sheet down, studies it for a moment, and then walks up to a podium that has been placed in front of a window. Philip strolls to another side of the room and watches the TV crew and the Queen as a young makeup woman applies powder to the Queen's nose with crowds visible outside the window. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. Video footage outside Buckingham Palace shows that the TV lights are set up inside a hall in Buckingham Palace. Back inside, Charles enters and stands next to Prince Philip, while the makeup woman finishes applying powder to the Queen's face.",
    "7": "The Queen looks at notes on the palace gates, one of which is a crying face, and after reading the third message, she looks down but turns to face the crowd with a grateful smile before turning back to the notes. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. She flinches, quickly composes herself, and moves on as the crowd of onlookers watches her looking at the flowers. The Queen looks increasingly upset as she tries to maintain her composure but keeps moving along, looking at more flowers and notes. She stops, turns back to the crowd, and smiles before walking up to the barriers to meet the people. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. Various young women stand at the front, and the Queen moves slowly along and smiles at them. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. She stops in front of a little girl who holds a bouquet of flowers, which the girl hands to the Queen, and the Queen smiles and continues to move along. A group of older women curtsy as the Queen passes them, and as she walks, Prince Philip follows close by, with more women curtsying as she moves along. In an ornate hall, Robin walks past some TV lighting and camera equipment and approaches the Queen, who sits on a sofa next to Philip. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. The Queen takes a pen from her purse and writes on a sheet of paper, walks to a nearby table, puts the sheet down, studies it for a moment, and then walks up to a podium that has been placed in front of a window. Philip strolls to another side of the room and watches the TV crew and the Queen as a young makeup woman applies powder to the Queen's nose with crowds visible outside the window. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. Video footage outside Buckingham Palace shows that the TV lights are set up inside a hall in Buckingham Palace. Back inside, Charles enters and stands next to Prince Philip, while the makeup woman finishes applying powder to the Queen's face.",
    "8": "The Queen looks at notes on the palace gates, one of which is a crying face, and after reading the third message, she looks down but turns to face the crowd with a grateful smile before turning back to the notes. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. She flinches, quickly composes herself, and moves on as the crowd of onlookers watches her looking at the flowers. The Queen looks increasingly upset as she tries to maintain her composure but keeps moving along, looking at more flowers and notes. She stops, turns back to the crowd, and smiles before walking up to the barriers to meet the people. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. Various young women stand at the front, and the Queen moves slowly along and smiles at them. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. She stops in front of a little girl who holds a bouquet of flowers, which the girl hands to the Queen, and the Queen smiles and continues to move along. A group of older women curtsy as the Queen passes them, and as she walks, Prince Philip follows close by, with more women curtsying as she moves along. In an ornate hall, Robin walks past some TV lighting and camera equipment and approaches the Queen, who sits on a sofa next to Philip. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. The Queen takes a pen from her purse and writes on a sheet of paper, walks to a nearby table, puts the sheet down, studies it for a moment, and then walks up to a podium that has been placed in front of a window. Philip strolls to another side of the room and watches the TV crew and the Queen as a young makeup woman applies powder to the Queen's nose with crowds visible outside the window. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. Video footage outside Buckingham Palace shows that the TV lights are set up inside a hall in Buckingham Palace. Back inside, Charles enters and stands next to Prince Philip, while the makeup woman finishes applying powder to the Queen's face.",
    "9": "The Queen looks at notes on the palace gates, one of which is a crying face, and after reading the third message, she looks down but turns to face the crowd with a grateful smile before turning back to the notes. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. She flinches, quickly composes herself, and moves on as the crowd of onlookers watches her looking at the flowers. The Queen looks increasingly upset as she tries to maintain her composure but keeps moving along, looking at more flowers and notes. She stops, turns back to the crowd, and smiles before walking up to the barriers to meet the people. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. Various young women stand at the front, and the Queen moves slowly along and smiles at them. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. She stops in front of a little girl who holds a bouquet of flowers, which the girl hands to the Queen, and the Queen smiles and continues to move along. A group of older women curtsy as the Queen passes them, and as she walks, Prince Philip follows close by, with more women curtsying as she moves along. In an ornate hall, Robin walks past some TV lighting and camera equipment and approaches the Queen, who sits on a sofa next to Philip. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. The Queen takes a pen from her purse and writes on a sheet of paper, walks to a nearby table, puts the sheet down, studies it for a moment, and then walks up to a podium that has been placed in front of a window. Philip strolls to another side of the room and watches the TV crew and the Queen as a young makeup woman applies powder to the Queen's nose with crowds visible outside the window. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. Video footage outside Buckingham Palace shows that the TV lights are set up inside a hall in Buckingham Palace. Back inside, Charles enters and stands next to Prince Philip, while the makeup woman finishes applying powder to the Queen's face.",
    "10": "The Queen looks at notes on the palace gates, one of which is a crying face, and after reading the third message, she looks down but turns to face the crowd with a grateful smile before turning back to the notes. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. She flinches, quickly composes herself, and moves on as the crowd of onlookers watches her looking at the flowers. The Queen looks increasingly upset as she tries to maintain her composure but keeps moving along, looking at more flowers and notes. She stops, turns back to the crowd, and smiles before walking up to the barriers to meet the people. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. Various young women stand at the front, and the Queen moves slowly along and smiles at them. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. She stops in front of a little girl who holds a bouquet of flowers, which the girl hands to the Queen, and the Queen smiles and continues to move along. A group of older women curtsy as the Queen passes them, and as she walks, Prince Philip follows close by, with more women curtsying as she moves along. In an ornate hall, Robin walks past some TV lighting and camera equipment and approaches the Queen, who sits on a sofa next to Philip. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. The Queen takes a pen from her purse and writes on a sheet of paper, walks to a nearby table, puts the sheet down, studies it for a moment, and then walks up to a podium that has been placed in front of a window. Philip strolls to another side of the room and watches the TV crew and the Queen as a young makeup woman applies powder to the Queen's nose with crowds visible outside the window. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. Video footage outside Buckingham Palace shows that the TV lights are set up inside a hall in Buckingham Palace. Back inside, Charles enters and stands next to Prince Philip, while the makeup woman finishes applying powder to the Queen's face."
  }
}