{
  "ground_truth": "Mike is hiding in the bushes as she turns to go, and Colin grabs her arm, pulls her close, and gives her a lingering kiss while Mike stares, open-mouthed. Colin smiles at Abby, and they go to their apartments, which are opposite each other. Abby waves a giant foam hand that she picked up at the game as Colin goes into his apartment. Abby runs along the path to Mike and gives him a hug, then runs joyfully to her apartment as Mike walks off. On the show, he is wearing a gorilla suit, and a video screen behind Larry and Georgia shows monkeys having sex while Abby and Joy watch a monitor. Mike’s nephew, Joe, is present, and the gorilla suit is mentioned. Abby jumps up and down, grinning, as she steps out of her apartment. On the doormat is a gift bag, which Abby picks up and looks around, frowning. She takes an envelope out of the gift bag and goes back inside, opening the card and taking a box from the gift bag. Inside the box is a pair of remote-controlled, vibrating briefs. Abby stands in front of the mirror, applies lipstick, perches on the arm of a chair, sips a glass of white wine, and glances at the vibrating briefs, considering for a moment. She reaches under her white dress, pulls down her briefs, and as she does so, D'Artagnan the cat trots past and climbs onto a chair.",
  "iterations": {
    "1": "Mike is hiding in the bushes as she turns to go, and Colin grabs her arm, pulls her close, and gives her a lingering kiss while Mike stares, open-mouthed. Colin smiles at Abby, and they go to their apartments, which are opposite each other. Abby waves a giant foam hand that she picked up at the game as Colin goes into his apartment. Abby runs along the path to Mike and gives him a hug, then runs joyfully to her apartment as Mike walks off. On the show, he is wearing a gorilla suit, and a video screen behind Larry and Georgia shows monkeys having sex while Abby and Joy watch a monitor. Mike’s nephew, Joe, is present, and the gorilla suit is mentioned. Abby jumps up and down, grinning, as she steps out of her apartment. On the doormat is a gift bag, which Abby picks up and looks around, frowning. She takes an envelope out of the gift bag and goes back inside, opening the card and taking a box from the gift bag. Inside the box is a pair of remote-controlled, vibrating briefs. Abby stands in front of the mirror, applies lipstick, perches on the arm of a chair, sips a glass of white wine, and glances at the vibrating briefs, considering for a moment. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. She reaches under her white dress, pulls down her briefs, and as she does so, D'Artagnan the cat trots past and climbs onto a chair.",
    "2": "Mike is hiding in the bushes as she turns to go, and Colin grabs her arm, pulls her close, and gives her a lingering kiss while Mike stares, open-mouthed. Colin smiles at Abby, and they go to their apartments, which are opposite each other. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Abby waves a giant foam hand that she picked up at the game as Colin goes into his apartment. Abby runs along the path to Mike and gives him a hug, then runs joyfully to her apartment as Mike walks off. On the show, he is wearing a gorilla suit, and a video screen behind Larry and Georgia shows monkeys having sex while Abby and Joy watch a monitor. Mike’s nephew, Joe, is present, and the gorilla suit is mentioned. Abby jumps up and down, grinning, as she steps out of her apartment. On the doormat is a gift bag, which Abby picks up and looks around, frowning. She takes an envelope out of the gift bag and goes back inside, opening the card and taking a box from the gift bag. Inside the box is a pair of remote-controlled, vibrating briefs. Abby stands in front of the mirror, applies lipstick, perches on the arm of a chair, sips a glass of white wine, and glances at the vibrating briefs, considering for a moment. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. She reaches under her white dress, pulls down her briefs, and as she does so, D'Artagnan the cat trots past and climbs onto a chair.",
    "3": "Mike is hiding in the bushes as she turns to go, and Colin grabs her arm, pulls her close, and gives her a lingering kiss while Mike stares, open-mouthed. Colin smiles at Abby, and they go to their apartments, which are opposite each other. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Abby waves a giant foam hand that she picked up at the game as Colin goes into his apartment. Abby runs along the path to Mike and gives him a hug, then runs joyfully to her apartment as Mike walks off. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. On the show, he is wearing a gorilla suit, and a video screen behind Larry and Georgia shows monkeys having sex while Abby and Joy watch a monitor. Mike’s nephew, Joe, is present, and the gorilla suit is mentioned. Abby jumps up and down, grinning, as she steps out of her apartment. On the doormat is a gift bag, which Abby picks up and looks around, frowning. She takes an envelope out of the gift bag and goes back inside, opening the card and taking a box from the gift bag. Inside the box is a pair of remote-controlled, vibrating briefs. Abby stands in front of the mirror, applies lipstick, perches on the arm of a chair, sips a glass of white wine, and glances at the vibrating briefs, considering for a moment. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. She reaches under her white dress, pulls down her briefs, and as she does so, D'Artagnan the cat trots past and climbs onto a chair.",
    "4": "Mike is hiding in the bushes as she turns to go, and Colin grabs her arm, pulls her close, and gives her a lingering kiss while Mike stares, open-mouthed. Colin smiles at Abby, and they go to their apartments, which are opposite each other. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Abby waves a giant foam hand that she picked up at the game as Colin goes into his apartment. Abby runs along the path to Mike and gives him a hug, then runs joyfully to her apartment as Mike walks off. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. On the show, he is wearing a gorilla suit, and a video screen behind Larry and Georgia shows monkeys having sex while Abby and Joy watch a monitor. Mike’s nephew, Joe, is present, and the gorilla suit is mentioned. Abby jumps up and down, grinning, as she steps out of her apartment. On the doormat is a gift bag, which Abby picks up and looks around, frowning. She takes an envelope out of the gift bag and goes back inside, opening the card and taking a box from the gift bag. Inside the box is a pair of remote-controlled, vibrating briefs. Abby stands in front of the mirror, applies lipstick, perches on the arm of a chair, sips a glass of white wine, and glances at the vibrating briefs, considering for a moment. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. She reaches under her white dress, pulls down her briefs, and as she does so, D'Artagnan the cat trots past and climbs onto a chair.",
    "5": "In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. Mike is hiding in the bushes as she turns to go, and Colin grabs her arm, pulls her close, and gives her a lingering kiss while Mike stares, open-mouthed. Colin smiles at Abby, and they go to their apartments, which are opposite each other. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Abby waves a giant foam hand that she picked up at the game as Colin goes into his apartment. Abby runs along the path to Mike and gives him a hug, then runs joyfully to her apartment as Mike walks off. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. On the show, he is wearing a gorilla suit, and a video screen behind Larry and Georgia shows monkeys having sex while Abby and Joy watch a monitor. Mike’s nephew, Joe, is present, and the gorilla suit is mentioned. Abby jumps up and down, grinning, as she steps out of her apartment. On the doormat is a gift bag, which Abby picks up and looks around, frowning. She takes an envelope out of the gift bag and goes back inside, opening the card and taking a box from the gift bag. Inside the box is a pair of remote-controlled, vibrating briefs. Abby stands in front of the mirror, applies lipstick, perches on the arm of a chair, sips a glass of white wine, and glances at the vibrating briefs, considering for a moment. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. She reaches under her white dress, pulls down her briefs, and as she does so, D'Artagnan the cat trots past and climbs onto a chair.",
    "6": "In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. Mike is hiding in the bushes as she turns to go, and Colin grabs her arm, pulls her close, and gives her a lingering kiss while Mike stares, open-mouthed. Colin smiles at Abby, and they go to their apartments, which are opposite each other. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Abby waves a giant foam hand that she picked up at the game as Colin goes into his apartment. Abby runs along the path to Mike and gives him a hug, then runs joyfully to her apartment as Mike walks off. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. On the show, he is wearing a gorilla suit, and a video screen behind Larry and Georgia shows monkeys having sex while Abby and Joy watch a monitor. Mike’s nephew, Joe, is present, and the gorilla suit is mentioned. Abby jumps up and down, grinning, as she steps out of her apartment. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. On the doormat is a gift bag, which Abby picks up and looks around, frowning. She takes an envelope out of the gift bag and goes back inside, opening the card and taking a box from the gift bag. Inside the box is a pair of remote-controlled, vibrating briefs. Abby stands in front of the mirror, applies lipstick, perches on the arm of a chair, sips a glass of white wine, and glances at the vibrating briefs, considering for a moment. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. She reaches under her white dress, pulls down her briefs, and as she does so, D'Artagnan the cat trots past and climbs onto a chair.",
    "7": "In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. Mike is hiding in the bushes as she turns to go, and Colin grabs her arm, pulls her close, and gives her a lingering kiss while Mike stares, open-mouthed. Colin smiles at Abby, and they go to their apartments, which are opposite each other. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Abby waves a giant foam hand that she picked up at the game as Colin goes into his apartment. Abby runs along the path to Mike and gives him a hug, then runs joyfully to her apartment as Mike walks off. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. On the show, he is wearing a gorilla suit, and a video screen behind Larry and Georgia shows monkeys having sex while Abby and Joy watch a monitor. Mike’s nephew, Joe, is present, and the gorilla suit is mentioned. Abby jumps up and down, grinning, as she steps out of her apartment. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. On the doormat is a gift bag, which Abby picks up and looks around, frowning. She takes an envelope out of the gift bag and goes back inside, opening the card and taking a box from the gift bag. Inside the box is a pair of remote-controlled, vibrating briefs. Abby stands in front of the mirror, applies lipstick, perches on the arm of a chair, sips a glass of white wine, and glances at the vibrating briefs, considering for a moment. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. She reaches under her white dress, pulls down her briefs, and as she does so, D'Artagnan the cat trots past and climbs onto a chair.",
    "8": "In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. Mike is hiding in the bushes as she turns to go, and Colin grabs her arm, pulls her close, and gives her a lingering kiss while Mike stares, open-mouthed. Colin smiles at Abby, and they go to their apartments, which are opposite each other. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Abby waves a giant foam hand that she picked up at the game as Colin goes into his apartment. Abby runs along the path to Mike and gives him a hug, then runs joyfully to her apartment as Mike walks off. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. On the show, he is wearing a gorilla suit, and a video screen behind Larry and Georgia shows monkeys having sex while Abby and Joy watch a monitor. Mike’s nephew, Joe, is present, and the gorilla suit is mentioned. Abby jumps up and down, grinning, as she steps out of her apartment. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. On the doormat is a gift bag, which Abby picks up and looks around, frowning. She takes an envelope out of the gift bag and goes back inside, opening the card and taking a box from the gift bag. Inside the box is a pair of remote-controlled, vibrating briefs. Abby stands in front of the mirror, applies lipstick, perches on the arm of a chair, sips a glass of white wine, and glances at the vibrating briefs, considering for a moment. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. She reaches under her white dress, pulls down her briefs, and as she does so, D'Artagnan the cat trots past and climbs onto a chair.",
    "9": "In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. Mike is hiding in the bushes as she turns to go, and Colin grabs her arm, pulls her close, and gives her a lingering kiss while Mike stares, open-mouthed. Colin smiles at Abby, and they go to their apartments, which are opposite each other. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Abby waves a giant foam hand that she picked up at the game as Colin goes into his apartment. Abby runs along the path to Mike and gives him a hug, then runs joyfully to her apartment as Mike walks off. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. On the show, he is wearing a gorilla suit, and a video screen behind Larry and Georgia shows monkeys having sex while Abby and Joy watch a monitor. Mike’s nephew, Joe, is present, and the gorilla suit is mentioned. Abby jumps up and down, grinning, as she steps out of her apartment. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. On the doormat is a gift bag, which Abby picks up and looks around, frowning. She takes an envelope out of the gift bag and goes back inside, opening the card and taking a box from the gift bag. Inside the box is a pair of remote-controlled, vibrating briefs. Abby stands in front of the mirror, applies lipstick, perches on the arm of a chair, sips a glass of white wine, and glances at the vibrating briefs, considering for a moment. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. She reaches under her white dress, pulls down her briefs, and as she does so, D'Artagnan the cat trots past and climbs onto a chair.",
    "10": "In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. Mike is hiding in the bushes as she turns to go, and Colin grabs her arm, pulls her close, and gives her a lingering kiss while Mike stares, open-mouthed. Colin smiles at Abby, and they go to their apartments, which are opposite each other. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Abby waves a giant foam hand that she picked up at the game as Colin goes into his apartment. Abby runs along the path to Mike and gives him a hug, then runs joyfully to her apartment as Mike walks off. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. On the show, he is wearing a gorilla suit, and a video screen behind Larry and Georgia shows monkeys having sex while Abby and Joy watch a monitor. Mike’s nephew, Joe, is present, and the gorilla suit is mentioned. Abby jumps up and down, grinning, as she steps out of her apartment. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. On the doormat is a gift bag, which Abby picks up and looks around, frowning. She takes an envelope out of the gift bag and goes back inside, opening the card and taking a box from the gift bag. Inside the box is a pair of remote-controlled, vibrating briefs. Abby stands in front of the mirror, applies lipstick, perches on the arm of a chair, sips a glass of white wine, and glances at the vibrating briefs, considering for a moment. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. She reaches under her white dress, pulls down her briefs, and as she does so, D'Artagnan the cat trots past and climbs onto a chair."
  }
}