{
  "ground_truth": "Mike and Abby clasp hands and hold each other around the waist as they sink down, moving their shoulders seductively from side to side. They turn, round and round, moving smoothly to the music, and Abby leans back on Mike's arm as they dance with their hands held palm to palm. They hold hands above their heads as Mike sinks down, and Abby sways rhythmically to the music while Mike caresses her hair and runs his hands down her sides. Abby spins out, swishing her hair around, and Mike pulls her close as they continue to dance, smiling happily. Abby wraps her arms around Mike's neck and they dance close, as he spins her back and forth, then pulls her closer. Abby and Mike's noses almost touch, and they gaze at each other with their mouths slightly open, as if they're about to kiss. Abby blinks, surprised, and Mike forces himself to nod. Abby smiles nervously and heads off, with Mike following, looking dazed. Abby carries her shoes as she walks with Mike to an elevator, and he presses the call button. Mike turns and faces Abby, and they both fidget awkwardly before stepping into the elevator and standing side by side. Mike presses buttons and loosens his jacket as she flashes a smile at him. They hug, and he stops the doors from closing so they can hug again.",
  "iterations": {
    "1": "Mike and Abby clasp hands and hold each other around the waist as they sink down, moving their shoulders seductively from side to side. They turn, round and round, moving smoothly to the music, and Abby leans back on Mike's arm as they dance with their hands held palm to palm. They hold hands above their heads as Mike sinks down, and Abby sways rhythmically to the music while Mike caresses her hair and runs his hands down her sides. Abby spins out, swishing her hair around, and Mike pulls her close as they continue to dance, smiling happily. Abby wraps her arms around Mike's neck and they dance close, as he spins her back and forth, then pulls her closer. Abby and Mike's noses almost touch, and they gaze at each other with their mouths slightly open, as if they're about to kiss. Abby blinks, surprised, and Mike forces himself to nod. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. Abby smiles nervously and heads off, with Mike following, looking dazed. Abby carries her shoes as she walks with Mike to an elevator, and he presses the call button. Mike turns and faces Abby, and they both fidget awkwardly before stepping into the elevator and standing side by side. Mike presses buttons and loosens his jacket as she flashes a smile at him. They hug, and he stops the doors from closing so they can hug again.",
    "2": "Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Mike and Abby clasp hands and hold each other around the waist as they sink down, moving their shoulders seductively from side to side. They turn, round and round, moving smoothly to the music, and Abby leans back on Mike's arm as they dance with their hands held palm to palm. They hold hands above their heads as Mike sinks down, and Abby sways rhythmically to the music while Mike caresses her hair and runs his hands down her sides. Abby spins out, swishing her hair around, and Mike pulls her close as they continue to dance, smiling happily. Abby wraps her arms around Mike's neck and they dance close, as he spins her back and forth, then pulls her closer. Abby and Mike's noses almost touch, and they gaze at each other with their mouths slightly open, as if they're about to kiss. Abby blinks, surprised, and Mike forces himself to nod. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. Abby smiles nervously and heads off, with Mike following, looking dazed. Abby carries her shoes as she walks with Mike to an elevator, and he presses the call button. Mike turns and faces Abby, and they both fidget awkwardly before stepping into the elevator and standing side by side. Mike presses buttons and loosens his jacket as she flashes a smile at him. They hug, and he stops the doors from closing so they can hug again.",
    "3": "Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Mike and Abby clasp hands and hold each other around the waist as they sink down, moving their shoulders seductively from side to side. They turn, round and round, moving smoothly to the music, and Abby leans back on Mike's arm as they dance with their hands held palm to palm. They hold hands above their heads as Mike sinks down, and Abby sways rhythmically to the music while Mike caresses her hair and runs his hands down her sides. Abby spins out, swishing her hair around, and Mike pulls her close as they continue to dance, smiling happily. Abby wraps her arms around Mike's neck and they dance close, as he spins her back and forth, then pulls her closer. Abby and Mike's noses almost touch, and they gaze at each other with their mouths slightly open, as if they're about to kiss. Abby blinks, surprised, and Mike forces himself to nod. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. Abby smiles nervously and heads off, with Mike following, looking dazed. Abby carries her shoes as she walks with Mike to an elevator, and he presses the call button. Mike turns and faces Abby, and they both fidget awkwardly before stepping into the elevator and standing side by side. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Mike presses buttons and loosens his jacket as she flashes a smile at him. They hug, and he stops the doors from closing so they can hug again.",
    "4": "Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Mike and Abby clasp hands and hold each other around the waist as they sink down, moving their shoulders seductively from side to side. They turn, round and round, moving smoothly to the music, and Abby leans back on Mike's arm as they dance with their hands held palm to palm. They hold hands above their heads as Mike sinks down, and Abby sways rhythmically to the music while Mike caresses her hair and runs his hands down her sides. Abby spins out, swishing her hair around, and Mike pulls her close as they continue to dance, smiling happily. Abby wraps her arms around Mike's neck and they dance close, as he spins her back and forth, then pulls her closer. Abby and Mike's noses almost touch, and they gaze at each other with their mouths slightly open, as if they're about to kiss. Abby blinks, surprised, and Mike forces himself to nod. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. Abby smiles nervously and heads off, with Mike following, looking dazed. Abby carries her shoes as she walks with Mike to an elevator, and he presses the call button. Mike turns and faces Abby, and they both fidget awkwardly before stepping into the elevator and standing side by side. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Mike presses buttons and loosens his jacket as she flashes a smile at him. They hug, and he stops the doors from closing so they can hug again. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation.",
    "5": "Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Mike and Abby clasp hands and hold each other around the waist as they sink down, moving their shoulders seductively from side to side. They turn, round and round, moving smoothly to the music, and Abby leans back on Mike's arm as they dance with their hands held palm to palm. They hold hands above their heads as Mike sinks down, and Abby sways rhythmically to the music while Mike caresses her hair and runs his hands down her sides. Abby spins out, swishing her hair around, and Mike pulls her close as they continue to dance, smiling happily. Abby wraps her arms around Mike's neck and they dance close, as he spins her back and forth, then pulls her closer. Abby and Mike's noses almost touch, and they gaze at each other with their mouths slightly open, as if they're about to kiss. Abby blinks, surprised, and Mike forces himself to nod. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. Abby smiles nervously and heads off, with Mike following, looking dazed. Abby carries her shoes as she walks with Mike to an elevator, and he presses the call button. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. Mike turns and faces Abby, and they both fidget awkwardly before stepping into the elevator and standing side by side. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Mike presses buttons and loosens his jacket as she flashes a smile at him. They hug, and he stops the doors from closing so they can hug again. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation.",
    "6": "Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Mike and Abby clasp hands and hold each other around the waist as they sink down, moving their shoulders seductively from side to side. They turn, round and round, moving smoothly to the music, and Abby leans back on Mike's arm as they dance with their hands held palm to palm. They hold hands above their heads as Mike sinks down, and Abby sways rhythmically to the music while Mike caresses her hair and runs his hands down her sides. Abby spins out, swishing her hair around, and Mike pulls her close as they continue to dance, smiling happily. Abby wraps her arms around Mike's neck and they dance close, as he spins her back and forth, then pulls her closer. Abby and Mike's noses almost touch, and they gaze at each other with their mouths slightly open, as if they're about to kiss. Abby blinks, surprised, and Mike forces himself to nod. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. Abby smiles nervously and heads off, with Mike following, looking dazed. Abby carries her shoes as she walks with Mike to an elevator, and he presses the call button. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. Mike turns and faces Abby, and they both fidget awkwardly before stepping into the elevator and standing side by side. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Mike presses buttons and loosens his jacket as she flashes a smile at him. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. They hug, and he stops the doors from closing so they can hug again. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation.",
    "7": "Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Mike and Abby clasp hands and hold each other around the waist as they sink down, moving their shoulders seductively from side to side. They turn, round and round, moving smoothly to the music, and Abby leans back on Mike's arm as they dance with their hands held palm to palm. They hold hands above their heads as Mike sinks down, and Abby sways rhythmically to the music while Mike caresses her hair and runs his hands down her sides. Abby spins out, swishing her hair around, and Mike pulls her close as they continue to dance, smiling happily. Abby wraps her arms around Mike's neck and they dance close, as he spins her back and forth, then pulls her closer. Abby and Mike's noses almost touch, and they gaze at each other with their mouths slightly open, as if they're about to kiss. Abby blinks, surprised, and Mike forces himself to nod. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. Abby smiles nervously and heads off, with Mike following, looking dazed. Abby carries her shoes as she walks with Mike to an elevator, and he presses the call button. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. Mike turns and faces Abby, and they both fidget awkwardly before stepping into the elevator and standing side by side. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Mike presses buttons and loosens his jacket as she flashes a smile at him. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. They hug, and he stops the doors from closing so they can hug again. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation.",
    "8": "Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Mike and Abby clasp hands and hold each other around the waist as they sink down, moving their shoulders seductively from side to side. They turn, round and round, moving smoothly to the music, and Abby leans back on Mike's arm as they dance with their hands held palm to palm. They hold hands above their heads as Mike sinks down, and Abby sways rhythmically to the music while Mike caresses her hair and runs his hands down her sides. Abby spins out, swishing her hair around, and Mike pulls her close as they continue to dance, smiling happily. Abby wraps her arms around Mike's neck and they dance close, as he spins her back and forth, then pulls her closer. Abby and Mike's noses almost touch, and they gaze at each other with their mouths slightly open, as if they're about to kiss. Abby blinks, surprised, and Mike forces himself to nod. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. Abby smiles nervously and heads off, with Mike following, looking dazed. Abby carries her shoes as she walks with Mike to an elevator, and he presses the call button. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. Mike turns and faces Abby, and they both fidget awkwardly before stepping into the elevator and standing side by side. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Mike presses buttons and loosens his jacket as she flashes a smile at him. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. They hug, and he stops the doors from closing so they can hug again. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation.",
    "9": "Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Mike and Abby clasp hands and hold each other around the waist as they sink down, moving their shoulders seductively from side to side. They turn, round and round, moving smoothly to the music, and Abby leans back on Mike's arm as they dance with their hands held palm to palm. They hold hands above their heads as Mike sinks down, and Abby sways rhythmically to the music while Mike caresses her hair and runs his hands down her sides. Abby spins out, swishing her hair around, and Mike pulls her close as they continue to dance, smiling happily. Abby wraps her arms around Mike's neck and they dance close, as he spins her back and forth, then pulls her closer. Abby and Mike's noses almost touch, and they gaze at each other with their mouths slightly open, as if they're about to kiss. Abby blinks, surprised, and Mike forces himself to nod. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. Abby smiles nervously and heads off, with Mike following, looking dazed. Abby carries her shoes as she walks with Mike to an elevator, and he presses the call button. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. Mike turns and faces Abby, and they both fidget awkwardly before stepping into the elevator and standing side by side. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Mike presses buttons and loosens his jacket as she flashes a smile at him. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. They hug, and he stops the doors from closing so they can hug again. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation.",
    "10": "Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Mike and Abby clasp hands and hold each other around the waist as they sink down, moving their shoulders seductively from side to side. They turn, round and round, moving smoothly to the music, and Abby leans back on Mike's arm as they dance with their hands held palm to palm. They hold hands above their heads as Mike sinks down, and Abby sways rhythmically to the music while Mike caresses her hair and runs his hands down her sides. Abby spins out, swishing her hair around, and Mike pulls her close as they continue to dance, smiling happily. Abby wraps her arms around Mike's neck and they dance close, as he spins her back and forth, then pulls her closer. Abby and Mike's noses almost touch, and they gaze at each other with their mouths slightly open, as if they're about to kiss. Abby blinks, surprised, and Mike forces himself to nod. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. Abby smiles nervously and heads off, with Mike following, looking dazed. Abby carries her shoes as she walks with Mike to an elevator, and he presses the call button. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. Mike turns and faces Abby, and they both fidget awkwardly before stepping into the elevator and standing side by side. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Mike presses buttons and loosens his jacket as she flashes a smile at him. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. They hug, and he stops the doors from closing so they can hug again. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation."
  }
}