{
  "ground_truth": "Forrest runs across a cobble-stone bridge with the Rocky Mountains in the distance, and split rail fences line the road as he runs through some meadowland. Meanwhile, three men in the barber shop watch the news on television, and Jenny fills customer's coffee cups. Forrest continues running as a young man runs up to him and jogs behind him, as Forrest runs up a slope on a high mountain road with a group of people jogging behind him. The large group follows Forrest across the desert road, through a small town, where a man runs up and talks to him, while a hippie stops to ponder a profound thought. A truck with a bumper sticker drives into an intersection and collides with a car. Forrest runs, followed by his group, as another man runs up to him. Forrest wipes his face on a towel and hands it back to the man, who looks at the T-shirt. Forrest runs with a group that follows behind him until he stops, and the group stops behind him. Forrest stands and looks as the group waits expectantly, then he turns and looks, walks toward the group, which parts for him as he walks down the middle of the road. A television shows President Reagan and his staff reacting to gunshots in front of a limo, while Forrest sits eating a sandwich, watching the news of the assassination attempt. Forrest takes a letter out of his pocket, which an elderly woman looks at, then hastily grabs his suitcase and letter as he stands. A truck honks its horn as Forrest runs across the street past the truck, and the elderly woman shouts from the bus stop bench as Jenny opens and then shuts the door.",
  "iterations": {
    "1": "Forrest runs across a cobble-stone bridge with the Rocky Mountains in the distance, and split rail fences line the road as he runs through some meadowland. Meanwhile, three men in the barber shop watch the news on television, and Jenny fills customer's coffee cups. Forrest continues running as a young man runs up to him and jogs behind him, as Forrest runs up a slope on a high mountain road with a group of people jogging behind him. The large group follows Forrest across the desert road, through a small town, where a man runs up and talks to him, while a hippie stops to ponder a profound thought. A truck with a bumper sticker drives into an intersection and collides with a car. Forrest runs, followed by his group, as another man runs up to him. Forrest wipes his face on a towel and hands it back to the man, who looks at the T-shirt. Forrest runs with a group that follows behind him until he stops, and the group stops behind him. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Forrest stands and looks as the group waits expectantly, then he turns and looks, walks toward the group, which parts for him as he walks down the middle of the road. A television shows President Reagan and his staff reacting to gunshots in front of a limo, while Forrest sits eating a sandwich, watching the news of the assassination attempt. Forrest takes a letter out of his pocket, which an elderly woman looks at, then hastily grabs his suitcase and letter as he stands. A truck honks its horn as Forrest runs across the street past the truck, and the elderly woman shouts from the bus stop bench as Jenny opens and then shuts the door.",
    "2": "Forrest runs across a cobble-stone bridge with the Rocky Mountains in the distance, and split rail fences line the road as he runs through some meadowland. Meanwhile, three men in the barber shop watch the news on television, and Jenny fills customer's coffee cups. Forrest continues running as a young man runs up to him and jogs behind him, as Forrest runs up a slope on a high mountain road with a group of people jogging behind him. The large group follows Forrest across the desert road, through a small town, where a man runs up and talks to him, while a hippie stops to ponder a profound thought. A truck with a bumper sticker drives into an intersection and collides with a car. Forrest runs, followed by his group, as another man runs up to him. Forrest wipes his face on a towel and hands it back to the man, who looks at the T-shirt. Forrest runs with a group that follows behind him until he stops, and the group stops behind him. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Forrest stands and looks as the group waits expectantly, then he turns and looks, walks toward the group, which parts for him as he walks down the middle of the road. A television shows President Reagan and his staff reacting to gunshots in front of a limo, while Forrest sits eating a sandwich, watching the news of the assassination attempt. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Forrest takes a letter out of his pocket, which an elderly woman looks at, then hastily grabs his suitcase and letter as he stands. A truck honks its horn as Forrest runs across the street past the truck, and the elderly woman shouts from the bus stop bench as Jenny opens and then shuts the door.",
    "3": "Forrest runs across a cobble-stone bridge with the Rocky Mountains in the distance, and split rail fences line the road as he runs through some meadowland. Meanwhile, three men in the barber shop watch the news on television, and Jenny fills customer's coffee cups. Forrest continues running as a young man runs up to him and jogs behind him, as Forrest runs up a slope on a high mountain road with a group of people jogging behind him. The large group follows Forrest across the desert road, through a small town, where a man runs up and talks to him, while a hippie stops to ponder a profound thought. A truck with a bumper sticker drives into an intersection and collides with a car. Forrest runs, followed by his group, as another man runs up to him. Forrest wipes his face on a towel and hands it back to the man, who looks at the T-shirt. Forrest runs with a group that follows behind him until he stops, and the group stops behind him. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Forrest stands and looks as the group waits expectantly, then he turns and looks, walks toward the group, which parts for him as he walks down the middle of the road. A television shows President Reagan and his staff reacting to gunshots in front of a limo, while Forrest sits eating a sandwich, watching the news of the assassination attempt. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Forrest takes a letter out of his pocket, which an elderly woman looks at, then hastily grabs his suitcase and letter as he stands. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. A truck honks its horn as Forrest runs across the street past the truck, and the elderly woman shouts from the bus stop bench as Jenny opens and then shuts the door.",
    "4": "Forrest runs across a cobble-stone bridge with the Rocky Mountains in the distance, and split rail fences line the road as he runs through some meadowland. Meanwhile, three men in the barber shop watch the news on television, and Jenny fills customer's coffee cups. Forrest continues running as a young man runs up to him and jogs behind him, as Forrest runs up a slope on a high mountain road with a group of people jogging behind him. The large group follows Forrest across the desert road, through a small town, where a man runs up and talks to him, while a hippie stops to ponder a profound thought. A truck with a bumper sticker drives into an intersection and collides with a car. Forrest runs, followed by his group, as another man runs up to him. Forrest wipes his face on a towel and hands it back to the man, who looks at the T-shirt. Forrest runs with a group that follows behind him until he stops, and the group stops behind him. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Forrest stands and looks as the group waits expectantly, then he turns and looks, walks toward the group, which parts for him as he walks down the middle of the road. A television shows President Reagan and his staff reacting to gunshots in front of a limo, while Forrest sits eating a sandwich, watching the news of the assassination attempt. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Forrest takes a letter out of his pocket, which an elderly woman looks at, then hastily grabs his suitcase and letter as he stands. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. A truck honks its horn as Forrest runs across the street past the truck, and the elderly woman shouts from the bus stop bench as Jenny opens and then shuts the door.",
    "5": "Forrest runs across a cobble-stone bridge with the Rocky Mountains in the distance, and split rail fences line the road as he runs through some meadowland. Meanwhile, three men in the barber shop watch the news on television, and Jenny fills customer's coffee cups. Forrest continues running as a young man runs up to him and jogs behind him, as Forrest runs up a slope on a high mountain road with a group of people jogging behind him. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. The large group follows Forrest across the desert road, through a small town, where a man runs up and talks to him, while a hippie stops to ponder a profound thought. A truck with a bumper sticker drives into an intersection and collides with a car. Forrest runs, followed by his group, as another man runs up to him. Forrest wipes his face on a towel and hands it back to the man, who looks at the T-shirt. Forrest runs with a group that follows behind him until he stops, and the group stops behind him. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Forrest stands and looks as the group waits expectantly, then he turns and looks, walks toward the group, which parts for him as he walks down the middle of the road. A television shows President Reagan and his staff reacting to gunshots in front of a limo, while Forrest sits eating a sandwich, watching the news of the assassination attempt. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Forrest takes a letter out of his pocket, which an elderly woman looks at, then hastily grabs his suitcase and letter as he stands. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. A truck honks its horn as Forrest runs across the street past the truck, and the elderly woman shouts from the bus stop bench as Jenny opens and then shuts the door.",
    "6": "Forrest runs across a cobble-stone bridge with the Rocky Mountains in the distance, and split rail fences line the road as he runs through some meadowland. Meanwhile, three men in the barber shop watch the news on television, and Jenny fills customer's coffee cups. Forrest continues running as a young man runs up to him and jogs behind him, as Forrest runs up a slope on a high mountain road with a group of people jogging behind him. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. The large group follows Forrest across the desert road, through a small town, where a man runs up and talks to him, while a hippie stops to ponder a profound thought. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. A truck with a bumper sticker drives into an intersection and collides with a car. Forrest runs, followed by his group, as another man runs up to him. Forrest wipes his face on a towel and hands it back to the man, who looks at the T-shirt. Forrest runs with a group that follows behind him until he stops, and the group stops behind him. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Forrest stands and looks as the group waits expectantly, then he turns and looks, walks toward the group, which parts for him as he walks down the middle of the road. A television shows President Reagan and his staff reacting to gunshots in front of a limo, while Forrest sits eating a sandwich, watching the news of the assassination attempt. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Forrest takes a letter out of his pocket, which an elderly woman looks at, then hastily grabs his suitcase and letter as he stands. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. A truck honks its horn as Forrest runs across the street past the truck, and the elderly woman shouts from the bus stop bench as Jenny opens and then shuts the door.",
    "7": "Forrest runs across a cobble-stone bridge with the Rocky Mountains in the distance, and split rail fences line the road as he runs through some meadowland. Meanwhile, three men in the barber shop watch the news on television, and Jenny fills customer's coffee cups. Forrest continues running as a young man runs up to him and jogs behind him, as Forrest runs up a slope on a high mountain road with a group of people jogging behind him. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. The large group follows Forrest across the desert road, through a small town, where a man runs up and talks to him, while a hippie stops to ponder a profound thought. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. A truck with a bumper sticker drives into an intersection and collides with a car. Forrest runs, followed by his group, as another man runs up to him. Forrest wipes his face on a towel and hands it back to the man, who looks at the T-shirt. Forrest runs with a group that follows behind him until he stops, and the group stops behind him. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Forrest stands and looks as the group waits expectantly, then he turns and looks, walks toward the group, which parts for him as he walks down the middle of the road. A television shows President Reagan and his staff reacting to gunshots in front of a limo, while Forrest sits eating a sandwich, watching the news of the assassination attempt. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Forrest takes a letter out of his pocket, which an elderly woman looks at, then hastily grabs his suitcase and letter as he stands. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. A truck honks its horn as Forrest runs across the street past the truck, and the elderly woman shouts from the bus stop bench as Jenny opens and then shuts the door.",
    "8": "Forrest runs across a cobble-stone bridge with the Rocky Mountains in the distance, and split rail fences line the road as he runs through some meadowland. Meanwhile, three men in the barber shop watch the news on television, and Jenny fills customer's coffee cups. Forrest continues running as a young man runs up to him and jogs behind him, as Forrest runs up a slope on a high mountain road with a group of people jogging behind him. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. The large group follows Forrest across the desert road, through a small town, where a man runs up and talks to him, while a hippie stops to ponder a profound thought. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. A truck with a bumper sticker drives into an intersection and collides with a car. Forrest runs, followed by his group, as another man runs up to him. Forrest wipes his face on a towel and hands it back to the man, who looks at the T-shirt. Forrest runs with a group that follows behind him until he stops, and the group stops behind him. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Forrest stands and looks as the group waits expectantly, then he turns and looks, walks toward the group, which parts for him as he walks down the middle of the road. A television shows President Reagan and his staff reacting to gunshots in front of a limo, while Forrest sits eating a sandwich, watching the news of the assassination attempt. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Forrest takes a letter out of his pocket, which an elderly woman looks at, then hastily grabs his suitcase and letter as he stands. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. A truck honks its horn as Forrest runs across the street past the truck, and the elderly woman shouts from the bus stop bench as Jenny opens and then shuts the door.",
    "9": "Forrest runs across a cobble-stone bridge with the Rocky Mountains in the distance, and split rail fences line the road as he runs through some meadowland. Meanwhile, three men in the barber shop watch the news on television, and Jenny fills customer's coffee cups. Forrest continues running as a young man runs up to him and jogs behind him, as Forrest runs up a slope on a high mountain road with a group of people jogging behind him. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. The large group follows Forrest across the desert road, through a small town, where a man runs up and talks to him, while a hippie stops to ponder a profound thought. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. A truck with a bumper sticker drives into an intersection and collides with a car. Forrest runs, followed by his group, as another man runs up to him. Forrest wipes his face on a towel and hands it back to the man, who looks at the T-shirt. Forrest runs with a group that follows behind him until he stops, and the group stops behind him. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Forrest stands and looks as the group waits expectantly, then he turns and looks, walks toward the group, which parts for him as he walks down the middle of the road. A television shows President Reagan and his staff reacting to gunshots in front of a limo, while Forrest sits eating a sandwich, watching the news of the assassination attempt. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Forrest takes a letter out of his pocket, which an elderly woman looks at, then hastily grabs his suitcase and letter as he stands. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. A truck honks its horn as Forrest runs across the street past the truck, and the elderly woman shouts from the bus stop bench as Jenny opens and then shuts the door.",
    "10": "Forrest runs across a cobble-stone bridge with the Rocky Mountains in the distance, and split rail fences line the road as he runs through some meadowland. Meanwhile, three men in the barber shop watch the news on television, and Jenny fills customer's coffee cups. Forrest continues running as a young man runs up to him and jogs behind him, as Forrest runs up a slope on a high mountain road with a group of people jogging behind him. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. The large group follows Forrest across the desert road, through a small town, where a man runs up and talks to him, while a hippie stops to ponder a profound thought. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. A truck with a bumper sticker drives into an intersection and collides with a car. Forrest runs, followed by his group, as another man runs up to him. Forrest wipes his face on a towel and hands it back to the man, who looks at the T-shirt. Forrest runs with a group that follows behind him until he stops, and the group stops behind him. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Forrest stands and looks as the group waits expectantly, then he turns and looks, walks toward the group, which parts for him as he walks down the middle of the road. A television shows President Reagan and his staff reacting to gunshots in front of a limo, while Forrest sits eating a sandwich, watching the news of the assassination attempt. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Forrest takes a letter out of his pocket, which an elderly woman looks at, then hastily grabs his suitcase and letter as he stands. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. A truck honks its horn as Forrest runs across the street past the truck, and the elderly woman shouts from the bus stop bench as Jenny opens and then shuts the door."
  }
}