{
  "ground_truth": "Lizzie and the Gardiners are traveling through the rolling hills of the Peaks. Darcy is practicing his fencing. They shake hands and Baines leaves. Lizzie is picking her way across the rocks at the top of a hill, while the Gardiners are watching her from the bottom of the slope. Lizzie gazes at the countryside around her. That evening, the three of them are eating supper. Mrs. Gardiner looks at Lizzie, and Lizzie smiles. The next day, the open-topped carriage is making its way through the green countryside, towards Pemberley. It crosses a tiny, single-arched bridge over a stream. Lizzie and Mrs. Gardiner sit facing Mr. Gardiner. The carriage continues on its way, passing through woods in the bright sunshine. Then, the magnificent Pemberley appears, and Lizzie's breath is taken away by the sheer splendor of the classical, stately home.",
  "iterations": {
    "1": "Lizzie and the Gardiners are traveling through the rolling hills of the Peaks. Darcy is practicing his fencing. They shake hands and Baines leaves. Lizzie is picking her way across the rocks at the top of a hill, while the Gardiners are watching her from the bottom of the slope. Lizzie gazes at the countryside around her. That evening, the three of them are eating supper. Mrs. Gardiner looks at Lizzie, and Lizzie smiles. The next day, the open-topped carriage is making its way through the green countryside, towards Pemberley. It crosses a tiny, single-arched bridge over a stream. Lizzie and Mrs. Gardiner sit facing Mr. Gardiner. The carriage continues on its way, passing through woods in the bright sunshine. Then, the magnificent Pemberley appears, and Lizzie's breath is taken away by the sheer splendor of the classical, stately home. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels.",
    "2": "Lizzie and the Gardiners are traveling through the rolling hills of the Peaks. Darcy is practicing his fencing. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. They shake hands and Baines leaves. Lizzie is picking her way across the rocks at the top of a hill, while the Gardiners are watching her from the bottom of the slope. Lizzie gazes at the countryside around her. That evening, the three of them are eating supper. Mrs. Gardiner looks at Lizzie, and Lizzie smiles. The next day, the open-topped carriage is making its way through the green countryside, towards Pemberley. It crosses a tiny, single-arched bridge over a stream. Lizzie and Mrs. Gardiner sit facing Mr. Gardiner. The carriage continues on its way, passing through woods in the bright sunshine. Then, the magnificent Pemberley appears, and Lizzie's breath is taken away by the sheer splendor of the classical, stately home. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels.",
    "3": "Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Lizzie and the Gardiners are traveling through the rolling hills of the Peaks. Darcy is practicing his fencing. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. They shake hands and Baines leaves. Lizzie is picking her way across the rocks at the top of a hill, while the Gardiners are watching her from the bottom of the slope. Lizzie gazes at the countryside around her. That evening, the three of them are eating supper. Mrs. Gardiner looks at Lizzie, and Lizzie smiles. The next day, the open-topped carriage is making its way through the green countryside, towards Pemberley. It crosses a tiny, single-arched bridge over a stream. Lizzie and Mrs. Gardiner sit facing Mr. Gardiner. The carriage continues on its way, passing through woods in the bright sunshine. Then, the magnificent Pemberley appears, and Lizzie's breath is taken away by the sheer splendor of the classical, stately home. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels.",
    "4": "Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Lizzie and the Gardiners are traveling through the rolling hills of the Peaks. Darcy is practicing his fencing. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. They shake hands and Baines leaves. Lizzie is picking her way across the rocks at the top of a hill, while the Gardiners are watching her from the bottom of the slope. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Lizzie gazes at the countryside around her. That evening, the three of them are eating supper. Mrs. Gardiner looks at Lizzie, and Lizzie smiles. The next day, the open-topped carriage is making its way through the green countryside, towards Pemberley. It crosses a tiny, single-arched bridge over a stream. Lizzie and Mrs. Gardiner sit facing Mr. Gardiner. The carriage continues on its way, passing through woods in the bright sunshine. Then, the magnificent Pemberley appears, and Lizzie's breath is taken away by the sheer splendor of the classical, stately home. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels.",
    "5": "Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Lizzie and the Gardiners are traveling through the rolling hills of the Peaks. Darcy is practicing his fencing. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. They shake hands and Baines leaves. Lizzie is picking her way across the rocks at the top of a hill, while the Gardiners are watching her from the bottom of the slope. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Lizzie gazes at the countryside around her. That evening, the three of them are eating supper. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. Mrs. Gardiner looks at Lizzie, and Lizzie smiles. The next day, the open-topped carriage is making its way through the green countryside, towards Pemberley. It crosses a tiny, single-arched bridge over a stream. Lizzie and Mrs. Gardiner sit facing Mr. Gardiner. The carriage continues on its way, passing through woods in the bright sunshine. Then, the magnificent Pemberley appears, and Lizzie's breath is taken away by the sheer splendor of the classical, stately home. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels.",
    "6": "Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Lizzie and the Gardiners are traveling through the rolling hills of the Peaks. Darcy is practicing his fencing. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. They shake hands and Baines leaves. Lizzie is picking her way across the rocks at the top of a hill, while the Gardiners are watching her from the bottom of the slope. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Lizzie gazes at the countryside around her. That evening, the three of them are eating supper. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. Mrs. Gardiner looks at Lizzie, and Lizzie smiles. The next day, the open-topped carriage is making its way through the green countryside, towards Pemberley. It crosses a tiny, single-arched bridge over a stream. Lizzie and Mrs. Gardiner sit facing Mr. Gardiner. The carriage continues on its way, passing through woods in the bright sunshine. Then, the magnificent Pemberley appears, and Lizzie's breath is taken away by the sheer splendor of the classical, stately home. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance.",
    "7": "Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Lizzie and the Gardiners are traveling through the rolling hills of the Peaks. Darcy is practicing his fencing. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. They shake hands and Baines leaves. Lizzie is picking her way across the rocks at the top of a hill, while the Gardiners are watching her from the bottom of the slope. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Lizzie gazes at the countryside around her. That evening, the three of them are eating supper. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. Mrs. Gardiner looks at Lizzie, and Lizzie smiles. The next day, the open-topped carriage is making its way through the green countryside, towards Pemberley. It crosses a tiny, single-arched bridge over a stream. Lizzie and Mrs. Gardiner sit facing Mr. Gardiner. The carriage continues on its way, passing through woods in the bright sunshine. Then, the magnificent Pemberley appears, and Lizzie's breath is taken away by the sheer splendor of the classical, stately home. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance.",
    "8": "Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Lizzie and the Gardiners are traveling through the rolling hills of the Peaks. Darcy is practicing his fencing. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. They shake hands and Baines leaves. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Lizzie is picking her way across the rocks at the top of a hill, while the Gardiners are watching her from the bottom of the slope. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Lizzie gazes at the countryside around her. That evening, the three of them are eating supper. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. Mrs. Gardiner looks at Lizzie, and Lizzie smiles. The next day, the open-topped carriage is making its way through the green countryside, towards Pemberley. It crosses a tiny, single-arched bridge over a stream. Lizzie and Mrs. Gardiner sit facing Mr. Gardiner. The carriage continues on its way, passing through woods in the bright sunshine. Then, the magnificent Pemberley appears, and Lizzie's breath is taken away by the sheer splendor of the classical, stately home. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance.",
    "9": "Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Lizzie and the Gardiners are traveling through the rolling hills of the Peaks. Darcy is practicing his fencing. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. They shake hands and Baines leaves. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Lizzie is picking her way across the rocks at the top of a hill, while the Gardiners are watching her from the bottom of the slope. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Lizzie gazes at the countryside around her. That evening, the three of them are eating supper. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. Mrs. Gardiner looks at Lizzie, and Lizzie smiles. The next day, the open-topped carriage is making its way through the green countryside, towards Pemberley. It crosses a tiny, single-arched bridge over a stream. Lizzie and Mrs. Gardiner sit facing Mr. Gardiner. The carriage continues on its way, passing through woods in the bright sunshine. Then, the magnificent Pemberley appears, and Lizzie's breath is taken away by the sheer splendor of the classical, stately home. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance.",
    "10": "Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Lizzie and the Gardiners are traveling through the rolling hills of the Peaks. Darcy is practicing his fencing. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. They shake hands and Baines leaves. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. Lizzie is picking her way across the rocks at the top of a hill, while the Gardiners are watching her from the bottom of the slope. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Lizzie gazes at the countryside around her. That evening, the three of them are eating supper. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. Mrs. Gardiner looks at Lizzie, and Lizzie smiles. The next day, the open-topped carriage is making its way through the green countryside, towards Pemberley. It crosses a tiny, single-arched bridge over a stream. Lizzie and Mrs. Gardiner sit facing Mr. Gardiner. The carriage continues on its way, passing through woods in the bright sunshine. Then, the magnificent Pemberley appears, and Lizzie's breath is taken away by the sheer splendor of the classical, stately home. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance."
  }
}