{
  "ground_truth": "A police officer escorts Jenny to her grandmother's trailer, where Jenny's grandmother meets her outside and leads her toward the trailer. Jenny later climbs over a second-floor railing and enters the house, lying in bed next to young Forrest and hugging him. As teenagers, Forrest and Jenny walk along an oak-lined road until Forrest is suddenly hit in the back with a rock. They turn around to see a teenage boy throwing another rock, just as a pickup truck pulls up. Jenny turns and looks at Forrest, who drops his books and runs down the road. The teenage boy jumps into the back of the pickup truck with another boy as the truck speeds after Forrest, and Jenny steps left to get out of the way. Forrest leaps over a five-foot fence as the boys try to catch him and looks left while continuing to tell his life story. He runs along the road in front of the high school as the truck chases him and the boys pound on the roof. Forrest runs under the field goal post and through the end zone. The crowd roars with excitement as a football is kicked off and players run around the field. Forrest is seen in a University of Alabama football uniform, looking up into the cheering crowd as his teammate fields the kickoff and hands him the ball. The football coach, assistants, and Alabama players cheer for Forrest as he runs across the field, speeds past defending and opposing players.",
  "iterations": {
    "1": "A police officer escorts Jenny to her grandmother's trailer, where Jenny's grandmother meets her outside and leads her toward the trailer. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. Jenny later climbs over a second-floor railing and enters the house, lying in bed next to young Forrest and hugging him. As teenagers, Forrest and Jenny walk along an oak-lined road until Forrest is suddenly hit in the back with a rock. They turn around to see a teenage boy throwing another rock, just as a pickup truck pulls up. Jenny turns and looks at Forrest, who drops his books and runs down the road. The teenage boy jumps into the back of the pickup truck with another boy as the truck speeds after Forrest, and Jenny steps left to get out of the way. Forrest leaps over a five-foot fence as the boys try to catch him and looks left while continuing to tell his life story. He runs along the road in front of the high school as the truck chases him and the boys pound on the roof. Forrest runs under the field goal post and through the end zone. The crowd roars with excitement as a football is kicked off and players run around the field. Forrest is seen in a University of Alabama football uniform, looking up into the cheering crowd as his teammate fields the kickoff and hands him the ball. The football coach, assistants, and Alabama players cheer for Forrest as he runs across the field, speeds past defending and opposing players.",
    "2": "A police officer escorts Jenny to her grandmother's trailer, where Jenny's grandmother meets her outside and leads her toward the trailer. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. Jenny later climbs over a second-floor railing and enters the house, lying in bed next to young Forrest and hugging him. As teenagers, Forrest and Jenny walk along an oak-lined road until Forrest is suddenly hit in the back with a rock. They turn around to see a teenage boy throwing another rock, just as a pickup truck pulls up. Jenny turns and looks at Forrest, who drops his books and runs down the road. The teenage boy jumps into the back of the pickup truck with another boy as the truck speeds after Forrest, and Jenny steps left to get out of the way. Forrest leaps over a five-foot fence as the boys try to catch him and looks left while continuing to tell his life story. He runs along the road in front of the high school as the truck chases him and the boys pound on the roof. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. Forrest runs under the field goal post and through the end zone. The crowd roars with excitement as a football is kicked off and players run around the field. Forrest is seen in a University of Alabama football uniform, looking up into the cheering crowd as his teammate fields the kickoff and hands him the ball. The football coach, assistants, and Alabama players cheer for Forrest as he runs across the field, speeds past defending and opposing players.",
    "3": "A police officer escorts Jenny to her grandmother's trailer, where Jenny's grandmother meets her outside and leads her toward the trailer. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. Jenny later climbs over a second-floor railing and enters the house, lying in bed next to young Forrest and hugging him. As teenagers, Forrest and Jenny walk along an oak-lined road until Forrest is suddenly hit in the back with a rock. They turn around to see a teenage boy throwing another rock, just as a pickup truck pulls up. Jenny turns and looks at Forrest, who drops his books and runs down the road. The teenage boy jumps into the back of the pickup truck with another boy as the truck speeds after Forrest, and Jenny steps left to get out of the way. Forrest leaps over a five-foot fence as the boys try to catch him and looks left while continuing to tell his life story. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. He runs along the road in front of the high school as the truck chases him and the boys pound on the roof. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. Forrest runs under the field goal post and through the end zone. The crowd roars with excitement as a football is kicked off and players run around the field. Forrest is seen in a University of Alabama football uniform, looking up into the cheering crowd as his teammate fields the kickoff and hands him the ball. The football coach, assistants, and Alabama players cheer for Forrest as he runs across the field, speeds past defending and opposing players.",
    "4": "A police officer escorts Jenny to her grandmother's trailer, where Jenny's grandmother meets her outside and leads her toward the trailer. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. Jenny later climbs over a second-floor railing and enters the house, lying in bed next to young Forrest and hugging him. As teenagers, Forrest and Jenny walk along an oak-lined road until Forrest is suddenly hit in the back with a rock. They turn around to see a teenage boy throwing another rock, just as a pickup truck pulls up. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. Jenny turns and looks at Forrest, who drops his books and runs down the road. The teenage boy jumps into the back of the pickup truck with another boy as the truck speeds after Forrest, and Jenny steps left to get out of the way. Forrest leaps over a five-foot fence as the boys try to catch him and looks left while continuing to tell his life story. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. He runs along the road in front of the high school as the truck chases him and the boys pound on the roof. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. Forrest runs under the field goal post and through the end zone. The crowd roars with excitement as a football is kicked off and players run around the field. Forrest is seen in a University of Alabama football uniform, looking up into the cheering crowd as his teammate fields the kickoff and hands him the ball. The football coach, assistants, and Alabama players cheer for Forrest as he runs across the field, speeds past defending and opposing players.",
    "5": "A police officer escorts Jenny to her grandmother's trailer, where Jenny's grandmother meets her outside and leads her toward the trailer. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. Jenny later climbs over a second-floor railing and enters the house, lying in bed next to young Forrest and hugging him. As teenagers, Forrest and Jenny walk along an oak-lined road until Forrest is suddenly hit in the back with a rock. They turn around to see a teenage boy throwing another rock, just as a pickup truck pulls up. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. Jenny turns and looks at Forrest, who drops his books and runs down the road. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. The teenage boy jumps into the back of the pickup truck with another boy as the truck speeds after Forrest, and Jenny steps left to get out of the way. Forrest leaps over a five-foot fence as the boys try to catch him and looks left while continuing to tell his life story. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. He runs along the road in front of the high school as the truck chases him and the boys pound on the roof. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. Forrest runs under the field goal post and through the end zone. The crowd roars with excitement as a football is kicked off and players run around the field. Forrest is seen in a University of Alabama football uniform, looking up into the cheering crowd as his teammate fields the kickoff and hands him the ball. The football coach, assistants, and Alabama players cheer for Forrest as he runs across the field, speeds past defending and opposing players.",
    "6": "A police officer escorts Jenny to her grandmother's trailer, where Jenny's grandmother meets her outside and leads her toward the trailer. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. Jenny later climbs over a second-floor railing and enters the house, lying in bed next to young Forrest and hugging him. As teenagers, Forrest and Jenny walk along an oak-lined road until Forrest is suddenly hit in the back with a rock. They turn around to see a teenage boy throwing another rock, just as a pickup truck pulls up. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. Jenny turns and looks at Forrest, who drops his books and runs down the road. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. The teenage boy jumps into the back of the pickup truck with another boy as the truck speeds after Forrest, and Jenny steps left to get out of the way. Forrest leaps over a five-foot fence as the boys try to catch him and looks left while continuing to tell his life story. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. He runs along the road in front of the high school as the truck chases him and the boys pound on the roof. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. Forrest runs under the field goal post and through the end zone. The crowd roars with excitement as a football is kicked off and players run around the field. Forrest is seen in a University of Alabama football uniform, looking up into the cheering crowd as his teammate fields the kickoff and hands him the ball. The football coach, assistants, and Alabama players cheer for Forrest as he runs across the field, speeds past defending and opposing players.",
    "7": "Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. A police officer escorts Jenny to her grandmother's trailer, where Jenny's grandmother meets her outside and leads her toward the trailer. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. Jenny later climbs over a second-floor railing and enters the house, lying in bed next to young Forrest and hugging him. As teenagers, Forrest and Jenny walk along an oak-lined road until Forrest is suddenly hit in the back with a rock. They turn around to see a teenage boy throwing another rock, just as a pickup truck pulls up. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. Jenny turns and looks at Forrest, who drops his books and runs down the road. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. The teenage boy jumps into the back of the pickup truck with another boy as the truck speeds after Forrest, and Jenny steps left to get out of the way. Forrest leaps over a five-foot fence as the boys try to catch him and looks left while continuing to tell his life story. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. He runs along the road in front of the high school as the truck chases him and the boys pound on the roof. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. Forrest runs under the field goal post and through the end zone. The crowd roars with excitement as a football is kicked off and players run around the field. Forrest is seen in a University of Alabama football uniform, looking up into the cheering crowd as his teammate fields the kickoff and hands him the ball. The football coach, assistants, and Alabama players cheer for Forrest as he runs across the field, speeds past defending and opposing players.",
    "8": "Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. A police officer escorts Jenny to her grandmother's trailer, where Jenny's grandmother meets her outside and leads her toward the trailer. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. Jenny later climbs over a second-floor railing and enters the house, lying in bed next to young Forrest and hugging him. As teenagers, Forrest and Jenny walk along an oak-lined road until Forrest is suddenly hit in the back with a rock. They turn around to see a teenage boy throwing another rock, just as a pickup truck pulls up. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. Jenny turns and looks at Forrest, who drops his books and runs down the road. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. The teenage boy jumps into the back of the pickup truck with another boy as the truck speeds after Forrest, and Jenny steps left to get out of the way. Forrest leaps over a five-foot fence as the boys try to catch him and looks left while continuing to tell his life story. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. He runs along the road in front of the high school as the truck chases him and the boys pound on the roof. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. Forrest runs under the field goal post and through the end zone. The crowd roars with excitement as a football is kicked off and players run around the field. Forrest is seen in a University of Alabama football uniform, looking up into the cheering crowd as his teammate fields the kickoff and hands him the ball. The football coach, assistants, and Alabama players cheer for Forrest as he runs across the field, speeds past defending and opposing players.",
    "9": "Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. A police officer escorts Jenny to her grandmother's trailer, where Jenny's grandmother meets her outside and leads her toward the trailer. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. Jenny later climbs over a second-floor railing and enters the house, lying in bed next to young Forrest and hugging him. As teenagers, Forrest and Jenny walk along an oak-lined road until Forrest is suddenly hit in the back with a rock. They turn around to see a teenage boy throwing another rock, just as a pickup truck pulls up. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. Jenny turns and looks at Forrest, who drops his books and runs down the road. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. The teenage boy jumps into the back of the pickup truck with another boy as the truck speeds after Forrest, and Jenny steps left to get out of the way. Forrest leaps over a five-foot fence as the boys try to catch him and looks left while continuing to tell his life story. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. He runs along the road in front of the high school as the truck chases him and the boys pound on the roof. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. Forrest runs under the field goal post and through the end zone. The crowd roars with excitement as a football is kicked off and players run around the field. Forrest is seen in a University of Alabama football uniform, looking up into the cheering crowd as his teammate fields the kickoff and hands him the ball. The football coach, assistants, and Alabama players cheer for Forrest as he runs across the field, speeds past defending and opposing players.",
    "10": "Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. A police officer escorts Jenny to her grandmother's trailer, where Jenny's grandmother meets her outside and leads her toward the trailer. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. Jenny later climbs over a second-floor railing and enters the house, lying in bed next to young Forrest and hugging him. As teenagers, Forrest and Jenny walk along an oak-lined road until Forrest is suddenly hit in the back with a rock. They turn around to see a teenage boy throwing another rock, just as a pickup truck pulls up. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. Jenny turns and looks at Forrest, who drops his books and runs down the road. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. The teenage boy jumps into the back of the pickup truck with another boy as the truck speeds after Forrest, and Jenny steps left to get out of the way. Forrest leaps over a five-foot fence as the boys try to catch him and looks left while continuing to tell his life story. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. He runs along the road in front of the high school as the truck chases him and the boys pound on the roof. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. Forrest runs under the field goal post and through the end zone. The crowd roars with excitement as a football is kicked off and players run around the field. Forrest is seen in a University of Alabama football uniform, looking up into the cheering crowd as his teammate fields the kickoff and hands him the ball. The football coach, assistants, and Alabama players cheer for Forrest as he runs across the field, speeds past defending and opposing players."
  }
}