{
  "ground_truth": "In the movie, Nullah runs towards him, and Flynn is trampled by the panicked animals. Nullah winces at the sight and stands alone, facing the stampede on the cliff edge, as the stampede gets closer in slow motion. Drover and Sarah urge their horses on, while Fletcher grins cruelly. Nullah concentrates and stretches out his arms, and his grandfather chants with him. He stands right on the cliff edge as the herd slows and, just yards from him, comes to a stop. King George looks down on the scene, and as Sarah and Drover arrive, Nullah starts to cry. Sarah dismounts and grabs him just before he falls into the abyss, and Drover grabs them both, pulling them backward to safety. Nullah stares up at Sarah, then turns and nuzzles into her shoulder, while Drover stands awkwardly and backs away from the pair. King George smiles proudly. Drover gallops to Flynn, who lies twisted and bloody in the dust, placing his ear close to Flynn's mouth to hear him as his eyes flutter and close. Drover frowns, looks down at Flynn, picks up his hat from next to the dead man, and puts it on while holding Flynn's harmonica. Later, Nullah holds the harmonica as Sarah sits in the smoking remnants of their camp, holding out one of her hats, which she drops on the ground as her face creases with grief.",
  "iterations": {
    "1": "In the movie, Nullah runs towards him, and Flynn is trampled by the panicked animals. Nullah winces at the sight and stands alone, facing the stampede on the cliff edge, as the stampede gets closer in slow motion. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Drover and Sarah urge their horses on, while Fletcher grins cruelly. Nullah concentrates and stretches out his arms, and his grandfather chants with him. He stands right on the cliff edge as the herd slows and, just yards from him, comes to a stop. King George looks down on the scene, and as Sarah and Drover arrive, Nullah starts to cry. Sarah dismounts and grabs him just before he falls into the abyss, and Drover grabs them both, pulling them backward to safety. Nullah stares up at Sarah, then turns and nuzzles into her shoulder, while Drover stands awkwardly and backs away from the pair. King George smiles proudly. Drover gallops to Flynn, who lies twisted and bloody in the dust, placing his ear close to Flynn's mouth to hear him as his eyes flutter and close. Drover frowns, looks down at Flynn, picks up his hat from next to the dead man, and puts it on while holding Flynn's harmonica. Later, Nullah holds the harmonica as Sarah sits in the smoking remnants of their camp, holding out one of her hats, which she drops on the ground as her face creases with grief.",
    "2": "In the movie, Nullah runs towards him, and Flynn is trampled by the panicked animals. Nullah winces at the sight and stands alone, facing the stampede on the cliff edge, as the stampede gets closer in slow motion. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Drover and Sarah urge their horses on, while Fletcher grins cruelly. Nullah concentrates and stretches out his arms, and his grandfather chants with him. He stands right on the cliff edge as the herd slows and, just yards from him, comes to a stop. King George looks down on the scene, and as Sarah and Drover arrive, Nullah starts to cry. Sarah dismounts and grabs him just before he falls into the abyss, and Drover grabs them both, pulling them backward to safety. Nullah stares up at Sarah, then turns and nuzzles into her shoulder, while Drover stands awkwardly and backs away from the pair. King George smiles proudly. Drover gallops to Flynn, who lies twisted and bloody in the dust, placing his ear close to Flynn's mouth to hear him as his eyes flutter and close. Drover frowns, looks down at Flynn, picks up his hat from next to the dead man, and puts it on while holding Flynn's harmonica. Later, Nullah holds the harmonica as Sarah sits in the smoking remnants of their camp, holding out one of her hats, which she drops on the ground as her face creases with grief.",
    "3": "In the movie, Nullah runs towards him, and Flynn is trampled by the panicked animals. Nullah winces at the sight and stands alone, facing the stampede on the cliff edge, as the stampede gets closer in slow motion. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Drover and Sarah urge their horses on, while Fletcher grins cruelly. Nullah concentrates and stretches out his arms, and his grandfather chants with him. He stands right on the cliff edge as the herd slows and, just yards from him, comes to a stop. King George looks down on the scene, and as Sarah and Drover arrive, Nullah starts to cry. Sarah dismounts and grabs him just before he falls into the abyss, and Drover grabs them both, pulling them backward to safety. Nullah stares up at Sarah, then turns and nuzzles into her shoulder, while Drover stands awkwardly and backs away from the pair. King George smiles proudly. Drover gallops to Flynn, who lies twisted and bloody in the dust, placing his ear close to Flynn's mouth to hear him as his eyes flutter and close. Drover frowns, looks down at Flynn, picks up his hat from next to the dead man, and puts it on while holding Flynn's harmonica. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Later, Nullah holds the harmonica as Sarah sits in the smoking remnants of their camp, holding out one of her hats, which she drops on the ground as her face creases with grief.",
    "4": "In the movie, Nullah runs towards him, and Flynn is trampled by the panicked animals. Nullah winces at the sight and stands alone, facing the stampede on the cliff edge, as the stampede gets closer in slow motion. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Drover and Sarah urge their horses on, while Fletcher grins cruelly. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. Nullah concentrates and stretches out his arms, and his grandfather chants with him. He stands right on the cliff edge as the herd slows and, just yards from him, comes to a stop. King George looks down on the scene, and as Sarah and Drover arrive, Nullah starts to cry. Sarah dismounts and grabs him just before he falls into the abyss, and Drover grabs them both, pulling them backward to safety. Nullah stares up at Sarah, then turns and nuzzles into her shoulder, while Drover stands awkwardly and backs away from the pair. King George smiles proudly. Drover gallops to Flynn, who lies twisted and bloody in the dust, placing his ear close to Flynn's mouth to hear him as his eyes flutter and close. Drover frowns, looks down at Flynn, picks up his hat from next to the dead man, and puts it on while holding Flynn's harmonica. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Later, Nullah holds the harmonica as Sarah sits in the smoking remnants of their camp, holding out one of her hats, which she drops on the ground as her face creases with grief.",
    "5": "In the movie, Nullah runs towards him, and Flynn is trampled by the panicked animals. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. Nullah winces at the sight and stands alone, facing the stampede on the cliff edge, as the stampede gets closer in slow motion. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Drover and Sarah urge their horses on, while Fletcher grins cruelly. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. Nullah concentrates and stretches out his arms, and his grandfather chants with him. He stands right on the cliff edge as the herd slows and, just yards from him, comes to a stop. King George looks down on the scene, and as Sarah and Drover arrive, Nullah starts to cry. Sarah dismounts and grabs him just before he falls into the abyss, and Drover grabs them both, pulling them backward to safety. Nullah stares up at Sarah, then turns and nuzzles into her shoulder, while Drover stands awkwardly and backs away from the pair. King George smiles proudly. Drover gallops to Flynn, who lies twisted and bloody in the dust, placing his ear close to Flynn's mouth to hear him as his eyes flutter and close. Drover frowns, looks down at Flynn, picks up his hat from next to the dead man, and puts it on while holding Flynn's harmonica. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Later, Nullah holds the harmonica as Sarah sits in the smoking remnants of their camp, holding out one of her hats, which she drops on the ground as her face creases with grief.",
    "6": "In the movie, Nullah runs towards him, and Flynn is trampled by the panicked animals. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. Nullah winces at the sight and stands alone, facing the stampede on the cliff edge, as the stampede gets closer in slow motion. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Drover and Sarah urge their horses on, while Fletcher grins cruelly. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. Nullah concentrates and stretches out his arms, and his grandfather chants with him. He stands right on the cliff edge as the herd slows and, just yards from him, comes to a stop. King George looks down on the scene, and as Sarah and Drover arrive, Nullah starts to cry. Sarah dismounts and grabs him just before he falls into the abyss, and Drover grabs them both, pulling them backward to safety. Nullah stares up at Sarah, then turns and nuzzles into her shoulder, while Drover stands awkwardly and backs away from the pair. King George smiles proudly. Drover gallops to Flynn, who lies twisted and bloody in the dust, placing his ear close to Flynn's mouth to hear him as his eyes flutter and close. Drover frowns, looks down at Flynn, picks up his hat from next to the dead man, and puts it on while holding Flynn's harmonica. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Later, Nullah holds the harmonica as Sarah sits in the smoking remnants of their camp, holding out one of her hats, which she drops on the ground as her face creases with grief. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation.",
    "7": "On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. In the movie, Nullah runs towards him, and Flynn is trampled by the panicked animals. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. Nullah winces at the sight and stands alone, facing the stampede on the cliff edge, as the stampede gets closer in slow motion. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Drover and Sarah urge their horses on, while Fletcher grins cruelly. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. Nullah concentrates and stretches out his arms, and his grandfather chants with him. He stands right on the cliff edge as the herd slows and, just yards from him, comes to a stop. King George looks down on the scene, and as Sarah and Drover arrive, Nullah starts to cry. Sarah dismounts and grabs him just before he falls into the abyss, and Drover grabs them both, pulling them backward to safety. Nullah stares up at Sarah, then turns and nuzzles into her shoulder, while Drover stands awkwardly and backs away from the pair. King George smiles proudly. Drover gallops to Flynn, who lies twisted and bloody in the dust, placing his ear close to Flynn's mouth to hear him as his eyes flutter and close. Drover frowns, looks down at Flynn, picks up his hat from next to the dead man, and puts it on while holding Flynn's harmonica. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Later, Nullah holds the harmonica as Sarah sits in the smoking remnants of their camp, holding out one of her hats, which she drops on the ground as her face creases with grief. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation.",
    "8": "Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. In the movie, Nullah runs towards him, and Flynn is trampled by the panicked animals. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. Nullah winces at the sight and stands alone, facing the stampede on the cliff edge, as the stampede gets closer in slow motion. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Drover and Sarah urge their horses on, while Fletcher grins cruelly. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. Nullah concentrates and stretches out his arms, and his grandfather chants with him. He stands right on the cliff edge as the herd slows and, just yards from him, comes to a stop. King George looks down on the scene, and as Sarah and Drover arrive, Nullah starts to cry. Sarah dismounts and grabs him just before he falls into the abyss, and Drover grabs them both, pulling them backward to safety. Nullah stares up at Sarah, then turns and nuzzles into her shoulder, while Drover stands awkwardly and backs away from the pair. King George smiles proudly. Drover gallops to Flynn, who lies twisted and bloody in the dust, placing his ear close to Flynn's mouth to hear him as his eyes flutter and close. Drover frowns, looks down at Flynn, picks up his hat from next to the dead man, and puts it on while holding Flynn's harmonica. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Later, Nullah holds the harmonica as Sarah sits in the smoking remnants of their camp, holding out one of her hats, which she drops on the ground as her face creases with grief. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation.",
    "9": "Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. In the movie, Nullah runs towards him, and Flynn is trampled by the panicked animals. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. Nullah winces at the sight and stands alone, facing the stampede on the cliff edge, as the stampede gets closer in slow motion. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Drover and Sarah urge their horses on, while Fletcher grins cruelly. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. Nullah concentrates and stretches out his arms, and his grandfather chants with him. He stands right on the cliff edge as the herd slows and, just yards from him, comes to a stop. King George looks down on the scene, and as Sarah and Drover arrive, Nullah starts to cry. Sarah dismounts and grabs him just before he falls into the abyss, and Drover grabs them both, pulling them backward to safety. Nullah stares up at Sarah, then turns and nuzzles into her shoulder, while Drover stands awkwardly and backs away from the pair. King George smiles proudly. Drover gallops to Flynn, who lies twisted and bloody in the dust, placing his ear close to Flynn's mouth to hear him as his eyes flutter and close. Drover frowns, looks down at Flynn, picks up his hat from next to the dead man, and puts it on while holding Flynn's harmonica. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Later, Nullah holds the harmonica as Sarah sits in the smoking remnants of their camp, holding out one of her hats, which she drops on the ground as her face creases with grief. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation.",
    "10": "Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. In the movie, Nullah runs towards him, and Flynn is trampled by the panicked animals. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. Nullah winces at the sight and stands alone, facing the stampede on the cliff edge, as the stampede gets closer in slow motion. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Drover and Sarah urge their horses on, while Fletcher grins cruelly. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. Nullah concentrates and stretches out his arms, and his grandfather chants with him. He stands right on the cliff edge as the herd slows and, just yards from him, comes to a stop. King George looks down on the scene, and as Sarah and Drover arrive, Nullah starts to cry. Sarah dismounts and grabs him just before he falls into the abyss, and Drover grabs them both, pulling them backward to safety. Nullah stares up at Sarah, then turns and nuzzles into her shoulder, while Drover stands awkwardly and backs away from the pair. King George smiles proudly. Drover gallops to Flynn, who lies twisted and bloody in the dust, placing his ear close to Flynn's mouth to hear him as his eyes flutter and close. Drover frowns, looks down at Flynn, picks up his hat from next to the dead man, and puts it on while holding Flynn's harmonica. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Later, Nullah holds the harmonica as Sarah sits in the smoking remnants of their camp, holding out one of her hats, which she drops on the ground as her face creases with grief. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation."
  }
}