{
  "ground_truth": "They stand next to each other guiltily, as Nullah climbs down from the tree. Sarah stares at him curiously, as he moves pensively away from her. She looks shocked. He eyes her steadily. He draws near her, and she looks up at him. She smiles and looks down at the ground. He gives a tight smile and walks off. She hesitates, then wanders through the long grass. In daylight, a steer lies dead next to a watering hole. Magarri checks the water. Drover, Sarah, and Nullah ride up. Magarri looks thoughtful.",
  "iterations": {
    "1": "They stand next to each other guiltily, as Nullah climbs down from the tree. Sarah stares at him curiously, as he moves pensively away from her. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. She looks shocked. He eyes her steadily. He draws near her, and she looks up at him. She smiles and looks down at the ground. He gives a tight smile and walks off. She hesitates, then wanders through the long grass. In daylight, a steer lies dead next to a watering hole. Magarri checks the water. Drover, Sarah, and Nullah ride up. Magarri looks thoughtful.",
    "2": "They stand next to each other guiltily, as Nullah climbs down from the tree. Sarah stares at him curiously, as he moves pensively away from her. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. She looks shocked. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. He eyes her steadily. He draws near her, and she looks up at him. She smiles and looks down at the ground. He gives a tight smile and walks off. She hesitates, then wanders through the long grass. In daylight, a steer lies dead next to a watering hole. Magarri checks the water. Drover, Sarah, and Nullah ride up. Magarri looks thoughtful.",
    "3": "They stand next to each other guiltily, as Nullah climbs down from the tree. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Sarah stares at him curiously, as he moves pensively away from her. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. She looks shocked. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. He eyes her steadily. He draws near her, and she looks up at him. She smiles and looks down at the ground. He gives a tight smile and walks off. She hesitates, then wanders through the long grass. In daylight, a steer lies dead next to a watering hole. Magarri checks the water. Drover, Sarah, and Nullah ride up. Magarri looks thoughtful.",
    "4": "They stand next to each other guiltily, as Nullah climbs down from the tree. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Sarah stares at him curiously, as he moves pensively away from her. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. She looks shocked. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. He eyes her steadily. He draws near her, and she looks up at him. She smiles and looks down at the ground. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. He gives a tight smile and walks off. She hesitates, then wanders through the long grass. In daylight, a steer lies dead next to a watering hole. Magarri checks the water. Drover, Sarah, and Nullah ride up. Magarri looks thoughtful.",
    "5": "They stand next to each other guiltily, as Nullah climbs down from the tree. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Sarah stares at him curiously, as he moves pensively away from her. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. She looks shocked. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. He eyes her steadily. He draws near her, and she looks up at him. She smiles and looks down at the ground. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. He gives a tight smile and walks off. She hesitates, then wanders through the long grass. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In daylight, a steer lies dead next to a watering hole. Magarri checks the water. Drover, Sarah, and Nullah ride up. Magarri looks thoughtful.",
    "6": "They stand next to each other guiltily, as Nullah climbs down from the tree. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Sarah stares at him curiously, as he moves pensively away from her. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. She looks shocked. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. He eyes her steadily. He draws near her, and she looks up at him. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. She smiles and looks down at the ground. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. He gives a tight smile and walks off. She hesitates, then wanders through the long grass. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In daylight, a steer lies dead next to a watering hole. Magarri checks the water. Drover, Sarah, and Nullah ride up. Magarri looks thoughtful.",
    "7": "They stand next to each other guiltily, as Nullah climbs down from the tree. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Sarah stares at him curiously, as he moves pensively away from her. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. She looks shocked. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. He eyes her steadily. He draws near her, and she looks up at him. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. She smiles and looks down at the ground. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. He gives a tight smile and walks off. She hesitates, then wanders through the long grass. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In daylight, a steer lies dead next to a watering hole. Magarri checks the water. Drover, Sarah, and Nullah ride up. Magarri looks thoughtful.",
    "8": "They stand next to each other guiltily, as Nullah climbs down from the tree. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Sarah stares at him curiously, as he moves pensively away from her. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. She looks shocked. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. He eyes her steadily. He draws near her, and she looks up at him. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. She smiles and looks down at the ground. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. He gives a tight smile and walks off. She hesitates, then wanders through the long grass. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In daylight, a steer lies dead next to a watering hole. Magarri checks the water. Drover, Sarah, and Nullah ride up. Magarri looks thoughtful. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation.",
    "9": "They stand next to each other guiltily, as Nullah climbs down from the tree. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Sarah stares at him curiously, as he moves pensively away from her. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. She looks shocked. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. He eyes her steadily. He draws near her, and she looks up at him. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. She smiles and looks down at the ground. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. He gives a tight smile and walks off. She hesitates, then wanders through the long grass. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In daylight, a steer lies dead next to a watering hole. Magarri checks the water. Drover, Sarah, and Nullah ride up. Magarri looks thoughtful. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation.",
    "10": "They stand next to each other guiltily, as Nullah climbs down from the tree. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Sarah stares at him curiously, as he moves pensively away from her. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. She looks shocked. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. He eyes her steadily. He draws near her, and she looks up at him. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. She smiles and looks down at the ground. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. He gives a tight smile and walks off. She hesitates, then wanders through the long grass. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In daylight, a steer lies dead next to a watering hole. Magarri checks the water. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. Drover, Sarah, and Nullah ride up. Magarri looks thoughtful. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation."
  }
}