{
  "ground_truth": "A wooden loading tunnel leads right to it. As Fletcher stares, policemen emerge from their office. Administrator Allsop looks down his telescope. Drover gallops through Carney's men and cuts the rope holding up the gate at the end of the tunnel. It drops closed, trapping the cattle inside. Drover cracks his whip as Sarah's cattle thunder down the wharf. Townspeople cheer her on as she rides past the hotel. The cattle are streaming onto a ship. Nullah rides up to Sarah. She nods and smiles triumphantly as Nullah rides behind the last of the herd. She catches Fletcher's eye. They glare at each other, and she rides towards him.",
  "iterations": {
    "1": "A wooden loading tunnel leads right to it. As Fletcher stares, policemen emerge from their office. Administrator Allsop looks down his telescope. Drover gallops through Carney's men and cuts the rope holding up the gate at the end of the tunnel. It drops closed, trapping the cattle inside. Drover cracks his whip as Sarah's cattle thunder down the wharf. Townspeople cheer her on as she rides past the hotel. The cattle are streaming onto a ship. Nullah rides up to Sarah. She nods and smiles triumphantly as Nullah rides behind the last of the herd. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. She catches Fletcher's eye. They glare at each other, and she rides towards him.",
    "2": "A wooden loading tunnel leads right to it. As Fletcher stares, policemen emerge from their office. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. Administrator Allsop looks down his telescope. Drover gallops through Carney's men and cuts the rope holding up the gate at the end of the tunnel. It drops closed, trapping the cattle inside. Drover cracks his whip as Sarah's cattle thunder down the wharf. Townspeople cheer her on as she rides past the hotel. The cattle are streaming onto a ship. Nullah rides up to Sarah. She nods and smiles triumphantly as Nullah rides behind the last of the herd. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. She catches Fletcher's eye. They glare at each other, and she rides towards him.",
    "3": "A wooden loading tunnel leads right to it. As Fletcher stares, policemen emerge from their office. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. Administrator Allsop looks down his telescope. Drover gallops through Carney's men and cuts the rope holding up the gate at the end of the tunnel. It drops closed, trapping the cattle inside. Drover cracks his whip as Sarah's cattle thunder down the wharf. Townspeople cheer her on as she rides past the hotel. The cattle are streaming onto a ship. Nullah rides up to Sarah. She nods and smiles triumphantly as Nullah rides behind the last of the herd. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. She catches Fletcher's eye. They glare at each other, and she rides towards him.",
    "4": "A wooden loading tunnel leads right to it. As Fletcher stares, policemen emerge from their office. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. Administrator Allsop looks down his telescope. Drover gallops through Carney's men and cuts the rope holding up the gate at the end of the tunnel. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. It drops closed, trapping the cattle inside. Drover cracks his whip as Sarah's cattle thunder down the wharf. Townspeople cheer her on as she rides past the hotel. The cattle are streaming onto a ship. Nullah rides up to Sarah. She nods and smiles triumphantly as Nullah rides behind the last of the herd. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. She catches Fletcher's eye. They glare at each other, and she rides towards him.",
    "5": "A wooden loading tunnel leads right to it. As Fletcher stares, policemen emerge from their office. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. Administrator Allsop looks down his telescope. Drover gallops through Carney's men and cuts the rope holding up the gate at the end of the tunnel. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. It drops closed, trapping the cattle inside. Drover cracks his whip as Sarah's cattle thunder down the wharf. Townspeople cheer her on as she rides past the hotel. The cattle are streaming onto a ship. Nullah rides up to Sarah. She nods and smiles triumphantly as Nullah rides behind the last of the herd. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. She catches Fletcher's eye. They glare at each other, and she rides towards him.",
    "6": "A wooden loading tunnel leads right to it. As Fletcher stares, policemen emerge from their office. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. Administrator Allsop looks down his telescope. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. Drover gallops through Carney's men and cuts the rope holding up the gate at the end of the tunnel. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. It drops closed, trapping the cattle inside. Drover cracks his whip as Sarah's cattle thunder down the wharf. Townspeople cheer her on as she rides past the hotel. The cattle are streaming onto a ship. Nullah rides up to Sarah. She nods and smiles triumphantly as Nullah rides behind the last of the herd. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. She catches Fletcher's eye. They glare at each other, and she rides towards him.",
    "7": "A wooden loading tunnel leads right to it. As Fletcher stares, policemen emerge from their office. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. Administrator Allsop looks down his telescope. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. Drover gallops through Carney's men and cuts the rope holding up the gate at the end of the tunnel. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. It drops closed, trapping the cattle inside. Drover cracks his whip as Sarah's cattle thunder down the wharf. Townspeople cheer her on as she rides past the hotel. The cattle are streaming onto a ship. Nullah rides up to Sarah. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. She nods and smiles triumphantly as Nullah rides behind the last of the herd. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. She catches Fletcher's eye. They glare at each other, and she rides towards him.",
    "8": "A wooden loading tunnel leads right to it. As Fletcher stares, policemen emerge from their office. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. Administrator Allsop looks down his telescope. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. Drover gallops through Carney's men and cuts the rope holding up the gate at the end of the tunnel. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. It drops closed, trapping the cattle inside. Drover cracks his whip as Sarah's cattle thunder down the wharf. Townspeople cheer her on as she rides past the hotel. The cattle are streaming onto a ship. Nullah rides up to Sarah. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. She nods and smiles triumphantly as Nullah rides behind the last of the herd. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. She catches Fletcher's eye. They glare at each other, and she rides towards him.",
    "9": "A wooden loading tunnel leads right to it. As Fletcher stares, policemen emerge from their office. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. Administrator Allsop looks down his telescope. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. Drover gallops through Carney's men and cuts the rope holding up the gate at the end of the tunnel. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. It drops closed, trapping the cattle inside. Drover cracks his whip as Sarah's cattle thunder down the wharf. Townspeople cheer her on as she rides past the hotel. The cattle are streaming onto a ship. Nullah rides up to Sarah. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. She nods and smiles triumphantly as Nullah rides behind the last of the herd. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. She catches Fletcher's eye. They glare at each other, and she rides towards him. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas.",
    "10": "A wooden loading tunnel leads right to it. As Fletcher stares, policemen emerge from their office. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. Administrator Allsop looks down his telescope. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. Drover gallops through Carney's men and cuts the rope holding up the gate at the end of the tunnel. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. It drops closed, trapping the cattle inside. Drover cracks his whip as Sarah's cattle thunder down the wharf. Townspeople cheer her on as she rides past the hotel. The cattle are streaming onto a ship. Nullah rides up to Sarah. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. She nods and smiles triumphantly as Nullah rides behind the last of the herd. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. She catches Fletcher's eye. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. They glare at each other, and she rides towards him. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas."
  }
}