{
  "ground_truth": "In Walt's house, Sue goes to the mesh door of the basement, and then he runs out of the back door, with Sue following him. It's night as Walt walks up outside Smokie's house and looks up at it, his face partly hidden in shadow. One of the gangsters looks out of the window and spots Walt. Smokie and Spider come out to confront him, more gangsters appear, and Spider pulls a gun. Neighbors watch. Walt points his index finger gun-like at the gangsters and mimes shooting them. He holds up a cigarette, puts it in his mouth, and slowly reaches inside his jacket, then whips his hand out again. The gangsters open fire, bullets riddle Walt's body, and he collapses backward onto the ground. His hand falls open, revealing his 1st Cavalry lighter, as blood trickles down his sleeve into his palm and some runs from his mouth. The cigarette lies unlit beside Walt's dead body, which lies in a cruciform. The lights of a police car flash in the darkness. Walt's Gran Torino pulls up outside Smokie's house, and Thao and Sue step out of it.",
  "iterations": {
    "1": "In Walt's house, Sue goes to the mesh door of the basement, and then he runs out of the back door, with Sue following him. It's night as Walt walks up outside Smokie's house and looks up at it, his face partly hidden in shadow. One of the gangsters looks out of the window and spots Walt. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Smokie and Spider come out to confront him, more gangsters appear, and Spider pulls a gun. Neighbors watch. Walt points his index finger gun-like at the gangsters and mimes shooting them. He holds up a cigarette, puts it in his mouth, and slowly reaches inside his jacket, then whips his hand out again. The gangsters open fire, bullets riddle Walt's body, and he collapses backward onto the ground. His hand falls open, revealing his 1st Cavalry lighter, as blood trickles down his sleeve into his palm and some runs from his mouth. The cigarette lies unlit beside Walt's dead body, which lies in a cruciform. The lights of a police car flash in the darkness. Walt's Gran Torino pulls up outside Smokie's house, and Thao and Sue step out of it.",
    "2": "In Walt's house, Sue goes to the mesh door of the basement, and then he runs out of the back door, with Sue following him. It's night as Walt walks up outside Smokie's house and looks up at it, his face partly hidden in shadow. One of the gangsters looks out of the window and spots Walt. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Smokie and Spider come out to confront him, more gangsters appear, and Spider pulls a gun. Neighbors watch. Walt points his index finger gun-like at the gangsters and mimes shooting them. He holds up a cigarette, puts it in his mouth, and slowly reaches inside his jacket, then whips his hand out again. The gangsters open fire, bullets riddle Walt's body, and he collapses backward onto the ground. His hand falls open, revealing his 1st Cavalry lighter, as blood trickles down his sleeve into his palm and some runs from his mouth. The cigarette lies unlit beside Walt's dead body, which lies in a cruciform. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. The lights of a police car flash in the darkness. Walt's Gran Torino pulls up outside Smokie's house, and Thao and Sue step out of it.",
    "3": "In Walt's house, Sue goes to the mesh door of the basement, and then he runs out of the back door, with Sue following him. It's night as Walt walks up outside Smokie's house and looks up at it, his face partly hidden in shadow. One of the gangsters looks out of the window and spots Walt. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Smokie and Spider come out to confront him, more gangsters appear, and Spider pulls a gun. Neighbors watch. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. Walt points his index finger gun-like at the gangsters and mimes shooting them. He holds up a cigarette, puts it in his mouth, and slowly reaches inside his jacket, then whips his hand out again. The gangsters open fire, bullets riddle Walt's body, and he collapses backward onto the ground. His hand falls open, revealing his 1st Cavalry lighter, as blood trickles down his sleeve into his palm and some runs from his mouth. The cigarette lies unlit beside Walt's dead body, which lies in a cruciform. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. The lights of a police car flash in the darkness. Walt's Gran Torino pulls up outside Smokie's house, and Thao and Sue step out of it.",
    "4": "In Walt's house, Sue goes to the mesh door of the basement, and then he runs out of the back door, with Sue following him. It's night as Walt walks up outside Smokie's house and looks up at it, his face partly hidden in shadow. One of the gangsters looks out of the window and spots Walt. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Smokie and Spider come out to confront him, more gangsters appear, and Spider pulls a gun. Neighbors watch. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. Walt points his index finger gun-like at the gangsters and mimes shooting them. He holds up a cigarette, puts it in his mouth, and slowly reaches inside his jacket, then whips his hand out again. The gangsters open fire, bullets riddle Walt's body, and he collapses backward onto the ground. His hand falls open, revealing his 1st Cavalry lighter, as blood trickles down his sleeve into his palm and some runs from his mouth. The cigarette lies unlit beside Walt's dead body, which lies in a cruciform. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. The lights of a police car flash in the darkness. Walt's Gran Torino pulls up outside Smokie's house, and Thao and Sue step out of it.",
    "5": "In Walt's house, Sue goes to the mesh door of the basement, and then he runs out of the back door, with Sue following him. It's night as Walt walks up outside Smokie's house and looks up at it, his face partly hidden in shadow. One of the gangsters looks out of the window and spots Walt. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Smokie and Spider come out to confront him, more gangsters appear, and Spider pulls a gun. Neighbors watch. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. Walt points his index finger gun-like at the gangsters and mimes shooting them. He holds up a cigarette, puts it in his mouth, and slowly reaches inside his jacket, then whips his hand out again. The gangsters open fire, bullets riddle Walt's body, and he collapses backward onto the ground. His hand falls open, revealing his 1st Cavalry lighter, as blood trickles down his sleeve into his palm and some runs from his mouth. The cigarette lies unlit beside Walt's dead body, which lies in a cruciform. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. The lights of a police car flash in the darkness. Walt's Gran Torino pulls up outside Smokie's house, and Thao and Sue step out of it.",
    "6": "In Walt's house, Sue goes to the mesh door of the basement, and then he runs out of the back door, with Sue following him. It's night as Walt walks up outside Smokie's house and looks up at it, his face partly hidden in shadow. One of the gangsters looks out of the window and spots Walt. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Smokie and Spider come out to confront him, more gangsters appear, and Spider pulls a gun. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. Neighbors watch. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. Walt points his index finger gun-like at the gangsters and mimes shooting them. He holds up a cigarette, puts it in his mouth, and slowly reaches inside his jacket, then whips his hand out again. The gangsters open fire, bullets riddle Walt's body, and he collapses backward onto the ground. His hand falls open, revealing his 1st Cavalry lighter, as blood trickles down his sleeve into his palm and some runs from his mouth. The cigarette lies unlit beside Walt's dead body, which lies in a cruciform. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. The lights of a police car flash in the darkness. Walt's Gran Torino pulls up outside Smokie's house, and Thao and Sue step out of it.",
    "7": "In Walt's house, Sue goes to the mesh door of the basement, and then he runs out of the back door, with Sue following him. It's night as Walt walks up outside Smokie's house and looks up at it, his face partly hidden in shadow. One of the gangsters looks out of the window and spots Walt. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Smokie and Spider come out to confront him, more gangsters appear, and Spider pulls a gun. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. Neighbors watch. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. Walt points his index finger gun-like at the gangsters and mimes shooting them. He holds up a cigarette, puts it in his mouth, and slowly reaches inside his jacket, then whips his hand out again. The gangsters open fire, bullets riddle Walt's body, and he collapses backward onto the ground. His hand falls open, revealing his 1st Cavalry lighter, as blood trickles down his sleeve into his palm and some runs from his mouth. The cigarette lies unlit beside Walt's dead body, which lies in a cruciform. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. The lights of a police car flash in the darkness. Walt's Gran Torino pulls up outside Smokie's house, and Thao and Sue step out of it.",
    "8": "In Walt's house, Sue goes to the mesh door of the basement, and then he runs out of the back door, with Sue following him. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. It's night as Walt walks up outside Smokie's house and looks up at it, his face partly hidden in shadow. One of the gangsters looks out of the window and spots Walt. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Smokie and Spider come out to confront him, more gangsters appear, and Spider pulls a gun. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. Neighbors watch. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. Walt points his index finger gun-like at the gangsters and mimes shooting them. He holds up a cigarette, puts it in his mouth, and slowly reaches inside his jacket, then whips his hand out again. The gangsters open fire, bullets riddle Walt's body, and he collapses backward onto the ground. His hand falls open, revealing his 1st Cavalry lighter, as blood trickles down his sleeve into his palm and some runs from his mouth. The cigarette lies unlit beside Walt's dead body, which lies in a cruciform. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. The lights of a police car flash in the darkness. Walt's Gran Torino pulls up outside Smokie's house, and Thao and Sue step out of it.",
    "9": "In Walt's house, Sue goes to the mesh door of the basement, and then he runs out of the back door, with Sue following him. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. It's night as Walt walks up outside Smokie's house and looks up at it, his face partly hidden in shadow. One of the gangsters looks out of the window and spots Walt. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. Smokie and Spider come out to confront him, more gangsters appear, and Spider pulls a gun. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. Neighbors watch. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. Walt points his index finger gun-like at the gangsters and mimes shooting them. He holds up a cigarette, puts it in his mouth, and slowly reaches inside his jacket, then whips his hand out again. The gangsters open fire, bullets riddle Walt's body, and he collapses backward onto the ground. His hand falls open, revealing his 1st Cavalry lighter, as blood trickles down his sleeve into his palm and some runs from his mouth. The cigarette lies unlit beside Walt's dead body, which lies in a cruciform. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. The lights of a police car flash in the darkness. Walt's Gran Torino pulls up outside Smokie's house, and Thao and Sue step out of it.",
    "10": "In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. In Walt's house, Sue goes to the mesh door of the basement, and then he runs out of the back door, with Sue following him. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. It's night as Walt walks up outside Smokie's house and looks up at it, his face partly hidden in shadow. One of the gangsters looks out of the window and spots Walt. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. Smokie and Spider come out to confront him, more gangsters appear, and Spider pulls a gun. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. Neighbors watch. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. Walt points his index finger gun-like at the gangsters and mimes shooting them. He holds up a cigarette, puts it in his mouth, and slowly reaches inside his jacket, then whips his hand out again. The gangsters open fire, bullets riddle Walt's body, and he collapses backward onto the ground. His hand falls open, revealing his 1st Cavalry lighter, as blood trickles down his sleeve into his palm and some runs from his mouth. The cigarette lies unlit beside Walt's dead body, which lies in a cruciform. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. The lights of a police car flash in the darkness. Walt's Gran Torino pulls up outside Smokie's house, and Thao and Sue step out of it."
  }
}