{
  "ground_truth": "He steps on the cigarette. Having just pulled the cover over the car, he stares at Ashley incredulously, and steps over to the door. He spits and walks out. Ashley rolls her eyes. Walt opens his front door to a teenager, Thao. Walt slams the door and turns to the priest. Walt shoves past the fresh-faced priest, Father Janovich. Next door, a steady stream of Southeast Asian Hmong people walk up to the front door. Most carry plates or bowls of food. As mourners leave, Walt uses jump leads to get a woman's car started. Mitch drives up in a Toyota Land Cruiser. Walt straightens up and stares at the silver four-by-four as it departs.",
  "iterations": {
    "1": "He steps on the cigarette. Having just pulled the cover over the car, he stares at Ashley incredulously, and steps over to the door. He spits and walks out. Ashley rolls her eyes. Walt opens his front door to a teenager, Thao. Walt slams the door and turns to the priest. Walt shoves past the fresh-faced priest, Father Janovich. Next door, a steady stream of Southeast Asian Hmong people walk up to the front door. Most carry plates or bowls of food. As mourners leave, Walt uses jump leads to get a woman's car started. Mitch drives up in a Toyota Land Cruiser. Walt straightens up and stares at the silver four-by-four as it departs. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage.",
    "2": "In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. He steps on the cigarette. Having just pulled the cover over the car, he stares at Ashley incredulously, and steps over to the door. He spits and walks out. Ashley rolls her eyes. Walt opens his front door to a teenager, Thao. Walt slams the door and turns to the priest. Walt shoves past the fresh-faced priest, Father Janovich. Next door, a steady stream of Southeast Asian Hmong people walk up to the front door. Most carry plates or bowls of food. As mourners leave, Walt uses jump leads to get a woman's car started. Mitch drives up in a Toyota Land Cruiser. Walt straightens up and stares at the silver four-by-four as it departs. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage.",
    "3": "In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. He steps on the cigarette. Having just pulled the cover over the car, he stares at Ashley incredulously, and steps over to the door. He spits and walks out. Ashley rolls her eyes. Walt opens his front door to a teenager, Thao. Walt slams the door and turns to the priest. Walt shoves past the fresh-faced priest, Father Janovich. Next door, a steady stream of Southeast Asian Hmong people walk up to the front door. Most carry plates or bowls of food. As mourners leave, Walt uses jump leads to get a woman's car started. Mitch drives up in a Toyota Land Cruiser. Walt straightens up and stares at the silver four-by-four as it departs. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage.",
    "4": "In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. He steps on the cigarette. Having just pulled the cover over the car, he stares at Ashley incredulously, and steps over to the door. He spits and walks out. Ashley rolls her eyes. Walt opens his front door to a teenager, Thao. Walt slams the door and turns to the priest. Walt shoves past the fresh-faced priest, Father Janovich. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. Next door, a steady stream of Southeast Asian Hmong people walk up to the front door. Most carry plates or bowls of food. As mourners leave, Walt uses jump leads to get a woman's car started. Mitch drives up in a Toyota Land Cruiser. Walt straightens up and stares at the silver four-by-four as it departs. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage.",
    "5": "In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. He steps on the cigarette. Having just pulled the cover over the car, he stares at Ashley incredulously, and steps over to the door. He spits and walks out. Ashley rolls her eyes. Walt opens his front door to a teenager, Thao. Walt slams the door and turns to the priest. Walt shoves past the fresh-faced priest, Father Janovich. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. Next door, a steady stream of Southeast Asian Hmong people walk up to the front door. Most carry plates or bowls of food. As mourners leave, Walt uses jump leads to get a woman's car started. Mitch drives up in a Toyota Land Cruiser. Walt straightens up and stares at the silver four-by-four as it departs. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage.",
    "6": "In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. He steps on the cigarette. Having just pulled the cover over the car, he stares at Ashley incredulously, and steps over to the door. He spits and walks out. Ashley rolls her eyes. Walt opens his front door to a teenager, Thao. Walt slams the door and turns to the priest. Walt shoves past the fresh-faced priest, Father Janovich. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. Next door, a steady stream of Southeast Asian Hmong people walk up to the front door. Most carry plates or bowls of food. As mourners leave, Walt uses jump leads to get a woman's car started. Mitch drives up in a Toyota Land Cruiser. Walt straightens up and stares at the silver four-by-four as it departs. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness.",
    "7": "During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. He steps on the cigarette. Having just pulled the cover over the car, he stares at Ashley incredulously, and steps over to the door. He spits and walks out. Ashley rolls her eyes. Walt opens his front door to a teenager, Thao. Walt slams the door and turns to the priest. Walt shoves past the fresh-faced priest, Father Janovich. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. Next door, a steady stream of Southeast Asian Hmong people walk up to the front door. Most carry plates or bowls of food. As mourners leave, Walt uses jump leads to get a woman's car started. Mitch drives up in a Toyota Land Cruiser. Walt straightens up and stares at the silver four-by-four as it departs. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness.",
    "8": "During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. He steps on the cigarette. Having just pulled the cover over the car, he stares at Ashley incredulously, and steps over to the door. He spits and walks out. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Ashley rolls her eyes. Walt opens his front door to a teenager, Thao. Walt slams the door and turns to the priest. Walt shoves past the fresh-faced priest, Father Janovich. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. Next door, a steady stream of Southeast Asian Hmong people walk up to the front door. Most carry plates or bowls of food. As mourners leave, Walt uses jump leads to get a woman's car started. Mitch drives up in a Toyota Land Cruiser. Walt straightens up and stares at the silver four-by-four as it departs. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness.",
    "9": "During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. He steps on the cigarette. Having just pulled the cover over the car, he stares at Ashley incredulously, and steps over to the door. He spits and walks out. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Ashley rolls her eyes. Walt opens his front door to a teenager, Thao. Walt slams the door and turns to the priest. Walt shoves past the fresh-faced priest, Father Janovich. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. Next door, a steady stream of Southeast Asian Hmong people walk up to the front door. Most carry plates or bowls of food. As mourners leave, Walt uses jump leads to get a woman's car started. Mitch drives up in a Toyota Land Cruiser. Walt straightens up and stares at the silver four-by-four as it departs. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness.",
    "10": "During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. He steps on the cigarette. Having just pulled the cover over the car, he stares at Ashley incredulously, and steps over to the door. He spits and walks out. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Ashley rolls her eyes. Walt opens his front door to a teenager, Thao. Walt slams the door and turns to the priest. Walt shoves past the fresh-faced priest, Father Janovich. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. Next door, a steady stream of Southeast Asian Hmong people walk up to the front door. Most carry plates or bowls of food. As mourners leave, Walt uses jump leads to get a woman's car started. Mitch drives up in a Toyota Land Cruiser. Walt straightens up and stares at the silver four-by-four as it departs. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness."
  }
}