{
  "ground_truth": "She stares at her reflection critically and says this as if it were a threat, then notices a smudge on the mirror and wipes it off. The front door opens to reveal Carolyn, greeting us with the smile she thinks could sell ice to an Eskimo. Smiling, Carolyn leads a man and woman into the living room. They're thirtyish, and they've seen a lot of houses today. The man and woman glance around the dark room, unimpressed, and the woman wrinkles her face, skeptical. Carolyn enters, followed by a different couple in their fifties, and stands with another couple: African American, late twenties. The woman is pregnant. Carolyn stands by the pool next to two fortyish women. She locks the sliding glass door and starts to pull the vertical blinds shut, then stops. Standing very still, with the blinds casting shadows across her face, she starts to cry: brief, staccato sobs that seemingly escape against her will. Suddenly she slaps herself, hard, but the tears continue. She slaps herself again and repeatedly until she stops crying.",
  "iterations": {
    "1": "She stares at her reflection critically and says this as if it were a threat, then notices a smudge on the mirror and wipes it off. The front door opens to reveal Carolyn, greeting us with the smile she thinks could sell ice to an Eskimo. Smiling, Carolyn leads a man and woman into the living room. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. They're thirtyish, and they've seen a lot of houses today. The man and woman glance around the dark room, unimpressed, and the woman wrinkles her face, skeptical. Carolyn enters, followed by a different couple in their fifties, and stands with another couple: African American, late twenties. The woman is pregnant. Carolyn stands by the pool next to two fortyish women. She locks the sliding glass door and starts to pull the vertical blinds shut, then stops. Standing very still, with the blinds casting shadows across her face, she starts to cry: brief, staccato sobs that seemingly escape against her will. Suddenly she slaps herself, hard, but the tears continue. She slaps herself again and repeatedly until she stops crying.",
    "2": "She stares at her reflection critically and says this as if it were a threat, then notices a smudge on the mirror and wipes it off. The front door opens to reveal Carolyn, greeting us with the smile she thinks could sell ice to an Eskimo. Smiling, Carolyn leads a man and woman into the living room. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. They're thirtyish, and they've seen a lot of houses today. The man and woman glance around the dark room, unimpressed, and the woman wrinkles her face, skeptical. Carolyn enters, followed by a different couple in their fifties, and stands with another couple:. African American, late twenties. The woman is pregnant. Carolyn stands by the pool next to two fortyish women. She locks the sliding glass door and starts to pull the vertical blinds shut, then stops. Standing very still, with the blinds casting shadows across her face, she starts to cry:. brief, staccato sobs that seemingly escape against her will. Suddenly she slaps herself, hard, but the tears continue. She slaps herself again and repeatedly until she stops crying. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him.",
    "3": "She stares at her reflection critically and says this as if it were a threat, then notices a smudge on the mirror and wipes it off. The front door opens to reveal Carolyn, greeting us with the smile she thinks could sell ice to an Eskimo. Smiling, Carolyn leads a man and woman into the living room. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. They're thirtyish, and they've seen a lot of houses today. The man and woman glance around the dark room, unimpressed, and the woman wrinkles her face, skeptical. Carolyn enters, followed by a different couple in their fifties, and stands with another couple:. African American, late twenties. The woman is pregnant. Carolyn stands by the pool next to two fortyish women. She locks the sliding glass door and starts to pull the vertical blinds shut, then stops. Standing very still, with the blinds casting shadows across her face, she starts to cry:. brief, staccato sobs that seemingly escape against her will. Suddenly she slaps herself, hard, but the tears continue. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. She slaps herself again and repeatedly until she stops crying. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him.",
    "4": "She stares at her reflection critically and says this as if it were a threat, then notices a smudge on the mirror and wipes it off. The front door opens to reveal Carolyn, greeting us with the smile she thinks could sell ice to an Eskimo. Smiling, Carolyn leads a man and woman into the living room. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. They're thirtyish, and they've seen a lot of houses today. The man and woman glance around the dark room, unimpressed, and the woman wrinkles her face, skeptical. Carolyn enters, followed by a different couple in their fifties, and stands with another couple:. African American, late twenties. The woman is pregnant. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. Carolyn stands by the pool next to two fortyish women. She locks the sliding glass door and starts to pull the vertical blinds shut, then stops. Standing very still, with the blinds casting shadows across her face, she starts to cry:. brief, staccato sobs that seemingly escape against her will. Suddenly she slaps herself, hard, but the tears continue. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. She slaps herself again and repeatedly until she stops crying. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him.",
    "5": "Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. She stares at her reflection critically and says this as if it were a threat, then notices a smudge on the mirror and wipes it off. The front door opens to reveal Carolyn, greeting us with the smile she thinks could sell ice to an Eskimo. Smiling, Carolyn leads a man and woman into the living room. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. They're thirtyish, and they've seen a lot of houses today. The man and woman glance around the dark room, unimpressed, and the woman wrinkles her face, skeptical. Carolyn enters, followed by a different couple in their fifties, and stands with another couple:. African American, late twenties. The woman is pregnant. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. Carolyn stands by the pool next to two fortyish women. She locks the sliding glass door and starts to pull the vertical blinds shut, then stops. Standing very still, with the blinds casting shadows across her face, she starts to cry:. brief, staccato sobs that seemingly escape against her will. Suddenly she slaps herself, hard, but the tears continue. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. She slaps herself again and repeatedly until she stops crying. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him.",
    "6": "Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. She stares at her reflection critically and says this as if it were a threat, then notices a smudge on the mirror and wipes it off. The front door opens to reveal Carolyn, greeting us with the smile she thinks could sell ice to an Eskimo. Smiling, Carolyn leads a man and woman into the living room. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. They're thirtyish, and they've seen a lot of houses today. The man and woman glance around the dark room, unimpressed, and the woman wrinkles her face, skeptical. Carolyn enters, followed by a different couple in their fifties, and stands with another couple:. African American, late twenties. The woman is pregnant. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. Carolyn stands by the pool next to two fortyish women. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. She locks the sliding glass door and starts to pull the vertical blinds shut, then stops. Standing very still, with the blinds casting shadows across her face, she starts to cry:. brief, staccato sobs that seemingly escape against her will. Suddenly she slaps herself, hard, but the tears continue. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. She slaps herself again and repeatedly until she stops crying. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him.",
    "7": "Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. She stares at her reflection critically and says this as if it were a threat, then notices a smudge on the mirror and wipes it off. The front door opens to reveal Carolyn, greeting us with the smile she thinks could sell ice to an Eskimo. Smiling, Carolyn leads a man and woman into the living room. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. They're thirtyish, and they've seen a lot of houses today. The man and woman glance around the dark room, unimpressed, and the woman wrinkles her face, skeptical. Carolyn enters, followed by a different couple in their fifties, and stands with another couple:. African American, late twenties. The woman is pregnant. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. Carolyn stands by the pool next to two fortyish women. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. She locks the sliding glass door and starts to pull the vertical blinds shut, then stops. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. Standing very still, with the blinds casting shadows across her face, she starts to cry:. brief, staccato sobs that seemingly escape against her will. Suddenly she slaps herself, hard, but the tears continue. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. She slaps herself again and repeatedly until she stops crying. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him.",
    "8": "Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. She stares at her reflection critically and says this as if it were a threat, then notices a smudge on the mirror and wipes it off. The front door opens to reveal Carolyn, greeting us with the smile she thinks could sell ice to an Eskimo. Smiling, Carolyn leads a man and woman into the living room. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. They're thirtyish, and they've seen a lot of houses today. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. The man and woman glance around the dark room, unimpressed, and the woman wrinkles her face, skeptical. Carolyn enters, followed by a different couple in their fifties, and stands with another couple:. African American, late twenties. The woman is pregnant. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. Carolyn stands by the pool next to two fortyish women. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. She locks the sliding glass door and starts to pull the vertical blinds shut, then stops. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. Standing very still, with the blinds casting shadows across her face, she starts to cry:. brief, staccato sobs that seemingly escape against her will. Suddenly she slaps herself, hard, but the tears continue. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. She slaps herself again and repeatedly until she stops crying. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him.",
    "9": "Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. She stares at her reflection critically and says this as if it were a threat, then notices a smudge on the mirror and wipes it off. The front door opens to reveal Carolyn, greeting us with the smile she thinks could sell ice to an Eskimo. Smiling, Carolyn leads a man and woman into the living room. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. They're thirtyish, and they've seen a lot of houses today. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. The man and woman glance around the dark room, unimpressed, and the woman wrinkles her face, skeptical. Carolyn enters, followed by a different couple in their fifties, and stands with another couple:. African American, late twenties. The woman is pregnant. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. Carolyn stands by the pool next to two fortyish women. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. She locks the sliding glass door and starts to pull the vertical blinds shut, then stops. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. Standing very still, with the blinds casting shadows across her face, she starts to cry:. brief, staccato sobs that seemingly escape against her will. Suddenly she slaps herself, hard, but the tears continue. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. She slaps herself again and repeatedly until she stops crying. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him.",
    "10": "Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. She stares at her reflection critically and says this as if it were a threat, then notices a smudge on the mirror and wipes it off. The front door opens to reveal Carolyn, greeting us with the smile she thinks could sell ice to an Eskimo. Smiling, Carolyn leads a man and woman into the living room. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. They're thirtyish, and they've seen a lot of houses today. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. The man and woman glance around the dark room, unimpressed, and the woman wrinkles her face, skeptical. Carolyn enters, followed by a different couple in their fifties, and stands with another couple:. African American, late twenties. The woman is pregnant. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. Carolyn stands by the pool next to two fortyish women. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. She locks the sliding glass door and starts to pull the vertical blinds shut, then stops. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. Standing very still, with the blinds casting shadows across her face, she starts to cry:. brief, staccato sobs that seemingly escape against her will. Suddenly she slaps herself, hard, but the tears continue. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. She slaps herself again and repeatedly until she stops crying. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him."
  }
}