{
  "ground_truth": "As she goes upstairs, the group of boys follows her. Walt goes over to Thao and sips his drink as Thao looks away. Walt matches off, leaving Thao looking dejected but thoughtful. Walt mows his front lawn with a push mower, and he looks up to see two of his Hmong neighbors bringing flowers to his house. The neighbors smile, and as they leave the flowers, Walt carries on mowing. He stops and looks back at them. Later, he opens his door to more neighbors bearing food, sniffs it, and waves the three women and their food inside, following them in. Later, he pulls onto his drive in his pickup and finds Sue, Thao, and their mother waiting for him; he shoos them away. He's on his porch drinking coffee and stands up as a sheepish-looking Thao approaches. Walt leaves him to it and wanders off towards his garage. Thao finds Walt watching his abatis border and looks thoughtful, then shrugs. Walt looks at a very dilapidated house across the street.",
  "iterations": {
    "1": "In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. As she goes upstairs, the group of boys follows her. Walt goes over to Thao and sips his drink as Thao looks away. Walt matches off, leaving Thao looking dejected but thoughtful. Walt mows his front lawn with a push mower, and he looks up to see two of his Hmong neighbors bringing flowers to his house. The neighbors smile, and as they leave the flowers, Walt carries on mowing. He stops and looks back at them. Later, he opens his door to more neighbors bearing food, sniffs it, and waves the three women and their food inside, following them in. Later, he pulls onto his drive in his pickup and finds Sue, Thao, and their mother waiting for him; he shoos them away. He's on his porch drinking coffee and stands up as a sheepish-looking Thao approaches. Walt leaves him to it and wanders off towards his garage. Thao finds Walt watching his abatis border and looks thoughtful, then shrugs. Walt looks at a very dilapidated house across the street.",
    "2": "In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. As she goes upstairs, the group of boys follows her. Walt goes over to Thao and sips his drink as Thao looks away. Walt matches off, leaving Thao looking dejected but thoughtful. Walt mows his front lawn with a push mower, and he looks up to see two of his Hmong neighbors bringing flowers to his house. The neighbors smile, and as they leave the flowers, Walt carries on mowing. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. He stops and looks back at them. Later, he opens his door to more neighbors bearing food, sniffs it, and waves the three women and their food inside, following them in. Later, he pulls onto his drive in his pickup and finds Sue, Thao, and their mother waiting for him; he shoos them away. He's on his porch drinking coffee and stands up as a sheepish-looking Thao approaches. Walt leaves him to it and wanders off towards his garage. Thao finds Walt watching his abatis border and looks thoughtful, then shrugs. Walt looks at a very dilapidated house across the street.",
    "3": "In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. As she goes upstairs, the group of boys follows her. Walt goes over to Thao and sips his drink as Thao looks away. Walt matches off, leaving Thao looking dejected but thoughtful. Walt mows his front lawn with a push mower, and he looks up to see two of his Hmong neighbors bringing flowers to his house. The neighbors smile, and as they leave the flowers, Walt carries on mowing. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. He stops and looks back at them. Later, he opens his door to more neighbors bearing food, sniffs it, and waves the three women and their food inside, following them in. Later, he pulls onto his drive in his pickup and finds Sue, Thao, and their mother waiting for him; he shoos them away. He's on his porch drinking coffee and stands up as a sheepish-looking Thao approaches. Walt leaves him to it and wanders off towards his garage. Thao finds Walt watching his abatis border and looks thoughtful, then shrugs. Walt looks at a very dilapidated house across the street. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas.",
    "4": "In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. As she goes upstairs, the group of boys follows her. Walt goes over to Thao and sips his drink as Thao looks away. Walt matches off, leaving Thao looking dejected but thoughtful. Walt mows his front lawn with a push mower, and he looks up to see two of his Hmong neighbors bringing flowers to his house. The neighbors smile, and as they leave the flowers, Walt carries on mowing. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. He stops and looks back at them. Later, he opens his door to more neighbors bearing food, sniffs it, and waves the three women and their food inside, following them in. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Later, he pulls onto his drive in his pickup and finds Sue, Thao, and their mother waiting for him; he shoos them away. He's on his porch drinking coffee and stands up as a sheepish-looking Thao approaches. Walt leaves him to it and wanders off towards his garage. Thao finds Walt watching his abatis border and looks thoughtful, then shrugs. Walt looks at a very dilapidated house across the street. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas.",
    "5": "In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. As she goes upstairs, the group of boys follows her. Walt goes over to Thao and sips his drink as Thao looks away. Walt matches off, leaving Thao looking dejected but thoughtful. Walt mows his front lawn with a push mower, and he looks up to see two of his Hmong neighbors bringing flowers to his house. The neighbors smile, and as they leave the flowers, Walt carries on mowing. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. He stops and looks back at them. Later, he opens his door to more neighbors bearing food, sniffs it, and waves the three women and their food inside, following them in. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Later, he pulls onto his drive in his pickup and finds Sue, Thao, and their mother waiting for him; he shoos them away. He's on his porch drinking coffee and stands up as a sheepish-looking Thao approaches. Walt leaves him to it and wanders off towards his garage. Thao finds Walt watching his abatis border and looks thoughtful, then shrugs. Walt looks at a very dilapidated house across the street. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas.",
    "6": "In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. As she goes upstairs, the group of boys follows her. Walt goes over to Thao and sips his drink as Thao looks away. Walt matches off, leaving Thao looking dejected but thoughtful. Walt mows his front lawn with a push mower, and he looks up to see two of his Hmong neighbors bringing flowers to his house. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. The neighbors smile, and as they leave the flowers, Walt carries on mowing. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. He stops and looks back at them. Later, he opens his door to more neighbors bearing food, sniffs it, and waves the three women and their food inside, following them in. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Later, he pulls onto his drive in his pickup and finds Sue, Thao, and their mother waiting for him; he shoos them away. He's on his porch drinking coffee and stands up as a sheepish-looking Thao approaches. Walt leaves him to it and wanders off towards his garage. Thao finds Walt watching his abatis border and looks thoughtful, then shrugs. Walt looks at a very dilapidated house across the street. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas.",
    "7": "In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. As she goes upstairs, the group of boys follows her. Walt goes over to Thao and sips his drink as Thao looks away. Walt matches off, leaving Thao looking dejected but thoughtful. Walt mows his front lawn with a push mower, and he looks up to see two of his Hmong neighbors bringing flowers to his house. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. The neighbors smile, and as they leave the flowers, Walt carries on mowing. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. He stops and looks back at them. Later, he opens his door to more neighbors bearing food, sniffs it, and waves the three women and their food inside, following them in. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Later, he pulls onto his drive in his pickup and finds Sue, Thao, and their mother waiting for him; he shoos them away. He's on his porch drinking coffee and stands up as a sheepish-looking Thao approaches. Walt leaves him to it and wanders off towards his garage. Thao finds Walt watching his abatis border and looks thoughtful, then shrugs. Walt looks at a very dilapidated house across the street. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas.",
    "8": "In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. As she goes upstairs, the group of boys follows her. Walt goes over to Thao and sips his drink as Thao looks away. Walt matches off, leaving Thao looking dejected but thoughtful. Walt mows his front lawn with a push mower, and he looks up to see two of his Hmong neighbors bringing flowers to his house. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. The neighbors smile, and as they leave the flowers, Walt carries on mowing. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. He stops and looks back at them. Later, he opens his door to more neighbors bearing food, sniffs it, and waves the three women and their food inside, following them in. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Later, he pulls onto his drive in his pickup and finds Sue, Thao, and their mother waiting for him; he shoos them away. He's on his porch drinking coffee and stands up as a sheepish-looking Thao approaches. Walt leaves him to it and wanders off towards his garage. Thao finds Walt watching his abatis border and looks thoughtful, then shrugs. Walt looks at a very dilapidated house across the street. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas.",
    "9": "In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. As she goes upstairs, the group of boys follows her. Walt goes over to Thao and sips his drink as Thao looks away. Walt matches off, leaving Thao looking dejected but thoughtful. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. Walt mows his front lawn with a push mower, and he looks up to see two of his Hmong neighbors bringing flowers to his house. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. The neighbors smile, and as they leave the flowers, Walt carries on mowing. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. He stops and looks back at them. Later, he opens his door to more neighbors bearing food, sniffs it, and waves the three women and their food inside, following them in. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Later, he pulls onto his drive in his pickup and finds Sue, Thao, and their mother waiting for him; he shoos them away. He's on his porch drinking coffee and stands up as a sheepish-looking Thao approaches. Walt leaves him to it and wanders off towards his garage. Thao finds Walt watching his abatis border and looks thoughtful, then shrugs. Walt looks at a very dilapidated house across the street. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas.",
    "10": "In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. As she goes upstairs, the group of boys follows her. Walt goes over to Thao and sips his drink as Thao looks away. Walt matches off, leaving Thao looking dejected but thoughtful. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. Walt mows his front lawn with a push mower, and he looks up to see two of his Hmong neighbors bringing flowers to his house. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. The neighbors smile, and as they leave the flowers, Walt carries on mowing. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. He stops and looks back at them. Later, he opens his door to more neighbors bearing food, sniffs it, and waves the three women and their food inside, following them in. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Later, he pulls onto his drive in his pickup and finds Sue, Thao, and their mother waiting for him; he shoos them away. He's on his porch drinking coffee and stands up as a sheepish-looking Thao approaches. Walt leaves him to it and wanders off towards his garage. Thao finds Walt watching his abatis border and looks thoughtful, then shrugs. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Walt looks at a very dilapidated house across the street. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas."
  }
}