{
  "ground_truth": "Walt kicks a table, then marches into his front room and kicks over another table, then punches in some cupboard doors as Daisy runs for cover. Walt sits down in an armchair, blood dripping from his fingers, and stares into the distance, a frown on his face, his features fixed and grim. He sheds a tear, and the blood on his fists has dried. Daisy comes and sits beside him. Father Janovich knocks at Walt's door and lets himself in as Walt lights up a cigarette. Father Janovich perches on a coffee table beside an open photograph album and stares at Walt, who drags pensively on his cigarette and looks thoughtful. Father Janovich gets up, goes over to the cool box, returns with four cans, and passes a couple to Walt while keeping a couple for himself. They each take a swig, and Walt takes another swig as Father Janovich eyes him, who stares unwaveringly back. In the morning, Thao walks into Walt's kitchen and finds him sipping a mug of coffee. They sit at the kitchen table, Walt gives Thao a scornful look, Thao nods reluctantly, and then gets up and goes as Walt stares after him. Later, Walt is busy mowing his front lawn, and now he relaxes in the bath, lights a cigarette, and looks over at Daisy, who's sitting beside the tub. Martin gives Walt a haircut, chuckles, and pockets the money.",
  "iterations": {
    "1": "Walt kicks a table, then marches into his front room and kicks over another table, then punches in some cupboard doors as Daisy runs for cover. Walt sits down in an armchair, blood dripping from his fingers, and stares into the distance, a frown on his face, his features fixed and grim. He sheds a tear, and the blood on his fists has dried. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Daisy comes and sits beside him. Father Janovich knocks at Walt's door and lets himself in as Walt lights up a cigarette. Father Janovich perches on a coffee table beside an open photograph album and stares at Walt, who drags pensively on his cigarette and looks thoughtful. Father Janovich gets up, goes over to the cool box, returns with four cans, and passes a couple to Walt while keeping a couple for himself. They each take a swig, and Walt takes another swig as Father Janovich eyes him, who stares unwaveringly back. In the morning, Thao walks into Walt's kitchen and finds him sipping a mug of coffee. They sit at the kitchen table, Walt gives Thao a scornful look, Thao nods reluctantly, and then gets up and goes as Walt stares after him. Later, Walt is busy mowing his front lawn, and now he relaxes in the bath, lights a cigarette, and looks over at Daisy, who's sitting beside the tub. Martin gives Walt a haircut, chuckles, and pockets the money.",
    "2": "In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Walt kicks a table, then marches into his front room and kicks over another table, then punches in some cupboard doors as Daisy runs for cover. Walt sits down in an armchair, blood dripping from his fingers, and stares into the distance, a frown on his face, his features fixed and grim. He sheds a tear, and the blood on his fists has dried. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Daisy comes and sits beside him. Father Janovich knocks at Walt's door and lets himself in as Walt lights up a cigarette. Father Janovich perches on a coffee table beside an open photograph album and stares at Walt, who drags pensively on his cigarette and looks thoughtful. Father Janovich gets up, goes over to the cool box, returns with four cans, and passes a couple to Walt while keeping a couple for himself. They each take a swig, and Walt takes another swig as Father Janovich eyes him, who stares unwaveringly back. In the morning, Thao walks into Walt's kitchen and finds him sipping a mug of coffee. They sit at the kitchen table, Walt gives Thao a scornful look, Thao nods reluctantly, and then gets up and goes as Walt stares after him. Later, Walt is busy mowing his front lawn, and now he relaxes in the bath, lights a cigarette, and looks over at Daisy, who's sitting beside the tub. Martin gives Walt a haircut, chuckles, and pockets the money.",
    "3": "In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Walt kicks a table, then marches into his front room and kicks over another table, then punches in some cupboard doors as Daisy runs for cover. Walt sits down in an armchair, blood dripping from his fingers, and stares into the distance, a frown on his face, his features fixed and grim. He sheds a tear, and the blood on his fists has dried. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Daisy comes and sits beside him. Father Janovich knocks at Walt's door and lets himself in as Walt lights up a cigarette. Father Janovich perches on a coffee table beside an open photograph album and stares at Walt, who drags pensively on his cigarette and looks thoughtful. Father Janovich gets up, goes over to the cool box, returns with four cans, and passes a couple to Walt while keeping a couple for himself. They each take a swig, and Walt takes another swig as Father Janovich eyes him, who stares unwaveringly back. In the morning, Thao walks into Walt's kitchen and finds him sipping a mug of coffee. They sit at the kitchen table, Walt gives Thao a scornful look, Thao nods reluctantly, and then gets up and goes as Walt stares after him. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Later, Walt is busy mowing his front lawn, and now he relaxes in the bath, lights a cigarette, and looks over at Daisy, who's sitting beside the tub. Martin gives Walt a haircut, chuckles, and pockets the money.",
    "4": "In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Walt kicks a table, then marches into his front room and kicks over another table, then punches in some cupboard doors as Daisy runs for cover. Walt sits down in an armchair, blood dripping from his fingers, and stares into the distance, a frown on his face, his features fixed and grim. He sheds a tear, and the blood on his fists has dried. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Daisy comes and sits beside him. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. Father Janovich knocks at Walt's door and lets himself in as Walt lights up a cigarette. Father Janovich perches on a coffee table beside an open photograph album and stares at Walt, who drags pensively on his cigarette and looks thoughtful. Father Janovich gets up, goes over to the cool box, returns with four cans, and passes a couple to Walt while keeping a couple for himself. They each take a swig, and Walt takes another swig as Father Janovich eyes him, who stares unwaveringly back. In the morning, Thao walks into Walt's kitchen and finds him sipping a mug of coffee. They sit at the kitchen table, Walt gives Thao a scornful look, Thao nods reluctantly, and then gets up and goes as Walt stares after him. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Later, Walt is busy mowing his front lawn, and now he relaxes in the bath, lights a cigarette, and looks over at Daisy, who's sitting beside the tub. Martin gives Walt a haircut, chuckles, and pockets the money.",
    "5": "In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Walt kicks a table, then marches into his front room and kicks over another table, then punches in some cupboard doors as Daisy runs for cover. Walt sits down in an armchair, blood dripping from his fingers, and stares into the distance, a frown on his face, his features fixed and grim. He sheds a tear, and the blood on his fists has dried. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Daisy comes and sits beside him. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. Father Janovich knocks at Walt's door and lets himself in as Walt lights up a cigarette. Father Janovich perches on a coffee table beside an open photograph album and stares at Walt, who drags pensively on his cigarette and looks thoughtful. Father Janovich gets up, goes over to the cool box, returns with four cans, and passes a couple to Walt while keeping a couple for himself. They each take a swig, and Walt takes another swig as Father Janovich eyes him, who stares unwaveringly back. In the morning, Thao walks into Walt's kitchen and finds him sipping a mug of coffee. They sit at the kitchen table, Walt gives Thao a scornful look, Thao nods reluctantly, and then gets up and goes as Walt stares after him. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Later, Walt is busy mowing his front lawn, and now he relaxes in the bath, lights a cigarette, and looks over at Daisy, who's sitting beside the tub. Martin gives Walt a haircut, chuckles, and pockets the money.",
    "6": "In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Walt kicks a table, then marches into his front room and kicks over another table, then punches in some cupboard doors as Daisy runs for cover. Walt sits down in an armchair, blood dripping from his fingers, and stares into the distance, a frown on his face, his features fixed and grim. He sheds a tear, and the blood on his fists has dried. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Daisy comes and sits beside him. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. Father Janovich knocks at Walt's door and lets himself in as Walt lights up a cigarette. Father Janovich perches on a coffee table beside an open photograph album and stares at Walt, who drags pensively on his cigarette and looks thoughtful. Father Janovich gets up, goes over to the cool box, returns with four cans, and passes a couple to Walt while keeping a couple for himself. They each take a swig, and Walt takes another swig as Father Janovich eyes him, who stares unwaveringly back. In the morning, Thao walks into Walt's kitchen and finds him sipping a mug of coffee. They sit at the kitchen table, Walt gives Thao a scornful look, Thao nods reluctantly, and then gets up and goes as Walt stares after him. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Later, Walt is busy mowing his front lawn, and now he relaxes in the bath, lights a cigarette, and looks over at Daisy, who's sitting beside the tub. Martin gives Walt a haircut, chuckles, and pockets the money.",
    "7": "In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Walt kicks a table, then marches into his front room and kicks over another table, then punches in some cupboard doors as Daisy runs for cover. Walt sits down in an armchair, blood dripping from his fingers, and stares into the distance, a frown on his face, his features fixed and grim. He sheds a tear, and the blood on his fists has dried. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Daisy comes and sits beside him. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Father Janovich knocks at Walt's door and lets himself in as Walt lights up a cigarette. Father Janovich perches on a coffee table beside an open photograph album and stares at Walt, who drags pensively on his cigarette and looks thoughtful. Father Janovich gets up, goes over to the cool box, returns with four cans, and passes a couple to Walt while keeping a couple for himself. They each take a swig, and Walt takes another swig as Father Janovich eyes him, who stares unwaveringly back. In the morning, Thao walks into Walt's kitchen and finds him sipping a mug of coffee. They sit at the kitchen table, Walt gives Thao a scornful look, Thao nods reluctantly, and then gets up and goes as Walt stares after him. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Later, Walt is busy mowing his front lawn, and now he relaxes in the bath, lights a cigarette, and looks over at Daisy, who's sitting beside the tub. Martin gives Walt a haircut, chuckles, and pockets the money.",
    "8": "In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Walt kicks a table, then marches into his front room and kicks over another table, then punches in some cupboard doors as Daisy runs for cover. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Walt sits down in an armchair, blood dripping from his fingers, and stares into the distance, a frown on his face, his features fixed and grim. He sheds a tear, and the blood on his fists has dried. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Daisy comes and sits beside him. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Father Janovich knocks at Walt's door and lets himself in as Walt lights up a cigarette. Father Janovich perches on a coffee table beside an open photograph album and stares at Walt, who drags pensively on his cigarette and looks thoughtful. Father Janovich gets up, goes over to the cool box, returns with four cans, and passes a couple to Walt while keeping a couple for himself. They each take a swig, and Walt takes another swig as Father Janovich eyes him, who stares unwaveringly back. In the morning, Thao walks into Walt's kitchen and finds him sipping a mug of coffee. They sit at the kitchen table, Walt gives Thao a scornful look, Thao nods reluctantly, and then gets up and goes as Walt stares after him. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Later, Walt is busy mowing his front lawn, and now he relaxes in the bath, lights a cigarette, and looks over at Daisy, who's sitting beside the tub. Martin gives Walt a haircut, chuckles, and pockets the money.",
    "9": "In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Walt kicks a table, then marches into his front room and kicks over another table, then punches in some cupboard doors as Daisy runs for cover. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Walt sits down in an armchair, blood dripping from his fingers, and stares into the distance, a frown on his face, his features fixed and grim. He sheds a tear, and the blood on his fists has dried. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Daisy comes and sits beside him. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Father Janovich knocks at Walt's door and lets himself in as Walt lights up a cigarette. Father Janovich perches on a coffee table beside an open photograph album and stares at Walt, who drags pensively on his cigarette and looks thoughtful. Father Janovich gets up, goes over to the cool box, returns with four cans, and passes a couple to Walt while keeping a couple for himself. They each take a swig, and Walt takes another swig as Father Janovich eyes him, who stares unwaveringly back. In the morning, Thao walks into Walt's kitchen and finds him sipping a mug of coffee. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. They sit at the kitchen table, Walt gives Thao a scornful look, Thao nods reluctantly, and then gets up and goes as Walt stares after him. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Later, Walt is busy mowing his front lawn, and now he relaxes in the bath, lights a cigarette, and looks over at Daisy, who's sitting beside the tub. Martin gives Walt a haircut, chuckles, and pockets the money.",
    "10": "In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Walt kicks a table, then marches into his front room and kicks over another table, then punches in some cupboard doors as Daisy runs for cover. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Walt sits down in an armchair, blood dripping from his fingers, and stares into the distance, a frown on his face, his features fixed and grim. He sheds a tear, and the blood on his fists has dried. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Daisy comes and sits beside him. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Father Janovich knocks at Walt's door and lets himself in as Walt lights up a cigarette. Father Janovich perches on a coffee table beside an open photograph album and stares at Walt, who drags pensively on his cigarette and looks thoughtful. Father Janovich gets up, goes over to the cool box, returns with four cans, and passes a couple to Walt while keeping a couple for himself. They each take a swig, and Walt takes another swig as Father Janovich eyes him, who stares unwaveringly back. In the morning, Thao walks into Walt's kitchen and finds him sipping a mug of coffee. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. They sit at the kitchen table, Walt gives Thao a scornful look, Thao nods reluctantly, and then gets up and goes as Walt stares after him. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Later, Walt is busy mowing his front lawn, and now he relaxes in the bath, lights a cigarette, and looks over at Daisy, who's sitting beside the tub. Martin gives Walt a haircut, chuckles, and pockets the money."
  }
}