{
  "ground_truth": "They scuttle across the floor, up the wall, over the stone window sill, and out through a crack in the glass. They see something else on the floor. A pool of water reflects writing on the wall above. Harry sees something else. A cat, stiff as a board, is hanging by its tail from a lamp bracket. Students appear at each end of the corridor. Seeing the cat, they stare suspiciously at Harry, Ron, and Hermione. Colin prepares to take a photograph, but somebody stops him. Draco reads out the writing on the wall. Filch pushes his way through the gaping crowd. He sees his cat. He grabs Harry.",
  "iterations": {
    "1": "They scuttle across the floor, up the wall, over the stone window sill, and out through a crack in the glass. They see something else on the floor. A pool of water reflects writing on the wall above. Harry sees something else. A cat, stiff as a board, is hanging by its tail from a lamp bracket. Students appear at each end of the corridor. Seeing the cat, they stare suspiciously at Harry, Ron, and Hermione. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Colin prepares to take a photograph, but somebody stops him. Draco reads out the writing on the wall. Filch pushes his way through the gaping crowd. He sees his cat. He grabs Harry.",
    "2": "They scuttle across the floor, up the wall, over the stone window sill, and out through a crack in the glass. They see something else on the floor. A pool of water reflects writing on the wall above. Harry sees something else. A cat, stiff as a board, is hanging by its tail from a lamp bracket. Students appear at each end of the corridor. Seeing the cat, they stare suspiciously at Harry, Ron, and Hermione. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. Colin prepares to take a photograph, but somebody stops him. Draco reads out the writing on the wall. Filch pushes his way through the gaping crowd. He sees his cat. He grabs Harry.",
    "3": "They scuttle across the floor, up the wall, over the stone window sill, and out through a crack in the glass. They see something else on the floor. A pool of water reflects writing on the wall above. Harry sees something else. A cat, stiff as a board, is hanging by its tail from a lamp bracket. Students appear at each end of the corridor. Seeing the cat, they stare suspiciously at Harry, Ron, and Hermione. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. Colin prepares to take a photograph, but somebody stops him. Draco reads out the writing on the wall. Filch pushes his way through the gaping crowd. He sees his cat. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. He grabs Harry.",
    "4": "They scuttle across the floor, up the wall, over the stone window sill, and out through a crack in the glass. They see something else on the floor. A pool of water reflects writing on the wall above. Harry sees something else. A cat, stiff as a board, is hanging by its tail from a lamp bracket. Students appear at each end of the corridor. Seeing the cat, they stare suspiciously at Harry, Ron, and Hermione. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. Colin prepares to take a photograph, but somebody stops him. Draco reads out the writing on the wall. Filch pushes his way through the gaping crowd. He sees his cat. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. He grabs Harry.",
    "5": "They scuttle across the floor, up the wall, over the stone window sill, and out through a crack in the glass. They see something else on the floor. A pool of water reflects writing on the wall above. Harry sees something else. A cat, stiff as a board, is hanging by its tail from a lamp bracket. Students appear at each end of the corridor. Seeing the cat, they stare suspiciously at Harry, Ron, and Hermione. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. Colin prepares to take a photograph, but somebody stops him. Draco reads out the writing on the wall. Filch pushes his way through the gaping crowd. He sees his cat. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. He grabs Harry.",
    "6": "They scuttle across the floor, up the wall, over the stone window sill, and out through a crack in the glass. They see something else on the floor. A pool of water reflects writing on the wall above. Harry sees something else. A cat, stiff as a board, is hanging by its tail from a lamp bracket. Students appear at each end of the corridor. Seeing the cat, they stare suspiciously at Harry, Ron, and Hermione. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. Colin prepares to take a photograph, but somebody stops him. Draco reads out the writing on the wall. Filch pushes his way through the gaping crowd. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. He sees his cat. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. He grabs Harry.",
    "7": "They scuttle across the floor, up the wall, over the stone window sill, and out through a crack in the glass. They see something else on the floor. A pool of water reflects writing on the wall above. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. Harry sees something else. A cat, stiff as a board, is hanging by its tail from a lamp bracket. Students appear at each end of the corridor. Seeing the cat, they stare suspiciously at Harry, Ron, and Hermione. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. Colin prepares to take a photograph, but somebody stops him. Draco reads out the writing on the wall. Filch pushes his way through the gaping crowd. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. He sees his cat. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. He grabs Harry.",
    "8": "They scuttle across the floor, up the wall, over the stone window sill, and out through a crack in the glass. They see something else on the floor. A pool of water reflects writing on the wall above. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. Harry sees something else. A cat, stiff as a board, is hanging by its tail from a lamp bracket. Students appear at each end of the corridor. Seeing the cat, they stare suspiciously at Harry, Ron, and Hermione. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. Colin prepares to take a photograph, but somebody stops him. Draco reads out the writing on the wall. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. Filch pushes his way through the gaping crowd. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. He sees his cat. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. He grabs Harry.",
    "9": "They scuttle across the floor, up the wall, over the stone window sill, and out through a crack in the glass. They see something else on the floor. A pool of water reflects writing on the wall above. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. Harry sees something else. A cat, stiff as a board, is hanging by its tail from a lamp bracket. Students appear at each end of the corridor. Seeing the cat, they stare suspiciously at Harry, Ron, and Hermione. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. Colin prepares to take a photograph, but somebody stops him. Draco reads out the writing on the wall. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. Filch pushes his way through the gaping crowd. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. He sees his cat. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. He grabs Harry.",
    "10": "They scuttle across the floor, up the wall, over the stone window sill, and out through a crack in the glass. They see something else on the floor. A pool of water reflects writing on the wall above. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Harry sees something else. A cat, stiff as a board, is hanging by its tail from a lamp bracket. Students appear at each end of the corridor. Seeing the cat, they stare suspiciously at Harry, Ron, and Hermione. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. Colin prepares to take a photograph, but somebody stops him. Draco reads out the writing on the wall. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. Filch pushes his way through the gaping crowd. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. He sees his cat. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. He grabs Harry."
  }
}