{
  "ground_truth": "Hermione crouches down and, taking out her wand, draws a circle in the air, producing a wreath of white roses. Harry wipes his nose with his sleeve and gazes at the grave. Comforting him, Hermione rests her head on his shoulder, then she turns and spots a dark figure watching them from a short distance away. Harry sees an old woman wearing a knitted cape with a hood, who turns and totters slowly away. They follow her up the street until Harry slows and stops beside a burned-out, roofless house. He looks over the gate at the overgrown garden and recalls Voldemort's attack, with both bodies lying on the floor, setting Harry's joy. They turn to find the old woman close beside them, and Harry approaches her as she stares at him. Inside a dark house, Harry takes a matchbox from Bathilda, lights a candle, and the wizened old woman studies Harry's face. He captures sight of something over her shoulder as Bathilda turns her attention to Hermione. Harry holds up the match beside a framed photograph of the young thief who stole Gregorovitch's Elder Wand. Bathilda gazes at him, then picks up the candle and eases her way past him. Hermione looks anxious as Harry follows Bathilda, leaving Hermione in the filthy living room.",
  "iterations": {
    "1": "Hermione crouches down and, taking out her wand, draws a circle in the air, producing a wreath of white roses. Harry wipes his nose with his sleeve and gazes at the grave. Comforting him, Hermione rests her head on his shoulder, then she turns and spots a dark figure watching them from a short distance away. Harry sees an old woman wearing a knitted cape with a hood, who turns and totters slowly away. They follow her up the street until Harry slows and stops beside a burned-out, roofless house. He looks over the gate at the overgrown garden and recalls Voldemort's attack, with both bodies lying on the floor, setting Harry's joy. They turn to find the old woman close beside them, and Harry approaches her as she stares at him. Inside a dark house, Harry takes a matchbox from Bathilda, lights a candle, and the wizened old woman studies Harry's face. He captures sight of something over her shoulder as Bathilda turns her attention to Hermione. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. Harry holds up the match beside a framed photograph of the young thief who stole Gregorovitch's Elder Wand. Bathilda gazes at him, then picks up the candle and eases her way past him. Hermione looks anxious as Harry follows Bathilda, leaving Hermione in the filthy living room.",
    "2": "Hermione crouches down and, taking out her wand, draws a circle in the air, producing a wreath of white roses. Harry wipes his nose with his sleeve and gazes at the grave. Comforting him, Hermione rests her head on his shoulder, then she turns and spots a dark figure watching them from a short distance away. Harry sees an old woman wearing a knitted cape with a hood, who turns and totters slowly away. They follow her up the street until Harry slows and stops beside a burned-out, roofless house. He looks over the gate at the overgrown garden and recalls Voldemort's attack, with both bodies lying on the floor, setting Harry's joy. They turn to find the old woman close beside them, and Harry approaches her as she stares at him. Inside a dark house, Harry takes a matchbox from Bathilda, lights a candle, and the wizened old woman studies Harry's face. He captures sight of something over her shoulder as Bathilda turns her attention to Hermione. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. Harry holds up the match beside a framed photograph of the young thief who stole Gregorovitch's Elder Wand. Bathilda gazes at him, then picks up the candle and eases her way past him. Hermione looks anxious as Harry follows Bathilda, leaving Hermione in the filthy living room. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense.",
    "3": "Hermione crouches down and, taking out her wand, draws a circle in the air, producing a wreath of white roses. Harry wipes his nose with his sleeve and gazes at the grave. Comforting him, Hermione rests her head on his shoulder, then she turns and spots a dark figure watching them from a short distance away. Harry sees an old woman wearing a knitted cape with a hood, who turns and totters slowly away. They follow her up the street until Harry slows and stops beside a burned-out, roofless house. He looks over the gate at the overgrown garden and recalls Voldemort's attack, with both bodies lying on the floor, setting Harry's joy. They turn to find the old woman close beside them, and Harry approaches her as she stares at him. Inside a dark house, Harry takes a matchbox from Bathilda, lights a candle, and the wizened old woman studies Harry's face. He captures sight of something over her shoulder as Bathilda turns her attention to Hermione. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. Harry holds up the match beside a framed photograph of the young thief who stole Gregorovitch's Elder Wand. Bathilda gazes at him, then picks up the candle and eases her way past him. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. Hermione looks anxious as Harry follows Bathilda, leaving Hermione in the filthy living room. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense.",
    "4": "Hermione crouches down and, taking out her wand, draws a circle in the air, producing a wreath of white roses. Harry wipes his nose with his sleeve and gazes at the grave. Comforting him, Hermione rests her head on his shoulder, then she turns and spots a dark figure watching them from a short distance away. Harry sees an old woman wearing a knitted cape with a hood, who turns and totters slowly away. They follow her up the street until Harry slows and stops beside a burned-out, roofless house. He looks over the gate at the overgrown garden and recalls Voldemort's attack, with both bodies lying on the floor, setting Harry's joy. They turn to find the old woman close beside them, and Harry approaches her as she stares at him. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Inside a dark house, Harry takes a matchbox from Bathilda, lights a candle, and the wizened old woman studies Harry's face. He captures sight of something over her shoulder as Bathilda turns her attention to Hermione. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. Harry holds up the match beside a framed photograph of the young thief who stole Gregorovitch's Elder Wand. Bathilda gazes at him, then picks up the candle and eases her way past him. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. Hermione looks anxious as Harry follows Bathilda, leaving Hermione in the filthy living room. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense.",
    "5": "Hermione crouches down and, taking out her wand, draws a circle in the air, producing a wreath of white roses. Harry wipes his nose with his sleeve and gazes at the grave. Comforting him, Hermione rests her head on his shoulder, then she turns and spots a dark figure watching them from a short distance away. Harry sees an old woman wearing a knitted cape with a hood, who turns and totters slowly away. They follow her up the street until Harry slows and stops beside a burned-out, roofless house. He looks over the gate at the overgrown garden and recalls Voldemort's attack, with both bodies lying on the floor, setting Harry's joy. They turn to find the old woman close beside them, and Harry approaches her as she stares at him. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Inside a dark house, Harry takes a matchbox from Bathilda, lights a candle, and the wizened old woman studies Harry's face. He captures sight of something over her shoulder as Bathilda turns her attention to Hermione. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. Harry holds up the match beside a framed photograph of the young thief who stole Gregorovitch's Elder Wand. Bathilda gazes at him, then picks up the candle and eases her way past him. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. Hermione looks anxious as Harry follows Bathilda, leaving Hermione in the filthy living room. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense.",
    "6": "Hermione crouches down and, taking out her wand, draws a circle in the air, producing a wreath of white roses. Harry wipes his nose with his sleeve and gazes at the grave. Comforting him, Hermione rests her head on his shoulder, then she turns and spots a dark figure watching them from a short distance away. Harry sees an old woman wearing a knitted cape with a hood, who turns and totters slowly away. They follow her up the street until Harry slows and stops beside a burned-out, roofless house. He looks over the gate at the overgrown garden and recalls Voldemort's attack, with both bodies lying on the floor, setting Harry's joy. They turn to find the old woman close beside them, and Harry approaches her as she stares at him. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Inside a dark house, Harry takes a matchbox from Bathilda, lights a candle, and the wizened old woman studies Harry's face. He captures sight of something over her shoulder as Bathilda turns her attention to Hermione. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. Harry holds up the match beside a framed photograph of the young thief who stole Gregorovitch's Elder Wand. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. Bathilda gazes at him, then picks up the candle and eases her way past him. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. Hermione looks anxious as Harry follows Bathilda, leaving Hermione in the filthy living room. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense.",
    "7": "Hermione crouches down and, taking out her wand, draws a circle in the air, producing a wreath of white roses. Harry wipes his nose with his sleeve and gazes at the grave. Comforting him, Hermione rests her head on his shoulder, then she turns and spots a dark figure watching them from a short distance away. Harry sees an old woman wearing a knitted cape with a hood, who turns and totters slowly away. They follow her up the street until Harry slows and stops beside a burned-out, roofless house. He looks over the gate at the overgrown garden and recalls Voldemort's attack, with both bodies lying on the floor, setting Harry's joy. They turn to find the old woman close beside them, and Harry approaches her as she stares at him. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Inside a dark house, Harry takes a matchbox from Bathilda, lights a candle, and the wizened old woman studies Harry's face. He captures sight of something over her shoulder as Bathilda turns her attention to Hermione. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. Harry holds up the match beside a framed photograph of the young thief who stole Gregorovitch's Elder Wand. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Bathilda gazes at him, then picks up the candle and eases her way past him. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. Hermione looks anxious as Harry follows Bathilda, leaving Hermione in the filthy living room. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense.",
    "8": "Hermione crouches down and, taking out her wand, draws a circle in the air, producing a wreath of white roses. Harry wipes his nose with his sleeve and gazes at the grave. Comforting him, Hermione rests her head on his shoulder, then she turns and spots a dark figure watching them from a short distance away. Harry sees an old woman wearing a knitted cape with a hood, who turns and totters slowly away. They follow her up the street until Harry slows and stops beside a burned-out, roofless house. He looks over the gate at the overgrown garden and recalls Voldemort's attack, with both bodies lying on the floor, setting Harry's joy. They turn to find the old woman close beside them, and Harry approaches her as she stares at him. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Inside a dark house, Harry takes a matchbox from Bathilda, lights a candle, and the wizened old woman studies Harry's face. He captures sight of something over her shoulder as Bathilda turns her attention to Hermione. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. Harry holds up the match beside a framed photograph of the young thief who stole Gregorovitch's Elder Wand. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Bathilda gazes at him, then picks up the candle and eases her way past him. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. Hermione looks anxious as Harry follows Bathilda, leaving Hermione in the filthy living room. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense.",
    "9": "Hermione crouches down and, taking out her wand, draws a circle in the air, producing a wreath of white roses. Harry wipes his nose with his sleeve and gazes at the grave. Comforting him, Hermione rests her head on his shoulder, then she turns and spots a dark figure watching them from a short distance away. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. Harry sees an old woman wearing a knitted cape with a hood, who turns and totters slowly away. They follow her up the street until Harry slows and stops beside a burned-out, roofless house. He looks over the gate at the overgrown garden and recalls Voldemort's attack, with both bodies lying on the floor, setting Harry's joy. They turn to find the old woman close beside them, and Harry approaches her as she stares at him. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Inside a dark house, Harry takes a matchbox from Bathilda, lights a candle, and the wizened old woman studies Harry's face. He captures sight of something over her shoulder as Bathilda turns her attention to Hermione. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. Harry holds up the match beside a framed photograph of the young thief who stole Gregorovitch's Elder Wand. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Bathilda gazes at him, then picks up the candle and eases her way past him. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. Hermione looks anxious as Harry follows Bathilda, leaving Hermione in the filthy living room. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense.",
    "10": "Hermione crouches down and, taking out her wand, draws a circle in the air, producing a wreath of white roses. Harry wipes his nose with his sleeve and gazes at the grave. Comforting him, Hermione rests her head on his shoulder, then she turns and spots a dark figure watching them from a short distance away. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. Harry sees an old woman wearing a knitted cape with a hood, who turns and totters slowly away. They follow her up the street until Harry slows and stops beside a burned-out, roofless house. He looks over the gate at the overgrown garden and recalls Voldemort's attack, with both bodies lying on the floor, setting Harry's joy. They turn to find the old woman close beside them, and Harry approaches her as she stares at him. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Inside a dark house, Harry takes a matchbox from Bathilda, lights a candle, and the wizened old woman studies Harry's face. He captures sight of something over her shoulder as Bathilda turns her attention to Hermione. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. Harry holds up the match beside a framed photograph of the young thief who stole Gregorovitch's Elder Wand. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Bathilda gazes at him, then picks up the candle and eases her way past him. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. Hermione looks anxious as Harry follows Bathilda, leaving Hermione in the filthy living room. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense."
  }
}