{
  "ground_truth": "A bus and a lorry approach as Hagrid rides upside down on the tunnel roof, with Harry hanging out of the sidecar, running over the bus, and dropping back in when the bike returns to the road. Hagrid slumps forward, hit by a bolt from a death eater, and Harry grabs the handlebars, forcing the motorbike up into the air. Hedwig flies towards them and attacks the chasing death eater, but as the owl swoops to attack again, she is hit by a bolt of green light and tumbles earthwards. The death eater pulls back, and Harry suddenly cries out in pain, his face contorting as another ominous, dark figure closes in. Harry slumps forward, his jagged scar illuminated by the bike's headlight. As they speed between two lines of electric pylons, Harry's wand lights of its own accord. The dark figure draws level, and the power flowing from Harry's wand connects with an equal force of pulsating energy. The swirling vortex of light travels up Voldemort's wand, illuminating his face, and an explosion rocks the bike. Harry presses the control button, and the bike zooms away, spewing out flames that propel Voldemort backwards as the electric pylons collapse. Harry, Hagrid, and the bike soar upwards beyond the clouds, and Hagrid comes to and takes control of the bike. As Harry settles back into the sidecar, the engine fails, and they hurdle downwards. Molly Weasley hears them break through the protective shield around their house as they plummet towards the ground, making a bumpy landing in a reed bed.",
  "iterations": {
    "1": "On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. A bus and a lorry approach as Hagrid rides upside down on the tunnel roof, with Harry hanging out of the sidecar, running over the bus, and dropping back in when the bike returns to the road. Hagrid slumps forward, hit by a bolt from a death eater, and Harry grabs the handlebars, forcing the motorbike up into the air. Hedwig flies towards them and attacks the chasing death eater, but as the owl swoops to attack again, she is hit by a bolt of green light and tumbles earthwards. The death eater pulls back, and Harry suddenly cries out in pain, his face contorting as another ominous, dark figure closes in. Harry slumps forward, his jagged scar illuminated by the bike's headlight. As they speed between two lines of electric pylons, Harry's wand lights of its own accord. The dark figure draws level, and the power flowing from Harry's wand connects with an equal force of pulsating energy. The swirling vortex of light travels up Voldemort's wand, illuminating his face, and an explosion rocks the bike. Harry presses the control button, and the bike zooms away, spewing out flames that propel Voldemort backwards as the electric pylons collapse. Harry, Hagrid, and the bike soar upwards beyond the clouds, and Hagrid comes to and takes control of the bike. As Harry settles back into the sidecar, the engine fails, and they hurdle downwards. Molly Weasley hears them break through the protective shield around their house as they plummet towards the ground, making a bumpy landing in a reed bed.",
    "2": "On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. A bus and a lorry approach as Hagrid rides upside down on the tunnel roof, with Harry hanging out of the sidecar, running over the bus, and dropping back in when the bike returns to the road. Hagrid slumps forward, hit by a bolt from a death eater, and Harry grabs the handlebars, forcing the motorbike up into the air. Hedwig flies towards them and attacks the chasing death eater, but as the owl swoops to attack again, she is hit by a bolt of green light and tumbles earthwards. The death eater pulls back, and Harry suddenly cries out in pain, his face contorting as another ominous, dark figure closes in. Harry slumps forward, his jagged scar illuminated by the bike's headlight. As they speed between two lines of electric pylons, Harry's wand lights of its own accord. The dark figure draws level, and the power flowing from Harry's wand connects with an equal force of pulsating energy. The swirling vortex of light travels up Voldemort's wand, illuminating his face, and an explosion rocks the bike. Harry presses the control button, and the bike zooms away, spewing out flames that propel Voldemort backwards as the electric pylons collapse. Harry, Hagrid, and the bike soar upwards beyond the clouds, and Hagrid comes to and takes control of the bike. As Harry settles back into the sidecar, the engine fails, and they hurdle downwards. Molly Weasley hears them break through the protective shield around their house as they plummet towards the ground, making a bumpy landing in a reed bed. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation.",
    "3": "On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. A bus and a lorry approach as Hagrid rides upside down on the tunnel roof, with Harry hanging out of the sidecar, running over the bus, and dropping back in when the bike returns to the road. Hagrid slumps forward, hit by a bolt from a death eater, and Harry grabs the handlebars, forcing the motorbike up into the air. Hedwig flies towards them and attacks the chasing death eater, but as the owl swoops to attack again, she is hit by a bolt of green light and tumbles earthwards. The death eater pulls back, and Harry suddenly cries out in pain, his face contorting as another ominous, dark figure closes in. Harry slumps forward, his jagged scar illuminated by the bike's headlight. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. As they speed between two lines of electric pylons, Harry's wand lights of its own accord. The dark figure draws level, and the power flowing from Harry's wand connects with an equal force of pulsating energy. The swirling vortex of light travels up Voldemort's wand, illuminating his face, and an explosion rocks the bike. Harry presses the control button, and the bike zooms away, spewing out flames that propel Voldemort backwards as the electric pylons collapse. Harry, Hagrid, and the bike soar upwards beyond the clouds, and Hagrid comes to and takes control of the bike. As Harry settles back into the sidecar, the engine fails, and they hurdle downwards. Molly Weasley hears them break through the protective shield around their house as they plummet towards the ground, making a bumpy landing in a reed bed. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation.",
    "4": "Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. A bus and a lorry approach as Hagrid rides upside down on the tunnel roof, with Harry hanging out of the sidecar, running over the bus, and dropping back in when the bike returns to the road. Hagrid slumps forward, hit by a bolt from a death eater, and Harry grabs the handlebars, forcing the motorbike up into the air. Hedwig flies towards them and attacks the chasing death eater, but as the owl swoops to attack again, she is hit by a bolt of green light and tumbles earthwards. The death eater pulls back, and Harry suddenly cries out in pain, his face contorting as another ominous, dark figure closes in. Harry slumps forward, his jagged scar illuminated by the bike's headlight. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. As they speed between two lines of electric pylons, Harry's wand lights of its own accord. The dark figure draws level, and the power flowing from Harry's wand connects with an equal force of pulsating energy. The swirling vortex of light travels up Voldemort's wand, illuminating his face, and an explosion rocks the bike. Harry presses the control button, and the bike zooms away, spewing out flames that propel Voldemort backwards as the electric pylons collapse. Harry, Hagrid, and the bike soar upwards beyond the clouds, and Hagrid comes to and takes control of the bike. As Harry settles back into the sidecar, the engine fails, and they hurdle downwards. Molly Weasley hears them break through the protective shield around their house as they plummet towards the ground, making a bumpy landing in a reed bed. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation.",
    "5": "Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. A bus and a lorry approach as Hagrid rides upside down on the tunnel roof, with Harry hanging out of the sidecar, running over the bus, and dropping back in when the bike returns to the road. Hagrid slumps forward, hit by a bolt from a death eater, and Harry grabs the handlebars, forcing the motorbike up into the air. Hedwig flies towards them and attacks the chasing death eater, but as the owl swoops to attack again, she is hit by a bolt of green light and tumbles earthwards. The death eater pulls back, and Harry suddenly cries out in pain, his face contorting as another ominous, dark figure closes in. Harry slumps forward, his jagged scar illuminated by the bike's headlight. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. As they speed between two lines of electric pylons, Harry's wand lights of its own accord. The dark figure draws level, and the power flowing from Harry's wand connects with an equal force of pulsating energy. The swirling vortex of light travels up Voldemort's wand, illuminating his face, and an explosion rocks the bike. Harry presses the control button, and the bike zooms away, spewing out flames that propel Voldemort backwards as the electric pylons collapse. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. Harry, Hagrid, and the bike soar upwards beyond the clouds, and Hagrid comes to and takes control of the bike. As Harry settles back into the sidecar, the engine fails, and they hurdle downwards. Molly Weasley hears them break through the protective shield around their house as they plummet towards the ground, making a bumpy landing in a reed bed. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation.",
    "6": "Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. A bus and a lorry approach as Hagrid rides upside down on the tunnel roof, with Harry hanging out of the sidecar, running over the bus, and dropping back in when the bike returns to the road. Hagrid slumps forward, hit by a bolt from a death eater, and Harry grabs the handlebars, forcing the motorbike up into the air. Hedwig flies towards them and attacks the chasing death eater, but as the owl swoops to attack again, she is hit by a bolt of green light and tumbles earthwards. The death eater pulls back, and Harry suddenly cries out in pain, his face contorting as another ominous, dark figure closes in. Harry slumps forward, his jagged scar illuminated by the bike's headlight. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. As they speed between two lines of electric pylons, Harry's wand lights of its own accord. The dark figure draws level, and the power flowing from Harry's wand connects with an equal force of pulsating energy. The swirling vortex of light travels up Voldemort's wand, illuminating his face, and an explosion rocks the bike. Harry presses the control button, and the bike zooms away, spewing out flames that propel Voldemort backwards as the electric pylons collapse. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. Harry, Hagrid, and the bike soar upwards beyond the clouds, and Hagrid comes to and takes control of the bike. As Harry settles back into the sidecar, the engine fails, and they hurdle downwards. Molly Weasley hears them break through the protective shield around their house as they plummet towards the ground, making a bumpy landing in a reed bed. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation.",
    "7": "Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. A bus and a lorry approach as Hagrid rides upside down on the tunnel roof, with Harry hanging out of the sidecar, running over the bus, and dropping back in when the bike returns to the road. Hagrid slumps forward, hit by a bolt from a death eater, and Harry grabs the handlebars, forcing the motorbike up into the air. Hedwig flies towards them and attacks the chasing death eater, but as the owl swoops to attack again, she is hit by a bolt of green light and tumbles earthwards. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. The death eater pulls back, and Harry suddenly cries out in pain, his face contorting as another ominous, dark figure closes in. Harry slumps forward, his jagged scar illuminated by the bike's headlight. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. As they speed between two lines of electric pylons, Harry's wand lights of its own accord. The dark figure draws level, and the power flowing from Harry's wand connects with an equal force of pulsating energy. The swirling vortex of light travels up Voldemort's wand, illuminating his face, and an explosion rocks the bike. Harry presses the control button, and the bike zooms away, spewing out flames that propel Voldemort backwards as the electric pylons collapse. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. Harry, Hagrid, and the bike soar upwards beyond the clouds, and Hagrid comes to and takes control of the bike. As Harry settles back into the sidecar, the engine fails, and they hurdle downwards. Molly Weasley hears them break through the protective shield around their house as they plummet towards the ground, making a bumpy landing in a reed bed. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation.",
    "8": "Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. A bus and a lorry approach as Hagrid rides upside down on the tunnel roof, with Harry hanging out of the sidecar, running over the bus, and dropping back in when the bike returns to the road. Hagrid slumps forward, hit by a bolt from a death eater, and Harry grabs the handlebars, forcing the motorbike up into the air. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. Hedwig flies towards them and attacks the chasing death eater, but as the owl swoops to attack again, she is hit by a bolt of green light and tumbles earthwards. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. The death eater pulls back, and Harry suddenly cries out in pain, his face contorting as another ominous, dark figure closes in. Harry slumps forward, his jagged scar illuminated by the bike's headlight. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. As they speed between two lines of electric pylons, Harry's wand lights of its own accord. The dark figure draws level, and the power flowing from Harry's wand connects with an equal force of pulsating energy. The swirling vortex of light travels up Voldemort's wand, illuminating his face, and an explosion rocks the bike. Harry presses the control button, and the bike zooms away, spewing out flames that propel Voldemort backwards as the electric pylons collapse. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. Harry, Hagrid, and the bike soar upwards beyond the clouds, and Hagrid comes to and takes control of the bike. As Harry settles back into the sidecar, the engine fails, and they hurdle downwards. Molly Weasley hears them break through the protective shield around their house as they plummet towards the ground, making a bumpy landing in a reed bed. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation.",
    "9": "Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. A bus and a lorry approach as Hagrid rides upside down on the tunnel roof, with Harry hanging out of the sidecar, running over the bus, and dropping back in when the bike returns to the road. Hagrid slumps forward, hit by a bolt from a death eater, and Harry grabs the handlebars, forcing the motorbike up into the air. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. Hedwig flies towards them and attacks the chasing death eater, but as the owl swoops to attack again, she is hit by a bolt of green light and tumbles earthwards. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. The death eater pulls back, and Harry suddenly cries out in pain, his face contorting as another ominous, dark figure closes in. Harry slumps forward, his jagged scar illuminated by the bike's headlight. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. As they speed between two lines of electric pylons, Harry's wand lights of its own accord. The dark figure draws level, and the power flowing from Harry's wand connects with an equal force of pulsating energy. The swirling vortex of light travels up Voldemort's wand, illuminating his face, and an explosion rocks the bike. Harry presses the control button, and the bike zooms away, spewing out flames that propel Voldemort backwards as the electric pylons collapse. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. Harry, Hagrid, and the bike soar upwards beyond the clouds, and Hagrid comes to and takes control of the bike. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. As Harry settles back into the sidecar, the engine fails, and they hurdle downwards. Molly Weasley hears them break through the protective shield around their house as they plummet towards the ground, making a bumpy landing in a reed bed. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation.",
    "10": "Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. A bus and a lorry approach as Hagrid rides upside down on the tunnel roof, with Harry hanging out of the sidecar, running over the bus, and dropping back in when the bike returns to the road. Hagrid slumps forward, hit by a bolt from a death eater, and Harry grabs the handlebars, forcing the motorbike up into the air. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. Hedwig flies towards them and attacks the chasing death eater, but as the owl swoops to attack again, she is hit by a bolt of green light and tumbles earthwards. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. The death eater pulls back, and Harry suddenly cries out in pain, his face contorting as another ominous, dark figure closes in. Harry slumps forward, his jagged scar illuminated by the bike's headlight. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. As they speed between two lines of electric pylons, Harry's wand lights of its own accord. The dark figure draws level, and the power flowing from Harry's wand connects with an equal force of pulsating energy. The swirling vortex of light travels up Voldemort's wand, illuminating his face, and an explosion rocks the bike. Harry presses the control button, and the bike zooms away, spewing out flames that propel Voldemort backwards as the electric pylons collapse. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. Harry, Hagrid, and the bike soar upwards beyond the clouds, and Hagrid comes to and takes control of the bike. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. As Harry settles back into the sidecar, the engine fails, and they hurdle downwards. Molly Weasley hears them break through the protective shield around their house as they plummet towards the ground, making a bumpy landing in a reed bed. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon."
  }
}