{
  "ground_truth": "The Minister's eyes flit from Harry to Ron, then to Hermione. The wedding reception is in full swing. A soft light spills out of the marquis. A group of men keep guard outside as Lupin strolls past them. Harry stands in the covered walkway, the Snitch hovering beside him, which he grasps and puts in his jacket pocket before entering the marquis. Fleur and Bill are dancing together between two lines of guests, with butterflies fluttering around them. Harry smiles as glasses magically fill with Champagne. Standing beside the table is tall, dark-haired Madame Maxime, and Hagrid looks up at her admiringly. A man with long white blonde hair dances theatrically with Luna Lovegood, and Ron stares while Hermione appears looking delightful in a sleeveless red dress. Harry spots Elphias Doge and heads towards him. Luna's father wears a pendant with a triangle containing a circle with a vertical line through it. Harry sits with Elphias, and an old woman scowls, prompting Harry to look puzzled.",
  "iterations": {
    "1": "The Minister's eyes flit from Harry to Ron, then to Hermione. The wedding reception is in full swing. A soft light spills out of the marquis. A group of men keep guard outside as Lupin strolls past them. Harry stands in the covered walkway, the Snitch hovering beside him, which he grasps and puts in his jacket pocket before entering the marquis. Fleur and Bill are dancing together between two lines of guests, with butterflies fluttering around them. Harry smiles as glasses magically fill with Champagne. Standing beside the table is tall, dark-haired Madame Maxime, and Hagrid looks up at her admiringly. A man with long white blonde hair dances theatrically with Luna Lovegood, and Ron stares while Hermione appears looking delightful in a sleeveless red dress. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. Harry spots Elphias Doge and heads towards him. Luna's father wears a pendant with a triangle containing a circle with a vertical line through it. Harry sits with Elphias, and an old woman scowls, prompting Harry to look puzzled.",
    "2": "Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. The Minister's eyes flit from Harry to Ron, then to Hermione. The wedding reception is in full swing. A soft light spills out of the marquis. A group of men keep guard outside as Lupin strolls past them. Harry stands in the covered walkway, the Snitch hovering beside him, which he grasps and puts in his jacket pocket before entering the marquis. Fleur and Bill are dancing together between two lines of guests, with butterflies fluttering around them. Harry smiles as glasses magically fill with Champagne. Standing beside the table is tall, dark-haired Madame Maxime, and Hagrid looks up at her admiringly. A man with long white blonde hair dances theatrically with Luna Lovegood, and Ron stares while Hermione appears looking delightful in a sleeveless red dress. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. Harry spots Elphias Doge and heads towards him. Luna's father wears a pendant with a triangle containing a circle with a vertical line through it. Harry sits with Elphias, and an old woman scowls, prompting Harry to look puzzled.",
    "3": "Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. The Minister's eyes flit from Harry to Ron, then to Hermione. The wedding reception is in full swing. A soft light spills out of the marquis. A group of men keep guard outside as Lupin strolls past them. Harry stands in the covered walkway, the Snitch hovering beside him, which he grasps and puts in his jacket pocket before entering the marquis. Fleur and Bill are dancing together between two lines of guests, with butterflies fluttering around them. Harry smiles as glasses magically fill with Champagne. Standing beside the table is tall, dark-haired Madame Maxime, and Hagrid looks up at her admiringly. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. A man with long white blonde hair dances theatrically with Luna Lovegood, and Ron stares while Hermione appears looking delightful in a sleeveless red dress. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. Harry spots Elphias Doge and heads towards him. Luna's father wears a pendant with a triangle containing a circle with a vertical line through it. Harry sits with Elphias, and an old woman scowls, prompting Harry to look puzzled.",
    "4": "Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. The Minister's eyes flit from Harry to Ron, then to Hermione. The wedding reception is in full swing. A soft light spills out of the marquis. A group of men keep guard outside as Lupin strolls past them. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Harry stands in the covered walkway, the Snitch hovering beside him, which he grasps and puts in his jacket pocket before entering the marquis. Fleur and Bill are dancing together between two lines of guests, with butterflies fluttering around them. Harry smiles as glasses magically fill with Champagne. Standing beside the table is tall, dark-haired Madame Maxime, and Hagrid looks up at her admiringly. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. A man with long white blonde hair dances theatrically with Luna Lovegood, and Ron stares while Hermione appears looking delightful in a sleeveless red dress. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. Harry spots Elphias Doge and heads towards him. Luna's father wears a pendant with a triangle containing a circle with a vertical line through it. Harry sits with Elphias, and an old woman scowls, prompting Harry to look puzzled.",
    "5": "Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. The Minister's eyes flit from Harry to Ron, then to Hermione. The wedding reception is in full swing. A soft light spills out of the marquis. A group of men keep guard outside as Lupin strolls past them. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Harry stands in the covered walkway, the Snitch hovering beside him, which he grasps and puts in his jacket pocket before entering the marquis. Fleur and Bill are dancing together between two lines of guests, with butterflies fluttering around them. Harry smiles as glasses magically fill with Champagne. Standing beside the table is tall, dark-haired Madame Maxime, and Hagrid looks up at her admiringly. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. A man with long white blonde hair dances theatrically with Luna Lovegood, and Ron stares while Hermione appears looking delightful in a sleeveless red dress. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. Harry spots Elphias Doge and heads towards him. Luna's father wears a pendant with a triangle containing a circle with a vertical line through it. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. Harry sits with Elphias, and an old woman scowls, prompting Harry to look puzzled.",
    "6": "Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. The Minister's eyes flit from Harry to Ron, then to Hermione. The wedding reception is in full swing. A soft light spills out of the marquis. A group of men keep guard outside as Lupin strolls past them. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Harry stands in the covered walkway, the Snitch hovering beside him, which he grasps and puts in his jacket pocket before entering the marquis. Fleur and Bill are dancing together between two lines of guests, with butterflies fluttering around them. Harry smiles as glasses magically fill with Champagne. Standing beside the table is tall, dark-haired Madame Maxime, and Hagrid looks up at her admiringly. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. A man with long white blonde hair dances theatrically with Luna Lovegood, and Ron stares while Hermione appears looking delightful in a sleeveless red dress. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. Harry spots Elphias Doge and heads towards him. Luna's father wears a pendant with a triangle containing a circle with a vertical line through it. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. Harry sits with Elphias, and an old woman scowls, prompting Harry to look puzzled.",
    "7": "Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. The Minister's eyes flit from Harry to Ron, then to Hermione. The wedding reception is in full swing. A soft light spills out of the marquis. A group of men keep guard outside as Lupin strolls past them. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Harry stands in the covered walkway, the Snitch hovering beside him, which he grasps and puts in his jacket pocket before entering the marquis. Fleur and Bill are dancing together between two lines of guests, with butterflies fluttering around them. Harry smiles as glasses magically fill with Champagne. Standing beside the table is tall, dark-haired Madame Maxime, and Hagrid looks up at her admiringly. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. A man with long white blonde hair dances theatrically with Luna Lovegood, and Ron stares while Hermione appears looking delightful in a sleeveless red dress. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. Harry spots Elphias Doge and heads towards him. Luna's father wears a pendant with a triangle containing a circle with a vertical line through it. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. Harry sits with Elphias, and an old woman scowls, prompting Harry to look puzzled.",
    "8": "Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. The Minister's eyes flit from Harry to Ron, then to Hermione. The wedding reception is in full swing. A soft light spills out of the marquis. A group of men keep guard outside as Lupin strolls past them. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Harry stands in the covered walkway, the Snitch hovering beside him, which he grasps and puts in his jacket pocket before entering the marquis. Fleur and Bill are dancing together between two lines of guests, with butterflies fluttering around them. Harry smiles as glasses magically fill with Champagne. Standing beside the table is tall, dark-haired Madame Maxime, and Hagrid looks up at her admiringly. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. A man with long white blonde hair dances theatrically with Luna Lovegood, and Ron stares while Hermione appears looking delightful in a sleeveless red dress. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. Harry spots Elphias Doge and heads towards him. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Luna's father wears a pendant with a triangle containing a circle with a vertical line through it. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. Harry sits with Elphias, and an old woman scowls, prompting Harry to look puzzled.",
    "9": "Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. The Minister's eyes flit from Harry to Ron, then to Hermione. The wedding reception is in full swing. A soft light spills out of the marquis. A group of men keep guard outside as Lupin strolls past them. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Harry stands in the covered walkway, the Snitch hovering beside him, which he grasps and puts in his jacket pocket before entering the marquis. Fleur and Bill are dancing together between two lines of guests, with butterflies fluttering around them. Harry smiles as glasses magically fill with Champagne. Standing beside the table is tall, dark-haired Madame Maxime, and Hagrid looks up at her admiringly. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. A man with long white blonde hair dances theatrically with Luna Lovegood, and Ron stares while Hermione appears looking delightful in a sleeveless red dress. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. Harry spots Elphias Doge and heads towards him. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Luna's father wears a pendant with a triangle containing a circle with a vertical line through it. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. Harry sits with Elphias, and an old woman scowls, prompting Harry to look puzzled.",
    "10": "Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. The Minister's eyes flit from Harry to Ron, then to Hermione. The wedding reception is in full swing. A soft light spills out of the marquis. A group of men keep guard outside as Lupin strolls past them. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Harry stands in the covered walkway, the Snitch hovering beside him, which he grasps and puts in his jacket pocket before entering the marquis. Fleur and Bill are dancing together between two lines of guests, with butterflies fluttering around them. Harry smiles as glasses magically fill with Champagne. Standing beside the table is tall, dark-haired Madame Maxime, and Hagrid looks up at her admiringly. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. A man with long white blonde hair dances theatrically with Luna Lovegood, and Ron stares while Hermione appears looking delightful in a sleeveless red dress. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. Harry spots Elphias Doge and heads towards him. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Luna's father wears a pendant with a triangle containing a circle with a vertical line through it. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. Harry sits with Elphias, and an old woman scowls, prompting Harry to look puzzled."
  }
}