{
  "ground_truth": "Harry dives into a fireplace and is whisked up, followed by Hermione and Ron with Yaxley close on their heels; Yaxley grabs them on their journey upwards, causing their faces to contort, but he loses his grip. Sunlight filters down through a leafy canopy, and still in Albert's clothes, Harry wakes lying on a carpet of dead leaves in a forest. Glancing to his right, he sees the locket, and after slipping off Albert's coat, he scrambles over to the locket and picks it up. Hermione is on her knees by a shivering Ron, while Harry searches desperately in the bag, points his wand, and a bottle pops into his hand. She treats the gaping wound on Ron's left shoulder with a few drops of the essence, sealing the wound as her bloodied hands reveal her relief. Hermione gets to her feet and walks away, and Harry takes her place at Ron's side. Hermione braces herself and lifts her wand as Harry looks at her bag. A dim light glimmers inside a small tent when Harry aims his wand at the locket and smoke rises from it. All three walk towards it, Ron with his left arm in a sling, while the locket lies unscathed amongst the dead leaves. Hermione tries, the locket is engulfed in flames, but it remains unmarked and is thrown across the clearing. Looking weary and ill, Ron gazes down at it as it flies even further away. Harry stares angrily at the shining metal as the flames die out, but the locket remains firmly closed.",
  "iterations": {
    "1": "Harry dives into a fireplace and is whisked up, followed by Hermione and Ron with Yaxley close on their heels; Yaxley grabs them on their journey upwards, causing their faces to contort, but he loses his grip. Sunlight filters down through a leafy canopy, and still in Albert's clothes, Harry wakes lying on a carpet of dead leaves in a forest. Glancing to his right, he sees the locket, and after slipping off Albert's coat, he scrambles over to the locket and picks it up. Hermione is on her knees by a shivering Ron, while Harry searches desperately in the bag, points his wand, and a bottle pops into his hand. She treats the gaping wound on Ron's left shoulder with a few drops of the essence, sealing the wound as her bloodied hands reveal her relief. Hermione gets to her feet and walks away, and Harry takes her place at Ron's side. Hermione braces herself and lifts her wand as Harry looks at her bag. A dim light glimmers inside a small tent when Harry aims his wand at the locket and smoke rises from it. All three walk towards it, Ron with his left arm in a sling, while the locket lies unscathed amongst the dead leaves. Hermione tries, the locket is engulfed in flames, but it remains unmarked and is thrown across the clearing. Looking weary and ill, Ron gazes down at it as it flies even further away. Harry stares angrily at the shining metal as the flames die out, but the locket remains firmly closed. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon.",
    "2": "Harry dives into a fireplace and is whisked up, followed by Hermione and Ron with Yaxley close on their heels; Yaxley grabs them on their journey upwards, causing their faces to contort, but he loses his grip. Sunlight filters down through a leafy canopy, and still in Albert's clothes, Harry wakes lying on a carpet of dead leaves in a forest. Glancing to his right, he sees the locket, and after slipping off Albert's coat, he scrambles over to the locket and picks it up. Hermione is on her knees by a shivering Ron, while Harry searches desperately in the bag, points his wand, and a bottle pops into his hand. She treats the gaping wound on Ron's left shoulder with a few drops of the essence, sealing the wound as her bloodied hands reveal her relief. Hermione gets to her feet and walks away, and Harry takes her place at Ron's side. Hermione braces herself and lifts her wand as Harry looks at her bag. A dim light glimmers inside a small tent when Harry aims his wand at the locket and smoke rises from it. All three walk towards it, Ron with his left arm in a sling, while the locket lies unscathed amongst the dead leaves. Hermione tries, the locket is engulfed in flames, but it remains unmarked and is thrown across the clearing. Looking weary and ill, Ron gazes down at it as it flies even further away. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Harry stares angrily at the shining metal as the flames die out, but the locket remains firmly closed. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon.",
    "3": "Harry dives into a fireplace and is whisked up, followed by Hermione and Ron with Yaxley close on their heels; Yaxley grabs them on their journey upwards, causing their faces to contort, but he loses his grip. Sunlight filters down through a leafy canopy, and still in Albert's clothes, Harry wakes lying on a carpet of dead leaves in a forest. Glancing to his right, he sees the locket, and after slipping off Albert's coat, he scrambles over to the locket and picks it up. Hermione is on her knees by a shivering Ron, while Harry searches desperately in the bag, points his wand, and a bottle pops into his hand. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. She treats the gaping wound on Ron's left shoulder with a few drops of the essence, sealing the wound as her bloodied hands reveal her relief. Hermione gets to her feet and walks away, and Harry takes her place at Ron's side. Hermione braces herself and lifts her wand as Harry looks at her bag. A dim light glimmers inside a small tent when Harry aims his wand at the locket and smoke rises from it. All three walk towards it, Ron with his left arm in a sling, while the locket lies unscathed amongst the dead leaves. Hermione tries, the locket is engulfed in flames, but it remains unmarked and is thrown across the clearing. Looking weary and ill, Ron gazes down at it as it flies even further away. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Harry stares angrily at the shining metal as the flames die out, but the locket remains firmly closed. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon.",
    "4": "Harry dives into a fireplace and is whisked up, followed by Hermione and Ron with Yaxley close on their heels; Yaxley grabs them on their journey upwards, causing their faces to contort, but he loses his grip. Sunlight filters down through a leafy canopy, and still in Albert's clothes, Harry wakes lying on a carpet of dead leaves in a forest. Glancing to his right, he sees the locket, and after slipping off Albert's coat, he scrambles over to the locket and picks it up. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Hermione is on her knees by a shivering Ron, while Harry searches desperately in the bag, points his wand, and a bottle pops into his hand. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. She treats the gaping wound on Ron's left shoulder with a few drops of the essence, sealing the wound as her bloodied hands reveal her relief. Hermione gets to her feet and walks away, and Harry takes her place at Ron's side. Hermione braces herself and lifts her wand as Harry looks at her bag. A dim light glimmers inside a small tent when Harry aims his wand at the locket and smoke rises from it. All three walk towards it, Ron with his left arm in a sling, while the locket lies unscathed amongst the dead leaves. Hermione tries, the locket is engulfed in flames, but it remains unmarked and is thrown across the clearing. Looking weary and ill, Ron gazes down at it as it flies even further away. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Harry stares angrily at the shining metal as the flames die out, but the locket remains firmly closed. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon.",
    "5": "Harry dives into a fireplace and is whisked up, followed by Hermione and Ron with Yaxley close on their heels; Yaxley grabs them on their journey upwards, causing their faces to contort, but he loses his grip. Sunlight filters down through a leafy canopy, and still in Albert's clothes, Harry wakes lying on a carpet of dead leaves in a forest. Glancing to his right, he sees the locket, and after slipping off Albert's coat, he scrambles over to the locket and picks it up. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Hermione is on her knees by a shivering Ron, while Harry searches desperately in the bag, points his wand, and a bottle pops into his hand. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. She treats the gaping wound on Ron's left shoulder with a few drops of the essence, sealing the wound as her bloodied hands reveal her relief. Hermione gets to her feet and walks away, and Harry takes her place at Ron's side. Hermione braces herself and lifts her wand as Harry looks at her bag. A dim light glimmers inside a small tent when Harry aims his wand at the locket and smoke rises from it. All three walk towards it, Ron with his left arm in a sling, while the locket lies unscathed amongst the dead leaves. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Hermione tries, the locket is engulfed in flames, but it remains unmarked and is thrown across the clearing. Looking weary and ill, Ron gazes down at it as it flies even further away. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Harry stares angrily at the shining metal as the flames die out, but the locket remains firmly closed. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon.",
    "6": "Harry dives into a fireplace and is whisked up, followed by Hermione and Ron with Yaxley close on their heels; Yaxley grabs them on their journey upwards, causing their faces to contort, but he loses his grip. Sunlight filters down through a leafy canopy, and still in Albert's clothes, Harry wakes lying on a carpet of dead leaves in a forest. Glancing to his right, he sees the locket, and after slipping off Albert's coat, he scrambles over to the locket and picks it up. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Hermione is on her knees by a shivering Ron, while Harry searches desperately in the bag, points his wand, and a bottle pops into his hand. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. She treats the gaping wound on Ron's left shoulder with a few drops of the essence, sealing the wound as her bloodied hands reveal her relief. Hermione gets to her feet and walks away, and Harry takes her place at Ron's side. Hermione braces herself and lifts her wand as Harry looks at her bag. A dim light glimmers inside a small tent when Harry aims his wand at the locket and smoke rises from it. All three walk towards it, Ron with his left arm in a sling, while the locket lies unscathed amongst the dead leaves. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Hermione tries, the locket is engulfed in flames, but it remains unmarked and is thrown across the clearing. Looking weary and ill, Ron gazes down at it as it flies even further away. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Harry stares angrily at the shining metal as the flames die out, but the locket remains firmly closed. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon.",
    "7": "Harry dives into a fireplace and is whisked up, followed by Hermione and Ron with Yaxley close on their heels; Yaxley grabs them on their journey upwards, causing their faces to contort, but he loses his grip. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. Sunlight filters down through a leafy canopy, and still in Albert's clothes, Harry wakes lying on a carpet of dead leaves in a forest. Glancing to his right, he sees the locket, and after slipping off Albert's coat, he scrambles over to the locket and picks it up. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Hermione is on her knees by a shivering Ron, while Harry searches desperately in the bag, points his wand, and a bottle pops into his hand. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. She treats the gaping wound on Ron's left shoulder with a few drops of the essence, sealing the wound as her bloodied hands reveal her relief. Hermione gets to her feet and walks away, and Harry takes her place at Ron's side. Hermione braces herself and lifts her wand as Harry looks at her bag. A dim light glimmers inside a small tent when Harry aims his wand at the locket and smoke rises from it. All three walk towards it, Ron with his left arm in a sling, while the locket lies unscathed amongst the dead leaves. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Hermione tries, the locket is engulfed in flames, but it remains unmarked and is thrown across the clearing. Looking weary and ill, Ron gazes down at it as it flies even further away. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Harry stares angrily at the shining metal as the flames die out, but the locket remains firmly closed. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon.",
    "8": "Harry dives into a fireplace and is whisked up, followed by Hermione and Ron with Yaxley close on their heels; Yaxley grabs them on their journey upwards, causing their faces to contort, but he loses his grip. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. Sunlight filters down through a leafy canopy, and still in Albert's clothes, Harry wakes lying on a carpet of dead leaves in a forest. Glancing to his right, he sees the locket, and after slipping off Albert's coat, he scrambles over to the locket and picks it up. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Hermione is on her knees by a shivering Ron, while Harry searches desperately in the bag, points his wand, and a bottle pops into his hand. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. She treats the gaping wound on Ron's left shoulder with a few drops of the essence, sealing the wound as her bloodied hands reveal her relief. Hermione gets to her feet and walks away, and Harry takes her place at Ron's side. Hermione braces herself and lifts her wand as Harry looks at her bag. A dim light glimmers inside a small tent when Harry aims his wand at the locket and smoke rises from it. All three walk towards it, Ron with his left arm in a sling, while the locket lies unscathed amongst the dead leaves. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Hermione tries, the locket is engulfed in flames, but it remains unmarked and is thrown across the clearing. Looking weary and ill, Ron gazes down at it as it flies even further away. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Harry stares angrily at the shining metal as the flames die out, but the locket remains firmly closed. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon.",
    "9": "Harry dives into a fireplace and is whisked up, followed by Hermione and Ron with Yaxley close on their heels; Yaxley grabs them on their journey upwards, causing their faces to contort, but he loses his grip. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. Sunlight filters down through a leafy canopy, and still in Albert's clothes, Harry wakes lying on a carpet of dead leaves in a forest. Glancing to his right, he sees the locket, and after slipping off Albert's coat, he scrambles over to the locket and picks it up. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Hermione is on her knees by a shivering Ron, while Harry searches desperately in the bag, points his wand, and a bottle pops into his hand. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. She treats the gaping wound on Ron's left shoulder with a few drops of the essence, sealing the wound as her bloodied hands reveal her relief. Hermione gets to her feet and walks away, and Harry takes her place at Ron's side. Hermione braces herself and lifts her wand as Harry looks at her bag. A dim light glimmers inside a small tent when Harry aims his wand at the locket and smoke rises from it. All three walk towards it, Ron with his left arm in a sling, while the locket lies unscathed amongst the dead leaves. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Hermione tries, the locket is engulfed in flames, but it remains unmarked and is thrown across the clearing. Looking weary and ill, Ron gazes down at it as it flies even further away. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Harry stares angrily at the shining metal as the flames die out, but the locket remains firmly closed. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon.",
    "10": "Harry dives into a fireplace and is whisked up, followed by Hermione and Ron with Yaxley close on their heels; Yaxley grabs them on their journey upwards, causing their faces to contort, but he loses his grip. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. Sunlight filters down through a leafy canopy, and still in Albert's clothes, Harry wakes lying on a carpet of dead leaves in a forest. Glancing to his right, he sees the locket, and after slipping off Albert's coat, he scrambles over to the locket and picks it up. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Hermione is on her knees by a shivering Ron, while Harry searches desperately in the bag, points his wand, and a bottle pops into his hand. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. She treats the gaping wound on Ron's left shoulder with a few drops of the essence, sealing the wound as her bloodied hands reveal her relief. Hermione gets to her feet and walks away, and Harry takes her place at Ron's side. Hermione braces herself and lifts her wand as Harry looks at her bag. A dim light glimmers inside a small tent when Harry aims his wand at the locket and smoke rises from it. All three walk towards it, Ron with his left arm in a sling, while the locket lies unscathed amongst the dead leaves. In the eerie silence of a post-apocalyptic wasteland, a hardened survivor scavenges through abandoned ruins, haunted by the echoes of a once-thriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Hermione tries, the locket is engulfed in flames, but it remains unmarked and is thrown across the clearing. Looking weary and ill, Ron gazes down at it as it flies even further away. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Harry stares angrily at the shining metal as the flames die out, but the locket remains firmly closed. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon."
  }
}