{
  "ground_truth": "A metallic shield with the letters WB moves slowly forward out of darkness. A heap of skulls and bones is piled high behind iron railings. From the grinning mouth of a skull emerges the head of a large snake. Flickering its tongue, it slithers down onto a narrow path and moves silently between the gravestones in a dark and overgrown cemetery. The reptile's lithe body shimmers as it glides swiftly along the uneven path. The snake slides past a stone statue of a skeleton with huge wings, draped in a hooded cloak and holding a scythe. Metallic silver letters appear in the dark, glowering sky. A huge dilapidated house stands silhouetted against the night sky. A light is switched on in a cottage nearby. A disheveled old man lights the gas and puts on a kettle. He takes the top off a teapot, and picks up a tea bag. Through the kitchen window, he notices a light in the big house.",
  "iterations": {
    "1": "A metallic shield with the letters WB moves slowly forward out of darkness. A heap of skulls and bones is piled high behind iron railings. From the grinning mouth of a skull emerges the head of a large snake. Flickering its tongue, it slithers down onto a narrow path and moves silently between the gravestones in a dark and overgrown cemetery. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. The reptile's lithe body shimmers as it glides swiftly along the uneven path. The snake slides past a stone statue of a skeleton with huge wings, draped in a hooded cloak and holding a scythe. Metallic silver letters appear in the dark, glowering sky. A huge dilapidated house stands silhouetted against the night sky. A light is switched on in a cottage nearby. A disheveled old man lights the gas and puts on a kettle. He takes the top off a teapot, and picks up a tea bag. Through the kitchen window, he notices a light in the big house.",
    "2": "Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. A metallic shield with the letters WB moves slowly forward out of darkness. A heap of skulls and bones is piled high behind iron railings. From the grinning mouth of a skull emerges the head of a large snake. Flickering its tongue, it slithers down onto a narrow path and moves silently between the gravestones in a dark and overgrown cemetery. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. The reptile's lithe body shimmers as it glides swiftly along the uneven path. The snake slides past a stone statue of a skeleton with huge wings, draped in a hooded cloak and holding a scythe. Metallic silver letters appear in the dark, glowering sky. A huge dilapidated house stands silhouetted against the night sky. A light is switched on in a cottage nearby. A disheveled old man lights the gas and puts on a kettle. He takes the top off a teapot, and picks up a tea bag. Through the kitchen window, he notices a light in the big house.",
    "3": "Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. A metallic shield with the letters WB moves slowly forward out of darkness. A heap of skulls and bones is piled high behind iron railings. From the grinning mouth of a skull emerges the head of a large snake. Flickering its tongue, it slithers down onto a narrow path and moves silently between the gravestones in a dark and overgrown cemetery. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. The reptile's lithe body shimmers as it glides swiftly along the uneven path. The snake slides past a stone statue of a skeleton with huge wings, draped in a hooded cloak and holding a scythe. Metallic silver letters appear in the dark, glowering sky. A huge dilapidated house stands silhouetted against the night sky. A light is switched on in a cottage nearby. A disheveled old man lights the gas and puts on a kettle. He takes the top off a teapot, and picks up a tea bag. Through the kitchen window, he notices a light in the big house. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage.",
    "4": "Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. A metallic shield with the letters WB moves slowly forward out of darkness. A heap of skulls and bones is piled high behind iron railings. From the grinning mouth of a skull emerges the head of a large snake. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. Flickering its tongue, it slithers down onto a narrow path and moves silently between the gravestones in a dark and overgrown cemetery. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. The reptile's lithe body shimmers as it glides swiftly along the uneven path. The snake slides past a stone statue of a skeleton with huge wings, draped in a hooded cloak and holding a scythe. Metallic silver letters appear in the dark, glowering sky. A huge dilapidated house stands silhouetted against the night sky. A light is switched on in a cottage nearby. A disheveled old man lights the gas and puts on a kettle. He takes the top off a teapot, and picks up a tea bag. Through the kitchen window, he notices a light in the big house. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage.",
    "5": "Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. A metallic shield with the letters WB moves slowly forward out of darkness. A heap of skulls and bones is piled high behind iron railings. From the grinning mouth of a skull emerges the head of a large snake. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. Flickering its tongue, it slithers down onto a narrow path and moves silently between the gravestones in a dark and overgrown cemetery. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. The reptile's lithe body shimmers as it glides swiftly along the uneven path. The snake slides past a stone statue of a skeleton with huge wings, draped in a hooded cloak and holding a scythe. Metallic silver letters appear in the dark, glowering sky. A huge dilapidated house stands silhouetted against the night sky. A light is switched on in a cottage nearby. A disheveled old man lights the gas and puts on a kettle. He takes the top off a teapot, and picks up a tea bag. Through the kitchen window, he notices a light in the big house. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels.",
    "6": "Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. A metallic shield with the letters WB moves slowly forward out of darkness. A heap of skulls and bones is piled high behind iron railings. From the grinning mouth of a skull emerges the head of a large snake. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. Flickering its tongue, it slithers down onto a narrow path and moves silently between the gravestones in a dark and overgrown cemetery. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. The reptile's lithe body shimmers as it glides swiftly along the uneven path. The snake slides past a stone statue of a skeleton with huge wings, draped in a hooded cloak and holding a scythe. Metallic silver letters appear in the dark, glowering sky. A huge dilapidated house stands silhouetted against the night sky. A light is switched on in a cottage nearby. A disheveled old man lights the gas and puts on a kettle. He takes the top off a teapot, and picks up a tea bag. Through the kitchen window, he notices a light in the big house. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels.",
    "7": "Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. A metallic shield with the letters WB moves slowly forward out of darkness. A heap of skulls and bones is piled high behind iron railings. From the grinning mouth of a skull emerges the head of a large snake. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. Flickering its tongue, it slithers down onto a narrow path and moves silently between the gravestones in a dark and overgrown cemetery. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. The reptile's lithe body shimmers as it glides swiftly along the uneven path. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. The snake slides past a stone statue of a skeleton with huge wings, draped in a hooded cloak and holding a scythe. Metallic silver letters appear in the dark, glowering sky. A huge dilapidated house stands silhouetted against the night sky. A light is switched on in a cottage nearby. A disheveled old man lights the gas and puts on a kettle. He takes the top off a teapot, and picks up a tea bag. Through the kitchen window, he notices a light in the big house. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels.",
    "8": "Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. A metallic shield with the letters WB moves slowly forward out of darkness. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. A heap of skulls and bones is piled high behind iron railings. From the grinning mouth of a skull emerges the head of a large snake. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. Flickering its tongue, it slithers down onto a narrow path and moves silently between the gravestones in a dark and overgrown cemetery. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. The reptile's lithe body shimmers as it glides swiftly along the uneven path. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. The snake slides past a stone statue of a skeleton with huge wings, draped in a hooded cloak and holding a scythe. Metallic silver letters appear in the dark, glowering sky. A huge dilapidated house stands silhouetted against the night sky. A light is switched on in a cottage nearby. A disheveled old man lights the gas and puts on a kettle. He takes the top off a teapot, and picks up a tea bag. Through the kitchen window, he notices a light in the big house. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels.",
    "9": "Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. A metallic shield with the letters WB moves slowly forward out of darkness. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. A heap of skulls and bones is piled high behind iron railings. From the grinning mouth of a skull emerges the head of a large snake. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. Flickering its tongue, it slithers down onto a narrow path and moves silently between the gravestones in a dark and overgrown cemetery. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. The reptile's lithe body shimmers as it glides swiftly along the uneven path. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. The snake slides past a stone statue of a skeleton with huge wings, draped in a hooded cloak and holding a scythe. Metallic silver letters appear in the dark, glowering sky. A huge dilapidated house stands silhouetted against the night sky. A light is switched on in a cottage nearby. A disheveled old man lights the gas and puts on a kettle. He takes the top off a teapot, and picks up a tea bag. Through the kitchen window, he notices a light in the big house. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels.",
    "10": "Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. A metallic shield with the letters WB moves slowly forward out of darkness. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. A heap of skulls and bones is piled high behind iron railings. From the grinning mouth of a skull emerges the head of a large snake. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. Flickering its tongue, it slithers down onto a narrow path and moves silently between the gravestones in a dark and overgrown cemetery. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. Amid the vibrant chaos of a South American carnival, a fearless dancer twirls through streets bursting with color and rhythm, each graceful move challenging the rigid boundaries of tradition. The reptile's lithe body shimmers as it glides swiftly along the uneven path. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. The snake slides past a stone statue of a skeleton with huge wings, draped in a hooded cloak and holding a scythe. Metallic silver letters appear in the dark, glowering sky. A huge dilapidated house stands silhouetted against the night sky. A light is switched on in a cottage nearby. A disheveled old man lights the gas and puts on a kettle. He takes the top off a teapot, and picks up a tea bag. Through the kitchen window, he notices a light in the big house. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. In the quiet confines of a suburban attic, an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels."
  }
}