{
  "ground_truth": "They rush up to her desk and slowly turn and leave. Outside in the corridor, he stares hard at Harry as Snape stalks away along the corridor, his black cloak billowing behind him. The school is silhouetted against moonlit clouds. Harry, Ron, and Hermione creep downstairs into the common room, where they spot Neville's toad. Neville gets up from a chair, freezes, and falls over backwards. Leaving Neville, they all huddle under the invisibility cloak as Hermione unlocks the door on the third floor. A harp is playing by itself, and they take off the cloak to see the three-headed dog is asleep. They take hold of it and between them, they push the dog's huge paw off the trapdoor. The dog breathes out, and they stagger back, lifting the wooden cover to stare down into the black hole beneath. Dog dribble hits Ron as the dog opens its three mouths. They throw themselves into the hole as the dog destroys the trapdoor. They have landed on something soft, but the plant begins to move, slithering tentacles snake over them, twisting around their arms and legs, and twining around their necks.",
  "iterations": {
    "1": "They rush up to her desk and slowly turn and leave. Outside in the corridor, he stares hard at Harry as Snape stalks away along the corridor, his black cloak billowing behind him. The school is silhouetted against moonlit clouds. Harry, Ron, and Hermione creep downstairs into the common room, where they spot Neville's toad. Neville gets up from a chair, freezes, and falls over backwards. Leaving Neville, they all huddle under the invisibility cloak as Hermione unlocks the door on the third floor. A harp is playing by itself, and they take off the cloak to see the three-headed dog is asleep. They take hold of it and between them, they push the dog's huge paw off the trapdoor. The dog breathes out, and they stagger back, lifting the wooden cover to stare down into the black hole beneath. Dog dribble hits Ron as the dog opens its three mouths. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. They throw themselves into the hole as the dog destroys the trapdoor. They have landed on something soft, but the plant begins to move, slithering tentacles snake over them, twisting around their arms and legs, and twining around their necks.",
    "2": "In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. They rush up to her desk and slowly turn and leave. Outside in the corridor, he stares hard at Harry as Snape stalks away along the corridor, his black cloak billowing behind him. The school is silhouetted against moonlit clouds. Harry, Ron, and Hermione creep downstairs into the common room, where they spot Neville's toad. Neville gets up from a chair, freezes, and falls over backwards. Leaving Neville, they all huddle under the invisibility cloak as Hermione unlocks the door on the third floor. A harp is playing by itself, and they take off the cloak to see the three-headed dog is asleep. They take hold of it and between them, they push the dog's huge paw off the trapdoor. The dog breathes out, and they stagger back, lifting the wooden cover to stare down into the black hole beneath. Dog dribble hits Ron as the dog opens its three mouths. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. They throw themselves into the hole as the dog destroys the trapdoor. They have landed on something soft, but the plant begins to move, slithering tentacles snake over them, twisting around their arms and legs, and twining around their necks.",
    "3": "In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. They rush up to her desk and slowly turn and leave. Outside in the corridor, he stares hard at Harry as Snape stalks away along the corridor, his black cloak billowing behind him. The school is silhouetted against moonlit clouds. Harry, Ron, and Hermione creep downstairs into the common room, where they spot Neville's toad. Neville gets up from a chair, freezes, and falls over backwards. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Leaving Neville, they all huddle under the invisibility cloak as Hermione unlocks the door on the third floor. A harp is playing by itself, and they take off the cloak to see the three-headed dog is asleep. They take hold of it and between them, they push the dog's huge paw off the trapdoor. The dog breathes out, and they stagger back, lifting the wooden cover to stare down into the black hole beneath. Dog dribble hits Ron as the dog opens its three mouths. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. They throw themselves into the hole as the dog destroys the trapdoor. They have landed on something soft, but the plant begins to move, slithering tentacles snake over them, twisting around their arms and legs, and twining around their necks.",
    "4": "In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. They rush up to her desk and slowly turn and leave. Outside in the corridor, he stares hard at Harry as Snape stalks away along the corridor, his black cloak billowing behind him. The school is silhouetted against moonlit clouds. Harry, Ron, and Hermione creep downstairs into the common room, where they spot Neville's toad. Neville gets up from a chair, freezes, and falls over backwards. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Leaving Neville, they all huddle under the invisibility cloak as Hermione unlocks the door on the third floor. A harp is playing by itself, and they take off the cloak to see the three-headed dog is asleep. They take hold of it and between them, they push the dog's huge paw off the trapdoor. The dog breathes out, and they stagger back, lifting the wooden cover to stare down into the black hole beneath. Dog dribble hits Ron as the dog opens its three mouths. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. They throw themselves into the hole as the dog destroys the trapdoor. They have landed on something soft, but the plant begins to move, slithering tentacles snake over them, twisting around their arms and legs, and twining around their necks.",
    "5": "In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. They rush up to her desk and slowly turn and leave. Outside in the corridor, he stares hard at Harry as Snape stalks away along the corridor, his black cloak billowing behind him. The school is silhouetted against moonlit clouds. Harry, Ron, and Hermione creep downstairs into the common room, where they spot Neville's toad. Neville gets up from a chair, freezes, and falls over backwards. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Leaving Neville, they all huddle under the invisibility cloak as Hermione unlocks the door on the third floor. A harp is playing by itself, and they take off the cloak to see the three-headed dog is asleep. They take hold of it and between them, they push the dog's huge paw off the trapdoor. The dog breathes out, and they stagger back, lifting the wooden cover to stare down into the black hole beneath. Dog dribble hits Ron as the dog opens its three mouths. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. They throw themselves into the hole as the dog destroys the trapdoor. They have landed on something soft, but the plant begins to move, slithering tentacles snake over them, twisting around their arms and legs, and twining around their necks.",
    "6": "In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. They rush up to her desk and slowly turn and leave. Outside in the corridor, he stares hard at Harry as Snape stalks away along the corridor, his black cloak billowing behind him. The school is silhouetted against moonlit clouds. Harry, Ron, and Hermione creep downstairs into the common room, where they spot Neville's toad. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Neville gets up from a chair, freezes, and falls over backwards. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Leaving Neville, they all huddle under the invisibility cloak as Hermione unlocks the door on the third floor. A harp is playing by itself, and they take off the cloak to see the three-headed dog is asleep. They take hold of it and between them, they push the dog's huge paw off the trapdoor. The dog breathes out, and they stagger back, lifting the wooden cover to stare down into the black hole beneath. Dog dribble hits Ron as the dog opens its three mouths. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. They throw themselves into the hole as the dog destroys the trapdoor. They have landed on something soft, but the plant begins to move, slithering tentacles snake over them, twisting around their arms and legs, and twining around their necks.",
    "7": "In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. They rush up to her desk and slowly turn and leave. Outside in the corridor, he stares hard at Harry as Snape stalks away along the corridor, his black cloak billowing behind him. The school is silhouetted against moonlit clouds. Harry, Ron, and Hermione creep downstairs into the common room, where they spot Neville's toad. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Neville gets up from a chair, freezes, and falls over backwards. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Leaving Neville, they all huddle under the invisibility cloak as Hermione unlocks the door on the third floor. A harp is playing by itself, and they take off the cloak to see the three-headed dog is asleep. They take hold of it and between them, they push the dog's huge paw off the trapdoor. The dog breathes out, and they stagger back, lifting the wooden cover to stare down into the black hole beneath. Dog dribble hits Ron as the dog opens its three mouths. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. They throw themselves into the hole as the dog destroys the trapdoor. They have landed on something soft, but the plant begins to move, slithering tentacles snake over them, twisting around their arms and legs, and twining around their necks.",
    "8": "In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. They rush up to her desk and slowly turn and leave. Outside in the corridor, he stares hard at Harry as Snape stalks away along the corridor, his black cloak billowing behind him. The school is silhouetted against moonlit clouds. Harry, Ron, and Hermione creep downstairs into the common room, where they spot Neville's toad. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. Neville gets up from a chair, freezes, and falls over backwards. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Leaving Neville, they all huddle under the invisibility cloak as Hermione unlocks the door on the third floor. A harp is playing by itself, and they take off the cloak to see the three-headed dog is asleep. They take hold of it and between them, they push the dog's huge paw off the trapdoor. The dog breathes out, and they stagger back, lifting the wooden cover to stare down into the black hole beneath. Dog dribble hits Ron as the dog opens its three mouths. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. They throw themselves into the hole as the dog destroys the trapdoor. They have landed on something soft, but the plant begins to move, slithering tentacles snake over them, twisting around their arms and legs, and twining around their necks.",
    "9": "In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. They rush up to her desk and slowly turn and leave. Outside in the corridor, he stares hard at Harry as Snape stalks away along the corridor, his black cloak billowing behind him. The school is silhouetted against moonlit clouds. Harry, Ron, and Hermione creep downstairs into the common room, where they spot Neville's toad. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. Neville gets up from a chair, freezes, and falls over backwards. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Leaving Neville, they all huddle under the invisibility cloak as Hermione unlocks the door on the third floor. A harp is playing by itself, and they take off the cloak to see the three-headed dog is asleep. They take hold of it and between them, they push the dog's huge paw off the trapdoor. The dog breathes out, and they stagger back, lifting the wooden cover to stare down into the black hole beneath. Dog dribble hits Ron as the dog opens its three mouths. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. They throw themselves into the hole as the dog destroys the trapdoor. They have landed on something soft, but the plant begins to move, slithering tentacles snake over them, twisting around their arms and legs, and twining around their necks.",
    "10": "In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. They rush up to her desk and slowly turn and leave. Outside in the corridor, he stares hard at Harry as Snape stalks away along the corridor, his black cloak billowing behind him. The school is silhouetted against moonlit clouds. Harry, Ron, and Hermione creep downstairs into the common room, where they spot Neville's toad. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. Neville gets up from a chair, freezes, and falls over backwards. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Leaving Neville, they all huddle under the invisibility cloak as Hermione unlocks the door on the third floor. A harp is playing by itself, and they take off the cloak to see the three-headed dog is asleep. They take hold of it and between them, they push the dog's huge paw off the trapdoor. The dog breathes out, and they stagger back, lifting the wooden cover to stare down into the black hole beneath. Dog dribble hits Ron as the dog opens its three mouths. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. They throw themselves into the hole as the dog destroys the trapdoor. They have landed on something soft, but the plant begins to move, slithering tentacles snake over them, twisting around their arms and legs, and twining around their necks."
  }
}