{
  "ground_truth": "Visitors scatter in all directions as the huge snake slithers along the floor and escapes to freedom out of the door of the Reptile House. Dripping wet, Dudley scrambles to his feet, but the glass window has reappeared, trapping him in the snake house. He bangs desperately on the glass as his mother screams with horror, and Uncle Vernon spots Harry laughing, glaring at him suspiciously. Back at 4 Privet Drive, Vernon grabs Harry by the hair and locks him into the cupboard under the stairs. A tawny owl flies low over Privet Drive and drops a letter, and inside Number 4, Harry picks up the post from the doormat—two letters and a postcard. One of the letters is sealed with wax, and Harry's eyes widen with surprise as he reads the address written in emerald green ink. As he walks slowly into the kitchen, still staring at the envelope, Dudley snatches the letter out of his hand. Uncle Vernon turns the letter over and looks at the coat of arms on the back, staring at his wife with horror, while Harry looks confused. An owl drops another letter, which flies into the letter box at Number 4, and the big bird joins two more perched on the TV aerial. Uncle Vernon tears up three identical letters addressed to Harry, and Harry peeps out of his cupboard and sees his uncle blocking up the letter box. Aunt Petunia sees Uncle Vernon off to work and stares at the owls perched on the car roof rack. She touches his arm as five more letters lie on the path at their feet.",
  "iterations": {
    "1": "Visitors scatter in all directions as the huge snake slithers along the floor and escapes to freedom out of the door of the Reptile House. Dripping wet, Dudley scrambles to his feet, but the glass window has reappeared, trapping him in the snake house. He bangs desperately on the glass as his mother screams with horror, and Uncle Vernon spots Harry laughing, glaring at him suspiciously. Back at 4 Privet Drive, Vernon grabs Harry by the hair and locks him into the cupboard under the stairs. A tawny owl flies low over Privet Drive and drops a letter, and inside Number 4, Harry picks up the post from the doormat—two letters and a postcard. One of the letters is sealed with wax, and Harry's eyes widen with surprise as he reads the address written in emerald green ink. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. As he walks slowly into the kitchen, still staring at the envelope, Dudley snatches the letter out of his hand. Uncle Vernon turns the letter over and looks at the coat of arms on the back, staring at his wife with horror, while Harry looks confused. An owl drops another letter, which flies into the letter box at Number 4, and the big bird joins two more perched on the TV aerial. Uncle Vernon tears up three identical letters addressed to Harry, and Harry peeps out of his cupboard and sees his uncle blocking up the letter box. Aunt Petunia sees Uncle Vernon off to work and stares at the owls perched on the car roof rack. She touches his arm as five more letters lie on the path at their feet.",
    "2": "Visitors scatter in all directions as the huge snake slithers along the floor and escapes to freedom out of the door of the Reptile House. Dripping wet, Dudley scrambles to his feet, but the glass window has reappeared, trapping him in the snake house. He bangs desperately on the glass as his mother screams with horror, and Uncle Vernon spots Harry laughing, glaring at him suspiciously. Back at 4 Privet Drive, Vernon grabs Harry by the hair and locks him into the cupboard under the stairs. A tawny owl flies low over Privet Drive and drops a letter, and inside Number 4, Harry picks up the post from the doormat—two letters and a postcard. One of the letters is sealed with wax, and Harry's eyes widen with surprise as he reads the address written in emerald green ink. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. As he walks slowly into the kitchen, still staring at the envelope, Dudley snatches the letter out of his hand. Uncle Vernon turns the letter over and looks at the coat of arms on the back, staring at his wife with horror, while Harry looks confused. An owl drops another letter, which flies into the letter box at Number 4, and the big bird joins two more perched on the TV aerial. Uncle Vernon tears up three identical letters addressed to Harry, and Harry peeps out of his cupboard and sees his uncle blocking up the letter box. Aunt Petunia sees Uncle Vernon off to work and stares at the owls perched on the car roof rack. She touches his arm as five more letters lie on the path at their feet. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards.",
    "3": "Visitors scatter in all directions as the huge snake slithers along the floor and escapes to freedom out of the door of the Reptile House. Dripping wet, Dudley scrambles to his feet, but the glass window has reappeared, trapping him in the snake house. He bangs desperately on the glass as his mother screams with horror, and Uncle Vernon spots Harry laughing, glaring at him suspiciously. Back at 4 Privet Drive, Vernon grabs Harry by the hair and locks him into the cupboard under the stairs. A tawny owl flies low over Privet Drive and drops a letter, and inside Number 4, Harry picks up the post from the doormat—two letters and a postcard. One of the letters is sealed with wax, and Harry's eyes widen with surprise as he reads the address written in emerald green ink. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. As he walks slowly into the kitchen, still staring at the envelope, Dudley snatches the letter out of his hand. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. Uncle Vernon turns the letter over and looks at the coat of arms on the back, staring at his wife with horror, while Harry looks confused. An owl drops another letter, which flies into the letter box at Number 4, and the big bird joins two more perched on the TV aerial. Uncle Vernon tears up three identical letters addressed to Harry, and Harry peeps out of his cupboard and sees his uncle blocking up the letter box. Aunt Petunia sees Uncle Vernon off to work and stares at the owls perched on the car roof rack. She touches his arm as five more letters lie on the path at their feet. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards.",
    "4": "Visitors scatter in all directions as the huge snake slithers along the floor and escapes to freedom out of the door of the Reptile House. Dripping wet, Dudley scrambles to his feet, but the glass window has reappeared, trapping him in the snake house. He bangs desperately on the glass as his mother screams with horror, and Uncle Vernon spots Harry laughing, glaring at him suspiciously. Back at 4 Privet Drive, Vernon grabs Harry by the hair and locks him into the cupboard under the stairs. A tawny owl flies low over Privet Drive and drops a letter, and inside Number 4, Harry picks up the post from the doormat—two letters and a postcard. One of the letters is sealed with wax, and Harry's eyes widen with surprise as he reads the address written in emerald green ink. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. As he walks slowly into the kitchen, still staring at the envelope, Dudley snatches the letter out of his hand. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. Uncle Vernon turns the letter over and looks at the coat of arms on the back, staring at his wife with horror, while Harry looks confused. An owl drops another letter, which flies into the letter box at Number 4, and the big bird joins two more perched on the TV aerial. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. Uncle Vernon tears up three identical letters addressed to Harry, and Harry peeps out of his cupboard and sees his uncle blocking up the letter box. Aunt Petunia sees Uncle Vernon off to work and stares at the owls perched on the car roof rack. She touches his arm as five more letters lie on the path at their feet. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards.",
    "5": "Visitors scatter in all directions as the huge snake slithers along the floor and escapes to freedom out of the door of the Reptile House. Dripping wet, Dudley scrambles to his feet, but the glass window has reappeared, trapping him in the snake house. He bangs desperately on the glass as his mother screams with horror, and Uncle Vernon spots Harry laughing, glaring at him suspiciously. Back at 4 Privet Drive, Vernon grabs Harry by the hair and locks him into the cupboard under the stairs. A tawny owl flies low over Privet Drive and drops a letter, and inside Number 4, Harry picks up the post from the doormat—two letters and a postcard. One of the letters is sealed with wax, and Harry's eyes widen with surprise as he reads the address written in emerald green ink. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. As he walks slowly into the kitchen, still staring at the envelope, Dudley snatches the letter out of his hand. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. Uncle Vernon turns the letter over and looks at the coat of arms on the back, staring at his wife with horror, while Harry looks confused. An owl drops another letter, which flies into the letter box at Number 4, and the big bird joins two more perched on the TV aerial. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. Uncle Vernon tears up three identical letters addressed to Harry, and Harry peeps out of his cupboard and sees his uncle blocking up the letter box. Aunt Petunia sees Uncle Vernon off to work and stares at the owls perched on the car roof rack. She touches his arm as five more letters lie on the path at their feet. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement.",
    "6": "Visitors scatter in all directions as the huge snake slithers along the floor and escapes to freedom out of the door of the Reptile House. Dripping wet, Dudley scrambles to his feet, but the glass window has reappeared, trapping him in the snake house. He bangs desperately on the glass as his mother screams with horror, and Uncle Vernon spots Harry laughing, glaring at him suspiciously. Back at 4 Privet Drive, Vernon grabs Harry by the hair and locks him into the cupboard under the stairs. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. A tawny owl flies low over Privet Drive and drops a letter, and inside Number 4, Harry picks up the post from the doormat—two letters and a postcard. One of the letters is sealed with wax, and Harry's eyes widen with surprise as he reads the address written in emerald green ink. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. As he walks slowly into the kitchen, still staring at the envelope, Dudley snatches the letter out of his hand. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. Uncle Vernon turns the letter over and looks at the coat of arms on the back, staring at his wife with horror, while Harry looks confused. An owl drops another letter, which flies into the letter box at Number 4, and the big bird joins two more perched on the TV aerial. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. Uncle Vernon tears up three identical letters addressed to Harry, and Harry peeps out of his cupboard and sees his uncle blocking up the letter box. Aunt Petunia sees Uncle Vernon off to work and stares at the owls perched on the car roof rack. She touches his arm as five more letters lie on the path at their feet. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement.",
    "7": "Visitors scatter in all directions as the huge snake slithers along the floor and escapes to freedom out of the door of the Reptile House. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. Dripping wet, Dudley scrambles to his feet, but the glass window has reappeared, trapping him in the snake house. He bangs desperately on the glass as his mother screams with horror, and Uncle Vernon spots Harry laughing, glaring at him suspiciously. Back at 4 Privet Drive, Vernon grabs Harry by the hair and locks him into the cupboard under the stairs. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. A tawny owl flies low over Privet Drive and drops a letter, and inside Number 4, Harry picks up the post from the doormat—two letters and a postcard. One of the letters is sealed with wax, and Harry's eyes widen with surprise as he reads the address written in emerald green ink. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. As he walks slowly into the kitchen, still staring at the envelope, Dudley snatches the letter out of his hand. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. Uncle Vernon turns the letter over and looks at the coat of arms on the back, staring at his wife with horror, while Harry looks confused. An owl drops another letter, which flies into the letter box at Number 4, and the big bird joins two more perched on the TV aerial. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. Uncle Vernon tears up three identical letters addressed to Harry, and Harry peeps out of his cupboard and sees his uncle blocking up the letter box. Aunt Petunia sees Uncle Vernon off to work and stares at the owls perched on the car roof rack. She touches his arm as five more letters lie on the path at their feet. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement.",
    "8": "Visitors scatter in all directions as the huge snake slithers along the floor and escapes to freedom out of the door of the Reptile House. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. Dripping wet, Dudley scrambles to his feet, but the glass window has reappeared, trapping him in the snake house. He bangs desperately on the glass as his mother screams with horror, and Uncle Vernon spots Harry laughing, glaring at him suspiciously. Back at 4 Privet Drive, Vernon grabs Harry by the hair and locks him into the cupboard under the stairs. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. A tawny owl flies low over Privet Drive and drops a letter, and inside Number 4, Harry picks up the post from the doormat—two letters and a postcard. One of the letters is sealed with wax, and Harry's eyes widen with surprise as he reads the address written in emerald green ink. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. As he walks slowly into the kitchen, still staring at the envelope, Dudley snatches the letter out of his hand. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. Uncle Vernon turns the letter over and looks at the coat of arms on the back, staring at his wife with horror, while Harry looks confused. An owl drops another letter, which flies into the letter box at Number 4, and the big bird joins two more perched on the TV aerial. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. Uncle Vernon tears up three identical letters addressed to Harry, and Harry peeps out of his cupboard and sees his uncle blocking up the letter box. Aunt Petunia sees Uncle Vernon off to work and stares at the owls perched on the car roof rack. She touches his arm as five more letters lie on the path at their feet. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement.",
    "9": "Visitors scatter in all directions as the huge snake slithers along the floor and escapes to freedom out of the door of the Reptile House. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. Dripping wet, Dudley scrambles to his feet, but the glass window has reappeared, trapping him in the snake house. He bangs desperately on the glass as his mother screams with horror, and Uncle Vernon spots Harry laughing, glaring at him suspiciously. Back at 4 Privet Drive, Vernon grabs Harry by the hair and locks him into the cupboard under the stairs. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. A tawny owl flies low over Privet Drive and drops a letter, and inside Number 4, Harry picks up the post from the doormat—two letters and a postcard. One of the letters is sealed with wax, and Harry's eyes widen with surprise as he reads the address written in emerald green ink. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. As he walks slowly into the kitchen, still staring at the envelope, Dudley snatches the letter out of his hand. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Uncle Vernon turns the letter over and looks at the coat of arms on the back, staring at his wife with horror, while Harry looks confused. An owl drops another letter, which flies into the letter box at Number 4, and the big bird joins two more perched on the TV aerial. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. Uncle Vernon tears up three identical letters addressed to Harry, and Harry peeps out of his cupboard and sees his uncle blocking up the letter box. Aunt Petunia sees Uncle Vernon off to work and stares at the owls perched on the car roof rack. She touches his arm as five more letters lie on the path at their feet. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement.",
    "10": "Visitors scatter in all directions as the huge snake slithers along the floor and escapes to freedom out of the door of the Reptile House. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. Dripping wet, Dudley scrambles to his feet, but the glass window has reappeared, trapping him in the snake house. He bangs desperately on the glass as his mother screams with horror, and Uncle Vernon spots Harry laughing, glaring at him suspiciously. Back at 4 Privet Drive, Vernon grabs Harry by the hair and locks him into the cupboard under the stairs. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. A tawny owl flies low over Privet Drive and drops a letter, and inside Number 4, Harry picks up the post from the doormat—two letters and a postcard. One of the letters is sealed with wax, and Harry's eyes widen with surprise as he reads the address written in emerald green ink. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. As he walks slowly into the kitchen, still staring at the envelope, Dudley snatches the letter out of his hand. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Uncle Vernon turns the letter over and looks at the coat of arms on the back, staring at his wife with horror, while Harry looks confused. An owl drops another letter, which flies into the letter box at Number 4, and the big bird joins two more perched on the TV aerial. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Uncle Vernon tears up three identical letters addressed to Harry, and Harry peeps out of his cupboard and sees his uncle blocking up the letter box. Aunt Petunia sees Uncle Vernon off to work and stares at the owls perched on the car roof rack. She touches his arm as five more letters lie on the path at their feet. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement."
  }
}