{
  "ground_truth": "All the boys are fast asleep except for Harry. He is sitting in his pajamas on the wide-stone sill gazing out of the window with his knees tucked up under his chin. Sitting beside him, his pet snowy owl turns its head as he gently strokes its soft, white feathers. As Harry looks out through the diamond shaped window panes across the moonlit courtyard at the school, he gives a contented smile. Next morning, Harry and Ron are late for class. A tabby cat is sitting on the teacher's desk. It looks up as they open the classroom door. Hermione looks at them disapprovingly as they hurry into the room. The cat leaps off of the table and turns into Professor McGonagall. Later, the dark figure of Professor Snape sweeps into his classroom. He fixes his eyes on Malfoy who smiles slyly. Harry takes careful notes.",
  "iterations": {
    "1": "In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. All the boys are fast asleep except for Harry. He is sitting in his pajamas on the wide-stone sill gazing out of the window with his knees tucked up under his chin. Sitting beside him, his pet snowy owl turns its head as he gently strokes its soft, white feathers. As Harry looks out through the diamond shaped window panes across the moonlit courtyard at the school, he gives a contented smile. Next morning, Harry and Ron are late for class. A tabby cat is sitting on the teacher's desk. It looks up as they open the classroom door. Hermione looks at them disapprovingly as they hurry into the room. The cat leaps off of the table and turns into Professor McGonagall. Later, the dark figure of Professor Snape sweeps into his classroom. He fixes his eyes on Malfoy who smiles slyly. Harry takes careful notes.",
    "2": "In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. All the boys are fast asleep except for Harry. He is sitting in his pajamas on the wide-stone sill gazing out of the window with his knees tucked up under his chin. Sitting beside him, his pet snowy owl turns its head as he gently strokes its soft, white feathers. As Harry looks out through the diamond shaped window panes across the moonlit courtyard at the school, he gives a contented smile. Next morning, Harry and Ron are late for class. A tabby cat is sitting on the teacher's desk. It looks up as they open the classroom door. Hermione looks at them disapprovingly as they hurry into the room. The cat leaps off of the table and turns into Professor McGonagall. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. Later, the dark figure of Professor Snape sweeps into his classroom. He fixes his eyes on Malfoy who smiles slyly. Harry takes careful notes.",
    "3": "In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. All the boys are fast asleep except for Harry. He is sitting in his pajamas on the wide-stone sill gazing out of the window with his knees tucked up under his chin. Sitting beside him, his pet snowy owl turns its head as he gently strokes its soft, white feathers. As Harry looks out through the diamond shaped window panes across the moonlit courtyard at the school, he gives a contented smile. Next morning, Harry and Ron are late for class. A tabby cat is sitting on the teacher's desk. It looks up as they open the classroom door. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. Hermione looks at them disapprovingly as they hurry into the room. The cat leaps off of the table and turns into Professor McGonagall. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. Later, the dark figure of Professor Snape sweeps into his classroom. He fixes his eyes on Malfoy who smiles slyly. Harry takes careful notes.",
    "4": "In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. All the boys are fast asleep except for Harry. He is sitting in his pajamas on the wide-stone sill gazing out of the window with his knees tucked up under his chin. Sitting beside him, his pet snowy owl turns its head as he gently strokes its soft, white feathers. As Harry looks out through the diamond shaped window panes across the moonlit courtyard at the school, he gives a contented smile. Next morning, Harry and Ron are late for class. A tabby cat is sitting on the teacher's desk. It looks up as they open the classroom door. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. Hermione looks at them disapprovingly as they hurry into the room. The cat leaps off of the table and turns into Professor McGonagall. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. Later, the dark figure of Professor Snape sweeps into his classroom. He fixes his eyes on Malfoy who smiles slyly. Harry takes careful notes. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams.",
    "5": "In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. All the boys are fast asleep except for Harry. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. He is sitting in his pajamas on the wide-stone sill gazing out of the window with his knees tucked up under his chin. Sitting beside him, his pet snowy owl turns its head as he gently strokes its soft, white feathers. As Harry looks out through the diamond shaped window panes across the moonlit courtyard at the school, he gives a contented smile. Next morning, Harry and Ron are late for class. A tabby cat is sitting on the teacher's desk. It looks up as they open the classroom door. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. Hermione looks at them disapprovingly as they hurry into the room. The cat leaps off of the table and turns into Professor McGonagall. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. Later, the dark figure of Professor Snape sweeps into his classroom. He fixes his eyes on Malfoy who smiles slyly. Harry takes careful notes. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams.",
    "6": "In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. All the boys are fast asleep except for Harry. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. He is sitting in his pajamas on the wide-stone sill gazing out of the window with his knees tucked up under his chin. Sitting beside him, his pet snowy owl turns its head as he gently strokes its soft, white feathers. As Harry looks out through the diamond shaped window panes across the moonlit courtyard at the school, he gives a contented smile. Next morning, Harry and Ron are late for class. A tabby cat is sitting on the teacher's desk. It looks up as they open the classroom door. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. Hermione looks at them disapprovingly as they hurry into the room. The cat leaps off of the table and turns into Professor McGonagall. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. Later, the dark figure of Professor Snape sweeps into his classroom. He fixes his eyes on Malfoy who smiles slyly. Harry takes careful notes. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams.",
    "7": "In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. All the boys are fast asleep except for Harry. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. He is sitting in his pajamas on the wide-stone sill gazing out of the window with his knees tucked up under his chin. Sitting beside him, his pet snowy owl turns its head as he gently strokes its soft, white feathers. As Harry looks out through the diamond shaped window panes across the moonlit courtyard at the school, he gives a contented smile. Next morning, Harry and Ron are late for class. A tabby cat is sitting on the teacher's desk. It looks up as they open the classroom door. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. Hermione looks at them disapprovingly as they hurry into the room. The cat leaps off of the table and turns into Professor McGonagall. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. Later, the dark figure of Professor Snape sweeps into his classroom. He fixes his eyes on Malfoy who smiles slyly. Harry takes careful notes. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams.",
    "8": "In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. All the boys are fast asleep except for Harry. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. He is sitting in his pajamas on the wide-stone sill gazing out of the window with his knees tucked up under his chin. Sitting beside him, his pet snowy owl turns its head as he gently strokes its soft, white feathers. As Harry looks out through the diamond shaped window panes across the moonlit courtyard at the school, he gives a contented smile. Next morning, Harry and Ron are late for class. A tabby cat is sitting on the teacher's desk. It looks up as they open the classroom door. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. Hermione looks at them disapprovingly as they hurry into the room. The cat leaps off of the table and turns into Professor McGonagall. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. Later, the dark figure of Professor Snape sweeps into his classroom. He fixes his eyes on Malfoy who smiles slyly. Harry takes careful notes. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams.",
    "9": "In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. All the boys are fast asleep except for Harry. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. He is sitting in his pajamas on the wide-stone sill gazing out of the window with his knees tucked up under his chin. Sitting beside him, his pet snowy owl turns its head as he gently strokes its soft, white feathers. As Harry looks out through the diamond shaped window panes across the moonlit courtyard at the school, he gives a contented smile. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. Next morning, Harry and Ron are late for class. A tabby cat is sitting on the teacher's desk. It looks up as they open the classroom door. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. Hermione looks at them disapprovingly as they hurry into the room. The cat leaps off of the table and turns into Professor McGonagall. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. Later, the dark figure of Professor Snape sweeps into his classroom. He fixes his eyes on Malfoy who smiles slyly. Harry takes careful notes. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams.",
    "10": "In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. All the boys are fast asleep except for Harry. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. He is sitting in his pajamas on the wide-stone sill gazing out of the window with his knees tucked up under his chin. Sitting beside him, his pet snowy owl turns its head as he gently strokes its soft, white feathers. As Harry looks out through the diamond shaped window panes across the moonlit courtyard at the school, he gives a contented smile. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. Next morning, Harry and Ron are late for class. A tabby cat is sitting on the teacher's desk. It looks up as they open the classroom door. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams. Hermione looks at them disapprovingly as they hurry into the room. The cat leaps off of the table and turns into Professor McGonagall. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. Later, the dark figure of Professor Snape sweeps into his classroom. He fixes his eyes on Malfoy who smiles slyly. Harry takes careful notes. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Inside a lavish 1920s speakeasy, a troubled jazz musician pours his soul into a melancholic melody, every note echoing the bittersweet memories of lost love and shattered dreams."
  }
}