{
  "ground_truth": "John walks down the front path of the house with a pool and palm trees at the front, where there's a large new car in the driveway. He unsmilingly bends down and picks the newspapers up off the drive. Holding a baby, he snaps at Marley, who's paws up on the breakfast table and taking an interest in Patrick's food. John frowns at the implication, and the moment's captured on camera. He arrives back home at night, driving his old blue Honda and parks up behind their new people carrier. Gloomily, he glances up, and through a window, sees Jenny holding the baby with Marley bouncing around, playfully. He leans back thoughtfully in the driving seat. Jenny spots him sitting in the car and gestures to him, asking if he's actually going to come indoors. He gets reluctantly out of the car. He sits with a blank expression. Jenny and Patrick sit glumly side by side at the table as John goes and sees to the baby. Marley is next to Patrick, eyeing his food, as she's trying to wrestle a book away from him.",
  "iterations": {
    "1": "John walks down the front path of the house with a pool and palm trees at the front, where there's a large new car in the driveway. He unsmilingly bends down and picks the newspapers up off the drive. Holding a baby, he snaps at Marley, who's paws up on the breakfast table and taking an interest in Patrick's food. John frowns at the implication, and the moment's captured on camera. He arrives back home at night, driving his old blue Honda and parks up behind their new people carrier. Gloomily, he glances up, and through a window, sees Jenny holding the baby with Marley bouncing around, playfully. He leans back thoughtfully in the driving seat. Jenny spots him sitting in the car and gestures to him, asking if he's actually going to come indoors. He gets reluctantly out of the car. He sits with a blank expression. Jenny and Patrick sit glumly side by side at the table as John goes and sees to the baby. Marley is next to Patrick, eyeing his food, as she's trying to wrestle a book away from him. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind.",
    "2": "John walks down the front path of the house with a pool and palm trees at the front, where there's a large new car in the driveway. He unsmilingly bends down and picks the newspapers up off the drive. Holding a baby, he snaps at Marley, who's paws up on the breakfast table and taking an interest in Patrick's food. John frowns at the implication, and the moment's captured on camera. He arrives back home at night, driving his old blue Honda and parks up behind their new people carrier. Gloomily, he glances up, and through a window, sees Jenny holding the baby with Marley bouncing around, playfully. He leans back thoughtfully in the driving seat. Jenny spots him sitting in the car and gestures to him, asking if he's actually going to come indoors. He gets reluctantly out of the car. He sits with a blank expression. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. Jenny and Patrick sit glumly side by side at the table as John goes and sees to the baby. Marley is next to Patrick, eyeing his food, as she's trying to wrestle a book away from him. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind.",
    "3": "John walks down the front path of the house with a pool and palm trees at the front, where there's a large new car in the driveway. He unsmilingly bends down and picks the newspapers up off the drive. Holding a baby, he snaps at Marley, who's paws up on the breakfast table and taking an interest in Patrick's food. John frowns at the implication, and the moment's captured on camera. He arrives back home at night, driving his old blue Honda and parks up behind their new people carrier. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. Gloomily, he glances up, and through a window, sees Jenny holding the baby with Marley bouncing around, playfully. He leans back thoughtfully in the driving seat. Jenny spots him sitting in the car and gestures to him, asking if he's actually going to come indoors. He gets reluctantly out of the car. He sits with a blank expression. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. Jenny and Patrick sit glumly side by side at the table as John goes and sees to the baby. Marley is next to Patrick, eyeing his food, as she's trying to wrestle a book away from him. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind.",
    "4": "John walks down the front path of the house with a pool and palm trees at the front, where there's a large new car in the driveway. He unsmilingly bends down and picks the newspapers up off the drive. Holding a baby, he snaps at Marley, who's paws up on the breakfast table and taking an interest in Patrick's food. John frowns at the implication, and the moment's captured on camera. He arrives back home at night, driving his old blue Honda and parks up behind their new people carrier. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. Gloomily, he glances up, and through a window, sees Jenny holding the baby with Marley bouncing around, playfully. He leans back thoughtfully in the driving seat. Jenny spots him sitting in the car and gestures to him, asking if he's actually going to come indoors. He gets reluctantly out of the car. He sits with a blank expression. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. Jenny and Patrick sit glumly side by side at the table as John goes and sees to the baby. Marley is next to Patrick, eyeing his food, as she's trying to wrestle a book away from him. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards.",
    "5": "John walks down the front path of the house with a pool and palm trees at the front, where there's a large new car in the driveway. He unsmilingly bends down and picks the newspapers up off the drive. Holding a baby, he snaps at Marley, who's paws up on the breakfast table and taking an interest in Patrick's food. John frowns at the implication, and the moment's captured on camera. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. He arrives back home at night, driving his old blue Honda and parks up behind their new people carrier. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. Gloomily, he glances up, and through a window, sees Jenny holding the baby with Marley bouncing around, playfully. He leans back thoughtfully in the driving seat. Jenny spots him sitting in the car and gestures to him, asking if he's actually going to come indoors. He gets reluctantly out of the car. He sits with a blank expression. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. Jenny and Patrick sit glumly side by side at the table as John goes and sees to the baby. Marley is next to Patrick, eyeing his food, as she's trying to wrestle a book away from him. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards.",
    "6": "John walks down the front path of the house with a pool and palm trees at the front, where there's a large new car in the driveway. He unsmilingly bends down and picks the newspapers up off the drive. Holding a baby, he snaps at Marley, who's paws up on the breakfast table and taking an interest in Patrick's food. John frowns at the implication, and the moment's captured on camera. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. He arrives back home at night, driving his old blue Honda and parks up behind their new people carrier. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. Gloomily, he glances up, and through a window, sees Jenny holding the baby with Marley bouncing around, playfully. He leans back thoughtfully in the driving seat. Jenny spots him sitting in the car and gestures to him, asking if he's actually going to come indoors. He gets reluctantly out of the car. He sits with a blank expression. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. Jenny and Patrick sit glumly side by side at the table as John goes and sees to the baby. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. Marley is next to Patrick, eyeing his food, as she's trying to wrestle a book away from him. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards.",
    "7": "John walks down the front path of the house with a pool and palm trees at the front, where there's a large new car in the driveway. He unsmilingly bends down and picks the newspapers up off the drive. Holding a baby, he snaps at Marley, who's paws up on the breakfast table and taking an interest in Patrick's food. John frowns at the implication, and the moment's captured on camera. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. He arrives back home at night, driving his old blue Honda and parks up behind their new people carrier. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. Gloomily, he glances up, and through a window, sees Jenny holding the baby with Marley bouncing around, playfully. He leans back thoughtfully in the driving seat. Jenny spots him sitting in the car and gestures to him, asking if he's actually going to come indoors. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. He gets reluctantly out of the car. He sits with a blank expression. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. Jenny and Patrick sit glumly side by side at the table as John goes and sees to the baby. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. Marley is next to Patrick, eyeing his food, as she's trying to wrestle a book away from him. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards.",
    "8": "John walks down the front path of the house with a pool and palm trees at the front, where there's a large new car in the driveway. He unsmilingly bends down and picks the newspapers up off the drive. Holding a baby, he snaps at Marley, who's paws up on the breakfast table and taking an interest in Patrick's food. John frowns at the implication, and the moment's captured on camera. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. He arrives back home at night, driving his old blue Honda and parks up behind their new people carrier. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. Gloomily, he glances up, and through a window, sees Jenny holding the baby with Marley bouncing around, playfully. He leans back thoughtfully in the driving seat. Jenny spots him sitting in the car and gestures to him, asking if he's actually going to come indoors. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. He gets reluctantly out of the car. He sits with a blank expression. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. Jenny and Patrick sit glumly side by side at the table as John goes and sees to the baby. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. Marley is next to Patrick, eyeing his food, as she's trying to wrestle a book away from him. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards.",
    "9": "John walks down the front path of the house with a pool and palm trees at the front, where there's a large new car in the driveway. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. He unsmilingly bends down and picks the newspapers up off the drive. Holding a baby, he snaps at Marley, who's paws up on the breakfast table and taking an interest in Patrick's food. John frowns at the implication, and the moment's captured on camera. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. He arrives back home at night, driving his old blue Honda and parks up behind their new people carrier. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. Gloomily, he glances up, and through a window, sees Jenny holding the baby with Marley bouncing around, playfully. He leans back thoughtfully in the driving seat. Jenny spots him sitting in the car and gestures to him, asking if he's actually going to come indoors. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. He gets reluctantly out of the car. He sits with a blank expression. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. Jenny and Patrick sit glumly side by side at the table as John goes and sees to the baby. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. Marley is next to Patrick, eyeing his food, as she's trying to wrestle a book away from him. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards.",
    "10": "John walks down the front path of the house with a pool and palm trees at the front, where there's a large new car in the driveway. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature’s fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. He unsmilingly bends down and picks the newspapers up off the drive. Holding a baby, he snaps at Marley, who's paws up on the breakfast table and taking an interest in Patrick's food. John frowns at the implication, and the moment's captured on camera. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. He arrives back home at night, driving his old blue Honda and parks up behind their new people carrier. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. Gloomily, he glances up, and through a window, sees Jenny holding the baby with Marley bouncing around, playfully. He leans back thoughtfully in the driving seat. Jenny spots him sitting in the car and gestures to him, asking if he's actually going to come indoors. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. He gets reluctantly out of the car. He sits with a blank expression. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. Jenny and Patrick sit glumly side by side at the table as John goes and sees to the baby. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. Marley is next to Patrick, eyeing his food, as she's trying to wrestle a book away from him. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards."
  }
}