{
  "ground_truth": "A montage of news images shows a pair of large military-style trucks driven in tandem along a dirt road, the first with a single soldier standing in the back and the second with a whole troop. The trucks pull up, and the troops, dressed in khaki fatigues and wearing wide-brimmed hats with a gold-colored Burmese military emblem, order a group of terrified and cowering peasants off the truck and onto the road while brandishing rifles. The troops pass cash among themselves, as an officer in dark glasses sits coolly smoking a cigarette in one of the trucks. A soldier walks in a nearby paddy field and tosses a primed grenade, causing the villagers to cower. The soldier then primes and tosses two more grenades, which splash harmlessly on sodden ground, before stopping about 100 yards from the truck. The peasants are pushed at gunpoint to the edge of the field and begin to half-run, half-stumble across the paddy field towards the solitary soldier as the troops watch impassively, and the commander pulls on his cigarette. One of the peasants is blown to pieces, leaving the rest to stand still. The commander nods to a soldier, and at the command, the troops open fire, shooting down the peasants. Low clouds hover above mountains, with a verdant valley edged with ferns and a small stream running through it. Captions in military white type appear as a mustachioed local man in a baseball cap and striped T-shirt pokes undergrowth with a stick, joined by a second man wearing a bandana and a red shirt, and a third man, John Rambo. Rambo, dark-haired, heavy-set, muscular, and sullen-faced, wears a khaki smock and a red paisley bandanna. Rambo pushes his stick, which has a hook on the end, into the greenery, where a cobra rears in the grass.",
  "iterations": {
    "1": "A montage of news images shows a pair of large military-style trucks driven in tandem along a dirt road, the first with a single soldier standing in the back and the second with a whole troop. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. The trucks pull up, and the troops, dressed in khaki fatigues and wearing wide-brimmed hats with a gold-colored Burmese military emblem, order a group of terrified and cowering peasants off the truck and onto the road while brandishing rifles. The troops pass cash among themselves, as an officer in dark glasses sits coolly smoking a cigarette in one of the trucks. A soldier walks in a nearby paddy field and tosses a primed grenade, causing the villagers to cower. The soldier then primes and tosses two more grenades, which splash harmlessly on sodden ground, before stopping about 100 yards from the truck. The peasants are pushed at gunpoint to the edge of the field and begin to half-run, half-stumble across the paddy field towards the solitary soldier as the troops watch impassively, and the commander pulls on his cigarette. One of the peasants is blown to pieces, leaving the rest to stand still. The commander nods to a soldier, and at the command, the troops open fire, shooting down the peasants. Low clouds hover above mountains, with a verdant valley edged with ferns and a small stream running through it. Captions in military white type appear as a mustachioed local man in a baseball cap and striped T-shirt pokes undergrowth with a stick, joined by a second man wearing a bandana and a red shirt, and a third man, John Rambo. Rambo, dark-haired, heavy-set, muscular, and sullen-faced, wears a khaki smock and a red paisley bandanna. Rambo pushes his stick, which has a hook on the end, into the greenery, where a cobra rears in the grass.",
    "2": "A montage of news images shows a pair of large military-style trucks driven in tandem along a dirt road, the first with a single soldier standing in the back and the second with a whole troop. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. The trucks pull up, and the troops, dressed in khaki fatigues and wearing wide-brimmed hats with a gold-colored Burmese military emblem, order a group of terrified and cowering peasants off the truck and onto the road while brandishing rifles. The troops pass cash among themselves, as an officer in dark glasses sits coolly smoking a cigarette in one of the trucks. A soldier walks in a nearby paddy field and tosses a primed grenade, causing the villagers to cower. The soldier then primes and tosses two more grenades, which splash harmlessly on sodden ground, before stopping about 100 yards from the truck. The peasants are pushed at gunpoint to the edge of the field and begin to half-run, half-stumble across the paddy field towards the solitary soldier as the troops watch impassively, and the commander pulls on his cigarette. One of the peasants is blown to pieces, leaving the rest to stand still. The commander nods to a soldier, and at the command, the troops open fire, shooting down the peasants. Low clouds hover above mountains, with a verdant valley edged with ferns and a small stream running through it. Captions in military white type appear as a mustachioed local man in a baseball cap and striped T-shirt pokes undergrowth with a stick, joined by a second man wearing a bandana and a red shirt, and a third man, John Rambo. Rambo, dark-haired, heavy-set, muscular, and sullen-faced, wears a khaki smock and a red paisley bandanna. Rambo pushes his stick, which has a hook on the end, into the greenery, where a cobra rears in the grass.",
    "3": "A montage of news images shows a pair of large military-style trucks driven in tandem along a dirt road, the first with a single soldier standing in the back and the second with a whole troop. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. The trucks pull up, and the troops, dressed in khaki fatigues and wearing wide-brimmed hats with a gold-colored Burmese military emblem, order a group of terrified and cowering peasants off the truck and onto the road while brandishing rifles. The troops pass cash among themselves, as an officer in dark glasses sits coolly smoking a cigarette in one of the trucks. A soldier walks in a nearby paddy field and tosses a primed grenade, causing the villagers to cower. The soldier then primes and tosses two more grenades, which splash harmlessly on sodden ground, before stopping about 100 yards from the truck. The peasants are pushed at gunpoint to the edge of the field and begin to half-run, half-stumble across the paddy field towards the solitary soldier as the troops watch impassively, and the commander pulls on his cigarette. One of the peasants is blown to pieces, leaving the rest to stand still. The commander nods to a soldier, and at the command, the troops open fire, shooting down the peasants. Low clouds hover above mountains, with a verdant valley edged with ferns and a small stream running through it. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. Captions in military white type appear as a mustachioed local man in a baseball cap and striped T-shirt pokes undergrowth with a stick, joined by a second man wearing a bandana and a red shirt, and a third man, John Rambo. Rambo, dark-haired, heavy-set, muscular, and sullen-faced, wears a khaki smock and a red paisley bandanna. Rambo pushes his stick, which has a hook on the end, into the greenery, where a cobra rears in the grass.",
    "4": "A montage of news images shows a pair of large military-style trucks driven in tandem along a dirt road, the first with a single soldier standing in the back and the second with a whole troop. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. The trucks pull up, and the troops, dressed in khaki fatigues and wearing wide-brimmed hats with a gold-colored Burmese military emblem, order a group of terrified and cowering peasants off the truck and onto the road while brandishing rifles. The troops pass cash among themselves, as an officer in dark glasses sits coolly smoking a cigarette in one of the trucks. A soldier walks in a nearby paddy field and tosses a primed grenade, causing the villagers to cower. The soldier then primes and tosses two more grenades, which splash harmlessly on sodden ground, before stopping about 100 yards from the truck. The peasants are pushed at gunpoint to the edge of the field and begin to half-run, half-stumble across the paddy field towards the solitary soldier as the troops watch impassively, and the commander pulls on his cigarette. One of the peasants is blown to pieces, leaving the rest to stand still. The commander nods to a soldier, and at the command, the troops open fire, shooting down the peasants. Low clouds hover above mountains, with a verdant valley edged with ferns and a small stream running through it. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Captions in military white type appear as a mustachioed local man in a baseball cap and striped T-shirt pokes undergrowth with a stick, joined by a second man wearing a bandana and a red shirt, and a third man, John Rambo. Rambo, dark-haired, heavy-set, muscular, and sullen-faced, wears a khaki smock and a red paisley bandanna. Rambo pushes his stick, which has a hook on the end, into the greenery, where a cobra rears in the grass.",
    "5": "A montage of news images shows a pair of large military-style trucks driven in tandem along a dirt road, the first with a single soldier standing in the back and the second with a whole troop. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. The trucks pull up, and the troops, dressed in khaki fatigues and wearing wide-brimmed hats with a gold-colored Burmese military emblem, order a group of terrified and cowering peasants off the truck and onto the road while brandishing rifles. The troops pass cash among themselves, as an officer in dark glasses sits coolly smoking a cigarette in one of the trucks. A soldier walks in a nearby paddy field and tosses a primed grenade, causing the villagers to cower. The soldier then primes and tosses two more grenades, which splash harmlessly on sodden ground, before stopping about 100 yards from the truck. The peasants are pushed at gunpoint to the edge of the field and begin to half-run, half-stumble across the paddy field towards the solitary soldier as the troops watch impassively, and the commander pulls on his cigarette. One of the peasants is blown to pieces, leaving the rest to stand still. The commander nods to a soldier, and at the command, the troops open fire, shooting down the peasants. Low clouds hover above mountains, with a verdant valley edged with ferns and a small stream running through it. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Captions in military white type appear as a mustachioed local man in a baseball cap and striped T-shirt pokes undergrowth with a stick, joined by a second man wearing a bandana and a red shirt, and a third man, John Rambo. Rambo, dark-haired, heavy-set, muscular, and sullen-faced, wears a khaki smock and a red paisley bandanna. Rambo pushes his stick, which has a hook on the end, into the greenery, where a cobra rears in the grass.",
    "6": "A montage of news images shows a pair of large military-style trucks driven in tandem along a dirt road, the first with a single soldier standing in the back and the second with a whole troop. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. The trucks pull up, and the troops, dressed in khaki fatigues and wearing wide-brimmed hats with a gold-colored Burmese military emblem, order a group of terrified and cowering peasants off the truck and onto the road while brandishing rifles. The troops pass cash among themselves, as an officer in dark glasses sits coolly smoking a cigarette in one of the trucks. A soldier walks in a nearby paddy field and tosses a primed grenade, causing the villagers to cower. The soldier then primes and tosses two more grenades, which splash harmlessly on sodden ground, before stopping about 100 yards from the truck. The peasants are pushed at gunpoint to the edge of the field and begin to half-run, half-stumble across the paddy field towards the solitary soldier as the troops watch impassively, and the commander pulls on his cigarette. One of the peasants is blown to pieces, leaving the rest to stand still. The commander nods to a soldier, and at the command, the troops open fire, shooting down the peasants. Low clouds hover above mountains, with a verdant valley edged with ferns and a small stream running through it. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Captions in military white type appear as a mustachioed local man in a baseball cap and striped T-shirt pokes undergrowth with a stick, joined by a second man wearing a bandana and a red shirt, and a third man, John Rambo. Rambo, dark-haired, heavy-set, muscular, and sullen-faced, wears a khaki smock and a red paisley bandanna. Rambo pushes his stick, which has a hook on the end, into the greenery, where a cobra rears in the grass.",
    "7": "A montage of news images shows a pair of large military-style trucks driven in tandem along a dirt road, the first with a single soldier standing in the back and the second with a whole troop. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. The trucks pull up, and the troops, dressed in khaki fatigues and wearing wide-brimmed hats with a gold-colored Burmese military emblem, order a group of terrified and cowering peasants off the truck and onto the road while brandishing rifles. The troops pass cash among themselves, as an officer in dark glasses sits coolly smoking a cigarette in one of the trucks. A soldier walks in a nearby paddy field and tosses a primed grenade, causing the villagers to cower. The soldier then primes and tosses two more grenades, which splash harmlessly on sodden ground, before stopping about 100 yards from the truck. The peasants are pushed at gunpoint to the edge of the field and begin to half-run, half-stumble across the paddy field towards the solitary soldier as the troops watch impassively, and the commander pulls on his cigarette. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. One of the peasants is blown to pieces, leaving the rest to stand still. The commander nods to a soldier, and at the command, the troops open fire, shooting down the peasants. Low clouds hover above mountains, with a verdant valley edged with ferns and a small stream running through it. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Captions in military white type appear as a mustachioed local man in a baseball cap and striped T-shirt pokes undergrowth with a stick, joined by a second man wearing a bandana and a red shirt, and a third man, John Rambo. Rambo, dark-haired, heavy-set, muscular, and sullen-faced, wears a khaki smock and a red paisley bandanna. Rambo pushes his stick, which has a hook on the end, into the greenery, where a cobra rears in the grass.",
    "8": "A montage of news images shows a pair of large military-style trucks driven in tandem along a dirt road, the first with a single soldier standing in the back and the second with a whole troop. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. The trucks pull up, and the troops, dressed in khaki fatigues and wearing wide-brimmed hats with a gold-colored Burmese military emblem, order a group of terrified and cowering peasants off the truck and onto the road while brandishing rifles. The troops pass cash among themselves, as an officer in dark glasses sits coolly smoking a cigarette in one of the trucks. A soldier walks in a nearby paddy field and tosses a primed grenade, causing the villagers to cower. The soldier then primes and tosses two more grenades, which splash harmlessly on sodden ground, before stopping about 100 yards from the truck. The peasants are pushed at gunpoint to the edge of the field and begin to half-run, half-stumble across the paddy field towards the solitary soldier as the troops watch impassively, and the commander pulls on his cigarette. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. One of the peasants is blown to pieces, leaving the rest to stand still. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. The commander nods to a soldier, and at the command, the troops open fire, shooting down the peasants. Low clouds hover above mountains, with a verdant valley edged with ferns and a small stream running through it. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Captions in military white type appear as a mustachioed local man in a baseball cap and striped T-shirt pokes undergrowth with a stick, joined by a second man wearing a bandana and a red shirt, and a third man, John Rambo. Rambo, dark-haired, heavy-set, muscular, and sullen-faced, wears a khaki smock and a red paisley bandanna. Rambo pushes his stick, which has a hook on the end, into the greenery, where a cobra rears in the grass.",
    "9": "A montage of news images shows a pair of large military-style trucks driven in tandem along a dirt road, the first with a single soldier standing in the back and the second with a whole troop. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. The trucks pull up, and the troops, dressed in khaki fatigues and wearing wide-brimmed hats with a gold-colored Burmese military emblem, order a group of terrified and cowering peasants off the truck and onto the road while brandishing rifles. The troops pass cash among themselves, as an officer in dark glasses sits coolly smoking a cigarette in one of the trucks. A soldier walks in a nearby paddy field and tosses a primed grenade, causing the villagers to cower. The soldier then primes and tosses two more grenades, which splash harmlessly on sodden ground, before stopping about 100 yards from the truck. The peasants are pushed at gunpoint to the edge of the field and begin to half-run, half-stumble across the paddy field towards the solitary soldier as the troops watch impassively, and the commander pulls on his cigarette. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. One of the peasants is blown to pieces, leaving the rest to stand still. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. The commander nods to a soldier, and at the command, the troops open fire, shooting down the peasants. Low clouds hover above mountains, with a verdant valley edged with ferns and a small stream running through it. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Captions in military white type appear as a mustachioed local man in a baseball cap and striped T-shirt pokes undergrowth with a stick, joined by a second man wearing a bandana and a red shirt, and a third man, John Rambo. Rambo, dark-haired, heavy-set, muscular, and sullen-faced, wears a khaki smock and a red paisley bandanna. Rambo pushes his stick, which has a hook on the end, into the greenery, where a cobra rears in the grass.",
    "10": "A montage of news images shows a pair of large military-style trucks driven in tandem along a dirt road, the first with a single soldier standing in the back and the second with a whole troop. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city’s elite, with gaslit streets setting the stage for a race against a mounting darkness. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. High above a sprawling city skyline, a daredevil pilot executes death-defying maneuvers in a vintage biplane, narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. The trucks pull up, and the troops, dressed in khaki fatigues and wearing wide-brimmed hats with a gold-colored Burmese military emblem, order a group of terrified and cowering peasants off the truck and onto the road while brandishing rifles. The troops pass cash among themselves, as an officer in dark glasses sits coolly smoking a cigarette in one of the trucks. A soldier walks in a nearby paddy field and tosses a primed grenade, causing the villagers to cower. The soldier then primes and tosses two more grenades, which splash harmlessly on sodden ground, before stopping about 100 yards from the truck. The peasants are pushed at gunpoint to the edge of the field and begin to half-run, half-stumble across the paddy field towards the solitary soldier as the troops watch impassively, and the commander pulls on his cigarette. In the neon-lit back alleys of a dystopian metropolis, a rogue hacker races against time while being chased by relentless cyborg enforcers, their footsteps echoing off rain-soaked pavement. One of the peasants is blown to pieces, leaving the rest to stand still. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. The commander nods to a soldier, and at the command, the troops open fire, shooting down the peasants. Low clouds hover above mountains, with a verdant valley edged with ferns and a small stream running through it. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. Within the creaking walls of an old countryside manor, an estranged family gathers for a mysterious inheritance, their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Captions in military white type appear as a mustachioed local man in a baseball cap and striped T-shirt pokes undergrowth with a stick, joined by a second man wearing a bandana and a red shirt, and a third man, John Rambo. Rambo, dark-haired, heavy-set, muscular, and sullen-faced, wears a khaki smock and a red paisley bandanna. Rambo pushes his stick, which has a hook on the end, into the greenery, where a cobra rears in the grass."
  }
}