{
  "ground_truth": "The soldier with the dancing girl drags her towards his hut, and she struggles. He slaps her, causing her to fall to the ground, then gestures to the hut and crawls underneath it. Unseen by the soldier, En-Joo clamps a hand over her mouth and holds a finger to his lips. The soldier looks underneath the hut for the girl, and En-Joo dives towards him, plunging a knife into his throat and stabbing repeatedly. He drags the soldier's body out of sight. Rambo runs out to a hut and dives underneath it, seeing Sarah lying prone in the pig sty. He throws open a wooden bolt, opens a gate, and crawls inside. He looks out through the timbers and sees the soldier with the bottle of spirits returning. Sarah is asleep or unconscious, and Rambo rushes over to the partition between them, pushing pigs out of the way. En-Joo checks his watch—10 seconds to 2. On the watch tower, School Boy has a soldier in the site of his weapon, and his watch shows 2 AM. He fires, starting by picking off the guard below and the guards in two adjacent watch towers.",
  "iterations": {
    "1": "The soldier with the dancing girl drags her towards his hut, and she struggles. He slaps her, causing her to fall to the ground, then gestures to the hut and crawls underneath it. Unseen by the soldier, En-Joo clamps a hand over her mouth and holds a finger to his lips. The soldier looks underneath the hut for the girl, and En-Joo dives towards him, plunging a knife into his throat and stabbing repeatedly. He drags the soldier's body out of sight. Rambo runs out to a hut and dives underneath it, seeing Sarah lying prone in the pig sty. He throws open a wooden bolt, opens a gate, and crawls inside. He looks out through the timbers and sees the soldier with the bottle of spirits returning. Sarah is asleep or unconscious, and Rambo rushes over to the partition between them, pushing pigs out of the way. En-Joo checks his watch—10 seconds to 2. On the watch tower, School Boy has a soldier in the site of his weapon, and his watch shows 2 AM. He fires, starting by picking off the guard below and the guards in two adjacent watch towers. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards.",
    "2": "The soldier with the dancing girl drags her towards his hut, and she struggles. He slaps her, causing her to fall to the ground, then gestures to the hut and crawls underneath it. Unseen by the soldier, En-Joo clamps a hand over her mouth and holds a finger to his lips. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. The soldier looks underneath the hut for the girl, and En-Joo dives towards him, plunging a knife into his throat and stabbing repeatedly. He drags the soldier's body out of sight. Rambo runs out to a hut and dives underneath it, seeing Sarah lying prone in the pig sty. He throws open a wooden bolt, opens a gate, and crawls inside. He looks out through the timbers and sees the soldier with the bottle of spirits returning. Sarah is asleep or unconscious, and Rambo rushes over to the partition between them, pushing pigs out of the way. En-Joo checks his watch—10 seconds to 2. On the watch tower, School Boy has a soldier in the site of his weapon, and his watch shows 2 AM. He fires, starting by picking off the guard below and the guards in two adjacent watch towers. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards.",
    "3": "The soldier with the dancing girl drags her towards his hut, and she struggles. He slaps her, causing her to fall to the ground, then gestures to the hut and crawls underneath it. Unseen by the soldier, En-Joo clamps a hand over her mouth and holds a finger to his lips. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. The soldier looks underneath the hut for the girl, and En-Joo dives towards him, plunging a knife into his throat and stabbing repeatedly. He drags the soldier's body out of sight. Rambo runs out to a hut and dives underneath it, seeing Sarah lying prone in the pig sty. He throws open a wooden bolt, opens a gate, and crawls inside. He looks out through the timbers and sees the soldier with the bottle of spirits returning. Sarah is asleep or unconscious, and Rambo rushes over to the partition between them, pushing pigs out of the way. En-Joo checks his watch—10 seconds to 2. On the watch tower, School Boy has a soldier in the site of his weapon, and his watch shows 2 AM. He fires, starting by picking off the guard below and the guards in two adjacent watch towers. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards.",
    "4": "The soldier with the dancing girl drags her towards his hut, and she struggles. He slaps her, causing her to fall to the ground, then gestures to the hut and crawls underneath it. Unseen by the soldier, En-Joo clamps a hand over her mouth and holds a finger to his lips. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. The soldier looks underneath the hut for the girl, and En-Joo dives towards him, plunging a knife into his throat and stabbing repeatedly. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. He drags the soldier's body out of sight. Rambo runs out to a hut and dives underneath it, seeing Sarah lying prone in the pig sty. He throws open a wooden bolt, opens a gate, and crawls inside. He looks out through the timbers and sees the soldier with the bottle of spirits returning. Sarah is asleep or unconscious, and Rambo rushes over to the partition between them, pushing pigs out of the way. En-Joo checks his watch—10 seconds to 2. On the watch tower, School Boy has a soldier in the site of his weapon, and his watch shows 2 AM. He fires, starting by picking off the guard below and the guards in two adjacent watch towers. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards.",
    "5": "The soldier with the dancing girl drags her towards his hut, and she struggles. He slaps her, causing her to fall to the ground, then gestures to the hut and crawls underneath it. Unseen by the soldier, En-Joo clamps a hand over her mouth and holds a finger to his lips. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. The soldier looks underneath the hut for the girl, and En-Joo dives towards him, plunging a knife into his throat and stabbing repeatedly. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. He drags the soldier's body out of sight. Rambo runs out to a hut and dives underneath it, seeing Sarah lying prone in the pig sty. He throws open a wooden bolt, opens a gate, and crawls inside. He looks out through the timbers and sees the soldier with the bottle of spirits returning. Sarah is asleep or unconscious, and Rambo rushes over to the partition between them, pushing pigs out of the way. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. En-Joo checks his watch—10 seconds to 2. On the watch tower, School Boy has a soldier in the site of his weapon, and his watch shows 2 AM. He fires, starting by picking off the guard below and the guards in two adjacent watch towers. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards.",
    "6": "The soldier with the dancing girl drags her towards his hut, and she struggles. He slaps her, causing her to fall to the ground, then gestures to the hut and crawls underneath it. Unseen by the soldier, En-Joo clamps a hand over her mouth and holds a finger to his lips. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. The soldier looks underneath the hut for the girl, and En-Joo dives towards him, plunging a knife into his throat and stabbing repeatedly. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. He drags the soldier's body out of sight. Rambo runs out to a hut and dives underneath it, seeing Sarah lying prone in the pig sty. He throws open a wooden bolt, opens a gate, and crawls inside. He looks out through the timbers and sees the soldier with the bottle of spirits returning. Sarah is asleep or unconscious, and Rambo rushes over to the partition between them, pushing pigs out of the way. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. En-Joo checks his watch—10 seconds to 2. On the watch tower, School Boy has a soldier in the site of his weapon, and his watch shows 2 AM. He fires, starting by picking off the guard below and the guards in two adjacent watch towers. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards.",
    "7": "The soldier with the dancing girl drags her towards his hut, and she struggles. He slaps her, causing her to fall to the ground, then gestures to the hut and crawls underneath it. Unseen by the soldier, En-Joo clamps a hand over her mouth and holds a finger to his lips. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. The soldier looks underneath the hut for the girl, and En-Joo dives towards him, plunging a knife into his throat and stabbing repeatedly. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. He drags the soldier's body out of sight. Rambo runs out to a hut and dives underneath it, seeing Sarah lying prone in the pig sty. He throws open a wooden bolt, opens a gate, and crawls inside. He looks out through the timbers and sees the soldier with the bottle of spirits returning. Sarah is asleep or unconscious, and Rambo rushes over to the partition between them, pushing pigs out of the way. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. En-Joo checks his watch—10 seconds to 2. On the watch tower, School Boy has a soldier in the site of his weapon, and his watch shows 2 AM. He fires, starting by picking off the guard below and the guards in two adjacent watch towers. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards.",
    "8": "The soldier with the dancing girl drags her towards his hut, and she struggles. He slaps her, causing her to fall to the ground, then gestures to the hut and crawls underneath it. Unseen by the soldier, En-Joo clamps a hand over her mouth and holds a finger to his lips. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. The soldier looks underneath the hut for the girl, and En-Joo dives towards him, plunging a knife into his throat and stabbing repeatedly. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. He drags the soldier's body out of sight. Rambo runs out to a hut and dives underneath it, seeing Sarah lying prone in the pig sty. He throws open a wooden bolt, opens a gate, and crawls inside. He looks out through the timbers and sees the soldier with the bottle of spirits returning. Sarah is asleep or unconscious, and Rambo rushes over to the partition between them, pushing pigs out of the way. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. En-Joo checks his watch—10 seconds to 2. On the watch tower, School Boy has a soldier in the site of his weapon, and his watch shows 2 AM. He fires, starting by picking off the guard below and the guards in two adjacent watch towers. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards.",
    "9": "The soldier with the dancing girl drags her towards his hut, and she struggles. He slaps her, causing her to fall to the ground, then gestures to the hut and crawls underneath it. Unseen by the soldier, En-Joo clamps a hand over her mouth and holds a finger to his lips. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. The soldier looks underneath the hut for the girl, and En-Joo dives towards him, plunging a knife into his throat and stabbing repeatedly. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. He drags the soldier's body out of sight. Rambo runs out to a hut and dives underneath it, seeing Sarah lying prone in the pig sty. He throws open a wooden bolt, opens a gate, and crawls inside. He looks out through the timbers and sees the soldier with the bottle of spirits returning. Sarah is asleep or unconscious, and Rambo rushes over to the partition between them, pushing pigs out of the way. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. En-Joo checks his watch—10 seconds to 2. On the watch tower, School Boy has a soldier in the site of his weapon, and his watch shows 2 AM. He fires, starting by picking off the guard below and the guards in two adjacent watch towers. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards.",
    "10": "The soldier with the dancing girl drags her towards his hut, and she struggles. He slaps her, causing her to fall to the ground, then gestures to the hut and crawls underneath it. Unseen by the soldier, En-Joo clamps a hand over her mouth and holds a finger to his lips. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. In a futuristic space station orbiting a distant planet, an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat, pushing the limits of human endurance. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. The soldier looks underneath the hut for the girl, and En-Joo dives towards him, plunging a knife into his throat and stabbing repeatedly. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. He drags the soldier's body out of sight. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Rambo runs out to a hut and dives underneath it, seeing Sarah lying prone in the pig sty. He throws open a wooden bolt, opens a gate, and crawls inside. He looks out through the timbers and sees the soldier with the bottle of spirits returning. Sarah is asleep or unconscious, and Rambo rushes over to the partition between them, pushing pigs out of the way. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. En-Joo checks his watch—10 seconds to 2. On the watch tower, School Boy has a soldier in the site of his weapon, and his watch shows 2 AM. He fires, starting by picking off the guard below and the guards in two adjacent watch towers. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards."
  }
}