{
  "ground_truth": "Jordan gives Nick a bemused look and goes in search of Gatsby. as Nick stands frowning captivated by the dazzling firework display unfolding before everyone else. From his upstairs window Gatsby watches reflecting sparkles in the glass as fireworks shoot up into the night sky like a thousand silver stars while Jordan glides across the confetticovered dance floor and ascends the stairs. As she walks through double doors at the top of the stairs Nick continues to frown his back turned to the fireworks while Gatsby stands at the window smiling benignly and smoking a cigarette. Nick eventually turns to look at the spectacular display observing as twinkling specks of light drift down like snowflakes and shimmering golden flakes flow from a giant champagne bottle floating down on guests who are relaxing in a lounge with cushions scattered on the floor. Nick lies back looking dreamy and gazes up at the photos and paintings on the walls. As a barman clears up Nick stands and looks around thoughtfully noticing a woman draped across the piano. Jordan appears with Teddy in tow and they are driven away as Gatsby watches from the top of the steps pressing his lips together thoughtfully. He then smiles politely and leaves as people cavort by the fountain. As Jordan is driven by she stands up and waves prompting Nick to smile and wave back. Nick walks along the dimly lit driveway to his cottage stopping to look back at Gatsby's mansion. Watching from the upstairs window Gatsby lowers a telephone and waves with Nick waving back.",
  "iterations": {
    "1": "Jordan gives Nick a bemused look and goes in search of Gatsby. as Nick stands frowning captivated by the dazzling firework display unfolding before everyone else. From his upstairs window Gatsby watches reflecting sparkles in the glass as fireworks shoot up into the night sky like a thousand silver stars while Jordan glides across the confetticovered dance floor and ascends the stairs. As she walks through double doors at the top of the stairs Nick continues to frown his back turned to the fireworks while Gatsby stands at the window smiling benignly and smoking a cigarette. Nick eventually turns to look at the spectacular display observing as twinkling specks of light drift down like snowflakes and shimmering golden flakes flow from a giant champagne bottle floating down on guests who are relaxing in a lounge with cushions scattered on the floor. Nick lies back looking dreamy and gazes up at the photos and paintings on the walls. As a barman clears up Nick stands and looks around thoughtfully noticing a woman draped across the piano. Jordan appears with Teddy in tow and they are driven away as Gatsby watches from the top of the steps pressing his lips together thoughtfully. He then smiles politely and leaves as people cavort by the fountain. As Jordan is driven by she stands up and waves prompting Nick to smile and wave back. Nick walks along the dimly lit driveway to his cottage stopping to look back at Gatsby's mansion. Watching from the upstairs window Gatsby lowers a telephone and waves with Nick waving back.",
    "2": "as Nick stands frowning captivated by the dazzling firework display unfolding before everyone else. From his upstairs window Gatsby watches reflecting sparkles in the glass as fireworks shoot up into the night sky like a thousand silver stars while Jordan glides across the confetticovered dance floor and ascends the stairs. As she walks through double doors at the top of the stairs Nick continues to frown his back turned to the fireworks while Gatsby stands at the window smiling benignly and smoking a cigarette. Nick eventually turns to look at the spectacular display observing as twinkling specks of light drift down like snowflakes and shimmering golden flakes flow from a giant champagne bottle floating down on guests who are relaxing in a lounge with cushions scattered on the floor. Nick lies back looking dreamy and gazes up at the photos and paintings on the walls. As a barman clears up Nick stands and looks around thoughtfully noticing a woman draped across the piano. Jordan appears with Teddy in tow and they are driven away as Gatsby watches from the top of the steps pressing his lips together thoughtfully. He then smiles politely and leaves as people cavort by the fountain. As Jordan is driven by she stands up and waves prompting Nick to smile and wave back. Nick walks along the dimly lit driveway to his cottage stopping to look back at Gatsby's mansion. Watching from the upstairs window Gatsby lowers a telephone and waves with Nick waving back. Jordan gives Nick a bemused look and goes in search of Gatsby.",
    "3": "From his upstairs window Gatsby watches reflecting sparkles in the glass as fireworks shoot up into the night sky like a thousand silver stars while Jordan glides across the confetticovered dance floor and ascends the stairs. As she walks through double doors at the top of the stairs Nick continues to frown his back turned to the fireworks while Gatsby stands at the window smiling benignly and smoking a cigarette. Nick eventually turns to look at the spectacular display observing as twinkling specks of light drift down like snowflakes and shimmering golden flakes flow from a giant champagne bottle floating down on guests who are relaxing in a lounge with cushions scattered on the floor. Nick lies back looking dreamy and gazes up at the photos and paintings on the walls. As a barman clears up Nick stands and looks around thoughtfully noticing a woman draped across the piano. Jordan appears with Teddy in tow and they are driven away as Gatsby watches from the top of the steps pressing his lips together thoughtfully. He then smiles politely and leaves as people cavort by the fountain. As Jordan is driven by she stands up and waves prompting Nick to smile and wave back. Nick walks along the dimly lit driveway to his cottage stopping to look back at Gatsby's mansion. Watching from the upstairs window Gatsby lowers a telephone and waves with Nick waving back. Jordan gives Nick a bemused look and goes in search of Gatsby. as Nick stands frowning captivated by the dazzling firework display unfolding before everyone else.",
    "4": "As she walks through double doors at the top of the stairs Nick continues to frown his back turned to the fireworks while Gatsby stands at the window smiling benignly and smoking a cigarette. Nick eventually turns to look at the spectacular display observing as twinkling specks of light drift down like snowflakes and shimmering golden flakes flow from a giant champagne bottle floating down on guests who are relaxing in a lounge with cushions scattered on the floor. Nick lies back looking dreamy and gazes up at the photos and paintings on the walls. As a barman clears up Nick stands and looks around thoughtfully noticing a woman draped across the piano. Jordan appears with Teddy in tow and they are driven away as Gatsby watches from the top of the steps pressing his lips together thoughtfully. He then smiles politely and leaves as people cavort by the fountain. As Jordan is driven by she stands up and waves prompting Nick to smile and wave back. Nick walks along the dimly lit driveway to his cottage stopping to look back at Gatsby's mansion. Watching from the upstairs window Gatsby lowers a telephone and waves with Nick waving back. Jordan gives Nick a bemused look and goes in search of Gatsby. as Nick stands frowning captivated by the dazzling firework display unfolding before everyone else. From his upstairs window Gatsby watches reflecting sparkles in the glass as fireworks shoot up into the night sky like a thousand silver stars while Jordan glides across the confetticovered dance floor and ascends the stairs.",
    "5": "Nick eventually turns to look at the spectacular display observing as twinkling specks of light drift down like snowflakes and shimmering golden flakes flow from a giant champagne bottle floating down on guests who are relaxing in a lounge with cushions scattered on the floor. Nick lies back looking dreamy and gazes up at the photos and paintings on the walls. As a barman clears up Nick stands and looks around thoughtfully noticing a woman draped across the piano. Jordan appears with Teddy in tow and they are driven away as Gatsby watches from the top of the steps pressing his lips together thoughtfully. He then smiles politely and leaves as people cavort by the fountain. As Jordan is driven by she stands up and waves prompting Nick to smile and wave back. Nick walks along the dimly lit driveway to his cottage stopping to look back at Gatsby's mansion. Watching from the upstairs window Gatsby lowers a telephone and waves with Nick waving back. Jordan gives Nick a bemused look and goes in search of Gatsby. as Nick stands frowning captivated by the dazzling firework display unfolding before everyone else. From his upstairs window Gatsby watches reflecting sparkles in the glass as fireworks shoot up into the night sky like a thousand silver stars while Jordan glides across the confetticovered dance floor and ascends the stairs. As she walks through double doors at the top of the stairs Nick continues to frown his back turned to the fireworks while Gatsby stands at the window smiling benignly and smoking a cigarette.",
    "6": "Nick lies back looking dreamy and gazes up at the photos and paintings on the walls. As a barman clears up Nick stands and looks around thoughtfully noticing a woman draped across the piano. Jordan appears with Teddy in tow and they are driven away as Gatsby watches from the top of the steps pressing his lips together thoughtfully. He then smiles politely and leaves as people cavort by the fountain. As Jordan is driven by she stands up and waves prompting Nick to smile and wave back. Nick walks along the dimly lit driveway to his cottage stopping to look back at Gatsby's mansion. Watching from the upstairs window Gatsby lowers a telephone and waves with Nick waving back. Jordan gives Nick a bemused look and goes in search of Gatsby. as Nick stands frowning captivated by the dazzling firework display unfolding before everyone else. From his upstairs window Gatsby watches reflecting sparkles in the glass as fireworks shoot up into the night sky like a thousand silver stars while Jordan glides across the confetticovered dance floor and ascends the stairs. As she walks through double doors at the top of the stairs Nick continues to frown his back turned to the fireworks while Gatsby stands at the window smiling benignly and smoking a cigarette. Nick eventually turns to look at the spectacular display observing as twinkling specks of light drift down like snowflakes and shimmering golden flakes flow from a giant champagne bottle floating down on guests who are relaxing in a lounge with cushions scattered on the floor.",
    "7": "As a barman clears up Nick stands and looks around thoughtfully noticing a woman draped across the piano. Jordan appears with Teddy in tow and they are driven away as Gatsby watches from the top of the steps pressing his lips together thoughtfully. He then smiles politely and leaves as people cavort by the fountain. As Jordan is driven by she stands up and waves prompting Nick to smile and wave back. Nick walks along the dimly lit driveway to his cottage stopping to look back at Gatsby's mansion. Watching from the upstairs window Gatsby lowers a telephone and waves with Nick waving back. Jordan gives Nick a bemused look and goes in search of Gatsby. as Nick stands frowning captivated by the dazzling firework display unfolding before everyone else. From his upstairs window Gatsby watches reflecting sparkles in the glass as fireworks shoot up into the night sky like a thousand silver stars while Jordan glides across the confetticovered dance floor and ascends the stairs. As she walks through double doors at the top of the stairs Nick continues to frown his back turned to the fireworks while Gatsby stands at the window smiling benignly and smoking a cigarette. Nick eventually turns to look at the spectacular display observing as twinkling specks of light drift down like snowflakes and shimmering golden flakes flow from a giant champagne bottle floating down on guests who are relaxing in a lounge with cushions scattered on the floor. Nick lies back looking dreamy and gazes up at the photos and paintings on the walls.",
    "8": "Jordan appears with Teddy in tow and they are driven away as Gatsby watches from the top of the steps pressing his lips together thoughtfully. He then smiles politely and leaves as people cavort by the fountain. As Jordan is driven by she stands up and waves prompting Nick to smile and wave back. Nick walks along the dimly lit driveway to his cottage stopping to look back at Gatsby's mansion. Watching from the upstairs window Gatsby lowers a telephone and waves with Nick waving back. Jordan gives Nick a bemused look and goes in search of Gatsby. as Nick stands frowning captivated by the dazzling firework display unfolding before everyone else. From his upstairs window Gatsby watches reflecting sparkles in the glass as fireworks shoot up into the night sky like a thousand silver stars while Jordan glides across the confetticovered dance floor and ascends the stairs. As she walks through double doors at the top of the stairs Nick continues to frown his back turned to the fireworks while Gatsby stands at the window smiling benignly and smoking a cigarette. Nick eventually turns to look at the spectacular display observing as twinkling specks of light drift down like snowflakes and shimmering golden flakes flow from a giant champagne bottle floating down on guests who are relaxing in a lounge with cushions scattered on the floor. Nick lies back looking dreamy and gazes up at the photos and paintings on the walls. As a barman clears up Nick stands and looks around thoughtfully noticing a woman draped across the piano.",
    "9": "He then smiles politely and leaves as people cavort by the fountain. As Jordan is driven by she stands up and waves prompting Nick to smile and wave back. Nick walks along the dimly lit driveway to his cottage stopping to look back at Gatsby's mansion. Watching from the upstairs window Gatsby lowers a telephone and waves with Nick waving back. Jordan gives Nick a bemused look and goes in search of Gatsby. as Nick stands frowning captivated by the dazzling firework display unfolding before everyone else. From his upstairs window Gatsby watches reflecting sparkles in the glass as fireworks shoot up into the night sky like a thousand silver stars while Jordan glides across the confetticovered dance floor and ascends the stairs. As she walks through double doors at the top of the stairs Nick continues to frown his back turned to the fireworks while Gatsby stands at the window smiling benignly and smoking a cigarette. Nick eventually turns to look at the spectacular display observing as twinkling specks of light drift down like snowflakes and shimmering golden flakes flow from a giant champagne bottle floating down on guests who are relaxing in a lounge with cushions scattered on the floor. Nick lies back looking dreamy and gazes up at the photos and paintings on the walls. As a barman clears up Nick stands and looks around thoughtfully noticing a woman draped across the piano. Jordan appears with Teddy in tow and they are driven away as Gatsby watches from the top of the steps pressing his lips together thoughtfully.",
    "10": "As Jordan is driven by she stands up and waves prompting Nick to smile and wave back. Nick walks along the dimly lit driveway to his cottage stopping to look back at Gatsby's mansion. Watching from the upstairs window Gatsby lowers a telephone and waves with Nick waving back. Jordan gives Nick a bemused look and goes in search of Gatsby. as Nick stands frowning captivated by the dazzling firework display unfolding before everyone else. From his upstairs window Gatsby watches reflecting sparkles in the glass as fireworks shoot up into the night sky like a thousand silver stars while Jordan glides across the confetticovered dance floor and ascends the stairs. As she walks through double doors at the top of the stairs Nick continues to frown his back turned to the fireworks while Gatsby stands at the window smiling benignly and smoking a cigarette. Nick eventually turns to look at the spectacular display observing as twinkling specks of light drift down like snowflakes and shimmering golden flakes flow from a giant champagne bottle floating down on guests who are relaxing in a lounge with cushions scattered on the floor. Nick lies back looking dreamy and gazes up at the photos and paintings on the walls. As a barman clears up Nick stands and looks around thoughtfully noticing a woman draped across the piano. Jordan appears with Teddy in tow and they are driven away as Gatsby watches from the top of the steps pressing his lips together thoughtfully. He then smiles politely and leaves as people cavort by the fountain.",
    "11": "Nick walks along the dimly lit driveway to his cottage stopping to look back at Gatsby's mansion. Watching from the upstairs window Gatsby lowers a telephone and waves with Nick waving back. Jordan gives Nick a bemused look and goes in search of Gatsby. as Nick stands frowning captivated by the dazzling firework display unfolding before everyone else. From his upstairs window Gatsby watches reflecting sparkles in the glass as fireworks shoot up into the night sky like a thousand silver stars while Jordan glides across the confetticovered dance floor and ascends the stairs. As she walks through double doors at the top of the stairs Nick continues to frown his back turned to the fireworks while Gatsby stands at the window smiling benignly and smoking a cigarette. Nick eventually turns to look at the spectacular display observing as twinkling specks of light drift down like snowflakes and shimmering golden flakes flow from a giant champagne bottle floating down on guests who are relaxing in a lounge with cushions scattered on the floor. Nick lies back looking dreamy and gazes up at the photos and paintings on the walls. As a barman clears up Nick stands and looks around thoughtfully noticing a woman draped across the piano. Jordan appears with Teddy in tow and they are driven away as Gatsby watches from the top of the steps pressing his lips together thoughtfully. He then smiles politely and leaves as people cavort by the fountain. As Jordan is driven by she stands up and waves prompting Nick to smile and wave back.",
    "12": "Watching from the upstairs window Gatsby lowers a telephone and waves with Nick waving back. Jordan gives Nick a bemused look and goes in search of Gatsby. as Nick stands frowning captivated by the dazzling firework display unfolding before everyone else. From his upstairs window Gatsby watches reflecting sparkles in the glass as fireworks shoot up into the night sky like a thousand silver stars while Jordan glides across the confetticovered dance floor and ascends the stairs. As she walks through double doors at the top of the stairs Nick continues to frown his back turned to the fireworks while Gatsby stands at the window smiling benignly and smoking a cigarette. Nick eventually turns to look at the spectacular display observing as twinkling specks of light drift down like snowflakes and shimmering golden flakes flow from a giant champagne bottle floating down on guests who are relaxing in a lounge with cushions scattered on the floor. Nick lies back looking dreamy and gazes up at the photos and paintings on the walls. As a barman clears up Nick stands and looks around thoughtfully noticing a woman draped across the piano. Jordan appears with Teddy in tow and they are driven away as Gatsby watches from the top of the steps pressing his lips together thoughtfully. He then smiles politely and leaves as people cavort by the fountain. As Jordan is driven by she stands up and waves prompting Nick to smile and wave back. Nick walks along the dimly lit driveway to his cottage stopping to look back at Gatsby's mansion.",
    "13": "Jordan gives Nick a bemused look and goes in search of Gatsby. as Nick stands frowning captivated by the dazzling firework display unfolding before everyone else. From his upstairs window Gatsby watches reflecting sparkles in the glass as fireworks shoot up into the night sky like a thousand silver stars while Jordan glides across the confetticovered dance floor and ascends the stairs. As she walks through double doors at the top of the stairs Nick continues to frown his back turned to the fireworks while Gatsby stands at the window smiling benignly and smoking a cigarette. Nick eventually turns to look at the spectacular display observing as twinkling specks of light drift down like snowflakes and shimmering golden flakes flow from a giant champagne bottle floating down on guests who are relaxing in a lounge with cushions scattered on the floor. Nick lies back looking dreamy and gazes up at the photos and paintings on the walls. As a barman clears up Nick stands and looks around thoughtfully noticing a woman draped across the piano. Jordan appears with Teddy in tow and they are driven away as Gatsby watches from the top of the steps pressing his lips together thoughtfully. He then smiles politely and leaves as people cavort by the fountain. As Jordan is driven by she stands up and waves prompting Nick to smile and wave back. Nick walks along the dimly lit driveway to his cottage stopping to look back at Gatsby's mansion. Watching from the upstairs window Gatsby lowers a telephone and waves with Nick waving back."
  }
}