{
  "ground_truth": "Gatsby notices Nick watching him and checks himself and at the sound of the organ Gatsby smiles. Nick and Daisy smile as Gatsby gestures towards the ballroom where Klipspringer a wildhaired young man with glasses plays the organ. Gatsby reclines on cushions while Nick and Daisy dance in the ballroom lit by hundreds of candles. Daisy spins around to face Nick and they shimmy back and forth. As Gatsby watches he remembers some time before in uniform dancing with Daisy and kissing her. He looks grave as he remembers being in battle while rain pours down on the terrace and the narrow dock that juts out into the bay. Across the water the green light gently pulses through the mist. Klipspringer sleeps on the organ keys as Nick sits on the stairs having a drink and Daisy and Gatsby slow dance together. Nick walks over to them while they gently sway and then leaves them. Daisy gazes at Gatsby lovingly and he kisses her and rests his cheek against hers as Nick watches them with a grave serious expression. Extravagantly dressed guests go wild at one of Gatsby's parties where they drink dance and splash about in the ornamental pool while Gatsby smiles politely and walks through the party with Nick. Gatsby takes Daisy's arm and Tom walks with Nick.",
  "iterations": {
    "1": "Gatsby notices Nick watching him and checks himself and at the sound of the organ Gatsby smiles. Nick and Daisy smile as Gatsby gestures towards the ballroom where Klipspringer a wildhaired young man with glasses plays the organ. Gatsby reclines on cushions while Nick and Daisy dance in the ballroom lit by hundreds of candles. Daisy spins around to face Nick and they shimmy back and forth. As Gatsby watches he remembers some time before in uniform dancing with Daisy and kissing her. He looks grave as he remembers being in battle while rain pours down on the terrace and the narrow dock that juts out into the bay. Across the water the green light gently pulses through the mist. Klipspringer sleeps on the organ keys as Nick sits on the stairs having a drink and Daisy and Gatsby slow dance together. Nick walks over to them while they gently sway and then leaves them. Daisy gazes at Gatsby lovingly and he kisses her and rests his cheek against hers as Nick watches them with a grave serious expression. Extravagantly dressed guests go wild at one of Gatsby's parties where they drink dance and splash about in the ornamental pool while Gatsby smiles politely and walks through the party with Nick. Gatsby takes Daisy's arm and Tom walks with Nick.",
    "2": "Nick and Daisy smile as Gatsby gestures towards the ballroom where Klipspringer a wildhaired young man with glasses plays the organ. Gatsby reclines on cushions while Nick and Daisy dance in the ballroom lit by hundreds of candles. Daisy spins around to face Nick and they shimmy back and forth. As Gatsby watches he remembers some time before in uniform dancing with Daisy and kissing her. He looks grave as he remembers being in battle while rain pours down on the terrace and the narrow dock that juts out into the bay. Across the water the green light gently pulses through the mist. Klipspringer sleeps on the organ keys as Nick sits on the stairs having a drink and Daisy and Gatsby slow dance together. Nick walks over to them while they gently sway and then leaves them. Daisy gazes at Gatsby lovingly and he kisses her and rests his cheek against hers as Nick watches them with a grave serious expression. Extravagantly dressed guests go wild at one of Gatsby's parties where they drink dance and splash about in the ornamental pool while Gatsby smiles politely and walks through the party with Nick. Gatsby takes Daisy's arm and Tom walks with Nick. Gatsby notices Nick watching him and checks himself and at the sound of the organ Gatsby smiles.",
    "3": "Gatsby reclines on cushions while Nick and Daisy dance in the ballroom lit by hundreds of candles. Daisy spins around to face Nick and they shimmy back and forth. As Gatsby watches he remembers some time before in uniform dancing with Daisy and kissing her. He looks grave as he remembers being in battle while rain pours down on the terrace and the narrow dock that juts out into the bay. Across the water the green light gently pulses through the mist. Klipspringer sleeps on the organ keys as Nick sits on the stairs having a drink and Daisy and Gatsby slow dance together. Nick walks over to them while they gently sway and then leaves them. Daisy gazes at Gatsby lovingly and he kisses her and rests his cheek against hers as Nick watches them with a grave serious expression. Extravagantly dressed guests go wild at one of Gatsby's parties where they drink dance and splash about in the ornamental pool while Gatsby smiles politely and walks through the party with Nick. Gatsby takes Daisy's arm and Tom walks with Nick. Gatsby notices Nick watching him and checks himself and at the sound of the organ Gatsby smiles. Nick and Daisy smile as Gatsby gestures towards the ballroom where Klipspringer a wildhaired young man with glasses plays the organ.",
    "4": "Daisy spins around to face Nick and they shimmy back and forth. As Gatsby watches he remembers some time before in uniform dancing with Daisy and kissing her. He looks grave as he remembers being in battle while rain pours down on the terrace and the narrow dock that juts out into the bay. Across the water the green light gently pulses through the mist. Klipspringer sleeps on the organ keys as Nick sits on the stairs having a drink and Daisy and Gatsby slow dance together. Nick walks over to them while they gently sway and then leaves them. Daisy gazes at Gatsby lovingly and he kisses her and rests his cheek against hers as Nick watches them with a grave serious expression. Extravagantly dressed guests go wild at one of Gatsby's parties where they drink dance and splash about in the ornamental pool while Gatsby smiles politely and walks through the party with Nick. Gatsby takes Daisy's arm and Tom walks with Nick. Gatsby notices Nick watching him and checks himself and at the sound of the organ Gatsby smiles. Nick and Daisy smile as Gatsby gestures towards the ballroom where Klipspringer a wildhaired young man with glasses plays the organ. Gatsby reclines on cushions while Nick and Daisy dance in the ballroom lit by hundreds of candles.",
    "5": "As Gatsby watches he remembers some time before in uniform dancing with Daisy and kissing her. He looks grave as he remembers being in battle while rain pours down on the terrace and the narrow dock that juts out into the bay. Across the water the green light gently pulses through the mist. Klipspringer sleeps on the organ keys as Nick sits on the stairs having a drink and Daisy and Gatsby slow dance together. Nick walks over to them while they gently sway and then leaves them. Daisy gazes at Gatsby lovingly and he kisses her and rests his cheek against hers as Nick watches them with a grave serious expression. Extravagantly dressed guests go wild at one of Gatsby's parties where they drink dance and splash about in the ornamental pool while Gatsby smiles politely and walks through the party with Nick. Gatsby takes Daisy's arm and Tom walks with Nick. Gatsby notices Nick watching him and checks himself and at the sound of the organ Gatsby smiles. Nick and Daisy smile as Gatsby gestures towards the ballroom where Klipspringer a wildhaired young man with glasses plays the organ. Gatsby reclines on cushions while Nick and Daisy dance in the ballroom lit by hundreds of candles. Daisy spins around to face Nick and they shimmy back and forth.",
    "6": "He looks grave as he remembers being in battle while rain pours down on the terrace and the narrow dock that juts out into the bay. Across the water the green light gently pulses through the mist. Klipspringer sleeps on the organ keys as Nick sits on the stairs having a drink and Daisy and Gatsby slow dance together. Nick walks over to them while they gently sway and then leaves them. Daisy gazes at Gatsby lovingly and he kisses her and rests his cheek against hers as Nick watches them with a grave serious expression. Extravagantly dressed guests go wild at one of Gatsby's parties where they drink dance and splash about in the ornamental pool while Gatsby smiles politely and walks through the party with Nick. Gatsby takes Daisy's arm and Tom walks with Nick. Gatsby notices Nick watching him and checks himself and at the sound of the organ Gatsby smiles. Nick and Daisy smile as Gatsby gestures towards the ballroom where Klipspringer a wildhaired young man with glasses plays the organ. Gatsby reclines on cushions while Nick and Daisy dance in the ballroom lit by hundreds of candles. Daisy spins around to face Nick and they shimmy back and forth. As Gatsby watches he remembers some time before in uniform dancing with Daisy and kissing her.",
    "7": "Across the water the green light gently pulses through the mist. Klipspringer sleeps on the organ keys as Nick sits on the stairs having a drink and Daisy and Gatsby slow dance together. Nick walks over to them while they gently sway and then leaves them. Daisy gazes at Gatsby lovingly and he kisses her and rests his cheek against hers as Nick watches them with a grave serious expression. Extravagantly dressed guests go wild at one of Gatsby's parties where they drink dance and splash about in the ornamental pool while Gatsby smiles politely and walks through the party with Nick. Gatsby takes Daisy's arm and Tom walks with Nick. Gatsby notices Nick watching him and checks himself and at the sound of the organ Gatsby smiles. Nick and Daisy smile as Gatsby gestures towards the ballroom where Klipspringer a wildhaired young man with glasses plays the organ. Gatsby reclines on cushions while Nick and Daisy dance in the ballroom lit by hundreds of candles. Daisy spins around to face Nick and they shimmy back and forth. As Gatsby watches he remembers some time before in uniform dancing with Daisy and kissing her. He looks grave as he remembers being in battle while rain pours down on the terrace and the narrow dock that juts out into the bay.",
    "8": "Klipspringer sleeps on the organ keys as Nick sits on the stairs having a drink and Daisy and Gatsby slow dance together. Nick walks over to them while they gently sway and then leaves them. Daisy gazes at Gatsby lovingly and he kisses her and rests his cheek against hers as Nick watches them with a grave serious expression. Extravagantly dressed guests go wild at one of Gatsby's parties where they drink dance and splash about in the ornamental pool while Gatsby smiles politely and walks through the party with Nick. Gatsby takes Daisy's arm and Tom walks with Nick. Gatsby notices Nick watching him and checks himself and at the sound of the organ Gatsby smiles. Nick and Daisy smile as Gatsby gestures towards the ballroom where Klipspringer a wildhaired young man with glasses plays the organ. Gatsby reclines on cushions while Nick and Daisy dance in the ballroom lit by hundreds of candles. Daisy spins around to face Nick and they shimmy back and forth. As Gatsby watches he remembers some time before in uniform dancing with Daisy and kissing her. He looks grave as he remembers being in battle while rain pours down on the terrace and the narrow dock that juts out into the bay. Across the water the green light gently pulses through the mist.",
    "9": "Nick walks over to them while they gently sway and then leaves them. Daisy gazes at Gatsby lovingly and he kisses her and rests his cheek against hers as Nick watches them with a grave serious expression. Extravagantly dressed guests go wild at one of Gatsby's parties where they drink dance and splash about in the ornamental pool while Gatsby smiles politely and walks through the party with Nick. Gatsby takes Daisy's arm and Tom walks with Nick. Gatsby notices Nick watching him and checks himself and at the sound of the organ Gatsby smiles. Nick and Daisy smile as Gatsby gestures towards the ballroom where Klipspringer a wildhaired young man with glasses plays the organ. Gatsby reclines on cushions while Nick and Daisy dance in the ballroom lit by hundreds of candles. Daisy spins around to face Nick and they shimmy back and forth. As Gatsby watches he remembers some time before in uniform dancing with Daisy and kissing her. He looks grave as he remembers being in battle while rain pours down on the terrace and the narrow dock that juts out into the bay. Across the water the green light gently pulses through the mist. Klipspringer sleeps on the organ keys as Nick sits on the stairs having a drink and Daisy and Gatsby slow dance together.",
    "10": "Daisy gazes at Gatsby lovingly and he kisses her and rests his cheek against hers as Nick watches them with a grave serious expression. Extravagantly dressed guests go wild at one of Gatsby's parties where they drink dance and splash about in the ornamental pool while Gatsby smiles politely and walks through the party with Nick. Gatsby takes Daisy's arm and Tom walks with Nick. Gatsby notices Nick watching him and checks himself and at the sound of the organ Gatsby smiles. Nick and Daisy smile as Gatsby gestures towards the ballroom where Klipspringer a wildhaired young man with glasses plays the organ. Gatsby reclines on cushions while Nick and Daisy dance in the ballroom lit by hundreds of candles. Daisy spins around to face Nick and they shimmy back and forth. As Gatsby watches he remembers some time before in uniform dancing with Daisy and kissing her. He looks grave as he remembers being in battle while rain pours down on the terrace and the narrow dock that juts out into the bay. Across the water the green light gently pulses through the mist. Klipspringer sleeps on the organ keys as Nick sits on the stairs having a drink and Daisy and Gatsby slow dance together. Nick walks over to them while they gently sway and then leaves them.",
    "11": "Extravagantly dressed guests go wild at one of Gatsby's parties where they drink dance and splash about in the ornamental pool while Gatsby smiles politely and walks through the party with Nick. Gatsby takes Daisy's arm and Tom walks with Nick. Gatsby notices Nick watching him and checks himself and at the sound of the organ Gatsby smiles. Nick and Daisy smile as Gatsby gestures towards the ballroom where Klipspringer a wildhaired young man with glasses plays the organ. Gatsby reclines on cushions while Nick and Daisy dance in the ballroom lit by hundreds of candles. Daisy spins around to face Nick and they shimmy back and forth. As Gatsby watches he remembers some time before in uniform dancing with Daisy and kissing her. He looks grave as he remembers being in battle while rain pours down on the terrace and the narrow dock that juts out into the bay. Across the water the green light gently pulses through the mist. Klipspringer sleeps on the organ keys as Nick sits on the stairs having a drink and Daisy and Gatsby slow dance together. Nick walks over to them while they gently sway and then leaves them. Daisy gazes at Gatsby lovingly and he kisses her and rests his cheek against hers as Nick watches them with a grave serious expression.",
    "12": "Gatsby takes Daisy's arm and Tom walks with Nick. Gatsby notices Nick watching him and checks himself and at the sound of the organ Gatsby smiles. Nick and Daisy smile as Gatsby gestures towards the ballroom where Klipspringer a wildhaired young man with glasses plays the organ. Gatsby reclines on cushions while Nick and Daisy dance in the ballroom lit by hundreds of candles. Daisy spins around to face Nick and they shimmy back and forth. As Gatsby watches he remembers some time before in uniform dancing with Daisy and kissing her. He looks grave as he remembers being in battle while rain pours down on the terrace and the narrow dock that juts out into the bay. Across the water the green light gently pulses through the mist. Klipspringer sleeps on the organ keys as Nick sits on the stairs having a drink and Daisy and Gatsby slow dance together. Nick walks over to them while they gently sway and then leaves them. Daisy gazes at Gatsby lovingly and he kisses her and rests his cheek against hers as Nick watches them with a grave serious expression. Extravagantly dressed guests go wild at one of Gatsby's parties where they drink dance and splash about in the ornamental pool while Gatsby smiles politely and walks through the party with Nick.",
    "13": "Gatsby notices Nick watching him and checks himself and at the sound of the organ Gatsby smiles. Nick and Daisy smile as Gatsby gestures towards the ballroom where Klipspringer a wildhaired young man with glasses plays the organ. Gatsby reclines on cushions while Nick and Daisy dance in the ballroom lit by hundreds of candles. Daisy spins around to face Nick and they shimmy back and forth. As Gatsby watches he remembers some time before in uniform dancing with Daisy and kissing her. He looks grave as he remembers being in battle while rain pours down on the terrace and the narrow dock that juts out into the bay. Across the water the green light gently pulses through the mist. Klipspringer sleeps on the organ keys as Nick sits on the stairs having a drink and Daisy and Gatsby slow dance together. Nick walks over to them while they gently sway and then leaves them. Daisy gazes at Gatsby lovingly and he kisses her and rests his cheek against hers as Nick watches them with a grave serious expression. Extravagantly dressed guests go wild at one of Gatsby's parties where they drink dance and splash about in the ornamental pool while Gatsby smiles politely and walks through the party with Nick. Gatsby takes Daisy's arm and Tom walks with Nick."
  }
}