{
  "ground_truth": "Mike is hiding in the bushes as she turns to go and Colin grabs her arm pulls her close and gives her a lingering kiss while Mike stares openmouthed. Colin smiles at Abby and they go to their apartments which are opposite each other. Abby waves a giant foam hand that she picked up at the game. as Colin goes into his apartment. Abby runs along the path to Mike and gives him a hug then runs joyfully to her apartment as Mike walks off. On the show he is wearing a gorilla suit and a video screen behind Larry and Georgia shows monkeys having sex. while Abby and Joy watch a monitor. Mike’s nephew Joe is present and the gorilla suit is mentioned. Abby jumps up and down grinning as she steps out of her apartment. On the doormat is a gift bag which Abby picks up and looks around frowning. She takes an envelope out of the gift bag and goes back inside opening the card and taking a box from the gift bag. Inside the box is a pair of remotecontrolled vibrating briefs.",
  "iterations": {
    "1": "Mike is hiding in the bushes as she turns to go and Colin grabs her arm pulls her close and gives her a lingering kiss while Mike stares openmouthed. Colin smiles at Abby and they go to their apartments which are opposite each other. Abby waves a giant foam hand that she picked up at the game. as Colin goes into his apartment. Abby runs along the path to Mike and gives him a hug then runs joyfully to her apartment as Mike walks off. On the show he is wearing a gorilla suit and a video screen behind Larry and Georgia shows monkeys having sex. while Abby and Joy watch a monitor. Mike’s nephew Joe is present and the gorilla suit is mentioned. Abby jumps up and down grinning as she steps out of her apartment. On the doormat is a gift bag which Abby picks up and looks around frowning. She takes an envelope out of the gift bag and goes back inside opening the card and taking a box from the gift bag. Inside the box is a pair of remotecontrolled vibrating briefs.",
    "2": "Colin smiles at Abby and they go to their apartments which are opposite each other. Abby waves a giant foam hand that she picked up at the game. as Colin goes into his apartment. Abby runs along the path to Mike and gives him a hug then runs joyfully to her apartment as Mike walks off. On the show he is wearing a gorilla suit and a video screen behind Larry and Georgia shows monkeys having sex. while Abby and Joy watch a monitor. Mike’s nephew Joe is present and the gorilla suit is mentioned. Abby jumps up and down grinning as she steps out of her apartment. On the doormat is a gift bag which Abby picks up and looks around frowning. She takes an envelope out of the gift bag and goes back inside opening the card and taking a box from the gift bag. Inside the box is a pair of remotecontrolled vibrating briefs. Mike is hiding in the bushes as she turns to go and Colin grabs her arm pulls her close and gives her a lingering kiss while Mike stares openmouthed.",
    "3": "Abby waves a giant foam hand that she picked up at the game. as Colin goes into his apartment. Abby runs along the path to Mike and gives him a hug then runs joyfully to her apartment as Mike walks off. On the show he is wearing a gorilla suit and a video screen behind Larry and Georgia shows monkeys having sex. while Abby and Joy watch a monitor. Mike’s nephew Joe is present and the gorilla suit is mentioned. Abby jumps up and down grinning as she steps out of her apartment. On the doormat is a gift bag which Abby picks up and looks around frowning. She takes an envelope out of the gift bag and goes back inside opening the card and taking a box from the gift bag. Inside the box is a pair of remotecontrolled vibrating briefs. Mike is hiding in the bushes as she turns to go and Colin grabs her arm pulls her close and gives her a lingering kiss while Mike stares openmouthed. Colin smiles at Abby and they go to their apartments which are opposite each other.",
    "4": "as Colin goes into his apartment. Abby runs along the path to Mike and gives him a hug then runs joyfully to her apartment as Mike walks off. On the show he is wearing a gorilla suit and a video screen behind Larry and Georgia shows monkeys having sex. while Abby and Joy watch a monitor. Mike’s nephew Joe is present and the gorilla suit is mentioned. Abby jumps up and down grinning as she steps out of her apartment. On the doormat is a gift bag which Abby picks up and looks around frowning. She takes an envelope out of the gift bag and goes back inside opening the card and taking a box from the gift bag. Inside the box is a pair of remotecontrolled vibrating briefs. Mike is hiding in the bushes as she turns to go and Colin grabs her arm pulls her close and gives her a lingering kiss while Mike stares openmouthed. Colin smiles at Abby and they go to their apartments which are opposite each other. Abby waves a giant foam hand that she picked up at the game.",
    "5": "Abby runs along the path to Mike and gives him a hug then runs joyfully to her apartment as Mike walks off. On the show he is wearing a gorilla suit and a video screen behind Larry and Georgia shows monkeys having sex. while Abby and Joy watch a monitor. Mike’s nephew Joe is present and the gorilla suit is mentioned. Abby jumps up and down grinning as she steps out of her apartment. On the doormat is a gift bag which Abby picks up and looks around frowning. She takes an envelope out of the gift bag and goes back inside opening the card and taking a box from the gift bag. Inside the box is a pair of remotecontrolled vibrating briefs. Mike is hiding in the bushes as she turns to go and Colin grabs her arm pulls her close and gives her a lingering kiss while Mike stares openmouthed. Colin smiles at Abby and they go to their apartments which are opposite each other. Abby waves a giant foam hand that she picked up at the game. as Colin goes into his apartment.",
    "6": "On the show he is wearing a gorilla suit and a video screen behind Larry and Georgia shows monkeys having sex. while Abby and Joy watch a monitor. Mike’s nephew Joe is present and the gorilla suit is mentioned. Abby jumps up and down grinning as she steps out of her apartment. On the doormat is a gift bag which Abby picks up and looks around frowning. She takes an envelope out of the gift bag and goes back inside opening the card and taking a box from the gift bag. Inside the box is a pair of remotecontrolled vibrating briefs. Mike is hiding in the bushes as she turns to go and Colin grabs her arm pulls her close and gives her a lingering kiss while Mike stares openmouthed. Colin smiles at Abby and they go to their apartments which are opposite each other. Abby waves a giant foam hand that she picked up at the game. as Colin goes into his apartment. Abby runs along the path to Mike and gives him a hug then runs joyfully to her apartment as Mike walks off.",
    "7": "while Abby and Joy watch a monitor. Mike’s nephew Joe is present and the gorilla suit is mentioned. Abby jumps up and down grinning as she steps out of her apartment. On the doormat is a gift bag which Abby picks up and looks around frowning. She takes an envelope out of the gift bag and goes back inside opening the card and taking a box from the gift bag. Inside the box is a pair of remotecontrolled vibrating briefs. Mike is hiding in the bushes as she turns to go and Colin grabs her arm pulls her close and gives her a lingering kiss while Mike stares openmouthed. Colin smiles at Abby and they go to their apartments which are opposite each other. Abby waves a giant foam hand that she picked up at the game. as Colin goes into his apartment. Abby runs along the path to Mike and gives him a hug then runs joyfully to her apartment as Mike walks off. On the show he is wearing a gorilla suit and a video screen behind Larry and Georgia shows monkeys having sex.",
    "8": "Mike’s nephew Joe is present and the gorilla suit is mentioned. Abby jumps up and down grinning as she steps out of her apartment. On the doormat is a gift bag which Abby picks up and looks around frowning. She takes an envelope out of the gift bag and goes back inside opening the card and taking a box from the gift bag. Inside the box is a pair of remotecontrolled vibrating briefs. Mike is hiding in the bushes as she turns to go and Colin grabs her arm pulls her close and gives her a lingering kiss while Mike stares openmouthed. Colin smiles at Abby and they go to their apartments which are opposite each other. Abby waves a giant foam hand that she picked up at the game. as Colin goes into his apartment. Abby runs along the path to Mike and gives him a hug then runs joyfully to her apartment as Mike walks off. On the show he is wearing a gorilla suit and a video screen behind Larry and Georgia shows monkeys having sex. while Abby and Joy watch a monitor.",
    "9": "Abby jumps up and down grinning as she steps out of her apartment. On the doormat is a gift bag which Abby picks up and looks around frowning. She takes an envelope out of the gift bag and goes back inside opening the card and taking a box from the gift bag. Inside the box is a pair of remotecontrolled vibrating briefs. Mike is hiding in the bushes as she turns to go and Colin grabs her arm pulls her close and gives her a lingering kiss while Mike stares openmouthed. Colin smiles at Abby and they go to their apartments which are opposite each other. Abby waves a giant foam hand that she picked up at the game. as Colin goes into his apartment. Abby runs along the path to Mike and gives him a hug then runs joyfully to her apartment as Mike walks off. On the show he is wearing a gorilla suit and a video screen behind Larry and Georgia shows monkeys having sex. while Abby and Joy watch a monitor. Mike’s nephew Joe is present and the gorilla suit is mentioned.",
    "10": "On the doormat is a gift bag which Abby picks up and looks around frowning. She takes an envelope out of the gift bag and goes back inside opening the card and taking a box from the gift bag. Inside the box is a pair of remotecontrolled vibrating briefs. Mike is hiding in the bushes as she turns to go and Colin grabs her arm pulls her close and gives her a lingering kiss while Mike stares openmouthed. Colin smiles at Abby and they go to their apartments which are opposite each other. Abby waves a giant foam hand that she picked up at the game. as Colin goes into his apartment. Abby runs along the path to Mike and gives him a hug then runs joyfully to her apartment as Mike walks off. On the show he is wearing a gorilla suit and a video screen behind Larry and Georgia shows monkeys having sex. while Abby and Joy watch a monitor. Mike’s nephew Joe is present and the gorilla suit is mentioned. Abby jumps up and down grinning as she steps out of her apartment.",
    "11": "She takes an envelope out of the gift bag and goes back inside opening the card and taking a box from the gift bag. Inside the box is a pair of remotecontrolled vibrating briefs. Mike is hiding in the bushes as she turns to go and Colin grabs her arm pulls her close and gives her a lingering kiss while Mike stares openmouthed. Colin smiles at Abby and they go to their apartments which are opposite each other. Abby waves a giant foam hand that she picked up at the game. as Colin goes into his apartment. Abby runs along the path to Mike and gives him a hug then runs joyfully to her apartment as Mike walks off. On the show he is wearing a gorilla suit and a video screen behind Larry and Georgia shows monkeys having sex. while Abby and Joy watch a monitor. Mike’s nephew Joe is present and the gorilla suit is mentioned. Abby jumps up and down grinning as she steps out of her apartment. On the doormat is a gift bag which Abby picks up and looks around frowning.",
    "12": "Inside the box is a pair of remotecontrolled vibrating briefs. Mike is hiding in the bushes as she turns to go and Colin grabs her arm pulls her close and gives her a lingering kiss while Mike stares openmouthed. Colin smiles at Abby and they go to their apartments which are opposite each other. Abby waves a giant foam hand that she picked up at the game. as Colin goes into his apartment. Abby runs along the path to Mike and gives him a hug then runs joyfully to her apartment as Mike walks off. On the show he is wearing a gorilla suit and a video screen behind Larry and Georgia shows monkeys having sex. while Abby and Joy watch a monitor. Mike’s nephew Joe is present and the gorilla suit is mentioned. Abby jumps up and down grinning as she steps out of her apartment. On the doormat is a gift bag which Abby picks up and looks around frowning. She takes an envelope out of the gift bag and goes back inside opening the card and taking a box from the gift bag.",
    "13": "Mike is hiding in the bushes as she turns to go and Colin grabs her arm pulls her close and gives her a lingering kiss while Mike stares openmouthed. Colin smiles at Abby and they go to their apartments which are opposite each other. Abby waves a giant foam hand that she picked up at the game. as Colin goes into his apartment. Abby runs along the path to Mike and gives him a hug then runs joyfully to her apartment as Mike walks off. On the show he is wearing a gorilla suit and a video screen behind Larry and Georgia shows monkeys having sex. while Abby and Joy watch a monitor. Mike’s nephew Joe is present and the gorilla suit is mentioned. Abby jumps up and down grinning as she steps out of her apartment. On the doormat is a gift bag which Abby picks up and looks around frowning. She takes an envelope out of the gift bag and goes back inside opening the card and taking a box from the gift bag. Inside the box is a pair of remotecontrolled vibrating briefs."
  }
}