{
  "ground_truth": "Natalie spins around and heads off. Ryan looks out of the window of a jet as it rises into the sky. In Las Vegas Alex holds the cutout of Julie and Jim in front of the pyramidshaped Luxor Hotel. Ryan aims the digital camera and Alex moves the cutout closer. He takes a picture while Alex stares at the cutout. Ryan smiles and Alex looks surprised before smiling warmly. In Milwaukee a jet comes in to land. Alex and Ryan walk through the airport terminal with him pulling a black wheelie case and her a similar neat red one. Later they walk into the Chalet Suites a Swiss lodgethemed hotel and join a short queue of people checking in. Ryan notices a second counter with no queue. As Ryan opens a hotel room door his sister Kara walks up holding a basket of washing. Alex and Ryan walk into their gaudily furnished room where Ryan picks up a photocopied booklet with a picture of Julie and Jim on the front.",
  "iterations": {
    "1": "Natalie spins around and heads off. Ryan looks out of the window of a jet as it rises into the sky. In Las Vegas Alex holds the cutout of Julie and Jim in front of the pyramidshaped Luxor Hotel. Ryan aims the digital camera and Alex moves the cutout closer. He takes a picture while Alex stares at the cutout. Ryan smiles and Alex looks surprised before smiling warmly. In Milwaukee a jet comes in to land. Alex and Ryan walk through the airport terminal with him pulling a black wheelie case and her a similar neat red one. Later they walk into the Chalet Suites a Swiss lodgethemed hotel and join a short queue of people checking in. Ryan notices a second counter with no queue. As Ryan opens a hotel room door his sister Kara walks up holding a basket of washing. Alex and Ryan walk into their gaudily furnished room where Ryan picks up a photocopied booklet with a picture of Julie and Jim on the front.",
    "2": "Ryan looks out of the window of a jet as it rises into the sky. In Las Vegas Alex holds the cutout of Julie and Jim in front of the pyramidshaped Luxor Hotel. Ryan aims the digital camera and Alex moves the cutout closer. He takes a picture while Alex stares at the cutout. Ryan smiles and Alex looks surprised before smiling warmly. In Milwaukee a jet comes in to land. Alex and Ryan walk through the airport terminal with him pulling a black wheelie case and her a similar neat red one. Later they walk into the Chalet Suites a Swiss lodgethemed hotel and join a short queue of people checking in. Ryan notices a second counter with no queue. As Ryan opens a hotel room door his sister Kara walks up holding a basket of washing. Alex and Ryan walk into their gaudily furnished room where Ryan picks up a photocopied booklet with a picture of Julie and Jim on the front. Natalie spins around and heads off.",
    "3": "In Las Vegas Alex holds the cutout of Julie and Jim in front of the pyramidshaped Luxor Hotel. Ryan aims the digital camera and Alex moves the cutout closer. He takes a picture while Alex stares at the cutout. Ryan smiles and Alex looks surprised before smiling warmly. In Milwaukee a jet comes in to land. Alex and Ryan walk through the airport terminal with him pulling a black wheelie case and her a similar neat red one. Later they walk into the Chalet Suites a Swiss lodgethemed hotel and join a short queue of people checking in. Ryan notices a second counter with no queue. As Ryan opens a hotel room door his sister Kara walks up holding a basket of washing. Alex and Ryan walk into their gaudily furnished room where Ryan picks up a photocopied booklet with a picture of Julie and Jim on the front. Natalie spins around and heads off. Ryan looks out of the window of a jet as it rises into the sky.",
    "4": "Ryan aims the digital camera and Alex moves the cutout closer. He takes a picture while Alex stares at the cutout. Ryan smiles and Alex looks surprised before smiling warmly. In Milwaukee a jet comes in to land. Alex and Ryan walk through the airport terminal with him pulling a black wheelie case and her a similar neat red one. Later they walk into the Chalet Suites a Swiss lodgethemed hotel and join a short queue of people checking in. Ryan notices a second counter with no queue. As Ryan opens a hotel room door his sister Kara walks up holding a basket of washing. Alex and Ryan walk into their gaudily furnished room where Ryan picks up a photocopied booklet with a picture of Julie and Jim on the front. Natalie spins around and heads off. Ryan looks out of the window of a jet as it rises into the sky. In Las Vegas Alex holds the cutout of Julie and Jim in front of the pyramidshaped Luxor Hotel.",
    "5": "He takes a picture while Alex stares at the cutout. Ryan smiles and Alex looks surprised before smiling warmly. In Milwaukee a jet comes in to land. Alex and Ryan walk through the airport terminal with him pulling a black wheelie case and her a similar neat red one. Later they walk into the Chalet Suites a Swiss lodgethemed hotel and join a short queue of people checking in. Ryan notices a second counter with no queue. As Ryan opens a hotel room door his sister Kara walks up holding a basket of washing. Alex and Ryan walk into their gaudily furnished room where Ryan picks up a photocopied booklet with a picture of Julie and Jim on the front. Natalie spins around and heads off. Ryan looks out of the window of a jet as it rises into the sky. In Las Vegas Alex holds the cutout of Julie and Jim in front of the pyramidshaped Luxor Hotel. Ryan aims the digital camera and Alex moves the cutout closer.",
    "6": "Ryan smiles and Alex looks surprised before smiling warmly. In Milwaukee a jet comes in to land. Alex and Ryan walk through the airport terminal with him pulling a black wheelie case and her a similar neat red one. Later they walk into the Chalet Suites a Swiss lodgethemed hotel and join a short queue of people checking in. Ryan notices a second counter with no queue. As Ryan opens a hotel room door his sister Kara walks up holding a basket of washing. Alex and Ryan walk into their gaudily furnished room where Ryan picks up a photocopied booklet with a picture of Julie and Jim on the front. Natalie spins around and heads off. Ryan looks out of the window of a jet as it rises into the sky. In Las Vegas Alex holds the cutout of Julie and Jim in front of the pyramidshaped Luxor Hotel. Ryan aims the digital camera and Alex moves the cutout closer. He takes a picture while Alex stares at the cutout.",
    "7": "In Milwaukee a jet comes in to land. Alex and Ryan walk through the airport terminal with him pulling a black wheelie case and her a similar neat red one. Later they walk into the Chalet Suites a Swiss lodgethemed hotel and join a short queue of people checking in. Ryan notices a second counter with no queue. As Ryan opens a hotel room door his sister Kara walks up holding a basket of washing. Alex and Ryan walk into their gaudily furnished room where Ryan picks up a photocopied booklet with a picture of Julie and Jim on the front. Natalie spins around and heads off. Ryan looks out of the window of a jet as it rises into the sky. In Las Vegas Alex holds the cutout of Julie and Jim in front of the pyramidshaped Luxor Hotel. Ryan aims the digital camera and Alex moves the cutout closer. He takes a picture while Alex stares at the cutout. Ryan smiles and Alex looks surprised before smiling warmly.",
    "8": "Alex and Ryan walk through the airport terminal with him pulling a black wheelie case and her a similar neat red one. Later they walk into the Chalet Suites a Swiss lodgethemed hotel and join a short queue of people checking in. Ryan notices a second counter with no queue. As Ryan opens a hotel room door his sister Kara walks up holding a basket of washing. Alex and Ryan walk into their gaudily furnished room where Ryan picks up a photocopied booklet with a picture of Julie and Jim on the front. Natalie spins around and heads off. Ryan looks out of the window of a jet as it rises into the sky. In Las Vegas Alex holds the cutout of Julie and Jim in front of the pyramidshaped Luxor Hotel. Ryan aims the digital camera and Alex moves the cutout closer. He takes a picture while Alex stares at the cutout. Ryan smiles and Alex looks surprised before smiling warmly. In Milwaukee a jet comes in to land.",
    "9": "Later they walk into the Chalet Suites a Swiss lodgethemed hotel and join a short queue of people checking in. Ryan notices a second counter with no queue. As Ryan opens a hotel room door his sister Kara walks up holding a basket of washing. Alex and Ryan walk into their gaudily furnished room where Ryan picks up a photocopied booklet with a picture of Julie and Jim on the front. Natalie spins around and heads off. Ryan looks out of the window of a jet as it rises into the sky. In Las Vegas Alex holds the cutout of Julie and Jim in front of the pyramidshaped Luxor Hotel. Ryan aims the digital camera and Alex moves the cutout closer. He takes a picture while Alex stares at the cutout. Ryan smiles and Alex looks surprised before smiling warmly. In Milwaukee a jet comes in to land. Alex and Ryan walk through the airport terminal with him pulling a black wheelie case and her a similar neat red one.",
    "10": "Ryan notices a second counter with no queue. As Ryan opens a hotel room door his sister Kara walks up holding a basket of washing. Alex and Ryan walk into their gaudily furnished room where Ryan picks up a photocopied booklet with a picture of Julie and Jim on the front. Natalie spins around and heads off. Ryan looks out of the window of a jet as it rises into the sky. In Las Vegas Alex holds the cutout of Julie and Jim in front of the pyramidshaped Luxor Hotel. Ryan aims the digital camera and Alex moves the cutout closer. He takes a picture while Alex stares at the cutout. Ryan smiles and Alex looks surprised before smiling warmly. In Milwaukee a jet comes in to land. Alex and Ryan walk through the airport terminal with him pulling a black wheelie case and her a similar neat red one. Later they walk into the Chalet Suites a Swiss lodgethemed hotel and join a short queue of people checking in.",
    "11": "As Ryan opens a hotel room door his sister Kara walks up holding a basket of washing. Alex and Ryan walk into their gaudily furnished room where Ryan picks up a photocopied booklet with a picture of Julie and Jim on the front. Natalie spins around and heads off. Ryan looks out of the window of a jet as it rises into the sky. In Las Vegas Alex holds the cutout of Julie and Jim in front of the pyramidshaped Luxor Hotel. Ryan aims the digital camera and Alex moves the cutout closer. He takes a picture while Alex stares at the cutout. Ryan smiles and Alex looks surprised before smiling warmly. In Milwaukee a jet comes in to land. Alex and Ryan walk through the airport terminal with him pulling a black wheelie case and her a similar neat red one. Later they walk into the Chalet Suites a Swiss lodgethemed hotel and join a short queue of people checking in. Ryan notices a second counter with no queue.",
    "12": "Alex and Ryan walk into their gaudily furnished room where Ryan picks up a photocopied booklet with a picture of Julie and Jim on the front. Natalie spins around and heads off. Ryan looks out of the window of a jet as it rises into the sky. In Las Vegas Alex holds the cutout of Julie and Jim in front of the pyramidshaped Luxor Hotel. Ryan aims the digital camera and Alex moves the cutout closer. He takes a picture while Alex stares at the cutout. Ryan smiles and Alex looks surprised before smiling warmly. In Milwaukee a jet comes in to land. Alex and Ryan walk through the airport terminal with him pulling a black wheelie case and her a similar neat red one. Later they walk into the Chalet Suites a Swiss lodgethemed hotel and join a short queue of people checking in. Ryan notices a second counter with no queue. As Ryan opens a hotel room door his sister Kara walks up holding a basket of washing.",
    "13": "Natalie spins around and heads off. Ryan looks out of the window of a jet as it rises into the sky. In Las Vegas Alex holds the cutout of Julie and Jim in front of the pyramidshaped Luxor Hotel. Ryan aims the digital camera and Alex moves the cutout closer. He takes a picture while Alex stares at the cutout. Ryan smiles and Alex looks surprised before smiling warmly. In Milwaukee a jet comes in to land. Alex and Ryan walk through the airport terminal with him pulling a black wheelie case and her a similar neat red one. Later they walk into the Chalet Suites a Swiss lodgethemed hotel and join a short queue of people checking in. Ryan notices a second counter with no queue. As Ryan opens a hotel room door his sister Kara walks up holding a basket of washing. Alex and Ryan walk into their gaudily furnished room where Ryan picks up a photocopied booklet with a picture of Julie and Jim on the front."
  }
}