{
  "ground_truth": "Enrique approaches a security checkpoint and a female officer who calls next. He notices a couple whispering and keeps his eyes on the young couple. As he approaches them the short croppedhaired man walks away and the two exchange looks as Enrique strides up to the pretty longhaired woman Veronica. He grabs her hair and pushes her against a pillar. she holds his head. As she hugs him he hands her her bag. Enrique reluctantly let us go of her hand and moves away stopping to glance back. She blows him a kiss. Enrique turns and walks to the security barrier where he shows his ID and is allowed through. He marches through the podium as the Mayor shakes the President's hand. The Mayor goes to the lectern and Spanish flags are waved. Enrique rubs his palms together and reflects on Veronica's assignation.",
  "iterations": {
    "1": "Enrique approaches a security checkpoint and a female officer who calls next. He notices a couple whispering and keeps his eyes on the young couple. As he approaches them the short croppedhaired man walks away and the two exchange looks as Enrique strides up to the pretty longhaired woman Veronica. He grabs her hair and pushes her against a pillar. she holds his head. As she hugs him he hands her her bag. Enrique reluctantly let us go of her hand and moves away stopping to glance back. She blows him a kiss. Enrique turns and walks to the security barrier where he shows his ID and is allowed through. He marches through the podium as the Mayor shakes the President's hand. The Mayor goes to the lectern and Spanish flags are waved. Enrique rubs his palms together and reflects on Veronica's assignation.",
    "2": "He notices a couple whispering and keeps his eyes on the young couple. As he approaches them the short croppedhaired man walks away and the two exchange looks as Enrique strides up to the pretty longhaired woman Veronica. He grabs her hair and pushes her against a pillar. she holds his head. As she hugs him he hands her her bag. Enrique reluctantly let us go of her hand and moves away stopping to glance back. She blows him a kiss. Enrique turns and walks to the security barrier where he shows his ID and is allowed through. He marches through the podium as the Mayor shakes the President's hand. The Mayor goes to the lectern and Spanish flags are waved. Enrique rubs his palms together and reflects on Veronica's assignation. Enrique approaches a security checkpoint and a female officer who calls next.",
    "3": "As he approaches them the short croppedhaired man walks away and the two exchange looks as Enrique strides up to the pretty longhaired woman Veronica. He grabs her hair and pushes her against a pillar. she holds his head. As she hugs him he hands her her bag. Enrique reluctantly let us go of her hand and moves away stopping to glance back. She blows him a kiss. Enrique turns and walks to the security barrier where he shows his ID and is allowed through. He marches through the podium as the Mayor shakes the President's hand. The Mayor goes to the lectern and Spanish flags are waved. Enrique rubs his palms together and reflects on Veronica's assignation. Enrique approaches a security checkpoint and a female officer who calls next. He notices a couple whispering and keeps his eyes on the young couple.",
    "4": "He grabs her hair and pushes her against a pillar. she holds his head. As she hugs him he hands her her bag. Enrique reluctantly let us go of her hand and moves away stopping to glance back. She blows him a kiss. Enrique turns and walks to the security barrier where he shows his ID and is allowed through. He marches through the podium as the Mayor shakes the President's hand. The Mayor goes to the lectern and Spanish flags are waved. Enrique rubs his palms together and reflects on Veronica's assignation. Enrique approaches a security checkpoint and a female officer who calls next. He notices a couple whispering and keeps his eyes on the young couple. As he approaches them the short croppedhaired man walks away and the two exchange looks as Enrique strides up to the pretty longhaired woman Veronica.",
    "5": "she holds his head. As she hugs him he hands her her bag. Enrique reluctantly let us go of her hand and moves away stopping to glance back. She blows him a kiss. Enrique turns and walks to the security barrier where he shows his ID and is allowed through. He marches through the podium as the Mayor shakes the President's hand. The Mayor goes to the lectern and Spanish flags are waved. Enrique rubs his palms together and reflects on Veronica's assignation. Enrique approaches a security checkpoint and a female officer who calls next. He notices a couple whispering and keeps his eyes on the young couple. As he approaches them the short croppedhaired man walks away and the two exchange looks as Enrique strides up to the pretty longhaired woman Veronica. He grabs her hair and pushes her against a pillar.",
    "6": "As she hugs him he hands her her bag. Enrique reluctantly let us go of her hand and moves away stopping to glance back. She blows him a kiss. Enrique turns and walks to the security barrier where he shows his ID and is allowed through. He marches through the podium as the Mayor shakes the President's hand. The Mayor goes to the lectern and Spanish flags are waved. Enrique rubs his palms together and reflects on Veronica's assignation. Enrique approaches a security checkpoint and a female officer who calls next. He notices a couple whispering and keeps his eyes on the young couple. As he approaches them the short croppedhaired man walks away and the two exchange looks as Enrique strides up to the pretty longhaired woman Veronica. He grabs her hair and pushes her against a pillar. she holds his head.",
    "7": "Enrique reluctantly let us go of her hand and moves away stopping to glance back. She blows him a kiss. Enrique turns and walks to the security barrier where he shows his ID and is allowed through. He marches through the podium as the Mayor shakes the President's hand. The Mayor goes to the lectern and Spanish flags are waved. Enrique rubs his palms together and reflects on Veronica's assignation. Enrique approaches a security checkpoint and a female officer who calls next. He notices a couple whispering and keeps his eyes on the young couple. As he approaches them the short croppedhaired man walks away and the two exchange looks as Enrique strides up to the pretty longhaired woman Veronica. He grabs her hair and pushes her against a pillar. she holds his head. As she hugs him he hands her her bag.",
    "8": "She blows him a kiss. Enrique turns and walks to the security barrier where he shows his ID and is allowed through. He marches through the podium as the Mayor shakes the President's hand. The Mayor goes to the lectern and Spanish flags are waved. Enrique rubs his palms together and reflects on Veronica's assignation. Enrique approaches a security checkpoint and a female officer who calls next. He notices a couple whispering and keeps his eyes on the young couple. As he approaches them the short croppedhaired man walks away and the two exchange looks as Enrique strides up to the pretty longhaired woman Veronica. He grabs her hair and pushes her against a pillar. she holds his head. As she hugs him he hands her her bag. Enrique reluctantly let us go of her hand and moves away stopping to glance back.",
    "9": "Enrique turns and walks to the security barrier where he shows his ID and is allowed through. He marches through the podium as the Mayor shakes the President's hand. The Mayor goes to the lectern and Spanish flags are waved. Enrique rubs his palms together and reflects on Veronica's assignation. Enrique approaches a security checkpoint and a female officer who calls next. He notices a couple whispering and keeps his eyes on the young couple. As he approaches them the short croppedhaired man walks away and the two exchange looks as Enrique strides up to the pretty longhaired woman Veronica. He grabs her hair and pushes her against a pillar. she holds his head. As she hugs him he hands her her bag. Enrique reluctantly let us go of her hand and moves away stopping to glance back. She blows him a kiss.",
    "10": "He marches through the podium as the Mayor shakes the President's hand. The Mayor goes to the lectern and Spanish flags are waved. Enrique rubs his palms together and reflects on Veronica's assignation. Enrique approaches a security checkpoint and a female officer who calls next. He notices a couple whispering and keeps his eyes on the young couple. As he approaches them the short croppedhaired man walks away and the two exchange looks as Enrique strides up to the pretty longhaired woman Veronica. He grabs her hair and pushes her against a pillar. she holds his head. As she hugs him he hands her her bag. Enrique reluctantly let us go of her hand and moves away stopping to glance back. She blows him a kiss. Enrique turns and walks to the security barrier where he shows his ID and is allowed through.",
    "11": "The Mayor goes to the lectern and Spanish flags are waved. Enrique rubs his palms together and reflects on Veronica's assignation. Enrique approaches a security checkpoint and a female officer who calls next. He notices a couple whispering and keeps his eyes on the young couple. As he approaches them the short croppedhaired man walks away and the two exchange looks as Enrique strides up to the pretty longhaired woman Veronica. He grabs her hair and pushes her against a pillar. she holds his head. As she hugs him he hands her her bag. Enrique reluctantly let us go of her hand and moves away stopping to glance back. She blows him a kiss. Enrique turns and walks to the security barrier where he shows his ID and is allowed through. He marches through the podium as the Mayor shakes the President's hand.",
    "12": "Enrique rubs his palms together and reflects on Veronica's assignation. Enrique approaches a security checkpoint and a female officer who calls next. He notices a couple whispering and keeps his eyes on the young couple. As he approaches them the short croppedhaired man walks away and the two exchange looks as Enrique strides up to the pretty longhaired woman Veronica. He grabs her hair and pushes her against a pillar. she holds his head. As she hugs him he hands her her bag. Enrique reluctantly let us go of her hand and moves away stopping to glance back. She blows him a kiss. Enrique turns and walks to the security barrier where he shows his ID and is allowed through. He marches through the podium as the Mayor shakes the President's hand. The Mayor goes to the lectern and Spanish flags are waved.",
    "13": "Enrique approaches a security checkpoint and a female officer who calls next. He notices a couple whispering and keeps his eyes on the young couple. As he approaches them the short croppedhaired man walks away and the two exchange looks as Enrique strides up to the pretty longhaired woman Veronica. He grabs her hair and pushes her against a pillar. she holds his head. As she hugs him he hands her her bag. Enrique reluctantly let us go of her hand and moves away stopping to glance back. She blows him a kiss. Enrique turns and walks to the security barrier where he shows his ID and is allowed through. He marches through the podium as the Mayor shakes the President's hand. The Mayor goes to the lectern and Spanish flags are waved. Enrique rubs his palms together and reflects on Veronica's assignation."
  }
}