{
  "ground_truth": "Jenny puts her hand on Forrest's hand and Forrest nods as he remembers while continuing to talk to the black woman who looks up from her magazine. Jenny and Forrest walk but a dirt clod hits Forrest in the back of the head causing Jenny to look as Forrest rubs his head. Three young boys get off their bikes and pick up more rocks and Forrest is hit in the eye with another dirt clod causing him to fall backward onto the ground as the boys glare at him. Jenny helps Forrest back up as Boy 1 and Boy 2 throw more dirt clods at him with another one hitting him in the arm. Forrest tries to run along the road but his braces make it impossible so he hobbles along as Jenny yells after him. Boy 1 and Boy 2 turn back toward the bikes and the boys ride after. Forrest who continues to hobble along the dirt road while Jenny stands and watches. Forrest looks over his shoulder as the three boys race on their bikes and he begins to run faster with his braces on as they chase him. Blood drips from a cut on his head but he continues running despite the boys on the bikes gaining on him. Forrest hobbles along and then begins to gain speed running from the chasing boys. The boys pedal faster as they gain on. Forrest who looks over his shoulder in fear and tries to run even faster to get away.",
  "iterations": {
    "1": "Jenny puts her hand on Forrest's hand and Forrest nods as he remembers while continuing to talk to the black woman who looks up from her magazine. Jenny and Forrest walk but a dirt clod hits Forrest in the back of the head causing Jenny to look as Forrest rubs his head. Three young boys get off their bikes and pick up more rocks and Forrest is hit in the eye with another dirt clod causing him to fall backward onto the ground as the boys glare at him. Jenny helps Forrest back up as Boy 1 and Boy 2 throw more dirt clods at him with another one hitting him in the arm. Forrest tries to run along the road but his braces make it impossible so he hobbles along as Jenny yells after him. Boy 1 and Boy 2 turn back toward the bikes and the boys ride after. Forrest who continues to hobble along the dirt road while Jenny stands and watches. Forrest looks over his shoulder as the three boys race on their bikes and he begins to run faster with his braces on as they chase him. Blood drips from a cut on his head but he continues running despite the boys on the bikes gaining on him. Forrest hobbles along and then begins to gain speed running from the chasing boys. The boys pedal faster as they gain on. Forrest who looks over his shoulder in fear and tries to run even faster to get away.",
    "2": "Jenny and Forrest walk but a dirt clod hits Forrest in the back of the head causing Jenny to look as Forrest rubs his head. Three young boys get off their bikes and pick up more rocks and Forrest is hit in the eye with another dirt clod causing him to fall backward onto the ground as the boys glare at him. Jenny helps Forrest back up as Boy 1 and Boy 2 throw more dirt clods at him with another one hitting him in the arm. Forrest tries to run along the road but his braces make it impossible so he hobbles along as Jenny yells after him. Boy 1 and Boy 2 turn back toward the bikes and the boys ride after. Forrest who continues to hobble along the dirt road while Jenny stands and watches. Forrest looks over his shoulder as the three boys race on their bikes and he begins to run faster with his braces on as they chase him. Blood drips from a cut on his head but he continues running despite the boys on the bikes gaining on him. Forrest hobbles along and then begins to gain speed running from the chasing boys. The boys pedal faster as they gain on. Forrest who looks over his shoulder in fear and tries to run even faster to get away. Jenny puts her hand on Forrest's hand and Forrest nods as he remembers while continuing to talk to the black woman who looks up from her magazine.",
    "3": "Three young boys get off their bikes and pick up more rocks and Forrest is hit in the eye with another dirt clod causing him to fall backward onto the ground as the boys glare at him. Jenny helps Forrest back up as Boy 1 and Boy 2 throw more dirt clods at him with another one hitting him in the arm. Forrest tries to run along the road but his braces make it impossible so he hobbles along as Jenny yells after him. Boy 1 and Boy 2 turn back toward the bikes and the boys ride after. Forrest who continues to hobble along the dirt road while Jenny stands and watches. Forrest looks over his shoulder as the three boys race on their bikes and he begins to run faster with his braces on as they chase him. Blood drips from a cut on his head but he continues running despite the boys on the bikes gaining on him. Forrest hobbles along and then begins to gain speed running from the chasing boys. The boys pedal faster as they gain on. Forrest who looks over his shoulder in fear and tries to run even faster to get away. Jenny puts her hand on Forrest's hand and Forrest nods as he remembers while continuing to talk to the black woman who looks up from her magazine. Jenny and Forrest walk but a dirt clod hits Forrest in the back of the head causing Jenny to look as Forrest rubs his head.",
    "4": "Jenny helps Forrest back up as Boy 1 and Boy 2 throw more dirt clods at him with another one hitting him in the arm. Forrest tries to run along the road but his braces make it impossible so he hobbles along as Jenny yells after him. Boy 1 and Boy 2 turn back toward the bikes and the boys ride after. Forrest who continues to hobble along the dirt road while Jenny stands and watches. Forrest looks over his shoulder as the three boys race on their bikes and he begins to run faster with his braces on as they chase him. Blood drips from a cut on his head but he continues running despite the boys on the bikes gaining on him. Forrest hobbles along and then begins to gain speed running from the chasing boys. The boys pedal faster as they gain on. Forrest who looks over his shoulder in fear and tries to run even faster to get away. Jenny puts her hand on Forrest's hand and Forrest nods as he remembers while continuing to talk to the black woman who looks up from her magazine. Jenny and Forrest walk but a dirt clod hits Forrest in the back of the head causing Jenny to look as Forrest rubs his head. Three young boys get off their bikes and pick up more rocks and Forrest is hit in the eye with another dirt clod causing him to fall backward onto the ground as the boys glare at him.",
    "5": "Forrest tries to run along the road but his braces make it impossible so he hobbles along as Jenny yells after him. Boy 1 and Boy 2 turn back toward the bikes and the boys ride after. Forrest who continues to hobble along the dirt road while Jenny stands and watches. Forrest looks over his shoulder as the three boys race on their bikes and he begins to run faster with his braces on as they chase him. Blood drips from a cut on his head but he continues running despite the boys on the bikes gaining on him. Forrest hobbles along and then begins to gain speed running from the chasing boys. The boys pedal faster as they gain on. Forrest who looks over his shoulder in fear and tries to run even faster to get away. Jenny puts her hand on Forrest's hand and Forrest nods as he remembers while continuing to talk to the black woman who looks up from her magazine. Jenny and Forrest walk but a dirt clod hits Forrest in the back of the head causing Jenny to look as Forrest rubs his head. Three young boys get off their bikes and pick up more rocks and Forrest is hit in the eye with another dirt clod causing him to fall backward onto the ground as the boys glare at him. Jenny helps Forrest back up as Boy 1 and Boy 2 throw more dirt clods at him with another one hitting him in the arm.",
    "6": "Boy 1 and Boy 2 turn back toward the bikes and the boys ride after. Forrest who continues to hobble along the dirt road while Jenny stands and watches. Forrest looks over his shoulder as the three boys race on their bikes and he begins to run faster with his braces on as they chase him. Blood drips from a cut on his head but he continues running despite the boys on the bikes gaining on him. Forrest hobbles along and then begins to gain speed running from the chasing boys. The boys pedal faster as they gain on. Forrest who looks over his shoulder in fear and tries to run even faster to get away. Jenny puts her hand on Forrest's hand and Forrest nods as he remembers while continuing to talk to the black woman who looks up from her magazine. Jenny and Forrest walk but a dirt clod hits Forrest in the back of the head causing Jenny to look as Forrest rubs his head. Three young boys get off their bikes and pick up more rocks and Forrest is hit in the eye with another dirt clod causing him to fall backward onto the ground as the boys glare at him. Jenny helps Forrest back up as Boy 1 and Boy 2 throw more dirt clods at him with another one hitting him in the arm. Forrest tries to run along the road but his braces make it impossible so he hobbles along as Jenny yells after him.",
    "7": "Forrest who continues to hobble along the dirt road while Jenny stands and watches. Forrest looks over his shoulder as the three boys race on their bikes and he begins to run faster with his braces on as they chase him. Blood drips from a cut on his head but he continues running despite the boys on the bikes gaining on him. Forrest hobbles along and then begins to gain speed running from the chasing boys. The boys pedal faster as they gain on. Forrest who looks over his shoulder in fear and tries to run even faster to get away. Jenny puts her hand on Forrest's hand and Forrest nods as he remembers while continuing to talk to the black woman who looks up from her magazine. Jenny and Forrest walk but a dirt clod hits Forrest in the back of the head causing Jenny to look as Forrest rubs his head. Three young boys get off their bikes and pick up more rocks and Forrest is hit in the eye with another dirt clod causing him to fall backward onto the ground as the boys glare at him. Jenny helps Forrest back up as Boy 1 and Boy 2 throw more dirt clods at him with another one hitting him in the arm. Forrest tries to run along the road but his braces make it impossible so he hobbles along as Jenny yells after him. Boy 1 and Boy 2 turn back toward the bikes and the boys ride after.",
    "8": "Forrest looks over his shoulder as the three boys race on their bikes and he begins to run faster with his braces on as they chase him. Blood drips from a cut on his head but he continues running despite the boys on the bikes gaining on him. Forrest hobbles along and then begins to gain speed running from the chasing boys. The boys pedal faster as they gain on. Forrest who looks over his shoulder in fear and tries to run even faster to get away. Jenny puts her hand on Forrest's hand and Forrest nods as he remembers while continuing to talk to the black woman who looks up from her magazine. Jenny and Forrest walk but a dirt clod hits Forrest in the back of the head causing Jenny to look as Forrest rubs his head. Three young boys get off their bikes and pick up more rocks and Forrest is hit in the eye with another dirt clod causing him to fall backward onto the ground as the boys glare at him. Jenny helps Forrest back up as Boy 1 and Boy 2 throw more dirt clods at him with another one hitting him in the arm. Forrest tries to run along the road but his braces make it impossible so he hobbles along as Jenny yells after him. Boy 1 and Boy 2 turn back toward the bikes and the boys ride after. Forrest who continues to hobble along the dirt road while Jenny stands and watches.",
    "9": "Blood drips from a cut on his head but he continues running despite the boys on the bikes gaining on him. Forrest hobbles along and then begins to gain speed running from the chasing boys. The boys pedal faster as they gain on. Forrest who looks over his shoulder in fear and tries to run even faster to get away. Jenny puts her hand on Forrest's hand and Forrest nods as he remembers while continuing to talk to the black woman who looks up from her magazine. Jenny and Forrest walk but a dirt clod hits Forrest in the back of the head causing Jenny to look as Forrest rubs his head. Three young boys get off their bikes and pick up more rocks and Forrest is hit in the eye with another dirt clod causing him to fall backward onto the ground as the boys glare at him. Jenny helps Forrest back up as Boy 1 and Boy 2 throw more dirt clods at him with another one hitting him in the arm. Forrest tries to run along the road but his braces make it impossible so he hobbles along as Jenny yells after him. Boy 1 and Boy 2 turn back toward the bikes and the boys ride after. Forrest who continues to hobble along the dirt road while Jenny stands and watches. Forrest looks over his shoulder as the three boys race on their bikes and he begins to run faster with his braces on as they chase him.",
    "10": "Forrest hobbles along and then begins to gain speed running from the chasing boys. The boys pedal faster as they gain on. Forrest who looks over his shoulder in fear and tries to run even faster to get away. Jenny puts her hand on Forrest's hand and Forrest nods as he remembers while continuing to talk to the black woman who looks up from her magazine. Jenny and Forrest walk but a dirt clod hits Forrest in the back of the head causing Jenny to look as Forrest rubs his head. Three young boys get off their bikes and pick up more rocks and Forrest is hit in the eye with another dirt clod causing him to fall backward onto the ground as the boys glare at him. Jenny helps Forrest back up as Boy 1 and Boy 2 throw more dirt clods at him with another one hitting him in the arm. Forrest tries to run along the road but his braces make it impossible so he hobbles along as Jenny yells after him. Boy 1 and Boy 2 turn back toward the bikes and the boys ride after. Forrest who continues to hobble along the dirt road while Jenny stands and watches. Forrest looks over his shoulder as the three boys race on their bikes and he begins to run faster with his braces on as they chase him. Blood drips from a cut on his head but he continues running despite the boys on the bikes gaining on him.",
    "11": "The boys pedal faster as they gain on. Forrest who looks over his shoulder in fear and tries to run even faster to get away. Jenny puts her hand on Forrest's hand and Forrest nods as he remembers while continuing to talk to the black woman who looks up from her magazine. Jenny and Forrest walk but a dirt clod hits Forrest in the back of the head causing Jenny to look as Forrest rubs his head. Three young boys get off their bikes and pick up more rocks and Forrest is hit in the eye with another dirt clod causing him to fall backward onto the ground as the boys glare at him. Jenny helps Forrest back up as Boy 1 and Boy 2 throw more dirt clods at him with another one hitting him in the arm. Forrest tries to run along the road but his braces make it impossible so he hobbles along as Jenny yells after him. Boy 1 and Boy 2 turn back toward the bikes and the boys ride after. Forrest who continues to hobble along the dirt road while Jenny stands and watches. Forrest looks over his shoulder as the three boys race on their bikes and he begins to run faster with his braces on as they chase him. Blood drips from a cut on his head but he continues running despite the boys on the bikes gaining on him. Forrest hobbles along and then begins to gain speed running from the chasing boys.",
    "12": "Forrest who looks over his shoulder in fear and tries to run even faster to get away. Jenny puts her hand on Forrest's hand and Forrest nods as he remembers while continuing to talk to the black woman who looks up from her magazine. Jenny and Forrest walk but a dirt clod hits Forrest in the back of the head causing Jenny to look as Forrest rubs his head. Three young boys get off their bikes and pick up more rocks and Forrest is hit in the eye with another dirt clod causing him to fall backward onto the ground as the boys glare at him. Jenny helps Forrest back up as Boy 1 and Boy 2 throw more dirt clods at him with another one hitting him in the arm. Forrest tries to run along the road but his braces make it impossible so he hobbles along as Jenny yells after him. Boy 1 and Boy 2 turn back toward the bikes and the boys ride after. Forrest who continues to hobble along the dirt road while Jenny stands and watches. Forrest looks over his shoulder as the three boys race on their bikes and he begins to run faster with his braces on as they chase him. Blood drips from a cut on his head but he continues running despite the boys on the bikes gaining on him. Forrest hobbles along and then begins to gain speed running from the chasing boys. The boys pedal faster as they gain on.",
    "13": "Jenny puts her hand on Forrest's hand and Forrest nods as he remembers while continuing to talk to the black woman who looks up from her magazine. Jenny and Forrest walk but a dirt clod hits Forrest in the back of the head causing Jenny to look as Forrest rubs his head. Three young boys get off their bikes and pick up more rocks and Forrest is hit in the eye with another dirt clod causing him to fall backward onto the ground as the boys glare at him. Jenny helps Forrest back up as Boy 1 and Boy 2 throw more dirt clods at him with another one hitting him in the arm. Forrest tries to run along the road but his braces make it impossible so he hobbles along as Jenny yells after him. Boy 1 and Boy 2 turn back toward the bikes and the boys ride after. Forrest who continues to hobble along the dirt road while Jenny stands and watches. Forrest looks over his shoulder as the three boys race on their bikes and he begins to run faster with his braces on as they chase him. Blood drips from a cut on his head but he continues running despite the boys on the bikes gaining on him. Forrest hobbles along and then begins to gain speed running from the chasing boys. The boys pedal faster as they gain on. Forrest who looks over his shoulder in fear and tries to run even faster to get away."
  }
}