{
  "ground_truth": "The huge giant leaves the room and Harry looks at him uncertainly then shakes his head. A pure white landscape emerges as highstepping white horses trot out of the snowcovered forest drawing handsome sleighs full of students wellwrapped against the cold. In the Great Hall now decorated with tall Christmas trees the ceiling reflects the weather outside and huge snowflakes float above the heads of the students sitting at the long polished dining tables. Harry and Ron are sitting by themselves at the end of one of the tables when Hermione carries her meal down the hall and sits opposite them. She holds up two cakes. Later followed by Harry Ron peers around a statue in the corridor makes sure the coast is clear and lifts his crooked wand. Harry waves his wand and the two cakes float into the air. Harry and Ron hide as Crabbe and Goyle appear with armfuls of cake. They see the floating cakes grab them and start to eat them greedily smacking their lips and stuffing the cakes into their mouths. They suddenly stop chewing as their eyes roll up and they both fall over backward and hit the floor. Later in the girls' lavatory Hermione fills three glasses and hands one to Harry and one to Ron. They look at their thick sludge suspiciously and put the hairs into the potion.",
  "iterations": {
    "1": "The huge giant leaves the room and Harry looks at him uncertainly then shakes his head. A pure white landscape emerges as highstepping white horses trot out of the snowcovered forest drawing handsome sleighs full of students wellwrapped against the cold. In the Great Hall now decorated with tall Christmas trees the ceiling reflects the weather outside and huge snowflakes float above the heads of the students sitting at the long polished dining tables. Harry and Ron are sitting by themselves at the end of one of the tables when Hermione carries her meal down the hall and sits opposite them. She holds up two cakes. Later followed by Harry Ron peers around a statue in the corridor makes sure the coast is clear and lifts his crooked wand. Harry waves his wand and the two cakes float into the air. Harry and Ron hide as Crabbe and Goyle appear with armfuls of cake. They see the floating cakes grab them and start to eat them greedily smacking their lips and stuffing the cakes into their mouths. They suddenly stop chewing as their eyes roll up and they both fall over backward and hit the floor. Later in the girls' lavatory Hermione fills three glasses and hands one to Harry and one to Ron. They look at their thick sludge suspiciously and put the hairs into the potion.",
    "2": "A pure white landscape emerges as highstepping white horses trot out of the snowcovered forest drawing handsome sleighs full of students wellwrapped against the cold. In the Great Hall now decorated with tall Christmas trees the ceiling reflects the weather outside and huge snowflakes float above the heads of the students sitting at the long polished dining tables. Harry and Ron are sitting by themselves at the end of one of the tables when Hermione carries her meal down the hall and sits opposite them. She holds up two cakes. Later followed by Harry Ron peers around a statue in the corridor makes sure the coast is clear and lifts his crooked wand. Harry waves his wand and the two cakes float into the air. Harry and Ron hide as Crabbe and Goyle appear with armfuls of cake. They see the floating cakes grab them and start to eat them greedily smacking their lips and stuffing the cakes into their mouths. They suddenly stop chewing as their eyes roll up and they both fall over backward and hit the floor. Later in the girls' lavatory Hermione fills three glasses and hands one to Harry and one to Ron. They look at their thick sludge suspiciously and put the hairs into the potion. The huge giant leaves the room and Harry looks at him uncertainly then shakes his head.",
    "3": "In the Great Hall now decorated with tall Christmas trees the ceiling reflects the weather outside and huge snowflakes float above the heads of the students sitting at the long polished dining tables. Harry and Ron are sitting by themselves at the end of one of the tables when Hermione carries her meal down the hall and sits opposite them. She holds up two cakes. Later followed by Harry Ron peers around a statue in the corridor makes sure the coast is clear and lifts his crooked wand. Harry waves his wand and the two cakes float into the air. Harry and Ron hide as Crabbe and Goyle appear with armfuls of cake. They see the floating cakes grab them and start to eat them greedily smacking their lips and stuffing the cakes into their mouths. They suddenly stop chewing as their eyes roll up and they both fall over backward and hit the floor. Later in the girls' lavatory Hermione fills three glasses and hands one to Harry and one to Ron. They look at their thick sludge suspiciously and put the hairs into the potion. The huge giant leaves the room and Harry looks at him uncertainly then shakes his head. A pure white landscape emerges as highstepping white horses trot out of the snowcovered forest drawing handsome sleighs full of students wellwrapped against the cold.",
    "4": "Harry and Ron are sitting by themselves at the end of one of the tables when Hermione carries her meal down the hall and sits opposite them. She holds up two cakes. Later followed by Harry Ron peers around a statue in the corridor makes sure the coast is clear and lifts his crooked wand. Harry waves his wand and the two cakes float into the air. Harry and Ron hide as Crabbe and Goyle appear with armfuls of cake. They see the floating cakes grab them and start to eat them greedily smacking their lips and stuffing the cakes into their mouths. They suddenly stop chewing as their eyes roll up and they both fall over backward and hit the floor. Later in the girls' lavatory Hermione fills three glasses and hands one to Harry and one to Ron. They look at their thick sludge suspiciously and put the hairs into the potion. The huge giant leaves the room and Harry looks at him uncertainly then shakes his head. A pure white landscape emerges as highstepping white horses trot out of the snowcovered forest drawing handsome sleighs full of students wellwrapped against the cold. In the Great Hall now decorated with tall Christmas trees the ceiling reflects the weather outside and huge snowflakes float above the heads of the students sitting at the long polished dining tables.",
    "5": "She holds up two cakes. Later followed by Harry Ron peers around a statue in the corridor makes sure the coast is clear and lifts his crooked wand. Harry waves his wand and the two cakes float into the air. Harry and Ron hide as Crabbe and Goyle appear with armfuls of cake. They see the floating cakes grab them and start to eat them greedily smacking their lips and stuffing the cakes into their mouths. They suddenly stop chewing as their eyes roll up and they both fall over backward and hit the floor. Later in the girls' lavatory Hermione fills three glasses and hands one to Harry and one to Ron. They look at their thick sludge suspiciously and put the hairs into the potion. The huge giant leaves the room and Harry looks at him uncertainly then shakes his head. A pure white landscape emerges as highstepping white horses trot out of the snowcovered forest drawing handsome sleighs full of students wellwrapped against the cold. In the Great Hall now decorated with tall Christmas trees the ceiling reflects the weather outside and huge snowflakes float above the heads of the students sitting at the long polished dining tables. Harry and Ron are sitting by themselves at the end of one of the tables when Hermione carries her meal down the hall and sits opposite them.",
    "6": "Later followed by Harry Ron peers around a statue in the corridor makes sure the coast is clear and lifts his crooked wand. Harry waves his wand and the two cakes float into the air. Harry and Ron hide as Crabbe and Goyle appear with armfuls of cake. They see the floating cakes grab them and start to eat them greedily smacking their lips and stuffing the cakes into their mouths. They suddenly stop chewing as their eyes roll up and they both fall over backward and hit the floor. Later in the girls' lavatory Hermione fills three glasses and hands one to Harry and one to Ron. They look at their thick sludge suspiciously and put the hairs into the potion. The huge giant leaves the room and Harry looks at him uncertainly then shakes his head. A pure white landscape emerges as highstepping white horses trot out of the snowcovered forest drawing handsome sleighs full of students wellwrapped against the cold. In the Great Hall now decorated with tall Christmas trees the ceiling reflects the weather outside and huge snowflakes float above the heads of the students sitting at the long polished dining tables. Harry and Ron are sitting by themselves at the end of one of the tables when Hermione carries her meal down the hall and sits opposite them. She holds up two cakes.",
    "7": "Harry waves his wand and the two cakes float into the air. Harry and Ron hide as Crabbe and Goyle appear with armfuls of cake. They see the floating cakes grab them and start to eat them greedily smacking their lips and stuffing the cakes into their mouths. They suddenly stop chewing as their eyes roll up and they both fall over backward and hit the floor. Later in the girls' lavatory Hermione fills three glasses and hands one to Harry and one to Ron. They look at their thick sludge suspiciously and put the hairs into the potion. The huge giant leaves the room and Harry looks at him uncertainly then shakes his head. A pure white landscape emerges as highstepping white horses trot out of the snowcovered forest drawing handsome sleighs full of students wellwrapped against the cold. In the Great Hall now decorated with tall Christmas trees the ceiling reflects the weather outside and huge snowflakes float above the heads of the students sitting at the long polished dining tables. Harry and Ron are sitting by themselves at the end of one of the tables when Hermione carries her meal down the hall and sits opposite them. She holds up two cakes. Later followed by Harry Ron peers around a statue in the corridor makes sure the coast is clear and lifts his crooked wand.",
    "8": "Harry and Ron hide as Crabbe and Goyle appear with armfuls of cake. They see the floating cakes grab them and start to eat them greedily smacking their lips and stuffing the cakes into their mouths. They suddenly stop chewing as their eyes roll up and they both fall over backward and hit the floor. Later in the girls' lavatory Hermione fills three glasses and hands one to Harry and one to Ron. They look at their thick sludge suspiciously and put the hairs into the potion. The huge giant leaves the room and Harry looks at him uncertainly then shakes his head. A pure white landscape emerges as highstepping white horses trot out of the snowcovered forest drawing handsome sleighs full of students wellwrapped against the cold. In the Great Hall now decorated with tall Christmas trees the ceiling reflects the weather outside and huge snowflakes float above the heads of the students sitting at the long polished dining tables. Harry and Ron are sitting by themselves at the end of one of the tables when Hermione carries her meal down the hall and sits opposite them. She holds up two cakes. Later followed by Harry Ron peers around a statue in the corridor makes sure the coast is clear and lifts his crooked wand. Harry waves his wand and the two cakes float into the air.",
    "9": "They see the floating cakes grab them and start to eat them greedily smacking their lips and stuffing the cakes into their mouths. They suddenly stop chewing as their eyes roll up and they both fall over backward and hit the floor. Later in the girls' lavatory Hermione fills three glasses and hands one to Harry and one to Ron. They look at their thick sludge suspiciously and put the hairs into the potion. The huge giant leaves the room and Harry looks at him uncertainly then shakes his head. A pure white landscape emerges as highstepping white horses trot out of the snowcovered forest drawing handsome sleighs full of students wellwrapped against the cold. In the Great Hall now decorated with tall Christmas trees the ceiling reflects the weather outside and huge snowflakes float above the heads of the students sitting at the long polished dining tables. Harry and Ron are sitting by themselves at the end of one of the tables when Hermione carries her meal down the hall and sits opposite them. She holds up two cakes. Later followed by Harry Ron peers around a statue in the corridor makes sure the coast is clear and lifts his crooked wand. Harry waves his wand and the two cakes float into the air. Harry and Ron hide as Crabbe and Goyle appear with armfuls of cake.",
    "10": "They suddenly stop chewing as their eyes roll up and they both fall over backward and hit the floor. Later in the girls' lavatory Hermione fills three glasses and hands one to Harry and one to Ron. They look at their thick sludge suspiciously and put the hairs into the potion. The huge giant leaves the room and Harry looks at him uncertainly then shakes his head. A pure white landscape emerges as highstepping white horses trot out of the snowcovered forest drawing handsome sleighs full of students wellwrapped against the cold. In the Great Hall now decorated with tall Christmas trees the ceiling reflects the weather outside and huge snowflakes float above the heads of the students sitting at the long polished dining tables. Harry and Ron are sitting by themselves at the end of one of the tables when Hermione carries her meal down the hall and sits opposite them. She holds up two cakes. Later followed by Harry Ron peers around a statue in the corridor makes sure the coast is clear and lifts his crooked wand. Harry waves his wand and the two cakes float into the air. Harry and Ron hide as Crabbe and Goyle appear with armfuls of cake. They see the floating cakes grab them and start to eat them greedily smacking their lips and stuffing the cakes into their mouths.",
    "11": "Later in the girls' lavatory Hermione fills three glasses and hands one to Harry and one to Ron. They look at their thick sludge suspiciously and put the hairs into the potion. The huge giant leaves the room and Harry looks at him uncertainly then shakes his head. A pure white landscape emerges as highstepping white horses trot out of the snowcovered forest drawing handsome sleighs full of students wellwrapped against the cold. In the Great Hall now decorated with tall Christmas trees the ceiling reflects the weather outside and huge snowflakes float above the heads of the students sitting at the long polished dining tables. Harry and Ron are sitting by themselves at the end of one of the tables when Hermione carries her meal down the hall and sits opposite them. She holds up two cakes. Later followed by Harry Ron peers around a statue in the corridor makes sure the coast is clear and lifts his crooked wand. Harry waves his wand and the two cakes float into the air. Harry and Ron hide as Crabbe and Goyle appear with armfuls of cake. They see the floating cakes grab them and start to eat them greedily smacking their lips and stuffing the cakes into their mouths. They suddenly stop chewing as their eyes roll up and they both fall over backward and hit the floor.",
    "12": "They look at their thick sludge suspiciously and put the hairs into the potion. The huge giant leaves the room and Harry looks at him uncertainly then shakes his head. A pure white landscape emerges as highstepping white horses trot out of the snowcovered forest drawing handsome sleighs full of students wellwrapped against the cold. In the Great Hall now decorated with tall Christmas trees the ceiling reflects the weather outside and huge snowflakes float above the heads of the students sitting at the long polished dining tables. Harry and Ron are sitting by themselves at the end of one of the tables when Hermione carries her meal down the hall and sits opposite them. She holds up two cakes. Later followed by Harry Ron peers around a statue in the corridor makes sure the coast is clear and lifts his crooked wand. Harry waves his wand and the two cakes float into the air. Harry and Ron hide as Crabbe and Goyle appear with armfuls of cake. They see the floating cakes grab them and start to eat them greedily smacking their lips and stuffing the cakes into their mouths. They suddenly stop chewing as their eyes roll up and they both fall over backward and hit the floor. Later in the girls' lavatory Hermione fills three glasses and hands one to Harry and one to Ron.",
    "13": "The huge giant leaves the room and Harry looks at him uncertainly then shakes his head. A pure white landscape emerges as highstepping white horses trot out of the snowcovered forest drawing handsome sleighs full of students wellwrapped against the cold. In the Great Hall now decorated with tall Christmas trees the ceiling reflects the weather outside and huge snowflakes float above the heads of the students sitting at the long polished dining tables. Harry and Ron are sitting by themselves at the end of one of the tables when Hermione carries her meal down the hall and sits opposite them. She holds up two cakes. Later followed by Harry Ron peers around a statue in the corridor makes sure the coast is clear and lifts his crooked wand. Harry waves his wand and the two cakes float into the air. Harry and Ron hide as Crabbe and Goyle appear with armfuls of cake. They see the floating cakes grab them and start to eat them greedily smacking their lips and stuffing the cakes into their mouths. They suddenly stop chewing as their eyes roll up and they both fall over backward and hit the floor. Later in the girls' lavatory Hermione fills three glasses and hands one to Harry and one to Ron. They look at their thick sludge suspiciously and put the hairs into the potion."
  }
}