{
  "ground_truth": "They are swarming into it as Ron looks around nervously. Harry stoops and goes into the tunnel with Fang just ahead and breathing hard. Ron hesitates for a moment then follows his friend. The tunnel lies dark and glow making it impossible to stand upright. They do not see a very large spider which drops from the roof behind them silhouetted against the light from the tunnel entrance. The tunnel gradually opens out into a large dimly lit hollow filled with twisted tree roots. Harry and Ron follow the spiders as they swarm across it. But the path stops at a huge hole in the ground surrounded by crumpled cobwebs. The guide disappeared into the hole and unable to go further the boys stopped a little away from it. Harry holds up the lantern unsure of what to do next and Harry and Ron back away as several long hairy legs emerge from the hole and a huge spider as big as a doubledecker bus holds itself above the edge and peers down at them. It has a hairy face and its tiny eyes are set close together and the boys stare openmouthed as Ron stops whimpering. Ron points upwards with a shaking hand and Harry looks up to see dozens of large spiders lowering themselves from the tree roots to dangle about their heads.",
  "iterations": {
    "1": "They are swarming into it as Ron looks around nervously. Harry stoops and goes into the tunnel with Fang just ahead and breathing hard. Ron hesitates for a moment then follows his friend. The tunnel lies dark and glow making it impossible to stand upright. They do not see a very large spider which drops from the roof behind them silhouetted against the light from the tunnel entrance. The tunnel gradually opens out into a large dimly lit hollow filled with twisted tree roots. Harry and Ron follow the spiders as they swarm across it. But the path stops at a huge hole in the ground surrounded by crumpled cobwebs. The guide disappeared into the hole and unable to go further the boys stopped a little away from it. Harry holds up the lantern unsure of what to do next and Harry and Ron back away as several long hairy legs emerge from the hole and a huge spider as big as a doubledecker bus holds itself above the edge and peers down at them. It has a hairy face and its tiny eyes are set close together and the boys stare openmouthed as Ron stops whimpering. Ron points upwards with a shaking hand and Harry looks up to see dozens of large spiders lowering themselves from the tree roots to dangle about their heads.",
    "2": "Harry stoops and goes into the tunnel with Fang just ahead and breathing hard. Ron hesitates for a moment then follows his friend. The tunnel lies dark and glow making it impossible to stand upright. They do not see a very large spider which drops from the roof behind them silhouetted against the light from the tunnel entrance. The tunnel gradually opens out into a large dimly lit hollow filled with twisted tree roots. Harry and Ron follow the spiders as they swarm across it. But the path stops at a huge hole in the ground surrounded by crumpled cobwebs. The guide disappeared into the hole and unable to go further the boys stopped a little away from it. Harry holds up the lantern unsure of what to do next and Harry and Ron back away as several long hairy legs emerge from the hole and a huge spider as big as a doubledecker bus holds itself above the edge and peers down at them. It has a hairy face and its tiny eyes are set close together and the boys stare openmouthed as Ron stops whimpering. Ron points upwards with a shaking hand and Harry looks up to see dozens of large spiders lowering themselves from the tree roots to dangle about their heads. They are swarming into it as Ron looks around nervously.",
    "3": "Ron hesitates for a moment then follows his friend. The tunnel lies dark and glow making it impossible to stand upright. They do not see a very large spider which drops from the roof behind them silhouetted against the light from the tunnel entrance. The tunnel gradually opens out into a large dimly lit hollow filled with twisted tree roots. Harry and Ron follow the spiders as they swarm across it. But the path stops at a huge hole in the ground surrounded by crumpled cobwebs. The guide disappeared into the hole and unable to go further the boys stopped a little away from it. Harry holds up the lantern unsure of what to do next and Harry and Ron back away as several long hairy legs emerge from the hole and a huge spider as big as a doubledecker bus holds itself above the edge and peers down at them. It has a hairy face and its tiny eyes are set close together and the boys stare openmouthed as Ron stops whimpering. Ron points upwards with a shaking hand and Harry looks up to see dozens of large spiders lowering themselves from the tree roots to dangle about their heads. They are swarming into it as Ron looks around nervously. Harry stoops and goes into the tunnel with Fang just ahead and breathing hard.",
    "4": "The tunnel lies dark and glow making it impossible to stand upright. They do not see a very large spider which drops from the roof behind them silhouetted against the light from the tunnel entrance. The tunnel gradually opens out into a large dimly lit hollow filled with twisted tree roots. Harry and Ron follow the spiders as they swarm across it. But the path stops at a huge hole in the ground surrounded by crumpled cobwebs. The guide disappeared into the hole and unable to go further the boys stopped a little away from it. Harry holds up the lantern unsure of what to do next and Harry and Ron back away as several long hairy legs emerge from the hole and a huge spider as big as a doubledecker bus holds itself above the edge and peers down at them. It has a hairy face and its tiny eyes are set close together and the boys stare openmouthed as Ron stops whimpering. Ron points upwards with a shaking hand and Harry looks up to see dozens of large spiders lowering themselves from the tree roots to dangle about their heads. They are swarming into it as Ron looks around nervously. Harry stoops and goes into the tunnel with Fang just ahead and breathing hard. Ron hesitates for a moment then follows his friend.",
    "5": "They do not see a very large spider which drops from the roof behind them silhouetted against the light from the tunnel entrance. The tunnel gradually opens out into a large dimly lit hollow filled with twisted tree roots. Harry and Ron follow the spiders as they swarm across it. But the path stops at a huge hole in the ground surrounded by crumpled cobwebs. The guide disappeared into the hole and unable to go further the boys stopped a little away from it. Harry holds up the lantern unsure of what to do next and Harry and Ron back away as several long hairy legs emerge from the hole and a huge spider as big as a doubledecker bus holds itself above the edge and peers down at them. It has a hairy face and its tiny eyes are set close together and the boys stare openmouthed as Ron stops whimpering. Ron points upwards with a shaking hand and Harry looks up to see dozens of large spiders lowering themselves from the tree roots to dangle about their heads. They are swarming into it as Ron looks around nervously. Harry stoops and goes into the tunnel with Fang just ahead and breathing hard. Ron hesitates for a moment then follows his friend. The tunnel lies dark and glow making it impossible to stand upright.",
    "6": "The tunnel gradually opens out into a large dimly lit hollow filled with twisted tree roots. Harry and Ron follow the spiders as they swarm across it. But the path stops at a huge hole in the ground surrounded by crumpled cobwebs. The guide disappeared into the hole and unable to go further the boys stopped a little away from it. Harry holds up the lantern unsure of what to do next and Harry and Ron back away as several long hairy legs emerge from the hole and a huge spider as big as a doubledecker bus holds itself above the edge and peers down at them. It has a hairy face and its tiny eyes are set close together and the boys stare openmouthed as Ron stops whimpering. Ron points upwards with a shaking hand and Harry looks up to see dozens of large spiders lowering themselves from the tree roots to dangle about their heads. They are swarming into it as Ron looks around nervously. Harry stoops and goes into the tunnel with Fang just ahead and breathing hard. Ron hesitates for a moment then follows his friend. The tunnel lies dark and glow making it impossible to stand upright. They do not see a very large spider which drops from the roof behind them silhouetted against the light from the tunnel entrance.",
    "7": "Harry and Ron follow the spiders as they swarm across it. But the path stops at a huge hole in the ground surrounded by crumpled cobwebs. The guide disappeared into the hole and unable to go further the boys stopped a little away from it. Harry holds up the lantern unsure of what to do next and Harry and Ron back away as several long hairy legs emerge from the hole and a huge spider as big as a doubledecker bus holds itself above the edge and peers down at them. It has a hairy face and its tiny eyes are set close together and the boys stare openmouthed as Ron stops whimpering. Ron points upwards with a shaking hand and Harry looks up to see dozens of large spiders lowering themselves from the tree roots to dangle about their heads. They are swarming into it as Ron looks around nervously. Harry stoops and goes into the tunnel with Fang just ahead and breathing hard. Ron hesitates for a moment then follows his friend. The tunnel lies dark and glow making it impossible to stand upright. They do not see a very large spider which drops from the roof behind them silhouetted against the light from the tunnel entrance. The tunnel gradually opens out into a large dimly lit hollow filled with twisted tree roots.",
    "8": "But the path stops at a huge hole in the ground surrounded by crumpled cobwebs. The guide disappeared into the hole and unable to go further the boys stopped a little away from it. Harry holds up the lantern unsure of what to do next and Harry and Ron back away as several long hairy legs emerge from the hole and a huge spider as big as a doubledecker bus holds itself above the edge and peers down at them. It has a hairy face and its tiny eyes are set close together and the boys stare openmouthed as Ron stops whimpering. Ron points upwards with a shaking hand and Harry looks up to see dozens of large spiders lowering themselves from the tree roots to dangle about their heads. They are swarming into it as Ron looks around nervously. Harry stoops and goes into the tunnel with Fang just ahead and breathing hard. Ron hesitates for a moment then follows his friend. The tunnel lies dark and glow making it impossible to stand upright. They do not see a very large spider which drops from the roof behind them silhouetted against the light from the tunnel entrance. The tunnel gradually opens out into a large dimly lit hollow filled with twisted tree roots. Harry and Ron follow the spiders as they swarm across it.",
    "9": "The guide disappeared into the hole and unable to go further the boys stopped a little away from it. Harry holds up the lantern unsure of what to do next and Harry and Ron back away as several long hairy legs emerge from the hole and a huge spider as big as a doubledecker bus holds itself above the edge and peers down at them. It has a hairy face and its tiny eyes are set close together and the boys stare openmouthed as Ron stops whimpering. Ron points upwards with a shaking hand and Harry looks up to see dozens of large spiders lowering themselves from the tree roots to dangle about their heads. They are swarming into it as Ron looks around nervously. Harry stoops and goes into the tunnel with Fang just ahead and breathing hard. Ron hesitates for a moment then follows his friend. The tunnel lies dark and glow making it impossible to stand upright. They do not see a very large spider which drops from the roof behind them silhouetted against the light from the tunnel entrance. The tunnel gradually opens out into a large dimly lit hollow filled with twisted tree roots. Harry and Ron follow the spiders as they swarm across it. But the path stops at a huge hole in the ground surrounded by crumpled cobwebs.",
    "10": "Harry holds up the lantern unsure of what to do next and Harry and Ron back away as several long hairy legs emerge from the hole and a huge spider as big as a doubledecker bus holds itself above the edge and peers down at them. It has a hairy face and its tiny eyes are set close together and the boys stare openmouthed as Ron stops whimpering. Ron points upwards with a shaking hand and Harry looks up to see dozens of large spiders lowering themselves from the tree roots to dangle about their heads. They are swarming into it as Ron looks around nervously. Harry stoops and goes into the tunnel with Fang just ahead and breathing hard. Ron hesitates for a moment then follows his friend. The tunnel lies dark and glow making it impossible to stand upright. They do not see a very large spider which drops from the roof behind them silhouetted against the light from the tunnel entrance. The tunnel gradually opens out into a large dimly lit hollow filled with twisted tree roots. Harry and Ron follow the spiders as they swarm across it. But the path stops at a huge hole in the ground surrounded by crumpled cobwebs. The guide disappeared into the hole and unable to go further the boys stopped a little away from it.",
    "11": "It has a hairy face and its tiny eyes are set close together and the boys stare openmouthed as Ron stops whimpering. Ron points upwards with a shaking hand and Harry looks up to see dozens of large spiders lowering themselves from the tree roots to dangle about their heads. They are swarming into it as Ron looks around nervously. Harry stoops and goes into the tunnel with Fang just ahead and breathing hard. Ron hesitates for a moment then follows his friend. The tunnel lies dark and glow making it impossible to stand upright. They do not see a very large spider which drops from the roof behind them silhouetted against the light from the tunnel entrance. The tunnel gradually opens out into a large dimly lit hollow filled with twisted tree roots. Harry and Ron follow the spiders as they swarm across it. But the path stops at a huge hole in the ground surrounded by crumpled cobwebs. The guide disappeared into the hole and unable to go further the boys stopped a little away from it. Harry holds up the lantern unsure of what to do next and Harry and Ron back away as several long hairy legs emerge from the hole and a huge spider as big as a doubledecker bus holds itself above the edge and peers down at them.",
    "12": "Ron points upwards with a shaking hand and Harry looks up to see dozens of large spiders lowering themselves from the tree roots to dangle about their heads. They are swarming into it as Ron looks around nervously. Harry stoops and goes into the tunnel with Fang just ahead and breathing hard. Ron hesitates for a moment then follows his friend. The tunnel lies dark and glow making it impossible to stand upright. They do not see a very large spider which drops from the roof behind them silhouetted against the light from the tunnel entrance. The tunnel gradually opens out into a large dimly lit hollow filled with twisted tree roots. Harry and Ron follow the spiders as they swarm across it. But the path stops at a huge hole in the ground surrounded by crumpled cobwebs. The guide disappeared into the hole and unable to go further the boys stopped a little away from it. Harry holds up the lantern unsure of what to do next and Harry and Ron back away as several long hairy legs emerge from the hole and a huge spider as big as a doubledecker bus holds itself above the edge and peers down at them. It has a hairy face and its tiny eyes are set close together and the boys stare openmouthed as Ron stops whimpering.",
    "13": "They are swarming into it as Ron looks around nervously. Harry stoops and goes into the tunnel with Fang just ahead and breathing hard. Ron hesitates for a moment then follows his friend. The tunnel lies dark and glow making it impossible to stand upright. They do not see a very large spider which drops from the roof behind them silhouetted against the light from the tunnel entrance. The tunnel gradually opens out into a large dimly lit hollow filled with twisted tree roots. Harry and Ron follow the spiders as they swarm across it. But the path stops at a huge hole in the ground surrounded by crumpled cobwebs. The guide disappeared into the hole and unable to go further the boys stopped a little away from it. Harry holds up the lantern unsure of what to do next and Harry and Ron back away as several long hairy legs emerge from the hole and a huge spider as big as a doubledecker bus holds itself above the edge and peers down at them. It has a hairy face and its tiny eyes are set close together and the boys stare openmouthed as Ron stops whimpering. Ron points upwards with a shaking hand and Harry looks up to see dozens of large spiders lowering themselves from the tree roots to dangle about their heads."
  }
}