{
  "ground_truth": "Beside the lifeless head of his enemy the basilisk Harry touches Ginny's hand and she is still clutching the diary. Harry grabs the diary and opens it then raises the basilisk's Poison Fang and stabs the diary. Riddle recoils as a light pierces the hole in his chest and blood spreads over the page. Harry stabs again and Riddle puts a hand to his face as the powerful light surges out of his body and lifts him off his feet. Raising the fang again. Harry closes the diary and stabs with all his might into the black leather cover. In a flash of light Riddle completely disintegrates leaving behind only a few faint sparks floating in the air. Ginny suddenly wakes and looking confused. she sits up and sees Harry who is clutching his arm in pain. Dumbledore's Phoenix swoops down and settles beside Harry looking sadly at his face. The handsome bird lowers its head and its huge tears fall from its eyes onto Harry's arm. Ginny watches her eyes wide with amazement as the Phoenix weeps.",
  "iterations": {
    "1": "Beside the lifeless head of his enemy the basilisk Harry touches Ginny's hand and she is still clutching the diary. Harry grabs the diary and opens it then raises the basilisk's Poison Fang and stabs the diary. Riddle recoils as a light pierces the hole in his chest and blood spreads over the page. Harry stabs again and Riddle puts a hand to his face as the powerful light surges out of his body and lifts him off his feet. Raising the fang again. Harry closes the diary and stabs with all his might into the black leather cover. In a flash of light Riddle completely disintegrates leaving behind only a few faint sparks floating in the air. Ginny suddenly wakes and looking confused. she sits up and sees Harry who is clutching his arm in pain. Dumbledore's Phoenix swoops down and settles beside Harry looking sadly at his face. The handsome bird lowers its head and its huge tears fall from its eyes onto Harry's arm. Ginny watches her eyes wide with amazement as the Phoenix weeps.",
    "2": "Harry grabs the diary and opens it then raises the basilisk's Poison Fang and stabs the diary. Riddle recoils as a light pierces the hole in his chest and blood spreads over the page. Harry stabs again and Riddle puts a hand to his face as the powerful light surges out of his body and lifts him off his feet. Raising the fang again. Harry closes the diary and stabs with all his might into the black leather cover. In a flash of light Riddle completely disintegrates leaving behind only a few faint sparks floating in the air. Ginny suddenly wakes and looking confused. she sits up and sees Harry who is clutching his arm in pain. Dumbledore's Phoenix swoops down and settles beside Harry looking sadly at his face. The handsome bird lowers its head and its huge tears fall from its eyes onto Harry's arm. Ginny watches her eyes wide with amazement as the Phoenix weeps. Beside the lifeless head of his enemy the basilisk Harry touches Ginny's hand and she is still clutching the diary.",
    "3": "Riddle recoils as a light pierces the hole in his chest and blood spreads over the page. Harry stabs again and Riddle puts a hand to his face as the powerful light surges out of his body and lifts him off his feet. Raising the fang again. Harry closes the diary and stabs with all his might into the black leather cover. In a flash of light Riddle completely disintegrates leaving behind only a few faint sparks floating in the air. Ginny suddenly wakes and looking confused. she sits up and sees Harry who is clutching his arm in pain. Dumbledore's Phoenix swoops down and settles beside Harry looking sadly at his face. The handsome bird lowers its head and its huge tears fall from its eyes onto Harry's arm. Ginny watches her eyes wide with amazement as the Phoenix weeps. Beside the lifeless head of his enemy the basilisk Harry touches Ginny's hand and she is still clutching the diary. Harry grabs the diary and opens it then raises the basilisk's Poison Fang and stabs the diary.",
    "4": "Harry stabs again and Riddle puts a hand to his face as the powerful light surges out of his body and lifts him off his feet. Raising the fang again. Harry closes the diary and stabs with all his might into the black leather cover. In a flash of light Riddle completely disintegrates leaving behind only a few faint sparks floating in the air. Ginny suddenly wakes and looking confused. she sits up and sees Harry who is clutching his arm in pain. Dumbledore's Phoenix swoops down and settles beside Harry looking sadly at his face. The handsome bird lowers its head and its huge tears fall from its eyes onto Harry's arm. Ginny watches her eyes wide with amazement as the Phoenix weeps. Beside the lifeless head of his enemy the basilisk Harry touches Ginny's hand and she is still clutching the diary. Harry grabs the diary and opens it then raises the basilisk's Poison Fang and stabs the diary. Riddle recoils as a light pierces the hole in his chest and blood spreads over the page.",
    "5": "Raising the fang again. Harry closes the diary and stabs with all his might into the black leather cover. In a flash of light Riddle completely disintegrates leaving behind only a few faint sparks floating in the air. Ginny suddenly wakes and looking confused. she sits up and sees Harry who is clutching his arm in pain. Dumbledore's Phoenix swoops down and settles beside Harry looking sadly at his face. The handsome bird lowers its head and its huge tears fall from its eyes onto Harry's arm. Ginny watches her eyes wide with amazement as the Phoenix weeps. Beside the lifeless head of his enemy the basilisk Harry touches Ginny's hand and she is still clutching the diary. Harry grabs the diary and opens it then raises the basilisk's Poison Fang and stabs the diary. Riddle recoils as a light pierces the hole in his chest and blood spreads over the page. Harry stabs again and Riddle puts a hand to his face as the powerful light surges out of his body and lifts him off his feet.",
    "6": "Harry closes the diary and stabs with all his might into the black leather cover. In a flash of light Riddle completely disintegrates leaving behind only a few faint sparks floating in the air. Ginny suddenly wakes and looking confused. she sits up and sees Harry who is clutching his arm in pain. Dumbledore's Phoenix swoops down and settles beside Harry looking sadly at his face. The handsome bird lowers its head and its huge tears fall from its eyes onto Harry's arm. Ginny watches her eyes wide with amazement as the Phoenix weeps. Beside the lifeless head of his enemy the basilisk Harry touches Ginny's hand and she is still clutching the diary. Harry grabs the diary and opens it then raises the basilisk's Poison Fang and stabs the diary. Riddle recoils as a light pierces the hole in his chest and blood spreads over the page. Harry stabs again and Riddle puts a hand to his face as the powerful light surges out of his body and lifts him off his feet. Raising the fang again.",
    "7": "In a flash of light Riddle completely disintegrates leaving behind only a few faint sparks floating in the air. Ginny suddenly wakes and looking confused. she sits up and sees Harry who is clutching his arm in pain. Dumbledore's Phoenix swoops down and settles beside Harry looking sadly at his face. The handsome bird lowers its head and its huge tears fall from its eyes onto Harry's arm. Ginny watches her eyes wide with amazement as the Phoenix weeps. Beside the lifeless head of his enemy the basilisk Harry touches Ginny's hand and she is still clutching the diary. Harry grabs the diary and opens it then raises the basilisk's Poison Fang and stabs the diary. Riddle recoils as a light pierces the hole in his chest and blood spreads over the page. Harry stabs again and Riddle puts a hand to his face as the powerful light surges out of his body and lifts him off his feet. Raising the fang again. Harry closes the diary and stabs with all his might into the black leather cover.",
    "8": "Ginny suddenly wakes and looking confused. she sits up and sees Harry who is clutching his arm in pain. Dumbledore's Phoenix swoops down and settles beside Harry looking sadly at his face. The handsome bird lowers its head and its huge tears fall from its eyes onto Harry's arm. Ginny watches her eyes wide with amazement as the Phoenix weeps. Beside the lifeless head of his enemy the basilisk Harry touches Ginny's hand and she is still clutching the diary. Harry grabs the diary and opens it then raises the basilisk's Poison Fang and stabs the diary. Riddle recoils as a light pierces the hole in his chest and blood spreads over the page. Harry stabs again and Riddle puts a hand to his face as the powerful light surges out of his body and lifts him off his feet. Raising the fang again. Harry closes the diary and stabs with all his might into the black leather cover. In a flash of light Riddle completely disintegrates leaving behind only a few faint sparks floating in the air.",
    "9": "she sits up and sees Harry who is clutching his arm in pain. Dumbledore's Phoenix swoops down and settles beside Harry looking sadly at his face. The handsome bird lowers its head and its huge tears fall from its eyes onto Harry's arm. Ginny watches her eyes wide with amazement as the Phoenix weeps. Beside the lifeless head of his enemy the basilisk Harry touches Ginny's hand and she is still clutching the diary. Harry grabs the diary and opens it then raises the basilisk's Poison Fang and stabs the diary. Riddle recoils as a light pierces the hole in his chest and blood spreads over the page. Harry stabs again and Riddle puts a hand to his face as the powerful light surges out of his body and lifts him off his feet. Raising the fang again. Harry closes the diary and stabs with all his might into the black leather cover. In a flash of light Riddle completely disintegrates leaving behind only a few faint sparks floating in the air. Ginny suddenly wakes and looking confused.",
    "10": "Dumbledore's Phoenix swoops down and settles beside Harry looking sadly at his face. The handsome bird lowers its head and its huge tears fall from its eyes onto Harry's arm. Ginny watches her eyes wide with amazement as the Phoenix weeps. Beside the lifeless head of his enemy the basilisk Harry touches Ginny's hand and she is still clutching the diary. Harry grabs the diary and opens it then raises the basilisk's Poison Fang and stabs the diary. Riddle recoils as a light pierces the hole in his chest and blood spreads over the page. Harry stabs again and Riddle puts a hand to his face as the powerful light surges out of his body and lifts him off his feet. Raising the fang again. Harry closes the diary and stabs with all his might into the black leather cover. In a flash of light Riddle completely disintegrates leaving behind only a few faint sparks floating in the air. Ginny suddenly wakes and looking confused. she sits up and sees Harry who is clutching his arm in pain.",
    "11": "The handsome bird lowers its head and its huge tears fall from its eyes onto Harry's arm. Ginny watches her eyes wide with amazement as the Phoenix weeps. Beside the lifeless head of his enemy the basilisk Harry touches Ginny's hand and she is still clutching the diary. Harry grabs the diary and opens it then raises the basilisk's Poison Fang and stabs the diary. Riddle recoils as a light pierces the hole in his chest and blood spreads over the page. Harry stabs again and Riddle puts a hand to his face as the powerful light surges out of his body and lifts him off his feet. Raising the fang again. Harry closes the diary and stabs with all his might into the black leather cover. In a flash of light Riddle completely disintegrates leaving behind only a few faint sparks floating in the air. Ginny suddenly wakes and looking confused. she sits up and sees Harry who is clutching his arm in pain. Dumbledore's Phoenix swoops down and settles beside Harry looking sadly at his face.",
    "12": "Ginny watches her eyes wide with amazement as the Phoenix weeps. Beside the lifeless head of his enemy the basilisk Harry touches Ginny's hand and she is still clutching the diary. Harry grabs the diary and opens it then raises the basilisk's Poison Fang and stabs the diary. Riddle recoils as a light pierces the hole in his chest and blood spreads over the page. Harry stabs again and Riddle puts a hand to his face as the powerful light surges out of his body and lifts him off his feet. Raising the fang again. Harry closes the diary and stabs with all his might into the black leather cover. In a flash of light Riddle completely disintegrates leaving behind only a few faint sparks floating in the air. Ginny suddenly wakes and looking confused. she sits up and sees Harry who is clutching his arm in pain. Dumbledore's Phoenix swoops down and settles beside Harry looking sadly at his face. The handsome bird lowers its head and its huge tears fall from its eyes onto Harry's arm.",
    "13": "Beside the lifeless head of his enemy the basilisk Harry touches Ginny's hand and she is still clutching the diary. Harry grabs the diary and opens it then raises the basilisk's Poison Fang and stabs the diary. Riddle recoils as a light pierces the hole in his chest and blood spreads over the page. Harry stabs again and Riddle puts a hand to his face as the powerful light surges out of his body and lifts him off his feet. Raising the fang again. Harry closes the diary and stabs with all his might into the black leather cover. In a flash of light Riddle completely disintegrates leaving behind only a few faint sparks floating in the air. Ginny suddenly wakes and looking confused. she sits up and sees Harry who is clutching his arm in pain. Dumbledore's Phoenix swoops down and settles beside Harry looking sadly at his face. The handsome bird lowers its head and its huge tears fall from its eyes onto Harry's arm. Ginny watches her eyes wide with amazement as the Phoenix weeps."
  }
}