{
  "ground_truth": "They sheath their swords and join the black chess pieces. Ron climbs onto the stone horse of the black knight and looks across the board as a white pawn moves itself forward. Hermione looks at Ron anxiously and obeying Ron's instructions. a black pawn moves forward and is sliced off by the white pawn. The game gets underway. a white bishop explodes a white knight hits the dust and a black pawn is destroyed. A white bishop and a white knight explode and the white queen attacks a black castle which explodes in a shower of stone fragments and collapses in a pile of rubble. The queen turns triumphantly. Ron contemplates his next move and watching the merciless white queen. Harry suddenly understands the game that Ron is playing and nods. Taking a deep breath Ron clutches the horse's reins closes his eyes and the black horse starts to move across the board between the remains of the shattered stone chess pieces. Ron looks nervously at the white king who wears a silver helmet clasping a powerful sword with his hands encased in metal armor.",
  "iterations": {
    "1": "They sheath their swords and join the black chess pieces. Ron climbs onto the stone horse of the black knight and looks across the board as a white pawn moves itself forward. Hermione looks at Ron anxiously and obeying Ron's instructions. a black pawn moves forward and is sliced off by the white pawn. The game gets underway. a white bishop explodes a white knight hits the dust and a black pawn is destroyed. A white bishop and a white knight explode and the white queen attacks a black castle which explodes in a shower of stone fragments and collapses in a pile of rubble. The queen turns triumphantly. Ron contemplates his next move and watching the merciless white queen. Harry suddenly understands the game that Ron is playing and nods. Taking a deep breath Ron clutches the horse's reins closes his eyes and the black horse starts to move across the board between the remains of the shattered stone chess pieces. Ron looks nervously at the white king who wears a silver helmet clasping a powerful sword with his hands encased in metal armor.",
    "2": "Ron climbs onto the stone horse of the black knight and looks across the board as a white pawn moves itself forward. Hermione looks at Ron anxiously and obeying Ron's instructions. a black pawn moves forward and is sliced off by the white pawn. The game gets underway. a white bishop explodes a white knight hits the dust and a black pawn is destroyed. A white bishop and a white knight explode and the white queen attacks a black castle which explodes in a shower of stone fragments and collapses in a pile of rubble. The queen turns triumphantly. Ron contemplates his next move and watching the merciless white queen. Harry suddenly understands the game that Ron is playing and nods. Taking a deep breath Ron clutches the horse's reins closes his eyes and the black horse starts to move across the board between the remains of the shattered stone chess pieces. Ron looks nervously at the white king who wears a silver helmet clasping a powerful sword with his hands encased in metal armor. They sheath their swords and join the black chess pieces.",
    "3": "Hermione looks at Ron anxiously and obeying Ron's instructions. a black pawn moves forward and is sliced off by the white pawn. The game gets underway. a white bishop explodes a white knight hits the dust and a black pawn is destroyed. A white bishop and a white knight explode and the white queen attacks a black castle which explodes in a shower of stone fragments and collapses in a pile of rubble. The queen turns triumphantly. Ron contemplates his next move and watching the merciless white queen. Harry suddenly understands the game that Ron is playing and nods. Taking a deep breath Ron clutches the horse's reins closes his eyes and the black horse starts to move across the board between the remains of the shattered stone chess pieces. Ron looks nervously at the white king who wears a silver helmet clasping a powerful sword with his hands encased in metal armor. They sheath their swords and join the black chess pieces. Ron climbs onto the stone horse of the black knight and looks across the board as a white pawn moves itself forward.",
    "4": "a black pawn moves forward and is sliced off by the white pawn. The game gets underway. a white bishop explodes a white knight hits the dust and a black pawn is destroyed. A white bishop and a white knight explode and the white queen attacks a black castle which explodes in a shower of stone fragments and collapses in a pile of rubble. The queen turns triumphantly. Ron contemplates his next move and watching the merciless white queen. Harry suddenly understands the game that Ron is playing and nods. Taking a deep breath Ron clutches the horse's reins closes his eyes and the black horse starts to move across the board between the remains of the shattered stone chess pieces. Ron looks nervously at the white king who wears a silver helmet clasping a powerful sword with his hands encased in metal armor. They sheath their swords and join the black chess pieces. Ron climbs onto the stone horse of the black knight and looks across the board as a white pawn moves itself forward. Hermione looks at Ron anxiously and obeying Ron's instructions.",
    "5": "The game gets underway. a white bishop explodes a white knight hits the dust and a black pawn is destroyed. A white bishop and a white knight explode and the white queen attacks a black castle which explodes in a shower of stone fragments and collapses in a pile of rubble. The queen turns triumphantly. Ron contemplates his next move and watching the merciless white queen. Harry suddenly understands the game that Ron is playing and nods. Taking a deep breath Ron clutches the horse's reins closes his eyes and the black horse starts to move across the board between the remains of the shattered stone chess pieces. Ron looks nervously at the white king who wears a silver helmet clasping a powerful sword with his hands encased in metal armor. They sheath their swords and join the black chess pieces. Ron climbs onto the stone horse of the black knight and looks across the board as a white pawn moves itself forward. Hermione looks at Ron anxiously and obeying Ron's instructions. a black pawn moves forward and is sliced off by the white pawn.",
    "6": "a white bishop explodes a white knight hits the dust and a black pawn is destroyed. A white bishop and a white knight explode and the white queen attacks a black castle which explodes in a shower of stone fragments and collapses in a pile of rubble. The queen turns triumphantly. Ron contemplates his next move and watching the merciless white queen. Harry suddenly understands the game that Ron is playing and nods. Taking a deep breath Ron clutches the horse's reins closes his eyes and the black horse starts to move across the board between the remains of the shattered stone chess pieces. Ron looks nervously at the white king who wears a silver helmet clasping a powerful sword with his hands encased in metal armor. They sheath their swords and join the black chess pieces. Ron climbs onto the stone horse of the black knight and looks across the board as a white pawn moves itself forward. Hermione looks at Ron anxiously and obeying Ron's instructions. a black pawn moves forward and is sliced off by the white pawn. The game gets underway.",
    "7": "A white bishop and a white knight explode and the white queen attacks a black castle which explodes in a shower of stone fragments and collapses in a pile of rubble. The queen turns triumphantly. Ron contemplates his next move and watching the merciless white queen. Harry suddenly understands the game that Ron is playing and nods. Taking a deep breath Ron clutches the horse's reins closes his eyes and the black horse starts to move across the board between the remains of the shattered stone chess pieces. Ron looks nervously at the white king who wears a silver helmet clasping a powerful sword with his hands encased in metal armor. They sheath their swords and join the black chess pieces. Ron climbs onto the stone horse of the black knight and looks across the board as a white pawn moves itself forward. Hermione looks at Ron anxiously and obeying Ron's instructions. a black pawn moves forward and is sliced off by the white pawn. The game gets underway. a white bishop explodes a white knight hits the dust and a black pawn is destroyed.",
    "8": "The queen turns triumphantly. Ron contemplates his next move and watching the merciless white queen. Harry suddenly understands the game that Ron is playing and nods. Taking a deep breath Ron clutches the horse's reins closes his eyes and the black horse starts to move across the board between the remains of the shattered stone chess pieces. Ron looks nervously at the white king who wears a silver helmet clasping a powerful sword with his hands encased in metal armor. They sheath their swords and join the black chess pieces. Ron climbs onto the stone horse of the black knight and looks across the board as a white pawn moves itself forward. Hermione looks at Ron anxiously and obeying Ron's instructions. a black pawn moves forward and is sliced off by the white pawn. The game gets underway. a white bishop explodes a white knight hits the dust and a black pawn is destroyed. A white bishop and a white knight explode and the white queen attacks a black castle which explodes in a shower of stone fragments and collapses in a pile of rubble.",
    "9": "Ron contemplates his next move and watching the merciless white queen. Harry suddenly understands the game that Ron is playing and nods. Taking a deep breath Ron clutches the horse's reins closes his eyes and the black horse starts to move across the board between the remains of the shattered stone chess pieces. Ron looks nervously at the white king who wears a silver helmet clasping a powerful sword with his hands encased in metal armor. They sheath their swords and join the black chess pieces. Ron climbs onto the stone horse of the black knight and looks across the board as a white pawn moves itself forward. Hermione looks at Ron anxiously and obeying Ron's instructions. a black pawn moves forward and is sliced off by the white pawn. The game gets underway. a white bishop explodes a white knight hits the dust and a black pawn is destroyed. A white bishop and a white knight explode and the white queen attacks a black castle which explodes in a shower of stone fragments and collapses in a pile of rubble. The queen turns triumphantly.",
    "10": "Harry suddenly understands the game that Ron is playing and nods. Taking a deep breath Ron clutches the horse's reins closes his eyes and the black horse starts to move across the board between the remains of the shattered stone chess pieces. Ron looks nervously at the white king who wears a silver helmet clasping a powerful sword with his hands encased in metal armor. They sheath their swords and join the black chess pieces. Ron climbs onto the stone horse of the black knight and looks across the board as a white pawn moves itself forward. Hermione looks at Ron anxiously and obeying Ron's instructions. a black pawn moves forward and is sliced off by the white pawn. The game gets underway. a white bishop explodes a white knight hits the dust and a black pawn is destroyed. A white bishop and a white knight explode and the white queen attacks a black castle which explodes in a shower of stone fragments and collapses in a pile of rubble. The queen turns triumphantly. Ron contemplates his next move and watching the merciless white queen.",
    "11": "Taking a deep breath Ron clutches the horse's reins closes his eyes and the black horse starts to move across the board between the remains of the shattered stone chess pieces. Ron looks nervously at the white king who wears a silver helmet clasping a powerful sword with his hands encased in metal armor. They sheath their swords and join the black chess pieces. Ron climbs onto the stone horse of the black knight and looks across the board as a white pawn moves itself forward. Hermione looks at Ron anxiously and obeying Ron's instructions. a black pawn moves forward and is sliced off by the white pawn. The game gets underway. a white bishop explodes a white knight hits the dust and a black pawn is destroyed. A white bishop and a white knight explode and the white queen attacks a black castle which explodes in a shower of stone fragments and collapses in a pile of rubble. The queen turns triumphantly. Ron contemplates his next move and watching the merciless white queen. Harry suddenly understands the game that Ron is playing and nods.",
    "12": "Ron looks nervously at the white king who wears a silver helmet clasping a powerful sword with his hands encased in metal armor. They sheath their swords and join the black chess pieces. Ron climbs onto the stone horse of the black knight and looks across the board as a white pawn moves itself forward. Hermione looks at Ron anxiously and obeying Ron's instructions. a black pawn moves forward and is sliced off by the white pawn. The game gets underway. a white bishop explodes a white knight hits the dust and a black pawn is destroyed. A white bishop and a white knight explode and the white queen attacks a black castle which explodes in a shower of stone fragments and collapses in a pile of rubble. The queen turns triumphantly. Ron contemplates his next move and watching the merciless white queen. Harry suddenly understands the game that Ron is playing and nods. Taking a deep breath Ron clutches the horse's reins closes his eyes and the black horse starts to move across the board between the remains of the shattered stone chess pieces.",
    "13": "They sheath their swords and join the black chess pieces. Ron climbs onto the stone horse of the black knight and looks across the board as a white pawn moves itself forward. Hermione looks at Ron anxiously and obeying Ron's instructions. a black pawn moves forward and is sliced off by the white pawn. The game gets underway. a white bishop explodes a white knight hits the dust and a black pawn is destroyed. A white bishop and a white knight explode and the white queen attacks a black castle which explodes in a shower of stone fragments and collapses in a pile of rubble. The queen turns triumphantly. Ron contemplates his next move and watching the merciless white queen. Harry suddenly understands the game that Ron is playing and nods. Taking a deep breath Ron clutches the horse's reins closes his eyes and the black horse starts to move across the board between the remains of the shattered stone chess pieces. Ron looks nervously at the white king who wears a silver helmet clasping a powerful sword with his hands encased in metal armor."
  }
}