{
  "ground_truth": "Buckbeak lifts his head opens his beak and grabs a bat. The bats fly out into the open and swoop low over Harry and Hermione's heads and they look back towards the hippogriff. In the distance they see again the dog and the werewolf fighting by the willow tree and Harry and Hermione run through the undergrowth. Ahead of them the werewolf flings the dog against the rock and Harry sees himself throwing a stone and the werewolf turning and advancing on him. Hermione howls as they race back the way they came through the moonlit forest stumbling over the uneven ground. Close behind the savage werewolf lopes easily after them and Harry trips over a tree root but Hermione helps him up. Eventually they stop to catch their breath hiding behind the gnarled trunk of a huge tree. The werewolf sniffs the ground and then disappears around the other side of the tree and they look around cautiously before creeping away nervously. The vicious creature appears behind them. it moves forward and rears up about to strike. Flapping his huge wings Buckbeak attacks claws the werewolf with his talons and it slinks away. Hermione hides her face on Harry's shoulder as a blast of air scatters the dry leaves at their feet.",
  "iterations": {
    "1": "Buckbeak lifts his head opens his beak and grabs a bat. The bats fly out into the open and swoop low over Harry and Hermione's heads and they look back towards the hippogriff. In the distance they see again the dog and the werewolf fighting by the willow tree and Harry and Hermione run through the undergrowth. Ahead of them the werewolf flings the dog against the rock and Harry sees himself throwing a stone and the werewolf turning and advancing on him. Hermione howls as they race back the way they came through the moonlit forest stumbling over the uneven ground. Close behind the savage werewolf lopes easily after them and Harry trips over a tree root but Hermione helps him up. Eventually they stop to catch their breath hiding behind the gnarled trunk of a huge tree. The werewolf sniffs the ground and then disappears around the other side of the tree and they look around cautiously before creeping away nervously. The vicious creature appears behind them. it moves forward and rears up about to strike. Flapping his huge wings Buckbeak attacks claws the werewolf with his talons and it slinks away. Hermione hides her face on Harry's shoulder as a blast of air scatters the dry leaves at their feet.",
    "2": "The bats fly out into the open and swoop low over Harry and Hermione's heads and they look back towards the hippogriff. In the distance they see again the dog and the werewolf fighting by the willow tree and Harry and Hermione run through the undergrowth. Ahead of them the werewolf flings the dog against the rock and Harry sees himself throwing a stone and the werewolf turning and advancing on him. Hermione howls as they race back the way they came through the moonlit forest stumbling over the uneven ground. Close behind the savage werewolf lopes easily after them and Harry trips over a tree root but Hermione helps him up. Eventually they stop to catch their breath hiding behind the gnarled trunk of a huge tree. The werewolf sniffs the ground and then disappears around the other side of the tree and they look around cautiously before creeping away nervously. The vicious creature appears behind them. it moves forward and rears up about to strike. Flapping his huge wings Buckbeak attacks claws the werewolf with his talons and it slinks away. Hermione hides her face on Harry's shoulder as a blast of air scatters the dry leaves at their feet. Buckbeak lifts his head opens his beak and grabs a bat.",
    "3": "In the distance they see again the dog and the werewolf fighting by the willow tree and Harry and Hermione run through the undergrowth. Ahead of them the werewolf flings the dog against the rock and Harry sees himself throwing a stone and the werewolf turning and advancing on him. Hermione howls as they race back the way they came through the moonlit forest stumbling over the uneven ground. Close behind the savage werewolf lopes easily after them and Harry trips over a tree root but Hermione helps him up. Eventually they stop to catch their breath hiding behind the gnarled trunk of a huge tree. The werewolf sniffs the ground and then disappears around the other side of the tree and they look around cautiously before creeping away nervously. The vicious creature appears behind them. it moves forward and rears up about to strike. Flapping his huge wings Buckbeak attacks claws the werewolf with his talons and it slinks away. Hermione hides her face on Harry's shoulder as a blast of air scatters the dry leaves at their feet. Buckbeak lifts his head opens his beak and grabs a bat. The bats fly out into the open and swoop low over Harry and Hermione's heads and they look back towards the hippogriff.",
    "4": "Ahead of them the werewolf flings the dog against the rock and Harry sees himself throwing a stone and the werewolf turning and advancing on him. Hermione howls as they race back the way they came through the moonlit forest stumbling over the uneven ground. Close behind the savage werewolf lopes easily after them and Harry trips over a tree root but Hermione helps him up. Eventually they stop to catch their breath hiding behind the gnarled trunk of a huge tree. The werewolf sniffs the ground and then disappears around the other side of the tree and they look around cautiously before creeping away nervously. The vicious creature appears behind them. it moves forward and rears up about to strike. Flapping his huge wings Buckbeak attacks claws the werewolf with his talons and it slinks away. Hermione hides her face on Harry's shoulder as a blast of air scatters the dry leaves at their feet. Buckbeak lifts his head opens his beak and grabs a bat. The bats fly out into the open and swoop low over Harry and Hermione's heads and they look back towards the hippogriff. In the distance they see again the dog and the werewolf fighting by the willow tree and Harry and Hermione run through the undergrowth.",
    "5": "Hermione howls as they race back the way they came through the moonlit forest stumbling over the uneven ground. Close behind the savage werewolf lopes easily after them and Harry trips over a tree root but Hermione helps him up. Eventually they stop to catch their breath hiding behind the gnarled trunk of a huge tree. The werewolf sniffs the ground and then disappears around the other side of the tree and they look around cautiously before creeping away nervously. The vicious creature appears behind them. it moves forward and rears up about to strike. Flapping his huge wings Buckbeak attacks claws the werewolf with his talons and it slinks away. Hermione hides her face on Harry's shoulder as a blast of air scatters the dry leaves at their feet. Buckbeak lifts his head opens his beak and grabs a bat. The bats fly out into the open and swoop low over Harry and Hermione's heads and they look back towards the hippogriff. In the distance they see again the dog and the werewolf fighting by the willow tree and Harry and Hermione run through the undergrowth. Ahead of them the werewolf flings the dog against the rock and Harry sees himself throwing a stone and the werewolf turning and advancing on him.",
    "6": "Close behind the savage werewolf lopes easily after them and Harry trips over a tree root but Hermione helps him up. Eventually they stop to catch their breath hiding behind the gnarled trunk of a huge tree. The werewolf sniffs the ground and then disappears around the other side of the tree and they look around cautiously before creeping away nervously. The vicious creature appears behind them. it moves forward and rears up about to strike. Flapping his huge wings Buckbeak attacks claws the werewolf with his talons and it slinks away. Hermione hides her face on Harry's shoulder as a blast of air scatters the dry leaves at their feet. Buckbeak lifts his head opens his beak and grabs a bat. The bats fly out into the open and swoop low over Harry and Hermione's heads and they look back towards the hippogriff. In the distance they see again the dog and the werewolf fighting by the willow tree and Harry and Hermione run through the undergrowth. Ahead of them the werewolf flings the dog against the rock and Harry sees himself throwing a stone and the werewolf turning and advancing on him. Hermione howls as they race back the way they came through the moonlit forest stumbling over the uneven ground.",
    "7": "Eventually they stop to catch their breath hiding behind the gnarled trunk of a huge tree. The werewolf sniffs the ground and then disappears around the other side of the tree and they look around cautiously before creeping away nervously. The vicious creature appears behind them. it moves forward and rears up about to strike. Flapping his huge wings Buckbeak attacks claws the werewolf with his talons and it slinks away. Hermione hides her face on Harry's shoulder as a blast of air scatters the dry leaves at their feet. Buckbeak lifts his head opens his beak and grabs a bat. The bats fly out into the open and swoop low over Harry and Hermione's heads and they look back towards the hippogriff. In the distance they see again the dog and the werewolf fighting by the willow tree and Harry and Hermione run through the undergrowth. Ahead of them the werewolf flings the dog against the rock and Harry sees himself throwing a stone and the werewolf turning and advancing on him. Hermione howls as they race back the way they came through the moonlit forest stumbling over the uneven ground. Close behind the savage werewolf lopes easily after them and Harry trips over a tree root but Hermione helps him up.",
    "8": "The werewolf sniffs the ground and then disappears around the other side of the tree and they look around cautiously before creeping away nervously. The vicious creature appears behind them. it moves forward and rears up about to strike. Flapping his huge wings Buckbeak attacks claws the werewolf with his talons and it slinks away. Hermione hides her face on Harry's shoulder as a blast of air scatters the dry leaves at their feet. Buckbeak lifts his head opens his beak and grabs a bat. The bats fly out into the open and swoop low over Harry and Hermione's heads and they look back towards the hippogriff. In the distance they see again the dog and the werewolf fighting by the willow tree and Harry and Hermione run through the undergrowth. Ahead of them the werewolf flings the dog against the rock and Harry sees himself throwing a stone and the werewolf turning and advancing on him. Hermione howls as they race back the way they came through the moonlit forest stumbling over the uneven ground. Close behind the savage werewolf lopes easily after them and Harry trips over a tree root but Hermione helps him up. Eventually they stop to catch their breath hiding behind the gnarled trunk of a huge tree.",
    "9": "The vicious creature appears behind them. it moves forward and rears up about to strike. Flapping his huge wings Buckbeak attacks claws the werewolf with his talons and it slinks away. Hermione hides her face on Harry's shoulder as a blast of air scatters the dry leaves at their feet. Buckbeak lifts his head opens his beak and grabs a bat. The bats fly out into the open and swoop low over Harry and Hermione's heads and they look back towards the hippogriff. In the distance they see again the dog and the werewolf fighting by the willow tree and Harry and Hermione run through the undergrowth. Ahead of them the werewolf flings the dog against the rock and Harry sees himself throwing a stone and the werewolf turning and advancing on him. Hermione howls as they race back the way they came through the moonlit forest stumbling over the uneven ground. Close behind the savage werewolf lopes easily after them and Harry trips over a tree root but Hermione helps him up. Eventually they stop to catch their breath hiding behind the gnarled trunk of a huge tree. The werewolf sniffs the ground and then disappears around the other side of the tree and they look around cautiously before creeping away nervously.",
    "10": "it moves forward and rears up about to strike. Flapping his huge wings Buckbeak attacks claws the werewolf with his talons and it slinks away. Hermione hides her face on Harry's shoulder as a blast of air scatters the dry leaves at their feet. Buckbeak lifts his head opens his beak and grabs a bat. The bats fly out into the open and swoop low over Harry and Hermione's heads and they look back towards the hippogriff. In the distance they see again the dog and the werewolf fighting by the willow tree and Harry and Hermione run through the undergrowth. Ahead of them the werewolf flings the dog against the rock and Harry sees himself throwing a stone and the werewolf turning and advancing on him. Hermione howls as they race back the way they came through the moonlit forest stumbling over the uneven ground. Close behind the savage werewolf lopes easily after them and Harry trips over a tree root but Hermione helps him up. Eventually they stop to catch their breath hiding behind the gnarled trunk of a huge tree. The werewolf sniffs the ground and then disappears around the other side of the tree and they look around cautiously before creeping away nervously. The vicious creature appears behind them.",
    "11": "Flapping his huge wings Buckbeak attacks claws the werewolf with his talons and it slinks away. Hermione hides her face on Harry's shoulder as a blast of air scatters the dry leaves at their feet. Buckbeak lifts his head opens his beak and grabs a bat. The bats fly out into the open and swoop low over Harry and Hermione's heads and they look back towards the hippogriff. In the distance they see again the dog and the werewolf fighting by the willow tree and Harry and Hermione run through the undergrowth. Ahead of them the werewolf flings the dog against the rock and Harry sees himself throwing a stone and the werewolf turning and advancing on him. Hermione howls as they race back the way they came through the moonlit forest stumbling over the uneven ground. Close behind the savage werewolf lopes easily after them and Harry trips over a tree root but Hermione helps him up. Eventually they stop to catch their breath hiding behind the gnarled trunk of a huge tree. The werewolf sniffs the ground and then disappears around the other side of the tree and they look around cautiously before creeping away nervously. The vicious creature appears behind them. it moves forward and rears up about to strike.",
    "12": "Hermione hides her face on Harry's shoulder as a blast of air scatters the dry leaves at their feet. Buckbeak lifts his head opens his beak and grabs a bat. The bats fly out into the open and swoop low over Harry and Hermione's heads and they look back towards the hippogriff. In the distance they see again the dog and the werewolf fighting by the willow tree and Harry and Hermione run through the undergrowth. Ahead of them the werewolf flings the dog against the rock and Harry sees himself throwing a stone and the werewolf turning and advancing on him. Hermione howls as they race back the way they came through the moonlit forest stumbling over the uneven ground. Close behind the savage werewolf lopes easily after them and Harry trips over a tree root but Hermione helps him up. Eventually they stop to catch their breath hiding behind the gnarled trunk of a huge tree. The werewolf sniffs the ground and then disappears around the other side of the tree and they look around cautiously before creeping away nervously. The vicious creature appears behind them. it moves forward and rears up about to strike. Flapping his huge wings Buckbeak attacks claws the werewolf with his talons and it slinks away.",
    "13": "Buckbeak lifts his head opens his beak and grabs a bat. The bats fly out into the open and swoop low over Harry and Hermione's heads and they look back towards the hippogriff. In the distance they see again the dog and the werewolf fighting by the willow tree and Harry and Hermione run through the undergrowth. Ahead of them the werewolf flings the dog against the rock and Harry sees himself throwing a stone and the werewolf turning and advancing on him. Hermione howls as they race back the way they came through the moonlit forest stumbling over the uneven ground. Close behind the savage werewolf lopes easily after them and Harry trips over a tree root but Hermione helps him up. Eventually they stop to catch their breath hiding behind the gnarled trunk of a huge tree. The werewolf sniffs the ground and then disappears around the other side of the tree and they look around cautiously before creeping away nervously. The vicious creature appears behind them. it moves forward and rears up about to strike. Flapping his huge wings Buckbeak attacks claws the werewolf with his talons and it slinks away. Hermione hides her face on Harry's shoulder as a blast of air scatters the dry leaves at their feet."
  }
}