{
  "ground_truth": "The soldier with the dancing girl drags her towards his hut and she struggles. He slaps her causing her to fall to the ground then gestures to the hut and crawls underneath it. Unseen by the soldier EnJoo clamps a hand over her mouth and holds a finger to his lips. The soldier looks underneath the hut for the girl and EnJoo dives towards him plunging a knife into his throat and stabbing repeatedly. He drags the soldier's body out of sight. Rambo runs out to a hut and dives underneath it seeing Sarah lying prone in the pig sty. He throws open a wooden bolt opens a gate and crawls inside. He looks out through the timbers and sees the soldier with the bottle of spirits returning. Sarah is asleep or unconscious and Rambo rushes over to the partition between them pushing pigs out of the way. EnJoo checks his watch—10 seconds to 2. On the watch tower School Boy has a soldier in the site of his weapon and his watch shows 2 AM. He fires starting by picking off the guard below and the guards in two adjacent watch towers.",
  "iterations": {
    "1": "The soldier with the dancing girl drags her towards his hut and she struggles. He slaps her causing her to fall to the ground then gestures to the hut and crawls underneath it. Unseen by the soldier EnJoo clamps a hand over her mouth and holds a finger to his lips. The soldier looks underneath the hut for the girl and EnJoo dives towards him plunging a knife into his throat and stabbing repeatedly. He drags the soldier's body out of sight. Rambo runs out to a hut and dives underneath it seeing Sarah lying prone in the pig sty. He throws open a wooden bolt opens a gate and crawls inside. He looks out through the timbers and sees the soldier with the bottle of spirits returning. Sarah is asleep or unconscious and Rambo rushes over to the partition between them pushing pigs out of the way. EnJoo checks his watch—10 seconds to 2. On the watch tower School Boy has a soldier in the site of his weapon and his watch shows 2 AM. He fires starting by picking off the guard below and the guards in two adjacent watch towers.",
    "2": "He slaps her causing her to fall to the ground then gestures to the hut and crawls underneath it. Unseen by the soldier EnJoo clamps a hand over her mouth and holds a finger to his lips. The soldier looks underneath the hut for the girl and EnJoo dives towards him plunging a knife into his throat and stabbing repeatedly. He drags the soldier's body out of sight. Rambo runs out to a hut and dives underneath it seeing Sarah lying prone in the pig sty. He throws open a wooden bolt opens a gate and crawls inside. He looks out through the timbers and sees the soldier with the bottle of spirits returning. Sarah is asleep or unconscious and Rambo rushes over to the partition between them pushing pigs out of the way. EnJoo checks his watch—10 seconds to 2. On the watch tower School Boy has a soldier in the site of his weapon and his watch shows 2 AM. He fires starting by picking off the guard below and the guards in two adjacent watch towers. The soldier with the dancing girl drags her towards his hut and she struggles.",
    "3": "Unseen by the soldier EnJoo clamps a hand over her mouth and holds a finger to his lips. The soldier looks underneath the hut for the girl and EnJoo dives towards him plunging a knife into his throat and stabbing repeatedly. He drags the soldier's body out of sight. Rambo runs out to a hut and dives underneath it seeing Sarah lying prone in the pig sty. He throws open a wooden bolt opens a gate and crawls inside. He looks out through the timbers and sees the soldier with the bottle of spirits returning. Sarah is asleep or unconscious and Rambo rushes over to the partition between them pushing pigs out of the way. EnJoo checks his watch—10 seconds to 2. On the watch tower School Boy has a soldier in the site of his weapon and his watch shows 2 AM. He fires starting by picking off the guard below and the guards in two adjacent watch towers. The soldier with the dancing girl drags her towards his hut and she struggles. He slaps her causing her to fall to the ground then gestures to the hut and crawls underneath it.",
    "4": "The soldier looks underneath the hut for the girl and EnJoo dives towards him plunging a knife into his throat and stabbing repeatedly. He drags the soldier's body out of sight. Rambo runs out to a hut and dives underneath it seeing Sarah lying prone in the pig sty. He throws open a wooden bolt opens a gate and crawls inside. He looks out through the timbers and sees the soldier with the bottle of spirits returning. Sarah is asleep or unconscious and Rambo rushes over to the partition between them pushing pigs out of the way. EnJoo checks his watch—10 seconds to 2. On the watch tower School Boy has a soldier in the site of his weapon and his watch shows 2 AM. He fires starting by picking off the guard below and the guards in two adjacent watch towers. The soldier with the dancing girl drags her towards his hut and she struggles. He slaps her causing her to fall to the ground then gestures to the hut and crawls underneath it. Unseen by the soldier EnJoo clamps a hand over her mouth and holds a finger to his lips.",
    "5": "He drags the soldier's body out of sight. Rambo runs out to a hut and dives underneath it seeing Sarah lying prone in the pig sty. He throws open a wooden bolt opens a gate and crawls inside. He looks out through the timbers and sees the soldier with the bottle of spirits returning. Sarah is asleep or unconscious and Rambo rushes over to the partition between them pushing pigs out of the way. EnJoo checks his watch—10 seconds to 2. On the watch tower School Boy has a soldier in the site of his weapon and his watch shows 2 AM. He fires starting by picking off the guard below and the guards in two adjacent watch towers. The soldier with the dancing girl drags her towards his hut and she struggles. He slaps her causing her to fall to the ground then gestures to the hut and crawls underneath it. Unseen by the soldier EnJoo clamps a hand over her mouth and holds a finger to his lips. The soldier looks underneath the hut for the girl and EnJoo dives towards him plunging a knife into his throat and stabbing repeatedly.",
    "6": "Rambo runs out to a hut and dives underneath it seeing Sarah lying prone in the pig sty. He throws open a wooden bolt opens a gate and crawls inside. He looks out through the timbers and sees the soldier with the bottle of spirits returning. Sarah is asleep or unconscious and Rambo rushes over to the partition between them pushing pigs out of the way. EnJoo checks his watch—10 seconds to 2. On the watch tower School Boy has a soldier in the site of his weapon and his watch shows 2 AM. He fires starting by picking off the guard below and the guards in two adjacent watch towers. The soldier with the dancing girl drags her towards his hut and she struggles. He slaps her causing her to fall to the ground then gestures to the hut and crawls underneath it. Unseen by the soldier EnJoo clamps a hand over her mouth and holds a finger to his lips. The soldier looks underneath the hut for the girl and EnJoo dives towards him plunging a knife into his throat and stabbing repeatedly. He drags the soldier's body out of sight.",
    "7": "He throws open a wooden bolt opens a gate and crawls inside. He looks out through the timbers and sees the soldier with the bottle of spirits returning. Sarah is asleep or unconscious and Rambo rushes over to the partition between them pushing pigs out of the way. EnJoo checks his watch—10 seconds to 2. On the watch tower School Boy has a soldier in the site of his weapon and his watch shows 2 AM. He fires starting by picking off the guard below and the guards in two adjacent watch towers. The soldier with the dancing girl drags her towards his hut and she struggles. He slaps her causing her to fall to the ground then gestures to the hut and crawls underneath it. Unseen by the soldier EnJoo clamps a hand over her mouth and holds a finger to his lips. The soldier looks underneath the hut for the girl and EnJoo dives towards him plunging a knife into his throat and stabbing repeatedly. He drags the soldier's body out of sight. Rambo runs out to a hut and dives underneath it seeing Sarah lying prone in the pig sty.",
    "8": "He looks out through the timbers and sees the soldier with the bottle of spirits returning. Sarah is asleep or unconscious and Rambo rushes over to the partition between them pushing pigs out of the way. EnJoo checks his watch—10 seconds to 2. On the watch tower School Boy has a soldier in the site of his weapon and his watch shows 2 AM. He fires starting by picking off the guard below and the guards in two adjacent watch towers. The soldier with the dancing girl drags her towards his hut and she struggles. He slaps her causing her to fall to the ground then gestures to the hut and crawls underneath it. Unseen by the soldier EnJoo clamps a hand over her mouth and holds a finger to his lips. The soldier looks underneath the hut for the girl and EnJoo dives towards him plunging a knife into his throat and stabbing repeatedly. He drags the soldier's body out of sight. Rambo runs out to a hut and dives underneath it seeing Sarah lying prone in the pig sty. He throws open a wooden bolt opens a gate and crawls inside.",
    "9": "Sarah is asleep or unconscious and Rambo rushes over to the partition between them pushing pigs out of the way. EnJoo checks his watch—10 seconds to 2. On the watch tower School Boy has a soldier in the site of his weapon and his watch shows 2 AM. He fires starting by picking off the guard below and the guards in two adjacent watch towers. The soldier with the dancing girl drags her towards his hut and she struggles. He slaps her causing her to fall to the ground then gestures to the hut and crawls underneath it. Unseen by the soldier EnJoo clamps a hand over her mouth and holds a finger to his lips. The soldier looks underneath the hut for the girl and EnJoo dives towards him plunging a knife into his throat and stabbing repeatedly. He drags the soldier's body out of sight. Rambo runs out to a hut and dives underneath it seeing Sarah lying prone in the pig sty. He throws open a wooden bolt opens a gate and crawls inside. He looks out through the timbers and sees the soldier with the bottle of spirits returning.",
    "10": "EnJoo checks his watch—10 seconds to 2. On the watch tower School Boy has a soldier in the site of his weapon and his watch shows 2 AM. He fires starting by picking off the guard below and the guards in two adjacent watch towers. The soldier with the dancing girl drags her towards his hut and she struggles. He slaps her causing her to fall to the ground then gestures to the hut and crawls underneath it. Unseen by the soldier EnJoo clamps a hand over her mouth and holds a finger to his lips. The soldier looks underneath the hut for the girl and EnJoo dives towards him plunging a knife into his throat and stabbing repeatedly. He drags the soldier's body out of sight. Rambo runs out to a hut and dives underneath it seeing Sarah lying prone in the pig sty. He throws open a wooden bolt opens a gate and crawls inside. He looks out through the timbers and sees the soldier with the bottle of spirits returning. Sarah is asleep or unconscious and Rambo rushes over to the partition between them pushing pigs out of the way.",
    "11": "On the watch tower School Boy has a soldier in the site of his weapon and his watch shows 2 AM. He fires starting by picking off the guard below and the guards in two adjacent watch towers. The soldier with the dancing girl drags her towards his hut and she struggles. He slaps her causing her to fall to the ground then gestures to the hut and crawls underneath it. Unseen by the soldier EnJoo clamps a hand over her mouth and holds a finger to his lips. The soldier looks underneath the hut for the girl and EnJoo dives towards him plunging a knife into his throat and stabbing repeatedly. He drags the soldier's body out of sight. Rambo runs out to a hut and dives underneath it seeing Sarah lying prone in the pig sty. He throws open a wooden bolt opens a gate and crawls inside. He looks out through the timbers and sees the soldier with the bottle of spirits returning. Sarah is asleep or unconscious and Rambo rushes over to the partition between them pushing pigs out of the way. EnJoo checks his watch—10 seconds to 2.",
    "12": "He fires starting by picking off the guard below and the guards in two adjacent watch towers. The soldier with the dancing girl drags her towards his hut and she struggles. He slaps her causing her to fall to the ground then gestures to the hut and crawls underneath it. Unseen by the soldier EnJoo clamps a hand over her mouth and holds a finger to his lips. The soldier looks underneath the hut for the girl and EnJoo dives towards him plunging a knife into his throat and stabbing repeatedly. He drags the soldier's body out of sight. Rambo runs out to a hut and dives underneath it seeing Sarah lying prone in the pig sty. He throws open a wooden bolt opens a gate and crawls inside. He looks out through the timbers and sees the soldier with the bottle of spirits returning. Sarah is asleep or unconscious and Rambo rushes over to the partition between them pushing pigs out of the way. EnJoo checks his watch—10 seconds to 2. On the watch tower School Boy has a soldier in the site of his weapon and his watch shows 2 AM.",
    "13": "The soldier with the dancing girl drags her towards his hut and she struggles. He slaps her causing her to fall to the ground then gestures to the hut and crawls underneath it. Unseen by the soldier EnJoo clamps a hand over her mouth and holds a finger to his lips. The soldier looks underneath the hut for the girl and EnJoo dives towards him plunging a knife into his throat and stabbing repeatedly. He drags the soldier's body out of sight. Rambo runs out to a hut and dives underneath it seeing Sarah lying prone in the pig sty. He throws open a wooden bolt opens a gate and crawls inside. He looks out through the timbers and sees the soldier with the bottle of spirits returning. Sarah is asleep or unconscious and Rambo rushes over to the partition between them pushing pigs out of the way. EnJoo checks his watch—10 seconds to 2. On the watch tower School Boy has a soldier in the site of his weapon and his watch shows 2 AM. He fires starting by picking off the guard below and the guards in two adjacent watch towers."
  }
}