{
  "ground_truth": "Voldemort glances at the snake, and they dis-apparate. Harry continues to shiver as disheveled and dirty, Hermione and Ron approach him. Hermione turns anxiously to Ron, and he crouches down beside Harry. Harry looks worried as Hermione squats down. Harry closes his eyes and takes a deep breath while his jaw remains tense, breathing through his mouth. Nagini is curled up in a boat house where Lucius Malfoy is present with Voldemort, who examines the skin on his own forearm. When Harry opens his eyes, the others stare at him anxiously as the Death Eaters sweep over the school. A student flies in on a broomstick as a giant swings a scythe, and the others fight on the stairs. Hermione runs through a door, narrowly avoiding a bolt, as Harry beats on a door and shoots a Death Eater. A giant with two-pronged weapons spots the trio, and they run, hiding inside a huge bell lying on its side as the giant's weapon strikes it. Colossal spiders appear scrambling over the rubble, causing them to retreat. Hermione runs between the giants, and they fend off attacks with their wands to reach a quieter area.",
  "iterations": {
    "1": "Voldemort glances at the snake, and they dis-apparate. Harry continues to shiver as disheveled and dirty, Hermione and Ron approach him. Hermione turns anxiously to Ron, and he crouches down beside Harry. Harry looks worried as Hermione squats down. Harry closes his eyes and takes a deep breath while his jaw remains tense, breathing through his mouth. Nagini is curled up in a boat house where Lucius Malfoy is present with Voldemort, who examines the skin on his own forearm. A student flies in on a broomstick as a giant swings a scythe, and the others fight on the stairs. Hermione runs through a door, narrowly avoiding a bolt, as Harry beats on a door and shoots a Death Eater. A giant with two-pronged weapons spots the trio, and they run, hiding inside a huge bell lying on its side as the giant's weapon strikes it. Colossal spiders appear scrambling over the rubble, causing them to retreat. Hermione runs between the giants, and they fend off attacks with their wands to reach a quieter area.",
    "2": "Voldemort glances at the snake, and they dis-apparate. Harry continues to shiver as disheveled and dirty, Hermione and Ron approach him. Hermione turns anxiously to Ron, and he crouches down beside Harry. Harry looks worried as Hermione squats down. Harry closes his eyes and takes a deep breath while his jaw remains tense, breathing through his mouth. A student flies in on a broomstick as a giant swings a scythe, and the others fight on the stairs. Hermione runs through a door, narrowly avoiding a bolt, as Harry beats on a door and shoots a Death Eater. A giant with two-pronged weapons spots the trio, and they run, hiding inside a huge bell lying on its side as the giant's weapon strikes it. Colossal spiders appear scrambling over the rubble, causing them to retreat. Hermione runs between the giants, and they fend off attacks with their wands to reach a quieter area.",
    "3": "Voldemort glances at the snake, and they dis-apparate. Harry continues to shiver as disheveled and dirty, Hermione and Ron approach him. Hermione turns anxiously to Ron, and he crouches down beside Harry. Harry looks worried as Hermione squats down. Harry closes his eyes and takes a deep breath while his jaw remains tense, breathing through his mouth. Hermione runs through a door, narrowly avoiding a bolt, as Harry beats on a door and shoots a Death Eater. A giant with two-pronged weapons spots the trio, and they run, hiding inside a huge bell lying on its side as the giant's weapon strikes it. Colossal spiders appear scrambling over the rubble, causing them to retreat. Hermione runs between the giants, and they fend off attacks with their wands to reach a quieter area.",
    "4": "Voldemort glances at the snake, and they dis-apparate. Harry continues to shiver as disheveled and dirty, Hermione and Ron approach him. Hermione turns anxiously to Ron, and he crouches down beside Harry. Harry looks worried as Hermione squats down. Hermione runs through a door, narrowly avoiding a bolt, as Harry beats on a door and shoots a Death Eater. A giant with two-pronged weapons spots the trio, and they run, hiding inside a huge bell lying on its side as the giant's weapon strikes it. Colossal spiders appear scrambling over the rubble, causing them to retreat. Hermione runs between the giants, and they fend off attacks with their wands to reach a quieter area.",
    "5": "Voldemort glances at the snake, and they dis-apparate. Harry continues to shiver as disheveled and dirty, Hermione and Ron approach him. Hermione turns anxiously to Ron, and he crouches down beside Harry. Harry looks worried as Hermione squats down. A giant with two-pronged weapons spots the trio, and they run, hiding inside a huge bell lying on its side as the giant's weapon strikes it. Colossal spiders appear scrambling over the rubble, causing them to retreat. Hermione runs between the giants, and they fend off attacks with their wands to reach a quieter area.",
    "6": "Voldemort glances at the snake, and they dis-apparate. Harry continues to shiver as disheveled and dirty, Hermione and Ron approach him. Hermione turns anxiously to Ron, and he crouches down beside Harry. A giant with two-pronged weapons spots the trio, and they run, hiding inside a huge bell lying on its side as the giant's weapon strikes it. Colossal spiders appear scrambling over the rubble, causing them to retreat. Hermione runs between the giants, and they fend off attacks with their wands to reach a quieter area.",
    "7": "Voldemort glances at the snake, and they dis-apparate. Harry continues to shiver as disheveled and dirty, Hermione and Ron approach him. Hermione turns anxiously to Ron, and he crouches down beside Harry. Colossal spiders appear scrambling over the rubble, causing them to retreat. Hermione runs between the giants, and they fend off attacks with their wands to reach a quieter area.",
    "8": "Voldemort glances at the snake, and they dis-apparate. Harry continues to shiver as disheveled and dirty, Hermione and Ron approach him. Colossal spiders appear scrambling over the rubble, causing them to retreat. Hermione runs between the giants, and they fend off attacks with their wands to reach a quieter area.",
    "9": "Voldemort glances at the snake, and they dis-apparate. Harry continues to shiver as disheveled and dirty, Hermione and Ron approach him. Hermione runs between the giants, and they fend off attacks with their wands to reach a quieter area.",
    "10": "Voldemort glances at the snake, and they dis-apparate. Hermione runs between the giants, and they fend off attacks with their wands to reach a quieter area."
  }
}