{
  "ground_truth": "Sam spots the elevator stuck on the seventh floor while elsewhere a sweaty Javier glares at Veronica then lowers the gun only to raise it again as Veronica relaxes. Veronica shakes her head and Javier relents leaving her in the elevator and touching his stomach in the corridor bringing his palm away. bloody Javier dressed in a Spanish policeman's uniform heads down the stairwell in the hotel. Outside Sam sees Veronica leaving the elevator with a covered gurney and rushes to help wheeling it while Veronica tends the drip. The President is covered by a blue blanket. Javier leaves the annex and on the street checks his watch. Sam and Veronica wheel the President's gurney over to the ambulance as Luis runs up to them climbs in and Sam shuts the door. The ambulance pulls away from the chaos outside the hotel. In a speeding hatchback Barnes answers his cell phone shifts gear and moves through traffic in the narrow street. On a different street Sam weaves through traffic in the ambulance and inside. Ashton lying under the blanket opens his eyes lowers a sidebar and as the ambulance rounds a corner falls to the floor. Taylor speeds along in a Spanish police car while Veronica smiles at Sam in the driver's seat.",
  "iterations": {
    "1": "Sam spots the elevator stuck on the seventh floor while elsewhere a sweaty Javier glares at Veronica then lowers the gun only to raise it again as Veronica relaxes. Veronica shakes her head and Javier relents leaving her in the elevator and touching his stomach in the corridor bringing his palm away. bloody Javier dressed in a Spanish policeman's uniform heads down the stairwell in the hotel. Outside Sam sees Veronica leaving the elevator with a covered gurney and rushes to help wheeling it while Veronica tends the drip. The President is covered by a blue blanket. Javier leaves the annex and on the street checks his watch. Sam and Veronica wheel the President's gurney over to the ambulance as Luis runs up to them climbs in and Sam shuts the door. The ambulance pulls away from the chaos outside the hotel. In a speeding hatchback Barnes answers his cell phone shifts gear and moves through traffic in the narrow street. On a different street Sam weaves through traffic in the ambulance and inside. Ashton lying under the blanket opens his eyes lowers a sidebar and as the ambulance rounds a corner falls to the floor. Taylor speeds along in a Spanish police car while Veronica smiles at Sam in the driver's seat.",
    "2": "Taylor speeds along in a Spanish police car while Veronica smiles at Sam in the driver's seat. Sam spots the elevator stuck on the seventh floor while elsewhere a sweaty Javier glares at Veronica then lowers the gun only to raise it again as Veronica relaxes. Veronica shakes her head and Javier relents leaving her in the elevator and touching his stomach in the corridor bringing his palm away. bloody Javier dressed in a Spanish policeman's uniform heads down the stairwell in the hotel. Outside Sam sees Veronica leaving the elevator with a covered gurney and rushes to help wheeling it while Veronica tends the drip. The President is covered by a blue blanket. Javier leaves the annex and on the street checks his watch. Sam and Veronica wheel the President's gurney over to the ambulance as Luis runs up to them climbs in and Sam shuts the door. The ambulance pulls away from the chaos outside the hotel. In a speeding hatchback Barnes answers his cell phone shifts gear and moves through traffic in the narrow street. On a different street Sam weaves through traffic in the ambulance and inside. Ashton lying under the blanket opens his eyes lowers a sidebar and as the ambulance rounds a corner falls to the floor.",
    "3": "Ashton lying under the blanket opens his eyes lowers a sidebar and as the ambulance rounds a corner falls to the floor. Taylor speeds along in a Spanish police car while Veronica smiles at Sam in the driver's seat. Sam spots the elevator stuck on the seventh floor while elsewhere a sweaty Javier glares at Veronica then lowers the gun only to raise it again as Veronica relaxes. Veronica shakes her head and Javier relents leaving her in the elevator and touching his stomach in the corridor bringing his palm away. bloody Javier dressed in a Spanish policeman's uniform heads down the stairwell in the hotel. Outside Sam sees Veronica leaving the elevator with a covered gurney and rushes to help wheeling it while Veronica tends the drip. The President is covered by a blue blanket. Javier leaves the annex and on the street checks his watch. Sam and Veronica wheel the President's gurney over to the ambulance as Luis runs up to them climbs in and Sam shuts the door. The ambulance pulls away from the chaos outside the hotel. In a speeding hatchback Barnes answers his cell phone shifts gear and moves through traffic in the narrow street. On a different street Sam weaves through traffic in the ambulance and inside.",
    "4": "On a different street Sam weaves through traffic in the ambulance and inside. Ashton lying under the blanket opens his eyes lowers a sidebar and as the ambulance rounds a corner falls to the floor. Taylor speeds along in a Spanish police car while Veronica smiles at Sam in the driver's seat. Sam spots the elevator stuck on the seventh floor while elsewhere a sweaty Javier glares at Veronica then lowers the gun only to raise it again as Veronica relaxes. Veronica shakes her head and Javier relents leaving her in the elevator and touching his stomach in the corridor bringing his palm away. bloody Javier dressed in a Spanish policeman's uniform heads down the stairwell in the hotel. Outside Sam sees Veronica leaving the elevator with a covered gurney and rushes to help wheeling it while Veronica tends the drip. The President is covered by a blue blanket. Javier leaves the annex and on the street checks his watch. Sam and Veronica wheel the President's gurney over to the ambulance as Luis runs up to them climbs in and Sam shuts the door. The ambulance pulls away from the chaos outside the hotel. In a speeding hatchback Barnes answers his cell phone shifts gear and moves through traffic in the narrow street.",
    "5": "In a speeding hatchback Barnes answers his cell phone shifts gear and moves through traffic in the narrow street. On a different street Sam weaves through traffic in the ambulance and inside. Ashton lying under the blanket opens his eyes lowers a sidebar and as the ambulance rounds a corner falls to the floor. Taylor speeds along in a Spanish police car while Veronica smiles at Sam in the driver's seat. Sam spots the elevator stuck on the seventh floor while elsewhere a sweaty Javier glares at Veronica then lowers the gun only to raise it again as Veronica relaxes. Veronica shakes her head and Javier relents leaving her in the elevator and touching his stomach in the corridor bringing his palm away. bloody Javier dressed in a Spanish policeman's uniform heads down the stairwell in the hotel. Outside Sam sees Veronica leaving the elevator with a covered gurney and rushes to help wheeling it while Veronica tends the drip. The President is covered by a blue blanket. Javier leaves the annex and on the street checks his watch. Sam and Veronica wheel the President's gurney over to the ambulance as Luis runs up to them climbs in and Sam shuts the door. The ambulance pulls away from the chaos outside the hotel.",
    "6": "The ambulance pulls away from the chaos outside the hotel. In a speeding hatchback Barnes answers his cell phone shifts gear and moves through traffic in the narrow street. On a different street Sam weaves through traffic in the ambulance and inside. Ashton lying under the blanket opens his eyes lowers a sidebar and as the ambulance rounds a corner falls to the floor. Taylor speeds along in a Spanish police car while Veronica smiles at Sam in the driver's seat. Sam spots the elevator stuck on the seventh floor while elsewhere a sweaty Javier glares at Veronica then lowers the gun only to raise it again as Veronica relaxes. Veronica shakes her head and Javier relents leaving her in the elevator and touching his stomach in the corridor bringing his palm away. bloody Javier dressed in a Spanish policeman's uniform heads down the stairwell in the hotel. Outside Sam sees Veronica leaving the elevator with a covered gurney and rushes to help wheeling it while Veronica tends the drip. The President is covered by a blue blanket. Javier leaves the annex and on the street checks his watch. Sam and Veronica wheel the President's gurney over to the ambulance as Luis runs up to them climbs in and Sam shuts the door.",
    "7": "Sam and Veronica wheel the President's gurney over to the ambulance as Luis runs up to them climbs in and Sam shuts the door. The ambulance pulls away from the chaos outside the hotel. In a speeding hatchback Barnes answers his cell phone shifts gear and moves through traffic in the narrow street. On a different street Sam weaves through traffic in the ambulance and inside. Ashton lying under the blanket opens his eyes lowers a sidebar and as the ambulance rounds a corner falls to the floor. Taylor speeds along in a Spanish police car while Veronica smiles at Sam in the driver's seat. Sam spots the elevator stuck on the seventh floor while elsewhere a sweaty Javier glares at Veronica then lowers the gun only to raise it again as Veronica relaxes. Veronica shakes her head and Javier relents leaving her in the elevator and touching his stomach in the corridor bringing his palm away. bloody Javier dressed in a Spanish policeman's uniform heads down the stairwell in the hotel. Outside Sam sees Veronica leaving the elevator with a covered gurney and rushes to help wheeling it while Veronica tends the drip. The President is covered by a blue blanket. Javier leaves the annex and on the street checks his watch.",
    "8": "Javier leaves the annex and on the street checks his watch. Sam and Veronica wheel the President's gurney over to the ambulance as Luis runs up to them climbs in and Sam shuts the door. The ambulance pulls away from the chaos outside the hotel. In a speeding hatchback Barnes answers his cell phone shifts gear and moves through traffic in the narrow street. On a different street Sam weaves through traffic in the ambulance and inside. Ashton lying under the blanket opens his eyes lowers a sidebar and as the ambulance rounds a corner falls to the floor. Taylor speeds along in a Spanish police car while Veronica smiles at Sam in the driver's seat. Sam spots the elevator stuck on the seventh floor while elsewhere a sweaty Javier glares at Veronica then lowers the gun only to raise it again as Veronica relaxes. Veronica shakes her head and Javier relents leaving her in the elevator and touching his stomach in the corridor bringing his palm away. bloody Javier dressed in a Spanish policeman's uniform heads down the stairwell in the hotel. Outside Sam sees Veronica leaving the elevator with a covered gurney and rushes to help wheeling it while Veronica tends the drip. The President is covered by a blue blanket.",
    "9": "The President is covered by a blue blanket. Javier leaves the annex and on the street checks his watch. Sam and Veronica wheel the President's gurney over to the ambulance as Luis runs up to them climbs in and Sam shuts the door. The ambulance pulls away from the chaos outside the hotel. In a speeding hatchback Barnes answers his cell phone shifts gear and moves through traffic in the narrow street. On a different street Sam weaves through traffic in the ambulance and inside. Ashton lying under the blanket opens his eyes lowers a sidebar and as the ambulance rounds a corner falls to the floor. Taylor speeds along in a Spanish police car while Veronica smiles at Sam in the driver's seat. Sam spots the elevator stuck on the seventh floor while elsewhere a sweaty Javier glares at Veronica then lowers the gun only to raise it again as Veronica relaxes. Veronica shakes her head and Javier relents leaving her in the elevator and touching his stomach in the corridor bringing his palm away. bloody Javier dressed in a Spanish policeman's uniform heads down the stairwell in the hotel. Outside Sam sees Veronica leaving the elevator with a covered gurney and rushes to help wheeling it while Veronica tends the drip.",
    "10": "Outside Sam sees Veronica leaving the elevator with a covered gurney and rushes to help wheeling it while Veronica tends the drip. The President is covered by a blue blanket. Javier leaves the annex and on the street checks his watch. Sam and Veronica wheel the President's gurney over to the ambulance as Luis runs up to them climbs in and Sam shuts the door. The ambulance pulls away from the chaos outside the hotel. In a speeding hatchback Barnes answers his cell phone shifts gear and moves through traffic in the narrow street. On a different street Sam weaves through traffic in the ambulance and inside. Ashton lying under the blanket opens his eyes lowers a sidebar and as the ambulance rounds a corner falls to the floor. Taylor speeds along in a Spanish police car while Veronica smiles at Sam in the driver's seat. Sam spots the elevator stuck on the seventh floor while elsewhere a sweaty Javier glares at Veronica then lowers the gun only to raise it again as Veronica relaxes. Veronica shakes her head and Javier relents leaving her in the elevator and touching his stomach in the corridor bringing his palm away. bloody Javier dressed in a Spanish policeman's uniform heads down the stairwell in the hotel.",
    "11": "bloody Javier dressed in a Spanish policeman's uniform heads down the stairwell in the hotel. Outside Sam sees Veronica leaving the elevator with a covered gurney and rushes to help wheeling it while Veronica tends the drip. The President is covered by a blue blanket. Javier leaves the annex and on the street checks his watch. Sam and Veronica wheel the President's gurney over to the ambulance as Luis runs up to them climbs in and Sam shuts the door. The ambulance pulls away from the chaos outside the hotel. In a speeding hatchback Barnes answers his cell phone shifts gear and moves through traffic in the narrow street. On a different street Sam weaves through traffic in the ambulance and inside. Ashton lying under the blanket opens his eyes lowers a sidebar and as the ambulance rounds a corner falls to the floor. Taylor speeds along in a Spanish police car while Veronica smiles at Sam in the driver's seat. Sam spots the elevator stuck on the seventh floor while elsewhere a sweaty Javier glares at Veronica then lowers the gun only to raise it again as Veronica relaxes. Veronica shakes her head and Javier relents leaving her in the elevator and touching his stomach in the corridor bringing his palm away.",
    "12": "Veronica shakes her head and Javier relents leaving her in the elevator and touching his stomach in the corridor bringing his palm away. bloody Javier dressed in a Spanish policeman's uniform heads down the stairwell in the hotel. Outside Sam sees Veronica leaving the elevator with a covered gurney and rushes to help wheeling it while Veronica tends the drip. The President is covered by a blue blanket. Javier leaves the annex and on the street checks his watch. Sam and Veronica wheel the President's gurney over to the ambulance as Luis runs up to them climbs in and Sam shuts the door. The ambulance pulls away from the chaos outside the hotel. In a speeding hatchback Barnes answers his cell phone shifts gear and moves through traffic in the narrow street. On a different street Sam weaves through traffic in the ambulance and inside. Ashton lying under the blanket opens his eyes lowers a sidebar and as the ambulance rounds a corner falls to the floor. Taylor speeds along in a Spanish police car while Veronica smiles at Sam in the driver's seat. Sam spots the elevator stuck on the seventh floor while elsewhere a sweaty Javier glares at Veronica then lowers the gun only to raise it again as Veronica relaxes.",
    "13": "Sam spots the elevator stuck on the seventh floor while elsewhere a sweaty Javier glares at Veronica then lowers the gun only to raise it again as Veronica relaxes. Veronica shakes her head and Javier relents leaving her in the elevator and touching his stomach in the corridor bringing his palm away. bloody Javier dressed in a Spanish policeman's uniform heads down the stairwell in the hotel. Outside Sam sees Veronica leaving the elevator with a covered gurney and rushes to help wheeling it while Veronica tends the drip. The President is covered by a blue blanket. Javier leaves the annex and on the street checks his watch. Sam and Veronica wheel the President's gurney over to the ambulance as Luis runs up to them climbs in and Sam shuts the door. The ambulance pulls away from the chaos outside the hotel. In a speeding hatchback Barnes answers his cell phone shifts gear and moves through traffic in the narrow street. On a different street Sam weaves through traffic in the ambulance and inside. Ashton lying under the blanket opens his eyes lowers a sidebar and as the ambulance rounds a corner falls to the floor. Taylor speeds along in a Spanish police car while Veronica smiles at Sam in the driver's seat."
  }
}