{
  "ground_truth": "Lt Dan lifts his pant leg to display his metal leg as Susan shakes Forrest's hand. Jenny steps forward and kisses Lt Dan's cheek and the group is seated as they watch. Forrest and Jenny take vows on the front lawn. Forrest Jr stands next to Jenny as the wind blows fallen leaves across the ground. Jenny Forrest and Forrest Jr walk toward the house holding hands as they walk. Forrest steps into Jenny's bedroom carrying a tray with breakfast on it and looks at Jenny as she sleeps. Slowly she wakes up and looks at Forrest. Forrest looks up into the sky as the rain stops removes his helmet and the stars emerge from behind the clouds. He stands on his boat looking at a deep orange and red sunset. Forrest runs along a highway and later along a desert highway as a lake reflects the mountains and the sky and the morning light casts an orange glow over the desert. Jenny looks out the window and Forrest looks at Jenny who then reaches over and takes his hand. Forrest stands under the old oak tree where Jenny has been buried trying to hold back his tears and watches as her dad's house is knocked down by a bulldozer.",
  "iterations": {
    "1": "Lt Dan lifts his pant leg to display his metal leg as Susan shakes Forrest's hand. Jenny steps forward and kisses Lt Dan's cheek and the group is seated as they watch. Forrest and Jenny take vows on the front lawn. Forrest Jr stands next to Jenny as the wind blows fallen leaves across the ground. Jenny Forrest and Forrest Jr walk toward the house holding hands as they walk. Forrest steps into Jenny's bedroom carrying a tray with breakfast on it and looks at Jenny as she sleeps. Slowly she wakes up and looks at Forrest. Forrest looks up into the sky as the rain stops removes his helmet and the stars emerge from behind the clouds. He stands on his boat looking at a deep orange and red sunset. Forrest runs along a highway and later along a desert highway as a lake reflects the mountains and the sky and the morning light casts an orange glow over the desert. Jenny looks out the window and Forrest looks at Jenny who then reaches over and takes his hand. Forrest stands under the old oak tree where Jenny has been buried trying to hold back his tears and watches as her dad's house is knocked down by a bulldozer.",
    "2": "Forrest stands under the old oak tree where Jenny has been buried trying to hold back his tears and watches as her dad's house is knocked down by a bulldozer. Lt Dan lifts his pant leg to display his metal leg as Susan shakes Forrest's hand. Jenny steps forward and kisses Lt Dan's cheek and the group is seated as they watch. Forrest and Jenny take vows on the front lawn. Forrest Jr stands next to Jenny as the wind blows fallen leaves across the ground. Jenny Forrest and Forrest Jr walk toward the house holding hands as they walk. Forrest steps into Jenny's bedroom carrying a tray with breakfast on it and looks at Jenny as she sleeps. Slowly she wakes up and looks at Forrest. Forrest looks up into the sky as the rain stops removes his helmet and the stars emerge from behind the clouds. He stands on his boat looking at a deep orange and red sunset. Forrest runs along a highway and later along a desert highway as a lake reflects the mountains and the sky and the morning light casts an orange glow over the desert. Jenny looks out the window and Forrest looks at Jenny who then reaches over and takes his hand.",
    "3": "Jenny looks out the window and Forrest looks at Jenny who then reaches over and takes his hand. Forrest stands under the old oak tree where Jenny has been buried trying to hold back his tears and watches as her dad's house is knocked down by a bulldozer. Lt Dan lifts his pant leg to display his metal leg as Susan shakes Forrest's hand. Jenny steps forward and kisses Lt Dan's cheek and the group is seated as they watch. Forrest and Jenny take vows on the front lawn. Forrest Jr stands next to Jenny as the wind blows fallen leaves across the ground. Jenny Forrest and Forrest Jr walk toward the house holding hands as they walk. Forrest steps into Jenny's bedroom carrying a tray with breakfast on it and looks at Jenny as she sleeps. Slowly she wakes up and looks at Forrest. Forrest looks up into the sky as the rain stops removes his helmet and the stars emerge from behind the clouds. He stands on his boat looking at a deep orange and red sunset. Forrest runs along a highway and later along a desert highway as a lake reflects the mountains and the sky and the morning light casts an orange glow over the desert.",
    "4": "Forrest runs along a highway and later along a desert highway as a lake reflects the mountains and the sky and the morning light casts an orange glow over the desert. Jenny looks out the window and Forrest looks at Jenny who then reaches over and takes his hand. Forrest stands under the old oak tree where Jenny has been buried trying to hold back his tears and watches as her dad's house is knocked down by a bulldozer. Lt Dan lifts his pant leg to display his metal leg as Susan shakes Forrest's hand. Jenny steps forward and kisses Lt Dan's cheek and the group is seated as they watch. Forrest and Jenny take vows on the front lawn. Forrest Jr stands next to Jenny as the wind blows fallen leaves across the ground. Jenny Forrest and Forrest Jr walk toward the house holding hands as they walk. Forrest steps into Jenny's bedroom carrying a tray with breakfast on it and looks at Jenny as she sleeps. Slowly she wakes up and looks at Forrest. Forrest looks up into the sky as the rain stops removes his helmet and the stars emerge from behind the clouds. He stands on his boat looking at a deep orange and red sunset.",
    "5": "He stands on his boat looking at a deep orange and red sunset. Forrest runs along a highway and later along a desert highway as a lake reflects the mountains and the sky and the morning light casts an orange glow over the desert. Jenny looks out the window and Forrest looks at Jenny who then reaches over and takes his hand. Forrest stands under the old oak tree where Jenny has been buried trying to hold back his tears and watches as her dad's house is knocked down by a bulldozer. Lt Dan lifts his pant leg to display his metal leg as Susan shakes Forrest's hand. Jenny steps forward and kisses Lt Dan's cheek and the group is seated as they watch. Forrest and Jenny take vows on the front lawn. Forrest Jr stands next to Jenny as the wind blows fallen leaves across the ground. Jenny Forrest and Forrest Jr walk toward the house holding hands as they walk. Forrest steps into Jenny's bedroom carrying a tray with breakfast on it and looks at Jenny as she sleeps. Slowly she wakes up and looks at Forrest. Forrest looks up into the sky as the rain stops removes his helmet and the stars emerge from behind the clouds.",
    "6": "Forrest looks up into the sky as the rain stops removes his helmet and the stars emerge from behind the clouds. He stands on his boat looking at a deep orange and red sunset. Forrest runs along a highway and later along a desert highway as a lake reflects the mountains and the sky and the morning light casts an orange glow over the desert. Jenny looks out the window and Forrest looks at Jenny who then reaches over and takes his hand. Forrest stands under the old oak tree where Jenny has been buried trying to hold back his tears and watches as her dad's house is knocked down by a bulldozer. Lt Dan lifts his pant leg to display his metal leg as Susan shakes Forrest's hand. Jenny steps forward and kisses Lt Dan's cheek and the group is seated as they watch. Forrest and Jenny take vows on the front lawn. Forrest Jr stands next to Jenny as the wind blows fallen leaves across the ground. Jenny Forrest and Forrest Jr walk toward the house holding hands as they walk. Forrest steps into Jenny's bedroom carrying a tray with breakfast on it and looks at Jenny as she sleeps. Slowly she wakes up and looks at Forrest.",
    "7": "Slowly she wakes up and looks at Forrest. Forrest looks up into the sky as the rain stops removes his helmet and the stars emerge from behind the clouds. He stands on his boat looking at a deep orange and red sunset. Forrest runs along a highway and later along a desert highway as a lake reflects the mountains and the sky and the morning light casts an orange glow over the desert. Jenny looks out the window and Forrest looks at Jenny who then reaches over and takes his hand. Forrest stands under the old oak tree where Jenny has been buried trying to hold back his tears and watches as her dad's house is knocked down by a bulldozer. Lt Dan lifts his pant leg to display his metal leg as Susan shakes Forrest's hand. Jenny steps forward and kisses Lt Dan's cheek and the group is seated as they watch. Forrest and Jenny take vows on the front lawn. Forrest Jr stands next to Jenny as the wind blows fallen leaves across the ground. Jenny Forrest and Forrest Jr walk toward the house holding hands as they walk. Forrest steps into Jenny's bedroom carrying a tray with breakfast on it and looks at Jenny as she sleeps.",
    "8": "Forrest steps into Jenny's bedroom carrying a tray with breakfast on it and looks at Jenny as she sleeps. Slowly she wakes up and looks at Forrest. Forrest looks up into the sky as the rain stops removes his helmet and the stars emerge from behind the clouds. He stands on his boat looking at a deep orange and red sunset. Forrest runs along a highway and later along a desert highway as a lake reflects the mountains and the sky and the morning light casts an orange glow over the desert. Jenny looks out the window and Forrest looks at Jenny who then reaches over and takes his hand. Forrest stands under the old oak tree where Jenny has been buried trying to hold back his tears and watches as her dad's house is knocked down by a bulldozer. Lt Dan lifts his pant leg to display his metal leg as Susan shakes Forrest's hand. Jenny steps forward and kisses Lt Dan's cheek and the group is seated as they watch. Forrest and Jenny take vows on the front lawn. Forrest Jr stands next to Jenny as the wind blows fallen leaves across the ground. Jenny Forrest and Forrest Jr walk toward the house holding hands as they walk.",
    "9": "Jenny Forrest and Forrest Jr walk toward the house holding hands as they walk. Forrest steps into Jenny's bedroom carrying a tray with breakfast on it and looks at Jenny as she sleeps. Slowly she wakes up and looks at Forrest. Forrest looks up into the sky as the rain stops removes his helmet and the stars emerge from behind the clouds. He stands on his boat looking at a deep orange and red sunset. Forrest runs along a highway and later along a desert highway as a lake reflects the mountains and the sky and the morning light casts an orange glow over the desert. Jenny looks out the window and Forrest looks at Jenny who then reaches over and takes his hand. Forrest stands under the old oak tree where Jenny has been buried trying to hold back his tears and watches as her dad's house is knocked down by a bulldozer. Lt Dan lifts his pant leg to display his metal leg as Susan shakes Forrest's hand. Jenny steps forward and kisses Lt Dan's cheek and the group is seated as they watch. Forrest and Jenny take vows on the front lawn. Forrest Jr stands next to Jenny as the wind blows fallen leaves across the ground.",
    "10": "Forrest Jr stands next to Jenny as the wind blows fallen leaves across the ground. Jenny Forrest and Forrest Jr walk toward the house holding hands as they walk. Forrest steps into Jenny's bedroom carrying a tray with breakfast on it and looks at Jenny as she sleeps. Slowly she wakes up and looks at Forrest. Forrest looks up into the sky as the rain stops removes his helmet and the stars emerge from behind the clouds. He stands on his boat looking at a deep orange and red sunset. Forrest runs along a highway and later along a desert highway as a lake reflects the mountains and the sky and the morning light casts an orange glow over the desert. Jenny looks out the window and Forrest looks at Jenny who then reaches over and takes his hand. Forrest stands under the old oak tree where Jenny has been buried trying to hold back his tears and watches as her dad's house is knocked down by a bulldozer. Lt Dan lifts his pant leg to display his metal leg as Susan shakes Forrest's hand. Jenny steps forward and kisses Lt Dan's cheek and the group is seated as they watch. Forrest and Jenny take vows on the front lawn.",
    "11": "Forrest and Jenny take vows on the front lawn. Forrest Jr stands next to Jenny as the wind blows fallen leaves across the ground. Jenny Forrest and Forrest Jr walk toward the house holding hands as they walk. Forrest steps into Jenny's bedroom carrying a tray with breakfast on it and looks at Jenny as she sleeps. Slowly she wakes up and looks at Forrest. Forrest looks up into the sky as the rain stops removes his helmet and the stars emerge from behind the clouds. He stands on his boat looking at a deep orange and red sunset. Forrest runs along a highway and later along a desert highway as a lake reflects the mountains and the sky and the morning light casts an orange glow over the desert. Jenny looks out the window and Forrest looks at Jenny who then reaches over and takes his hand. Forrest stands under the old oak tree where Jenny has been buried trying to hold back his tears and watches as her dad's house is knocked down by a bulldozer. Lt Dan lifts his pant leg to display his metal leg as Susan shakes Forrest's hand. Jenny steps forward and kisses Lt Dan's cheek and the group is seated as they watch.",
    "12": "Jenny steps forward and kisses Lt Dan's cheek and the group is seated as they watch. Forrest and Jenny take vows on the front lawn. Forrest Jr stands next to Jenny as the wind blows fallen leaves across the ground. Jenny Forrest and Forrest Jr walk toward the house holding hands as they walk. Forrest steps into Jenny's bedroom carrying a tray with breakfast on it and looks at Jenny as she sleeps. Slowly she wakes up and looks at Forrest. Forrest looks up into the sky as the rain stops removes his helmet and the stars emerge from behind the clouds. He stands on his boat looking at a deep orange and red sunset. Forrest runs along a highway and later along a desert highway as a lake reflects the mountains and the sky and the morning light casts an orange glow over the desert. Jenny looks out the window and Forrest looks at Jenny who then reaches over and takes his hand. Forrest stands under the old oak tree where Jenny has been buried trying to hold back his tears and watches as her dad's house is knocked down by a bulldozer. Lt Dan lifts his pant leg to display his metal leg as Susan shakes Forrest's hand.",
    "13": "Lt Dan lifts his pant leg to display his metal leg as Susan shakes Forrest's hand. Jenny steps forward and kisses Lt Dan's cheek and the group is seated as they watch. Forrest and Jenny take vows on the front lawn. Forrest Jr stands next to Jenny as the wind blows fallen leaves across the ground. Jenny Forrest and Forrest Jr walk toward the house holding hands as they walk. Forrest steps into Jenny's bedroom carrying a tray with breakfast on it and looks at Jenny as she sleeps. Slowly she wakes up and looks at Forrest. Forrest looks up into the sky as the rain stops removes his helmet and the stars emerge from behind the clouds. He stands on his boat looking at a deep orange and red sunset. Forrest runs along a highway and later along a desert highway as a lake reflects the mountains and the sky and the morning light casts an orange glow over the desert. Jenny looks out the window and Forrest looks at Jenny who then reaches over and takes his hand. Forrest stands under the old oak tree where Jenny has been buried trying to hold back his tears and watches as her dad's house is knocked down by a bulldozer."
  }
}