{
  "ground_truth": "Mr Gardiner smiles over at Mr Darcy while Georgiana stands at Lizzie's side looking down at her. They both look over at Mr Darcy and then Lizzie gets up and sets the music out for Georgiana before making her way across the room only to be stopped by Miss Bingley. Mr Darcy sits up and embarrassed. Lizzie hurries back over to Georgiana. Slowly Lizzie raises her eyes to meet Mr Darcy's who sits across the room watching her with an enraptured expression. The two gaze at each other their eyes filled with warmth and understanding. Later as dusk falls a carriage pulls away from Pemberley waved off by Mr Bingley. Mr Darcy and Georgiana. Mr Bingley and Georgiana head inside together arm in arm but Mr Darcy remains on the doorstep watching the carriage clatter down the long curving driveway. Moments later he and Mr Bingley stride back into the drawing room where Mrs Hurst and Miss Bingley are waiting and he gives Miss Bingley a piercing stare causing her to look away. Mr Darcy then walks through the magnificent portraitlined hall at Pemberley holding aloft a candle to light his way with two dogs trotting at his heels. He enters the nowdarkened drawing room and places the candle on a mantelpiece pausing for a moment leaning against the fireplace as if lost in thought before looking over at the piano.",
  "iterations": {
    "1": "Mr Gardiner smiles over at Mr Darcy while Georgiana stands at Lizzie's side looking down at her. They both look over at Mr Darcy and then Lizzie gets up and sets the music out for Georgiana before making her way across the room only to be stopped by Miss Bingley. Mr Darcy sits up and embarrassed. Lizzie hurries back over to Georgiana. Slowly Lizzie raises her eyes to meet Mr Darcy's who sits across the room watching her with an enraptured expression. The two gaze at each other their eyes filled with warmth and understanding. Later as dusk falls a carriage pulls away from Pemberley waved off by Mr Bingley. Mr Darcy and Georgiana. Mr Bingley and Georgiana head inside together arm in arm but Mr Darcy remains on the doorstep watching the carriage clatter down the long curving driveway. Moments later he and Mr Bingley stride back into the drawing room where Mrs Hurst and Miss Bingley are waiting and he gives Miss Bingley a piercing stare causing her to look away. Mr Darcy then walks through the magnificent portraitlined hall at Pemberley holding aloft a candle to light his way with two dogs trotting at his heels. He enters the nowdarkened drawing room and places the candle on a mantelpiece pausing for a moment leaning against the fireplace as if lost in thought before looking over at the piano.",
    "2": "He enters the nowdarkened drawing room and places the candle on a mantelpiece pausing for a moment leaning against the fireplace as if lost in thought before looking over at the piano. Mr Gardiner smiles over at Mr Darcy while Georgiana stands at Lizzie's side looking down at her. They both look over at Mr Darcy and then Lizzie gets up and sets the music out for Georgiana before making her way across the room only to be stopped by Miss Bingley. Mr Darcy sits up and embarrassed. Lizzie hurries back over to Georgiana. Slowly Lizzie raises her eyes to meet Mr Darcy's who sits across the room watching her with an enraptured expression. The two gaze at each other their eyes filled with warmth and understanding. Later as dusk falls a carriage pulls away from Pemberley waved off by Mr Bingley. Mr Darcy and Georgiana. Mr Bingley and Georgiana head inside together arm in arm but Mr Darcy remains on the doorstep watching the carriage clatter down the long curving driveway. Moments later he and Mr Bingley stride back into the drawing room where Mrs Hurst and Miss Bingley are waiting and he gives Miss Bingley a piercing stare causing her to look away. Mr Darcy then walks through the magnificent portraitlined hall at Pemberley holding aloft a candle to light his way with two dogs trotting at his heels.",
    "3": "Mr Darcy then walks through the magnificent portraitlined hall at Pemberley holding aloft a candle to light his way with two dogs trotting at his heels. He enters the nowdarkened drawing room and places the candle on a mantelpiece pausing for a moment leaning against the fireplace as if lost in thought before looking over at the piano. Mr Gardiner smiles over at Mr Darcy while Georgiana stands at Lizzie's side looking down at her. They both look over at Mr Darcy and then Lizzie gets up and sets the music out for Georgiana before making her way across the room only to be stopped by Miss Bingley. Mr Darcy sits up and embarrassed. Lizzie hurries back over to Georgiana. Slowly Lizzie raises her eyes to meet Mr Darcy's who sits across the room watching her with an enraptured expression. The two gaze at each other their eyes filled with warmth and understanding. Later as dusk falls a carriage pulls away from Pemberley waved off by Mr Bingley. Mr Darcy and Georgiana. Mr Bingley and Georgiana head inside together arm in arm but Mr Darcy remains on the doorstep watching the carriage clatter down the long curving driveway. Moments later he and Mr Bingley stride back into the drawing room where Mrs Hurst and Miss Bingley are waiting and he gives Miss Bingley a piercing stare causing her to look away.",
    "4": "Moments later he and Mr Bingley stride back into the drawing room where Mrs Hurst and Miss Bingley are waiting and he gives Miss Bingley a piercing stare causing her to look away. Mr Darcy then walks through the magnificent portraitlined hall at Pemberley holding aloft a candle to light his way with two dogs trotting at his heels. He enters the nowdarkened drawing room and places the candle on a mantelpiece pausing for a moment leaning against the fireplace as if lost in thought before looking over at the piano. Mr Gardiner smiles over at Mr Darcy while Georgiana stands at Lizzie's side looking down at her. They both look over at Mr Darcy and then Lizzie gets up and sets the music out for Georgiana before making her way across the room only to be stopped by Miss Bingley. Mr Darcy sits up and embarrassed. Lizzie hurries back over to Georgiana. Slowly Lizzie raises her eyes to meet Mr Darcy's who sits across the room watching her with an enraptured expression. The two gaze at each other their eyes filled with warmth and understanding. Later as dusk falls a carriage pulls away from Pemberley waved off by Mr Bingley. Mr Darcy and Georgiana. Mr Bingley and Georgiana head inside together arm in arm but Mr Darcy remains on the doorstep watching the carriage clatter down the long curving driveway.",
    "5": "Mr Bingley and Georgiana head inside together arm in arm but Mr Darcy remains on the doorstep watching the carriage clatter down the long curving driveway. Moments later he and Mr Bingley stride back into the drawing room where Mrs Hurst and Miss Bingley are waiting and he gives Miss Bingley a piercing stare causing her to look away. Mr Darcy then walks through the magnificent portraitlined hall at Pemberley holding aloft a candle to light his way with two dogs trotting at his heels. He enters the nowdarkened drawing room and places the candle on a mantelpiece pausing for a moment leaning against the fireplace as if lost in thought before looking over at the piano. Mr Gardiner smiles over at Mr Darcy while Georgiana stands at Lizzie's side looking down at her. They both look over at Mr Darcy and then Lizzie gets up and sets the music out for Georgiana before making her way across the room only to be stopped by Miss Bingley. Mr Darcy sits up and embarrassed. Lizzie hurries back over to Georgiana. Slowly Lizzie raises her eyes to meet Mr Darcy's who sits across the room watching her with an enraptured expression. The two gaze at each other their eyes filled with warmth and understanding. Later as dusk falls a carriage pulls away from Pemberley waved off by Mr Bingley. Mr Darcy and Georgiana.",
    "6": "Mr Darcy and Georgiana. Mr Bingley and Georgiana head inside together arm in arm but Mr Darcy remains on the doorstep watching the carriage clatter down the long curving driveway. Moments later he and Mr Bingley stride back into the drawing room where Mrs Hurst and Miss Bingley are waiting and he gives Miss Bingley a piercing stare causing her to look away. Mr Darcy then walks through the magnificent portraitlined hall at Pemberley holding aloft a candle to light his way with two dogs trotting at his heels. He enters the nowdarkened drawing room and places the candle on a mantelpiece pausing for a moment leaning against the fireplace as if lost in thought before looking over at the piano. Mr Gardiner smiles over at Mr Darcy while Georgiana stands at Lizzie's side looking down at her. They both look over at Mr Darcy and then Lizzie gets up and sets the music out for Georgiana before making her way across the room only to be stopped by Miss Bingley. Mr Darcy sits up and embarrassed. Lizzie hurries back over to Georgiana. Slowly Lizzie raises her eyes to meet Mr Darcy's who sits across the room watching her with an enraptured expression. The two gaze at each other their eyes filled with warmth and understanding. Later as dusk falls a carriage pulls away from Pemberley waved off by Mr Bingley.",
    "7": "Later as dusk falls a carriage pulls away from Pemberley waved off by Mr Bingley. Mr Darcy and Georgiana. Mr Bingley and Georgiana head inside together arm in arm but Mr Darcy remains on the doorstep watching the carriage clatter down the long curving driveway. Moments later he and Mr Bingley stride back into the drawing room where Mrs Hurst and Miss Bingley are waiting and he gives Miss Bingley a piercing stare causing her to look away. Mr Darcy then walks through the magnificent portraitlined hall at Pemberley holding aloft a candle to light his way with two dogs trotting at his heels. He enters the nowdarkened drawing room and places the candle on a mantelpiece pausing for a moment leaning against the fireplace as if lost in thought before looking over at the piano. Mr Gardiner smiles over at Mr Darcy while Georgiana stands at Lizzie's side looking down at her. They both look over at Mr Darcy and then Lizzie gets up and sets the music out for Georgiana before making her way across the room only to be stopped by Miss Bingley. Mr Darcy sits up and embarrassed. Lizzie hurries back over to Georgiana. Slowly Lizzie raises her eyes to meet Mr Darcy's who sits across the room watching her with an enraptured expression. The two gaze at each other their eyes filled with warmth and understanding.",
    "8": "The two gaze at each other their eyes filled with warmth and understanding. Later as dusk falls a carriage pulls away from Pemberley waved off by Mr Bingley. Mr Darcy and Georgiana. Mr Bingley and Georgiana head inside together arm in arm but Mr Darcy remains on the doorstep watching the carriage clatter down the long curving driveway. Moments later he and Mr Bingley stride back into the drawing room where Mrs Hurst and Miss Bingley are waiting and he gives Miss Bingley a piercing stare causing her to look away. Mr Darcy then walks through the magnificent portraitlined hall at Pemberley holding aloft a candle to light his way with two dogs trotting at his heels. He enters the nowdarkened drawing room and places the candle on a mantelpiece pausing for a moment leaning against the fireplace as if lost in thought before looking over at the piano. Mr Gardiner smiles over at Mr Darcy while Georgiana stands at Lizzie's side looking down at her. They both look over at Mr Darcy and then Lizzie gets up and sets the music out for Georgiana before making her way across the room only to be stopped by Miss Bingley. Mr Darcy sits up and embarrassed. Lizzie hurries back over to Georgiana. Slowly Lizzie raises her eyes to meet Mr Darcy's who sits across the room watching her with an enraptured expression.",
    "9": "Slowly Lizzie raises her eyes to meet Mr Darcy's who sits across the room watching her with an enraptured expression. The two gaze at each other their eyes filled with warmth and understanding. Later as dusk falls a carriage pulls away from Pemberley waved off by Mr Bingley. Mr Darcy and Georgiana. Mr Bingley and Georgiana head inside together arm in arm but Mr Darcy remains on the doorstep watching the carriage clatter down the long curving driveway. Moments later he and Mr Bingley stride back into the drawing room where Mrs Hurst and Miss Bingley are waiting and he gives Miss Bingley a piercing stare causing her to look away. Mr Darcy then walks through the magnificent portraitlined hall at Pemberley holding aloft a candle to light his way with two dogs trotting at his heels. He enters the nowdarkened drawing room and places the candle on a mantelpiece pausing for a moment leaning against the fireplace as if lost in thought before looking over at the piano. Mr Gardiner smiles over at Mr Darcy while Georgiana stands at Lizzie's side looking down at her. They both look over at Mr Darcy and then Lizzie gets up and sets the music out for Georgiana before making her way across the room only to be stopped by Miss Bingley. Mr Darcy sits up and embarrassed. Lizzie hurries back over to Georgiana.",
    "10": "Lizzie hurries back over to Georgiana. Slowly Lizzie raises her eyes to meet Mr Darcy's who sits across the room watching her with an enraptured expression. The two gaze at each other their eyes filled with warmth and understanding. Later as dusk falls a carriage pulls away from Pemberley waved off by Mr Bingley. Mr Darcy and Georgiana. Mr Bingley and Georgiana head inside together arm in arm but Mr Darcy remains on the doorstep watching the carriage clatter down the long curving driveway. Moments later he and Mr Bingley stride back into the drawing room where Mrs Hurst and Miss Bingley are waiting and he gives Miss Bingley a piercing stare causing her to look away. Mr Darcy then walks through the magnificent portraitlined hall at Pemberley holding aloft a candle to light his way with two dogs trotting at his heels. He enters the nowdarkened drawing room and places the candle on a mantelpiece pausing for a moment leaning against the fireplace as if lost in thought before looking over at the piano. Mr Gardiner smiles over at Mr Darcy while Georgiana stands at Lizzie's side looking down at her. They both look over at Mr Darcy and then Lizzie gets up and sets the music out for Georgiana before making her way across the room only to be stopped by Miss Bingley. Mr Darcy sits up and embarrassed.",
    "11": "Mr Darcy sits up and embarrassed. Lizzie hurries back over to Georgiana. Slowly Lizzie raises her eyes to meet Mr Darcy's who sits across the room watching her with an enraptured expression. The two gaze at each other their eyes filled with warmth and understanding. Later as dusk falls a carriage pulls away from Pemberley waved off by Mr Bingley. Mr Darcy and Georgiana. Mr Bingley and Georgiana head inside together arm in arm but Mr Darcy remains on the doorstep watching the carriage clatter down the long curving driveway. Moments later he and Mr Bingley stride back into the drawing room where Mrs Hurst and Miss Bingley are waiting and he gives Miss Bingley a piercing stare causing her to look away. Mr Darcy then walks through the magnificent portraitlined hall at Pemberley holding aloft a candle to light his way with two dogs trotting at his heels. He enters the nowdarkened drawing room and places the candle on a mantelpiece pausing for a moment leaning against the fireplace as if lost in thought before looking over at the piano. Mr Gardiner smiles over at Mr Darcy while Georgiana stands at Lizzie's side looking down at her. They both look over at Mr Darcy and then Lizzie gets up and sets the music out for Georgiana before making her way across the room only to be stopped by Miss Bingley.",
    "12": "They both look over at Mr Darcy and then Lizzie gets up and sets the music out for Georgiana before making her way across the room only to be stopped by Miss Bingley. Mr Darcy sits up and embarrassed. Lizzie hurries back over to Georgiana. Slowly Lizzie raises her eyes to meet Mr Darcy's who sits across the room watching her with an enraptured expression. The two gaze at each other their eyes filled with warmth and understanding. Later as dusk falls a carriage pulls away from Pemberley waved off by Mr Bingley. Mr Darcy and Georgiana. Mr Bingley and Georgiana head inside together arm in arm but Mr Darcy remains on the doorstep watching the carriage clatter down the long curving driveway. Moments later he and Mr Bingley stride back into the drawing room where Mrs Hurst and Miss Bingley are waiting and he gives Miss Bingley a piercing stare causing her to look away. Mr Darcy then walks through the magnificent portraitlined hall at Pemberley holding aloft a candle to light his way with two dogs trotting at his heels. He enters the nowdarkened drawing room and places the candle on a mantelpiece pausing for a moment leaning against the fireplace as if lost in thought before looking over at the piano. Mr Gardiner smiles over at Mr Darcy while Georgiana stands at Lizzie's side looking down at her.",
    "13": "Mr Gardiner smiles over at Mr Darcy while Georgiana stands at Lizzie's side looking down at her. They both look over at Mr Darcy and then Lizzie gets up and sets the music out for Georgiana before making her way across the room only to be stopped by Miss Bingley. Mr Darcy sits up and embarrassed. Lizzie hurries back over to Georgiana. Slowly Lizzie raises her eyes to meet Mr Darcy's who sits across the room watching her with an enraptured expression. The two gaze at each other their eyes filled with warmth and understanding. Later as dusk falls a carriage pulls away from Pemberley waved off by Mr Bingley. Mr Darcy and Georgiana. Mr Bingley and Georgiana head inside together arm in arm but Mr Darcy remains on the doorstep watching the carriage clatter down the long curving driveway. Moments later he and Mr Bingley stride back into the drawing room where Mrs Hurst and Miss Bingley are waiting and he gives Miss Bingley a piercing stare causing her to look away. Mr Darcy then walks through the magnificent portraitlined hall at Pemberley holding aloft a candle to light his way with two dogs trotting at his heels. He enters the nowdarkened drawing room and places the candle on a mantelpiece pausing for a moment leaning against the fireplace as if lost in thought before looking over at the piano."
  }
}