{
  "ground_truth": "They stand next to each other guiltily as Nullah climbs down from the tree. Sarah stares at him curiously as he moves pensively away from her. She looks shocked. He eyes her steadily. He draws near her and she looks up at him. She smiles and looks down at the ground. He gives a tight smile and walks off. She hesitates then wanders through the long grass. In daylight a steer lies dead next to a watering hole. Magarri checks the water. Drover. Sarah and Nullah ride up.",
  "iterations": {
    "1": "They stand next to each other guiltily as Nullah climbs down from the tree. Sarah stares at him curiously as he moves pensively away from her. She looks shocked. He eyes her steadily. He draws near her and she looks up at him. She smiles and looks down at the ground. He gives a tight smile and walks off. She hesitates then wanders through the long grass. In daylight a steer lies dead next to a watering hole. Magarri checks the water. Drover. Sarah and Nullah ride up.",
    "2": "Sarah and Nullah ride up. They stand next to each other guiltily as Nullah climbs down from the tree. Sarah stares at him curiously as he moves pensively away from her. She looks shocked. He eyes her steadily. He draws near her and she looks up at him. She smiles and looks down at the ground. He gives a tight smile and walks off. She hesitates then wanders through the long grass. In daylight a steer lies dead next to a watering hole. Magarri checks the water. Drover.",
    "3": "Drover. Sarah and Nullah ride up. They stand next to each other guiltily as Nullah climbs down from the tree. Sarah stares at him curiously as he moves pensively away from her. She looks shocked. He eyes her steadily. He draws near her and she looks up at him. She smiles and looks down at the ground. He gives a tight smile and walks off. She hesitates then wanders through the long grass. In daylight a steer lies dead next to a watering hole. Magarri checks the water.",
    "4": "Magarri checks the water. Drover. Sarah and Nullah ride up. They stand next to each other guiltily as Nullah climbs down from the tree. Sarah stares at him curiously as he moves pensively away from her. She looks shocked. He eyes her steadily. He draws near her and she looks up at him. She smiles and looks down at the ground. He gives a tight smile and walks off. She hesitates then wanders through the long grass. In daylight a steer lies dead next to a watering hole.",
    "5": "In daylight a steer lies dead next to a watering hole. Magarri checks the water. Drover. Sarah and Nullah ride up. They stand next to each other guiltily as Nullah climbs down from the tree. Sarah stares at him curiously as he moves pensively away from her. She looks shocked. He eyes her steadily. He draws near her and she looks up at him. She smiles and looks down at the ground. He gives a tight smile and walks off. She hesitates then wanders through the long grass.",
    "6": "She hesitates then wanders through the long grass. In daylight a steer lies dead next to a watering hole. Magarri checks the water. Drover. Sarah and Nullah ride up. They stand next to each other guiltily as Nullah climbs down from the tree. Sarah stares at him curiously as he moves pensively away from her. She looks shocked. He eyes her steadily. He draws near her and she looks up at him. She smiles and looks down at the ground. He gives a tight smile and walks off.",
    "7": "He gives a tight smile and walks off. She hesitates then wanders through the long grass. In daylight a steer lies dead next to a watering hole. Magarri checks the water. Drover. Sarah and Nullah ride up. They stand next to each other guiltily as Nullah climbs down from the tree. Sarah stares at him curiously as he moves pensively away from her. She looks shocked. He eyes her steadily. He draws near her and she looks up at him. She smiles and looks down at the ground.",
    "8": "She smiles and looks down at the ground. He gives a tight smile and walks off. She hesitates then wanders through the long grass. In daylight a steer lies dead next to a watering hole. Magarri checks the water. Drover. Sarah and Nullah ride up. They stand next to each other guiltily as Nullah climbs down from the tree. Sarah stares at him curiously as he moves pensively away from her. She looks shocked. He eyes her steadily. He draws near her and she looks up at him.",
    "9": "He draws near her and she looks up at him. She smiles and looks down at the ground. He gives a tight smile and walks off. She hesitates then wanders through the long grass. In daylight a steer lies dead next to a watering hole. Magarri checks the water. Drover. Sarah and Nullah ride up. They stand next to each other guiltily as Nullah climbs down from the tree. Sarah stares at him curiously as he moves pensively away from her. She looks shocked. He eyes her steadily.",
    "10": "He eyes her steadily. He draws near her and she looks up at him. She smiles and looks down at the ground. He gives a tight smile and walks off. She hesitates then wanders through the long grass. In daylight a steer lies dead next to a watering hole. Magarri checks the water. Drover. Sarah and Nullah ride up. They stand next to each other guiltily as Nullah climbs down from the tree. Sarah stares at him curiously as he moves pensively away from her. She looks shocked.",
    "11": "She looks shocked. He eyes her steadily. He draws near her and she looks up at him. She smiles and looks down at the ground. He gives a tight smile and walks off. She hesitates then wanders through the long grass. In daylight a steer lies dead next to a watering hole. Magarri checks the water. Drover. Sarah and Nullah ride up. They stand next to each other guiltily as Nullah climbs down from the tree. Sarah stares at him curiously as he moves pensively away from her.",
    "12": "Sarah stares at him curiously as he moves pensively away from her. She looks shocked. He eyes her steadily. He draws near her and she looks up at him. She smiles and looks down at the ground. He gives a tight smile and walks off. She hesitates then wanders through the long grass. In daylight a steer lies dead next to a watering hole. Magarri checks the water. Drover. Sarah and Nullah ride up. They stand next to each other guiltily as Nullah climbs down from the tree.",
    "13": "They stand next to each other guiltily as Nullah climbs down from the tree. Sarah stares at him curiously as he moves pensively away from her. She looks shocked. He eyes her steadily. He draws near her and she looks up at him. She smiles and looks down at the ground. He gives a tight smile and walks off. She hesitates then wanders through the long grass. In daylight a steer lies dead next to a watering hole. Magarri checks the water. Drover. Sarah and Nullah ride up."
  }
}