{
  "ground_truth": "A wooden loading tunnel leads right to it. As Fletcher stares policemen emerge from their office. Administrator Allsop looks down his telescope. Drover gallops through Carney's men and cuts the rope holding up the gate at the end of the tunnel. It drops closed trapping the cattle inside. Drover cracks his whip as Sarah's cattle thunder down the wharf. Townspeople cheer her on as she rides past the hotel. The cattle are streaming onto a ship. Nullah rides up to Sarah. She nods and smiles triumphantly as Nullah rides behind the last of the herd. She catches Fletcher's eye. They glare at each other and she rides towards him.",
  "iterations": {
    "1": "A wooden loading tunnel leads right to it. As Fletcher stares policemen emerge from their office. Administrator Allsop looks down his telescope. Drover gallops through Carney's men and cuts the rope holding up the gate at the end of the tunnel. It drops closed trapping the cattle inside. Drover cracks his whip as Sarah's cattle thunder down the wharf. Townspeople cheer her on as she rides past the hotel. The cattle are streaming onto a ship. Nullah rides up to Sarah. She nods and smiles triumphantly as Nullah rides behind the last of the herd. She catches Fletcher's eye. They glare at each other and she rides towards him.",
    "2": "They glare at each other and she rides towards him. A wooden loading tunnel leads right to it. As Fletcher stares policemen emerge from their office. Administrator Allsop looks down his telescope. Drover gallops through Carney's men and cuts the rope holding up the gate at the end of the tunnel. It drops closed trapping the cattle inside. Drover cracks his whip as Sarah's cattle thunder down the wharf. Townspeople cheer her on as she rides past the hotel. The cattle are streaming onto a ship. Nullah rides up to Sarah. She nods and smiles triumphantly as Nullah rides behind the last of the herd. She catches Fletcher's eye.",
    "3": "She catches Fletcher's eye. They glare at each other and she rides towards him. A wooden loading tunnel leads right to it. As Fletcher stares policemen emerge from their office. Administrator Allsop looks down his telescope. Drover gallops through Carney's men and cuts the rope holding up the gate at the end of the tunnel. It drops closed trapping the cattle inside. Drover cracks his whip as Sarah's cattle thunder down the wharf. Townspeople cheer her on as she rides past the hotel. The cattle are streaming onto a ship. Nullah rides up to Sarah. She nods and smiles triumphantly as Nullah rides behind the last of the herd.",
    "4": "She nods and smiles triumphantly as Nullah rides behind the last of the herd. She catches Fletcher's eye. They glare at each other and she rides towards him. A wooden loading tunnel leads right to it. As Fletcher stares policemen emerge from their office. Administrator Allsop looks down his telescope. Drover gallops through Carney's men and cuts the rope holding up the gate at the end of the tunnel. It drops closed trapping the cattle inside. Drover cracks his whip as Sarah's cattle thunder down the wharf. Townspeople cheer her on as she rides past the hotel. The cattle are streaming onto a ship. Nullah rides up to Sarah.",
    "5": "Nullah rides up to Sarah. She nods and smiles triumphantly as Nullah rides behind the last of the herd. She catches Fletcher's eye. They glare at each other and she rides towards him. A wooden loading tunnel leads right to it. As Fletcher stares policemen emerge from their office. Administrator Allsop looks down his telescope. Drover gallops through Carney's men and cuts the rope holding up the gate at the end of the tunnel. It drops closed trapping the cattle inside. Drover cracks his whip as Sarah's cattle thunder down the wharf. Townspeople cheer her on as she rides past the hotel. The cattle are streaming onto a ship.",
    "6": "The cattle are streaming onto a ship. Nullah rides up to Sarah. She nods and smiles triumphantly as Nullah rides behind the last of the herd. She catches Fletcher's eye. They glare at each other and she rides towards him. A wooden loading tunnel leads right to it. As Fletcher stares policemen emerge from their office. Administrator Allsop looks down his telescope. Drover gallops through Carney's men and cuts the rope holding up the gate at the end of the tunnel. It drops closed trapping the cattle inside. Drover cracks his whip as Sarah's cattle thunder down the wharf. Townspeople cheer her on as she rides past the hotel.",
    "7": "Townspeople cheer her on as she rides past the hotel. The cattle are streaming onto a ship. Nullah rides up to Sarah. She nods and smiles triumphantly as Nullah rides behind the last of the herd. She catches Fletcher's eye. They glare at each other and she rides towards him. A wooden loading tunnel leads right to it. As Fletcher stares policemen emerge from their office. Administrator Allsop looks down his telescope. Drover gallops through Carney's men and cuts the rope holding up the gate at the end of the tunnel. It drops closed trapping the cattle inside. Drover cracks his whip as Sarah's cattle thunder down the wharf.",
    "8": "Drover cracks his whip as Sarah's cattle thunder down the wharf. Townspeople cheer her on as she rides past the hotel. The cattle are streaming onto a ship. Nullah rides up to Sarah. She nods and smiles triumphantly as Nullah rides behind the last of the herd. She catches Fletcher's eye. They glare at each other and she rides towards him. A wooden loading tunnel leads right to it. As Fletcher stares policemen emerge from their office. Administrator Allsop looks down his telescope. Drover gallops through Carney's men and cuts the rope holding up the gate at the end of the tunnel. It drops closed trapping the cattle inside.",
    "9": "It drops closed trapping the cattle inside. Drover cracks his whip as Sarah's cattle thunder down the wharf. Townspeople cheer her on as she rides past the hotel. The cattle are streaming onto a ship. Nullah rides up to Sarah. She nods and smiles triumphantly as Nullah rides behind the last of the herd. She catches Fletcher's eye. They glare at each other and she rides towards him. A wooden loading tunnel leads right to it. As Fletcher stares policemen emerge from their office. Administrator Allsop looks down his telescope. Drover gallops through Carney's men and cuts the rope holding up the gate at the end of the tunnel.",
    "10": "Drover gallops through Carney's men and cuts the rope holding up the gate at the end of the tunnel. It drops closed trapping the cattle inside. Drover cracks his whip as Sarah's cattle thunder down the wharf. Townspeople cheer her on as she rides past the hotel. The cattle are streaming onto a ship. Nullah rides up to Sarah. She nods and smiles triumphantly as Nullah rides behind the last of the herd. She catches Fletcher's eye. They glare at each other and she rides towards him. A wooden loading tunnel leads right to it. As Fletcher stares policemen emerge from their office. Administrator Allsop looks down his telescope.",
    "11": "Administrator Allsop looks down his telescope. Drover gallops through Carney's men and cuts the rope holding up the gate at the end of the tunnel. It drops closed trapping the cattle inside. Drover cracks his whip as Sarah's cattle thunder down the wharf. Townspeople cheer her on as she rides past the hotel. The cattle are streaming onto a ship. Nullah rides up to Sarah. She nods and smiles triumphantly as Nullah rides behind the last of the herd. She catches Fletcher's eye. They glare at each other and she rides towards him. A wooden loading tunnel leads right to it. As Fletcher stares policemen emerge from their office.",
    "12": "As Fletcher stares policemen emerge from their office. Administrator Allsop looks down his telescope. Drover gallops through Carney's men and cuts the rope holding up the gate at the end of the tunnel. It drops closed trapping the cattle inside. Drover cracks his whip as Sarah's cattle thunder down the wharf. Townspeople cheer her on as she rides past the hotel. The cattle are streaming onto a ship. Nullah rides up to Sarah. She nods and smiles triumphantly as Nullah rides behind the last of the herd. She catches Fletcher's eye. They glare at each other and she rides towards him. A wooden loading tunnel leads right to it.",
    "13": "A wooden loading tunnel leads right to it. As Fletcher stares policemen emerge from their office. Administrator Allsop looks down his telescope. Drover gallops through Carney's men and cuts the rope holding up the gate at the end of the tunnel. It drops closed trapping the cattle inside. Drover cracks his whip as Sarah's cattle thunder down the wharf. Townspeople cheer her on as she rides past the hotel. The cattle are streaming onto a ship. Nullah rides up to Sarah. She nods and smiles triumphantly as Nullah rides behind the last of the herd. She catches Fletcher's eye. They glare at each other and she rides towards him."
  }
}