{
  "ground_truth": "The crowd yells for Forrest as he runs across the field with the defending team chasing him continuing along the field until he runs into the end zone prompting the crowd to cheer. Forrest stops in the end zone upon hearing the crowd and is met by band members rushing toward him with their hands up signaling him to stop and stay in the end zone while a group of defending players falls over each other nearby. Forrest looks on as the crowd cheers wildly. President Kennedy holds an autographed football with the AllAmerican Team including Forrest in suits standing behind him. The AllAmerican players mingle around the food table where Forrest steps up to see a large spread of food and soda including numerous bottles of Dr Pepper. He takes a bottle of Dr Pepper from the buffet a servant opens it for him and Forrest begins to guzzle it eventually setting down an empty bottle next to many others holding his stomach and burping. In black and white footage President Kennedy shakes hands with the AllAmerican football players including Forrest who steps up after another player and shakes the President's hand before President Kennedy turns and smiles. Forrest urinates in the bathroom lowers the lid and flushes then washes his hands and notices an autographed photo of Marilyn Monroe and a photo of John with his brother Bobby. Archival footage shows President Kennedy rising in a convertible and smiling followed by Robert Kennedy at a podium receiving applause. Forrest sitting on a bench shakes his head as students in caps and gowns receive their diplomas and upon his name being called he steps up to accept his diploma with the dean shaking his hand vigorously. Looking out into the crowd Forrest sees Mrs Gump who is crying and later they have their picture taken in front of a large statue. A military recruiter spots Forrest steps up to him and Mrs Gump takes the diploma from Forrest as the recruiter slaps Forrest on the shoulder and hands him military literature.",
  "iterations": {
    "1": "The crowd yells for Forrest as he runs across the field with the defending team chasing him continuing along the field until he runs into the end zone prompting the crowd to cheer. Forrest stops in the end zone upon hearing the crowd and is met by band members rushing toward him with their hands up signaling him to stop and stay in the end zone while a group of defending players falls over each other nearby. Forrest looks on as the crowd cheers wildly. President Kennedy holds an autographed football with the AllAmerican Team including Forrest in suits standing behind him. The AllAmerican players mingle around the food table where Forrest steps up to see a large spread of food and soda including numerous bottles of Dr Pepper. He takes a bottle of Dr Pepper from the buffet a servant opens it for him and Forrest begins to guzzle it eventually setting down an empty bottle next to many others holding his stomach and burping. In black and white footage President Kennedy shakes hands with the AllAmerican football players including Forrest who steps up after another player and shakes the President's hand before President Kennedy turns and smiles. Forrest urinates in the bathroom lowers the lid and flushes then washes his hands and notices an autographed photo of Marilyn Monroe and a photo of John with his brother Bobby. Archival footage shows President Kennedy rising in a convertible and smiling followed by Robert Kennedy at a podium receiving applause. Forrest sitting on a bench shakes his head as students in caps and gowns receive their diplomas and upon his name being called he steps up to accept his diploma with the dean shaking his hand vigorously. Looking out into the crowd Forrest sees Mrs Gump who is crying and later they have their picture taken in front of a large statue. A military recruiter spots Forrest steps up to him and Mrs Gump takes the diploma from Forrest as the recruiter slaps Forrest on the shoulder and hands him military literature.",
    "2": "A military recruiter spots Forrest steps up to him and Mrs Gump takes the diploma from Forrest as the recruiter slaps Forrest on the shoulder and hands him military literature. The crowd yells for Forrest as he runs across the field with the defending team chasing him continuing along the field until he runs into the end zone prompting the crowd to cheer. Forrest stops in the end zone upon hearing the crowd and is met by band members rushing toward him with their hands up signaling him to stop and stay in the end zone while a group of defending players falls over each other nearby. Forrest looks on as the crowd cheers wildly. President Kennedy holds an autographed football with the AllAmerican Team including Forrest in suits standing behind him. The AllAmerican players mingle around the food table where Forrest steps up to see a large spread of food and soda including numerous bottles of Dr Pepper. He takes a bottle of Dr Pepper from the buffet a servant opens it for him and Forrest begins to guzzle it eventually setting down an empty bottle next to many others holding his stomach and burping. In black and white footage President Kennedy shakes hands with the AllAmerican football players including Forrest who steps up after another player and shakes the President's hand before President Kennedy turns and smiles. Forrest urinates in the bathroom lowers the lid and flushes then washes his hands and notices an autographed photo of Marilyn Monroe and a photo of John with his brother Bobby. Archival footage shows President Kennedy rising in a convertible and smiling followed by Robert Kennedy at a podium receiving applause. Forrest sitting on a bench shakes his head as students in caps and gowns receive their diplomas and upon his name being called he steps up to accept his diploma with the dean shaking his hand vigorously. Looking out into the crowd Forrest sees Mrs Gump who is crying and later they have their picture taken in front of a large statue.",
    "3": "Looking out into the crowd Forrest sees Mrs Gump who is crying and later they have their picture taken in front of a large statue. A military recruiter spots Forrest steps up to him and Mrs Gump takes the diploma from Forrest as the recruiter slaps Forrest on the shoulder and hands him military literature. The crowd yells for Forrest as he runs across the field with the defending team chasing him continuing along the field until he runs into the end zone prompting the crowd to cheer. Forrest stops in the end zone upon hearing the crowd and is met by band members rushing toward him with their hands up signaling him to stop and stay in the end zone while a group of defending players falls over each other nearby. Forrest looks on as the crowd cheers wildly. President Kennedy holds an autographed football with the AllAmerican Team including Forrest in suits standing behind him. The AllAmerican players mingle around the food table where Forrest steps up to see a large spread of food and soda including numerous bottles of Dr Pepper. He takes a bottle of Dr Pepper from the buffet a servant opens it for him and Forrest begins to guzzle it eventually setting down an empty bottle next to many others holding his stomach and burping. In black and white footage President Kennedy shakes hands with the AllAmerican football players including Forrest who steps up after another player and shakes the President's hand before President Kennedy turns and smiles. Forrest urinates in the bathroom lowers the lid and flushes then washes his hands and notices an autographed photo of Marilyn Monroe and a photo of John with his brother Bobby. Archival footage shows President Kennedy rising in a convertible and smiling followed by Robert Kennedy at a podium receiving applause. Forrest sitting on a bench shakes his head as students in caps and gowns receive their diplomas and upon his name being called he steps up to accept his diploma with the dean shaking his hand vigorously.",
    "4": "Forrest sitting on a bench shakes his head as students in caps and gowns receive their diplomas and upon his name being called he steps up to accept his diploma with the dean shaking his hand vigorously. Looking out into the crowd Forrest sees Mrs Gump who is crying and later they have their picture taken in front of a large statue. A military recruiter spots Forrest steps up to him and Mrs Gump takes the diploma from Forrest as the recruiter slaps Forrest on the shoulder and hands him military literature. The crowd yells for Forrest as he runs across the field with the defending team chasing him continuing along the field until he runs into the end zone prompting the crowd to cheer. Forrest stops in the end zone upon hearing the crowd and is met by band members rushing toward him with their hands up signaling him to stop and stay in the end zone while a group of defending players falls over each other nearby. Forrest looks on as the crowd cheers wildly. President Kennedy holds an autographed football with the AllAmerican Team including Forrest in suits standing behind him. The AllAmerican players mingle around the food table where Forrest steps up to see a large spread of food and soda including numerous bottles of Dr Pepper. He takes a bottle of Dr Pepper from the buffet a servant opens it for him and Forrest begins to guzzle it eventually setting down an empty bottle next to many others holding his stomach and burping. In black and white footage President Kennedy shakes hands with the AllAmerican football players including Forrest who steps up after another player and shakes the President's hand before President Kennedy turns and smiles. Forrest urinates in the bathroom lowers the lid and flushes then washes his hands and notices an autographed photo of Marilyn Monroe and a photo of John with his brother Bobby. Archival footage shows President Kennedy rising in a convertible and smiling followed by Robert Kennedy at a podium receiving applause.",
    "5": "Archival footage shows President Kennedy rising in a convertible and smiling followed by Robert Kennedy at a podium receiving applause. Forrest sitting on a bench shakes his head as students in caps and gowns receive their diplomas and upon his name being called he steps up to accept his diploma with the dean shaking his hand vigorously. Looking out into the crowd Forrest sees Mrs Gump who is crying and later they have their picture taken in front of a large statue. A military recruiter spots Forrest steps up to him and Mrs Gump takes the diploma from Forrest as the recruiter slaps Forrest on the shoulder and hands him military literature. The crowd yells for Forrest as he runs across the field with the defending team chasing him continuing along the field until he runs into the end zone prompting the crowd to cheer. Forrest stops in the end zone upon hearing the crowd and is met by band members rushing toward him with their hands up signaling him to stop and stay in the end zone while a group of defending players falls over each other nearby. Forrest looks on as the crowd cheers wildly. President Kennedy holds an autographed football with the AllAmerican Team including Forrest in suits standing behind him. The AllAmerican players mingle around the food table where Forrest steps up to see a large spread of food and soda including numerous bottles of Dr Pepper. He takes a bottle of Dr Pepper from the buffet a servant opens it for him and Forrest begins to guzzle it eventually setting down an empty bottle next to many others holding his stomach and burping. In black and white footage President Kennedy shakes hands with the AllAmerican football players including Forrest who steps up after another player and shakes the President's hand before President Kennedy turns and smiles. Forrest urinates in the bathroom lowers the lid and flushes then washes his hands and notices an autographed photo of Marilyn Monroe and a photo of John with his brother Bobby.",
    "6": "Forrest urinates in the bathroom lowers the lid and flushes then washes his hands and notices an autographed photo of Marilyn Monroe and a photo of John with his brother Bobby. Archival footage shows President Kennedy rising in a convertible and smiling followed by Robert Kennedy at a podium receiving applause. Forrest sitting on a bench shakes his head as students in caps and gowns receive their diplomas and upon his name being called he steps up to accept his diploma with the dean shaking his hand vigorously. Looking out into the crowd Forrest sees Mrs Gump who is crying and later they have their picture taken in front of a large statue. A military recruiter spots Forrest steps up to him and Mrs Gump takes the diploma from Forrest as the recruiter slaps Forrest on the shoulder and hands him military literature. The crowd yells for Forrest as he runs across the field with the defending team chasing him continuing along the field until he runs into the end zone prompting the crowd to cheer. Forrest stops in the end zone upon hearing the crowd and is met by band members rushing toward him with their hands up signaling him to stop and stay in the end zone while a group of defending players falls over each other nearby. Forrest looks on as the crowd cheers wildly. President Kennedy holds an autographed football with the AllAmerican Team including Forrest in suits standing behind him. The AllAmerican players mingle around the food table where Forrest steps up to see a large spread of food and soda including numerous bottles of Dr Pepper. He takes a bottle of Dr Pepper from the buffet a servant opens it for him and Forrest begins to guzzle it eventually setting down an empty bottle next to many others holding his stomach and burping. In black and white footage President Kennedy shakes hands with the AllAmerican football players including Forrest who steps up after another player and shakes the President's hand before President Kennedy turns and smiles.",
    "7": "In black and white footage President Kennedy shakes hands with the AllAmerican football players including Forrest who steps up after another player and shakes the President's hand before President Kennedy turns and smiles. Forrest urinates in the bathroom lowers the lid and flushes then washes his hands and notices an autographed photo of Marilyn Monroe and a photo of John with his brother Bobby. Archival footage shows President Kennedy rising in a convertible and smiling followed by Robert Kennedy at a podium receiving applause. Forrest sitting on a bench shakes his head as students in caps and gowns receive their diplomas and upon his name being called he steps up to accept his diploma with the dean shaking his hand vigorously. Looking out into the crowd Forrest sees Mrs Gump who is crying and later they have their picture taken in front of a large statue. A military recruiter spots Forrest steps up to him and Mrs Gump takes the diploma from Forrest as the recruiter slaps Forrest on the shoulder and hands him military literature. The crowd yells for Forrest as he runs across the field with the defending team chasing him continuing along the field until he runs into the end zone prompting the crowd to cheer. Forrest stops in the end zone upon hearing the crowd and is met by band members rushing toward him with their hands up signaling him to stop and stay in the end zone while a group of defending players falls over each other nearby. Forrest looks on as the crowd cheers wildly. President Kennedy holds an autographed football with the AllAmerican Team including Forrest in suits standing behind him. The AllAmerican players mingle around the food table where Forrest steps up to see a large spread of food and soda including numerous bottles of Dr Pepper. He takes a bottle of Dr Pepper from the buffet a servant opens it for him and Forrest begins to guzzle it eventually setting down an empty bottle next to many others holding his stomach and burping.",
    "8": "He takes a bottle of Dr Pepper from the buffet a servant opens it for him and Forrest begins to guzzle it eventually setting down an empty bottle next to many others holding his stomach and burping. In black and white footage President Kennedy shakes hands with the AllAmerican football players including Forrest who steps up after another player and shakes the President's hand before President Kennedy turns and smiles. Forrest urinates in the bathroom lowers the lid and flushes then washes his hands and notices an autographed photo of Marilyn Monroe and a photo of John with his brother Bobby. Archival footage shows President Kennedy rising in a convertible and smiling followed by Robert Kennedy at a podium receiving applause. Forrest sitting on a bench shakes his head as students in caps and gowns receive their diplomas and upon his name being called he steps up to accept his diploma with the dean shaking his hand vigorously. Looking out into the crowd Forrest sees Mrs Gump who is crying and later they have their picture taken in front of a large statue. A military recruiter spots Forrest steps up to him and Mrs Gump takes the diploma from Forrest as the recruiter slaps Forrest on the shoulder and hands him military literature. The crowd yells for Forrest as he runs across the field with the defending team chasing him continuing along the field until he runs into the end zone prompting the crowd to cheer. Forrest stops in the end zone upon hearing the crowd and is met by band members rushing toward him with their hands up signaling him to stop and stay in the end zone while a group of defending players falls over each other nearby. Forrest looks on as the crowd cheers wildly. President Kennedy holds an autographed football with the AllAmerican Team including Forrest in suits standing behind him. The AllAmerican players mingle around the food table where Forrest steps up to see a large spread of food and soda including numerous bottles of Dr Pepper.",
    "9": "The AllAmerican players mingle around the food table where Forrest steps up to see a large spread of food and soda including numerous bottles of Dr Pepper. He takes a bottle of Dr Pepper from the buffet a servant opens it for him and Forrest begins to guzzle it eventually setting down an empty bottle next to many others holding his stomach and burping. In black and white footage President Kennedy shakes hands with the AllAmerican football players including Forrest who steps up after another player and shakes the President's hand before President Kennedy turns and smiles. Forrest urinates in the bathroom lowers the lid and flushes then washes his hands and notices an autographed photo of Marilyn Monroe and a photo of John with his brother Bobby. Archival footage shows President Kennedy rising in a convertible and smiling followed by Robert Kennedy at a podium receiving applause. Forrest sitting on a bench shakes his head as students in caps and gowns receive their diplomas and upon his name being called he steps up to accept his diploma with the dean shaking his hand vigorously. Looking out into the crowd Forrest sees Mrs Gump who is crying and later they have their picture taken in front of a large statue. A military recruiter spots Forrest steps up to him and Mrs Gump takes the diploma from Forrest as the recruiter slaps Forrest on the shoulder and hands him military literature. The crowd yells for Forrest as he runs across the field with the defending team chasing him continuing along the field until he runs into the end zone prompting the crowd to cheer. Forrest stops in the end zone upon hearing the crowd and is met by band members rushing toward him with their hands up signaling him to stop and stay in the end zone while a group of defending players falls over each other nearby. Forrest looks on as the crowd cheers wildly. President Kennedy holds an autographed football with the AllAmerican Team including Forrest in suits standing behind him.",
    "10": "President Kennedy holds an autographed football with the AllAmerican Team including Forrest in suits standing behind him. The AllAmerican players mingle around the food table where Forrest steps up to see a large spread of food and soda including numerous bottles of Dr Pepper. He takes a bottle of Dr Pepper from the buffet a servant opens it for him and Forrest begins to guzzle it eventually setting down an empty bottle next to many others holding his stomach and burping. In black and white footage President Kennedy shakes hands with the AllAmerican football players including Forrest who steps up after another player and shakes the President's hand before President Kennedy turns and smiles. Forrest urinates in the bathroom lowers the lid and flushes then washes his hands and notices an autographed photo of Marilyn Monroe and a photo of John with his brother Bobby. Archival footage shows President Kennedy rising in a convertible and smiling followed by Robert Kennedy at a podium receiving applause. Forrest sitting on a bench shakes his head as students in caps and gowns receive their diplomas and upon his name being called he steps up to accept his diploma with the dean shaking his hand vigorously. Looking out into the crowd Forrest sees Mrs Gump who is crying and later they have their picture taken in front of a large statue. A military recruiter spots Forrest steps up to him and Mrs Gump takes the diploma from Forrest as the recruiter slaps Forrest on the shoulder and hands him military literature. The crowd yells for Forrest as he runs across the field with the defending team chasing him continuing along the field until he runs into the end zone prompting the crowd to cheer. Forrest stops in the end zone upon hearing the crowd and is met by band members rushing toward him with their hands up signaling him to stop and stay in the end zone while a group of defending players falls over each other nearby. Forrest looks on as the crowd cheers wildly.",
    "11": "Forrest looks on as the crowd cheers wildly. President Kennedy holds an autographed football with the AllAmerican Team including Forrest in suits standing behind him. The AllAmerican players mingle around the food table where Forrest steps up to see a large spread of food and soda including numerous bottles of Dr Pepper. He takes a bottle of Dr Pepper from the buffet a servant opens it for him and Forrest begins to guzzle it eventually setting down an empty bottle next to many others holding his stomach and burping. In black and white footage President Kennedy shakes hands with the AllAmerican football players including Forrest who steps up after another player and shakes the President's hand before President Kennedy turns and smiles. Forrest urinates in the bathroom lowers the lid and flushes then washes his hands and notices an autographed photo of Marilyn Monroe and a photo of John with his brother Bobby. Archival footage shows President Kennedy rising in a convertible and smiling followed by Robert Kennedy at a podium receiving applause. Forrest sitting on a bench shakes his head as students in caps and gowns receive their diplomas and upon his name being called he steps up to accept his diploma with the dean shaking his hand vigorously. Looking out into the crowd Forrest sees Mrs Gump who is crying and later they have their picture taken in front of a large statue. A military recruiter spots Forrest steps up to him and Mrs Gump takes the diploma from Forrest as the recruiter slaps Forrest on the shoulder and hands him military literature. The crowd yells for Forrest as he runs across the field with the defending team chasing him continuing along the field until he runs into the end zone prompting the crowd to cheer. Forrest stops in the end zone upon hearing the crowd and is met by band members rushing toward him with their hands up signaling him to stop and stay in the end zone while a group of defending players falls over each other nearby.",
    "12": "Forrest stops in the end zone upon hearing the crowd and is met by band members rushing toward him with their hands up signaling him to stop and stay in the end zone while a group of defending players falls over each other nearby. Forrest looks on as the crowd cheers wildly. President Kennedy holds an autographed football with the AllAmerican Team including Forrest in suits standing behind him. The AllAmerican players mingle around the food table where Forrest steps up to see a large spread of food and soda including numerous bottles of Dr Pepper. He takes a bottle of Dr Pepper from the buffet a servant opens it for him and Forrest begins to guzzle it eventually setting down an empty bottle next to many others holding his stomach and burping. In black and white footage President Kennedy shakes hands with the AllAmerican football players including Forrest who steps up after another player and shakes the President's hand before President Kennedy turns and smiles. Forrest urinates in the bathroom lowers the lid and flushes then washes his hands and notices an autographed photo of Marilyn Monroe and a photo of John with his brother Bobby. Archival footage shows President Kennedy rising in a convertible and smiling followed by Robert Kennedy at a podium receiving applause. Forrest sitting on a bench shakes his head as students in caps and gowns receive their diplomas and upon his name being called he steps up to accept his diploma with the dean shaking his hand vigorously. Looking out into the crowd Forrest sees Mrs Gump who is crying and later they have their picture taken in front of a large statue. A military recruiter spots Forrest steps up to him and Mrs Gump takes the diploma from Forrest as the recruiter slaps Forrest on the shoulder and hands him military literature. The crowd yells for Forrest as he runs across the field with the defending team chasing him continuing along the field until he runs into the end zone prompting the crowd to cheer.",
    "13": "The crowd yells for Forrest as he runs across the field with the defending team chasing him continuing along the field until he runs into the end zone prompting the crowd to cheer. Forrest stops in the end zone upon hearing the crowd and is met by band members rushing toward him with their hands up signaling him to stop and stay in the end zone while a group of defending players falls over each other nearby. Forrest looks on as the crowd cheers wildly. President Kennedy holds an autographed football with the AllAmerican Team including Forrest in suits standing behind him. The AllAmerican players mingle around the food table where Forrest steps up to see a large spread of food and soda including numerous bottles of Dr Pepper. He takes a bottle of Dr Pepper from the buffet a servant opens it for him and Forrest begins to guzzle it eventually setting down an empty bottle next to many others holding his stomach and burping. In black and white footage President Kennedy shakes hands with the AllAmerican football players including Forrest who steps up after another player and shakes the President's hand before President Kennedy turns and smiles. Forrest urinates in the bathroom lowers the lid and flushes then washes his hands and notices an autographed photo of Marilyn Monroe and a photo of John with his brother Bobby. Archival footage shows President Kennedy rising in a convertible and smiling followed by Robert Kennedy at a podium receiving applause. Forrest sitting on a bench shakes his head as students in caps and gowns receive their diplomas and upon his name being called he steps up to accept his diploma with the dean shaking his hand vigorously. Looking out into the crowd Forrest sees Mrs Gump who is crying and later they have their picture taken in front of a large statue. A military recruiter spots Forrest steps up to him and Mrs Gump takes the diploma from Forrest as the recruiter slaps Forrest on the shoulder and hands him military literature."
  }
}