{
  "ground_truth": "She waves her wand. Harry blinks as his glasses repair themselves. She takes him to a bookshop where the Weasley family are standing near the counter. A queue of excited customers are waiting to get their book signed. A blond man with a blue suit and matching cloak appears. He smiles smugly. Posing for the camera. Lockhart spots Harry's grubby face in the crowd. The photographer pulls Harry forward. Ron pulls a face. They head for the door. A boy with very fair hair tears a page from a book.",
  "iterations": {
    "1": "She waves her wand. Harry blinks as his glasses repair themselves. She takes him to a bookshop where the Weasley family are standing near the counter. A queue of excited customers are waiting to get their book signed. A blond man with a blue suit and matching cloak appears. He smiles smugly. Posing for the camera. Lockhart spots Harry's grubby face in the crowd. The photographer pulls Harry forward. Ron pulls a face. They head for the door. A boy with very fair hair tears a page from a book.",
    "2": "A boy with very fair hair tears a page from a book. She waves her wand. Harry blinks as his glasses repair themselves. She takes him to a bookshop where the Weasley family are standing near the counter. A queue of excited customers are waiting to get their book signed. A blond man with a blue suit and matching cloak appears. He smiles smugly. Posing for the camera. Lockhart spots Harry's grubby face in the crowd. The photographer pulls Harry forward. Ron pulls a face. They head for the door.",
    "3": "They head for the door. A boy with very fair hair tears a page from a book. She waves her wand. Harry blinks as his glasses repair themselves. She takes him to a bookshop where the Weasley family are standing near the counter. A queue of excited customers are waiting to get their book signed. A blond man with a blue suit and matching cloak appears. He smiles smugly. Posing for the camera. Lockhart spots Harry's grubby face in the crowd. The photographer pulls Harry forward. Ron pulls a face.",
    "4": "Ron pulls a face. They head for the door. A boy with very fair hair tears a page from a book. She waves her wand. Harry blinks as his glasses repair themselves. She takes him to a bookshop where the Weasley family are standing near the counter. A queue of excited customers are waiting to get their book signed. A blond man with a blue suit and matching cloak appears. He smiles smugly. Posing for the camera. Lockhart spots Harry's grubby face in the crowd. The photographer pulls Harry forward.",
    "5": "The photographer pulls Harry forward. Ron pulls a face. They head for the door. A boy with very fair hair tears a page from a book. She waves her wand. Harry blinks as his glasses repair themselves. She takes him to a bookshop where the Weasley family are standing near the counter. A queue of excited customers are waiting to get their book signed. A blond man with a blue suit and matching cloak appears. He smiles smugly. Posing for the camera. Lockhart spots Harry's grubby face in the crowd.",
    "6": "Lockhart spots Harry's grubby face in the crowd. The photographer pulls Harry forward. Ron pulls a face. They head for the door. A boy with very fair hair tears a page from a book. She waves her wand. Harry blinks as his glasses repair themselves. She takes him to a bookshop where the Weasley family are standing near the counter. A queue of excited customers are waiting to get their book signed. A blond man with a blue suit and matching cloak appears. He smiles smugly. Posing for the camera.",
    "7": "Posing for the camera. Lockhart spots Harry's grubby face in the crowd. The photographer pulls Harry forward. Ron pulls a face. They head for the door. A boy with very fair hair tears a page from a book. She waves her wand. Harry blinks as his glasses repair themselves. She takes him to a bookshop where the Weasley family are standing near the counter. A queue of excited customers are waiting to get their book signed. A blond man with a blue suit and matching cloak appears. He smiles smugly.",
    "8": "He smiles smugly. Posing for the camera. Lockhart spots Harry's grubby face in the crowd. The photographer pulls Harry forward. Ron pulls a face. They head for the door. A boy with very fair hair tears a page from a book. She waves her wand. Harry blinks as his glasses repair themselves. She takes him to a bookshop where the Weasley family are standing near the counter. A queue of excited customers are waiting to get their book signed. A blond man with a blue suit and matching cloak appears.",
    "9": "A blond man with a blue suit and matching cloak appears. He smiles smugly. Posing for the camera. Lockhart spots Harry's grubby face in the crowd. The photographer pulls Harry forward. Ron pulls a face. They head for the door. A boy with very fair hair tears a page from a book. She waves her wand. Harry blinks as his glasses repair themselves. She takes him to a bookshop where the Weasley family are standing near the counter. A queue of excited customers are waiting to get their book signed.",
    "10": "A queue of excited customers are waiting to get their book signed. A blond man with a blue suit and matching cloak appears. He smiles smugly. Posing for the camera. Lockhart spots Harry's grubby face in the crowd. The photographer pulls Harry forward. Ron pulls a face. They head for the door. A boy with very fair hair tears a page from a book. She waves her wand. Harry blinks as his glasses repair themselves. She takes him to a bookshop where the Weasley family are standing near the counter.",
    "11": "She takes him to a bookshop where the Weasley family are standing near the counter. A queue of excited customers are waiting to get their book signed. A blond man with a blue suit and matching cloak appears. He smiles smugly. Posing for the camera. Lockhart spots Harry's grubby face in the crowd. The photographer pulls Harry forward. Ron pulls a face. They head for the door. A boy with very fair hair tears a page from a book. She waves her wand. Harry blinks as his glasses repair themselves.",
    "12": "Harry blinks as his glasses repair themselves. She takes him to a bookshop where the Weasley family are standing near the counter. A queue of excited customers are waiting to get their book signed. A blond man with a blue suit and matching cloak appears. He smiles smugly. Posing for the camera. Lockhart spots Harry's grubby face in the crowd. The photographer pulls Harry forward. Ron pulls a face. They head for the door. A boy with very fair hair tears a page from a book. She waves her wand.",
    "13": "She waves her wand. Harry blinks as his glasses repair themselves. She takes him to a bookshop where the Weasley family are standing near the counter. A queue of excited customers are waiting to get their book signed. A blond man with a blue suit and matching cloak appears. He smiles smugly. Posing for the camera. Lockhart spots Harry's grubby face in the crowd. The photographer pulls Harry forward. Ron pulls a face. They head for the door. A boy with very fair hair tears a page from a book."
  }
}