{
  "ground_truth": "She finds the right page. Hermione glares at him. Xenophilius stares out of a window. Animated shadow puppets act out the story. Xenophilius moves from the window and finds a piece of paper. He takes a pen and draws a vertical straight line. He looks up brushing back his long straggly hair. Next he draws a circle which contains the bottom half of the wand. Finally he draws a triangle surrounding the wand and the stone. Harry nods. Hermione looks anxious. He examines the teapot.",
  "iterations": {
    "1": "She finds the right page. Hermione glares at him. Xenophilius stares out of a window. Animated shadow puppets act out the story. Xenophilius moves from the window and finds a piece of paper. He takes a pen and draws a vertical straight line. He looks up brushing back his long straggly hair. Next he draws a circle which contains the bottom half of the wand. Finally he draws a triangle surrounding the wand and the stone. Harry nods. Hermione looks anxious. He examines the teapot.",
    "2": "He examines the teapot. She finds the right page. Hermione glares at him. Xenophilius stares out of a window. Animated shadow puppets act out the story. Xenophilius moves from the window and finds a piece of paper. He takes a pen and draws a vertical straight line. He looks up brushing back his long straggly hair. Next he draws a circle which contains the bottom half of the wand. Finally he draws a triangle surrounding the wand and the stone. Harry nods. Hermione looks anxious.",
    "3": "Hermione looks anxious. He examines the teapot. She finds the right page. Hermione glares at him. Xenophilius stares out of a window. Animated shadow puppets act out the story. Xenophilius moves from the window and finds a piece of paper. He takes a pen and draws a vertical straight line. He looks up brushing back his long straggly hair. Next he draws a circle which contains the bottom half of the wand. Finally he draws a triangle surrounding the wand and the stone. Harry nods.",
    "4": "Harry nods. Hermione looks anxious. He examines the teapot. She finds the right page. Hermione glares at him. Xenophilius stares out of a window. Animated shadow puppets act out the story. Xenophilius moves from the window and finds a piece of paper. He takes a pen and draws a vertical straight line. He looks up brushing back his long straggly hair. Next he draws a circle which contains the bottom half of the wand. Finally he draws a triangle surrounding the wand and the stone.",
    "5": "Finally he draws a triangle surrounding the wand and the stone. Harry nods. Hermione looks anxious. He examines the teapot. She finds the right page. Hermione glares at him. Xenophilius stares out of a window. Animated shadow puppets act out the story. Xenophilius moves from the window and finds a piece of paper. He takes a pen and draws a vertical straight line. He looks up brushing back his long straggly hair. Next he draws a circle which contains the bottom half of the wand.",
    "6": "Next he draws a circle which contains the bottom half of the wand. Finally he draws a triangle surrounding the wand and the stone. Harry nods. Hermione looks anxious. He examines the teapot. She finds the right page. Hermione glares at him. Xenophilius stares out of a window. Animated shadow puppets act out the story. Xenophilius moves from the window and finds a piece of paper. He takes a pen and draws a vertical straight line. He looks up brushing back his long straggly hair.",
    "7": "He looks up brushing back his long straggly hair. Next he draws a circle which contains the bottom half of the wand. Finally he draws a triangle surrounding the wand and the stone. Harry nods. Hermione looks anxious. He examines the teapot. She finds the right page. Hermione glares at him. Xenophilius stares out of a window. Animated shadow puppets act out the story. Xenophilius moves from the window and finds a piece of paper. He takes a pen and draws a vertical straight line.",
    "8": "He takes a pen and draws a vertical straight line. He looks up brushing back his long straggly hair. Next he draws a circle which contains the bottom half of the wand. Finally he draws a triangle surrounding the wand and the stone. Harry nods. Hermione looks anxious. He examines the teapot. She finds the right page. Hermione glares at him. Xenophilius stares out of a window. Animated shadow puppets act out the story. Xenophilius moves from the window and finds a piece of paper.",
    "9": "Xenophilius moves from the window and finds a piece of paper. He takes a pen and draws a vertical straight line. He looks up brushing back his long straggly hair. Next he draws a circle which contains the bottom half of the wand. Finally he draws a triangle surrounding the wand and the stone. Harry nods. Hermione looks anxious. He examines the teapot. She finds the right page. Hermione glares at him. Xenophilius stares out of a window. Animated shadow puppets act out the story.",
    "10": "Animated shadow puppets act out the story. Xenophilius moves from the window and finds a piece of paper. He takes a pen and draws a vertical straight line. He looks up brushing back his long straggly hair. Next he draws a circle which contains the bottom half of the wand. Finally he draws a triangle surrounding the wand and the stone. Harry nods. Hermione looks anxious. He examines the teapot. She finds the right page. Hermione glares at him. Xenophilius stares out of a window.",
    "11": "Xenophilius stares out of a window. Animated shadow puppets act out the story. Xenophilius moves from the window and finds a piece of paper. He takes a pen and draws a vertical straight line. He looks up brushing back his long straggly hair. Next he draws a circle which contains the bottom half of the wand. Finally he draws a triangle surrounding the wand and the stone. Harry nods. Hermione looks anxious. He examines the teapot. She finds the right page. Hermione glares at him.",
    "12": "Hermione glares at him. Xenophilius stares out of a window. Animated shadow puppets act out the story. Xenophilius moves from the window and finds a piece of paper. He takes a pen and draws a vertical straight line. He looks up brushing back his long straggly hair. Next he draws a circle which contains the bottom half of the wand. Finally he draws a triangle surrounding the wand and the stone. Harry nods. Hermione looks anxious. He examines the teapot. She finds the right page.",
    "13": "She finds the right page. Hermione glares at him. Xenophilius stares out of a window. Animated shadow puppets act out the story. Xenophilius moves from the window and finds a piece of paper. He takes a pen and draws a vertical straight line. He looks up brushing back his long straggly hair. Next he draws a circle which contains the bottom half of the wand. Finally he draws a triangle surrounding the wand and the stone. Harry nods. Hermione looks anxious. He examines the teapot."
  }
}