{
  "ground_truth": "The Minister's eyes flit from Harry to Ron then to Hermione. The wedding reception is in full swing. A soft light spills out of the marquis. A group of men keep guard outside as Lupin strolls past them. Harry stands in the covered walkway the Snitch hovering beside him which he grasps and puts in his jacket pocket before entering the marquis. Fleur and Bill are dancing together between two lines of guests with butterflies fluttering around them. Harry smiles as glasses magically fill with Champagne. Standing beside the table is tall darkhaired Madame Maxime and Hagrid looks up at her admiringly. A man with long white blonde hair dances theatrically with Luna Lovegood and Ron stares while Hermione appears looking delightful in a sleeveless red dress. Harry spots Elphias Doge and heads towards him. Luna's father wears a pendant with a triangle containing a circle with a vertical line through it. Harry sits with Elphias and an old woman scowls prompting Harry to look puzzled.",
  "iterations": {
    "1": "The Minister's eyes flit from Harry to Ron then to Hermione. The wedding reception is in full swing. A soft light spills out of the marquis. A group of men keep guard outside as Lupin strolls past them. Harry stands in the covered walkway the Snitch hovering beside him which he grasps and puts in his jacket pocket before entering the marquis. Fleur and Bill are dancing together between two lines of guests with butterflies fluttering around them. Harry smiles as glasses magically fill with Champagne. Standing beside the table is tall darkhaired Madame Maxime and Hagrid looks up at her admiringly. A man with long white blonde hair dances theatrically with Luna Lovegood and Ron stares while Hermione appears looking delightful in a sleeveless red dress. Harry spots Elphias Doge and heads towards him. Luna's father wears a pendant with a triangle containing a circle with a vertical line through it. Harry sits with Elphias and an old woman scowls prompting Harry to look puzzled.",
    "2": "Harry sits with Elphias and an old woman scowls prompting Harry to look puzzled. The Minister's eyes flit from Harry to Ron then to Hermione. The wedding reception is in full swing. A soft light spills out of the marquis. A group of men keep guard outside as Lupin strolls past them. Harry stands in the covered walkway the Snitch hovering beside him which he grasps and puts in his jacket pocket before entering the marquis. Fleur and Bill are dancing together between two lines of guests with butterflies fluttering around them. Harry smiles as glasses magically fill with Champagne. Standing beside the table is tall darkhaired Madame Maxime and Hagrid looks up at her admiringly. A man with long white blonde hair dances theatrically with Luna Lovegood and Ron stares while Hermione appears looking delightful in a sleeveless red dress. Harry spots Elphias Doge and heads towards him. Luna's father wears a pendant with a triangle containing a circle with a vertical line through it.",
    "3": "Luna's father wears a pendant with a triangle containing a circle with a vertical line through it. Harry sits with Elphias and an old woman scowls prompting Harry to look puzzled. The Minister's eyes flit from Harry to Ron then to Hermione. The wedding reception is in full swing. A soft light spills out of the marquis. A group of men keep guard outside as Lupin strolls past them. Harry stands in the covered walkway the Snitch hovering beside him which he grasps and puts in his jacket pocket before entering the marquis. Fleur and Bill are dancing together between two lines of guests with butterflies fluttering around them. Harry smiles as glasses magically fill with Champagne. Standing beside the table is tall darkhaired Madame Maxime and Hagrid looks up at her admiringly. A man with long white blonde hair dances theatrically with Luna Lovegood and Ron stares while Hermione appears looking delightful in a sleeveless red dress. Harry spots Elphias Doge and heads towards him.",
    "4": "Harry spots Elphias Doge and heads towards him. Luna's father wears a pendant with a triangle containing a circle with a vertical line through it. Harry sits with Elphias and an old woman scowls prompting Harry to look puzzled. The Minister's eyes flit from Harry to Ron then to Hermione. The wedding reception is in full swing. A soft light spills out of the marquis. A group of men keep guard outside as Lupin strolls past them. Harry stands in the covered walkway the Snitch hovering beside him which he grasps and puts in his jacket pocket before entering the marquis. Fleur and Bill are dancing together between two lines of guests with butterflies fluttering around them. Harry smiles as glasses magically fill with Champagne. Standing beside the table is tall darkhaired Madame Maxime and Hagrid looks up at her admiringly. A man with long white blonde hair dances theatrically with Luna Lovegood and Ron stares while Hermione appears looking delightful in a sleeveless red dress.",
    "5": "A man with long white blonde hair dances theatrically with Luna Lovegood and Ron stares while Hermione appears looking delightful in a sleeveless red dress. Harry spots Elphias Doge and heads towards him. Luna's father wears a pendant with a triangle containing a circle with a vertical line through it. Harry sits with Elphias and an old woman scowls prompting Harry to look puzzled. The Minister's eyes flit from Harry to Ron then to Hermione. The wedding reception is in full swing. A soft light spills out of the marquis. A group of men keep guard outside as Lupin strolls past them. Harry stands in the covered walkway the Snitch hovering beside him which he grasps and puts in his jacket pocket before entering the marquis. Fleur and Bill are dancing together between two lines of guests with butterflies fluttering around them. Harry smiles as glasses magically fill with Champagne. Standing beside the table is tall darkhaired Madame Maxime and Hagrid looks up at her admiringly.",
    "6": "Standing beside the table is tall darkhaired Madame Maxime and Hagrid looks up at her admiringly. A man with long white blonde hair dances theatrically with Luna Lovegood and Ron stares while Hermione appears looking delightful in a sleeveless red dress. Harry spots Elphias Doge and heads towards him. Luna's father wears a pendant with a triangle containing a circle with a vertical line through it. Harry sits with Elphias and an old woman scowls prompting Harry to look puzzled. The Minister's eyes flit from Harry to Ron then to Hermione. The wedding reception is in full swing. A soft light spills out of the marquis. A group of men keep guard outside as Lupin strolls past them. Harry stands in the covered walkway the Snitch hovering beside him which he grasps and puts in his jacket pocket before entering the marquis. Fleur and Bill are dancing together between two lines of guests with butterflies fluttering around them. Harry smiles as glasses magically fill with Champagne.",
    "7": "Harry smiles as glasses magically fill with Champagne. Standing beside the table is tall darkhaired Madame Maxime and Hagrid looks up at her admiringly. A man with long white blonde hair dances theatrically with Luna Lovegood and Ron stares while Hermione appears looking delightful in a sleeveless red dress. Harry spots Elphias Doge and heads towards him. Luna's father wears a pendant with a triangle containing a circle with a vertical line through it. Harry sits with Elphias and an old woman scowls prompting Harry to look puzzled. The Minister's eyes flit from Harry to Ron then to Hermione. The wedding reception is in full swing. A soft light spills out of the marquis. A group of men keep guard outside as Lupin strolls past them. Harry stands in the covered walkway the Snitch hovering beside him which he grasps and puts in his jacket pocket before entering the marquis. Fleur and Bill are dancing together between two lines of guests with butterflies fluttering around them.",
    "8": "Fleur and Bill are dancing together between two lines of guests with butterflies fluttering around them. Harry smiles as glasses magically fill with Champagne. Standing beside the table is tall darkhaired Madame Maxime and Hagrid looks up at her admiringly. A man with long white blonde hair dances theatrically with Luna Lovegood and Ron stares while Hermione appears looking delightful in a sleeveless red dress. Harry spots Elphias Doge and heads towards him. Luna's father wears a pendant with a triangle containing a circle with a vertical line through it. Harry sits with Elphias and an old woman scowls prompting Harry to look puzzled. The Minister's eyes flit from Harry to Ron then to Hermione. The wedding reception is in full swing. A soft light spills out of the marquis. A group of men keep guard outside as Lupin strolls past them. Harry stands in the covered walkway the Snitch hovering beside him which he grasps and puts in his jacket pocket before entering the marquis.",
    "9": "Harry stands in the covered walkway the Snitch hovering beside him which he grasps and puts in his jacket pocket before entering the marquis. Fleur and Bill are dancing together between two lines of guests with butterflies fluttering around them. Harry smiles as glasses magically fill with Champagne. Standing beside the table is tall darkhaired Madame Maxime and Hagrid looks up at her admiringly. A man with long white blonde hair dances theatrically with Luna Lovegood and Ron stares while Hermione appears looking delightful in a sleeveless red dress. Harry spots Elphias Doge and heads towards him. Luna's father wears a pendant with a triangle containing a circle with a vertical line through it. Harry sits with Elphias and an old woman scowls prompting Harry to look puzzled. The Minister's eyes flit from Harry to Ron then to Hermione. The wedding reception is in full swing. A soft light spills out of the marquis. A group of men keep guard outside as Lupin strolls past them.",
    "10": "A group of men keep guard outside as Lupin strolls past them. Harry stands in the covered walkway the Snitch hovering beside him which he grasps and puts in his jacket pocket before entering the marquis. Fleur and Bill are dancing together between two lines of guests with butterflies fluttering around them. Harry smiles as glasses magically fill with Champagne. Standing beside the table is tall darkhaired Madame Maxime and Hagrid looks up at her admiringly. A man with long white blonde hair dances theatrically with Luna Lovegood and Ron stares while Hermione appears looking delightful in a sleeveless red dress. Harry spots Elphias Doge and heads towards him. Luna's father wears a pendant with a triangle containing a circle with a vertical line through it. Harry sits with Elphias and an old woman scowls prompting Harry to look puzzled. The Minister's eyes flit from Harry to Ron then to Hermione. The wedding reception is in full swing. A soft light spills out of the marquis.",
    "11": "A soft light spills out of the marquis. A group of men keep guard outside as Lupin strolls past them. Harry stands in the covered walkway the Snitch hovering beside him which he grasps and puts in his jacket pocket before entering the marquis. Fleur and Bill are dancing together between two lines of guests with butterflies fluttering around them. Harry smiles as glasses magically fill with Champagne. Standing beside the table is tall darkhaired Madame Maxime and Hagrid looks up at her admiringly. A man with long white blonde hair dances theatrically with Luna Lovegood and Ron stares while Hermione appears looking delightful in a sleeveless red dress. Harry spots Elphias Doge and heads towards him. Luna's father wears a pendant with a triangle containing a circle with a vertical line through it. Harry sits with Elphias and an old woman scowls prompting Harry to look puzzled. The Minister's eyes flit from Harry to Ron then to Hermione. The wedding reception is in full swing.",
    "12": "The wedding reception is in full swing. A soft light spills out of the marquis. A group of men keep guard outside as Lupin strolls past them. Harry stands in the covered walkway the Snitch hovering beside him which he grasps and puts in his jacket pocket before entering the marquis. Fleur and Bill are dancing together between two lines of guests with butterflies fluttering around them. Harry smiles as glasses magically fill with Champagne. Standing beside the table is tall darkhaired Madame Maxime and Hagrid looks up at her admiringly. A man with long white blonde hair dances theatrically with Luna Lovegood and Ron stares while Hermione appears looking delightful in a sleeveless red dress. Harry spots Elphias Doge and heads towards him. Luna's father wears a pendant with a triangle containing a circle with a vertical line through it. Harry sits with Elphias and an old woman scowls prompting Harry to look puzzled. The Minister's eyes flit from Harry to Ron then to Hermione.",
    "13": "The Minister's eyes flit from Harry to Ron then to Hermione. The wedding reception is in full swing. A soft light spills out of the marquis. A group of men keep guard outside as Lupin strolls past them. Harry stands in the covered walkway the Snitch hovering beside him which he grasps and puts in his jacket pocket before entering the marquis. Fleur and Bill are dancing together between two lines of guests with butterflies fluttering around them. Harry smiles as glasses magically fill with Champagne. Standing beside the table is tall darkhaired Madame Maxime and Hagrid looks up at her admiringly. A man with long white blonde hair dances theatrically with Luna Lovegood and Ron stares while Hermione appears looking delightful in a sleeveless red dress. Harry spots Elphias Doge and heads towards him. Luna's father wears a pendant with a triangle containing a circle with a vertical line through it. Harry sits with Elphias and an old woman scowls prompting Harry to look puzzled."
  }
}