{
  "ground_truth": "Harry dives into a fireplace and is whisked up followed by Hermione and Ron with Yaxley close on their heels. Yaxley grabs them on their journey upwards causing their faces to contort but he loses his grip. Sunlight filters down through a leafy canopy and still in Albert's clothes. Harry wakes lying on a carpet of dead leaves in a forest. Glancing to his right he sees the locket and after slipping off Albert's coat he scrambles over to the locket and picks it up. Hermione is on her knees by a shivering Ron. while Harry searches desperately in the bag points his wand and a bottle pops into his hand. She treats the gaping wound on Ron's left shoulder with a few drops of the essence sealing the wound as her bloodied hands reveal her relief. Hermione gets to her feet and walks away and Harry takes her place at Ron's side. Hermione braces herself and lifts her wand as Harry looks at her bag. A dim light glimmers inside a small tent when Harry aims his wand at the locket and smoke rises from it. All three walk towards it.",
  "iterations": {
    "1": "Harry dives into a fireplace and is whisked up followed by Hermione and Ron with Yaxley close on their heels. Yaxley grabs them on their journey upwards causing their faces to contort but he loses his grip. Sunlight filters down through a leafy canopy and still in Albert's clothes. Harry wakes lying on a carpet of dead leaves in a forest. Glancing to his right he sees the locket and after slipping off Albert's coat he scrambles over to the locket and picks it up. Hermione is on her knees by a shivering Ron. while Harry searches desperately in the bag points his wand and a bottle pops into his hand. She treats the gaping wound on Ron's left shoulder with a few drops of the essence sealing the wound as her bloodied hands reveal her relief. Hermione gets to her feet and walks away and Harry takes her place at Ron's side. Hermione braces herself and lifts her wand as Harry looks at her bag. A dim light glimmers inside a small tent when Harry aims his wand at the locket and smoke rises from it. All three walk towards it.",
    "2": "All three walk towards it. Harry dives into a fireplace and is whisked up followed by Hermione and Ron with Yaxley close on their heels. Yaxley grabs them on their journey upwards causing their faces to contort but he loses his grip. Sunlight filters down through a leafy canopy and still in Albert's clothes. Harry wakes lying on a carpet of dead leaves in a forest. Glancing to his right he sees the locket and after slipping off Albert's coat he scrambles over to the locket and picks it up. Hermione is on her knees by a shivering Ron. while Harry searches desperately in the bag points his wand and a bottle pops into his hand. She treats the gaping wound on Ron's left shoulder with a few drops of the essence sealing the wound as her bloodied hands reveal her relief. Hermione gets to her feet and walks away and Harry takes her place at Ron's side. Hermione braces herself and lifts her wand as Harry looks at her bag. A dim light glimmers inside a small tent when Harry aims his wand at the locket and smoke rises from it.",
    "3": "A dim light glimmers inside a small tent when Harry aims his wand at the locket and smoke rises from it. All three walk towards it. Harry dives into a fireplace and is whisked up followed by Hermione and Ron with Yaxley close on their heels. Yaxley grabs them on their journey upwards causing their faces to contort but he loses his grip. Sunlight filters down through a leafy canopy and still in Albert's clothes. Harry wakes lying on a carpet of dead leaves in a forest. Glancing to his right he sees the locket and after slipping off Albert's coat he scrambles over to the locket and picks it up. Hermione is on her knees by a shivering Ron. while Harry searches desperately in the bag points his wand and a bottle pops into his hand. She treats the gaping wound on Ron's left shoulder with a few drops of the essence sealing the wound as her bloodied hands reveal her relief. Hermione gets to her feet and walks away and Harry takes her place at Ron's side. Hermione braces herself and lifts her wand as Harry looks at her bag.",
    "4": "Hermione braces herself and lifts her wand as Harry looks at her bag. A dim light glimmers inside a small tent when Harry aims his wand at the locket and smoke rises from it. All three walk towards it. Harry dives into a fireplace and is whisked up followed by Hermione and Ron with Yaxley close on their heels. Yaxley grabs them on their journey upwards causing their faces to contort but he loses his grip. Sunlight filters down through a leafy canopy and still in Albert's clothes. Harry wakes lying on a carpet of dead leaves in a forest. Glancing to his right he sees the locket and after slipping off Albert's coat he scrambles over to the locket and picks it up. Hermione is on her knees by a shivering Ron. while Harry searches desperately in the bag points his wand and a bottle pops into his hand. She treats the gaping wound on Ron's left shoulder with a few drops of the essence sealing the wound as her bloodied hands reveal her relief. Hermione gets to her feet and walks away and Harry takes her place at Ron's side.",
    "5": "Hermione gets to her feet and walks away and Harry takes her place at Ron's side. Hermione braces herself and lifts her wand as Harry looks at her bag. A dim light glimmers inside a small tent when Harry aims his wand at the locket and smoke rises from it. All three walk towards it. Harry dives into a fireplace and is whisked up followed by Hermione and Ron with Yaxley close on their heels. Yaxley grabs them on their journey upwards causing their faces to contort but he loses his grip. Sunlight filters down through a leafy canopy and still in Albert's clothes. Harry wakes lying on a carpet of dead leaves in a forest. Glancing to his right he sees the locket and after slipping off Albert's coat he scrambles over to the locket and picks it up. Hermione is on her knees by a shivering Ron. while Harry searches desperately in the bag points his wand and a bottle pops into his hand. She treats the gaping wound on Ron's left shoulder with a few drops of the essence sealing the wound as her bloodied hands reveal her relief.",
    "6": "She treats the gaping wound on Ron's left shoulder with a few drops of the essence sealing the wound as her bloodied hands reveal her relief. Hermione gets to her feet and walks away and Harry takes her place at Ron's side. Hermione braces herself and lifts her wand as Harry looks at her bag. A dim light glimmers inside a small tent when Harry aims his wand at the locket and smoke rises from it. All three walk towards it. Harry dives into a fireplace and is whisked up followed by Hermione and Ron with Yaxley close on their heels. Yaxley grabs them on their journey upwards causing their faces to contort but he loses his grip. Sunlight filters down through a leafy canopy and still in Albert's clothes. Harry wakes lying on a carpet of dead leaves in a forest. Glancing to his right he sees the locket and after slipping off Albert's coat he scrambles over to the locket and picks it up. Hermione is on her knees by a shivering Ron. while Harry searches desperately in the bag points his wand and a bottle pops into his hand.",
    "7": "while Harry searches desperately in the bag points his wand and a bottle pops into his hand. She treats the gaping wound on Ron's left shoulder with a few drops of the essence sealing the wound as her bloodied hands reveal her relief. Hermione gets to her feet and walks away and Harry takes her place at Ron's side. Hermione braces herself and lifts her wand as Harry looks at her bag. A dim light glimmers inside a small tent when Harry aims his wand at the locket and smoke rises from it. All three walk towards it. Harry dives into a fireplace and is whisked up followed by Hermione and Ron with Yaxley close on their heels. Yaxley grabs them on their journey upwards causing their faces to contort but he loses his grip. Sunlight filters down through a leafy canopy and still in Albert's clothes. Harry wakes lying on a carpet of dead leaves in a forest. Glancing to his right he sees the locket and after slipping off Albert's coat he scrambles over to the locket and picks it up. Hermione is on her knees by a shivering Ron.",
    "8": "Hermione is on her knees by a shivering Ron. while Harry searches desperately in the bag points his wand and a bottle pops into his hand. She treats the gaping wound on Ron's left shoulder with a few drops of the essence sealing the wound as her bloodied hands reveal her relief. Hermione gets to her feet and walks away and Harry takes her place at Ron's side. Hermione braces herself and lifts her wand as Harry looks at her bag. A dim light glimmers inside a small tent when Harry aims his wand at the locket and smoke rises from it. All three walk towards it. Harry dives into a fireplace and is whisked up followed by Hermione and Ron with Yaxley close on their heels. Yaxley grabs them on their journey upwards causing their faces to contort but he loses his grip. Sunlight filters down through a leafy canopy and still in Albert's clothes. Harry wakes lying on a carpet of dead leaves in a forest. Glancing to his right he sees the locket and after slipping off Albert's coat he scrambles over to the locket and picks it up.",
    "9": "Glancing to his right he sees the locket and after slipping off Albert's coat he scrambles over to the locket and picks it up. Hermione is on her knees by a shivering Ron. while Harry searches desperately in the bag points his wand and a bottle pops into his hand. She treats the gaping wound on Ron's left shoulder with a few drops of the essence sealing the wound as her bloodied hands reveal her relief. Hermione gets to her feet and walks away and Harry takes her place at Ron's side. Hermione braces herself and lifts her wand as Harry looks at her bag. A dim light glimmers inside a small tent when Harry aims his wand at the locket and smoke rises from it. All three walk towards it. Harry dives into a fireplace and is whisked up followed by Hermione and Ron with Yaxley close on their heels. Yaxley grabs them on their journey upwards causing their faces to contort but he loses his grip. Sunlight filters down through a leafy canopy and still in Albert's clothes. Harry wakes lying on a carpet of dead leaves in a forest.",
    "10": "Harry wakes lying on a carpet of dead leaves in a forest. Glancing to his right he sees the locket and after slipping off Albert's coat he scrambles over to the locket and picks it up. Hermione is on her knees by a shivering Ron. while Harry searches desperately in the bag points his wand and a bottle pops into his hand. She treats the gaping wound on Ron's left shoulder with a few drops of the essence sealing the wound as her bloodied hands reveal her relief. Hermione gets to her feet and walks away and Harry takes her place at Ron's side. Hermione braces herself and lifts her wand as Harry looks at her bag. A dim light glimmers inside a small tent when Harry aims his wand at the locket and smoke rises from it. All three walk towards it. Harry dives into a fireplace and is whisked up followed by Hermione and Ron with Yaxley close on their heels. Yaxley grabs them on their journey upwards causing their faces to contort but he loses his grip. Sunlight filters down through a leafy canopy and still in Albert's clothes.",
    "11": "Sunlight filters down through a leafy canopy and still in Albert's clothes. Harry wakes lying on a carpet of dead leaves in a forest. Glancing to his right he sees the locket and after slipping off Albert's coat he scrambles over to the locket and picks it up. Hermione is on her knees by a shivering Ron. while Harry searches desperately in the bag points his wand and a bottle pops into his hand. She treats the gaping wound on Ron's left shoulder with a few drops of the essence sealing the wound as her bloodied hands reveal her relief. Hermione gets to her feet and walks away and Harry takes her place at Ron's side. Hermione braces herself and lifts her wand as Harry looks at her bag. A dim light glimmers inside a small tent when Harry aims his wand at the locket and smoke rises from it. All three walk towards it. Harry dives into a fireplace and is whisked up followed by Hermione and Ron with Yaxley close on their heels. Yaxley grabs them on their journey upwards causing their faces to contort but he loses his grip.",
    "12": "Yaxley grabs them on their journey upwards causing their faces to contort but he loses his grip. Sunlight filters down through a leafy canopy and still in Albert's clothes. Harry wakes lying on a carpet of dead leaves in a forest. Glancing to his right he sees the locket and after slipping off Albert's coat he scrambles over to the locket and picks it up. Hermione is on her knees by a shivering Ron. while Harry searches desperately in the bag points his wand and a bottle pops into his hand. She treats the gaping wound on Ron's left shoulder with a few drops of the essence sealing the wound as her bloodied hands reveal her relief. Hermione gets to her feet and walks away and Harry takes her place at Ron's side. Hermione braces herself and lifts her wand as Harry looks at her bag. A dim light glimmers inside a small tent when Harry aims his wand at the locket and smoke rises from it. All three walk towards it. Harry dives into a fireplace and is whisked up followed by Hermione and Ron with Yaxley close on their heels.",
    "13": "Harry dives into a fireplace and is whisked up followed by Hermione and Ron with Yaxley close on their heels. Yaxley grabs them on their journey upwards causing their faces to contort but he loses his grip. Sunlight filters down through a leafy canopy and still in Albert's clothes. Harry wakes lying on a carpet of dead leaves in a forest. Glancing to his right he sees the locket and after slipping off Albert's coat he scrambles over to the locket and picks it up. Hermione is on her knees by a shivering Ron. while Harry searches desperately in the bag points his wand and a bottle pops into his hand. She treats the gaping wound on Ron's left shoulder with a few drops of the essence sealing the wound as her bloodied hands reveal her relief. Hermione gets to her feet and walks away and Harry takes her place at Ron's side. Hermione braces herself and lifts her wand as Harry looks at her bag. A dim light glimmers inside a small tent when Harry aims his wand at the locket and smoke rises from it. All three walk towards it."
  }
}