{
  "ground_truth": "The sun breaks through the threatening storm clouds illuminating words in spiky metal letters as the sun blazes down and a heat haze hangs over suburban London. Cars speed along a dual carriageway beside a field where the grass is scorched and dry. In a corner of the field is a neglected playground. A teenage boy Harry Potter walks across the field. In the playground a boy gets off the roundabout and everyone leaves. Harry sits on a swing lost in thought. He sees his cousin Dudley with his gang and Harry pulls out his wand holding it to Dudley's throat. The sky grows dark and heavy storm clouds roll overhead blocking out the sun as a strong wind rises causing the gang to run off. Dudley and Harry look up as the sky grows even darker while the powerful wind blows flurries of waste paper across the playground prompting them to run for shelter. as the storm breaks and heavy rain begins to fall. Harry leads the way along a rutted cart track with Dudley who is overweight and finds it hard to keep up. Soaked to the skin they find shelter in a long tunnel under the road and stop to catch their breath.",
  "iterations": {
    "1": "The sun breaks through the threatening storm clouds illuminating words in spiky metal letters as the sun blazes down and a heat haze hangs over suburban London. Cars speed along a dual carriageway beside a field where the grass is scorched and dry. In a corner of the field is a neglected playground. A teenage boy Harry Potter walks across the field. In the playground a boy gets off the roundabout and everyone leaves. Harry sits on a swing lost in thought. He sees his cousin Dudley with his gang and Harry pulls out his wand holding it to Dudley's throat. The sky grows dark and heavy storm clouds roll overhead blocking out the sun as a strong wind rises causing the gang to run off. Dudley and Harry look up as the sky grows even darker while the powerful wind blows flurries of waste paper across the playground prompting them to run for shelter. as the storm breaks and heavy rain begins to fall. Harry leads the way along a rutted cart track with Dudley who is overweight and finds it hard to keep up. Soaked to the skin they find shelter in a long tunnel under the road and stop to catch their breath.",
    "2": "Soaked to the skin they find shelter in a long tunnel under the road and stop to catch their breath. The sun breaks through the threatening storm clouds illuminating words in spiky metal letters as the sun blazes down and a heat haze hangs over suburban London. Cars speed along a dual carriageway beside a field where the grass is scorched and dry. In a corner of the field is a neglected playground. A teenage boy Harry Potter walks across the field. In the playground a boy gets off the roundabout and everyone leaves. Harry sits on a swing lost in thought. He sees his cousin Dudley with his gang and Harry pulls out his wand holding it to Dudley's throat. The sky grows dark and heavy storm clouds roll overhead blocking out the sun as a strong wind rises causing the gang to run off. Dudley and Harry look up as the sky grows even darker while the powerful wind blows flurries of waste paper across the playground prompting them to run for shelter. as the storm breaks and heavy rain begins to fall. Harry leads the way along a rutted cart track with Dudley who is overweight and finds it hard to keep up.",
    "3": "Harry leads the way along a rutted cart track with Dudley who is overweight and finds it hard to keep up. Soaked to the skin they find shelter in a long tunnel under the road and stop to catch their breath. The sun breaks through the threatening storm clouds illuminating words in spiky metal letters as the sun blazes down and a heat haze hangs over suburban London. Cars speed along a dual carriageway beside a field where the grass is scorched and dry. In a corner of the field is a neglected playground. A teenage boy Harry Potter walks across the field. In the playground a boy gets off the roundabout and everyone leaves. Harry sits on a swing lost in thought. He sees his cousin Dudley with his gang and Harry pulls out his wand holding it to Dudley's throat. The sky grows dark and heavy storm clouds roll overhead blocking out the sun as a strong wind rises causing the gang to run off. Dudley and Harry look up as the sky grows even darker while the powerful wind blows flurries of waste paper across the playground prompting them to run for shelter. as the storm breaks and heavy rain begins to fall.",
    "4": "as the storm breaks and heavy rain begins to fall. Harry leads the way along a rutted cart track with Dudley who is overweight and finds it hard to keep up. Soaked to the skin they find shelter in a long tunnel under the road and stop to catch their breath. The sun breaks through the threatening storm clouds illuminating words in spiky metal letters as the sun blazes down and a heat haze hangs over suburban London. Cars speed along a dual carriageway beside a field where the grass is scorched and dry. In a corner of the field is a neglected playground. A teenage boy Harry Potter walks across the field. In the playground a boy gets off the roundabout and everyone leaves. Harry sits on a swing lost in thought. He sees his cousin Dudley with his gang and Harry pulls out his wand holding it to Dudley's throat. The sky grows dark and heavy storm clouds roll overhead blocking out the sun as a strong wind rises causing the gang to run off. Dudley and Harry look up as the sky grows even darker while the powerful wind blows flurries of waste paper across the playground prompting them to run for shelter.",
    "5": "Dudley and Harry look up as the sky grows even darker while the powerful wind blows flurries of waste paper across the playground prompting them to run for shelter. as the storm breaks and heavy rain begins to fall. Harry leads the way along a rutted cart track with Dudley who is overweight and finds it hard to keep up. Soaked to the skin they find shelter in a long tunnel under the road and stop to catch their breath. The sun breaks through the threatening storm clouds illuminating words in spiky metal letters as the sun blazes down and a heat haze hangs over suburban London. Cars speed along a dual carriageway beside a field where the grass is scorched and dry. In a corner of the field is a neglected playground. A teenage boy Harry Potter walks across the field. In the playground a boy gets off the roundabout and everyone leaves. Harry sits on a swing lost in thought. He sees his cousin Dudley with his gang and Harry pulls out his wand holding it to Dudley's throat. The sky grows dark and heavy storm clouds roll overhead blocking out the sun as a strong wind rises causing the gang to run off.",
    "6": "The sky grows dark and heavy storm clouds roll overhead blocking out the sun as a strong wind rises causing the gang to run off. Dudley and Harry look up as the sky grows even darker while the powerful wind blows flurries of waste paper across the playground prompting them to run for shelter. as the storm breaks and heavy rain begins to fall. Harry leads the way along a rutted cart track with Dudley who is overweight and finds it hard to keep up. Soaked to the skin they find shelter in a long tunnel under the road and stop to catch their breath. The sun breaks through the threatening storm clouds illuminating words in spiky metal letters as the sun blazes down and a heat haze hangs over suburban London. Cars speed along a dual carriageway beside a field where the grass is scorched and dry. In a corner of the field is a neglected playground. A teenage boy Harry Potter walks across the field. In the playground a boy gets off the roundabout and everyone leaves. Harry sits on a swing lost in thought. He sees his cousin Dudley with his gang and Harry pulls out his wand holding it to Dudley's throat.",
    "7": "He sees his cousin Dudley with his gang and Harry pulls out his wand holding it to Dudley's throat. The sky grows dark and heavy storm clouds roll overhead blocking out the sun as a strong wind rises causing the gang to run off. Dudley and Harry look up as the sky grows even darker while the powerful wind blows flurries of waste paper across the playground prompting them to run for shelter. as the storm breaks and heavy rain begins to fall. Harry leads the way along a rutted cart track with Dudley who is overweight and finds it hard to keep up. Soaked to the skin they find shelter in a long tunnel under the road and stop to catch their breath. The sun breaks through the threatening storm clouds illuminating words in spiky metal letters as the sun blazes down and a heat haze hangs over suburban London. Cars speed along a dual carriageway beside a field where the grass is scorched and dry. In a corner of the field is a neglected playground. A teenage boy Harry Potter walks across the field. In the playground a boy gets off the roundabout and everyone leaves. Harry sits on a swing lost in thought.",
    "8": "Harry sits on a swing lost in thought. He sees his cousin Dudley with his gang and Harry pulls out his wand holding it to Dudley's throat. The sky grows dark and heavy storm clouds roll overhead blocking out the sun as a strong wind rises causing the gang to run off. Dudley and Harry look up as the sky grows even darker while the powerful wind blows flurries of waste paper across the playground prompting them to run for shelter. as the storm breaks and heavy rain begins to fall. Harry leads the way along a rutted cart track with Dudley who is overweight and finds it hard to keep up. Soaked to the skin they find shelter in a long tunnel under the road and stop to catch their breath. The sun breaks through the threatening storm clouds illuminating words in spiky metal letters as the sun blazes down and a heat haze hangs over suburban London. Cars speed along a dual carriageway beside a field where the grass is scorched and dry. In a corner of the field is a neglected playground. A teenage boy Harry Potter walks across the field. In the playground a boy gets off the roundabout and everyone leaves.",
    "9": "In the playground a boy gets off the roundabout and everyone leaves. Harry sits on a swing lost in thought. He sees his cousin Dudley with his gang and Harry pulls out his wand holding it to Dudley's throat. The sky grows dark and heavy storm clouds roll overhead blocking out the sun as a strong wind rises causing the gang to run off. Dudley and Harry look up as the sky grows even darker while the powerful wind blows flurries of waste paper across the playground prompting them to run for shelter. as the storm breaks and heavy rain begins to fall. Harry leads the way along a rutted cart track with Dudley who is overweight and finds it hard to keep up. Soaked to the skin they find shelter in a long tunnel under the road and stop to catch their breath. The sun breaks through the threatening storm clouds illuminating words in spiky metal letters as the sun blazes down and a heat haze hangs over suburban London. Cars speed along a dual carriageway beside a field where the grass is scorched and dry. In a corner of the field is a neglected playground. A teenage boy Harry Potter walks across the field.",
    "10": "A teenage boy Harry Potter walks across the field. In the playground a boy gets off the roundabout and everyone leaves. Harry sits on a swing lost in thought. He sees his cousin Dudley with his gang and Harry pulls out his wand holding it to Dudley's throat. The sky grows dark and heavy storm clouds roll overhead blocking out the sun as a strong wind rises causing the gang to run off. Dudley and Harry look up as the sky grows even darker while the powerful wind blows flurries of waste paper across the playground prompting them to run for shelter. as the storm breaks and heavy rain begins to fall. Harry leads the way along a rutted cart track with Dudley who is overweight and finds it hard to keep up. Soaked to the skin they find shelter in a long tunnel under the road and stop to catch their breath. The sun breaks through the threatening storm clouds illuminating words in spiky metal letters as the sun blazes down and a heat haze hangs over suburban London. Cars speed along a dual carriageway beside a field where the grass is scorched and dry. In a corner of the field is a neglected playground.",
    "11": "In a corner of the field is a neglected playground. A teenage boy Harry Potter walks across the field. In the playground a boy gets off the roundabout and everyone leaves. Harry sits on a swing lost in thought. He sees his cousin Dudley with his gang and Harry pulls out his wand holding it to Dudley's throat. The sky grows dark and heavy storm clouds roll overhead blocking out the sun as a strong wind rises causing the gang to run off. Dudley and Harry look up as the sky grows even darker while the powerful wind blows flurries of waste paper across the playground prompting them to run for shelter. as the storm breaks and heavy rain begins to fall. Harry leads the way along a rutted cart track with Dudley who is overweight and finds it hard to keep up. Soaked to the skin they find shelter in a long tunnel under the road and stop to catch their breath. The sun breaks through the threatening storm clouds illuminating words in spiky metal letters as the sun blazes down and a heat haze hangs over suburban London. Cars speed along a dual carriageway beside a field where the grass is scorched and dry.",
    "12": "Cars speed along a dual carriageway beside a field where the grass is scorched and dry. In a corner of the field is a neglected playground. A teenage boy Harry Potter walks across the field. In the playground a boy gets off the roundabout and everyone leaves. Harry sits on a swing lost in thought. He sees his cousin Dudley with his gang and Harry pulls out his wand holding it to Dudley's throat. The sky grows dark and heavy storm clouds roll overhead blocking out the sun as a strong wind rises causing the gang to run off. Dudley and Harry look up as the sky grows even darker while the powerful wind blows flurries of waste paper across the playground prompting them to run for shelter. as the storm breaks and heavy rain begins to fall. Harry leads the way along a rutted cart track with Dudley who is overweight and finds it hard to keep up. Soaked to the skin they find shelter in a long tunnel under the road and stop to catch their breath. The sun breaks through the threatening storm clouds illuminating words in spiky metal letters as the sun blazes down and a heat haze hangs over suburban London.",
    "13": "The sun breaks through the threatening storm clouds illuminating words in spiky metal letters as the sun blazes down and a heat haze hangs over suburban London. Cars speed along a dual carriageway beside a field where the grass is scorched and dry. In a corner of the field is a neglected playground. A teenage boy Harry Potter walks across the field. In the playground a boy gets off the roundabout and everyone leaves. Harry sits on a swing lost in thought. He sees his cousin Dudley with his gang and Harry pulls out his wand holding it to Dudley's throat. The sky grows dark and heavy storm clouds roll overhead blocking out the sun as a strong wind rises causing the gang to run off. Dudley and Harry look up as the sky grows even darker while the powerful wind blows flurries of waste paper across the playground prompting them to run for shelter. as the storm breaks and heavy rain begins to fall. Harry leads the way along a rutted cart track with Dudley who is overweight and finds it hard to keep up. Soaked to the skin they find shelter in a long tunnel under the road and stop to catch their breath."
  }
}