{
  "ground_truth": "They rush up to her desk and slowly turn and leave. Outside in the corridor. he stares hard at Harry as Snape stalks away along the corridor his black cloak billowing behind him. The school is silhouetted against moonlit clouds. Harry Ron and Hermione creep downstairs into the common room where they spot Neville's toad. Neville gets up from a chair freezes and falls over backwards. Leaving Neville they all huddle under the invisibility cloak as Hermione unlocks the door on the third floor. A harp is playing by itself and they take off the cloak to see the threeheaded dog is asleep. They take hold of it and between them they push the dog's huge paw off the trapdoor. The dog breathes out and they stagger back lifting the wooden cover to stare down into the black hole beneath. Dog dribble hits Ron as the dog opens its three mouths. They throw themselves into the hole as the dog destroys the trapdoor.",
  "iterations": {
    "1": "They rush up to her desk and slowly turn and leave. Outside in the corridor. he stares hard at Harry as Snape stalks away along the corridor his black cloak billowing behind him. The school is silhouetted against moonlit clouds. Harry Ron and Hermione creep downstairs into the common room where they spot Neville's toad. Neville gets up from a chair freezes and falls over backwards. Leaving Neville they all huddle under the invisibility cloak as Hermione unlocks the door on the third floor. A harp is playing by itself and they take off the cloak to see the threeheaded dog is asleep. They take hold of it and between them they push the dog's huge paw off the trapdoor. The dog breathes out and they stagger back lifting the wooden cover to stare down into the black hole beneath. Dog dribble hits Ron as the dog opens its three mouths. They throw themselves into the hole as the dog destroys the trapdoor.",
    "2": "They throw themselves into the hole as the dog destroys the trapdoor. They rush up to her desk and slowly turn and leave. Outside in the corridor. he stares hard at Harry as Snape stalks away along the corridor his black cloak billowing behind him. The school is silhouetted against moonlit clouds. Harry Ron and Hermione creep downstairs into the common room where they spot Neville's toad. Neville gets up from a chair freezes and falls over backwards. Leaving Neville they all huddle under the invisibility cloak as Hermione unlocks the door on the third floor. A harp is playing by itself and they take off the cloak to see the threeheaded dog is asleep. They take hold of it and between them they push the dog's huge paw off the trapdoor. The dog breathes out and they stagger back lifting the wooden cover to stare down into the black hole beneath. Dog dribble hits Ron as the dog opens its three mouths.",
    "3": "Dog dribble hits Ron as the dog opens its three mouths. They throw themselves into the hole as the dog destroys the trapdoor. They rush up to her desk and slowly turn and leave. Outside in the corridor. he stares hard at Harry as Snape stalks away along the corridor his black cloak billowing behind him. The school is silhouetted against moonlit clouds. Harry Ron and Hermione creep downstairs into the common room where they spot Neville's toad. Neville gets up from a chair freezes and falls over backwards. Leaving Neville they all huddle under the invisibility cloak as Hermione unlocks the door on the third floor. A harp is playing by itself and they take off the cloak to see the threeheaded dog is asleep. They take hold of it and between them they push the dog's huge paw off the trapdoor. The dog breathes out and they stagger back lifting the wooden cover to stare down into the black hole beneath.",
    "4": "The dog breathes out and they stagger back lifting the wooden cover to stare down into the black hole beneath. Dog dribble hits Ron as the dog opens its three mouths. They throw themselves into the hole as the dog destroys the trapdoor. They rush up to her desk and slowly turn and leave. Outside in the corridor. he stares hard at Harry as Snape stalks away along the corridor his black cloak billowing behind him. The school is silhouetted against moonlit clouds. Harry Ron and Hermione creep downstairs into the common room where they spot Neville's toad. Neville gets up from a chair freezes and falls over backwards. Leaving Neville they all huddle under the invisibility cloak as Hermione unlocks the door on the third floor. A harp is playing by itself and they take off the cloak to see the threeheaded dog is asleep. They take hold of it and between them they push the dog's huge paw off the trapdoor.",
    "5": "They take hold of it and between them they push the dog's huge paw off the trapdoor. The dog breathes out and they stagger back lifting the wooden cover to stare down into the black hole beneath. Dog dribble hits Ron as the dog opens its three mouths. They throw themselves into the hole as the dog destroys the trapdoor. They rush up to her desk and slowly turn and leave. Outside in the corridor. he stares hard at Harry as Snape stalks away along the corridor his black cloak billowing behind him. The school is silhouetted against moonlit clouds. Harry Ron and Hermione creep downstairs into the common room where they spot Neville's toad. Neville gets up from a chair freezes and falls over backwards. Leaving Neville they all huddle under the invisibility cloak as Hermione unlocks the door on the third floor. A harp is playing by itself and they take off the cloak to see the threeheaded dog is asleep.",
    "6": "A harp is playing by itself and they take off the cloak to see the threeheaded dog is asleep. They take hold of it and between them they push the dog's huge paw off the trapdoor. The dog breathes out and they stagger back lifting the wooden cover to stare down into the black hole beneath. Dog dribble hits Ron as the dog opens its three mouths. They throw themselves into the hole as the dog destroys the trapdoor. They rush up to her desk and slowly turn and leave. Outside in the corridor. he stares hard at Harry as Snape stalks away along the corridor his black cloak billowing behind him. The school is silhouetted against moonlit clouds. Harry Ron and Hermione creep downstairs into the common room where they spot Neville's toad. Neville gets up from a chair freezes and falls over backwards. Leaving Neville they all huddle under the invisibility cloak as Hermione unlocks the door on the third floor.",
    "7": "Leaving Neville they all huddle under the invisibility cloak as Hermione unlocks the door on the third floor. A harp is playing by itself and they take off the cloak to see the threeheaded dog is asleep. They take hold of it and between them they push the dog's huge paw off the trapdoor. The dog breathes out and they stagger back lifting the wooden cover to stare down into the black hole beneath. Dog dribble hits Ron as the dog opens its three mouths. They throw themselves into the hole as the dog destroys the trapdoor. They rush up to her desk and slowly turn and leave. Outside in the corridor. he stares hard at Harry as Snape stalks away along the corridor his black cloak billowing behind him. The school is silhouetted against moonlit clouds. Harry Ron and Hermione creep downstairs into the common room where they spot Neville's toad. Neville gets up from a chair freezes and falls over backwards.",
    "8": "Neville gets up from a chair freezes and falls over backwards. Leaving Neville they all huddle under the invisibility cloak as Hermione unlocks the door on the third floor. A harp is playing by itself and they take off the cloak to see the threeheaded dog is asleep. They take hold of it and between them they push the dog's huge paw off the trapdoor. The dog breathes out and they stagger back lifting the wooden cover to stare down into the black hole beneath. Dog dribble hits Ron as the dog opens its three mouths. They throw themselves into the hole as the dog destroys the trapdoor. They rush up to her desk and slowly turn and leave. Outside in the corridor. he stares hard at Harry as Snape stalks away along the corridor his black cloak billowing behind him. The school is silhouetted against moonlit clouds. Harry Ron and Hermione creep downstairs into the common room where they spot Neville's toad.",
    "9": "Harry Ron and Hermione creep downstairs into the common room where they spot Neville's toad. Neville gets up from a chair freezes and falls over backwards. Leaving Neville they all huddle under the invisibility cloak as Hermione unlocks the door on the third floor. A harp is playing by itself and they take off the cloak to see the threeheaded dog is asleep. They take hold of it and between them they push the dog's huge paw off the trapdoor. The dog breathes out and they stagger back lifting the wooden cover to stare down into the black hole beneath. Dog dribble hits Ron as the dog opens its three mouths. They throw themselves into the hole as the dog destroys the trapdoor. They rush up to her desk and slowly turn and leave. Outside in the corridor. he stares hard at Harry as Snape stalks away along the corridor his black cloak billowing behind him. The school is silhouetted against moonlit clouds.",
    "10": "The school is silhouetted against moonlit clouds. Harry Ron and Hermione creep downstairs into the common room where they spot Neville's toad. Neville gets up from a chair freezes and falls over backwards. Leaving Neville they all huddle under the invisibility cloak as Hermione unlocks the door on the third floor. A harp is playing by itself and they take off the cloak to see the threeheaded dog is asleep. They take hold of it and between them they push the dog's huge paw off the trapdoor. The dog breathes out and they stagger back lifting the wooden cover to stare down into the black hole beneath. Dog dribble hits Ron as the dog opens its three mouths. They throw themselves into the hole as the dog destroys the trapdoor. They rush up to her desk and slowly turn and leave. Outside in the corridor. he stares hard at Harry as Snape stalks away along the corridor his black cloak billowing behind him.",
    "11": "he stares hard at Harry as Snape stalks away along the corridor his black cloak billowing behind him. The school is silhouetted against moonlit clouds. Harry Ron and Hermione creep downstairs into the common room where they spot Neville's toad. Neville gets up from a chair freezes and falls over backwards. Leaving Neville they all huddle under the invisibility cloak as Hermione unlocks the door on the third floor. A harp is playing by itself and they take off the cloak to see the threeheaded dog is asleep. They take hold of it and between them they push the dog's huge paw off the trapdoor. The dog breathes out and they stagger back lifting the wooden cover to stare down into the black hole beneath. Dog dribble hits Ron as the dog opens its three mouths. They throw themselves into the hole as the dog destroys the trapdoor. They rush up to her desk and slowly turn and leave. Outside in the corridor.",
    "12": "Outside in the corridor. he stares hard at Harry as Snape stalks away along the corridor his black cloak billowing behind him. The school is silhouetted against moonlit clouds. Harry Ron and Hermione creep downstairs into the common room where they spot Neville's toad. Neville gets up from a chair freezes and falls over backwards. Leaving Neville they all huddle under the invisibility cloak as Hermione unlocks the door on the third floor. A harp is playing by itself and they take off the cloak to see the threeheaded dog is asleep. They take hold of it and between them they push the dog's huge paw off the trapdoor. The dog breathes out and they stagger back lifting the wooden cover to stare down into the black hole beneath. Dog dribble hits Ron as the dog opens its three mouths. They throw themselves into the hole as the dog destroys the trapdoor. They rush up to her desk and slowly turn and leave.",
    "13": "They rush up to her desk and slowly turn and leave. Outside in the corridor. he stares hard at Harry as Snape stalks away along the corridor his black cloak billowing behind him. The school is silhouetted against moonlit clouds. Harry Ron and Hermione creep downstairs into the common room where they spot Neville's toad. Neville gets up from a chair freezes and falls over backwards. Leaving Neville they all huddle under the invisibility cloak as Hermione unlocks the door on the third floor. A harp is playing by itself and they take off the cloak to see the threeheaded dog is asleep. They take hold of it and between them they push the dog's huge paw off the trapdoor. The dog breathes out and they stagger back lifting the wooden cover to stare down into the black hole beneath. Dog dribble hits Ron as the dog opens its three mouths. They throw themselves into the hole as the dog destroys the trapdoor."
  }
}