{
  "ground_truth": "A horrible face appears growing out of the back of Quirrell's head with eyes sunk in dark sockets and the skin stretched over the bony skull as Harry turns to run. A sheet of flame blocks his way and they appear in the mirror. Harry takes the red stone in his pocket and looks at it as his parents disappear. Quirrell flies through the air and detects Harry who falls over backwards causing the glowing philosopher's stone to drop from his hand. He stretches out desperately to reach it but Quirrell is trying to choke him. Harry grabs Quirrell's hand which surprises him causing Quirrell to pull away. Quirrell holds out his hand in front of him and sees it crumble into grey dust. Quirrell lurches towards the stone and Harry's hands push against Quirrell's face which also disintegrates into dust. Harry stares at his own hands in horror as Quirrell reaches out towards him and then crashes to the ground. his whole body turned to a pile of dust and Voldemort has also disappeared. Puzzled Harry stares at his hands again then looks around for the philosopher's stone seeing the dark red crystal lying on the stairs with a small flame flickering inside it. Harry picks it up looks at it for a moment smiles with relief and clutches it tightly in his hand.",
  "iterations": {
    "1": "A horrible face appears growing out of the back of Quirrell's head with eyes sunk in dark sockets and the skin stretched over the bony skull as Harry turns to run. A sheet of flame blocks his way and they appear in the mirror. Harry takes the red stone in his pocket and looks at it as his parents disappear. Quirrell flies through the air and detects Harry who falls over backwards causing the glowing philosopher's stone to drop from his hand. He stretches out desperately to reach it but Quirrell is trying to choke him. Harry grabs Quirrell's hand which surprises him causing Quirrell to pull away. Quirrell holds out his hand in front of him and sees it crumble into grey dust. Quirrell lurches towards the stone and Harry's hands push against Quirrell's face which also disintegrates into dust. Harry stares at his own hands in horror as Quirrell reaches out towards him and then crashes to the ground. his whole body turned to a pile of dust and Voldemort has also disappeared. Puzzled Harry stares at his hands again then looks around for the philosopher's stone seeing the dark red crystal lying on the stairs with a small flame flickering inside it. Harry picks it up looks at it for a moment smiles with relief and clutches it tightly in his hand.",
    "2": "Harry picks it up looks at it for a moment smiles with relief and clutches it tightly in his hand. A horrible face appears growing out of the back of Quirrell's head with eyes sunk in dark sockets and the skin stretched over the bony skull as Harry turns to run. A sheet of flame blocks his way and they appear in the mirror. Harry takes the red stone in his pocket and looks at it as his parents disappear. Quirrell flies through the air and detects Harry who falls over backwards causing the glowing philosopher's stone to drop from his hand. He stretches out desperately to reach it but Quirrell is trying to choke him. Harry grabs Quirrell's hand which surprises him causing Quirrell to pull away. Quirrell holds out his hand in front of him and sees it crumble into grey dust. Quirrell lurches towards the stone and Harry's hands push against Quirrell's face which also disintegrates into dust. Harry stares at his own hands in horror as Quirrell reaches out towards him and then crashes to the ground. his whole body turned to a pile of dust and Voldemort has also disappeared. Puzzled Harry stares at his hands again then looks around for the philosopher's stone seeing the dark red crystal lying on the stairs with a small flame flickering inside it.",
    "3": "Puzzled Harry stares at his hands again then looks around for the philosopher's stone seeing the dark red crystal lying on the stairs with a small flame flickering inside it. Harry picks it up looks at it for a moment smiles with relief and clutches it tightly in his hand. A horrible face appears growing out of the back of Quirrell's head with eyes sunk in dark sockets and the skin stretched over the bony skull as Harry turns to run. A sheet of flame blocks his way and they appear in the mirror. Harry takes the red stone in his pocket and looks at it as his parents disappear. Quirrell flies through the air and detects Harry who falls over backwards causing the glowing philosopher's stone to drop from his hand. He stretches out desperately to reach it but Quirrell is trying to choke him. Harry grabs Quirrell's hand which surprises him causing Quirrell to pull away. Quirrell holds out his hand in front of him and sees it crumble into grey dust. Quirrell lurches towards the stone and Harry's hands push against Quirrell's face which also disintegrates into dust. Harry stares at his own hands in horror as Quirrell reaches out towards him and then crashes to the ground. his whole body turned to a pile of dust and Voldemort has also disappeared.",
    "4": "his whole body turned to a pile of dust and Voldemort has also disappeared. Puzzled Harry stares at his hands again then looks around for the philosopher's stone seeing the dark red crystal lying on the stairs with a small flame flickering inside it. Harry picks it up looks at it for a moment smiles with relief and clutches it tightly in his hand. A horrible face appears growing out of the back of Quirrell's head with eyes sunk in dark sockets and the skin stretched over the bony skull as Harry turns to run. A sheet of flame blocks his way and they appear in the mirror. Harry takes the red stone in his pocket and looks at it as his parents disappear. Quirrell flies through the air and detects Harry who falls over backwards causing the glowing philosopher's stone to drop from his hand. He stretches out desperately to reach it but Quirrell is trying to choke him. Harry grabs Quirrell's hand which surprises him causing Quirrell to pull away. Quirrell holds out his hand in front of him and sees it crumble into grey dust. Quirrell lurches towards the stone and Harry's hands push against Quirrell's face which also disintegrates into dust. Harry stares at his own hands in horror as Quirrell reaches out towards him and then crashes to the ground.",
    "5": "Harry stares at his own hands in horror as Quirrell reaches out towards him and then crashes to the ground. his whole body turned to a pile of dust and Voldemort has also disappeared. Puzzled Harry stares at his hands again then looks around for the philosopher's stone seeing the dark red crystal lying on the stairs with a small flame flickering inside it. Harry picks it up looks at it for a moment smiles with relief and clutches it tightly in his hand. A horrible face appears growing out of the back of Quirrell's head with eyes sunk in dark sockets and the skin stretched over the bony skull as Harry turns to run. A sheet of flame blocks his way and they appear in the mirror. Harry takes the red stone in his pocket and looks at it as his parents disappear. Quirrell flies through the air and detects Harry who falls over backwards causing the glowing philosopher's stone to drop from his hand. He stretches out desperately to reach it but Quirrell is trying to choke him. Harry grabs Quirrell's hand which surprises him causing Quirrell to pull away. Quirrell holds out his hand in front of him and sees it crumble into grey dust. Quirrell lurches towards the stone and Harry's hands push against Quirrell's face which also disintegrates into dust.",
    "6": "Quirrell lurches towards the stone and Harry's hands push against Quirrell's face which also disintegrates into dust. Harry stares at his own hands in horror as Quirrell reaches out towards him and then crashes to the ground. his whole body turned to a pile of dust and Voldemort has also disappeared. Puzzled Harry stares at his hands again then looks around for the philosopher's stone seeing the dark red crystal lying on the stairs with a small flame flickering inside it. Harry picks it up looks at it for a moment smiles with relief and clutches it tightly in his hand. A horrible face appears growing out of the back of Quirrell's head with eyes sunk in dark sockets and the skin stretched over the bony skull as Harry turns to run. A sheet of flame blocks his way and they appear in the mirror. Harry takes the red stone in his pocket and looks at it as his parents disappear. Quirrell flies through the air and detects Harry who falls over backwards causing the glowing philosopher's stone to drop from his hand. He stretches out desperately to reach it but Quirrell is trying to choke him. Harry grabs Quirrell's hand which surprises him causing Quirrell to pull away. Quirrell holds out his hand in front of him and sees it crumble into grey dust.",
    "7": "Quirrell holds out his hand in front of him and sees it crumble into grey dust. Quirrell lurches towards the stone and Harry's hands push against Quirrell's face which also disintegrates into dust. Harry stares at his own hands in horror as Quirrell reaches out towards him and then crashes to the ground. his whole body turned to a pile of dust and Voldemort has also disappeared. Puzzled Harry stares at his hands again then looks around for the philosopher's stone seeing the dark red crystal lying on the stairs with a small flame flickering inside it. Harry picks it up looks at it for a moment smiles with relief and clutches it tightly in his hand. A horrible face appears growing out of the back of Quirrell's head with eyes sunk in dark sockets and the skin stretched over the bony skull as Harry turns to run. A sheet of flame blocks his way and they appear in the mirror. Harry takes the red stone in his pocket and looks at it as his parents disappear. Quirrell flies through the air and detects Harry who falls over backwards causing the glowing philosopher's stone to drop from his hand. He stretches out desperately to reach it but Quirrell is trying to choke him. Harry grabs Quirrell's hand which surprises him causing Quirrell to pull away.",
    "8": "Harry grabs Quirrell's hand which surprises him causing Quirrell to pull away. Quirrell holds out his hand in front of him and sees it crumble into grey dust. Quirrell lurches towards the stone and Harry's hands push against Quirrell's face which also disintegrates into dust. Harry stares at his own hands in horror as Quirrell reaches out towards him and then crashes to the ground. his whole body turned to a pile of dust and Voldemort has also disappeared. Puzzled Harry stares at his hands again then looks around for the philosopher's stone seeing the dark red crystal lying on the stairs with a small flame flickering inside it. Harry picks it up looks at it for a moment smiles with relief and clutches it tightly in his hand. A horrible face appears growing out of the back of Quirrell's head with eyes sunk in dark sockets and the skin stretched over the bony skull as Harry turns to run. A sheet of flame blocks his way and they appear in the mirror. Harry takes the red stone in his pocket and looks at it as his parents disappear. Quirrell flies through the air and detects Harry who falls over backwards causing the glowing philosopher's stone to drop from his hand. He stretches out desperately to reach it but Quirrell is trying to choke him.",
    "9": "He stretches out desperately to reach it but Quirrell is trying to choke him. Harry grabs Quirrell's hand which surprises him causing Quirrell to pull away. Quirrell holds out his hand in front of him and sees it crumble into grey dust. Quirrell lurches towards the stone and Harry's hands push against Quirrell's face which also disintegrates into dust. Harry stares at his own hands in horror as Quirrell reaches out towards him and then crashes to the ground. his whole body turned to a pile of dust and Voldemort has also disappeared. Puzzled Harry stares at his hands again then looks around for the philosopher's stone seeing the dark red crystal lying on the stairs with a small flame flickering inside it. Harry picks it up looks at it for a moment smiles with relief and clutches it tightly in his hand. A horrible face appears growing out of the back of Quirrell's head with eyes sunk in dark sockets and the skin stretched over the bony skull as Harry turns to run. A sheet of flame blocks his way and they appear in the mirror. Harry takes the red stone in his pocket and looks at it as his parents disappear. Quirrell flies through the air and detects Harry who falls over backwards causing the glowing philosopher's stone to drop from his hand.",
    "10": "Quirrell flies through the air and detects Harry who falls over backwards causing the glowing philosopher's stone to drop from his hand. He stretches out desperately to reach it but Quirrell is trying to choke him. Harry grabs Quirrell's hand which surprises him causing Quirrell to pull away. Quirrell holds out his hand in front of him and sees it crumble into grey dust. Quirrell lurches towards the stone and Harry's hands push against Quirrell's face which also disintegrates into dust. Harry stares at his own hands in horror as Quirrell reaches out towards him and then crashes to the ground. his whole body turned to a pile of dust and Voldemort has also disappeared. Puzzled Harry stares at his hands again then looks around for the philosopher's stone seeing the dark red crystal lying on the stairs with a small flame flickering inside it. Harry picks it up looks at it for a moment smiles with relief and clutches it tightly in his hand. A horrible face appears growing out of the back of Quirrell's head with eyes sunk in dark sockets and the skin stretched over the bony skull as Harry turns to run. A sheet of flame blocks his way and they appear in the mirror. Harry takes the red stone in his pocket and looks at it as his parents disappear.",
    "11": "Harry takes the red stone in his pocket and looks at it as his parents disappear. Quirrell flies through the air and detects Harry who falls over backwards causing the glowing philosopher's stone to drop from his hand. He stretches out desperately to reach it but Quirrell is trying to choke him. Harry grabs Quirrell's hand which surprises him causing Quirrell to pull away. Quirrell holds out his hand in front of him and sees it crumble into grey dust. Quirrell lurches towards the stone and Harry's hands push against Quirrell's face which also disintegrates into dust. Harry stares at his own hands in horror as Quirrell reaches out towards him and then crashes to the ground. his whole body turned to a pile of dust and Voldemort has also disappeared. Puzzled Harry stares at his hands again then looks around for the philosopher's stone seeing the dark red crystal lying on the stairs with a small flame flickering inside it. Harry picks it up looks at it for a moment smiles with relief and clutches it tightly in his hand. A horrible face appears growing out of the back of Quirrell's head with eyes sunk in dark sockets and the skin stretched over the bony skull as Harry turns to run. A sheet of flame blocks his way and they appear in the mirror.",
    "12": "A sheet of flame blocks his way and they appear in the mirror. Harry takes the red stone in his pocket and looks at it as his parents disappear. Quirrell flies through the air and detects Harry who falls over backwards causing the glowing philosopher's stone to drop from his hand. He stretches out desperately to reach it but Quirrell is trying to choke him. Harry grabs Quirrell's hand which surprises him causing Quirrell to pull away. Quirrell holds out his hand in front of him and sees it crumble into grey dust. Quirrell lurches towards the stone and Harry's hands push against Quirrell's face which also disintegrates into dust. Harry stares at his own hands in horror as Quirrell reaches out towards him and then crashes to the ground. his whole body turned to a pile of dust and Voldemort has also disappeared. Puzzled Harry stares at his hands again then looks around for the philosopher's stone seeing the dark red crystal lying on the stairs with a small flame flickering inside it. Harry picks it up looks at it for a moment smiles with relief and clutches it tightly in his hand. A horrible face appears growing out of the back of Quirrell's head with eyes sunk in dark sockets and the skin stretched over the bony skull as Harry turns to run.",
    "13": "A horrible face appears growing out of the back of Quirrell's head with eyes sunk in dark sockets and the skin stretched over the bony skull as Harry turns to run. A sheet of flame blocks his way and they appear in the mirror. Harry takes the red stone in his pocket and looks at it as his parents disappear. Quirrell flies through the air and detects Harry who falls over backwards causing the glowing philosopher's stone to drop from his hand. He stretches out desperately to reach it but Quirrell is trying to choke him. Harry grabs Quirrell's hand which surprises him causing Quirrell to pull away. Quirrell holds out his hand in front of him and sees it crumble into grey dust. Quirrell lurches towards the stone and Harry's hands push against Quirrell's face which also disintegrates into dust. Harry stares at his own hands in horror as Quirrell reaches out towards him and then crashes to the ground. his whole body turned to a pile of dust and Voldemort has also disappeared. Puzzled Harry stares at his hands again then looks around for the philosopher's stone seeing the dark red crystal lying on the stairs with a small flame flickering inside it. Harry picks it up looks at it for a moment smiles with relief and clutches it tightly in his hand."
  }
}