{
  "ground_truth": "All the boys are fast asleep except for Harry. He is sitting in his pajamas on the widestone sill gazing out of the window with his knees tucked up under his chin. Sitting beside him his pet snowy owl turns its head as he gently strokes its soft white feathers. As Harry looks out through the diamond shaped window panes across the moonlit courtyard at the school he gives a contented smile. Next morning Harry and Ron are late for class. A tabby cat is sitting on the teacher's desk. It looks up as they open the classroom door. Hermione looks at them disapprovingly as they hurry into the room. The cat leaps off of the table and turns into Professor McGonagall. Later the dark figure of Professor Snape sweeps into his classroom. He fixes his eyes on Malfoy who smiles slyly. Harry takes careful notes.",
  "iterations": {
    "1": "All the boys are fast asleep except for Harry. He is sitting in his pajamas on the widestone sill gazing out of the window with his knees tucked up under his chin. Sitting beside him his pet snowy owl turns its head as he gently strokes its soft white feathers. As Harry looks out through the diamond shaped window panes across the moonlit courtyard at the school he gives a contented smile. Next morning Harry and Ron are late for class. A tabby cat is sitting on the teacher's desk. It looks up as they open the classroom door. Hermione looks at them disapprovingly as they hurry into the room. The cat leaps off of the table and turns into Professor McGonagall. Later the dark figure of Professor Snape sweeps into his classroom. He fixes his eyes on Malfoy who smiles slyly. Harry takes careful notes.",
    "2": "Harry takes careful notes. All the boys are fast asleep except for Harry. He is sitting in his pajamas on the widestone sill gazing out of the window with his knees tucked up under his chin. Sitting beside him his pet snowy owl turns its head as he gently strokes its soft white feathers. As Harry looks out through the diamond shaped window panes across the moonlit courtyard at the school he gives a contented smile. Next morning Harry and Ron are late for class. A tabby cat is sitting on the teacher's desk. It looks up as they open the classroom door. Hermione looks at them disapprovingly as they hurry into the room. The cat leaps off of the table and turns into Professor McGonagall. Later the dark figure of Professor Snape sweeps into his classroom. He fixes his eyes on Malfoy who smiles slyly.",
    "3": "He fixes his eyes on Malfoy who smiles slyly. Harry takes careful notes. All the boys are fast asleep except for Harry. He is sitting in his pajamas on the widestone sill gazing out of the window with his knees tucked up under his chin. Sitting beside him his pet snowy owl turns its head as he gently strokes its soft white feathers. As Harry looks out through the diamond shaped window panes across the moonlit courtyard at the school he gives a contented smile. Next morning Harry and Ron are late for class. A tabby cat is sitting on the teacher's desk. It looks up as they open the classroom door. Hermione looks at them disapprovingly as they hurry into the room. The cat leaps off of the table and turns into Professor McGonagall. Later the dark figure of Professor Snape sweeps into his classroom.",
    "4": "Later the dark figure of Professor Snape sweeps into his classroom. He fixes his eyes on Malfoy who smiles slyly. Harry takes careful notes. All the boys are fast asleep except for Harry. He is sitting in his pajamas on the widestone sill gazing out of the window with his knees tucked up under his chin. Sitting beside him his pet snowy owl turns its head as he gently strokes its soft white feathers. As Harry looks out through the diamond shaped window panes across the moonlit courtyard at the school he gives a contented smile. Next morning Harry and Ron are late for class. A tabby cat is sitting on the teacher's desk. It looks up as they open the classroom door. Hermione looks at them disapprovingly as they hurry into the room. The cat leaps off of the table and turns into Professor McGonagall.",
    "5": "The cat leaps off of the table and turns into Professor McGonagall. Later the dark figure of Professor Snape sweeps into his classroom. He fixes his eyes on Malfoy who smiles slyly. Harry takes careful notes. All the boys are fast asleep except for Harry. He is sitting in his pajamas on the widestone sill gazing out of the window with his knees tucked up under his chin. Sitting beside him his pet snowy owl turns its head as he gently strokes its soft white feathers. As Harry looks out through the diamond shaped window panes across the moonlit courtyard at the school he gives a contented smile. Next morning Harry and Ron are late for class. A tabby cat is sitting on the teacher's desk. It looks up as they open the classroom door. Hermione looks at them disapprovingly as they hurry into the room.",
    "6": "Hermione looks at them disapprovingly as they hurry into the room. The cat leaps off of the table and turns into Professor McGonagall. Later the dark figure of Professor Snape sweeps into his classroom. He fixes his eyes on Malfoy who smiles slyly. Harry takes careful notes. All the boys are fast asleep except for Harry. He is sitting in his pajamas on the widestone sill gazing out of the window with his knees tucked up under his chin. Sitting beside him his pet snowy owl turns its head as he gently strokes its soft white feathers. As Harry looks out through the diamond shaped window panes across the moonlit courtyard at the school he gives a contented smile. Next morning Harry and Ron are late for class. A tabby cat is sitting on the teacher's desk. It looks up as they open the classroom door.",
    "7": "It looks up as they open the classroom door. Hermione looks at them disapprovingly as they hurry into the room. The cat leaps off of the table and turns into Professor McGonagall. Later the dark figure of Professor Snape sweeps into his classroom. He fixes his eyes on Malfoy who smiles slyly. Harry takes careful notes. All the boys are fast asleep except for Harry. He is sitting in his pajamas on the widestone sill gazing out of the window with his knees tucked up under his chin. Sitting beside him his pet snowy owl turns its head as he gently strokes its soft white feathers. As Harry looks out through the diamond shaped window panes across the moonlit courtyard at the school he gives a contented smile. Next morning Harry and Ron are late for class. A tabby cat is sitting on the teacher's desk.",
    "8": "A tabby cat is sitting on the teacher's desk. It looks up as they open the classroom door. Hermione looks at them disapprovingly as they hurry into the room. The cat leaps off of the table and turns into Professor McGonagall. Later the dark figure of Professor Snape sweeps into his classroom. He fixes his eyes on Malfoy who smiles slyly. Harry takes careful notes. All the boys are fast asleep except for Harry. He is sitting in his pajamas on the widestone sill gazing out of the window with his knees tucked up under his chin. Sitting beside him his pet snowy owl turns its head as he gently strokes its soft white feathers. As Harry looks out through the diamond shaped window panes across the moonlit courtyard at the school he gives a contented smile. Next morning Harry and Ron are late for class.",
    "9": "Next morning Harry and Ron are late for class. A tabby cat is sitting on the teacher's desk. It looks up as they open the classroom door. Hermione looks at them disapprovingly as they hurry into the room. The cat leaps off of the table and turns into Professor McGonagall. Later the dark figure of Professor Snape sweeps into his classroom. He fixes his eyes on Malfoy who smiles slyly. Harry takes careful notes. All the boys are fast asleep except for Harry. He is sitting in his pajamas on the widestone sill gazing out of the window with his knees tucked up under his chin. Sitting beside him his pet snowy owl turns its head as he gently strokes its soft white feathers. As Harry looks out through the diamond shaped window panes across the moonlit courtyard at the school he gives a contented smile.",
    "10": "As Harry looks out through the diamond shaped window panes across the moonlit courtyard at the school he gives a contented smile. Next morning Harry and Ron are late for class. A tabby cat is sitting on the teacher's desk. It looks up as they open the classroom door. Hermione looks at them disapprovingly as they hurry into the room. The cat leaps off of the table and turns into Professor McGonagall. Later the dark figure of Professor Snape sweeps into his classroom. He fixes his eyes on Malfoy who smiles slyly. Harry takes careful notes. All the boys are fast asleep except for Harry. He is sitting in his pajamas on the widestone sill gazing out of the window with his knees tucked up under his chin. Sitting beside him his pet snowy owl turns its head as he gently strokes its soft white feathers.",
    "11": "Sitting beside him his pet snowy owl turns its head as he gently strokes its soft white feathers. As Harry looks out through the diamond shaped window panes across the moonlit courtyard at the school he gives a contented smile. Next morning Harry and Ron are late for class. A tabby cat is sitting on the teacher's desk. It looks up as they open the classroom door. Hermione looks at them disapprovingly as they hurry into the room. The cat leaps off of the table and turns into Professor McGonagall. Later the dark figure of Professor Snape sweeps into his classroom. He fixes his eyes on Malfoy who smiles slyly. Harry takes careful notes. All the boys are fast asleep except for Harry. He is sitting in his pajamas on the widestone sill gazing out of the window with his knees tucked up under his chin.",
    "12": "He is sitting in his pajamas on the widestone sill gazing out of the window with his knees tucked up under his chin. Sitting beside him his pet snowy owl turns its head as he gently strokes its soft white feathers. As Harry looks out through the diamond shaped window panes across the moonlit courtyard at the school he gives a contented smile. Next morning Harry and Ron are late for class. A tabby cat is sitting on the teacher's desk. It looks up as they open the classroom door. Hermione looks at them disapprovingly as they hurry into the room. The cat leaps off of the table and turns into Professor McGonagall. Later the dark figure of Professor Snape sweeps into his classroom. He fixes his eyes on Malfoy who smiles slyly. Harry takes careful notes. All the boys are fast asleep except for Harry.",
    "13": "All the boys are fast asleep except for Harry. He is sitting in his pajamas on the widestone sill gazing out of the window with his knees tucked up under his chin. Sitting beside him his pet snowy owl turns its head as he gently strokes its soft white feathers. As Harry looks out through the diamond shaped window panes across the moonlit courtyard at the school he gives a contented smile. Next morning Harry and Ron are late for class. A tabby cat is sitting on the teacher's desk. It looks up as they open the classroom door. Hermione looks at them disapprovingly as they hurry into the room. The cat leaps off of the table and turns into Professor McGonagall. Later the dark figure of Professor Snape sweeps into his classroom. He fixes his eyes on Malfoy who smiles slyly. Harry takes careful notes."
  }
}