{
  "ground_truth": "Jenny takes a gold necklace out of a box but wagging his tail playfully. Marley gets the necklace. John trips on a chair and the chase is on around the living room. The dog easily outmaneuvers Jenny but John grabs him and forces open his jaws. John sprays Marley's poop with a hose looking for the necklace. The doctor holds a probe to Jenny's stomach and moves a scanner around on gel on Jenny's stomach. A fuzzy picture appears on a screen but the doctor frowns and removes the scanner then walks out leaving the Grogans waiting anxiously in the examination room. The doctor returns smiles reassuringly and places the scanner on Jenny's stomach. Jenny nods tightlipped and the doctor withdraws with a sympathetic smile of apology. Jenny glances at her husband who is lost for words as they drive down a palm treelined road. John glances at Jenny and gropes to break the silence without looking at him. she settles back against her headrest and stares out of the window.",
  "iterations": {
    "1": "Jenny takes a gold necklace out of a box but wagging his tail playfully. Marley gets the necklace. John trips on a chair and the chase is on around the living room. The dog easily outmaneuvers Jenny but John grabs him and forces open his jaws. John sprays Marley's poop with a hose looking for the necklace. The doctor holds a probe to Jenny's stomach and moves a scanner around on gel on Jenny's stomach. A fuzzy picture appears on a screen but the doctor frowns and removes the scanner then walks out leaving the Grogans waiting anxiously in the examination room. The doctor returns smiles reassuringly and places the scanner on Jenny's stomach. Jenny nods tightlipped and the doctor withdraws with a sympathetic smile of apology. Jenny glances at her husband who is lost for words as they drive down a palm treelined road. John glances at Jenny and gropes to break the silence without looking at him. she settles back against her headrest and stares out of the window.",
    "2": "she settles back against her headrest and stares out of the window. Jenny takes a gold necklace out of a box but wagging his tail playfully. Marley gets the necklace. John trips on a chair and the chase is on around the living room. The dog easily outmaneuvers Jenny but John grabs him and forces open his jaws. John sprays Marley's poop with a hose looking for the necklace. The doctor holds a probe to Jenny's stomach and moves a scanner around on gel on Jenny's stomach. A fuzzy picture appears on a screen but the doctor frowns and removes the scanner then walks out leaving the Grogans waiting anxiously in the examination room. The doctor returns smiles reassuringly and places the scanner on Jenny's stomach. Jenny nods tightlipped and the doctor withdraws with a sympathetic smile of apology. Jenny glances at her husband who is lost for words as they drive down a palm treelined road. John glances at Jenny and gropes to break the silence without looking at him.",
    "3": "John glances at Jenny and gropes to break the silence without looking at him. she settles back against her headrest and stares out of the window. Jenny takes a gold necklace out of a box but wagging his tail playfully. Marley gets the necklace. John trips on a chair and the chase is on around the living room. The dog easily outmaneuvers Jenny but John grabs him and forces open his jaws. John sprays Marley's poop with a hose looking for the necklace. The doctor holds a probe to Jenny's stomach and moves a scanner around on gel on Jenny's stomach. A fuzzy picture appears on a screen but the doctor frowns and removes the scanner then walks out leaving the Grogans waiting anxiously in the examination room. The doctor returns smiles reassuringly and places the scanner on Jenny's stomach. Jenny nods tightlipped and the doctor withdraws with a sympathetic smile of apology. Jenny glances at her husband who is lost for words as they drive down a palm treelined road.",
    "4": "Jenny glances at her husband who is lost for words as they drive down a palm treelined road. John glances at Jenny and gropes to break the silence without looking at him. she settles back against her headrest and stares out of the window. Jenny takes a gold necklace out of a box but wagging his tail playfully. Marley gets the necklace. John trips on a chair and the chase is on around the living room. The dog easily outmaneuvers Jenny but John grabs him and forces open his jaws. John sprays Marley's poop with a hose looking for the necklace. The doctor holds a probe to Jenny's stomach and moves a scanner around on gel on Jenny's stomach. A fuzzy picture appears on a screen but the doctor frowns and removes the scanner then walks out leaving the Grogans waiting anxiously in the examination room. The doctor returns smiles reassuringly and places the scanner on Jenny's stomach. Jenny nods tightlipped and the doctor withdraws with a sympathetic smile of apology.",
    "5": "Jenny nods tightlipped and the doctor withdraws with a sympathetic smile of apology. Jenny glances at her husband who is lost for words as they drive down a palm treelined road. John glances at Jenny and gropes to break the silence without looking at him. she settles back against her headrest and stares out of the window. Jenny takes a gold necklace out of a box but wagging his tail playfully. Marley gets the necklace. John trips on a chair and the chase is on around the living room. The dog easily outmaneuvers Jenny but John grabs him and forces open his jaws. John sprays Marley's poop with a hose looking for the necklace. The doctor holds a probe to Jenny's stomach and moves a scanner around on gel on Jenny's stomach. A fuzzy picture appears on a screen but the doctor frowns and removes the scanner then walks out leaving the Grogans waiting anxiously in the examination room. The doctor returns smiles reassuringly and places the scanner on Jenny's stomach.",
    "6": "The doctor returns smiles reassuringly and places the scanner on Jenny's stomach. Jenny nods tightlipped and the doctor withdraws with a sympathetic smile of apology. Jenny glances at her husband who is lost for words as they drive down a palm treelined road. John glances at Jenny and gropes to break the silence without looking at him. she settles back against her headrest and stares out of the window. Jenny takes a gold necklace out of a box but wagging his tail playfully. Marley gets the necklace. John trips on a chair and the chase is on around the living room. The dog easily outmaneuvers Jenny but John grabs him and forces open his jaws. John sprays Marley's poop with a hose looking for the necklace. The doctor holds a probe to Jenny's stomach and moves a scanner around on gel on Jenny's stomach. A fuzzy picture appears on a screen but the doctor frowns and removes the scanner then walks out leaving the Grogans waiting anxiously in the examination room.",
    "7": "A fuzzy picture appears on a screen but the doctor frowns and removes the scanner then walks out leaving the Grogans waiting anxiously in the examination room. The doctor returns smiles reassuringly and places the scanner on Jenny's stomach. Jenny nods tightlipped and the doctor withdraws with a sympathetic smile of apology. Jenny glances at her husband who is lost for words as they drive down a palm treelined road. John glances at Jenny and gropes to break the silence without looking at him. she settles back against her headrest and stares out of the window. Jenny takes a gold necklace out of a box but wagging his tail playfully. Marley gets the necklace. John trips on a chair and the chase is on around the living room. The dog easily outmaneuvers Jenny but John grabs him and forces open his jaws. John sprays Marley's poop with a hose looking for the necklace. The doctor holds a probe to Jenny's stomach and moves a scanner around on gel on Jenny's stomach.",
    "8": "The doctor holds a probe to Jenny's stomach and moves a scanner around on gel on Jenny's stomach. A fuzzy picture appears on a screen but the doctor frowns and removes the scanner then walks out leaving the Grogans waiting anxiously in the examination room. The doctor returns smiles reassuringly and places the scanner on Jenny's stomach. Jenny nods tightlipped and the doctor withdraws with a sympathetic smile of apology. Jenny glances at her husband who is lost for words as they drive down a palm treelined road. John glances at Jenny and gropes to break the silence without looking at him. she settles back against her headrest and stares out of the window. Jenny takes a gold necklace out of a box but wagging his tail playfully. Marley gets the necklace. John trips on a chair and the chase is on around the living room. The dog easily outmaneuvers Jenny but John grabs him and forces open his jaws. John sprays Marley's poop with a hose looking for the necklace.",
    "9": "John sprays Marley's poop with a hose looking for the necklace. The doctor holds a probe to Jenny's stomach and moves a scanner around on gel on Jenny's stomach. A fuzzy picture appears on a screen but the doctor frowns and removes the scanner then walks out leaving the Grogans waiting anxiously in the examination room. The doctor returns smiles reassuringly and places the scanner on Jenny's stomach. Jenny nods tightlipped and the doctor withdraws with a sympathetic smile of apology. Jenny glances at her husband who is lost for words as they drive down a palm treelined road. John glances at Jenny and gropes to break the silence without looking at him. she settles back against her headrest and stares out of the window. Jenny takes a gold necklace out of a box but wagging his tail playfully. Marley gets the necklace. John trips on a chair and the chase is on around the living room. The dog easily outmaneuvers Jenny but John grabs him and forces open his jaws.",
    "10": "The dog easily outmaneuvers Jenny but John grabs him and forces open his jaws. John sprays Marley's poop with a hose looking for the necklace. The doctor holds a probe to Jenny's stomach and moves a scanner around on gel on Jenny's stomach. A fuzzy picture appears on a screen but the doctor frowns and removes the scanner then walks out leaving the Grogans waiting anxiously in the examination room. The doctor returns smiles reassuringly and places the scanner on Jenny's stomach. Jenny nods tightlipped and the doctor withdraws with a sympathetic smile of apology. Jenny glances at her husband who is lost for words as they drive down a palm treelined road. John glances at Jenny and gropes to break the silence without looking at him. she settles back against her headrest and stares out of the window. Jenny takes a gold necklace out of a box but wagging his tail playfully. Marley gets the necklace. John trips on a chair and the chase is on around the living room.",
    "11": "John trips on a chair and the chase is on around the living room. The dog easily outmaneuvers Jenny but John grabs him and forces open his jaws. John sprays Marley's poop with a hose looking for the necklace. The doctor holds a probe to Jenny's stomach and moves a scanner around on gel on Jenny's stomach. A fuzzy picture appears on a screen but the doctor frowns and removes the scanner then walks out leaving the Grogans waiting anxiously in the examination room. The doctor returns smiles reassuringly and places the scanner on Jenny's stomach. Jenny nods tightlipped and the doctor withdraws with a sympathetic smile of apology. Jenny glances at her husband who is lost for words as they drive down a palm treelined road. John glances at Jenny and gropes to break the silence without looking at him. she settles back against her headrest and stares out of the window. Jenny takes a gold necklace out of a box but wagging his tail playfully. Marley gets the necklace.",
    "12": "Marley gets the necklace. John trips on a chair and the chase is on around the living room. The dog easily outmaneuvers Jenny but John grabs him and forces open his jaws. John sprays Marley's poop with a hose looking for the necklace. The doctor holds a probe to Jenny's stomach and moves a scanner around on gel on Jenny's stomach. A fuzzy picture appears on a screen but the doctor frowns and removes the scanner then walks out leaving the Grogans waiting anxiously in the examination room. The doctor returns smiles reassuringly and places the scanner on Jenny's stomach. Jenny nods tightlipped and the doctor withdraws with a sympathetic smile of apology. Jenny glances at her husband who is lost for words as they drive down a palm treelined road. John glances at Jenny and gropes to break the silence without looking at him. she settles back against her headrest and stares out of the window. Jenny takes a gold necklace out of a box but wagging his tail playfully.",
    "13": "Jenny takes a gold necklace out of a box but wagging his tail playfully. Marley gets the necklace. John trips on a chair and the chase is on around the living room. The dog easily outmaneuvers Jenny but John grabs him and forces open his jaws. John sprays Marley's poop with a hose looking for the necklace. The doctor holds a probe to Jenny's stomach and moves a scanner around on gel on Jenny's stomach. A fuzzy picture appears on a screen but the doctor frowns and removes the scanner then walks out leaving the Grogans waiting anxiously in the examination room. The doctor returns smiles reassuringly and places the scanner on Jenny's stomach. Jenny nods tightlipped and the doctor withdraws with a sympathetic smile of apology. Jenny glances at her husband who is lost for words as they drive down a palm treelined road. John glances at Jenny and gropes to break the silence without looking at him. she settles back against her headrest and stares out of the window."
  }
}