{
  "ground_truth": "A montage of news images shows a pair of large militarystyle trucks driven in tandem along a dirt road the first with a single soldier standing in the back and the second with a whole troop. The trucks pull up and the troops dressed in khaki fatigues and wearing widebrimmed hats with a goldcolored Burmese military emblem order a group of terrified and cowering peasants off the truck and onto the road while brandishing rifles. The troops pass cash among themselves as an officer in dark glasses sits coolly smoking a cigarette in one of the trucks. A soldier walks in a nearby paddy field and tosses a primed grenade causing the villagers to cower. The soldier then primes and tosses two more grenades which splash harmlessly on sodden ground before stopping about 100 yards from the truck. The peasants are pushed at gunpoint to the edge of the field and begin to halfrun halfstumble across the paddy field towards the solitary soldier as the troops watch impassively and the commander pulls on his cigarette. One of the peasants is blown to pieces leaving the rest to stand still. The commander nods to a soldier and at the command the troops open fire shooting down the peasants. Low clouds hover above mountains with a verdant valley edged with ferns and a small stream running through it. Captions in military white type appear as a mustachioed local man in a baseball cap and striped Tshirt pokes undergrowth with a stick joined by a second man wearing a bandana and a red shirt and a third man. John Rambo. Rambo darkhaired heavyset muscular and sullenfaced wears a khaki smock and a red paisley bandanna.",
  "iterations": {
    "1": "A montage of news images shows a pair of large militarystyle trucks driven in tandem along a dirt road the first with a single soldier standing in the back and the second with a whole troop. The trucks pull up and the troops dressed in khaki fatigues and wearing widebrimmed hats with a goldcolored Burmese military emblem order a group of terrified and cowering peasants off the truck and onto the road while brandishing rifles. The troops pass cash among themselves as an officer in dark glasses sits coolly smoking a cigarette in one of the trucks. A soldier walks in a nearby paddy field and tosses a primed grenade causing the villagers to cower. The soldier then primes and tosses two more grenades which splash harmlessly on sodden ground before stopping about 100 yards from the truck. The peasants are pushed at gunpoint to the edge of the field and begin to halfrun halfstumble across the paddy field towards the solitary soldier as the troops watch impassively and the commander pulls on his cigarette. One of the peasants is blown to pieces leaving the rest to stand still. The commander nods to a soldier and at the command the troops open fire shooting down the peasants. Low clouds hover above mountains with a verdant valley edged with ferns and a small stream running through it. Captions in military white type appear as a mustachioed local man in a baseball cap and striped Tshirt pokes undergrowth with a stick joined by a second man wearing a bandana and a red shirt and a third man. John Rambo. Rambo darkhaired heavyset muscular and sullenfaced wears a khaki smock and a red paisley bandanna.",
    "2": "Rambo darkhaired heavyset muscular and sullenfaced wears a khaki smock and a red paisley bandanna. A montage of news images shows a pair of large militarystyle trucks driven in tandem along a dirt road the first with a single soldier standing in the back and the second with a whole troop. The trucks pull up and the troops dressed in khaki fatigues and wearing widebrimmed hats with a goldcolored Burmese military emblem order a group of terrified and cowering peasants off the truck and onto the road while brandishing rifles. The troops pass cash among themselves as an officer in dark glasses sits coolly smoking a cigarette in one of the trucks. A soldier walks in a nearby paddy field and tosses a primed grenade causing the villagers to cower. The soldier then primes and tosses two more grenades which splash harmlessly on sodden ground before stopping about 100 yards from the truck. The peasants are pushed at gunpoint to the edge of the field and begin to halfrun halfstumble across the paddy field towards the solitary soldier as the troops watch impassively and the commander pulls on his cigarette. One of the peasants is blown to pieces leaving the rest to stand still. The commander nods to a soldier and at the command the troops open fire shooting down the peasants. Low clouds hover above mountains with a verdant valley edged with ferns and a small stream running through it. Captions in military white type appear as a mustachioed local man in a baseball cap and striped Tshirt pokes undergrowth with a stick joined by a second man wearing a bandana and a red shirt and a third man. John Rambo.",
    "3": "John Rambo. Rambo darkhaired heavyset muscular and sullenfaced wears a khaki smock and a red paisley bandanna. A montage of news images shows a pair of large militarystyle trucks driven in tandem along a dirt road the first with a single soldier standing in the back and the second with a whole troop. The trucks pull up and the troops dressed in khaki fatigues and wearing widebrimmed hats with a goldcolored Burmese military emblem order a group of terrified and cowering peasants off the truck and onto the road while brandishing rifles. The troops pass cash among themselves as an officer in dark glasses sits coolly smoking a cigarette in one of the trucks. A soldier walks in a nearby paddy field and tosses a primed grenade causing the villagers to cower. The soldier then primes and tosses two more grenades which splash harmlessly on sodden ground before stopping about 100 yards from the truck. The peasants are pushed at gunpoint to the edge of the field and begin to halfrun halfstumble across the paddy field towards the solitary soldier as the troops watch impassively and the commander pulls on his cigarette. One of the peasants is blown to pieces leaving the rest to stand still. The commander nods to a soldier and at the command the troops open fire shooting down the peasants. Low clouds hover above mountains with a verdant valley edged with ferns and a small stream running through it. Captions in military white type appear as a mustachioed local man in a baseball cap and striped Tshirt pokes undergrowth with a stick joined by a second man wearing a bandana and a red shirt and a third man.",
    "4": "Captions in military white type appear as a mustachioed local man in a baseball cap and striped Tshirt pokes undergrowth with a stick joined by a second man wearing a bandana and a red shirt and a third man. John Rambo. Rambo darkhaired heavyset muscular and sullenfaced wears a khaki smock and a red paisley bandanna. A montage of news images shows a pair of large militarystyle trucks driven in tandem along a dirt road the first with a single soldier standing in the back and the second with a whole troop. The trucks pull up and the troops dressed in khaki fatigues and wearing widebrimmed hats with a goldcolored Burmese military emblem order a group of terrified and cowering peasants off the truck and onto the road while brandishing rifles. The troops pass cash among themselves as an officer in dark glasses sits coolly smoking a cigarette in one of the trucks. A soldier walks in a nearby paddy field and tosses a primed grenade causing the villagers to cower. The soldier then primes and tosses two more grenades which splash harmlessly on sodden ground before stopping about 100 yards from the truck. The peasants are pushed at gunpoint to the edge of the field and begin to halfrun halfstumble across the paddy field towards the solitary soldier as the troops watch impassively and the commander pulls on his cigarette. One of the peasants is blown to pieces leaving the rest to stand still. The commander nods to a soldier and at the command the troops open fire shooting down the peasants. Low clouds hover above mountains with a verdant valley edged with ferns and a small stream running through it.",
    "5": "Low clouds hover above mountains with a verdant valley edged with ferns and a small stream running through it. Captions in military white type appear as a mustachioed local man in a baseball cap and striped Tshirt pokes undergrowth with a stick joined by a second man wearing a bandana and a red shirt and a third man. John Rambo. Rambo darkhaired heavyset muscular and sullenfaced wears a khaki smock and a red paisley bandanna. A montage of news images shows a pair of large militarystyle trucks driven in tandem along a dirt road the first with a single soldier standing in the back and the second with a whole troop. The trucks pull up and the troops dressed in khaki fatigues and wearing widebrimmed hats with a goldcolored Burmese military emblem order a group of terrified and cowering peasants off the truck and onto the road while brandishing rifles. The troops pass cash among themselves as an officer in dark glasses sits coolly smoking a cigarette in one of the trucks. A soldier walks in a nearby paddy field and tosses a primed grenade causing the villagers to cower. The soldier then primes and tosses two more grenades which splash harmlessly on sodden ground before stopping about 100 yards from the truck. The peasants are pushed at gunpoint to the edge of the field and begin to halfrun halfstumble across the paddy field towards the solitary soldier as the troops watch impassively and the commander pulls on his cigarette. One of the peasants is blown to pieces leaving the rest to stand still. The commander nods to a soldier and at the command the troops open fire shooting down the peasants.",
    "6": "The commander nods to a soldier and at the command the troops open fire shooting down the peasants. Low clouds hover above mountains with a verdant valley edged with ferns and a small stream running through it. Captions in military white type appear as a mustachioed local man in a baseball cap and striped Tshirt pokes undergrowth with a stick joined by a second man wearing a bandana and a red shirt and a third man. John Rambo. Rambo darkhaired heavyset muscular and sullenfaced wears a khaki smock and a red paisley bandanna. A montage of news images shows a pair of large militarystyle trucks driven in tandem along a dirt road the first with a single soldier standing in the back and the second with a whole troop. The trucks pull up and the troops dressed in khaki fatigues and wearing widebrimmed hats with a goldcolored Burmese military emblem order a group of terrified and cowering peasants off the truck and onto the road while brandishing rifles. The troops pass cash among themselves as an officer in dark glasses sits coolly smoking a cigarette in one of the trucks. A soldier walks in a nearby paddy field and tosses a primed grenade causing the villagers to cower. The soldier then primes and tosses two more grenades which splash harmlessly on sodden ground before stopping about 100 yards from the truck. The peasants are pushed at gunpoint to the edge of the field and begin to halfrun halfstumble across the paddy field towards the solitary soldier as the troops watch impassively and the commander pulls on his cigarette. One of the peasants is blown to pieces leaving the rest to stand still.",
    "7": "One of the peasants is blown to pieces leaving the rest to stand still. The commander nods to a soldier and at the command the troops open fire shooting down the peasants. Low clouds hover above mountains with a verdant valley edged with ferns and a small stream running through it. Captions in military white type appear as a mustachioed local man in a baseball cap and striped Tshirt pokes undergrowth with a stick joined by a second man wearing a bandana and a red shirt and a third man. John Rambo. Rambo darkhaired heavyset muscular and sullenfaced wears a khaki smock and a red paisley bandanna. A montage of news images shows a pair of large militarystyle trucks driven in tandem along a dirt road the first with a single soldier standing in the back and the second with a whole troop. The trucks pull up and the troops dressed in khaki fatigues and wearing widebrimmed hats with a goldcolored Burmese military emblem order a group of terrified and cowering peasants off the truck and onto the road while brandishing rifles. The troops pass cash among themselves as an officer in dark glasses sits coolly smoking a cigarette in one of the trucks. A soldier walks in a nearby paddy field and tosses a primed grenade causing the villagers to cower. The soldier then primes and tosses two more grenades which splash harmlessly on sodden ground before stopping about 100 yards from the truck. The peasants are pushed at gunpoint to the edge of the field and begin to halfrun halfstumble across the paddy field towards the solitary soldier as the troops watch impassively and the commander pulls on his cigarette.",
    "8": "The peasants are pushed at gunpoint to the edge of the field and begin to halfrun halfstumble across the paddy field towards the solitary soldier as the troops watch impassively and the commander pulls on his cigarette. One of the peasants is blown to pieces leaving the rest to stand still. The commander nods to a soldier and at the command the troops open fire shooting down the peasants. Low clouds hover above mountains with a verdant valley edged with ferns and a small stream running through it. Captions in military white type appear as a mustachioed local man in a baseball cap and striped Tshirt pokes undergrowth with a stick joined by a second man wearing a bandana and a red shirt and a third man. John Rambo. Rambo darkhaired heavyset muscular and sullenfaced wears a khaki smock and a red paisley bandanna. A montage of news images shows a pair of large militarystyle trucks driven in tandem along a dirt road the first with a single soldier standing in the back and the second with a whole troop. The trucks pull up and the troops dressed in khaki fatigues and wearing widebrimmed hats with a goldcolored Burmese military emblem order a group of terrified and cowering peasants off the truck and onto the road while brandishing rifles. The troops pass cash among themselves as an officer in dark glasses sits coolly smoking a cigarette in one of the trucks. A soldier walks in a nearby paddy field and tosses a primed grenade causing the villagers to cower. The soldier then primes and tosses two more grenades which splash harmlessly on sodden ground before stopping about 100 yards from the truck.",
    "9": "The soldier then primes and tosses two more grenades which splash harmlessly on sodden ground before stopping about 100 yards from the truck. The peasants are pushed at gunpoint to the edge of the field and begin to halfrun halfstumble across the paddy field towards the solitary soldier as the troops watch impassively and the commander pulls on his cigarette. One of the peasants is blown to pieces leaving the rest to stand still. The commander nods to a soldier and at the command the troops open fire shooting down the peasants. Low clouds hover above mountains with a verdant valley edged with ferns and a small stream running through it. Captions in military white type appear as a mustachioed local man in a baseball cap and striped Tshirt pokes undergrowth with a stick joined by a second man wearing a bandana and a red shirt and a third man. John Rambo. Rambo darkhaired heavyset muscular and sullenfaced wears a khaki smock and a red paisley bandanna. A montage of news images shows a pair of large militarystyle trucks driven in tandem along a dirt road the first with a single soldier standing in the back and the second with a whole troop. The trucks pull up and the troops dressed in khaki fatigues and wearing widebrimmed hats with a goldcolored Burmese military emblem order a group of terrified and cowering peasants off the truck and onto the road while brandishing rifles. The troops pass cash among themselves as an officer in dark glasses sits coolly smoking a cigarette in one of the trucks. A soldier walks in a nearby paddy field and tosses a primed grenade causing the villagers to cower.",
    "10": "A soldier walks in a nearby paddy field and tosses a primed grenade causing the villagers to cower. The soldier then primes and tosses two more grenades which splash harmlessly on sodden ground before stopping about 100 yards from the truck. The peasants are pushed at gunpoint to the edge of the field and begin to halfrun halfstumble across the paddy field towards the solitary soldier as the troops watch impassively and the commander pulls on his cigarette. One of the peasants is blown to pieces leaving the rest to stand still. The commander nods to a soldier and at the command the troops open fire shooting down the peasants. Low clouds hover above mountains with a verdant valley edged with ferns and a small stream running through it. Captions in military white type appear as a mustachioed local man in a baseball cap and striped Tshirt pokes undergrowth with a stick joined by a second man wearing a bandana and a red shirt and a third man. John Rambo. Rambo darkhaired heavyset muscular and sullenfaced wears a khaki smock and a red paisley bandanna. A montage of news images shows a pair of large militarystyle trucks driven in tandem along a dirt road the first with a single soldier standing in the back and the second with a whole troop. The trucks pull up and the troops dressed in khaki fatigues and wearing widebrimmed hats with a goldcolored Burmese military emblem order a group of terrified and cowering peasants off the truck and onto the road while brandishing rifles. The troops pass cash among themselves as an officer in dark glasses sits coolly smoking a cigarette in one of the trucks.",
    "11": "The troops pass cash among themselves as an officer in dark glasses sits coolly smoking a cigarette in one of the trucks. A soldier walks in a nearby paddy field and tosses a primed grenade causing the villagers to cower. The soldier then primes and tosses two more grenades which splash harmlessly on sodden ground before stopping about 100 yards from the truck. The peasants are pushed at gunpoint to the edge of the field and begin to halfrun halfstumble across the paddy field towards the solitary soldier as the troops watch impassively and the commander pulls on his cigarette. One of the peasants is blown to pieces leaving the rest to stand still. The commander nods to a soldier and at the command the troops open fire shooting down the peasants. Low clouds hover above mountains with a verdant valley edged with ferns and a small stream running through it. Captions in military white type appear as a mustachioed local man in a baseball cap and striped Tshirt pokes undergrowth with a stick joined by a second man wearing a bandana and a red shirt and a third man. John Rambo. Rambo darkhaired heavyset muscular and sullenfaced wears a khaki smock and a red paisley bandanna. A montage of news images shows a pair of large militarystyle trucks driven in tandem along a dirt road the first with a single soldier standing in the back and the second with a whole troop. The trucks pull up and the troops dressed in khaki fatigues and wearing widebrimmed hats with a goldcolored Burmese military emblem order a group of terrified and cowering peasants off the truck and onto the road while brandishing rifles.",
    "12": "The trucks pull up and the troops dressed in khaki fatigues and wearing widebrimmed hats with a goldcolored Burmese military emblem order a group of terrified and cowering peasants off the truck and onto the road while brandishing rifles. The troops pass cash among themselves as an officer in dark glasses sits coolly smoking a cigarette in one of the trucks. A soldier walks in a nearby paddy field and tosses a primed grenade causing the villagers to cower. The soldier then primes and tosses two more grenades which splash harmlessly on sodden ground before stopping about 100 yards from the truck. The peasants are pushed at gunpoint to the edge of the field and begin to halfrun halfstumble across the paddy field towards the solitary soldier as the troops watch impassively and the commander pulls on his cigarette. One of the peasants is blown to pieces leaving the rest to stand still. The commander nods to a soldier and at the command the troops open fire shooting down the peasants. Low clouds hover above mountains with a verdant valley edged with ferns and a small stream running through it. Captions in military white type appear as a mustachioed local man in a baseball cap and striped Tshirt pokes undergrowth with a stick joined by a second man wearing a bandana and a red shirt and a third man. John Rambo. Rambo darkhaired heavyset muscular and sullenfaced wears a khaki smock and a red paisley bandanna. A montage of news images shows a pair of large militarystyle trucks driven in tandem along a dirt road the first with a single soldier standing in the back and the second with a whole troop.",
    "13": "A montage of news images shows a pair of large militarystyle trucks driven in tandem along a dirt road the first with a single soldier standing in the back and the second with a whole troop. The trucks pull up and the troops dressed in khaki fatigues and wearing widebrimmed hats with a goldcolored Burmese military emblem order a group of terrified and cowering peasants off the truck and onto the road while brandishing rifles. The troops pass cash among themselves as an officer in dark glasses sits coolly smoking a cigarette in one of the trucks. A soldier walks in a nearby paddy field and tosses a primed grenade causing the villagers to cower. The soldier then primes and tosses two more grenades which splash harmlessly on sodden ground before stopping about 100 yards from the truck. The peasants are pushed at gunpoint to the edge of the field and begin to halfrun halfstumble across the paddy field towards the solitary soldier as the troops watch impassively and the commander pulls on his cigarette. One of the peasants is blown to pieces leaving the rest to stand still. The commander nods to a soldier and at the command the troops open fire shooting down the peasants. Low clouds hover above mountains with a verdant valley edged with ferns and a small stream running through it. Captions in military white type appear as a mustachioed local man in a baseball cap and striped Tshirt pokes undergrowth with a stick joined by a second man wearing a bandana and a red shirt and a third man. John Rambo. Rambo darkhaired heavyset muscular and sullenfaced wears a khaki smock and a red paisley bandanna."
  }
}