{
  "ground_truth": "He takes his lighted cigarette from the ashtray puffs it two or three times and kills it then picks up the horn again. As he goes on speaking the scene slowly dissolves to palm trees lining the street with middleclass houses mostly in Spanish style. Some kids throw a baseball back and forth across a couple of front lawns while an ice cream wagon dawdles along the block. Neff's coupe meets and passes the ice cream wagon and stops before one of the Spanish houses. Neff gets out carrying a briefcase with his hat a little on the back of his head and his movements are easy and full of ginger. He inspects the house checks the number goes up on the front porch and rings the bell then pushes past her into the house. The style is Spanish throughout with a wroughtiron staircase curving down from the second floor and a fringed Mexican shawl hanging down over the landing. A large tapestry hangs on the wall. Neff looks up to see Phyllis Dietrichson standing and looking down. She is in her early thirties holding a large bathtowel around her torso down to about two inches above her knees. She wears no stockings. no nothing.",
  "iterations": {
    "1": "He takes his lighted cigarette from the ashtray puffs it two or three times and kills it then picks up the horn again. As he goes on speaking the scene slowly dissolves to palm trees lining the street with middleclass houses mostly in Spanish style. Some kids throw a baseball back and forth across a couple of front lawns while an ice cream wagon dawdles along the block. Neff's coupe meets and passes the ice cream wagon and stops before one of the Spanish houses. Neff gets out carrying a briefcase with his hat a little on the back of his head and his movements are easy and full of ginger. He inspects the house checks the number goes up on the front porch and rings the bell then pushes past her into the house. The style is Spanish throughout with a wroughtiron staircase curving down from the second floor and a fringed Mexican shawl hanging down over the landing. A large tapestry hangs on the wall. Neff looks up to see Phyllis Dietrichson standing and looking down. She is in her early thirties holding a large bathtowel around her torso down to about two inches above her knees. She wears no stockings. no nothing.",
    "2": "no nothing. He takes his lighted cigarette from the ashtray puffs it two or three times and kills it then picks up the horn again. As he goes on speaking the scene slowly dissolves to palm trees lining the street with middleclass houses mostly in Spanish style. Some kids throw a baseball back and forth across a couple of front lawns while an ice cream wagon dawdles along the block. Neff's coupe meets and passes the ice cream wagon and stops before one of the Spanish houses. Neff gets out carrying a briefcase with his hat a little on the back of his head and his movements are easy and full of ginger. He inspects the house checks the number goes up on the front porch and rings the bell then pushes past her into the house. The style is Spanish throughout with a wroughtiron staircase curving down from the second floor and a fringed Mexican shawl hanging down over the landing. A large tapestry hangs on the wall. Neff looks up to see Phyllis Dietrichson standing and looking down. She is in her early thirties holding a large bathtowel around her torso down to about two inches above her knees. She wears no stockings.",
    "3": "She wears no stockings. no nothing. He takes his lighted cigarette from the ashtray puffs it two or three times and kills it then picks up the horn again. As he goes on speaking the scene slowly dissolves to palm trees lining the street with middleclass houses mostly in Spanish style. Some kids throw a baseball back and forth across a couple of front lawns while an ice cream wagon dawdles along the block. Neff's coupe meets and passes the ice cream wagon and stops before one of the Spanish houses. Neff gets out carrying a briefcase with his hat a little on the back of his head and his movements are easy and full of ginger. He inspects the house checks the number goes up on the front porch and rings the bell then pushes past her into the house. The style is Spanish throughout with a wroughtiron staircase curving down from the second floor and a fringed Mexican shawl hanging down over the landing. A large tapestry hangs on the wall. Neff looks up to see Phyllis Dietrichson standing and looking down. She is in her early thirties holding a large bathtowel around her torso down to about two inches above her knees.",
    "4": "She is in her early thirties holding a large bathtowel around her torso down to about two inches above her knees. She wears no stockings. no nothing. He takes his lighted cigarette from the ashtray puffs it two or three times and kills it then picks up the horn again. As he goes on speaking the scene slowly dissolves to palm trees lining the street with middleclass houses mostly in Spanish style. Some kids throw a baseball back and forth across a couple of front lawns while an ice cream wagon dawdles along the block. Neff's coupe meets and passes the ice cream wagon and stops before one of the Spanish houses. Neff gets out carrying a briefcase with his hat a little on the back of his head and his movements are easy and full of ginger. He inspects the house checks the number goes up on the front porch and rings the bell then pushes past her into the house. The style is Spanish throughout with a wroughtiron staircase curving down from the second floor and a fringed Mexican shawl hanging down over the landing. A large tapestry hangs on the wall. Neff looks up to see Phyllis Dietrichson standing and looking down.",
    "5": "Neff looks up to see Phyllis Dietrichson standing and looking down. She is in her early thirties holding a large bathtowel around her torso down to about two inches above her knees. She wears no stockings. no nothing. He takes his lighted cigarette from the ashtray puffs it two or three times and kills it then picks up the horn again. As he goes on speaking the scene slowly dissolves to palm trees lining the street with middleclass houses mostly in Spanish style. Some kids throw a baseball back and forth across a couple of front lawns while an ice cream wagon dawdles along the block. Neff's coupe meets and passes the ice cream wagon and stops before one of the Spanish houses. Neff gets out carrying a briefcase with his hat a little on the back of his head and his movements are easy and full of ginger. He inspects the house checks the number goes up on the front porch and rings the bell then pushes past her into the house. The style is Spanish throughout with a wroughtiron staircase curving down from the second floor and a fringed Mexican shawl hanging down over the landing. A large tapestry hangs on the wall.",
    "6": "A large tapestry hangs on the wall. Neff looks up to see Phyllis Dietrichson standing and looking down. She is in her early thirties holding a large bathtowel around her torso down to about two inches above her knees. She wears no stockings. no nothing. He takes his lighted cigarette from the ashtray puffs it two or three times and kills it then picks up the horn again. As he goes on speaking the scene slowly dissolves to palm trees lining the street with middleclass houses mostly in Spanish style. Some kids throw a baseball back and forth across a couple of front lawns while an ice cream wagon dawdles along the block. Neff's coupe meets and passes the ice cream wagon and stops before one of the Spanish houses. Neff gets out carrying a briefcase with his hat a little on the back of his head and his movements are easy and full of ginger. He inspects the house checks the number goes up on the front porch and rings the bell then pushes past her into the house. The style is Spanish throughout with a wroughtiron staircase curving down from the second floor and a fringed Mexican shawl hanging down over the landing.",
    "7": "The style is Spanish throughout with a wroughtiron staircase curving down from the second floor and a fringed Mexican shawl hanging down over the landing. A large tapestry hangs on the wall. Neff looks up to see Phyllis Dietrichson standing and looking down. She is in her early thirties holding a large bathtowel around her torso down to about two inches above her knees. She wears no stockings. no nothing. He takes his lighted cigarette from the ashtray puffs it two or three times and kills it then picks up the horn again. As he goes on speaking the scene slowly dissolves to palm trees lining the street with middleclass houses mostly in Spanish style. Some kids throw a baseball back and forth across a couple of front lawns while an ice cream wagon dawdles along the block. Neff's coupe meets and passes the ice cream wagon and stops before one of the Spanish houses. Neff gets out carrying a briefcase with his hat a little on the back of his head and his movements are easy and full of ginger. He inspects the house checks the number goes up on the front porch and rings the bell then pushes past her into the house.",
    "8": "He inspects the house checks the number goes up on the front porch and rings the bell then pushes past her into the house. The style is Spanish throughout with a wroughtiron staircase curving down from the second floor and a fringed Mexican shawl hanging down over the landing. A large tapestry hangs on the wall. Neff looks up to see Phyllis Dietrichson standing and looking down. She is in her early thirties holding a large bathtowel around her torso down to about two inches above her knees. She wears no stockings. no nothing. He takes his lighted cigarette from the ashtray puffs it two or three times and kills it then picks up the horn again. As he goes on speaking the scene slowly dissolves to palm trees lining the street with middleclass houses mostly in Spanish style. Some kids throw a baseball back and forth across a couple of front lawns while an ice cream wagon dawdles along the block. Neff's coupe meets and passes the ice cream wagon and stops before one of the Spanish houses. Neff gets out carrying a briefcase with his hat a little on the back of his head and his movements are easy and full of ginger.",
    "9": "Neff gets out carrying a briefcase with his hat a little on the back of his head and his movements are easy and full of ginger. He inspects the house checks the number goes up on the front porch and rings the bell then pushes past her into the house. The style is Spanish throughout with a wroughtiron staircase curving down from the second floor and a fringed Mexican shawl hanging down over the landing. A large tapestry hangs on the wall. Neff looks up to see Phyllis Dietrichson standing and looking down. She is in her early thirties holding a large bathtowel around her torso down to about two inches above her knees. She wears no stockings. no nothing. He takes his lighted cigarette from the ashtray puffs it two or three times and kills it then picks up the horn again. As he goes on speaking the scene slowly dissolves to palm trees lining the street with middleclass houses mostly in Spanish style. Some kids throw a baseball back and forth across a couple of front lawns while an ice cream wagon dawdles along the block. Neff's coupe meets and passes the ice cream wagon and stops before one of the Spanish houses.",
    "10": "Neff's coupe meets and passes the ice cream wagon and stops before one of the Spanish houses. Neff gets out carrying a briefcase with his hat a little on the back of his head and his movements are easy and full of ginger. He inspects the house checks the number goes up on the front porch and rings the bell then pushes past her into the house. The style is Spanish throughout with a wroughtiron staircase curving down from the second floor and a fringed Mexican shawl hanging down over the landing. A large tapestry hangs on the wall. Neff looks up to see Phyllis Dietrichson standing and looking down. She is in her early thirties holding a large bathtowel around her torso down to about two inches above her knees. She wears no stockings. no nothing. He takes his lighted cigarette from the ashtray puffs it two or three times and kills it then picks up the horn again. As he goes on speaking the scene slowly dissolves to palm trees lining the street with middleclass houses mostly in Spanish style. Some kids throw a baseball back and forth across a couple of front lawns while an ice cream wagon dawdles along the block.",
    "11": "Some kids throw a baseball back and forth across a couple of front lawns while an ice cream wagon dawdles along the block. Neff's coupe meets and passes the ice cream wagon and stops before one of the Spanish houses. Neff gets out carrying a briefcase with his hat a little on the back of his head and his movements are easy and full of ginger. He inspects the house checks the number goes up on the front porch and rings the bell then pushes past her into the house. The style is Spanish throughout with a wroughtiron staircase curving down from the second floor and a fringed Mexican shawl hanging down over the landing. A large tapestry hangs on the wall. Neff looks up to see Phyllis Dietrichson standing and looking down. She is in her early thirties holding a large bathtowel around her torso down to about two inches above her knees. She wears no stockings. no nothing. He takes his lighted cigarette from the ashtray puffs it two or three times and kills it then picks up the horn again. As he goes on speaking the scene slowly dissolves to palm trees lining the street with middleclass houses mostly in Spanish style.",
    "12": "As he goes on speaking the scene slowly dissolves to palm trees lining the street with middleclass houses mostly in Spanish style. Some kids throw a baseball back and forth across a couple of front lawns while an ice cream wagon dawdles along the block. Neff's coupe meets and passes the ice cream wagon and stops before one of the Spanish houses. Neff gets out carrying a briefcase with his hat a little on the back of his head and his movements are easy and full of ginger. He inspects the house checks the number goes up on the front porch and rings the bell then pushes past her into the house. The style is Spanish throughout with a wroughtiron staircase curving down from the second floor and a fringed Mexican shawl hanging down over the landing. A large tapestry hangs on the wall. Neff looks up to see Phyllis Dietrichson standing and looking down. She is in her early thirties holding a large bathtowel around her torso down to about two inches above her knees. She wears no stockings. no nothing. He takes his lighted cigarette from the ashtray puffs it two or three times and kills it then picks up the horn again.",
    "13": "He takes his lighted cigarette from the ashtray puffs it two or three times and kills it then picks up the horn again. As he goes on speaking the scene slowly dissolves to palm trees lining the street with middleclass houses mostly in Spanish style. Some kids throw a baseball back and forth across a couple of front lawns while an ice cream wagon dawdles along the block. Neff's coupe meets and passes the ice cream wagon and stops before one of the Spanish houses. Neff gets out carrying a briefcase with his hat a little on the back of his head and his movements are easy and full of ginger. He inspects the house checks the number goes up on the front porch and rings the bell then pushes past her into the house. The style is Spanish throughout with a wroughtiron staircase curving down from the second floor and a fringed Mexican shawl hanging down over the landing. A large tapestry hangs on the wall. Neff looks up to see Phyllis Dietrichson standing and looking down. She is in her early thirties holding a large bathtowel around her torso down to about two inches above her knees. She wears no stockings. no nothing."
  }
}