{
  "ground_truth": "Voldemort glances at the snake, and they dis-apparate. Harry continues to shiver as disheveled and dirty, Hermione and Ron approach him. Hermione turns anxiously to Ron, and he crouches down beside Harry. Harry looks worried as Hermione squats down. Harry closes his eyes and takes a deep breath while his jaw remains tense, breathing through his mouth. Nagini is curled up in a boat house where Lucius Malfoy is present with Voldemort, who examines the skin on his own forearm. When Harry opens his eyes, the others stare at him anxiously as the Death Eaters sweep over the school. A student flies in on a broomstick as a giant swings a scythe, and the others fight on the stairs. Hermione runs through a door, narrowly avoiding a bolt, as Harry beats on a door and shoots a Death Eater. A giant with two-pronged weapons spots the trio, and they run, hiding inside a huge bell lying on its side as the giant's weapon strikes it. Colossal spiders appear scrambling over the rubble, causing them to retreat. Hermione runs between the giants, and they fend off attacks with their wands to reach a quieter area.",
  "iterations": {
    "1": "Voldemort glances at the snake, and they dis-apparate. Harry continues to shiver as disheveled and dirty, Hermione and Ron approach him. Hermione turns anxiously to Ron, and he crouches down beside Harry. Harry looks worried as Hermione squats down. Harry closes his eyes and takes a deep breath while his jaw remains tense, breathing through his mouth. Nagini is curled up in a boat house where Lucius Malfoy is present with Voldemort, who examines the skin on his own forearm. When Harry opens his eyes, the others stare at him anxiously as the Death Eaters sweep over the school. A student flies in on a broomstick as a giant swings a scythe, and the others fight on the stairs. Hermione runs through a door, narrowly avoiding a bolt, as Harry beats on a door and shoots a Death Eater. A giant with two-pronged weapons spots the trio, and they run, hiding inside a huge bell lying on its side as the giant's weapon strikes it. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Colossal spiders appear scrambling over the rubble, causing them to retreat. Hermione runs between the giants, and they fend off attacks with their wands to reach a quieter area.",
    "2": "Voldemort glances at the snake, and they dis-apparate. Harry continues to shiver as disheveled and dirty, Hermione and Ron approach him. Hermione turns anxiously to Ron, and he crouches down beside Harry. Harry looks worried as Hermione squats down. Harry closes his eyes and takes a deep breath while his jaw remains tense, breathing through his mouth. Nagini is curled up in a boat house where Lucius Malfoy is present with Voldemort, who examines the skin on his own forearm. When Harry opens his eyes, the others stare at him anxiously as the Death Eaters sweep over the school. A student flies in on a broomstick as a giant swings a scythe, and the others fight on the stairs. Hermione runs through a door, narrowly avoiding a bolt, as Harry beats on a door and shoots a Death Eater. A giant with two-pronged weapons spots the trio, and they run, hiding inside a huge bell lying on its side as the giant's weapon strikes it. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Colossal spiders appear scrambling over the rubble, causing them to retreat. Hermione runs between the giants, and they fend off attacks with their wands to reach a quieter area. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore.",
    "3": "Voldemort glances at the snake, and they dis-apparate. Harry continues to shiver as disheveled and dirty, Hermione and Ron approach him. Hermione turns anxiously to Ron, and he crouches down beside Harry. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. Harry looks worried as Hermione squats down. Harry closes his eyes and takes a deep breath while his jaw remains tense, breathing through his mouth. Nagini is curled up in a boat house where Lucius Malfoy is present with Voldemort, who examines the skin on his own forearm. When Harry opens his eyes, the others stare at him anxiously as the Death Eaters sweep over the school. A student flies in on a broomstick as a giant swings a scythe, and the others fight on the stairs. Hermione runs through a door, narrowly avoiding a bolt, as Harry beats on a door and shoots a Death Eater. A giant with two-pronged weapons spots the trio, and they run, hiding inside a huge bell lying on its side as the giant's weapon strikes it. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Colossal spiders appear scrambling over the rubble, causing them to retreat. Hermione runs between the giants, and they fend off attacks with their wands to reach a quieter area. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore.",
    "4": "Voldemort glances at the snake, and they dis-apparate. Harry continues to shiver as disheveled and dirty, Hermione and Ron approach him. Hermione turns anxiously to Ron, and he crouches down beside Harry. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. Harry looks worried as Hermione squats down. Harry closes his eyes and takes a deep breath while his jaw remains tense, breathing through his mouth. Nagini is curled up in a boat house where Lucius Malfoy is present with Voldemort, who examines the skin on his own forearm. When Harry opens his eyes, the others stare at him anxiously as the Death Eaters sweep over the school. A student flies in on a broomstick as a giant swings a scythe, and the others fight on the stairs. Hermione runs through a door, narrowly avoiding a bolt, as Harry beats on a door and shoots a Death Eater. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. A giant with two-pronged weapons spots the trio, and they run, hiding inside a huge bell lying on its side as the giant's weapon strikes it. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Colossal spiders appear scrambling over the rubble, causing them to retreat. Hermione runs between the giants, and they fend off attacks with their wands to reach a quieter area. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore.",
    "5": "Voldemort glances at the snake, and they dis-apparate. Harry continues to shiver as disheveled and dirty, Hermione and Ron approach him. Hermione turns anxiously to Ron, and he crouches down beside Harry. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. Harry looks worried as Hermione squats down. Harry closes his eyes and takes a deep breath while his jaw remains tense, breathing through his mouth. Nagini is curled up in a boat house where Lucius Malfoy is present with Voldemort, who examines the skin on his own forearm. When Harry opens his eyes, the others stare at him anxiously as the Death Eaters sweep over the school. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. A student flies in on a broomstick as a giant swings a scythe, and the others fight on the stairs. Hermione runs through a door, narrowly avoiding a bolt, as Harry beats on a door and shoots a Death Eater. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. A giant with two-pronged weapons spots the trio, and they run, hiding inside a huge bell lying on its side as the giant's weapon strikes it. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Colossal spiders appear scrambling over the rubble, causing them to retreat. Hermione runs between the giants, and they fend off attacks with their wands to reach a quieter area. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore.",
    "6": "Voldemort glances at the snake, and they dis-apparate. Harry continues to shiver as disheveled and dirty, Hermione and Ron approach him. Hermione turns anxiously to Ron, and he crouches down beside Harry. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. Harry looks worried as Hermione squats down. Harry closes his eyes and takes a deep breath while his jaw remains tense, breathing through his mouth. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city's elite, with gaslit streets setting the stage for a race against a mounting darkness. Nagini is curled up in a boat house where Lucius Malfoy is present with Voldemort, who examines the skin on his own forearm. When Harry opens his eyes, the others stare at him anxiously as the Death Eaters sweep over the school. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. A student flies in on a broomstick as a giant swings a scythe, and the others fight on the stairs. Hermione runs through a door, narrowly avoiding a bolt, as Harry beats on a door and shoots a Death Eater. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. A giant with two-pronged weapons spots the trio, and they run, hiding inside a huge bell lying on its side as the giant's weapon strikes it. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Colossal spiders appear scrambling over the rubble, causing them to retreat. Hermione runs between the giants, and they fend off attacks with their wands to reach a quieter area. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore.",
    "7": "Voldemort glances at the snake, and they dis-apparate. Harry continues to shiver as disheveled and dirty, Hermione and Ron approach him. Hermione turns anxiously to Ron, and he crouches down beside Harry. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. Harry looks worried as Hermione squats down. Harry closes his eyes and takes a deep breath while his jaw remains tense, breathing through his mouth. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city's elite, with gaslit streets setting the stage for a race against a mounting darkness. Nagini is curled up in a boat house where Lucius Malfoy is present with Voldemort, who examines the skin on his own forearm. When Harry opens his eyes, the others stare at him anxiously as the Death Eaters sweep over the school. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. A student flies in on a broomstick as a giant swings a scythe, and the others fight on the stairs. Hermione runs through a door, narrowly avoiding a bolt, as Harry beats on a door and shoots a Death Eater. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. A giant with two-pronged weapons spots the trio, and they run, hiding inside a huge bell lying on its side as the giant's weapon strikes it. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Colossal spiders appear scrambling over the rubble, causing them to retreat. Hermione runs between the giants, and they fend off attacks with their wands to reach a quieter area. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore.",
    "8": "Voldemort glances at the snake, and they dis-apparate. Harry continues to shiver as disheveled and dirty, Hermione and Ron approach him. Hermione turns anxiously to Ron, and he crouches down beside Harry. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. Harry looks worried as Hermione squats down. Harry closes his eyes and takes a deep breath while his jaw remains tense, breathing through his mouth. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city's elite, with gaslit streets setting the stage for a race against a mounting darkness. Nagini is curled up in a boat house where Lucius Malfoy is present with Voldemort, who examines the skin on his own forearm. When Harry opens his eyes, the others stare at him anxiously as the Death Eaters sweep over the school. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. A student flies in on a broomstick as a giant swings a scythe, and the others fight on the stairs. Hermione runs through a door, narrowly avoiding a bolt, as Harry beats on a door and shoots a Death Eater. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. A giant with two-pronged weapons spots the trio, and they run, hiding inside a huge bell lying on its side as the giant's weapon strikes it. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Colossal spiders appear scrambling over the rubble, causing them to retreat. Hermione runs between the giants, and they fend off attacks with their wands to reach a quieter area. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore.",
    "9": "Voldemort glances at the snake, and they dis-apparate. Harry continues to shiver as disheveled and dirty, Hermione and Ron approach him. Hermione turns anxiously to Ron, and he crouches down beside Harry. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. Harry looks worried as Hermione squats down. Harry closes his eyes and takes a deep breath while his jaw remains tense, breathing through his mouth. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city's elite, with gaslit streets setting the stage for a race against a mounting darkness. Nagini is curled up in a boat house where Lucius Malfoy is present with Voldemort, who examines the skin on his own forearm. When Harry opens his eyes, the others stare at him anxiously as the Death Eaters sweep over the school. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. A student flies in on a broomstick as a giant swings a scythe, and the others fight on the stairs. Hermione runs through a door, narrowly avoiding a bolt, as Harry beats on a door and shoots a Death Eater. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. A giant with two-pronged weapons spots the trio, and they run, hiding inside a huge bell lying on its side as the giant's weapon strikes it. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Colossal spiders appear scrambling over the rubble, causing them to retreat. Hermione runs between the giants, and they fend off attacks with their wands to reach a quieter area. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies.",
    "10": "Voldemort glances at the snake, and they dis-apparate. Harry continues to shiver as disheveled and dirty, Hermione and Ron approach him. Hermione turns anxiously to Ron, and he crouches down beside Harry. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. Harry looks worried as Hermione squats down. Harry closes his eyes and takes a deep breath while his jaw remains tense, breathing through his mouth. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city's elite, with gaslit streets setting the stage for a race against a mounting darkness. Nagini is curled up in a boat house where Lucius Malfoy is present with Voldemort, who examines the skin on his own forearm. When Harry opens his eyes, the others stare at him anxiously as the Death Eaters sweep over the school. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. On a sun-dappled afternoon in a quaint European village, an eccentric inventor unveils a groundbreaking contraption that defies conventional physics, igniting wonder and skepticism in equal measure. A student flies in on a broomstick as a giant swings a scythe, and the others fight on the stairs. Hermione runs through a door, narrowly avoiding a bolt, as Harry beats on a door and shoots a Death Eater. Under the relentless desert sun, a lone gunslinger confronts a notorious outlaw at a deserted crossroads, both men exchanging steely glances as swirling dust blurs the horizon. A giant with two-pronged weapons spots the trio, and they run, hiding inside a huge bell lying on its side as the giant's weapon strikes it. On a bustling 1960s New York street, a passionate artist finds unexpected inspiration in the chaotic interplay of urban life, capturing moments of love, loss, and defiant hope on a rain-soaked canvas. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Colossal spiders appear scrambling over the rubble, causing them to retreat. Hermione runs between the giants, and they fend off attacks with their wands to reach a quieter area. Beneath the shimmering surface of an underwater kingdom, a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies."
  }
}