{
  "ground_truth": "Voldemort glances at the snake, and they dis-apparate. Harry continues to shiver as disheveled and dirty, Hermione and Ron approach him. Hermione turns anxiously to Ron, and he crouches down beside Harry. Harry looks worried as Hermione squats down. Harry closes his eyes and takes a deep breath while his jaw remains tense, breathing through his mouth. Nagini is curled up in a boat house where Lucius Malfoy is present with Voldemort, who examines the skin on his own forearm. When Harry opens his eyes, the others stare at him anxiously as the Death Eaters sweep over the school. A student flies in on a broomstick as a giant swings a scythe, and the others fight on the stairs. Hermione runs through a door, narrowly avoiding a bolt, as Harry beats on a door and shoots a Death Eater. A giant with two-pronged weapons spots the trio, and they run, hiding inside a huge bell lying on its side as the giant's weapon strikes it. Colossal spiders appear scrambling over the rubble, causing them to retreat. Hermione runs between the giants, and they fend off attacks with their wands to reach a quieter area.",
  "iterations": {
    "1": "Voldemort glances at the snake, and they dis-apparate. Harry continues to shiver as disheveled and dirty, Hermione and Ron approach him. Hermione turns anxiously to Ron, and he crouches down beside Harry. Harry looks worried as Hermione squats down. Harry closes his eyes and takes a deep breath while his jaw remains tense, breathing through his mouth. Nagini is curled up in a boat house where Lucius Malfoy is present with Voldemort, who examines the skin on his own forearm. When Harry opens his eyes, the others stare at him anxiously as the Death Eaters sweep over the school. A student flies in on a broomstick as a giant swings a scythe, and the others fight on the stairs. Hermione runs through a door, narrowly avoiding a bolt, as Harry beats on a door and shoots a Death Eater. A giant with two-pronged weapons spots the trio, and they run, hiding inside a huge bell lying on its side as the giant's weapon strikes it. Colossal spiders appear scrambling over the rubble, causing them to retreat. Hermione runs between the giants, and they fend off attacks with their wands to reach a quieter area. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city's elite, with gaslit streets setting the stage for a race against a mounting darkness.",
    "2": "Voldemort glances at the snake, and they dis-apparate. Harry continues to shiver as disheveled and dirty, Hermione and Ron approach him. Hermione turns anxiously to Ron, and he crouches down beside Harry. Harry looks worried as Hermione squats down. Harry closes his eyes and takes a deep breath while his jaw remains tense, breathing through his mouth. Nagini is curled up in a boat house where Lucius Malfoy is present with Voldemort, who examines the skin on his own forearm. When Harry opens his eyes, the others stare at him anxiously as the Death Eaters sweep over the school. A student flies in on a broomstick as a giant swings a scythe, and the others fight on the stairs. Hermione runs through a door, narrowly avoiding a bolt, as Harry beats on a door and shoots a Death Eater. A giant with two-pronged weapons spots the trio, and they run, hiding inside a huge bell lying on its side as the giant's weapon strikes it. Colossal spiders appear scrambling over the rubble, causing them to retreat. Hermione runs between the giants, and they fend off attacks with their wands to reach a quieter area. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city's elite, with gaslit streets setting the stage for a race against a mounting darkness. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards.",
    "3": "Voldemort glances at the snake, and they dis-apparate. Harry continues to shiver as disheveled and dirty, Hermione and Ron approach him. Hermione turns anxiously to Ron, and he crouches down beside Harry. Harry looks worried as Hermione squats down. Harry closes his eyes and takes a deep breath while his jaw remains tense, breathing through his mouth. Nagini is curled up in a boat house where Lucius Malfoy is present with Voldemort, who examines the skin on his own forearm. When Harry opens his eyes, the others stare at him anxiously as the Death Eaters sweep over the school. A student flies in on a broomstick as a giant swings a scythe, and the others fight on the stairs. Hermione runs through a door, narrowly avoiding a bolt, as Harry beats on a door and shoots a Death Eater. A giant with two-pronged weapons spots the trio, and they run, hiding inside a huge bell lying on its side as the giant's weapon strikes it. Colossal spiders appear scrambling over the rubble, causing them to retreat. Hermione runs between the giants, and they fend off attacks with their wands to reach a quieter area. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city's elite, with gaslit streets setting the stage for a race against a mounting darkness. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature's fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him.",
    "4": "Voldemort glances at the snake, and they dis-apparate. Harry continues to shiver as disheveled and dirty, Hermione and Ron approach him. Hermione turns anxiously to Ron, and he crouches down beside Harry. Harry looks worried as Hermione squats down. Harry closes his eyes and takes a deep breath while his jaw remains tense, breathing through his mouth. Nagini is curled up in a boat house where Lucius Malfoy is present with Voldemort, who examines the skin on his own forearm. When Harry opens his eyes, the others stare at him anxiously as the Death Eaters sweep over the school. A student flies in on a broomstick as a giant swings a scythe, and the others fight on the stairs. Hermione runs through a door, narrowly avoiding a bolt, as Harry beats on a door and shoots a Death Eater. A giant with two-pronged weapons spots the trio, and they run, hiding inside a huge bell lying on its side as the giant's weapon strikes it. Colossal spiders appear scrambling over the rubble, causing them to retreat. Hermione runs between the giants, and they fend off attacks with their wands to reach a quieter area. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city's elite, with gaslit streets setting the stage for a race against a mounting darkness. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature's fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation.",
    "5": "Voldemort glances at the snake, and they dis-apparate. Harry continues to shiver as disheveled and dirty, Hermione and Ron approach him. Hermione turns anxiously to Ron, and he crouches down beside Harry. Harry looks worried as Hermione squats down. Harry closes his eyes and takes a deep breath while his jaw remains tense, breathing through his mouth. Nagini is curled up in a boat house where Lucius Malfoy is present with Voldemort, who examines the skin on his own forearm. When Harry opens his eyes, the others stare at him anxiously as the Death Eaters sweep over the school. A student flies in on a broomstick as a giant swings a scythe, and the others fight on the stairs. Hermione runs through a door, narrowly avoiding a bolt, as Harry beats on a door and shoots a Death Eater. A giant with two-pronged weapons spots the trio, and they run, hiding inside a huge bell lying on its side as the giant's weapon strikes it. Colossal spiders appear scrambling over the rubble, causing them to retreat. Hermione runs between the giants, and they fend off attacks with their wands to reach a quieter area. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city's elite, with gaslit streets setting the stage for a race against a mounting darkness. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature's fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage.",
    "6": "Voldemort glances at the snake, and they dis-apparate. Harry continues to shiver as disheveled and dirty, Hermione and Ron approach him. Hermione turns anxiously to Ron, and he crouches down beside Harry. Harry looks worried as Hermione squats down. Harry closes his eyes and takes a deep breath while his jaw remains tense, breathing through his mouth. Nagini is curled up in a boat house where Lucius Malfoy is present with Voldemort, who examines the skin on his own forearm. When Harry opens his eyes, the others stare at him anxiously as the Death Eaters sweep over the school. A student flies in on a broomstick as a giant swings a scythe, and the others fight on the stairs. Hermione runs through a door, narrowly avoiding a bolt, as Harry beats on a door and shoots a Death Eater. A giant with two-pronged weapons spots the trio, and they run, hiding inside a huge bell lying on its side as the giant's weapon strikes it. Colossal spiders appear scrambling over the rubble, causing them to retreat. Hermione runs between the giants, and they fend off attacks with their wands to reach a quieter area. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city's elite, with gaslit streets setting the stage for a race against a mounting darkness. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature's fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature's fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him.",
    "7": "Voldemort glances at the snake, and they dis-apparate. Harry continues to shiver as disheveled and dirty, Hermione and Ron approach him. Hermione turns anxiously to Ron, and he crouches down beside Harry. Harry looks worried as Hermione squats down. Harry closes his eyes and takes a deep breath while his jaw remains tense, breathing through his mouth. Nagini is curled up in a boat house where Lucius Malfoy is present with Voldemort, who examines the skin on his own forearm. When Harry opens his eyes, the others stare at him anxiously as the Death Eaters sweep over the school. A student flies in on a broomstick as a giant swings a scythe, and the others fight on the stairs. Hermione runs through a door, narrowly avoiding a bolt, as Harry beats on a door and shoots a Death Eater. A giant with two-pronged weapons spots the trio, and they run, hiding inside a huge bell lying on its side as the giant's weapon strikes it. Colossal spiders appear scrambling over the rubble, causing them to retreat. Hermione runs between the giants, and they fend off attacks with their wands to reach a quieter area. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city's elite, with gaslit streets setting the stage for a race against a mounting darkness. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature's fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature's fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind.",
    "8": "Voldemort glances at the snake, and they dis-apparate. Harry continues to shiver as disheveled and dirty, Hermione and Ron approach him. Hermione turns anxiously to Ron, and he crouches down beside Harry. Harry looks worried as Hermione squats down. Harry closes his eyes and takes a deep breath while his jaw remains tense, breathing through his mouth. Nagini is curled up in a boat house where Lucius Malfoy is present with Voldemort, who examines the skin on his own forearm. When Harry opens his eyes, the others stare at him anxiously as the Death Eaters sweep over the school. A student flies in on a broomstick as a giant swings a scythe, and the others fight on the stairs. Hermione runs through a door, narrowly avoiding a bolt, as Harry beats on a door and shoots a Death Eater. A giant with two-pronged weapons spots the trio, and they run, hiding inside a huge bell lying on its side as the giant's weapon strikes it. Colossal spiders appear scrambling over the rubble, causing them to retreat. Hermione runs between the giants, and they fend off attacks with their wands to reach a quieter area. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city's elite, with gaslit streets setting the stage for a race against a mounting darkness. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature's fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature's fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies.",
    "9": "Voldemort glances at the snake, and they dis-apparate. Harry continues to shiver as disheveled and dirty, Hermione and Ron approach him. Hermione turns anxiously to Ron, and he crouches down beside Harry. Harry looks worried as Hermione squats down. Harry closes his eyes and takes a deep breath while his jaw remains tense, breathing through his mouth. Nagini is curled up in a boat house where Lucius Malfoy is present with Voldemort, who examines the skin on his own forearm. When Harry opens his eyes, the others stare at him anxiously as the Death Eaters sweep over the school. A student flies in on a broomstick as a giant swings a scythe, and the others fight on the stairs. Hermione runs through a door, narrowly avoiding a bolt, as Harry beats on a door and shoots a Death Eater. A giant with two-pronged weapons spots the trio, and they run, hiding inside a huge bell lying on its side as the giant's weapon strikes it. Colossal spiders appear scrambling over the rubble, causing them to retreat. Hermione runs between the giants, and they fend off attacks with their wands to reach a quieter area. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city's elite, with gaslit streets setting the stage for a race against a mounting darkness. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature's fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature's fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation.",
    "10": "Voldemort glances at the snake, and they dis-apparate. Harry continues to shiver as disheveled and dirty, Hermione and Ron approach him. Hermione turns anxiously to Ron, and he crouches down beside Harry. Harry looks worried as Hermione squats down. Harry closes his eyes and takes a deep breath while his jaw remains tense, breathing through his mouth. Nagini is curled up in a boat house where Lucius Malfoy is present with Voldemort, who examines the skin on his own forearm. When Harry opens his eyes, the others stare at him anxiously as the Death Eaters sweep over the school. A student flies in on a broomstick as a giant swings a scythe, and the others fight on the stairs. Hermione runs through a door, narrowly avoiding a bolt, as Harry beats on a door and shoots a Death Eater. A giant with two-pronged weapons spots the trio, and they run, hiding inside a huge bell lying on its side as the giant's weapon strikes it. Colossal spiders appear scrambling over the rubble, causing them to retreat. Hermione runs between the giants, and they fend off attacks with their wands to reach a quieter area. On a foggy evening in Victorian London, an intrepid detective uncovers a hidden conspiracy among the city's elite, with gaslit streets setting the stage for a race against a mounting darkness. In a bustling marketplace in ancient Persia, a cunning street thief navigates labyrinthine alleyways and vibrant bazaars, his calculated every move a daring escape from the ever-watchful royal guards. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature's fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation. Deep in the heart of an enchanted forest, a brave knight embarks on a perilous quest to rescue a captive princess, facing mythical creatures and treacherous traps with unwavering courage. Amidst the roaring tempest of a stormy ocean, a weathered sailor battles nature's fury on a creaking vessel, his resolve as steadfast as the crashing waves that threaten to engulf him. During a clandestine meeting in a snow-covered mountain lodge, two rival spies exchange cryptic messages hinting at an imminent global conspiracy, their whispered words carried off by the howling wind. On the rugged highlands of Scotland, a stoic warrior faces rival clans and ancient curses alike, his fierce battle cry resonating across mist-covered moors and turbulent skies. During a heated political rally in a futuristic city, a charismatic leader stokes both hope and dissent as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Amidst the chaos of a raging civil war, a compassionate medic races through bombed-out streets, his every desperate step a race against time to save lives in the midst of utter devastation."
  }
}