{
  "ground_truth": "At the ribbon-cutting ceremony, a postman delivers a letter to Bubba's mom, who opens it surrounded by her many children, looks at the check, and faints. A door opens as a white woman serves Bubba's mom some shrimp. Forrest rides the mower, and as he steps onto the porch, he looks down the road. Jenny's image walks and then vanishes, causing Forrest to look away. He turns and walks into the house, where Jenny walks across the lawn to him. Jenny lies asleep in bed, followed by Forrest and Jenny walking together. She breaks a window, collapses to the ground and sobs, and Forrest kneels down next to her. They sit on a limb together, and later, Jenny sits by the vase of flowers and looks out the window. Forrest closes his eyes as he sits on the porch. Jenny places a box of Nike running shoes in his lap as they sit on a log together looking at the river, and Jenny places her arms around Forrest. She turns off the TV and walks outside. Forrest stands, puts down his Dr. Pepper, and watches Jenny walk toward the stairs. Forrest turns and walks toward the door, while Jenny turns and walks up the stairs. Forrest stands outside as the house stands in the rain. He lies in bed as the door opens and Jenny gets into bed next to him. Jenny and Forrest kiss, and Jenny takes off her nightgown as they make love. Jenny carries her purse and walks toward a waiting cab that drives away while Forrest is asleep in his bed. The Congressional Medal lies on a table by a ping-pong paddle as Forrest holds a glass of milk and wears his bathrobe, looking at the medal he had given to Jenny. Jenny's bed is made, so Forrest stands in the doorway looking at the room and bed where Jenny had been, standing still as if in a trance. Forrest sits on a rocking chair with his running shoes on and slowly puts on his Bubba-Gump cap. He stands, walks off the porch, and begins to jog across the lawn, with his speed increasing as he runs farther away. Forrest runs down the driveway away from his house, runs to the end of the drive, turns right, and runs down the highway. Three men sit as they watch the television while Forrest runs through the main street of town, under the sign, and onto the pier. He runs to a pier at the Atlantic Ocean, where a lighthouse stands at the end. Forrest runs across the pier, continues running along the highway, and down a road between fields of wheat, passing a mountain river.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "At the inauguration ceremony, a mailman conveys a note to Bubba's mother, who opens it encircled by her numerous offspring, looks at the draft, and collapses. A portal opens as a Caucasian lady serves Bubba's mother some prawns. Forrest rides the tractor, and as he steps onto the veranda, he looks down the route. Jenny's specter walks and then disappears, causing Forrest to look away. He pivots and walks into the dwelling, where Jenny walks across the yard to him. Jenny lies asleep in bed, accompanied by Forrest and Jenny walking together. She shatters a pane, falls to the ground and weeps, and Forrest kneels down next to her. They sit on a branch together, and later, Jenny sits by the vase of blossoms and looks out the pane. Forrest closes his eyes as he sits on the porch. Jenny places a carton of Nike jogging shoes in his lap as they sit on a log together looking at the stream, and Jenny places her limbs around Forrest. She turns off the television and walks outside. Forrest stands, puts down his Dr. Pepper, and watches Jenny walk toward the stairway. Forrest turns and walks toward the portal, while Jenny turns and walks up the stairway. Forrest stands outside as the dwelling stands in the shower. He lies in bed as the portal opens and Jenny gets into bed next to him. Jenny and Forrest kiss, and Jenny removes her nightdress as they make love. Jenny carries her handbag and walks toward a waiting taxi that drives away while Forrest is asleep in his bed. The Congressional Medal lies on a table by a ping-pong paddle as Forrest holds a tumbler of milk and wears his bathrobe, looking at the medal he had given to Jenny. Jenny's bed is made, so Forrest stands in the doorway looking at the chamber and bed where Jenny had been, standing still as if in a stupor. Forrest sits on a rocking chair with his jogging shoes on and slowly puts on his Bubba-Gump cap. He stands, walks off the porch, and begins to jog across the lawn, with his velocity increasing as he runs farther away. Forrest runs down the driveway away from his dwelling, runs to the end of the drive, turns right, and runs down the roadway. Three men sit as they watch the television while Forrest runs through the main street of town, under the sign, and onto the wharf. He runs to a wharf at the Atlantic Ocean, where a lighthouse stands at the end. Forrest runs across the wharf, continues running along the roadway, and down a route between fields of grain, passing a mountain stream."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "At the ribbon-cutting ceremony, a letter is delivered by a postman to Bubba's mom, who is surrounded by her many children as it is opened by her, looks at the check, and faints. A door is opened as Bubba's mom is served some shrimp by a white woman. The mower is ridden by Forrest, and as the porch is stepped onto by him, the road is looked down by him. Jenny's image walks and then vanishes, causing him to look away. He turns and walks into the house, where Jenny walks across the lawn to him. The bed is lain in by Jenny asleep, followed by Forrest and Jenny walking together. A window is broken by her, she collapses to the ground and sobs, and next to her, Forrest kneels down. They sit on a limb together, and later, the vase of flowers is sat by Jenny, who looks out the window. His eyes are closed by Forrest as he sits on the porch. A box of Nike running shoes is placed in his lap by Jenny as they sit on a log together looking at the river, and her arms are placed around him by Jenny. The TV is turned off by her, and she walks outside. Dr. Pepper is put down by Forrest as he stands, and Jenny is watched by him as she walks toward the stairs. He turns and walks toward the door, while she turns and walks up the stairs. The house stands in the rain as Forrest stands outside. He lies in bed as the door is opened and Jenny gets into bed next to him. A kiss is shared by Jenny and Forrest, and her nightgown is taken off by Jenny as they make love. Her purse is carried by Jenny as she walks toward a waiting cab that drives away while Forrest is asleep in his bed. The Congressional Medal lies on a table by a ping-pong paddle as a glass of milk is held by Forrest and his bathrobe is worn by him, looking at the medal he had given to Jenny. The bed is made, so in the doorway, Forrest stands looking at the room and bed where Jenny had been, standing still as if in a trance. A rocking chair is sat on by Forrest with his running shoes on and his Bubba-Gump cap is slowly put on by him. He stands, walks off the porch, and the lawn is jogged across by him, with his speed increasing as he runs farther away. The driveway is run down by Forrest away from his house, the end of the drive is reached by him, a right turn is taken, and the highway is run down by him. Three men watch the television while the main street of town is run through by Forrest, under the sign, and onto the pier. He runs to a pier at the Atlantic Ocean, where a lighthouse stands at the end. The pier is run across by him, continuing along the highway, and down a road between fields of wheat, passing a mountain river."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "During the ribbon-cutting ceremony, a postman hands Bubba's mom a letter, which she opens surrounded by her children, sees the check, and faints. A door opens, and a white woman serves Bubba's mom shrimp. Forrest rides the mower, then steps onto the porch and looks down the road. Jenny's image walks and vanishes, prompting Forrest to look away, then walk into the house as Jenny approaches. Jenny lies asleep in bed, then she and Forrest walk together. She breaks a window, collapses, and sobs while Forrest kneels beside her. They sit on a branch, and later, Jenny gazes out the window near a vase. Forrest closes his eyes on the porch. Jenny gives him Nike shoes as they sit by the river; she turns off the TV and goes outside. Forrest watches Jenny approach the stairs as he stands and sets down his Dr. Pepper. Forrest and Jenny ascend the stairs separately and lie in bed together. They kiss and make love. Jenny leaves with her purse, catching a cab while Forrest sleeps. The Congressional Medal, once given to Jenny, sits by a ping-pong paddle as Forrest looks at it in his bathrobe. Forrest stands in the doorway, gazing at Jenny's made bed. He wears his running shoes, dons his Bubba-Gump cap, and jogs off the porch, gaining speed. Forrest runs down the driveway and highway, then through town, under a sign, and to an Atlantic pier with a lighthouse. He continues along the highway and past a mountain river through wheat fields."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "At the ribbon-cutting, a postman gives a letter to Bubba's mom, who, surrounded by her children, faints at the sight of a check. A white woman serves her shrimp. Forrest rides the mower and looks down the road. Jenny's image appears, vanishes, and Forrest looks away before entering the house, where Jenny approaches him. Jenny lies in bed; later, she breaks a window and collapses, sobbing, as Forrest kneels beside her. They sit together on a limb, and Jenny later looks out a window by flowers. Forrest closes his eyes on the porch. Jenny gives him Nike shoes while sitting by the river with her arms around him, then turns off the TV and walks outside. Forrest stands, leaves his Dr. Pepper, and watches Jenny go upstairs. As the house stands in rain, Forrest lies in bed, Jenny joins him, and they kiss and make love. Jenny walks to a waiting cab with her purse as Forrest sleeps. The Congressional Medal, beside a ping-pong paddle, is observed by Forrest in his bathrobe. He stares at Jenny's empty bed in a trance. Forrest, with running shoes, dons his Bubba-Gump cap, leaves the porch, and jogs across the lawn, speeding up. He runs down the driveway, turns right, and continues down the highway. Three men watch TV while Forrest runs through town and onto a pier at the Atlantic Ocean, where he passes a lighthouse, continues along the highway, and down a road by wheat fields, past a mountain river."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "During the ribbon-cutting ceremony, an unexpected moment unfolds as a diligent postman arrives to deliver an important letter to Bubba's mom. She is surrounded by her many children as she takes the letter into her hands, eagerly opening it. Upon seeing the contents—a check—her eyes widen in disbelief, and she faints right there. Meanwhile, a door swings open, and a white woman enters the scene, graciously serving Bubba's mom some fresh shrimp. In the midst of all this, Forrest is seen riding the mower, and as he steps onto the porch, his gaze drifts down the long road ahead. In a poignant moment, he sees Jenny's image; she walks with a certain grace but then mysteriously vanishes, prompting Forrest to look away. He eventually turns and makes his way into the house, where he catches sight of Jenny moving across the lawn toward him. Later, Jenny is captured lying asleep in bed, followed by a gentle scene of Forrest and Jenny walking together. In a moment of turmoil, Jenny breaks a window, collapses to the ground in tears, and sinks into sobs, with Forrest kneeling down compassionately beside her. They find solace sitting on a limb together, and in quieter moments, Jenny is depicted sitting by a vase of flowers, thoughtfully looking out the window. Forrest, deep in contemplation, closes his eyes while sitting on the porch. In a touching scene, Jenny places a box of pristine Nike running shoes on his lap as they sit together on a log, gazing at the river, and lovingly wraps her arms around Forrest. She then switches off the TV, and with a sense of purpose, walks outside. Observing her departure, Forrest stands, sets down his Dr. Pepper, and watches as Jenny gracefully moves toward the stairs. As she ascends, Forrest, in parallel, turns and heads toward the door. The scene transitions to an image of Forrest standing outside, with the house looming in the rain, setting a somber mood. Later, he lies quietly in bed, only to have the tranquility disrupted as the door opens and Jenny slips into bed beside him. They share a tender moment, kissing as Jenny removes her nightgown, and they make love. At dawn, Jenny, with her purse in hand, walks toward a waiting cab that gradually drives away, leaving Forrest still asleep in his bed. In another scene, the prestigious Congressional Medal rests on a table near a ping-pong paddle, as Forrest, wrapped in his bathrobe and holding a glass of milk, solemnly looks at the medal he had once given to Jenny. He notices Jenny's bed is made, prompting him to stand in the doorway, gazing at the room and bed where Jenny had been, immobilized as if lost in a trance. Seated on a rocking chair, Forrest dons his running shoes and slowly puts on his Bubba-Gump cap. With determined resolve, he rises, steps off the porch, and begins to jog across the sprawling lawn, his speed increasing with each step as he runs farther into the distance. Forrest moves down the driveway, away from his familiar home, and upon reaching the end, he turns right, continuing his run down the expansive highway. As he passes through the main street of town, under the familiar sign, three men sit, captivated by the television, watching Forrest run. He reaches the pier extending into the Atlantic Ocean, where a towering lighthouse stands at the far end. Undeterred, Forrest runs across the pier, his journey leading him along the winding highway, and down a picturesque road flanked by fields of wheat. He continues his relentless pace, even passing a serene mountain river, undaunted by the landscape around him."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "During the ribbon-cutting ceremony, a surprising and unforeseen moment unfolds as a diligent postman arrives unexpectedly to deliver an important letter to Bubba's mom. Surrounded by her many children, she eagerly takes the letter into her hands, her anticipation building as she carefully opens it. Upon seeing the contents—a check—her eyes widen in complete disbelief, and she faints right there on the spot. Meanwhile, as the scene continues to unfold, a door swings open, and a white woman enters the area, graciously serving Bubba's mom some fresh shrimp. In the midst of all this commotion, Forrest is seen diligently riding the mower, and as he steps onto the porch, his gaze drifts down the long road stretched out ahead. In a poignant and touching moment, he sees Jenny's image; she walks with a certain grace but then mysteriously vanishes, prompting Forrest to look away from the scene. He eventually turns back and makes his way into the house, where he catches sight of Jenny moving slowly across the lawn toward him. Later on, Jenny is captured lying deeply asleep in bed, which is followed by a gentle and serene scene of Forrest and Jenny walking together side by side. In a moment of inner turmoil, Jenny breaks a window, collapses to the ground in tears, and sinks into sobs, with Forrest kneeling down compassionately beside her. They find solace and comfort sitting together on a limb, and in quieter moments, Jenny is depicted sitting thoughtfully by a vase of flowers as she gazes out the window. Forrest, deep in his own contemplation, closes his eyes while sitting pensively on the porch. In a touching and heartfelt scene, Jenny places a box of pristine, brand-new Nike running shoes on his lap as they sit together on a log, both gazing at the river, and she lovingly wraps her arms around Forrest. She then switches off the TV, and with a clear sense of purpose, walks outside. Observing her departure, Forrest stands up, sets down his Dr. Pepper, and watches intently as Jenny gracefully moves toward the stairs. As she ascends, Forrest, in parallel motion, turns and heads toward the door. The scene transitions to an image of Forrest standing outside, with the house looming large in the rain, setting a somber and reflective mood. Later, he lies quietly in bed, only to have the tranquility disrupted when the door opens and Jenny slips into bed beside him. They share a tender and intimate moment, kissing as Jenny removes her nightgown, and they make love. At dawn, Jenny, with her purse in hand, walks toward a waiting cab that gradually drives away, leaving Forrest still fast asleep in his bed. In another significant scene, the prestigious Congressional Medal rests prominently on a table near a ping-pong paddle, as Forrest, wrapped in his bathrobe and holding a glass of milk, solemnly looks at the medal he had once given to Jenny. He notices that Jenny's bed is made, which prompts him to stand in the doorway, gazing thoughtfully at the room and bed where Jenny had been, standing immobilized as if lost in a trance. Seated on a rocking chair, Forrest dons his running shoes and slowly puts on his Bubba-Gump cap. With determined resolve, he rises, steps off the porch, and begins to jog across the sprawling lawn, his speed increasing with each step as he runs farther and faster into the distance. Forrest moves down the driveway, away from his familiar home, and upon reaching the end, he turns right, continuing his relentless run down the expansive highway. As he passes through the main street of town, under the familiar sign, three men sit, captivated by the television, watching Forrest run. He reaches the pier extending far into the Atlantic Ocean, where a towering lighthouse stands prominently at the far end. Undeterred by the distance, Forrest runs across the pier, his journey leading him along the winding highway, and down a picturesque road flanked by fields of wheat on either side. He continues his relentless pace, even passing a serene mountain river, undaunted by the landscape that surrounds him."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "At the ribbon-cutting ceremony, a postman walks up to Bubba's mom, handing her a letter with a courteous nod. She carefully tears open the envelope, surrounded by her many children who eagerly gather around her. Her eyes widen as she looks at the check inside, her face expressing disbelief before she collapses, fainting amidst her concerned children. Meanwhile, a door swings open, and a white woman comes forward, balancing a plate of shrimp, which she serves graciously to Bubba's mom. Transitioning scenes, Forrest is seen driving a lawn mower with a calm focus. After parking it, he crosses over the grass to step onto the wooden porch, where he pauses and gazes thoughtfully down the road. His eyes linger on Jenny's ethereal image walking gracefully, her form dissolving into nothingness, prompting Forrest to avert his gaze in quiet contemplation. He turns from this phantom vision and walks determinedly into the house. Suddenly, Jenny is depicted coming towards him across the lawn, moving with a certain solemnity. Later, she is shown lying asleep in bed, underscoring a transition to a new scene of Forrest and Jenny walking side by side, embodying a moment of shared tranquility. Abruptly, tension skyrockets as Jenny, overcome with emotion, unexpectedly breaks a window, the glass shattering loudly, and collapses to the ground, where she is overwhelmed by sobs. Acting swiftly, Forrest kneels down beside her, offering silent support. They are soon shown sitting together on a sturdy limb, sharing a peaceful reprieve. In another serene moment, Jenny is seated contemplatively by a vase of flowers, her gaze moving pensively to the world beyond the window. Forrest, sitting quietly on the porch, closes his eyes in a gesture of meditative introspection. Jenny, meanwhile, places a box of Nike running shoes in his lap, their presence symbolic on the log where they sit together, the river flowing endlessly before them. Enveloped by a sense of shared intimacy, Jenny wraps her arms around Forrest in a tender embrace. She then rises, switches off the television, and strides outside with purposeful steps. Forrest stands up, gently setting down his Dr. Pepper, his eyes following Jenny as she walks with a sense of resolve toward the stairs. With a slight turn, Forrest begins to make his way toward the door just as Jenny turns in the opposite direction, ascending the stairs with a quiet anticipation. Forrest stands outside, solemnly observing as the house stoically weathers the rain, each drop adding to the atmospheric tension. He lies in bed, eyes heavy with thought, as the bedroom door creaks open and Jenny slips into bed beside him, her presence a silent lullaby. In the next intimate moment, Forrest and Jenny share a kiss, enveloped in a quiet moment of connection, as Jenny gently removes her nightgown, and they make love, the world outside fading away. In the quiet early morning, Jenny, with her purse clutched in hand, walks purposefully toward a waiting cab, which drives away, its engine a soft purr in the early dawn, while Forrest remains asleep in his bed, unaware of her departure. The pristine Congressional Medal rests on a table next to a ping-pong paddle, a silent testament to past triumphs, as Forrest, clad in his bathrobe, pauses to sip from a glass of milk, his gaze lingering on the medal he had once given to Jenny. Entering the room where Jenny had been, Forrest stands in the doorway, taking in the sight of the freshly made bed, his mind momentarily frozen in a trance. Shifting to a sense of resolve, Forrest calmly sits on a rocking chair, lacing up his running shoes with deliberate care before donning his Bubba-Gump cap, signaling a shift in purpose. Rising from the chair, he walks off the porch methodically and steps onto the lawn, gradually increasing his pace from a walk to a jog. With each stride, his speed builds, and he propels himself across the familiar expanse of lawn. Forrest runs down the driveway, the house shrinking behind him, reaching the end before turning right sharply, his feet pounding rhythmically down the highway. As he powers through the main street of town, three men sit in front of a television, momentarily distracted by the sight of Forrest sprinting past, his figure a blur beneath the town's welcoming sign. He continues his relentless journey onto the pier, his footsteps echoing against the wooden planks, until he reaches the end, where a lighthouse stands sentinel over the Atlantic Ocean. Undeterred, Forrest runs onward, leaving the pier behind as he races along the highway and down a road lined by golden fields of wheat, eventually running parallel to a majestic mountain river that courses through the landscape, symbolizing his unstoppable momentum."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "At the ribbon-cutting ceremony, a postman delivers a letter to Bubba's mom, who, upon opening it and seeing the check, faints. A door opens as a white woman serves her some shrimp. Meanwhile, Forrest rides the mower and then steps onto the porch, watching the road. Jenny appears momentarily and vanishes, prompting Forrest to look away before turning to enter the house, where Jenny walks across the lawn to him. Later, while Jenny sleeps in bed, scenes of them together unfold: they walk side by side, she breaks a window and collapses in tears, and Forrest comforts her by kneeling next to her. They share a moment sitting on a limb, and Jenny later sits by the window looking out at flowers. Forrest, sitting on the porch with eyes closed, receives a box of Nike running shoes from Jenny as they sit by the river, wrapped in each other’s arms. Jenny turns off the TV and heads outside while Forrest watches her walk away, setting down his Dr. Pepper. As she ascends the stairs, Forrest enters the house. He later stands outside in the rain, lies in bed, and welcomes Jenny as she joins him. They share a kiss, and she undresses as they make love. The next morning, Jenny leaves in a cab with her purse while Forrest remains asleep. The Congressional Medal, next to a ping-pong paddle, is seen as Forrest, in his bathrobe, reflects on the medal he had given to Jenny. With Jenny gone, Forrest stands in the doorway of her empty room, lost in thought. He then sits on a rocking chair, dons his Bubba-Gump cap, and starts running across the lawn. Increasing his pace, he continues down the driveway, turns onto the highway, and runs through the town's main street, under a sign, and onto a pier. He reaches the Atlantic Ocean and runs along a pier toward a lighthouse, continuing along a highway, through fields of wheat, and past a mountain river."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "At the ribbon-cutting ceremony, which marked the grand opening of Bubba Gump Shrimp Co., a popular seafood restaurant chain inspired by the film \"Forrest Gump,\" a postman delivers a letter to Bubba's mom, who opens it surrounded by her many children, looks at the check, and faints, overwhelmed by the unexpected financial windfall from her late son's business success. A door opens as a white woman, likely one of the attendees from the local community drawn by the event, serves Bubba's mom some shrimp, a nod to the family business that has become a beloved local staple. Forrest rides the mower on the sprawling lawn, and as he steps onto the porch of his Alabama home, built in a classic Southern style, he looks down the dirt road lined with ancient oak trees. Jenny's image walks and then vanishes, causing Forrest to look away, haunted by memories of their complex past. He turns and walks into the house, where Jenny walks across the lawn to him, the house symbolizing a place of both refuge and unresolved emotions. Jenny lies asleep in bed, exhausted from the emotional upheavals, followed by Forrest and Jenny walking together in a moment of reconciliation. She breaks a window, collapses to the ground and sobs, overwhelmed by trauma from her troubled childhood and previous life choices, and Forrest kneels down next to her in silent support. They sit on a limb together, representing a shared moment of peace and connection, and later, Jenny sits by the vase of flowers, a simple gesture of beauty amidst turmoil, and looks out the window, lost in thought. Forrest closes his eyes as he sits on the porch, reflecting on the serenity of the moment. Jenny places a box of Nike running shoes, a brand that Forrest inadvertently helped popularize through his cross-country running, in his lap as they sit on a log together looking at the river, and Jenny places her arms around Forrest, an embrace marking their shared vulnerability. She turns off the TV and walks outside, seeking solace in nature's calmness. Forrest stands, puts down his Dr. Pepper, a drink he has a fondness for since the movie's iconic ping-pong scenes, and watches Jenny walk toward the stairs. Forrest turns and walks toward the door, a threshold between emotional isolation and connection, while Jenny turns and walks up the stairs, a symbolic ascent towards self-discovery. Forrest stands outside as the house stands in the rain, a natural backdrop mirroring his inner sorrow. He lies in bed as the door opens and Jenny gets into bed next to him, symbolizing a moment of intimacy and acceptance. Jenny and Forrest kiss, a culmination of years of unspoken love, and Jenny takes off her nightgown as they make love, a vulnerable moment of connection and trust. Jenny carries her purse and walks toward a waiting cab that drives away, symbolizing her departure and the uncertain future, while Forrest is asleep in his bed. The Congressional Medal, a prestigious award given for military valor, lies on a table by a ping-pong paddle, evoking memories of Forrest's accidental rise to fame, as Forrest holds a glass of milk and wears his bathrobe, looking at the medal he had given to Jenny as a token of friendship and love. Jenny's bed is made, so Forrest stands in the doorway looking at the room and bed where Jenny had been, standing still as if in a trance, grappling with the permanence of her absence. Forrest sits on a rocking chair with his running shoes on and slowly puts on his Bubba-Gump cap, a tribute to his dear friend Bubba and their shared dream. He stands, walks off the porch, and begins to jog across the lawn, with his speed increasing as he runs farther away, driven by an undefined sense of purpose. Forrest runs down the driveway away from his house, a symbol of leaving behind the past, runs to the end of the drive, turns right, and runs down the highway. Three men sit as they watch the television while Forrest runs through the main street of town, under the sign, a familiar landmark in Greenbow, Alabama, and onto the pier. He runs to a pier at the Atlantic Ocean, where a lighthouse stands at the end, guiding ships safely to shore, much like how Forrest seeks direction in his life. Forrest runs across the pier, continues running along the highway, and down a road between fields of wheat, passing a mountain river, its steady flow mirroring the passage of time and the journey of life."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Three men sit as they watch the television while Forrest runs through the main street of town under the sign and onto the pier At the ribboncutting ceremony a postman delivers a letter to Bubba's mom who opens it surrounded by her He stands walks off the porch and begins to jog across the lawn with his speed increasing as he runs farther away many children looks at the check and faints Forrest sits on a rocking chair with his running shoes on and slowly puts on his BubbaGump cap A door opens as a white woman serves Bubba's mom some shrimp Forrest rides the mower and as he steps onto the porch he looks down the road Jenny's image walks and then vanishes causing Forrest to look away Forrest rides the mower and as he steps onto the porch he looks down the road At the ribboncutting ceremony a postman delivers a letter to Bubba's mom who opens it surrounded by her Forrest stands outside as the house stands in the rain He turns and walks into the house where Jenny walks across the lawn to him Jenny lies asleep in bed followed by Forrest and Jenny walking together She breaks a window collapses to the ground and sobs and Forrest kneels down next to her Jenny's image walks and then vanishes causing Forrest to look away They sit on a limb together and later Jenny sits by the vase of flowers and looks out the window Jenny carries her purse and walks toward a waiting cab that drives away while Forrest is asleep in his bed Forrest closes his eyes as he sits on the porch Jenny places a box of Nike running shoes in his lap as they sit on a log together looking at the river and Jenny places her arms around Forrest Forrest turns and walks toward the door while Jenny turns and walks up the stairs She turns off the TV and walks outside Forrest stands puts down his Dr Pepper and watches Jenny walk toward the stairs They sit on a limb together and later Jenny sits by the vase of flowers and looks out the window Forrest turns and walks toward the door while Jenny turns and walks up the stairs Forrest stands outside as the house stands in the rain She breaks a window collapses to the ground and sobs and Forrest kneels down next to her He lies in bed as the door opens and Jenny gets into bed next to him Jenny and Forrest kiss and Jenny takes off her nightgown as they make love Jenny carries her purse and walks toward a waiting cab that drives away while Forrest is asleep in his bed The Congressional Medal lies on a table by a pingpong paddle as Forrest holds a glass of milk and wears his bathrobe looking at the medal he had given to Jenny He runs to a pier at the Atlantic Ocean where a lighthouse stands at the end A door opens as a white woman serves Bubba's mom some shrimp Jenny's bed is made so Forrest stands in the doorway looking at the room and bed where Jenny had been standing still as if in a trance Forrest sits on a rocking chair with his running shoes on and slowly puts on his BubbaGump cap He stands walks off the porch and begins to jog across the lawn with his speed increasing as he runs farther away Forrest runs down the driveway away from his house runs to the end of the drive turns right and runs down the highway Three men sit as they watch the television while Forrest runs through the main street of town under the sign and onto the pier He runs to a pier at the Atlantic Ocean where a lighthouse stands at the end Forrest runs across the pier continues running along the highway and down a road between fields of wheat passing a mountain river"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "At the ribboncutting ceremony a postman delivers a letter to Bubba's mom who opens it surrounded by her. many children looks at the check and faints. A door opens as a white woman serves Bubba's mom some shrimp. Forrest rides the mower and as he steps onto the porch he looks down the road. Jenny's image walks and then vanishes causing Forrest to look away. He turns and walks into the house where Jenny walks across the lawn to him. Jenny lies asleep in bed followed by Forrest and Jenny walking together. She breaks a window collapses to the ground and sobs and Forrest kneels down next to her. They sit on a limb together and later Jenny sits by the vase of flowers and looks out the window. Forrest closes his eyes as he sits on the porch. Jenny places a box of Nike running shoes in his lap as they sit on a log together looking at the river and Jenny places her arms around Forrest. She turns off the TV and walks outside. Forrest stands puts down his Dr Pepper and watches Jenny walk toward the stairs. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Forrest turns and walks toward the door while Jenny turns and walks up the stairs. Forrest stands outside as the house stands in the rain. He lies in bed as the door opens and Jenny gets into bed next to him. Jenny and Forrest kiss and Jenny takes off her nightgown as they make love. Jenny carries her purse and walks toward a waiting cab that drives away while Forrest is asleep in his bed. The Congressional Medal lies on a table by a pingpong paddle as Forrest holds a glass of milk and wears his bathrobe looking at the medal he had given to Jenny. Jenny's bed is made so Forrest stands in the doorway looking at the room and bed where Jenny had been standing still as if in a trance. Forrest sits on a rocking chair with his running shoes on and slowly puts on his BubbaGump cap. He stands walks off the porch and begins to jog across the lawn with his speed increasing as he runs farther away. Forrest runs down the driveway away from his house runs to the end of the drive turns right and runs down the highway. Three men sit as they watch the television while Forrest runs through the main street of town under the sign and onto the pier. He runs to a pier at the Atlantic Ocean where a lighthouse stands at the end. Forrest runs across the pier continues running along the highway and down a road between fields of wheat passing a mountain river."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "At the ribboncutting ceremony a postman delivers a letter to Bubba's mom who opens it surrounded by her. many children looks at the check and faints. A door opens as a white woman serves Bubba's mom some shrimp. Forrest rides the mower and as he steps onto the porch he looks down the road. Jenny's image walks and then vanishes causing Forrest to look away. He turns and walks into the house where Jenny walks across the lawn to him. Jenny lies asleep in bed followed by Forrest and Jenny walking together. She breaks a window collapses to the ground and sobs and Forrest kneels down next to her. They sit on a limb together and later Jenny sits by the vase of flowers and looks out the window. Forrest closes his eyes as he sits on the porch. Jenny places a box of Nike running shoes in his lap as they sit on a log together looking at the river and Jenny places her arms around Forrest. She turns off the TV and walks outside. Forrest stands puts down his Dr Pepper and watches Jenny walk toward the stairs. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. Forrest turns and walks toward the door while Jenny turns and walks up the stairs. Forrest stands outside as the house stands in the rain. He lies in bed as the door opens and Jenny gets into bed next to him. Jenny and Forrest kiss and Jenny takes off her nightgown as they make love. Jenny carries her purse and walks toward a waiting cab that drives away while Forrest is asleep in his bed. The Congressional Medal lies on a table by a pingpong paddle as Forrest holds a glass of milk and wears his bathrobe looking at the medal he had given to Jenny. Jenny's bed is made so Forrest stands in the doorway looking at the room and bed where Jenny had been standing still as if in a trance. Forrest sits on a rocking chair with his running shoes on and slowly puts on his BubbaGump cap. He stands walks off the porch and begins to jog across the lawn with his speed increasing as he runs farther away. Forrest runs down the driveway away from his house runs to the end of the drive turns right and runs down the highway. Three men sit as they watch the television while Forrest runs through the main street of town under the sign and onto the pier. He runs to a pier at the Atlantic Ocean where a lighthouse stands at the end. Forrest runs across the pier continues running along the highway and down a road between fields of wheat passing a mountain river."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "At the ribboncutting ceremony a postman delivers a letter to Bubba's mom who opens it surrounded by her. many children looks at the check and faints. A door opens as a white woman serves Bubba's mom some shrimp. Forrest rides the mower and as he steps onto the porch he looks down the road. Jenny's image walks and then vanishes causing Forrest to look away. He turns and walks into the house where Jenny walks across the lawn to him. Jenny lies asleep in bed followed by Forrest and Jenny walking together. Forrest sits on a rocking chair with his running shoes on and slowly puts on his BubbaGump cap. He stands walks off the porch and begins to jog across the lawn with his speed increasing as he runs farther away. Forrest runs down the driveway away from his house runs to the end of the drive turns right and runs down the highway. Three men sit as they watch the television while Forrest runs through the main street of town under the sign and onto the pier. He runs to a pier at the Atlantic Ocean where a lighthouse stands at the end. Forrest runs across the pier continues running along the highway and down a road between fields of wheat passing a mountain river."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "At the ribboncutting ceremony a postman delivers a letter to Bubba's mom who opens it surrounded by her. many children looks at the check and faints. A door opens as a white woman serves Bubba's mom some shrimp. Three men sit as they watch the television while Forrest runs through the main street of town under the sign and onto the pier. He runs to a pier at the Atlantic Ocean where a lighthouse stands at the end. Forrest runs across the pier continues running along the highway and down a road between fields of wheat passing a mountain river."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "At the ribbon-cutting ceremony, a librarian delivers a letter to Bubba's mom, who opens it surrounded by her many children, looks at the check, and faints. A door opens as a fisherman serves Bubba's mom some shrimp. A squirrel rides the mower, and as it steps onto the porch, it looks down the road. A cloud's image walks and then vanishes, causing the squirrel to look away. It turns and walks into the house, where a cloud walks across the lawn to it. A cloud lies asleep in bed, followed by the squirrel and a cloud walking together. It breaks a window, collapses to the ground and sobs, and the squirrel kneels down next to it. They sit on a limb together, and later, a cloud sits by the vase of flowers and looks out the window. The squirrel closes its eyes as it sits on the porch. A cloud places a box of Nike running shoes in its lap as they sit on a log together looking at the river, and a cloud places its arms around the squirrel. It turns off the TV and walks outside. The squirrel stands, puts down its Dr. Pepper, and watches a cloud walk toward the stairs. The squirrel turns and walks toward the door, while a cloud turns and walks up the stairs. The squirrel stands outside as the house stands in the rain. It lies in bed as the door opens and a cloud gets into bed next to it. A cloud and the squirrel kiss, and a cloud takes off its nightgown as they make love. A cloud carries its purse and walks toward a waiting cab that drives away while the squirrel is asleep in its bed. The Congressional Medal lies on a table by a ping-pong paddle as the squirrel holds a glass of milk and wears its bathrobe, looking at the medal it had given to a cloud. A cloud's bed is made, so the squirrel stands in the doorway looking at the room and bed where a cloud had been, standing still as if in a trance. The squirrel sits on a rocking chair with its running shoes on and slowly puts on its Bubba-Gump cap. It stands, walks off the porch, and begins to jog across the lawn, with its speed increasing as it runs farther away. The squirrel runs down the driveway away from its house, runs to the end of the drive, turns right, and runs down the highway. Three owls sit as they watch the television while the squirrel runs through the main street of town, under the sign, and onto the pier. It runs to a pier at the Atlantic Ocean, where a lighthouse stands at the end. The squirrel runs across the pier, continues running along the highway, and down a road between fields of wheat, passing a mountain river."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "At the grand opening ceremony, a milkman delivers a package to Bubba's mom, who opens it surrounded by her many children, looks at the recipe, and faints. A window opens as a white woman serves Bubba's mom some cookies. Forrest rides the tractor, and as he steps onto the balcony, he looks down the alley. Jenny's image dances and then vanishes, causing Forrest to look away. He turns and walks into the cottage, where Jenny walks across the garden to him. Jenny lies asleep in a hammock, followed by Forrest and Jenny strolling together. She shatters a mirror, collapses to the ground and sobs, and Forrest kneels down next to her. They sit on a bench together, and later, Jenny sits by the stack of books and looks out the skylight. Forrest closes his eyes as he sits on the terrace. Jenny places a box of Adidas sandals in his lap as they sit on a rock together looking at the pond, and Jenny places her arms around Forrest. She turns off the radio and walks outside. Forrest stands, puts down his lemonade, and watches Jenny walk toward the ladder. Forrest turns and walks toward the gate, while Jenny turns and climbs up the ladder. Forrest stands outside as the barn stands in the rain. He lies in bed as the window opens and Jenny gets into bed next to him. Jenny and Forrest kiss, and Jenny takes off her robe as they make love. Jenny carries her suitcase and walks toward a waiting tram that drives away while Forrest is asleep in his bed. The Purple Heart lies on a pedestal by a tennis racket as Forrest holds a mug of tea and wears his pajamas, looking at the medal he had given to Jenny. Jenny's hammock is made, so Forrest stands in the doorway looking at the room and hammock where Jenny had been, standing still as if in a trance. Forrest sits on a lounge chair with his hiking boots on and slowly puts on his Bubba-Gump visor. He stands, walks off the terrace, and begins to jog across the meadow, with his speed increasing as he runs farther away. Forrest runs down the path away from his cottage, runs to the end of the path, turns right, and runs down the boulevard. Three men sit as they watch the cinema while Forrest runs through the central plaza of town, under the archway, and onto the bridge. He runs to a bridge at the Pacific Ocean, where a ferris wheel stands at the end. Forrest runs across the bridge, continues running along the boulevard, and down a road between fields of corn, passing a forest stream."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "At the ribbon-cutting ceremony, a postman tosses a letter to Bubba's mom, who tears it open surrounded by her many children, peers at the check, and swoons. A door swings open as a white woman hands Bubba's mom some shrimp. Forrest polishes the mower, and as he skips onto the porch, he gazes down the road. Jenny's image meanders and then dissolves, causing Forrest to glance away. He pivots and strolls into the house, where Jenny dances across the lawn to him. Jenny dozes in bed, followed by Forrest and Jenny drifting together. She smashes a window, crumples to the ground and wails, and Forrest crouches down next to her. They lean on a limb together, and later, Jenny sits by the vase of flowers and peers out the window. Forrest shuts his eyes as he lounges on the porch. Jenny places a box of Nike running shoes in his hands as they perch on a log together overlooking the river, and Jenny wraps her arms around Forrest. She flicks off the TV and strolls outside. Forrest rises, sets down his Dr. Pepper, and observes Jenny head toward the stairs. Forrest swivels and moseys toward the door, while Jenny turns and ascends the stairs. Forrest lingers outside as the house stands in the rain. He dozes in bed as the door creaks open and Jenny slips into bed next to him. Jenny and Forrest kiss, and Jenny removes her nightgown as they embrace. Jenny clutches her purse and walks toward a waiting cab that speeds away while Forrest snoozes in his bed. The Congressional Medal rests on a table by a ping-pong paddle as Forrest grips a glass of milk and dons his bathrobe, glancing at the medal he had given to Jenny. Jenny's bed is tidied, so Forrest stands in the doorway eyeing the room and bed where Jenny had been, standing still as if in a daze. Forrest relaxes on a rocking chair with his running shoes on and slowly adjusts his Bubba-Gump cap. He rises, strolls off the porch, and begins to wander across the lawn, with his pace quickening as he strides farther away. Forrest hustles down the driveway away from his house, scurries to the end of the drive, veers right, and dashes down the highway. Three men perch as they view the television while Forrest breezes through the main street of town, beneath the sign, and onto the pier. He saunters to a pier at the Atlantic Ocean, where a lighthouse looms at the end. Forrest speeds across the pier, continues dashing along the highway, and wanders down a road between fields of wheat, crossing a mountain river."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "At the grand opening of the art exhibit, a baker delivers a pastry to Charlie's aunt, who opens it surrounded by her many kittens, looks at the map, and faints. A window opens as a brown man serves Charlie's aunt some broccoli. Roger rides the skateboard, and as he steps onto the balcony, he looks down the alley. Daisy's shadow walks and then vanishes, causing Roger to look away. He turns and walks into the castle, where Daisy walks across the field to him. Daisy lies asleep on a hammock, followed by Roger and Daisy walking together. She breaks a mirror, collapses to the floor and sobs, and Roger kneels down next to her. They sit on a rock together, and later, Daisy sits by the bowl of strawberries and looks out the portal. Roger closes his eyes as he sits on the balcony. Daisy places a box of Adidas sandals in his lap as they sit on a branch together looking at the sea, and Daisy places her arms around Roger. She turns off the radio and walks inside. Roger stands, puts down his lemonade, and watches Daisy walk toward the elevator. Roger turns and walks toward the gate, while Daisy turns and walks up the elevator. Roger stands inside as the barn stands in the mist. He lies in a hammock as the violin opens and Daisy gets into the hammock next to him. Daisy and Roger kiss, and Daisy takes off her sweater as they embrace. Daisy carries her backpack and walks toward a waiting bicycle that rides away while Roger is asleep in his hammock. The Golden Trophy lies on a shelf by a tennis ball as Roger holds a glass of juice and wears his pajamas, looking at the trophy he had given to Daisy. Daisy's hammock is folded, so Roger stands in the hallway looking at the tent and hammock where Daisy had been, standing still as if in a daze. Roger sits on a beanbag chair with his hiking boots on and slowly puts on his Charlie-Brown hat. He stands, walks off the balcony, and begins to skate across the meadow, with his speed increasing as he skates farther away. Roger skates down the path away from his barn, skates to the end of the path, turns right, and skates down the sidewalk. Three women sit as they watch the computer while Roger skates through the main street of the village, under the archway, and onto the boardwalk. He skates to a dock at the Pacific Ocean, where a windmill stands at the end. Roger skates across the boardwalk, continues skating along the sidewalk, and down a trail between fields of sunflowers, passing a valley stream."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "At the ribbon-cutting ceremony, an astronaut delivers a package to Larry's grandmother, who peeks at it surrounded by her many pets, glances at the note, and swoons. A curtain opens as an old man serves Larry's grandmother some clams. Paula flies the helicopter, and as she jumps onto the deck, she gazes down the street. Mike's shadow glides and then disappears, causing Paula to turn away. She spins and dances into the barn, where Mike strolls across the meadow to her. Mike lies awake on the couch, followed by Paula and Mike skipping together. He shatters a mirror, collapses to the ground and weeps, and Paula crouches beside him. They dangle from a branch together, and later, Mike rests by the vase of flowers and peers out the window. Paula opens her eyes as she dozes on the deck. Mike places a pair of Adidas sneakers in her lap as they perch on a stump together gazing at the ocean, and Mike wraps his arms around Paula. He switches off the radio and wanders inside. Paula rises, sets down her lemonade, and observes Mike wandering toward the fence. Paula pivots and strolls toward the window, while Mike pivots and climbs the ladder. Paula lingers indoors as the barn glistens in the dew. She reclines on the couch as the curtain parts and Mike crawls onto the couch beside her. Mike and Paula hug, and Mike pulls off his jacket as they embrace. Mike grabs his backpack and strides toward a waiting train that rolls away while Paula dozes on her hammock. The Presidential Medal rests on a shelf by a chessboard as Paula cradles a mug of tea and wears her cardigan, inspecting the medal she had gifted to Mike. Mike's couch is tidy, so Paula leans against the threshold gazing at the room and couch where Mike had been, frozen as if daydreaming. Paula lounges on a swing with her flip-flops on and sporadically adjusts her sunhat. She stands, hops off the deck, and begins to sprint across the pasture, with her pace increasing as she speeds farther away. Paula sprints down the trail away from her barn, sprints to the edge of the trail, veers left, and dashes down the freeway. Two women chatter as they listen to the radio while Paula sprints through the main avenue of the village, past the banner, and onto the boardwalk. She dashes to a dock at the Pacific Ocean, where a windmill stands at the perimeter. Paula sprints along the boardwalk, continues sprinting beside the freeway, and down a path between fields of sunflowers, passing a desert brook."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "At the curtain-pulling event, a plumber hands a postcard to Bubba's mom, who inspects it surrounded by her many children, glances at the blueprint, and dozes off. A window slides open as a white woman hands Bubba's mom some potatoes. Forrest paddles the kayak, and as he leaps onto the deck, he peers up the hillside. Jenny's reflection floats and then dissolves, prompting Forrest to turn his gaze. He spins and waltzes into the barn, where Jenny waltzes across the meadow to him. Jenny reclines awake in a hammock, accompanied by Forrest and Jenny skipping together. She shatters a vase, collapses onto the steps, and whispers, while Forrest lounges beside her. They perch on a boulder together, and later, Jenny perches by the lamp and gazes through the curtain. Forrest opens his eyes as he reclines in the hammock. Jenny places a bundle of socks in his hands as they perch on a bench together overlooking the forest, and Jenny wraps her scarf around Forrest. She mutes the radio and skips outside. Forrest rises, picks up his lemonade, and observes Jenny skipping toward the ladder. Forrest pivots and skips toward the gate, while Jenny pivots and skips up the ladder. Forrest lingers outside as the barn stands in the storm. He curls up in the hammock as the window slides open and Jenny settles into the hammock beside him. Jenny and Forrest hug, and Jenny removes her cardigan as they embrace. Jenny clutches her satchel and skips toward a departing tram that rolls away while Forrest snores in his hammock. The trophy rests on a chair by a chess board as Forrest sips a cup of tea and dons his overalls, regarding the trophy he had handed to Jenny. Jenny's hammock is arranged, so Forrest lingers in the archway regarding the room and hammock where Jenny had been, standing still as if lost in thought. Forrest lounges on a swing with his hiking boots on and slowly dons his Bubba-Gump beanie. He rises, strolls off the deck, and begins to sprint across the meadow, with his pace quickening as he bounds farther away. Forrest sprints down the trail away from his barn, sprints to the edge of the trail, veers left, and dashes down the boulevard. Three women lounge as they listen to the radio while Forrest dashes through the square of town, past the banner, and onto the dock. He sprints to a dock at the Pacific Ocean, where a beacon stands at the edge. Forrest sprints across the dock, continues sprinting along the boulevard, and down a trail between fields of sunflowers, passing a foothill creek."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "At the bread-tasting event, a firefighter hands a map to Charlie's grandma, who unfolds it surrounded by her many parrots, gazes at the postcard, and swoons. A window slides open as a green robot hands Charlie's grandma some pancakes. Alex paddles the canoe, and as he jumps onto the dock, he glances up the alley. Clara's silhouette jogs and then dissolves, causing Alex to glance away. He pivots and marches into the cabin, where Clara skips across the meadow to him. Clara dozes in the hammock, followed by Alex and Clara hopping together. She cracks a mirror, crumples onto the sand and wails, and Alex crouches beside her. They recline on a roof together, and later, Clara rests by the stack of books and peers out the skylight. Alex shuts his eyes as he relaxes on the deck. Clara drops a bundle of purple socks in his lap as they lounge on a boulder together peering at the lake, and Clara wraps her scarf around Alex. She dims the lamp and strolls indoors. Alex rises, sets down his lemonade, and observes Clara stroll toward the ladder. Alex pivots and marches toward the gate, while Clara pivots and ascends the ladder. Alex stands in the garden as the shed stands in the fog. He reclines on the sofa as the window slides open and Clara climbs onto the sofa next to him. Clara and Alex embrace, and Clara removes her hat as they cuddle. Clara grabs her backpack and strides toward a parked bicycle that rolls away while Alex dreams in his hammock. The Golden Bracelet rests on a shelf by a chess piece as Alex sips a mug of tea and wears his slippers, eyeing the bracelet he had handed to Clara. Clara's sofa is tidy, so Alex stands at the threshold eyeing the room and sofa where Clara had lounged, standing motionless as if in a stupor. Alex sits on a swing with his hiking boots on and slowly dons his Dinosaur-Bone helmet. He rises, steps off the deck, and commences to sprint across the meadow, with his pace quickening as he jogs farther onward. Alex sprints along the avenue away from his cabin, sprints to the end of the lane, turns left, and sprints along the boulevard. Three cats lounge as they listen to the radio while Alex sprints through the central plaza of the village, beneath the banner, and onto the boardwalk. He sprints to a jetty at the Pacific Ocean, where a windmill stands at the edge. Alex sprints along the boardwalk, persists in sprinting along the boulevard, and down a path between fields of sunflowers, passing a desert canyon."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "At a ribbon-cutting ceremony, a postman delivers a letter to Bubba's mom, who faints after seeing the check. A white woman serves shrimp to Bubba's mom. Forrest rides a mower, sees Jenny's image vanish, and later, Jenny walks to him. Jenny breaks a window, and Forrest comforts her. They sit together before Jenny gives Forrest Nike running shoes. She walks outside as Forrest watches and later gets into bed with him. They kiss, make love, and Jenny departs in a cab while Forrest sleeps. The Congressional Medal lies near a ping-pong paddle as Forrest, in his bathrobe, reminisces. With Jenny gone, Forrest sits in a rocking chair, dons his Bubba-Gump cap, and begins jogging. He runs down his driveway, through town, and alongside a lighthouse and a mountain river, continuing his journey."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Forrest runs across the pier continues running along the highway and down a road between fields of wheat passing a mountain river He runs to a pier at the Atlantic Ocean where a lighthouse stands at the end Three men sit as they watch the television while Forrest runs through the main street of town under the sign and onto the pier Forrest runs down the driveway away from his house runs to the end of the drive turns right and runs down the highway He stands walks off the porch and begins to jog across the lawn with his speed increasing as he runs farther away Forrest sits on a rocking chair with his running shoes on and slowly puts on his BubbaGump cap Jenny's bed is made so Forrest stands in the doorway looking at the room and bed where Jenny had been standing still as if in a trance The Congressional Medal lies on a table by a pingpong paddle as Forrest holds a glass of milk and wears his bathrobe looking at the medal he had given to Jenny Jenny carries her purse and walks toward a waiting cab that drives away while Forrest is asleep in his bed Jenny and Forrest kiss and Jenny takes off her nightgown as they make love He lies in bed as the door opens and Jenny gets into bed next to him Forrest stands outside as the house stands in the rain Forrest turns and walks toward the door while Jenny turns and walks up the stairs Forrest stands puts down his Dr Pepper and watches Jenny walk toward the stairs She turns off the TV and walks outside Jenny places a box of Nike running shoes in his lap as they sit on a log together looking at the river and Jenny places her arms around Forrest Forrest closes his eyes as he sits on the porch They sit on a limb together and later Jenny sits by the vase of flowers and looks out the window She breaks a window collapses to the ground and sobs and Forrest kneels down next to her Jenny lies asleep in bed followed by Forrest and Jenny walking together He turns and walks into the house where Jenny walks across the lawn to him Jenny's image walks and then vanishes causing Forrest to look away Forrest rides the mower and as he steps onto the porch he looks down the road A door opens as a white woman serves Bubba's mom some shrimp many children looks at the check and faints At the ribboncutting ceremony a postman delivers a letter to Bubba's mom who opens it surrounded by her"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Jenny and Forrest kiss and Jenny takes off her nightgown as they make love Forrest stands puts down his Dr Pepper and watches Jenny walk toward the stairs Forrest closes his eyes as he sits on the porch Forrest runs across the pier continues running along the highway and down a road between fields of wheat passing a mountain river Jenny's bed is made so Forrest stands in the doorway looking at the room and bed where Jenny had been standing still as if in a trance Jenny lies asleep in bed followed by Forrest and Jenny walking together He turns and walks into the house where Jenny walks across the lawn to him Jenny places a box of Nike running shoes in his lap as they sit on a log together looking at the river and Jenny places her arms around Forrest He lies in bed as the door opens and Jenny gets into bed next to him Forrest runs down the driveway away from his house runs to the end of the drive turns right and runs down the highway She turns off the TV and walks outside The Congressional Medal lies on a table by a pingpong paddle as Forrest holds a glass of milk and wears his bathrobe looking at the medal he had given to Jenny many children looks at the check and faints Forrest stands outside as the house stands in the rain Three men sit as they watch the television while Forrest runs through the main street of town under the sign and onto the pier Forrest turns and walks toward the door while Jenny turns and walks up the stairs A door opens as a white woman serves Bubba's mom some shrimp Jenny carries her purse and walks toward a waiting cab that drives away while Forrest is asleep in his bed He runs to a pier at the Atlantic Ocean where a lighthouse stands at the end Jenny's image walks and then vanishes causing Forrest to look away He stands walks off the porch and begins to jog across the lawn with his speed increasing as he runs farther away She breaks a window collapses to the ground and sobs and Forrest kneels down next to her They sit on a limb together and later Jenny sits by the vase of flowers and looks out the window At the ribboncutting ceremony a postman delivers a letter to Bubba's mom who opens it surrounded by her Forrest rides the mower and as he steps onto the porch he looks down the road Forrest sits on a rocking chair with his running shoes on and slowly puts on his BubbaGump cap"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Forrest turns and walks toward the door while Jenny turns and walks up the stairs Forrest stands outside as the house stands in the rain He lies in bed as the door opens and Jenny gets into bed next to him Jenny and Forrest kiss and Jenny takes off her nightgown as they make love Jenny carries her purse and walks toward a waiting cab that drives away while Forrest is asleep in his bed The Congressional Medal lies on a table by a pingpong paddle as Forrest holds a glass of milk and wears his bathrobe looking at the medal he had given to Jenny Jenny's bed is made so Forrest stands in the doorway looking at the room and bed where Jenny had been standing still as if in a trance Forrest sits on a rocking chair with his running shoes on and slowly puts on his BubbaGump cap He stands walks off the porch and begins to jog across the lawn with his speed increasing as he runs farther away Forrest runs down the driveway away from his house runs to the end of the drive turns right and runs down the highway Three men sit as they watch the television while Forrest runs through the main street of town under the sign and onto the pier He runs to a pier at the Atlantic Ocean where a lighthouse stands at the end Forrest runs across the pier continues running along the highway and down a road between fields of wheat passing a mountain river At the ribboncutting ceremony a postman delivers a letter to Bubba's mom who opens it surrounded by her many children looks at the check and faints A door opens as a white woman serves Bubba's mom some shrimp Forrest rides the mower and as he steps onto the porch he looks down the road Jenny's image walks and then vanishes causing Forrest to look away He turns and walks into the house where Jenny walks across the lawn to him Jenny lies asleep in bed followed by Forrest and Jenny walking together She breaks a window collapses to the ground and sobs and Forrest kneels down next to her They sit on a limb together and later Jenny sits by the vase of flowers and looks out the window Forrest closes his eyes as he sits on the porch Jenny places a box of Nike running shoes in his lap as they sit on a log together looking at the river and Jenny places her arms around Forrest She turns off the TV and walks outside Forrest stands puts down his Dr Pepper and watches Jenny walk toward the stairs"
        }
      ]
    }
  ]
}