{
  "ground_truth": "A wave crashes against a rock in a bay as bright sunlight shines through clouds. Mountains give way to dense trees, above which a bell tower rises. Fluffy white clouds float in a blue sky, and below lies the ever-changing landscape of the United States of America, including lush mountains, densely packed cities, and vast patchworks of fields. The screen splits to show more aerial views: a coastal city, a freeway cutting across lush parkland, a meandering river, and circular fields spread across the land, with snow-capped mountains and a jagged, rocky coastline. A jet comes in to land on the runway. Meanwhile, a thick-set man in a suit, Steve, clears a table, shreds documents, pours bleach in a coffee jar, and aims a rifle at the office. Ryan Bingham, a suavely seated man in his late 40s with neat graying hair and a side parting, interacts with Steve, who hands over his key card at the door. In a hotel room, Ryan packs a suitcase with military precision, studies a pouch full of ties, closes it, and puts it in the case. He zips up the suitcase, pulls out its handle, drags it out of the room, and switches off the light as he goes. At an airport, Ryan drops off a rental car and walks up to the First Class priority access desk, grabs his boarding pass, and shows it to a security guard. He puts his case on a table, grabs two gray plastic trays, and places his laptop, shoes, and suit jacket into them. He steps through the walk-through metal detector, holding up his boarding pass, and passes the security check. Ryan puts his jacket and shoes back on, zips up his case, pulls out the handle, and walks off with it. A jet flies above a blanket of fluffy white clouds, and Ryan sits in First Class, watching a flight attendant walk down the aisle pushing a trolley. She hands a passenger a drink, Ryan looks up at her, frowning, and she places the can of soda back on the trolley before walking on. Ryan smiles. The jet comes in to land, and Ryan unzips a backpack and stands behind a lectern, smiling at a few delegates seated at long tables. At the airport, Ryan walks up to a desk with a sign beside it, shows a card, then drags his case into a lounge where he sits in a leather armchair, looks at a piece of paper, and makes a phone call, after which he looks surprised. Dallas at night displays a vast city of lights as an American Airlines jet taxis at the airport.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "A surge crashes against a stone in a cove as radiant sunshine beams through clouds. Peaks yield to thick trees, above which a chime tower ascends. Puffy white clouds drift in a cerulean sky, and beneath lies the ever-changing scenery of the United States of America, including verdant mountains, densely populated metropolises, and extensive mosaics of fields. The display divides to show additional aerial vistas: a littoral metropolis, a highway slicing across verdant parkland, a winding river, and circular fields strewn across the terrain, with snow-topped peaks and a rugged, craggy shoreline. A plane approaches to land on the runway. Meanwhile, a burly man in a suit, Steve, clears a table, shreds papers, pours bleach in a coffee jar, and aims a firearm at the office. Ryan Bingham, a suavely seated man in his late 40s with neat graying hair and a side parting, engages with Steve, who hands over his key card at the doorway. In a hotel room, Ryan packs a suitcase with military precision, examines a pouch full of ties, closes it, and places it in the case. He zips up the suitcase, pulls out its handle, drags it out of the room, and switches off the light as he departs. At an airport, Ryan drops off a rental automobile and walks up to the First Class priority access counter, grabs his boarding pass, and shows it to a security guard. He places his case on a table, grabs two gray plastic trays, and positions his laptop, footwear, and suit jacket into them. He steps through the walk-through metal detector, holding up his boarding pass, and passes the security check. Ryan puts his jacket and shoes back on, zips up his case, pulls out the handle, and walks off with it. A jet flies above a blanket of fluffy white clouds, and Ryan sits in First Class, observing a flight attendant walk down the aisle pushing a cart. She hands a passenger a beverage, Ryan looks up at her, frowning, and she places the can of soda back on the cart before walking on. Ryan smiles. The jet approaches to land, and Ryan unzips a backpack and stands behind a lectern, smiling at a few delegates seated at long tables. At the airport, Ryan walks up to a counter with a sign beside it, shows a card, then drags his case into a lounge where he sits in a leather armchair, looks at a piece of paper, and makes a phone call, after which he looks astonished. Dallas at night displays a vast metropolis of lights as an American Airlines jet taxis at the airport."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "A wave is crashed against a rock in a bay as bright sunlight is shone through clouds. Dense trees are given way to by mountains, above which a bell tower is risen. Fluffy white clouds are floated in a blue sky, and the ever-changing landscape of the United States of America is laid below, including lush mountains, densely packed cities, and vast patchworks of fields. The screen splits to be shown more aerial views: a coastal city, a freeway is cut across lush parkland, a meandering river, and circular fields spread across the land, with snow-capped mountains and a jagged, rocky coastline. The runway is landed on by a jet. Meanwhile, Steve, a thick-set man in a suit, clears a table, shreds documents, pours bleach in a coffee jar, and aims a rifle at the office. Ryan Bingham, a suavely seated man in his late 40s with neat graying hair and a side parting, interacts with Steve, who is handed over his key card at the door by Ryan. In a hotel room, a suitcase is packed by Ryan with military precision, and he studies a pouch full of ties, closes it, and puts it in the case. The suitcase is zipped up, and Ryan pulls out its handle, drags it out of the room, and switches off the light as he goes. At an airport, a rental car is dropped off by Ryan, and he walks up to the First Class priority access desk, grabs his boarding pass, and shows it to a security guard. His case is put on a table, and he grabs two gray plastic trays, placing his laptop, shoes, and suit jacket into them. The walk-through metal detector is stepped through by him, holding up his boarding pass, and he passes the security check. Ryan puts his jacket and shoes back on, zips up his case, pulls out the handle, and walks off with it. A blanket of fluffy white clouds is flown above by a jet, and Ryan sits in First Class, watching a flight attendant walk down the aisle, pushing a trolley. A drink is handed to a passenger by her, Ryan looks up at her, frowning, and the can of soda is placed back on the trolley by her before she walks on. Ryan smiles. The jet lands, and Ryan unzips a backpack and stands behind a lectern, smiling at a few delegates seated at long tables. At the airport, Ryan walks up to a desk with a sign beside it, shows a card, then drags his case into a lounge where he sits in a leather armchair, looks at a piece of paper, and makes a phone call, after which he is surprised. A vast city of lights in Dallas at night is displayed as an American Airlines jet taxis at the airport."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "A wave crashes against a rock in a bay as sunlight pierces clouds. Mountains transition to dense trees, above which a bell tower stands. Fluffy clouds float in a blue sky over the diverse U.S. landscape, including lush mountains, cities, and fields. The screen splits to show aerial views: a coastal city, a freeway through parkland, a river, circular fields, snow-capped mountains, and a rocky coastline. A jet lands on the runway. Meanwhile, Steve, a thick-set man in a suit, clears a table, shreds documents, pours bleach in a coffee jar, and aims a rifle at the office. Ryan Bingham, a suave man in his late 40s with neat graying hair, interacts with Steve, who hands over his key card. In a hotel room, Ryan packs a suitcase with precision, studies ties, and zips up the case, leaving the room. At an airport, Ryan returns a rental car, approaches the First Class desk, grabs his boarding pass, and shows it to security. He places his laptop, shoes, and jacket in trays, passes through the metal detector, and retrieves his items. Ryan sits in First Class, watching a flight attendant serve drinks. She places a soda back on the trolley, and Ryan smiles. The jet lands, and Ryan stands behind a lectern, smiling at delegates. At the airport, Ryan shows a card, enters a lounge, sits in a leather armchair, makes a phone call, and looks surprised. Dallas at night reveals a city of lights as an American Airlines jet taxis."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "A wave crashes against a rock in a bay as sunlight shines through clouds. Mountains lead to dense trees, above which a bell tower rises. Fluffy clouds float in a blue sky over the U.S., featuring lush mountains, cities, and fields. The screen splits to show aerial views: a coastal city, freeway, river, circular fields, snow-capped mountains, and rocky coastline. A jet lands. Meanwhile, Steve, a thick-set man in a suit, clears a table, shreds documents, pours bleach in a coffee jar, and aims a rifle at the office. Ryan Bingham, a man in his late 40s with neat graying hair, interacts with Steve, who hands over his key card. In a hotel room, Ryan packs a suitcase, studies ties, and switches off the light. At an airport, Ryan drops off a rental car, grabs his boarding pass, and passes security. He puts his jacket and shoes back on, zips up his case, and walks off. A jet flies above clouds, and Ryan sits in First Class, watching a flight attendant. She hands a drink to a passenger, Ryan frowns, and she places the soda back on the trolley. Ryan smiles. The jet lands, and Ryan stands behind a lectern, smiling at delegates. At the airport, Ryan shows a card, enters a lounge, sits in a leather armchair, makes a phone call, and looks surprised. Dallas at night shows a city of lights as an American Airlines jet taxis."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "A powerful wave crashes dramatically against a sturdy rock situated in a picturesque bay, as the bright, golden sunlight filters through the scattered clouds above. Majestic mountains gradually transition into a dense forest of trees, above which a prominent bell tower rises gracefully. Fluffy, white clouds float serenely in the expansive blue sky, and below lies the ever-changing and diverse landscape of the United States of America. This includes lush, verdant mountains, densely packed urban cities, and vast, sprawling patchworks of agricultural fields. The screen then splits to reveal additional breathtaking aerial views: a bustling coastal city, a freeway cutting a path across lush parkland, a meandering river winding its way through the terrain, and circular fields spread across the land, all set against a backdrop of snow-capped mountains and a jagged, rocky coastline. A sleek jet comes in to land smoothly on the runway. Meanwhile, a thick-set man dressed in a suit, named Steve, is seen clearing a table, meticulously shredding documents, pouring bleach into a coffee jar, and aiming a rifle at the office. Ryan Bingham, a suavely seated man in his late 40s with neatly groomed graying hair and a precise side parting, interacts with Steve, who hands over his key card at the door. In a hotel room, Ryan packs a suitcase with military precision, carefully studies a pouch full of ties, closes it, and places it in the case. He zips up the suitcase, pulls out its handle, drags it out of the room, and switches off the light as he departs. At an airport, Ryan efficiently drops off a rental car and walks up to the First Class priority access desk, where he grabs his boarding pass and shows it to a security guard. He places his case on a table, grabs two gray plastic trays, and places his laptop, shoes, and suit jacket into them. He steps through the walk-through metal detector, holding up his boarding pass, and successfully passes the security check. Ryan then puts his jacket and shoes back on, zips up his case, pulls out the handle, and walks off with it. A jet flies high above a blanket of fluffy white clouds, and Ryan sits comfortably in First Class, watching a flight attendant walk gracefully down the aisle, pushing a trolley. She hands a passenger a drink, and Ryan looks up at her, frowning slightly, as she places the can of soda back on the trolley before continuing on her way. Ryan smiles. The jet comes in to land, and Ryan unzips a backpack and stands confidently behind a lectern, smiling at a few delegates seated at long tables. At the airport, Ryan walks up to a desk with a sign beside it, shows a card, then drags his case into a lounge where he sits in a comfortable leather armchair, looks at a piece of paper, and makes a phone call, after which he looks surprised. The city of Dallas at night displays a vast, sprawling cityscape of twinkling lights as an American Airlines jet taxis at the airport."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "A powerful and enormous wave, with an impressive force, crashes dramatically and with great energy against a sturdy and resilient rock that is situated prominently in a picturesque and idyllic bay. This marvel of nature occurs as the bright, golden sunlight filters down gently through the scattered, cotton-like clouds above. Majestic and awe-inspiring mountains gradually transition into a dense and vibrant forest of trees, above which a prominent and distinguished bell tower rises gracefully and elegantly. Fluffy, white clouds float serenely and leisurely across the expansive blue sky, and below lies the ever-changing and diverse landscape of the United States of America. This captivating landscape includes lush, verdant mountains, densely packed urban cities, and vast, sprawling patchworks of agricultural fields. The screen then splits to reveal additional breathtaking aerial views: a bustling and active coastal city, a freeway cutting a precise path across lush and verdant parkland, a meandering river winding its way thoughtfully through the varied terrain, and circular fields spread across the land, all set against a backdrop of snow-capped mountains and a jagged, rocky coastline that extends dramatically. A sleek jet is seen coming in to land smoothly and effortlessly on the runway. Meanwhile, a thick-set man dressed formally in a suit, known as Steve, is seen diligently clearing a table, meticulously shredding sensitive documents, pouring bleach into a coffee jar, and aiming a rifle at the office. Ryan Bingham, a suavely seated man in his late 40s with neatly groomed graying hair and a precise side parting, interacts with Steve, who hands over his key card at the door. In a tidy hotel room, Ryan packs a suitcase with the precision of a military operation, carefully studies a pouch full of ties, closes it with care, and places it in the case. He zips up the suitcase efficiently, pulls out its handle, drags it confidently out of the room, and then skillfully switches off the light as he departs. At an airport, Ryan efficiently drops off a rental car and walks up to the First Class priority access desk, where he grabs his boarding pass and shows it with assurance to a security guard. He places his case on a table, grabs two gray plastic trays, and places his laptop, shoes, and suit jacket into them. He then steps through the walk-through metal detector, holding up his boarding pass, and successfully passes the security check. Ryan then puts his jacket and shoes back on, zips up his case with satisfaction, pulls out the handle, and walks off with it. A jet flies high above a blanket of fluffy white clouds, and Ryan sits comfortably and contentedly in First Class, watching a flight attendant walk gracefully down the aisle, pushing a trolley. She hands a passenger a drink, and Ryan looks up at her, frowning slightly, as she places the can of soda back on the trolley before continuing gracefully on her way. Ryan smiles. The jet comes in to land, and Ryan unzips a backpack and stands confidently behind a lectern, smiling at a few delegates seated at long tables. At the airport, Ryan walks up to a desk with a sign beside it, shows a card, then drags his case into a plush lounge where he sits comfortably in a leather armchair, looks thoughtfully at a piece of paper, and makes a phone call, after which he looks surprised. The city of Dallas at night displays a vast, sprawling cityscape of twinkling lights, creating a mesmerizing scene, as an American Airlines jet taxis smoothly at the airport."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "A powerful wave surges forward and crashes forcefully against a rugged rock situated in a bay, while the bright sunlight pierces through the scattered clouds above, casting a radiant glow. The majestic mountains gradually transition into a dense forest of trees, towering over which a solitary bell tower stands prominently. Fluffy white clouds drift lazily across the expansive blue sky, beneath which unfolds the diverse and ever-changing landscape of the United States of America, showcasing lush, verdant mountains, densely packed urban cities, and vast, meticulously arranged patchworks of agricultural fields. The screen then splits to reveal additional aerial views, presenting a coastal city nestled by the sea, a freeway that slices through lush parkland, a river that meanders gracefully through the terrain, and circular fields that are spread across the land, all set against the backdrop of snow-capped mountains and a jagged, rocky coastline. A jet descends gracefully from the sky, aligning itself with the runway as it prepares to land. Meanwhile, in a different scene, a thick-set man dressed in a suit, named Steve, methodically clears a table, meticulously shreds documents, pours bleach into a coffee jar with deliberate precision, and then aims a rifle towards the office with focused intent. In another setting, Ryan Bingham, a man in his late 40s with neatly groomed graying hair and a side parting, sits suavely and engages with Steve, who hands over his key card at the door with a sense of finality. In a hotel room, Ryan meticulously packs a suitcase with military precision, carefully studies a pouch full of ties, closes it with satisfaction, and places it neatly into the case. He then zips up the suitcase, extends its handle, and drags it out of the room, ensuring to switch off the light as he exits. At the airport, Ryan efficiently drops off a rental car and strides confidently up to the First Class priority access desk, where he retrieves his boarding pass and presents it to a security guard with assurance. He places his case on a table, deftly grabs two gray plastic trays, and places his laptop, shoes, and suit jacket into them with practiced ease. He steps through the walk-through metal detector, holding up his boarding pass, and successfully passes the security check. Ryan then puts his jacket and shoes back on, zips up his case, extends the handle once more, and walks off with it purposefully. A jet soars above a blanket of fluffy white clouds, and inside, Ryan sits comfortably in First Class, observing as a flight attendant walks down the aisle, pushing a trolley. She hands a drink to a passenger, and Ryan looks up at her with a frown, prompting her to place the can of soda back on the trolley before continuing on her way, to which Ryan responds with a smile. The jet descends and lands smoothly, and Ryan unzips a backpack and stands confidently behind a lectern, smiling warmly at a few delegates seated at long tables. Back at the airport, Ryan approaches a desk with a sign beside it, presents a card, and then drags his case into a lounge where he settles into a leather armchair, examines a piece of paper, and makes a phone call, after which he appears surprised. The scene shifts to Dallas at night, revealing a vast cityscape illuminated by countless lights as an American Airlines jet taxis at the airport, completing its journey."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "A wave crashes against a rock in a bay as bright sunlight filters through clouds, revealing a landscape of mountains, dense trees, and a bell tower. Fluffy clouds drift across a blue sky, showcasing the diverse terrain of the United States, from lush mountains and bustling cities to expansive fields. The screen splits to reveal aerial views of a coastal city, a freeway through parkland, a winding river, circular fields, snow-capped mountains, and a rugged coastline. A jet lands on a runway. Meanwhile, Steve, a thick-set man in a suit, efficiently clears a table, shreds documents, pours bleach into a coffee jar, and aims a rifle at the office. Ryan Bingham, a well-groomed man in his late 40s, interacts with Steve, who hands over his key card. In a hotel room, Ryan meticulously packs a suitcase, selects ties, and exits, switching off the light. At the airport, he returns a rental car, proceeds to the First Class desk, and clears security with ease. He reassembles his belongings and moves on. A jet flies above clouds as Ryan sits in First Class, observing a flight attendant serve drinks. She returns a soda to the trolley, and Ryan smiles. Upon landing, Ryan unzips a backpack and addresses delegates from a lectern. Later, at the airport, he enters a lounge, reviews a paper, makes a phone call, and appears surprised. The scene shifts to a nighttime view of Dallas, with city lights sprawling as an American Airlines jet taxis at the airport."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "A wave crashes against a rock in a bay, reminiscent of the rugged coastlines of Maine known for their rocky shores, as bright sunlight shines through clouds. Mountains, perhaps similar to the Appalachian range with their rich biodiversity, give way to dense trees, above which a bell tower reminiscent of the historic missions in California rises. Fluffy white clouds float in a blue sky, and below lies the ever-changing landscape of the United States of America, a country known for its geographic diversity, including lush mountains, densely packed cities like New York City with its iconic skyline, and vast patchworks of fields similar to those found in the Midwest. The screen splits to show more aerial views: a coastal city resembling San Francisco with its famous Golden Gate Bridge, a freeway cutting across lush parkland common in the Pacific Northwest, a meandering river akin to the Mississippi, and circular fields spread across the land, often seen in agricultural areas like Kansas, with snow-capped mountains resembling the Rockies and a jagged, rocky coastline such as that of the Pacific Northwest. A jet, likely a commercial airliner from a major carrier like Delta, comes in to land on the runway. Meanwhile, a thick-set man in a suit, Steve, clears a table, shreds documents, a common practice for confidentiality, pours bleach in a coffee jar to erase any traces, and aims a rifle at the office, suggesting a tense, clandestine operation. Ryan Bingham, a suavely seated man in his late 40s with neat graying hair and a side parting, interacts with Steve, who hands over his key card, a standard security measure, at the door. In a hotel room that might belong to a well-known chain like Marriott, Ryan packs a suitcase with military precision, studies a pouch full of ties, a necessity in corporate culture, closes it, and puts it in the case. He zips up the suitcase, pulls out its handle, drags it out of the room, and switches off the light as he goes, in a habit of energy conservation. At an airport, likely one of the major hubs such as JFK, Ryan drops off a rental car from a company like Hertz and walks up to the First Class priority access desk, grabs his boarding pass, and shows it to a security guard, part of the TSA protocol. He puts his case on a table, grabs two gray plastic trays used for security screening, and places his laptop, shoes, and suit jacket into them. He steps through the walk-through metal detector, holding up his boarding pass, and passes the security check, a routine United States airport experience. Ryan puts his jacket and shoes back on, zips up his case, pulls out the handle, and walks off with it. A jet flies above a blanket of fluffy white clouds, and Ryan sits in First Class, enjoying the luxury provided by airlines like American Airlines, watching a flight attendant walk down the aisle pushing a trolley. She hands a passenger a drink, Ryan looks up at her, frowning, and she places the can of soda back on the trolley before walking on. Ryan smiles. The jet comes in to land, and Ryan unzips a backpack and stands behind a lectern, smiling at a few delegates seated at long tables, perhaps at a business conference. At the airport, Ryan walks up to a desk with a sign beside it, shows a card for frequent flyers, then drags his case into a lounge, a feature of major airports, where he sits in a leather armchair, looks at a piece of paper, and makes a phone call, after which he looks surprised. Dallas at night displays a vast city of lights as an American Airlines jet, a major airline headquartered in this city, taxis at the airport."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "A wave crashes against a rock in a bay as bright sunlight shines through clouds  Mountains give way to dense trees above which a bell tower rises  Fluffy white clouds float in a blue sky and below lies the everchanging landscape of the United States of America including lush mountains densely packed cities and vast patchworks of fields  At an airport Ryan drops off a rental car and walks up to the First Class priority access desk grabs his boarding pass and shows it to a security guard  He puts his case on a table grabs two gray plastic trays and places his laptop shoes and suit jacket into them  He steps through the walkthrough metal detector holding up his boarding pass and passes the security check  Ryan puts his jacket and shoes back on zips up his case pulls out the handle and walks off with it  A jet flies above a blanket of fluffy white clouds and Ryan sits in First Class watching a flight attendant walk down the aisle pushing a trolley  She hands a passenger a drink  Ryan looks up at her frowning and she places the can of soda back on the trolley before walking on  Ryan smiles  The jet comes in to land and Ryan unzips a backpack and stands behind a lectern smiling at a few delegates seated at long tables  At the airport Ryan walks up to a desk with a sign beside it shows a card then drags his case into a lounge where he sits in a leather armchair looks at a piece of paper and makes a phone call after which he looks surprised  Dallas at night displays a vast city of lights as an American Airlines jet taxis at the airport The screen splits to show more aerial views a coastal city a freeway cutting across lush parkland a meandering river and circular fields spread across the land with snowcapped mountains and a jagged rocky coastline  A jet comes in to land on the runway  Meanwhile a thickset man in a suit Steve clears a table shreds documents pours bleach in a coffee jar and aims a rifle  at the office  Ryan Bingham a suavely seated man in his late 40s with neat graying hair and a side parting interacts with Steve who hands over his key card at the door  In a hotel room Ryan packs a suitcase with military precision studies a pouch full of ties closes it and puts it in the case  He zips up the suitcase pulls out its handle drags it out of the room and switches off the light as he goes  At an airport Ryan drops off a rental car and walks up to the First Class priority access desk grabs his boarding pass and shows it to a security guard  He puts his case on a table grabs two gray plastic trays and places his laptop shoes and suit jacket into them  He steps through the walkthrough metal detector holding up his boarding pass and passes the security check  Ryan puts his jacket and shoes back on zips up his case pulls out the handle and walks off with it  A jet flies above a blanket of fluffy white clouds and Ryan sits in First Class watching a flight attendant walk down the aisle pushing a trolley  She hands a passenger a drink  Ryan looks up at her frowning and she places the can of soda back on the trolley before walking on  Ryan smiles  The jet comes in to land and Ryan unzips a backpack and stands behind a lectern smiling at a few delegates seated at long tables  At the airport Ryan walks up to a desk with a sign beside it shows a card then drags his case into a lounge where he sits in a leather armchair looks at a piece of paper and makes a phone call after which he looks surprised  Dallas at night displays a vast city of lights as an American Airlines jet taxis at the airport"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "A wave crashes against a rock in a bay as bright sunlight shines through clouds. Mountains give way to dense trees above which a bell tower rises. Fluffy white clouds float in a blue sky and below lies the everchanging landscape of the United States of America including lush mountains densely packed cities and vast patchworks of fields. The screen splits to show more aerial views a coastal city a freeway cutting across lush parkland a meandering river and circular fields spread across the land with snowcapped mountains and a jagged rocky coastline. A jet comes in to land on the runway. Meanwhile a thickset man in a suit Steve clears a table shreds documents pours bleach in a coffee jar and aims a rifle. at the office. Ryan Bingham a suavely seated man in his late 40s with neat graying hair and a side parting interacts with Steve who hands over his key card at the door. In a hotel room Ryan packs a suitcase with military precision studies a pouch full of ties closes it and puts it in the case. He zips up the suitcase pulls out its handle drags it out of the room and switches off the light as he goes. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. At an airport Ryan drops off a rental car and walks up to the First Class priority access desk grabs his boarding pass and shows it to a security guard. He puts his case on a table grabs two gray plastic trays and places his laptop shoes and suit jacket into them. He steps through the walkthrough metal detector holding up his boarding pass and passes the security check. Ryan puts his jacket and shoes back on zips up his case pulls out the handle and walks off with it. A jet flies above a blanket of fluffy white clouds and Ryan sits in First Class watching a flight attendant walk down the aisle pushing a trolley. She hands a passenger a drink. Ryan looks up at her frowning and she places the can of soda back on the trolley before walking on. Ryan smiles. The jet comes in to land and Ryan unzips a backpack and stands behind a lectern smiling at a few delegates seated at long tables. At the airport Ryan walks up to a desk with a sign beside it shows a card then drags his case into a lounge where he sits in a leather armchair looks at a piece of paper and makes a phone call after which he looks surprised. Dallas at night displays a vast city of lights as an American Airlines jet taxis at the airport."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "A wave crashes against a rock in a bay as bright sunlight shines through clouds. Mountains give way to dense trees above which a bell tower rises. Fluffy white clouds float in a blue sky and below lies the everchanging landscape of the United States of America including lush mountains densely packed cities and vast patchworks of fields. The screen splits to show more aerial views a coastal city a freeway cutting across lush parkland a meandering river and circular fields spread across the land with snowcapped mountains and a jagged rocky coastline. A jet comes in to land on the runway. Meanwhile a thickset man in a suit Steve clears a table shreds documents pours bleach in a coffee jar and aims a rifle. at the office. Ryan Bingham a suavely seated man in his late 40s with neat graying hair and a side parting interacts with Steve who hands over his key card at the door. In a hotel room Ryan packs a suitcase with military precision studies a pouch full of ties closes it and puts it in the case. He zips up the suitcase pulls out its handle drags it out of the room and switches off the light as he goes. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. At an airport Ryan drops off a rental car and walks up to the First Class priority access desk grabs his boarding pass and shows it to a security guard. He puts his case on a table grabs two gray plastic trays and places his laptop shoes and suit jacket into them. He steps through the walkthrough metal detector holding up his boarding pass and passes the security check. Ryan puts his jacket and shoes back on zips up his case pulls out the handle and walks off with it. A jet flies above a blanket of fluffy white clouds and Ryan sits in First Class watching a flight attendant walk down the aisle pushing a trolley. She hands a passenger a drink. Ryan looks up at her frowning and she places the can of soda back on the trolley before walking on. Ryan smiles. The jet comes in to land and Ryan unzips a backpack and stands behind a lectern smiling at a few delegates seated at long tables. At the airport Ryan walks up to a desk with a sign beside it shows a card then drags his case into a lounge where he sits in a leather armchair looks at a piece of paper and makes a phone call after which he looks surprised. Dallas at night displays a vast city of lights as an American Airlines jet taxis at the airport."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "A wave crashes against a rock in a bay as bright sunlight shines through clouds. Mountains give way to dense trees above which a bell tower rises. Fluffy white clouds float in a blue sky and below lies the everchanging landscape of the United States of America including lush mountains densely packed cities and vast patchworks of fields. The screen splits to show more aerial views a coastal city a freeway cutting across lush parkland a meandering river and circular fields spread across the land with snowcapped mountains and a jagged rocky coastline. A jet comes in to land on the runway. She hands a passenger a drink. Ryan looks up at her frowning and she places the can of soda back on the trolley before walking on. Ryan smiles. The jet comes in to land and Ryan unzips a backpack and stands behind a lectern smiling at a few delegates seated at long tables. At the airport Ryan walks up to a desk with a sign beside it shows a card then drags his case into a lounge where he sits in a leather armchair looks at a piece of paper and makes a phone call after which he looks surprised. Dallas at night displays a vast city of lights as an American Airlines jet taxis at the airport."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "A wave crashes against a rock in a bay as bright sunlight shines through clouds. Mountains give way to dense trees above which a bell tower rises. The jet comes in to land and Ryan unzips a backpack and stands behind a lectern smiling at a few delegates seated at long tables. At the airport Ryan walks up to a desk with a sign beside it shows a card then drags his case into a lounge where he sits in a leather armchair looks at a piece of paper and makes a phone call after which he looks surprised. Dallas at night displays a vast city of lights as an American Airlines jet taxis at the airport."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "A whale crashes against a rock in a bay as bright sunlight shines through clouds. Eagles give way to dense trees, above which a bell tower rises. Fluffy white clouds float in a blue sky, and below lies the ever-changing landscape of the United States of America, including lush mountains, densely packed cities, and vast patchworks of fields. The screen splits to show more aerial views: a coastal city, a freeway cutting across lush parkland, a meandering river, and circular fields spread across the land, with snow-capped mountains and a jagged, rocky coastline. A kite comes in to land on the runway. Meanwhile, a thick-set lion in a suit, Steve, clears a table, shreds documents, pours bleach in a coffee jar, and aims a rifle at the office. A fox, a suavely seated animal in its late 40s with neat graying fur and a side parting, interacts with Steve, who hands over his key card at the door. In a hotel room, the fox packs a suitcase with military precision, studies a pouch full of ties, closes it, and puts it in the case. It zips up the suitcase, pulls out its handle, drags it out of the room, and switches off the light as it goes. At an airport, the fox drops off a rental car and walks up to the First Class priority access desk, grabs its boarding pass, and shows it to a security guard. It puts its case on a table, grabs two gray plastic trays, and places its laptop, shoes, and suit jacket into them. It steps through the walk-through metal detector, holding up its boarding pass, and passes the security check. The fox puts its jacket and shoes back on, zips up its case, pulls out the handle, and walks off with it. A balloon flies above a blanket of fluffy white clouds, and the fox sits in First Class, watching a flight attendant walk down the aisle pushing a trolley. She hands a passenger a drink, the fox looks up at her, frowning, and she places the can of soda back on the trolley before walking on. The fox smiles. The balloon comes in to land, and the fox unzips a backpack and stands behind a lectern, smiling at a few delegates seated at long tables. At the airport, the fox walks up to a desk with a sign beside it, shows a card, then drags its case into a lounge where it sits in a leather armchair, looks at a piece of paper, and makes a phone call, after which it looks surprised. Dallas at night displays a vast city of lights as an American Airlines kite taxis at the airport."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "A wave crashes against a boulder in a lagoon as bright moonlight shines through curtains. Cliffs give way to dense bushes, above which a water tower rises. Fluffy white balloons float in a green sky, and below lies the ever-changing landscape of the Republic of Australia, including lush canyons, densely packed villages, and vast patchworks of orchards. The screen splits to show more aerial views: an inland town, a highway cutting across lush gardens, a winding canal, and square vineyards spread across the land, with snow-capped cliffs and a jagged, rocky shoreline. A blimp comes in to land on the helipad. Meanwhile, a thick-set man in a uniform, Steve, clears a counter, shreds brochures, pours ink in a teapot, and aims a slingshot at the workshop. Ryan Bingham, a suavely seated man in his late 40s with neat graying hair and a side parting, interacts with Steve, who hands over his access card at the gate. In a motel room, Ryan packs a backpack with military precision, studies a pouch full of watches, closes it, and puts it in the pack. He zips up the backpack, pulls out its handle, drags it out of the room, and switches off the fan as he goes. At a bus depot, Ryan drops off a borrowed bike and walks up to the Business Class priority access booth, grabs his seat ticket, and shows it to a guard. He puts his pack on a counter, grabs two gray plastic baskets, and places his tablet, boots, and blazer into them. He steps through the walk-through glass door, holding up his seat ticket, and passes the security check. Ryan puts his blazer and boots back on, zips up his backpack, pulls out the handle, and walks off with it. A blimp flies above a blanket of fluffy white balloons, and Ryan sits in Business Class, watching a conductor walk down the aisle pushing a cart. She hands a traveler a snack, Ryan looks up at her, frowning, and she places the packet of peanuts back on the cart before walking on. Ryan smiles. The blimp comes in to land, and Ryan unzips a briefcase and stands behind a podium, smiling at a few delegates seated at long benches. At the bus depot, Ryan walks up to a kiosk with a banner beside it, shows a voucher, then drags his pack into a waiting area where he sits in a cushioned stool, looks at a piece of cardboard, and makes a phone call, after which he looks surprised. Perth at night displays a vast city of lanterns as a Qantas blimp taxis at the depot."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "A wave splashes against a rock in a bay as bright sunlight filters through clouds. Mountains transition to dense trees, above which a bell tower looms. Fluffy white clouds drift in a blue sky, and below lies the ever-shifting landscape of the United States of America, including lush mountains, densely packed cities, and expansive patchworks of fields. The screen divides to reveal more aerial views: a coastal city, a freeway slicing through lush parkland, a winding river, and circular fields scattered across the land, with snow-capped mountains and a rugged, rocky coastline. A jet prepares to roll on the runway. Meanwhile, a thick-set man in a suit, Steve, organizes a table, tears documents, spills bleach in a coffee jar, and tosses a rifle at the office. Ryan Bingham, a suavely seated man in his late 40s with neat graying hair and a side parting, chats with Steve, who slides over his key card at the door. In a hotel room, Ryan arranges a suitcase with military precision, inspects a pouch full of ties, snaps it shut, and places it in the case. He buckles the suitcase, pushes down its handle, slides it out of the room, and flips off the light as he goes. At an airport, Ryan returns a rental car and strides up to the First Class priority access desk, snatches his boarding pass, and presents it to a security guard. He sets his case on a table, seizes two gray plastic trays, and deposits his laptop, shoes, and suit jacket into them. He skips through the walk-through metal detector, holding up his boarding pass, and sails through the security check. Ryan slips his jacket and shoes back on, fastens his case, extends the handle, and strides off with it. A jet floats above a blanket of fluffy white clouds, and Ryan sits in First Class, observing a flight attendant stroll down the aisle pushing a trolley. She offers a passenger a drink, Ryan glances up at her, scowling, and she places the can of soda back on the trolley before continuing. Ryan grins. The jet descends to land, and Ryan snaps open a backpack and stands behind a lectern, grinning at a few delegates seated at long tables. At the airport, Ryan approaches a desk with a sign beside it, flashes a card, then rolls his case into a lounge where he settles in a leather armchair, glances at a piece of paper, and punches a phone call, after which he appears startled. Dallas at night reveals a sprawling city of lights as an American Airlines jet glides at the airport."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "A curtain crashes against a pillow in a closet as dim moonlight shines through curtains. Lakes give way to dense shrubs, above which a lamppost rises. Prickly gray hedges float in a green ocean, and below lies the ever-changing mosaic of Spain, including barren valleys, sparsely populated villages, and narrow stripes of rivers. The screen splits to show more subterranean views: a mountainous village, a side street cutting across barren desert, a winding road, and rectangular ponds spread across the ocean, with sun-drenched valleys and a smooth, sandy shoreline. A boat comes in to dock on the pier. Meanwhile, a skinny woman in a dress, Rachel, fills a bag, tears fabrics, pours vinegar in a teacup, and aims a camera at the store. Kevin Parker, a casually standing woman in her early 60s with thick black hair and a top bun, interacts with Rachel, who hands over her passport at the window. In a bookstore, Kevin fills a backpack with artistic randomness, observes a bag full of scarves, closes it, and puts it in the bag. She buttons up the backpack, pulls out its zipper, drags it out of the store, and switches off the fan as she goes. At a bus station, Kevin returns a skateboard and walks up to the Commercial Class priority access desk, grabs her ticket, and shows it to a flight attendant. She puts her bag on a chair, grabs two red cardboard boxes, and places her phone, sandals, and summer hat into them. She steps through the walk-through infrared detector, holding up her ticket, and passes the inspection check. Kevin puts her hat and sandals back on, buttons up her bag, pulls out the zipper, and walks off with it. A boat sails above a meadow of prickly gray hedges, and Kevin sits in Commercial Class, watching a conductor walk down the aisle pushing a suitcase. He hands a visitor a map, Kevin looks up at him, frowning, and he places the bag of chips back on the suitcase before walking on. Kevin smiles. The boat comes in to dock, and Kevin buttons up a briefcase and stands behind a bookshelf, smiling at a few tourists seated at short benches. At the bus station, Kevin walks up to a window with a poster beside it, shows a badge, then drags her bag into a cafeteria where she sits in a plastic stool, looks at a leaflet, and makes a video call, after which she looks confused. Madrid at dawn displays a narrow village of shadows as a British Airways boat drifts at the harbor."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "A squirrel splashes against a wall in a garden as soft moonlight flickers through treetops. Hills surrender to sparse bushes, above which a water tower emerges. Wispy gray mist drifts in a pink sky, and beneath lies the constantly shifting scenery of the United Kingdom, including barren hills, sparsely scattered villages, and dense grids of woods. The screen splits to reveal more aerial perspectives: a rural town, a railway crossing barren moorland, a winding stream, and rectangular orchards dotting the land, with fog-capped hills and a smooth, sandy shoreline. A train comes in to stop at the platform. Meanwhile, a lean woman in a dress, Mary, decorates a shelf, sorts papers, spills ink in a tea cup, and throws a knife at the window. Alex Johnson, a casually reclining woman in her early 50s with curly black hair and a fringe, jokes with Mary, who hands over her access badge at the exit. In a dormitory, Alex arranges a backpack with casual haste, inspects a pouch full of scarves, closes it, and places it in the bag. She snaps shut the backpack, grabs its strap, swings it onto her back, and turns off the fan as she leaves. At a train station, Alex picks up a tram ticket and heads to the Economy Class regular access counter, fetches her ticket stub, and presents it to a conductor. She sets her backpack on a counter, grabs two blue fabric baskets, and puts her tablet, socks, and blazer into them. She steps through the walk-through X-ray scanner, holding up her ticket stub, and completes the security scan. Alex puts her blazer and socks back on, snaps shut her backpack, grabs its strap, and strolls away with it. A train sails above a carpet of wispy gray mist, and Alex relaxes in Economy Class, observing a porter stroll down the corridor pushing a cart. He offers a traveler a snack, Alex glances up at him, puzzled, and he puts the bag of chips back on the cart before moving along. Alex chuckles. The train comes in to stop, and Alex unfastens a handbag and stands in front of a podium, laughing at several participants seated at round tables. At the train station, Alex steps up to a counter with a poster beside it, flashes a ticket, then swings her backpack into a lounge where she rests in a velvet chair, glances at a brochure, and sends a text message, after which she looks astonished. Edinburgh at night reveals a sprawling city of lanterns as a British Airways train idles at the station."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "A breeze brushes against a shrub in a garden as dim moonlight filters through leaves. Hills yield to sparse bushes, above which a windmill peers. Wispy gray mist drifts in a yellow sky, and below sprawls the ever-evolving scenery of Canada, including barren hills, sparsely spaced towns, and wide swathes of deserts. The frame divides to reveal more landscape scenes: a rural village, a railway winding through dry farmland, a twisting stream, and square tiles dotted across the terrain, with sandy dunes and a smooth, sandy shoreline. A helicopter floats down to hover over the helipad. Meanwhile, a lean man in a hoodie, Steve, organizes a shelf, designs posters, dumps vinegar in a teacup, and kicks a balloon at the warehouse. Ryan Bingham, a relaxed standing man in his early 50s with messy dark hair and a buzz cut, debates with Steve, who waves his membership card at the entrance. In a hostel room, Ryan stuffs a rucksack with casual randomness, examines a collection of socks, shuts it, and squeezes it in the bag. He buttons up the bag, pushes in its straps, carries it out of the space, and turns on the fan as he leaves. At a bus stop, Ryan picks up a bicycle and strolls over to the Economy Class general queue station, grabs his travel document, and flashes it at a border officer. He sets his bag on a bench, grabs three blue cardboard boxes, and pops his tablet, gloves, and knit cap into them. He hops through the archway scanner, holding high his travel document, and makes it past the inspection. Ryan tugs his knit cap and gloves back on, snaps up his bag, pushes in the straps, and strides away with it. A paraglider glides beneath a haze of wispy gray mist, and Ryan lounges in Economy Class, observing a flight attendant stride past pushing a cart. She offers a traveler a snack, Ryan glances up at her, quizzical, and she places the bottle of water back on the cart before proceeding. Ryan grins. The helicopter floats down to hover, and Ryan unsnaps a duffel bag and climbs onto a stool, beaming at numerous guests perched at round benches. At the bus stop, Ryan walks up to a stall with a placard beside it, brandishes a coupon, then hauls his bag into a café where he relaxes in a woven chair, glances at a map, and sends a text, after which he feels amused. Toronto by dawn unveils a sprawling town of lanterns as an Air Canada helicopter hovers at the bus stop."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "A breeze bounces against a leaf in a meadow as dim moonlight filters through trees. Valleys fade into sparse bushes, beneath which a chimney descends. Wispy gray smoke drifts in a green sea, and above lies the static horizon of Canada, featuring dry deserts, sparsely populated villages, and small clusters of gardens. The scene merges to reveal more close-up views: a mountainous village, a dirt road snaking through sparse woodland, a straight canal, and triangular farms clumped together, with sandy plains and a smooth, pebble-free shore. A balloon floats in to hover above the canal. Meanwhile, a slender elf in a gown, Dave, sets a chair, opens letters, spills juice on a tea cup, and swings a hammer at the workshop. Tony Stark, a casually standing woman in her early 80s with messy black locks and a center braid, whispers with Dave, who takes his library card at the steps. In a library nook, Tony folds a blanket with lazy flair, examines a drawer full of pens, wipes it, and seals it in the bag. She snaps the backpack shut, retracts its label, pushes it into the closet, and turns on the lamp as she arrives. At a stadium, Tony picks up a violin and sits down at the Economy slow entry counter, drops her ticket, and hands it to a guidepost. She slides her backpack under a shelf, drops four red metal bins, and places her tablet, slippers, and denim coat inside them. She skips through the crawl-under wire barrier, clutching her ticket, and fails the customs search. Tony takes her coat and slippers off, unfastens her bag, retracts the label, and sprints toward it. A pigeon hops below a sky of wispy gray smoke, and Tony reclines in Economy, observing a steward tiptoe up the aisle carrying a suitcase. He offers a traveler a sandwich, Tony throws a glance at him, grinning, and he pulls the bottle of juice back into the suitcase before tiptoeing forward. Tony grimaces. The balloon floats away to hover, and Tony unfastens a basket and crouches beside a podium, bowing at a multitude of tourists standing at tiny benches. At the stadium, Tony jogs to a platform with a poster near it, hands over a coin, then tosses her backpack out of the lounge where she stands on a wooden stool, stares at a magazine, and takes a video call, after which she feels excited. Paris at dawn reveals a dim island of smoke as a Delta Airlines train slides under the stadium."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "A wave crashes against a rock as bright sunlight filters through clouds, revealing a landscape of the USA with mountains, cities, and fields. A jet lands, and Steve, a thick-set man in a suit, clears a table, shreds documents, pours bleach in a coffee jar, and aims a rifle at the office. Ryan Bingham, a man in his late 40s with neat graying hair, sees Steve, who hands over his key card. In a hotel, Ryan packs his suitcase with precision, examines ties, zips up, and leaves. At the airport, he returns a rental car, gets a boarding pass, and passes security with his laptop and shoes. Seated in First Class, he watches a flight attendant pushing a trolley, smiles as she hands a drink to a passenger, frowns, then smiles again when she moves on. The jet lands, and Ryan speaks at a lectern to delegates, later visiting an airport lounge. A Dallas night scene reveals city lights as an American Airlines jet taxis."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Dallas at night displays a vast city of lights as an American Airlines jet taxis at the airport At the airport Ryan walks up to a desk with a sign beside it shows a card then drags his case into a lounge where he sits in a leather armchair looks at a piece of paper and makes a phone call after which he looks surprised  The jet comes in to land and Ryan unzips a backpack and stands behind a lectern smiling at a few delegates seated at long tables  Ryan smiles  Ryan looks up at her frowning and she places the can of soda back on the trolley before walking on  She hands a passenger a drink  A jet flies above a blanket of fluffy white clouds and Ryan sits in First Class watching a flight attendant walk down the aisle pushing a trolley  Ryan puts his jacket and shoes back on zips up his case pulls out the handle and walks off with it  He steps through the walkthrough metal detector holding up his boarding pass and passes the security check  He puts his case on a table grabs two gray plastic trays and places his laptop shoes and suit jacket into them  At an airport Ryan drops off a rental car and walks up to the First Class priority access desk grabs his boarding pass and shows it to a security guard  He zips up the suitcase pulls out its handle drags it out of the room and switches off the light as he goes  In a hotel room Ryan packs a suitcase with military precision studies a pouch full of ties closes it and puts it in the case  Ryan Bingham a suavely seated man in his late 40s with neat graying hair and a side parting interacts with Steve who hands over his key card at the door  at the office  Meanwhile a thickset man in a suit Steve clears a table shreds documents pours bleach in a coffee jar and aims a rifle  A jet comes in to land on the runway  The screen splits to show more aerial views a coastal city a freeway cutting across lush parkland a meandering river and circular fields spread across the land with snowcapped mountains and a jagged rocky coastline  Fluffy white clouds float in a blue sky and below lies the everchanging landscape of the United States of America including lush mountains densely packed cities and vast patchworks of fields  Mountains give way to dense trees above which a bell tower rises  A wave crashes against a rock in a bay as bright sunlight shines through clouds "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Ryan looks up at her frowning and she places the can of soda back on the trolley before walking on  In a hotel room Ryan packs a suitcase with military precision studies a pouch full of ties closes it and puts it in the case  The screen splits to show more aerial views a coastal city a freeway cutting across lush parkland a meandering river and circular fields spread across the land with snowcapped mountains and a jagged rocky coastline  He puts his case on a table grabs two gray plastic trays and places his laptop shoes and suit jacket into them  At an airport Ryan drops off a rental car and walks up to the First Class priority access desk grabs his boarding pass and shows it to a security guard  She hands a passenger a drink  Mountains give way to dense trees above which a bell tower rises  The jet comes in to land and Ryan unzips a backpack and stands behind a lectern smiling at a few delegates seated at long tables  Meanwhile a thickset man in a suit Steve clears a table shreds documents pours bleach in a coffee jar and aims a rifle  At the airport Ryan walks up to a desk with a sign beside it shows a card then drags his case into a lounge where he sits in a leather armchair looks at a piece of paper and makes a phone call after which he looks surprised  Fluffy white clouds float in a blue sky and below lies the everchanging landscape of the United States of America including lush mountains densely packed cities and vast patchworks of fields  A wave crashes against a rock in a bay as bright sunlight shines through clouds  He steps through the walkthrough metal detector holding up his boarding pass and passes the security check  A jet comes in to land on the runway  He zips up the suitcase pulls out its handle drags it out of the room and switches off the light as he goes  A jet flies above a blanket of fluffy white clouds and Ryan sits in First Class watching a flight attendant walk down the aisle pushing a trolley  Ryan Bingham a suavely seated man in his late 40s with neat graying hair and a side parting interacts with Steve who hands over his key card at the door  Ryan puts his jacket and shoes back on zips up his case pulls out the handle and walks off with it  Dallas at night displays a vast city of lights as an American Airlines jet taxis at the airport at the office  Ryan smiles "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "He puts his case on a table grabs two gray plastic trays and places his laptop shoes and suit jacket into them  He steps through the walkthrough metal detector holding up his boarding pass and passes the security check  Ryan puts his jacket and shoes back on zips up his case pulls out the handle and walks off with it  A jet flies above a blanket of fluffy white clouds and Ryan sits in First Class watching a flight attendant walk down the aisle pushing a trolley  She hands a passenger a drink  Ryan looks up at her frowning and she places the can of soda back on the trolley before walking on  Ryan smiles  The jet comes in to land and Ryan unzips a backpack and stands behind a lectern smiling at a few delegates seated at long tables  At the airport Ryan walks up to a desk with a sign beside it shows a card then drags his case into a lounge where he sits in a leather armchair looks at a piece of paper and makes a phone call after which he looks surprised  Dallas at night displays a vast city of lights as an American Airlines jet taxis at the airport A wave crashes against a rock in a bay as bright sunlight shines through clouds  Mountains give way to dense trees above which a bell tower rises  Fluffy white clouds float in a blue sky and below lies the everchanging landscape of the United States of America including lush mountains densely packed cities and vast patchworks of fields  The screen splits to show more aerial views a coastal city a freeway cutting across lush parkland a meandering river and circular fields spread across the land with snowcapped mountains and a jagged rocky coastline  A jet comes in to land on the runway  Meanwhile a thickset man in a suit Steve clears a table shreds documents pours bleach in a coffee jar and aims a rifle  at the office  Ryan Bingham a suavely seated man in his late 40s with neat graying hair and a side parting interacts with Steve who hands over his key card at the door  In a hotel room Ryan packs a suitcase with military precision studies a pouch full of ties closes it and puts it in the case  He zips up the suitcase pulls out its handle drags it out of the room and switches off the light as he goes  At an airport Ryan drops off a rental car and walks up to the First Class priority access desk grabs his boarding pass and shows it to a security guard "
        }
      ]
    }
  ]
}