{
  "ground_truth": "Sam spots the elevator stuck on the seventh floor, while elsewhere, a sweaty Javier glares at Veronica then lowers the gun, only to raise it again as Veronica relaxes. Veronica shakes her head, and Javier relents, leaving her in the elevator and touching his stomach in the corridor, bringing his palm away bloody. Javier, dressed in a Spanish policeman's uniform, heads down the stairwell in the hotel. Outside, Sam sees Veronica leaving the elevator with a covered gurney, and rushes to help, wheeling it while Veronica tends the drip. The President is covered by a blue blanket. Javier leaves the annex and on the street checks his watch. Sam and Veronica wheel the President's gurney over to the ambulance as Luis runs up to them, climbs in, and Sam shuts the door. The ambulance pulls away from the chaos outside the hotel. In a speeding hatchback, Barnes answers his cell phone, shifts gear, and moves through traffic in the narrow street. On a different street, Sam weaves through traffic in the ambulance, and inside, Ashton, lying under the blanket, opens his eyes, lowers a sidebar, and, as the ambulance rounds a corner, falls to the floor. Taylor speeds along in a Spanish police car while Veronica smiles at Sam in the driver's seat. Then Enrique runs across the road in front of them and exchanges a stunned glance with Veronica. Sam looks shiftily across at Veronica as Veronica shoots Luis point blank while Ashton cowers on the floor by the gurney, then reaches out for the drip support, disconnects the metal bar, and holds it against his chest. Meanwhile, Javier approaches a couple getting into their car and pulls his gun, and a middle-aged man nervously offers his keys as Taylor drives down the street towards Javier, stopping as Javier slaps the bonnet of the Spanish police car. Barnes suddenly breaks, backs up, and spots Javier climbing into Taylor's police car, setting off in pursuit as Barnes wears a focused expression, drifting around corners and weaving through traffic right behind them, pulling out his cell phone. A taxi plows into the side of Barnes's hatchback, sending his small blue car into a spin along the road behind Taylor, but Barnes rights the vehicle with a determined frown. Taylor looks back as Barnes throws his car into gear and accelerates after Taylor, who power-slides around a corner with Barnes in hot pursuit. Taylor gets on the radio, while Sam glances anxiously across at Veronica who holds onto her seat belt. Barnes races past pavements full of panicking pedestrians, dodging traffic, as Javier fidgets anxiously in the police car's passenger seat. Policemen frantically direct scared members of the public away from the chase as both cars head through a junction.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Sam notices the lift immobile on the seventh level, while elsewhere, a perspiring Javier stares at Veronica then lowers the firearm, only to lift it again as Veronica unwinds. Veronica shakes her head, and Javier concedes, leaving her in the lift and touching his abdomen in the hallway, bringing his hand away sanguine. Javier, dressed in a Spanish lawman's uniform, proceeds down the stairwell in the lodge. Outside, Sam observes Veronica leaving the lift with a shrouded stretcher, and dashes to assist, wheeling it while Veronica manages the drip. The Leader is covered by a cerulean covering. Javier leaves the extension and on the street checks his timepiece. Sam and Veronica wheel the Leader's stretcher over to the ambulance as Luis runs up to them, climbs in, and Sam closes the door. The ambulance departs from the disorder outside the lodge. In a racing hatchback, Barnes responds to his mobile phone, shifts gear, and maneuvers through traffic in the confined street. On a different street, Sam navigates through traffic in the ambulance, and inside, Ashton, lying beneath the covering, opens his eyes, lowers a sidebar, and, as the ambulance rounds a corner, falls to the floor. Taylor speeds along in a Spanish police vehicle while Veronica beams at Sam in the driver's seat. Then Enrique dashes across the road in front of them and exchanges a shocked glance with Veronica. Sam glances shiftily across at Veronica as Veronica fires at Luis point blank while Ashton cowers on the floor by the stretcher, then reaches out for the drip support, disconnects the metal bar, and holds it against his chest. Meanwhile, Javier approaches a couple getting into their automobile and draws his firearm, and a middle-aged gentleman nervously offers his keys as Taylor drives down the street towards Javier, halting as Javier taps the hood of the Spanish police vehicle. Barnes suddenly brakes, backs up, and notices Javier climbing into Taylor's police vehicle, setting off in pursuit as Barnes wears a focused expression, drifting around corners and weaving through traffic right behind them, pulling out his mobile phone. A cab plows into the side of Barnes's hatchback, sending his small cerulean car into a spin along the road behind Taylor, but Barnes rights the vehicle with a determined frown. Taylor looks back as Barnes throws his car into gear and accelerates after Taylor, who power-slides around a corner with Barnes in hot pursuit. Taylor gets on the radio, while Sam glances anxiously across at Veronica who holds onto her seat belt. Barnes races past pavements full of panicking pedestrians, dodging traffic, as Javier fidgets anxiously in the police vehicle's passenger seat. Policemen frantically direct scared members of the public away from the chase as both vehicles head through a junction."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Javier spots the elevator stuck on the seventh floor, while elsewhere, Veronica is glared at by a sweaty Javier who then lowers the gun, only to raise it again as Veronica relaxes. Her head is shaken by Veronica, and Javier relents, leaving her in the elevator and touching his stomach in the corridor, bringing his palm away bloody. Javier, dressed in a Spanish policeman's uniform, descends the stairwell in the hotel. Outside, Veronica is seen by Sam leaving the elevator with a covered gurney, and he rushes to help, wheeling it while Veronica tends the drip. The President is covered by a blue blanket. The annex is left by Javier and his watch is checked on the street. The President's gurney is wheeled over to the ambulance by Sam and Veronica as Luis runs up to them, climbs in, and the door is shut by Sam. The ambulance pulls away from the chaos outside the hotel. In a speeding hatchback, a cell phone is answered by Barnes, who shifts gear, and moves through traffic in the narrow street. On a different street, traffic is weaved through by Sam in the ambulance, and inside, Ashton, lying under the blanket, opens his eyes, lowers a sidebar, and, as a corner is rounded by the ambulance, he falls to the floor. Speeding along in a Spanish police car, Taylor is watched by Veronica who smiles at Sam in the driver's seat. Then Enrique runs across the road in front of them and they exchange a stunned glance with Veronica. Veronica is looked at shiftily by Sam across the seat as Luis is shot point-blank by Veronica while Ashton cowers on the floor by the gurney, then the drip support is reached out for by Ashton, who disconnects the metal bar, and holds it against his chest. Meanwhile, a couple getting into their car is approached by Javier who pulls his gun, and his keys are nervously offered by a middle-aged man as the street is driven down by Taylor towards Javier, stopping as the bonnet of the Spanish police car is slapped by Javier. Barnes suddenly breaks, backs up, and spots Javier climbing into Taylor's police car, pursuit is set off in by Barnes who wears a focused expression, drifting around corners and weaving through traffic right behind them, pulling out his cell phone. The side of Barnes's hatchback is plowed into by a taxi, sending his small blue car into a spin along the road behind Taylor, but Barnes rights the vehicle with a determined frown. Taylor looks back as the gear is thrown into Barnes's car and acceleration happens after Taylor, who power-slides around a corner with Barnes in hot pursuit. The radio is used by Taylor, while an anxious glance is given by Sam across at Veronica who holds onto her seat belt. The pavements full of panicking pedestrians are raced past by Barnes, dodging traffic, as Javier fidgets anxiously in the police car's passenger seat. Policemen frantically direct scared members of the public away from the chase as a junction is headed through by both cars."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Sam notices the elevator stuck on the seventh floor, while elsewhere, a sweaty Javier glares at Veronica, lowers the gun, then raises it again as she relaxes. Veronica shakes her head, and Javier relents, leaving her in the elevator, touching his stomach and finding blood. Dressed in a Spanish policeman's uniform, Javier heads down the hotel stairwell. Outside, Sam sees Veronica leaving the elevator with a covered gurney and rushes to help, wheeling it while Veronica tends the drip. The President is under a blue blanket. Javier exits the annex, checks his watch, and Sam and Veronica wheel the President's gurney to the ambulance as Luis joins them, and Sam shuts the door. The ambulance departs the chaos outside the hotel. In a speeding hatchback, Barnes answers his phone, shifts gear, and navigates traffic. On another street, Sam weaves through traffic in the ambulance, and inside, Ashton opens his eyes, lowers a sidebar, and falls to the floor as the ambulance turns. Taylor speeds in a Spanish police car while Veronica smiles at Sam. Enrique runs across the road, exchanging a stunned glance with Veronica. Sam looks shiftily at Veronica as she shoots Luis point-blank while Ashton cowers, then reaches for the drip support, disconnects it, and holds it against his chest. Meanwhile, Javier approaches a couple, pulls his gun, and a nervous man offers his keys as Taylor drives towards Javier, stopping as Javier slaps the police car's bonnet. Barnes suddenly breaks, backs up, and spots Javier climbing into Taylor's car, setting off in pursuit. A taxi crashes into Barnes's hatchback, sending it spinning, but Barnes rights the vehicle and accelerates after Taylor, who power-slides around a corner. Taylor gets on the radio, while Sam glances anxiously at Veronica. Barnes races past panicking pedestrians, dodging traffic, as Javier fidgets in the police car's passenger seat. Policemen direct scared public members away from the chase as both cars head through a junction."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Sam notices the elevator stuck on the seventh floor. Elsewhere, a sweaty Javier glares at Veronica, lowers his gun, then raises it again as she relaxes. Veronica shakes her head, and Javier relents, leaving her in the elevator. He touches his bloody stomach in the corridor and, dressed in a Spanish policeman's uniform, heads down the hotel stairwell. Outside, Sam sees Veronica leaving the elevator with a covered gurney and rushes to help, wheeling it while Veronica tends the drip. The President is under a blue blanket. Javier exits the annex, checks his watch, and Sam and Veronica wheel the President to the ambulance. Luis runs up, climbs in, and Sam shuts the door. The ambulance leaves the hotel chaos. In a speeding hatchback, Barnes answers his phone, shifts gear, and navigates traffic. On another street, Sam weaves through traffic in the ambulance. Inside, Ashton opens his eyes, lowers a sidebar, and falls to the floor as the ambulance rounds a corner. Taylor speeds in a Spanish police car while Veronica smiles at Sam. Enrique runs across the road, exchanging a glance with Veronica. Sam looks at Veronica as she shoots Luis, while Ashton cowers and grabs the drip support. Meanwhile, Javier approaches a couple, pulls his gun, and a man nervously offers his keys. Taylor drives towards Javier, stopping as Javier slaps the police car's bonnet. Barnes breaks, backs up, and sees Javier climbing into Taylor's car, pursuing them with focus. A taxi hits Barnes's hatchback, spinning it, but Barnes rights the car and accelerates after Taylor. Taylor gets on the radio, while Sam glances at Veronica. Barnes races past panicking pedestrians, dodging traffic, as Javier fidgets in the police car. Policemen direct the public away as both cars head through a junction."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Sam, with a keen eye, notices the elevator stuck on the seventh floor. Meanwhile, in another part of the building, a perspiring Javier fixes a glare on Veronica, then lowers the gun in his hand, only to raise it once more as Veronica begins to relax. Veronica shakes her head in disapproval, and Javier, dressed in the uniform of a Spanish policeman, eventually relents. He leaves her behind in the elevator, touching his stomach as he walks down the corridor, and when he pulls his palm away, it is stained with blood. Javier makes his way down the stairwell of the hotel. Outside, Sam observes Veronica as she exits the elevator, pushing a covered gurney, and he quickly rushes over to assist her. Together, they wheel the gurney, with Sam taking charge of the movement while Veronica attentively manages the drip. The President lies beneath a blue blanket on the gurney. Javier exits the annex and, once on the street, checks his watch. Sam and Veronica maneuver the President's gurney over to the waiting ambulance. As they do so, Luis runs up to join them, climbs into the ambulance, and Sam promptly shuts the door behind him. The ambulance then pulls away from the chaotic scene outside the hotel. In a speeding hatchback, Barnes answers his cell phone, shifts gears, and skillfully navigates through the traffic on the narrow street. On a different street, Sam weaves the ambulance through the traffic, and inside, Ashton, who is lying under the blanket, opens his eyes. He lowers a sidebar, and as the ambulance rounds a corner, he falls to the floor. Meanwhile, Taylor speeds along in a Spanish police car, and Veronica, sitting in the driver's seat, smiles at Sam. Suddenly, Enrique dashes across the road in front of them, exchanging a stunned glance with Veronica. Sam casts a shifty look across at Veronica just as Veronica shoots Luis at point-blank range. Ashton, cowering on the floor by the gurney, reaches out for the drip support, disconnects the metal bar, and holds it protectively against his chest. Meanwhile, Javier approaches a couple getting into their car, brandishing his gun, and a middle-aged man nervously offers him the keys. Taylor drives down the street towards Javier, stopping as Javier slaps the bonnet of the Spanish police car. Barnes suddenly brakes, reverses, and spots Javier climbing into Taylor's police car, setting off in pursuit. Barnes wears a focused expression, drifting around corners and weaving through traffic right behind them, all while pulling out his cell phone. A taxi crashes into the side of Barnes's hatchback, sending his small blue car into a spin along the road behind Taylor, but Barnes manages to right the vehicle with a determined frown. Taylor glances back as Barnes throws his car into gear and accelerates after Taylor, who power-slides around a corner with Barnes in hot pursuit. Taylor gets on the radio, while Sam glances anxiously across at Veronica, who clutches her seat belt. Barnes races past pavements crowded with panicking pedestrians, skillfully dodging traffic, as Javier fidgets anxiously in the passenger seat of the police car. Policemen frantically direct scared members of the public away from the chase as both cars speed through a busy junction."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Sam, possessing a sharp and perceptive eye, keenly observes the elevator, which appears to be stuck on the seventh floor. Meanwhile, in a different part of the sprawling building, a perspiring Javier fixes an intense glare on Veronica. He lowers the gun he holds steadily in his hand, only to raise it once more as Veronica, perhaps misjudging the situation, begins to relax. Veronica, shaking her head in visible disapproval, conveys her discontent, and eventually, Javier, dressed meticulously in the distinct uniform of a Spanish policeman, relents. He leaves her behind in the confines of the elevator, touching his stomach as he proceeds down the dimly lit corridor. As he pulls his palm away, it becomes apparent that it is stained with blood. Javier, with a determined stride, makes his way down the stairwell of the bustling hotel. Outside, Sam observes Veronica as she emerges from the elevator, pushing a covered gurney with effort, and he quickly rushes over to offer his assistance. Together, they wheel the gurney, with Sam taking charge of guiding its movement while Veronica attentively manages the intravenous drip. The President lies beneath a simple blue blanket on the gurney. Javier exits the annex, and once he reaches the street, he checks his watch with a sense of urgency. Sam and Veronica continue to maneuver the President's gurney over to the waiting ambulance. As they do so, Luis runs up to join them, climbing into the ambulance, and Sam promptly shuts the door behind him, ensuring everything is secure. The ambulance then pulls away from the chaotic scene playing out outside the bustling hotel. In a speeding hatchback, Barnes answers his cell phone, shifts gears, and skillfully navigates through the heavy traffic on the narrow street. On a different street, Sam carefully weaves the ambulance through the congestion, and inside, Ashton, who is lying under the comforting blanket, suddenly opens his eyes. He reaches out and lowers a sidebar, and as the ambulance rounds a corner, he falls to the floor in a sudden motion. Meanwhile, Taylor speeds along in a Spanish police car, and Veronica, seated confidently in the driver's seat, casts a smile at Sam. Suddenly, Enrique dashes across the road in front of them, exchanging a stunned glance with Veronica. Sam casts a shifty, uncertain look across at Veronica just as Veronica unexpectedly shoots Luis at point-blank range. Ashton, cowering on the floor near the gurney, reaches out for the drip support, disconnects the metal bar, and holds it protectively against his chest as a makeshift defense. Meanwhile, Javier approaches a couple getting into their car, brandishing his gun, and a middle-aged man, visibly nervous, offers him the keys in a gesture of surrender. Taylor drives down the street towards Javier, stopping abruptly as Javier confidently slaps the bonnet of the Spanish police car. Barnes suddenly brakes, reverses skillfully, and spots Javier climbing into Taylor's police car, setting off on an intense pursuit. Barnes wears a focused expression, drifting around corners and adeptly weaving through traffic right behind them, all while pulling out his cell phone to communicate. A taxi crashes into the side of Barnes's speeding hatchback, sending his small blue car into a spin along the road behind Taylor, but Barnes manages to right the vehicle with a determined frown etched on his face. Taylor casts a glance back as Barnes throws his car into gear again and accelerates after Taylor, who power-slides smoothly around a corner with Barnes in hot pursuit. Taylor gets on the radio to report, while Sam glances anxiously across at Veronica, who clutches her seat belt with tense fingers. Barnes races past pavements crowded with panicking pedestrians, skillfully dodging the traffic as Javier fidgets anxiously in the passenger seat of the police car. Policemen frantically direct frightened members of the public away from the unfolding chase as both cars speed through a busy junction."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Sam notices the elevator is stuck on the seventh floor, observing the situation with a keen eye. Meanwhile, in another location, a sweaty Javier fixes a glare on Veronica, his eyes intense and unwavering. He lowers the gun in his hand, a moment of tension hanging in the air, only to raise it again as he notices Veronica beginning to relax. Veronica responds by shaking her head, a subtle yet firm gesture of defiance. Javier, acknowledging her silent communication, relents and decides to leave her in the elevator. As he steps into the corridor, he touches his stomach, feeling a sharp pain, and when he pulls his palm away, it is stained with blood. Dressed in a Spanish policeman's uniform, Javier makes his way down the stairwell of the hotel, each step deliberate and measured. Outside, Sam's attention shifts as he sees Veronica emerging from the elevator, pushing a covered gurney. He quickly rushes over to assist her, taking hold of the gurney and wheeling it forward while Veronica focuses on tending to the drip attached to it. The President lies beneath a blue blanket, concealed from view. Javier exits the annex and steps onto the street, where he checks his watch, a sense of urgency in his movements. Sam and Veronica maneuver the President's gurney towards the waiting ambulance, their actions synchronized and efficient. As they reach the vehicle, Luis runs up to them, swiftly climbing inside, and Sam closes the door behind him. The ambulance pulls away from the chaotic scene outside the hotel, its sirens blaring. In a speeding hatchback, Barnes answers his cell phone, his hand deftly shifting gears as he navigates through the narrow street, weaving through the traffic with precision. On a different street, Sam skillfully weaves the ambulance through the traffic, maintaining a steady pace. Inside the ambulance, Ashton, lying under the blanket, opens his eyes, his mind alert. He lowers a sidebar, preparing himself as the ambulance rounds a corner, causing him to fall to the floor. Taylor speeds along in a Spanish police car, his focus unwavering, while Veronica, seated beside Sam, offers him a smile, a moment of shared understanding. Suddenly, Enrique dashes across the road in front of them, causing Veronica to exchange a stunned glance with him. Sam casts a shifty look at Veronica, sensing the tension. In a swift and shocking move, Veronica shoots Luis point blank, the sound echoing in the confined space, while Ashton cowers on the floor beside the gurney. Gathering his wits, Ashton reaches out for the drip support, disconnects the metal bar, and holds it protectively against his chest. Meanwhile, Javier approaches a couple getting into their car, his demeanor threatening as he pulls out his gun. The middle-aged man, visibly nervous, offers his keys without hesitation. Taylor drives down the street towards Javier, stopping abruptly as Javier slaps the bonnet of the Spanish police car, signaling his intent. Barnes, reacting quickly, suddenly brakes, backs up, and spots Javier climbing into Taylor's police car. Determined, Barnes sets off in pursuit, his expression focused and intense as he drifts around corners, weaving through traffic with practiced ease, all while pulling out his cell phone. A taxi crashes into the side of Barnes's hatchback, sending his small blue car into a spin along the road behind Taylor. With a determined frown, Barnes rights the vehicle, regaining control. Taylor glances back, observing Barnes as he throws his car into gear and accelerates after him, power-sliding around a corner with Barnes in hot pursuit. Taylor gets on the radio, communicating urgently, while Sam, in the ambulance, glances anxiously across at Veronica, who clutches her seat belt tightly. Barnes races past pavements crowded with panicking pedestrians, expertly dodging traffic, as Javier fidgets anxiously in the passenger seat of the police car. Policemen on the street frantically direct scared members of the public away from the chase, ensuring their safety as both cars head through a busy junction, the tension escalating with every passing second."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Sam notices the elevator stuck on the seventh floor, while Javier, sweating and dressed in a Spanish policeman's uniform, confronts Veronica with a gun. After a tense moment, he lowers the weapon, leaves her in the elevator, and discovers he's bleeding. He descends the hotel stairwell, and outside, Sam sees Veronica exiting the elevator with a covered gurney. Together, they wheel the gurney, with Veronica tending to the drip, and transport the President, hidden under a blue blanket, to an ambulance. Luis joins them, and Sam secures the door as the ambulance departs from the chaotic hotel scene.\n\nMeanwhile, Barnes navigates a speeding hatchback through traffic, answering his phone. In the ambulance, Ashton, concealed under the blanket, awakens, lowers a sidebar, and falls to the floor as the vehicle turns. Taylor speeds in a Spanish police car, while Veronica exchanges a glance with Enrique, who runs across the road. Suddenly, Veronica shoots Luis, and Ashton, cowering on the floor, grabs the drip support for protection.\n\nJavier approaches a couple, seizes their car keys at gunpoint, and climbs into Taylor's police car. Barnes, spotting this, pursues them, maneuvering through traffic with determination. A collision with a taxi spins Barnes's car, but he regains control and continues the chase. Taylor radios for assistance as Barnes races past panicked pedestrians, dodging traffic, while Javier fidgets in the passenger seat. Policemen direct the public away as both cars speed through a junction."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Sam spots the elevator stuck on the seventh floor, a floor known for its conference rooms often used for high-profile meetings, while elsewhere, a sweaty Javier, who had been nervously holding the gun for what felt like hours, glares at Veronica then lowers the gun, only to raise it again as Veronica relaxes. Veronica, known in her circles for her unyielding resolve, shakes her head, and Javier relents, leaving her in the elevator and touching his stomach in the corridor, bringing his palm away bloody from a wound he sustained earlier. Javier, dressed in a Spanish policeman's uniform, heads down the stairwell in the hotel, which is a historical landmark known for its ornate architecture. Outside, Sam sees Veronica leaving the elevator with a covered gurney, and rushes to help, wheeling it while Veronica tends the drip. The President, who was scheduled to speak at a global summit taking place at the hotel, is covered by a blue blanket. Javier leaves the annex and on the street checks his watch, a gift from his late father. Sam and Veronica wheel the President's gurney over to the ambulance as Luis, a paramedic and trusted ally, runs up to them, climbs in, and Sam shuts the door. The ambulance pulls away from the chaos outside the hotel, where security personnel scramble to control the scene. In a speeding hatchback, Barnes, a seasoned investigator known for his quick reflexes, answers his cell phone, shifts gear, and moves through traffic in the narrow street. On a different street, Sam weaves through traffic in the ambulance, and inside, Ashton, an undercover agent tasked with protecting the President, lying under the blanket, opens his eyes, lowers a sidebar, and, as the ambulance rounds a corner, falls to the floor. Taylor speeds along in a Spanish police car, a standard-issue vehicle known for its agility, while Veronica smiles at Sam in the driver's seat. Then Enrique, a notorious fugitive with a long rap sheet, runs across the road in front of them and exchanges a stunned glance with Veronica, indicating a shared history. Sam looks shiftily across at Veronica as Veronica shoots Luis point blank while Ashton, despite his fear, cowers on the floor by the gurney, then reaches out for the drip support, disconnects the metal bar, and holds it against his chest as a makeshift defense. Meanwhile, Javier, struggling with a growing sense of desperation, approaches a couple getting into their car and pulls his gun, and a middle-aged man nervously offers his keys, fearing for his life, as Taylor drives down the street towards Javier, stopping as Javier slaps the bonnet of the Spanish police car. Barnes suddenly breaks, backs up, and spots Javier climbing into Taylor's police car, setting off in pursuit as Barnes wears a focused expression, his mind racing with strategies, drifting around corners and weaving through traffic right behind them, pulling out his cell phone to call for backup. A taxi, driven by an unsuspecting driver, plows into the side of Barnes's hatchback, sending his small blue car into a spin along the road behind Taylor, but Barnes rights the vehicle with a determined frown, his years of training in evasive driving kicking in. Taylor looks back as Barnes throws his car into gear and accelerates after Taylor, who power-slides around a corner with Barnes in hot pursuit, both cars roaring through the district known for its bustling nightlife. Taylor gets on the radio, calling for additional reinforcements, while Sam glances anxiously across at Veronica who holds onto her seat belt with a grip that hints at uncertainty. Barnes races past pavements full of panicking pedestrians, dodging traffic, as Javier fidgets anxiously in the police car's passenger seat, his mind a whirlwind of doubt and regret. Policemen frantically direct scared members of the public away from the chase as both cars head through a junction, their sirens blaring a warning of the imminent danger."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Sam spots the elevator stuck on the seventh floor while elsewhere a sweaty Javier glares at Veronica then lowers the gun only to raise it again as Veronica relaxes  Veronica shakes her head and Javier relents leaving her in the elevator and touching his stomach in the corridor bringing his palm away  bloody Javier dressed in a Spanish policeman's uniform heads down the stairwell in the hotel  Ashton lying under the blanket opens his eyes lowers a sidebar and as the ambulance rounds a corner falls to the floor  Taylor speeds along in a Spanish police car while Veronica smiles at Sam in the driver's seat  Then Enrique runs across the road in front of them and exchanges a stunned glance with Veronica  Sam looks shiftily across at Veronica as Veronica shoots Luis point blank while Ashton cowers on the floor by the gurney then reaches out for the drip  support disconnects the metal bar and holds it against his chest  Meanwhile Javier approaches a couple getting into their car and pulls his gun and a middleaged man nervously offers his keys as Taylor drives down the street towards Javier stopping as Javier slaps the bonnet of the Spanish police car  Barnes suddenly breaks backs up and spots Javier climbing into Taylor's police car setting off in pursuit as Barnes wears a focused expression drifting around corners and weaving through traffic right behind them pulling out his cell phone  A taxi plows into the side of Barnes's hatchback sending his small blue car into a spin along the road behind Taylor but Barnes rights the vehicle with a determined frown  Taylor looks back as Barnes throws his car into gear and accelerates after Taylor who powerslides around a corner with Barnes in hot pursuit  Taylor gets on the radio while Sam glances anxiously across at Veronica who holds onto her seat belt  Barnes races past pavements full of panicking pedestrians dodging traffic as Javier fidgets anxiously in the police car's passenger seat  Outside Sam sees Veronica leaving the elevator with a covered gurney and rushes to help wheeling it while Veronica tends the drip  The President is covered by a blue blanket  Javier leaves the annex and on the street checks his watch  Sam and Veronica wheel the President's gurney over to the ambulance as Luis runs up to them climbs in and Sam shuts the door  The ambulance pulls away from the chaos outside the hotel  In a speeding hatchback Barnes answers his cell phone shifts gear and moves through traffic in the narrow street  On a different street Sam weaves through traffic in the ambulance and inside  Ashton lying under the blanket opens his eyes lowers a sidebar and as the ambulance rounds a corner falls to the floor  Taylor speeds along in a Spanish police car while Veronica smiles at Sam in the driver's seat  Then Enrique runs across the road in front of them and exchanges a stunned glance with Veronica  Sam looks shiftily across at Veronica as Veronica shoots Luis point blank while Ashton cowers on the floor by the gurney then reaches out for the drip  support disconnects the metal bar and holds it against his chest  Meanwhile Javier approaches a couple getting into their car and pulls his gun and a middleaged man nervously offers his keys as Taylor drives down the street towards Javier stopping as Javier slaps the bonnet of the Spanish police car  Barnes suddenly breaks backs up and spots Javier climbing into Taylor's police car setting off in pursuit as Barnes wears a focused expression drifting around corners and weaving through traffic right behind them pulling out his cell phone  A taxi plows into the side of Barnes's hatchback sending his small blue car into a spin along the road behind Taylor but Barnes rights the vehicle with a determined frown  Taylor looks back as Barnes throws his car into gear and accelerates after Taylor who powerslides around a corner with Barnes in hot pursuit  Taylor gets on the radio while Sam glances anxiously across at Veronica who holds onto her seat belt  Barnes races past pavements full of panicking pedestrians dodging traffic as Javier fidgets anxiously in the police car's passenger seat  Policemen frantically direct scared members of the public away from the chase as both cars head through a junction"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Sam spots the elevator stuck on the seventh floor while elsewhere a sweaty Javier glares at Veronica then lowers the gun only to raise it again as Veronica relaxes. Veronica shakes her head and Javier relents leaving her in the elevator and touching his stomach in the corridor bringing his palm away. bloody Javier dressed in a Spanish policeman's uniform heads down the stairwell in the hotel. Outside Sam sees Veronica leaving the elevator with a covered gurney and rushes to help wheeling it while Veronica tends the drip. The President is covered by a blue blanket. Javier leaves the annex and on the street checks his watch. Sam and Veronica wheel the President's gurney over to the ambulance as Luis runs up to them climbs in and Sam shuts the door. The ambulance pulls away from the chaos outside the hotel. In a speeding hatchback Barnes answers his cell phone shifts gear and moves through traffic in the narrow street. On a different street Sam weaves through traffic in the ambulance and inside. Ashton lying under the blanket opens his eyes lowers a sidebar and as the ambulance rounds a corner falls to the floor. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Taylor speeds along in a Spanish police car while Veronica smiles at Sam in the driver's seat. Then Enrique runs across the road in front of them and exchanges a stunned glance with Veronica. Sam looks shiftily across at Veronica as Veronica shoots Luis point blank while Ashton cowers on the floor by the gurney then reaches out for the drip. support disconnects the metal bar and holds it against his chest. Meanwhile Javier approaches a couple getting into their car and pulls his gun and a middleaged man nervously offers his keys as Taylor drives down the street towards Javier stopping as Javier slaps the bonnet of the Spanish police car. Barnes suddenly breaks backs up and spots Javier climbing into Taylor's police car setting off in pursuit as Barnes wears a focused expression drifting around corners and weaving through traffic right behind them pulling out his cell phone. A taxi plows into the side of Barnes's hatchback sending his small blue car into a spin along the road behind Taylor but Barnes rights the vehicle with a determined frown. Taylor looks back as Barnes throws his car into gear and accelerates after Taylor who powerslides around a corner with Barnes in hot pursuit. Taylor gets on the radio while Sam glances anxiously across at Veronica who holds onto her seat belt. Barnes races past pavements full of panicking pedestrians dodging traffic as Javier fidgets anxiously in the police car's passenger seat. Policemen frantically direct scared members of the public away from the chase as both cars head through a junction."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Sam spots the elevator stuck on the seventh floor while elsewhere a sweaty Javier glares at Veronica then lowers the gun only to raise it again as Veronica relaxes. Veronica shakes her head and Javier relents leaving her in the elevator and touching his stomach in the corridor bringing his palm away. bloody Javier dressed in a Spanish policeman's uniform heads down the stairwell in the hotel. Outside Sam sees Veronica leaving the elevator with a covered gurney and rushes to help wheeling it while Veronica tends the drip. The President is covered by a blue blanket. Javier leaves the annex and on the street checks his watch. Sam and Veronica wheel the President's gurney over to the ambulance as Luis runs up to them climbs in and Sam shuts the door. The ambulance pulls away from the chaos outside the hotel. In a speeding hatchback Barnes answers his cell phone shifts gear and moves through traffic in the narrow street. On a different street Sam weaves through traffic in the ambulance and inside. Ashton lying under the blanket opens his eyes lowers a sidebar and as the ambulance rounds a corner falls to the floor. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Taylor speeds along in a Spanish police car while Veronica smiles at Sam in the driver's seat. Then Enrique runs across the road in front of them and exchanges a stunned glance with Veronica. Sam looks shiftily across at Veronica as Veronica shoots Luis point blank while Ashton cowers on the floor by the gurney then reaches out for the drip. support disconnects the metal bar and holds it against his chest. Meanwhile Javier approaches a couple getting into their car and pulls his gun and a middleaged man nervously offers his keys as Taylor drives down the street towards Javier stopping as Javier slaps the bonnet of the Spanish police car. Barnes suddenly breaks backs up and spots Javier climbing into Taylor's police car setting off in pursuit as Barnes wears a focused expression drifting around corners and weaving through traffic right behind them pulling out his cell phone. A taxi plows into the side of Barnes's hatchback sending his small blue car into a spin along the road behind Taylor but Barnes rights the vehicle with a determined frown. Taylor looks back as Barnes throws his car into gear and accelerates after Taylor who powerslides around a corner with Barnes in hot pursuit. Taylor gets on the radio while Sam glances anxiously across at Veronica who holds onto her seat belt. Barnes races past pavements full of panicking pedestrians dodging traffic as Javier fidgets anxiously in the police car's passenger seat. Policemen frantically direct scared members of the public away from the chase as both cars head through a junction."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Sam spots the elevator stuck on the seventh floor while elsewhere a sweaty Javier glares at Veronica then lowers the gun only to raise it again as Veronica relaxes. Veronica shakes her head and Javier relents leaving her in the elevator and touching his stomach in the corridor bringing his palm away. bloody Javier dressed in a Spanish policeman's uniform heads down the stairwell in the hotel. Outside Sam sees Veronica leaving the elevator with a covered gurney and rushes to help wheeling it while Veronica tends the drip. The President is covered by a blue blanket. Javier leaves the annex and on the street checks his watch. A taxi plows into the side of Barnes's hatchback sending his small blue car into a spin along the road behind Taylor but Barnes rights the vehicle with a determined frown. Taylor looks back as Barnes throws his car into gear and accelerates after Taylor who powerslides around a corner with Barnes in hot pursuit. Taylor gets on the radio while Sam glances anxiously across at Veronica who holds onto her seat belt. Barnes races past pavements full of panicking pedestrians dodging traffic as Javier fidgets anxiously in the police car's passenger seat. Policemen frantically direct scared members of the public away from the chase as both cars head through a junction."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Sam spots the elevator stuck on the seventh floor while elsewhere a sweaty Javier glares at Veronica then lowers the gun only to raise it again as Veronica relaxes. Veronica shakes her head and Javier relents leaving her in the elevator and touching his stomach in the corridor bringing his palm away. bloody Javier dressed in a Spanish policeman's uniform heads down the stairwell in the hotel. Barnes races past pavements full of panicking pedestrians dodging traffic as Javier fidgets anxiously in the police car's passenger seat. Policemen frantically direct scared members of the public away from the chase as both cars head through a junction."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "A pigeon spots the elevator stuck on the seventh floor, while elsewhere, a sweaty elephant glares at a unicorn, then lowers the gun, only to raise it again as the unicorn relaxes. The unicorn shakes its head, and the elephant relents, leaving it in the elevator and touching its stomach in the corridor, bringing its palm away bloody. The elephant, dressed in a Spanish policeman's uniform, heads down the stairwell in the hotel. Outside, the pigeon sees the unicorn leaving the elevator with a covered gurney, and rushes to help, wheeling it while the unicorn tends the drip. The President is covered by a blue blanket. The elephant leaves the annex and on the street checks its watch. The pigeon and the unicorn wheel the President's gurney over to the ambulance as a bear runs up to them, climbs in, and the pigeon shuts the door. The ambulance pulls away from the chaos outside the hotel. In a speeding hatchback, a dolphin answers its cell phone, shifts gear, and moves through traffic in the narrow street. On a different street, the pigeon weaves through traffic in the ambulance, and inside, a kangaroo, lying under the blanket, opens its eyes, lowers a sidebar, and, as the ambulance rounds a corner, falls to the floor. A rabbit speeds along in a Spanish police car while the unicorn smiles at the pigeon in the driver's seat. Then a giraffe runs across the road in front of them and exchanges a stunned glance with the unicorn. The pigeon looks shiftily across at the unicorn as the unicorn shoots the bear point blank while the kangaroo cowers on the floor by the gurney, then reaches out for the drip support, disconnects the metal bar, and holds it against its chest. Meanwhile, the elephant approaches a couple getting into their car and pulls its gun, and a middle-aged cat nervously offers its keys as the rabbit drives down the street towards the elephant, stopping as the elephant slaps the bonnet of the Spanish police car. The dolphin suddenly breaks, backs up, and spots the elephant climbing into the rabbit's police car, setting off in pursuit as the dolphin wears a focused expression, drifting around corners and weaving through traffic right behind them, pulling out its cell phone. A taxi plows into the side of the dolphin's hatchback, sending its small blue car into a spin along the road behind the rabbit, but the dolphin rights the vehicle with a determined frown. The rabbit looks back as the dolphin throws its car into gear and accelerates after the rabbit, who power-slides around a corner with the dolphin in hot pursuit. The rabbit gets on the radio, while the pigeon glances anxiously across at the unicorn who holds onto its seat belt. The dolphin races past pavements full of panicking pedestrians, dodging traffic, as the elephant fidgets anxiously in the police car's passenger seat. Crocodiles frantically direct scared members of the public away from the chase as both cars head through a junction."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Sam spots the cable car stuck on the seventh bridge, while elsewhere, a sweaty Javier glares at Veronica then lowers the violin, only to raise it again as Veronica relaxes. Veronica shakes her head, and Javier relents, leaving her in the cable car and touching his ankle in the corridor, bringing his palm away bloody. Javier, dressed in a Spanish firefighter's uniform, heads down the stairwell in the museum. Outside, Sam sees Veronica leaving the cable car with a covered sled, and rushes to help, wheeling it while Veronica tends the candle. The President is covered by a purple quilt. Javier leaves the atrium and on the street checks his compass. Sam and Veronica wheel the President's sled over to the wagon as Luis runs up to them, climbs in, and Sam shuts the gate. The wagon pulls away from the chaos outside the museum. In a speeding bicycle, Barnes answers his pager, shifts movements, and moves through traffic in the narrow alley. On a different alley, Sam weaves through traffic in the wagon, and inside, Ashton, lying under the quilt, opens his eyes, lowers a shade, and, as the wagon rounds a corner, falls to the floor. Taylor speeds along in a Spanish fire truck while Veronica smiles at Sam in the driver's seat. Then Enrique runs across the ditch in front of them and exchanges a stunned glance with Veronica. Sam looks shiftily across at Veronica as Veronica shoots Luis point blank while Ashton cowers on the floor by the sled, then reaches out for the candle support, disconnects the metal pole, and holds it against his chest. Meanwhile, Javier approaches a couple getting into their motorcycle and pulls his violin, and a middle-aged man nervously offers his helmet as Taylor drives down the alley towards Javier, stopping as Javier slaps the hood of the Spanish fire truck. Barnes suddenly breaks, backs up, and spots Javier climbing into Taylor's fire truck, setting off in pursuit as Barnes wears a focused expression, drifting around corners and weaving through traffic right behind them, pulling out his pager. A rickshaw plows into the side of Barnes's bicycle, sending his small blue bike into a spin along the alley behind Taylor, but Barnes rights the vehicle with a determined frown. Taylor looks back as Barnes throws his bike into motion and accelerates after Taylor, who power-slides around a corner with Barnes in hot pursuit. Taylor gets on the megaphone, while Sam glances anxiously across at Veronica who holds onto her shoulder strap. Barnes races past pavements full of panicking shoppers, dodging traffic, as Javier fidgets anxiously in the fire truck's passenger seat. Lifeguards frantically direct scared members of the public away from the chase as both vehicles head through a crossing."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Sam notices the elevator paused on the seventh floor, while elsewhere, a sweaty Javier frowns at Veronica then drops the gun, only to pick it up again as Veronica sits. Veronica shrugs, and Javier concedes, abandoning her in the elevator and brushing his stomach in the corridor, noticing his hand stained red. Javier, dressed in a Spanish policeman's outfit, descends the stairwell in the hotel. Outside, Sam observes Veronica exiting the elevator with a covered gurney, and sprints to aid, steering it while Veronica adjusts the drip. The President is concealed by a blue blanket. Javier exits the annex and on the street glances at his watch. Sam and Veronica steer the President's gurney over to the ambulance as Luis runs up to them, hops in, and Sam closes the door. The ambulance departs from the commotion outside the hotel. In a speeding hatchback, Barnes listens to his cell phone, changes gear, and navigates through traffic in the narrow street. On a different street, Sam maneuvers through traffic in the ambulance, and inside, Ashton, resting under the blanket, opens his eyes, lifts a sidebar, and, as the ambulance turns a corner, slips to the floor. Taylor races along in a Spanish police car while Veronica grins at Sam in the driver's seat. Then Enrique dashes across the road in front of them and locks eyes with Veronica in surprise. Sam glances sideways at Veronica as Veronica fires at Luis point blank while Ashton crouches on the floor by the gurney, then grasps at the drip support, unhooks the metal bar, and presses it to his chest. Meanwhile, Javier approaches a couple getting into their car and displays his gun, and a middle-aged man anxiously hands over his keys as Taylor drives down the street towards Javier, halting as Javier thumps the bonnet of the Spanish police car. Barnes suddenly halts, reverses, and notices Javier climbing into Taylor's police car, chasing after them as Barnes maintains a concentrated expression, turning sharply around corners and navigating through traffic right behind them, dialing his cell phone. A taxi collides into the side of Barnes's hatchback, sending his small blue car spinning along the road behind Taylor, but Barnes steadies the vehicle with a resolute frown. Taylor observes as Barnes shifts his car into gear and accelerates after Taylor, who drifts around a corner with Barnes in close pursuit. Taylor communicates on the radio, while Sam looks nervously across at Veronica who clutches her seat belt. Barnes speeds past sidewalks full of panicked pedestrians, weaving through traffic, as Javier squirms uneasily in the police car's passenger seat. Policemen hastily redirect frightened members of the public away from the chase as both cars cross through a junction."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Charlie spots the bookshelf stuck on the seventh floor, while elsewhere, a sweaty telephone glares at a laptop then lowers the broom, only to raise it again as the laptop relaxes. The laptop shakes its head, and the telephone relents, leaving it in the bookshelf and touching its knee in the corridor, bringing its elbow away bloody. The telephone, dressed in a Spanish chef's uniform, heads down the railings in the theater. Outside, Charlie sees the laptop leaving the bookshelf with a covered teapot, and rushes to help, wheeling it while the laptop tends the balloon. The camel is covered by a blue newspaper. The telephone leaves the arcade and on the avenue checks its calendar. Charlie and the laptop wheel the camel's teapot over to the submarine as a guitar runs up to them, climbs in, and Charlie shuts the window. The submarine pulls away from the chaos outside the theater. In a speeding canoe, a toaster answers its tablet, shifts gear, and moves through pedestrians in the narrow avenue. On a different avenue, Charlie weaves through pedestrians in the submarine, and inside, a cactus, lying under the newspaper, opens its eyebrows, lowers a fence, and, as the submarine rounds a corner, falls to the floor. Gordon speeds along in a Spanish taxi while the laptop smiles at Charlie in the pilot's seat. Then a pineapple runs across the sidewalk in front of them and exchanges a stunned glance with the laptop. Charlie looks shiftily across at the laptop as the laptop shoots the guitar point blank while the cactus cowers on the floor by the teapot, then reaches out for the balloon support, disconnects the plastic chair, and holds it against its chest. Meanwhile, the telephone approaches a couple getting into their mailbox and pulls its broom, and a middle-aged penguin nervously offers its headphones as Gordon drives down the avenue towards the telephone, stopping as the telephone slaps the balloon of the Spanish taxi. The toaster suddenly breaks, backs up, and spots the telephone climbing into Gordon's taxi, setting off in pursuit as the toaster wears a focused expression, drifting around lampposts and weaving through pedestrians right behind them, pulling out its tablet. A horse plows into the side of the toaster's canoe, sending its small pink canoe into a spin along the avenue behind Gordon, but the toaster rights the vessel with a determined frown. Gordon looks back as the toaster throws its canoe into gear and accelerates after Gordon, who power-slides around a lamppost with the toaster in hot pursuit. Gordon gets on the radio, while Charlie glances anxiously across at the laptop who holds onto its helmet. The toaster races past platforms full of panicking bicycles, dodging pedestrians, as the telephone fidgets anxiously in the taxi's passenger bench. Bakers frantically direct scared mugs of the public away from the chase as both canoes head through a junction."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Alex observes the escalator trapped on the ninth floor, while elsewhere, a drenched Carlos sneers at Emily then drops the flashlight, only to pick it up again as Emily stretches. Emily shrugs, and Carlos concedes, leaving her in the escalator and touching his shoulder in the hallway, pulling his hand away bruised. Carlos, dressed in a French firefighter's uniform, ascends the staircase in the mall. Outside, Alex notices Emily departing the escalator with a concealed crate, and sprints to assist, pushing it while Emily monitors the monitor. The Manager is hidden by a green tarp. Carlos exits the arcade and on the avenue inspects his watch. Alex and Emily push the Manager's crate over to the helicopter as Mario jogs up to them, climbs aboard, and Alex closes the hatch. The helicopter lifts off from the pandemonium outside the mall. In a racing convertible, Wilson answers his walkie-talkie, changes lane, and navigates through traffic on the congested avenue. On an alternate avenue, Alex maneuvers through traffic in the helicopter, and inside, Jordan, lying beneath the tarp, closes his eyes, lifts an armrest, and, as the helicopter banks a curve, rolls to the wall. Taylor accelerates along in a French ambulance while Emily grins at Alex in the pilot's seat. Then Miguel dashes across the avenue in front of them and locks eyes briefly with Emily. Alex glances nervously across at Emily as Emily strikes Mario directly while Jordan huddles on the wall by the crate, then reaches out for the monitor stand, disconnects the wooden rod, and clasps it against his ribcage. Meanwhile, Carlos approaches a couple entering their van and aims his flashlight, and a middle-aged woman hesitantly hands over her purse as Taylor speeds down the avenue towards Carlos, pausing as Carlos knocks the roof of the French ambulance. Wilson unexpectedly reverses, retreats, and notices Carlos stepping into Taylor's ambulance, starting off in pursuit as Wilson sports a serious look, skidding around bends and weaving through vehicles right behind them, pulling out his walkie-talkie. A lorry crashes into the side of Wilson's convertible, sending his small red car into a swirl along the avenue behind Taylor, but Wilson corrects the vehicle with a concentrated scowl. Taylor checks the rear as Wilson shifts his car into gear and accelerates after Taylor, who drifts around a bend with Wilson closely following. Taylor speaks into the intercom, while Alex peeks nervously across at Emily who grips her harness. Wilson dashes past sidewalks filled with fleeing shoppers, avoiding vehicles, as Carlos squirms uncomfortably in the ambulance's back seat. Firefighters hectically guide anxious members of the public away from the pursuit as both vehicles speed through an intersection."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Sam notices the bicycle hanging on the third floor, while elsewhere, a drenched Javier laughs at Veronica then drops the broom, only to pick it up again as Veronica stretches. Veronica shrugs her shoulders, and Javier agrees, leaving her in the bicycle and patting his chest in the hallway, bringing his fingertips away dirty. Javier, dressed in a Spanish sailor's uniform, marches down the elevator in the cinema. Outside, Sam notices Veronica emerging from the bicycle with a hidden stretcher, and rushes to dance, dragging it while Veronica monitors the kite. The President is shielded by a green tarp. Javier departs the theater and on the avenue checks his compass. Sam and Veronica drag the President's stretcher over to the firetruck as Luis saunters up to them, hops in, and Sam latches the window. The firetruck zooms away from the festival outside the cinema. In a rolling skateboard, Barnes answers his walkie-talkie, flips a switch, and cruises through pedestrians in the open square. On a different boulevard, Sam weaves through people in the firetruck, and inside, Ashton, resting under the tarp, opens his mouth, unlatches a window, and, as the firetruck turns a bend, slides to the ground. Taylor glides along in a Spanish postal truck while Veronica waves at Sam in the passenger's seat. Then Enrique sprints across the alley in front of them and exchanges a bewildered glance with Veronica. Sam looks nervously over at Veronica as Veronica tickles Luis directly while Ashton hides on the floor by the stretcher, then reaches out for the kite string, unravels the spool, and wraps it around his elbow. Meanwhile, Javier approaches a duo boarding their boat and waves his clock, and a middle-aged woman reluctantly offers her compass as Taylor glides down the lane towards Javier, halting as Javier taps on the trunk of the Spanish postal truck. Barnes suddenly pauses, reverses, and notices Javier entering Taylor's postal truck, heading off in search as Barnes wears a curious expression, drifting around bends and swerving through crowds right behind them, dialing his walkie-talkie. A moped crashes into the side of Barnes's skateboard, sending his small orange board into a whirl along the path behind Taylor, but Barnes steadies the skateboard with a determined grin. Taylor peers back as Barnes kicks his skateboard into position and glides after Taylor, who slides around a bend with Barnes close behind. Taylor tunes the radio, while Sam glances worriedly over at Veronica who clutches her backpack. Barnes zooms past squares full of fleeing cyclists, dodging people, as Javier squirms restlessly in the postal truck's back seat. Sailors frantically guide bewildered tourists away from the pursuit as both vehicles pass through a plaza."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Max observes the crane stalled on the fourth terrace, while nearby, an exhausted Carlos winks at Amelia then drops the broom, only to pick it up again as Amelia yawns. Amelia shrugs her shoulders, and Carlos capitulates, leaving her in the crane and patting his knee on the veranda, bringing his thumb away bruised. Carlos, clad in a French firefighter's outfit, descends up the escalator in the library. Indoors, Max notices Amelia departing the crane with a veiled suitcase, and charges to intervene, lifting it while Amelia adjusts the sprinkler. The Emperor is shrouded by a green towel. Carlos exits the courtyard and on the lane checks his thermometer. Max and Amelia roll the Emperor's suitcase over to the helicopter as Pedro jogs towards them, climbs up, and Max seals the hatch. The helicopter lifts off from the hustle inside the library. In a soaring hang glider, Clark hears his wristwatch beep, increases altitude, and glides through clouds in the open sky. On an alternate road, Max maneuvers through clouds in the helicopter, and inside, Oliver, hiding under the towel, blinks his eyes, raises a curtain, and, as the helicopter curves around an oak, tumbles to the ceiling. Robin zooms along in a French ambulance while Amelia grins at Max in the pilot's seat. Suddenly, Carlos dashes across the grass ahead of them and trades a bewildered grin with Amelia. Max peeks slyly across at Amelia as Amelia strikes Pedro with a feather while Oliver quivers on the ceiling by the suitcase, then reaches out for the sprinkler bracket, detaches the aluminum rod, and clutches it against his chin. Meanwhile, Carlos nears a duo boarding their bus and flashes his locket, and an elderly woman timidly presents her purse as Robin accelerates down the road towards Carlos, pausing as Carlos pats the roof of the French ambulance. Clark abruptly swerves, flips around, and glimpses Carlos scrambling into Robin's ambulance, kicking off on his heels as Clark dons a determined scowl, swinging around meadows and swerving through clouds just behind them, dialing his wristwatch. A motorhome crashes into the back of Clark's hang glider, sending his small orange vehicle into a whirl through the sky behind Robin, but Clark steadies the craft with a resolute grimace. Robin glances back as Clark thrusts his glider into the breeze and propels after Robin, who glides around a boulder with Clark in eager chase. Robin radios in, while Max gazes worriedly across at Amelia who clasps onto her backpack. Clark streaks past meadows crowded with frantic tourists, avoiding clouds, as Carlos fidgets nervously in the ambulance's copilot seat. Medics anxiously guide apprehensive passersby away from the spectacle as both gliders soar through a meadow."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Sam notices an elevator stuck on the seventh floor. Inside, Javier, a Spanish policeman, lowers his gun at Veronica, then raises it again before eventually relenting. Bleeding from the stomach, Javier exits the elevator and heads down the stairwell. Outside, Sam helps Veronica wheel a gurney from the elevator, with the President covered by a blue blanket. Luis joins them, and they load the President into an ambulance, escaping the busy hotel scene. Meanwhile, Barnes, in a speeding hatchback, answers a call while maneuvering through traffic. In the ambulance, Ashton awakens under the blanket, falls to the floor as the vehicle turns, and grabs a drip support. Veronica smiles at Sam but then shoots Luis point-blank. Javier confronts a couple for their car keys when Taylor, in a police car, arrives. Barnes, pursuing in his hatchback, collides with a taxi but recovers and continues chasing Taylor, who speeds away with Javier as a passenger. Barnes follows closely, dodging traffic and pedestrians, while policemen attempt to direct the panicked public away from the chase."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Policemen frantically direct scared members of the public away from the chase as both cars head through a junction Barnes races past pavements full of panicking pedestrians dodging traffic as Javier fidgets anxiously in the police car's passenger seat  Taylor gets on the radio while Sam glances anxiously across at Veronica who holds onto her seat belt  Taylor looks back as Barnes throws his car into gear and accelerates after Taylor who powerslides around a corner with Barnes in hot pursuit  A taxi plows into the side of Barnes's hatchback sending his small blue car into a spin along the road behind Taylor but Barnes rights the vehicle with a determined frown  Barnes suddenly breaks backs up and spots Javier climbing into Taylor's police car setting off in pursuit as Barnes wears a focused expression drifting around corners and weaving through traffic right behind them pulling out his cell phone  Meanwhile Javier approaches a couple getting into their car and pulls his gun and a middleaged man nervously offers his keys as Taylor drives down the street towards Javier stopping as Javier slaps the bonnet of the Spanish police car  support disconnects the metal bar and holds it against his chest  Sam looks shiftily across at Veronica as Veronica shoots Luis point blank while Ashton cowers on the floor by the gurney then reaches out for the drip  Then Enrique runs across the road in front of them and exchanges a stunned glance with Veronica  Taylor speeds along in a Spanish police car while Veronica smiles at Sam in the driver's seat  Ashton lying under the blanket opens his eyes lowers a sidebar and as the ambulance rounds a corner falls to the floor  On a different street Sam weaves through traffic in the ambulance and inside  In a speeding hatchback Barnes answers his cell phone shifts gear and moves through traffic in the narrow street  The ambulance pulls away from the chaos outside the hotel  Sam and Veronica wheel the President's gurney over to the ambulance as Luis runs up to them climbs in and Sam shuts the door  Javier leaves the annex and on the street checks his watch  The President is covered by a blue blanket  Outside Sam sees Veronica leaving the elevator with a covered gurney and rushes to help wheeling it while Veronica tends the drip  bloody Javier dressed in a Spanish policeman's uniform heads down the stairwell in the hotel  Veronica shakes her head and Javier relents leaving her in the elevator and touching his stomach in the corridor bringing his palm away  Sam spots the elevator stuck on the seventh floor while elsewhere a sweaty Javier glares at Veronica then lowers the gun only to raise it again as Veronica relaxes "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "On a different street Sam weaves through traffic in the ambulance and inside  Outside Sam sees Veronica leaving the elevator with a covered gurney and rushes to help wheeling it while Veronica tends the drip  Ashton lying under the blanket opens his eyes lowers a sidebar and as the ambulance rounds a corner falls to the floor  Barnes suddenly breaks backs up and spots Javier climbing into Taylor's police car setting off in pursuit as Barnes wears a focused expression drifting around corners and weaving through traffic right behind them pulling out his cell phone  Meanwhile Javier approaches a couple getting into their car and pulls his gun and a middleaged man nervously offers his keys as Taylor drives down the street towards Javier stopping as Javier slaps the bonnet of the Spanish police car  Taylor looks back as Barnes throws his car into gear and accelerates after Taylor who powerslides around a corner with Barnes in hot pursuit  Veronica shakes her head and Javier relents leaving her in the elevator and touching his stomach in the corridor bringing his palm away  Taylor gets on the radio while Sam glances anxiously across at Veronica who holds onto her seat belt  The President is covered by a blue blanket  Javier leaves the annex and on the street checks his watch  Sam and Veronica wheel the President's gurney over to the ambulance as Luis runs up to them climbs in and Sam shuts the door  Taylor speeds along in a Spanish police car while Veronica smiles at Sam in the driver's seat  bloody Javier dressed in a Spanish policeman's uniform heads down the stairwell in the hotel  Policemen frantically direct scared members of the public away from the chase as both cars head through a junction Then Enrique runs across the road in front of them and exchanges a stunned glance with Veronica  Sam spots the elevator stuck on the seventh floor while elsewhere a sweaty Javier glares at Veronica then lowers the gun only to raise it again as Veronica relaxes  In a speeding hatchback Barnes answers his cell phone shifts gear and moves through traffic in the narrow street  support disconnects the metal bar and holds it against his chest  The ambulance pulls away from the chaos outside the hotel  Sam looks shiftily across at Veronica as Veronica shoots Luis point blank while Ashton cowers on the floor by the gurney then reaches out for the drip  A taxi plows into the side of Barnes's hatchback sending his small blue car into a spin along the road behind Taylor but Barnes rights the vehicle with a determined frown  Barnes races past pavements full of panicking pedestrians dodging traffic as Javier fidgets anxiously in the police car's passenger seat "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Taylor speeds along in a Spanish police car while Veronica smiles at Sam in the driver's seat  Then Enrique runs across the road in front of them and exchanges a stunned glance with Veronica  Sam looks shiftily across at Veronica as Veronica shoots Luis point blank while Ashton cowers on the floor by the gurney then reaches out for the drip  support disconnects the metal bar and holds it against his chest  Meanwhile Javier approaches a couple getting into their car and pulls his gun and a middleaged man nervously offers his keys as Taylor drives down the street towards Javier stopping as Javier slaps the bonnet of the Spanish police car  Barnes suddenly breaks backs up and spots Javier climbing into Taylor's police car setting off in pursuit as Barnes wears a focused expression drifting around corners and weaving through traffic right behind them pulling out his cell phone  A taxi plows into the side of Barnes's hatchback sending his small blue car into a spin along the road behind Taylor but Barnes rights the vehicle with a determined frown  Taylor looks back as Barnes throws his car into gear and accelerates after Taylor who powerslides around a corner with Barnes in hot pursuit  Taylor gets on the radio while Sam glances anxiously across at Veronica who holds onto her seat belt  Barnes races past pavements full of panicking pedestrians dodging traffic as Javier fidgets anxiously in the police car's passenger seat  Policemen frantically direct scared members of the public away from the chase as both cars head through a junction Sam spots the elevator stuck on the seventh floor while elsewhere a sweaty Javier glares at Veronica then lowers the gun only to raise it again as Veronica relaxes  Veronica shakes her head and Javier relents leaving her in the elevator and touching his stomach in the corridor bringing his palm away  bloody Javier dressed in a Spanish policeman's uniform heads down the stairwell in the hotel  Outside Sam sees Veronica leaving the elevator with a covered gurney and rushes to help wheeling it while Veronica tends the drip  The President is covered by a blue blanket  Javier leaves the annex and on the street checks his watch  Sam and Veronica wheel the President's gurney over to the ambulance as Luis runs up to them climbs in and Sam shuts the door  The ambulance pulls away from the chaos outside the hotel  In a speeding hatchback Barnes answers his cell phone shifts gear and moves through traffic in the narrow street  On a different street Sam weaves through traffic in the ambulance and inside  Ashton lying under the blanket opens his eyes lowers a sidebar and as the ambulance rounds a corner falls to the floor "
        }
      ]
    }
  ]
}