{
  "ground_truth": "A lady's hand is at work on a delicate piece of floral embroidery. Darcy emerges from the parsonage with his lips drawn tight, pulling on his dark leather gloves. Inside, Lizzie begins to pace around the drawing room, and tears spring into her eyes. Meanwhile, Darcy hurries into a room upstairs, looking deeply troubled, and stands in the middle of the room. He dashes over to a bureau, pulls out a sheet of paper, picks up a pen, dips it into an ink pot, then sets about writing a letter. He replenishes the nib with ink, puts down the pen, and leans back in his chair with a defeated air. Next, he goes over to the paned window, observing the two young boys with their fishing rods and nets scrambling down a hill towards the river. Darcy strides through cloisters in his gown and mortarboard and throws open a door to find Wickham in a compromising position with a lady, but Wickham just smiles at him. Darcy hands Wickham a check, and as Wickham turns at the door, he bumps into Darcy's sister and kisses her hand with a flirtatious smile. Georgiana and Wickham walk arm-in-arm by the sea. Darcy's carriage pulls up at the sea front, and he jumps down to peer over a wall, seeing Wickham and Georgiana on the rocks below together. Georgiana spies her brother and her face breaks into a smile. When the door has closed behind Wickham, Georgiana turns her sorrowful gaze to Darcy and slowly walks over to be comforted by him. With the letter finished, a now disheveled Darcy leans wearily back in his chair and closes his eyes, then, with renewed energy, dips his pen in the ink pot once more. Outside, the sun is setting, casting a salmon pink glow over Rosings. The next morning, Darcy splashes his face with water from a silver basin, then pats it dry. He's still wearing the same white shirt from the night before, with the top few buttons undone, and his manner is troubled and agitated. He snuffs out last night's candle, which is all but burned out, and on the bureau is the sealed letter addressed to Miss Elizabeth Bennet. Lizzy wanders over to the breakfast table, then heads out, leaving the others to resume their breakfast. It's a bright, sunny day, and Lizzy takes a walk in the park, swinging her bonnet casually to and fro. Suddenly, she breaks into a run, racing as fast as she can across the grass, slows down to a walk again, and heads onward through the trees, not really taking in her surroundings. Suddenly, she becomes aware of a man standing with his back to her, a few meters ahead, and he turns just as she's trying to slip away unnoticed.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "A woman’s hand is at labor on a delicate piece of floral needlework. Darcy surfaces from the rectory with his lips drawn tight, pulling on his dark leather gloves. Inside, Lizzie begins to stride around the sitting room, and tears spring into her eyes. Meanwhile, Darcy rushes into a chamber upstairs, looking profoundly troubled, and stands in the center of the chamber. He dashes over to a desk, pulls out a sheet of paper, picks up a pen, dips it into an ink pot, then sets about composing a note. He replenishes the nib with ink, puts down the pen, and leans back in his seat with a defeated air. Next, he goes over to the gridded window, observing the two young lads with their fishing poles and nets scrambling down a hill towards the river. Darcy strides through cloisters in his gown and mortarboard and throws open a doorway to find Wickham in a compromising situation with a woman, but Wickham just grins at him. Darcy hands Wickham a check, and as Wickham turns at the doorway, he bumps into Darcy's sister and kisses her hand with a flirtatious grin. Georgiana and Wickham walk arm-in-arm by the ocean. Darcy's carriage pulls up at the shore front, and he jumps down to peer over a wall, seeing Wickham and Georgiana on the rocks below together. Georgiana spies her brother and her face breaks into a grin. When the doorway has closed behind Wickham, Georgiana turns her sorrowful gaze to Darcy and slowly walks over to be comforted by him. With the note finished, a now disheveled Darcy leans wearily back in his seat and closes his eyes, then, with renewed vigor, dips his pen in the ink pot once more. Outside, the sun is setting, casting a salmon pink glow over Rosings. The next morning, Darcy splashes his face with water from a silver basin, then pats it dry. He's still wearing the same white shirt from the night before, with the top few buttons undone, and his manner is troubled and agitated. He snuffs out last night's candle, which is all but burned out, and on the desk is the sealed note addressed to Miss Elizabeth Bennet. Lizzy wanders over to the breakfast table, then heads out, leaving the others to resume their meal. It's a bright, sunny day, and Lizzy takes a stroll in the park, swinging her bonnet casually to and fro. Suddenly, she breaks into a sprint, racing as fast as she can across the grass, slows down to a walk again, and heads onward through the trees, not really taking in her surroundings. Suddenly, she becomes aware of a gentleman standing with his back to her, a few meters ahead, and he turns just as she's trying to slip away unnoticed."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "A delicate piece of floral embroidery is being worked on by a lady's hand. The parsonage is exited by Darcy with his lips drawn tight, and he pulls on his dark leather gloves. Inside, the drawing room is paced around by Lizzie, and tears spring into her eyes. Meanwhile, a room upstairs is hurried into by Darcy, looking deeply troubled, and he stands in the middle of it. Over to a bureau, he dashes, a sheet of paper is pulled out, a pen is picked up, and, dipping it into an ink pot, a letter is set about being written by him. The nib is replenished with ink by him, the pen is put down, and he leans back in his chair with a defeated air. Next, a paned window is approached by him, and he observes the two young boys with their fishing rods and nets scrambling down a hill towards the river. Cloisters are stridden through by Darcy in his gown and mortarboard, a door is thrown open to find Wickham in a compromising position with a lady, but Wickham just smiles at him. A check is handed to Wickham by Darcy, and as Wickham turns at the door, Darcy's sister is bumped into, and her hand is kissed by Wickham with a flirtatious smile. The sea is walked by Georgiana and Wickham arm-in-arm. Darcy's carriage pulls up at the sea front, and he jumps down to peer over a wall, seeing Wickham and Georgiana on the rocks below together. Her brother is spied by Georgiana, and a smile breaks onto her face. When Wickham closes the door behind him, Georgiana turns her sorrowful gaze to Darcy and slowly walks over to be comforted by him. With the letter finished, a now disheveled Darcy wearily leans back in his chair and closes his eyes, then, with renewed energy, he dips his pen in the ink pot once more. Outside, a salmon pink glow is cast over Rosings by the setting sun. The next morning, Darcy splashes his face with water from a silver basin, then pats it dry. The same white shirt from the night before is still being worn by him, with the top few buttons undone, and his manner is troubled and agitated. Last night's candle, which is all but burned out, is snuffed out by him, and on the bureau is the sealed letter addressed to Miss Elizabeth Bennet. Lizzy wanders over to the breakfast table, then heads out, leaving the others to resume their breakfast. A bright, sunny day presents itself, and a walk in the park is taken by Lizzy, swinging her bonnet casually to and fro. Suddenly, she breaks into a run, racing as fast as she can across the grass, slows down to a walk again, and heads onward through the trees, not really taking in her surroundings. Suddenly, she becomes aware of a man standing with his back to her, a few meters ahead, and he turns just as she's trying to slip away unnoticed."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "A lady's hand works on delicate floral embroidery. Darcy exits the parsonage, lips tight, donning dark gloves. Inside, Lizzie paces the drawing room, tears in her eyes. Meanwhile, Darcy, troubled, rushes upstairs, grabs paper, a pen, dips it in ink, and begins writing a letter. After refreshing the nib, he leans back wearily, then observes two boys with fishing rods heading to the river. Darcy, in cloak and mortarboard, opens a door to find Wickham in a compromising position with a lady; Wickham just smiles. Darcy hands Wickham a check, who then bumps into Darcy's sister, kissing her hand flirtatiously. Georgiana and Wickham stroll by the sea. Darcy’s carriage arrives at the seafront, and he sees them on the rocks below. Georgiana smiles at her brother. After Wickham departs, Georgiana turns to Darcy, seeking comfort. With the letter done, Darcy, disheveled, closes his eyes, then regains energy, dipping his pen in ink again. Sunset casts a salmon glow over Rosings. The next morning, Darcy washes his face, wearing the same shirt, top buttons undone, troubled. He extinguishes a nearly burned-out candle; the sealed letter to Miss Elizabeth Bennet rests on the bureau. Lizzy heads to the breakfast table, then walks in the sunny park, swinging her bonnet. She suddenly runs across the grass, slows to a walk, and notices a man ahead, who turns just as she tries to leave unnoticed."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "A lady's hand works on delicate floral embroidery. Darcy exits the parsonage, tight-lipped, donning dark leather gloves. Lizzie paces the drawing room, tears in her eyes. Darcy, troubled, rushes to a room, writes a letter at a bureau, then watches boys by the river. In his gown and mortarboard, he finds Wickham with a lady; Wickham grins, receives a check, and flirts with Darcy's sister, Georgiana. Georgiana and Wickham walk by the sea. Darcy's carriage arrives, he sees them together, Georgiana smiles. After Wickham leaves, Georgiana looks sorrowfully at Darcy. Finished, a disheveled Darcy closes his eyes. Renewed, he writes again. At sunset, Rosings glows pink. The next morning, Darcy, still in last night's shirt, is agitated. He extinguishes a burnt-out candle; a sealed letter for Miss Elizabeth Bennet lies on the bureau. Lizzy leaves the breakfast table for a sunny park walk, swinging her bonnet. She runs across the grass, then slows, and notices a man ahead who turns as she tries to slip away."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "A woman's delicate hand is seen skillfully at work on an intricate piece of floral embroidery, the threads intertwining to create a beautiful design. Meanwhile, Darcy emerges from the parsonage, his expression stern and determined, his lips drawn into a tight line as he meticulously pulls on his dark, supple leather gloves. Inside, Lizzie begins to pace anxiously around the drawing room, her emotions unraveling as tears start to spring into her eyes. In a parallel moment, Darcy hurries into a room upstairs, looking deeply troubled, and he comes to a halt in the center of the room, standing still as if gathering his thoughts. Quickly, he moves over to a nearby bureau, where he pulls out a crisp sheet of paper, picks up a pen, dips it carefully into an ink pot, and sets about writing a letter with focused determination. He replenishes the nib with more ink several times, sets the pen down, and leans back in his chair with an air of defeat weighing heavily upon him. Next, he wanders over to the paned window, observing two young boys with their fishing rods and nets scrambling enthusiastically down a hill towards the river. \n\nDarcy strides purposefully through cloisters, cloaked in his scholarly gown and mortarboard, and throws open a door to unexpectedly find Wickham in a compromising position with a lady. However, Wickham merely smiles at him with a look of defiance. Darcy, maintaining his composure, hands Wickham a check, and as Wickham turns to leave through the door, he bumps into Darcy's sister. With a flirtatious, charismatic smile, he kisses her hand. Georgiana, visibly charmed, walks arm-in-arm with Wickham along the serene seaside. Darcy's carriage soon pulls up at the sea front, and he jumps down to peer intently over a low wall, spotting Wickham and Georgiana on the rocks below, standing close together. Georgiana catches sight of her brother and her face transforms, breaking into a warm, radiant smile. However, when the door has closed behind Wickham, Georgiana turns her sorrowful gaze towards Darcy and slowly walks over to seek comfort and solace from him. \n\nBack in his room, with the letter finally finished, a now disheveled Darcy leans back wearily in his chair and closes his eyes momentarily, as if seeking rest, then, with renewed energy, dips the pen in the ink pot once more, his resolve unwavering. Outside, the sun is setting, casting a soft salmon pink glow over the stately Rosings estate. The following morning arrives, and Darcy splashes his face with cool water from a gleaming silver basin, then pats it dry. He is still wearing the same white shirt from the night before, the top few buttons undone, and his manner is both troubled and agitated. He snuffs out last night's candle, which has nearly burned itself out, and on the bureau lies the sealed letter addressed to Miss Elizabeth Bennet. \n\nLizzy leisurely wanders over to the breakfast table, then decides to head out, leaving the others to continue their breakfast in her absence. It's a bright, sunny day, and Lizzy takes a tranquil walk in the park, casually swinging her bonnet to and fro, seemingly without a care in the world. Suddenly, she breaks into a spontaneous run, racing as fast as she can across the lush green grass, before slowing down to a walk once more, making her way onward through the trees, not really taking in the beauty of her surroundings. Abruptly, she becomes aware of a man standing just a few meters ahead, with his back turned to her, and he turns around unexpectedly just as she's trying to slip away unnoticed."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "A woman's delicate and graceful hand is seen skillfully at work on an intricate piece of floral embroidery, with the colorful threads intertwining to create a stunningly beautiful design. Meanwhile, Darcy emerges from the parsonage with a stern and determined expression, his lips drawn into a tight line as he meticulously pulls on his dark, supple leather gloves. Inside the drawing room, Lizzie begins to pace anxiously around, her emotions slowly unraveling as tears start to spring into her eyes. In a parallel moment taking place upstairs, Darcy hurries into a room looking deeply troubled, and he comes to a halt in the center, standing still as if he is gathering his thoughts. Quickly, he moves over to a nearby bureau where he pulls out a crisp sheet of paper, picks up a pen, dips it carefully into an ink pot, and sets about writing a letter with focused determination. He repeatedly replenishes the nib with more ink several times, sets the pen down, and leans back in his chair with an air of defeat weighing heavily upon him. Next, he wanders over to the paned window, observing two young boys with their fishing rods and nets scrambling enthusiastically down a hill towards the river.\n\nDarcy strides purposefully through the cloisters, cloaked in his scholarly gown and mortarboard, and throws open a door to unexpectedly find Wickham in a compromising position with a lady. However, Wickham merely smiles at him with a look of defiance and nonchalance. Darcy, maintaining his composure and dignity, hands Wickham a check, and as Wickham turns to leave through the door, he unexpectedly bumps into Darcy's sister. With a flirtatious and charismatic smile, he kisses her hand in greeting. Georgiana, visibly charmed by his manner, walks arm-in-arm with Wickham along the serene and peaceful seaside. Soon, Darcy's carriage pulls up at the sea front, and he jumps down to peer intently over a low wall, spotting Wickham and Georgiana on the rocks below, standing close together. Georgiana catches sight of her brother, and her face transforms, breaking into a warm, radiant smile. However, when the door has closed behind Wickham, Georgiana turns her sorrowful gaze towards Darcy and slowly walks over to seek comfort and solace from him.\n\nBack in his room, with the letter finally finished, a now slightly disheveled Darcy leans back wearily in his chair and closes his eyes momentarily, as if seeking rest. Then, with renewed energy and determination, he dips the pen in the ink pot once more, his resolve unwavering. Outside, the sun is setting, casting a soft salmon-pink glow over the grand and stately Rosings estate. The following morning arrives, and Darcy splashes his face with cool, refreshing water from a gleaming silver basin, then pats it dry. He is still wearing the same white shirt from the night before, the top few buttons undone, and his manner is both troubled and agitated. He snuffs out last night's candle, which has nearly burned itself out, and on the bureau lies the sealed letter addressed to Miss Elizabeth Bennet.\n\nLizzy leisurely wanders over to the breakfast table, then decides to head out, leaving the others to continue their breakfast in her absence. It's a bright, sunny day, and Lizzy takes a tranquil and peaceful walk in the park, casually swinging her bonnet to and fro as she moves along, seemingly without a care in the world. Suddenly, she breaks into a spontaneous run, racing as fast as she can across the lush green grass, before slowing down to a walk once more, making her way onward through the trees, not really taking in the beauty of her surroundings. Abruptly, she becomes aware of a man standing just a few meters ahead, with his back turned to her, and he turns around unexpectedly just as she is trying to slip away unnoticed."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "A lady delicately maneuvers her fingers, skillfully working on an intricate piece of floral embroidery with precise and careful movements. Simultaneously, outside the parsonage, Darcy emerges with an expression that suggests stern resolve was etched across his face, lips drawn tightly, as he methodically pulls on each dark leather glove, ensuring the snug fit and comfort. Inside, Lizzie begins to pace around the drawing room, her steps quickening with each pass, as a torrent of emotions broils within her, culminating in tears that well up and spill over onto her cheeks. Meanwhile, Darcy quickly makes his way into a room upstairs, every step exuding haste, carrying the weight of intense trouble, and upon reaching the center of the room, he stands momentarily to gather his thoughts. Resolute, Darcy darts over to the bureau, hastily opens a drawer to retrieve a crisp sheet of paper, and seizes a pen. With deliberate precision, he dips the nib into the ink pot, ensuring it is properly saturated, and begins the arduous task of writing a letter, his thoughts flowing onto the paper with each stroke. As the ink diminishes, he meticulously replenishes the pen, places it down gently, and resigns into the chair, exuding an air of defeat. Rising from the chair, he makes his way over to the paned window, where he gazes intently at two young boys, observing their energetic scramble down a hill, clutching fishing rods and nets, towards the river. Somewhere else, Darcy moves purposefully through cloisters, adorned in his gown and mortarboard, and forcefully opens a door to uncover Wickham in an indiscreet pose with a lady, yet Wickham greets him with nothing more than a nonchalant smile. Without hesitation, Darcy hands Wickham a check, and as Wickham reaches the door to leave, he inadvertently collides with Darcy's sister, and with a practiced charm, kisses her hand, a flirtatious smile playing on his lips. In a distant and serene setting, Georgiana and Wickham stroll arm in arm along the seaside, lost in each other's company. Abruptly, Darcy's carriage arrives at the sea front, and he deftly disembarks, quickly glimpsing over a wall, his eyes spotting Wickham and Georgiana perched together on the rocks below. Upon seeing her brother, Georgiana's face radiates with a broad smile. Once the door closes behind Wickham, Georgiana turns, her eyes filled with sorrow, towards Darcy and slowly approaches him, seeking his comforting embrace. Meanwhile, in his study, Darcy, appearing disheveled, leans back into his chair wearily, closing his eyes for a momentary respite. With renewed vigor, he dips his pen into the ink pot once more to continue his efforts. Outside, the sun begins its descent, casting a warm, salmon-pink glow all over Rosings, painting the scene with a soft twilight hue. The following morning, Darcy stands at a basin made of silver, splashing his face with cool water to awaken his senses, then gently pats his face dry. Still clad in the white shirt from the previous night, its top buttons carelessly undone, his demeanor remains troubled and agitated. He reaches out to extinguish last night's candle, which has nearly burned itself out, casting the room in a soft, fading light, and, on the bureau, rests the sealed letter, impeccably addressed to Miss Elizabeth Bennet. Elsewhere, Lizzy meanders over to the breakfast table, her curiosity barely piqued, and after a brief pause, decides to exit, leaving the others to their meal. Out in the bright, sunlit day, Lizzy embarks on a stroll through the park, her bonnet swinging playfully back and forth in her hand. Suddenly overtaken by an impulse, she breaks into a sprint, racing fervently across the grass, then gradually slows her pace, returning to a leisurely walk through the trees, her mind wandering aimlessly, only mildly aware of her surroundings. Without warning, she notices a male figure standing a few meters ahead with his back turned, and just as she attempts to slip away discreetly, he turns, catching her in the act of trying to remain unnoticed."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "A lady is embroidering a floral design while Darcy exits the parsonage, visibly tense, and dons his leather gloves. Inside, a tearful Lizzie paces the drawing room. Upstairs, a troubled Darcy writes a letter, replenishing his ink before pausing in his chair, dejected. He briefly watches two boys by the river from the window. Later, he catches Wickham in a compromising situation with a lady and hands him a check. Wickham exits, charming Georgiana with a flirtatious gesture. The pair walks by the sea, observed by Darcy from his carriage. Wickham leaves, and a sorrowful Georgiana seeks comfort from Darcy. Back in his chair, Darcy finishes his letter with renewed determination as the sun sets over Rosings. The next morning, Darcy, still in yesterday's shirt, washes his face and extinguishes the burnt-out candle beside the sealed letter to Miss Elizabeth Bennet. Meanwhile, Lizzy leaves the breakfast table and enjoys a sunny walk in the park, swinging her bonnet. She suddenly races across the grass, slows to a walk, and becomes aware of a man standing ahead, who turns as she attempts to slip away unnoticed."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "A lady's hand is at work on a delicate piece of floral embroidery, reminiscent of those crafted during the Regency era, known for intricate patterns and vibrant colors. Darcy, who has just come from a tense encounter at the parsonage, emerges with his lips drawn tight, pulling on his dark leather gloves that were customarily worn by gentlemen of his status. Inside, Lizzie begins to pace around the drawing room, a space often used for social gatherings and reflection, and tears spring into her eyes as emotions overwhelm her. Meanwhile, Darcy hurries into a room upstairs, looking deeply troubled, and stands in the middle of the room, a private retreat where he often finds solace. He dashes over to a bureau, pulls out a sheet of paper, picks up a pen, dips it into an ink pot, then sets about writing a letter with an urgency that suggests important matters at hand. He replenishes the nib with ink, puts down the pen, and leans back in his chair with a defeated air, as if burdened by the weight of his thoughts. Next, he goes over to the paned window, observing the two young boys with their fishing rods and nets scrambling down a hill towards the river, a popular pastime along country estates. Darcy strides through cloisters reminiscent of those found in grand universities, in his gown and mortarboard, and throws open a door to find Wickham in a compromising position with a lady, but Wickham just smiles at him with a nonchalance he often displays. Darcy hands Wickham a check, a likely attempt to resolve matters discreetly, and as Wickham turns at the door, he bumps into Darcy's sister, Georgiana, and kisses her hand with a flirtatious smile that hides his ulterior motives. Georgiana and Wickham, caught up in a whirlwind of emotion, walk arm-in-arm by the sea, the waves crashing beside them. Darcy's carriage, an elegant means of travel for the wealthy, pulls up at the sea front, and he jumps down to peer over a wall, seeing Wickham and Georgiana on the rocks below together. Georgiana spies her brother and her face breaks into a smile, a sign of affection and relief. When the door has closed behind Wickham, Georgiana turns her sorrowful gaze to Darcy and slowly walks over to be comforted by him, relying on her brother's strength. With the letter finished, a now disheveled Darcy leans wearily back in his chair and closes his eyes, then, with renewed energy, dips his pen in the ink pot once more, determined to complete his thoughts. Outside, the sun is setting, casting a salmon pink glow over Rosings, the grand estate renowned for its beauty and influence. The next morning, Darcy splashes his face with water from a silver basin, a luxury of the time, then pats it dry. He's still wearing the same white shirt from the night before, with the top few buttons undone, and his manner is troubled and agitated, reflecting a night of turmoil. He snuffs out last night's candle, which is all but burned out, and on the bureau is the sealed letter addressed to Miss Elizabeth Bennet, a letter of significant personal consequence. Lizzy wanders over to the breakfast table, then heads out, leaving the others to resume their breakfast, a meal that often started the day in wealthy households. It's a bright, sunny day, and Lizzy takes a walk in the park, a haven for quiet contemplation and social interaction, swinging her bonnet casually to and fro. Suddenly, she breaks into a run, racing as fast as she can across the grass, slows down to a walk again, and heads onward through the trees, not really taking in her surroundings amid her swirling thoughts. Suddenly, she becomes aware of a man standing with his back to her, a few meters ahead, and he turns just as she's trying to slip away unnoticed, revealing an unexpected encounter."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "He snuffs out last night's candle which is all but burned out and on the bureau is the sealed letter addressed to Miss Elizabeth Bennet Darcy's carriage pulls up at the sea front and he jumps down to peer over a wall seeing Wickham and Georgiana on the rocks below together A lady's hand is at work on a delicate piece of floral embroidery He dashes over to a bureau pulls out a sheet of paper picks up a pen dips it into an ink pot then sets about writing a letter Darcy strides through cloisters in his gown and mortarboard and throws open a door to find Wickham in a compromising position with a lady but Wickham just smiles at him Darcy emerges from the parsonage with his lips drawn tight pulling on his dark leather gloves Meanwhile Darcy hurries into a room upstairs looking deeply troubled and stands in the middle of the room Georgiana spies her brother and her face breaks into a smile Darcy emerges from the parsonage with his lips drawn tight pulling on his dark leather gloves Inside Lizzie begins to pace around the drawing room and tears spring into her eyes Meanwhile Darcy hurries into a room upstairs looking deeply troubled and stands in the middle of the room He dashes over to a bureau pulls out a sheet of paper picks up a pen dips it into an ink pot then sets about writing a letter Outside the sun is setting casting a salmon pink glow over Rosings He replenishes the nib with ink puts down the pen and leans back in his chair with a defeated air Next he goes over to the paned window observing the two young boys with their fishing rods and nets scrambling down a hill towards the river Darcy strides through cloisters in his gown and mortarboard and throws open a door to find Wickham in a compromising position with a lady but Wickham just smiles at him Darcy hands Wickham a check and as Wickham turns at the door he bumps into Darcy's sister and kisses her hand with a flirtatious smile Georgiana and Wickham walk arminarm by the sea Darcy's carriage pulls up at the sea front and he jumps down to peer over a wall seeing Wickham and Georgiana on the rocks below together Georgiana spies her brother and her face breaks into a smile Darcy hands Wickham a check and as Wickham turns at the door he bumps into Darcy's sister and kisses her hand with a flirtatious smile When the door has closed behind Wickham Georgiana turns her sorrowful gaze to Darcy and slowly walks over to be comforted by him With the letter finished a now disheveled Darcy leans wearily back in his chair and closes his eyes then with renewed energy dips his pen in the ink pot once more Outside the sun is setting casting a salmon pink glow over Rosings The next morning Darcy splashes his face with water from a silver basin then pats it dry He is still wearing the same white shirt from the night before with the top few buttons undone and his manner is troubled and agitated A lady's hand is at work on a delicate piece of floral embroidery Suddenly she breaks into a run racing as fast as she can across the grass slows down to a walk again and heads onward through the trees not really taking in her surroundings He snuffs out last night's candle which is all but burned out and on the bureau is the sealed letter addressed to Miss Elizabeth Bennet Lizzy wanders over to the breakfast table then heads out leaving the others to resume their breakfast It is a bright sunny day and Lizzy takes a walk in the park swinging her bonnet casually to and fro Suddenly she breaks into a run racing as fast as she can across the grass slows down to a walk again and heads onward through the trees not really taking in her surroundings Suddenly she becomes aware of a man standing with his back to her a few meters ahead and he turns just as she is trying to slip away unnoticed"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "A lady's hand is at work on a delicate piece of floral embroidery. Darcy emerges from the parsonage with his lips drawn tight pulling on his dark leather gloves. Inside Lizzie begins to pace around the drawing room and tears spring into her eyes. Meanwhile Darcy hurries into a room upstairs looking deeply troubled and stands in the middle of the room. He dashes over to a bureau pulls out a sheet of paper picks up a pen dips it into an ink pot then sets about writing a letter. He replenishes the nib with ink puts down the pen and leans back in his chair with a defeated air. Next he goes over to the paned window observing the two young boys with their fishing rods and nets scrambling down a hill towards the river. Darcy strides through cloisters in his gown and mortarboard and throws open a door to find Wickham in a compromising position with a lady but Wickham just smiles at him. Darcy hands Wickham a check and as Wickham turns at the door he bumps into Darcy's sister and kisses her hand with a flirtatious smile. Georgiana and Wickham walk arminarm by the sea. Darcy's carriage pulls up at the sea front and he jumps down to peer over a wall seeing Wickham and Georgiana on the rocks below together. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Georgiana spies her brother and her face breaks into a smile. When the door has closed behind Wickham Georgiana turns her sorrowful gaze to Darcy and slowly walks over to be comforted by him. With the letter finished a now disheveled Darcy leans wearily back in his chair and closes his eyes then with renewed energy dips his pen in the ink pot once more. Outside the sun is setting casting a salmon pink glow over Rosings. The next morning Darcy splashes his face with water from a silver basin then pats it dry. He is still wearing the same white shirt from the night before with the top few buttons undone and his manner is troubled and agitated. He snuffs out last night's candle which is all but burned out and on the bureau is the sealed letter addressed to Miss Elizabeth Bennet. Lizzy wanders over to the breakfast table then heads out leaving the others to resume their breakfast. It is a bright sunny day and Lizzy takes a walk in the park swinging her bonnet casually to and fro. Suddenly she breaks into a run racing as fast as she can across the grass slows down to a walk again and heads onward through the trees not really taking in her surroundings. Suddenly she becomes aware of a man standing with his back to her a few meters ahead and he turns just as she is trying to slip away unnoticed."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "A lady's hand is at work on a delicate piece of floral embroidery. Darcy emerges from the parsonage with his lips drawn tight pulling on his dark leather gloves. Inside Lizzie begins to pace around the drawing room and tears spring into her eyes. Meanwhile Darcy hurries into a room upstairs looking deeply troubled and stands in the middle of the room. He dashes over to a bureau pulls out a sheet of paper picks up a pen dips it into an ink pot then sets about writing a letter. He replenishes the nib with ink puts down the pen and leans back in his chair with a defeated air. Next he goes over to the paned window observing the two young boys with their fishing rods and nets scrambling down a hill towards the river. Darcy strides through cloisters in his gown and mortarboard and throws open a door to find Wickham in a compromising position with a lady but Wickham just smiles at him. Darcy hands Wickham a check and as Wickham turns at the door he bumps into Darcy's sister and kisses her hand with a flirtatious smile. Georgiana and Wickham walk arminarm by the sea. Darcy's carriage pulls up at the sea front and he jumps down to peer over a wall seeing Wickham and Georgiana on the rocks below together. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Georgiana spies her brother and her face breaks into a smile. When the door has closed behind Wickham Georgiana turns her sorrowful gaze to Darcy and slowly walks over to be comforted by him. With the letter finished a now disheveled Darcy leans wearily back in his chair and closes his eyes then with renewed energy dips his pen in the ink pot once more. Outside the sun is setting casting a salmon pink glow over Rosings. The next morning Darcy splashes his face with water from a silver basin then pats it dry. He is still wearing the same white shirt from the night before with the top few buttons undone and his manner is troubled and agitated. He snuffs out last night's candle which is all but burned out and on the bureau is the sealed letter addressed to Miss Elizabeth Bennet. Lizzy wanders over to the breakfast table then heads out leaving the others to resume their breakfast. It is a bright sunny day and Lizzy takes a walk in the park swinging her bonnet casually to and fro. Suddenly she breaks into a run racing as fast as she can across the grass slows down to a walk again and heads onward through the trees not really taking in her surroundings. Suddenly she becomes aware of a man standing with his back to her a few meters ahead and he turns just as she is trying to slip away unnoticed."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "A lady's hand is at work on a delicate piece of floral embroidery. Darcy emerges from the parsonage with his lips drawn tight pulling on his dark leather gloves. Inside Lizzie begins to pace around the drawing room and tears spring into her eyes. Meanwhile Darcy hurries into a room upstairs looking deeply troubled and stands in the middle of the room. He dashes over to a bureau pulls out a sheet of paper picks up a pen dips it into an ink pot then sets about writing a letter. He replenishes the nib with ink puts down the pen and leans back in his chair with a defeated air. He snuffs out last night's candle which is all but burned out and on the bureau is the sealed letter addressed to Miss Elizabeth Bennet. Lizzy wanders over to the breakfast table then heads out leaving the others to resume their breakfast. It is a bright sunny day and Lizzy takes a walk in the park swinging her bonnet casually to and fro. Suddenly she breaks into a run racing as fast as she can across the grass slows down to a walk again and heads onward through the trees not really taking in her surroundings. Suddenly she becomes aware of a man standing with his back to her a few meters ahead and he turns just as she is trying to slip away unnoticed."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "A lady's hand is at work on a delicate piece of floral embroidery. Darcy emerges from the parsonage with his lips drawn tight pulling on his dark leather gloves. Inside Lizzie begins to pace around the drawing room and tears spring into her eyes. Suddenly she breaks into a run racing as fast as she can across the grass slows down to a walk again and heads onward through the trees not really taking in her surroundings. Suddenly she becomes aware of a man standing with his back to her a few meters ahead and he turns just as she is trying to slip away unnoticed."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "A squirrel's hand is at work on a delicate piece of floral embroidery. A giraffe emerges from the parsonage with its lips drawn tight, pulling on its dark leather gloves. Inside, a penguin begins to pace around the drawing room, and tears spring into its eyes. Meanwhile, the giraffe hurries into a room upstairs, looking deeply troubled, and stands in the middle of the room. It dashes over to a bureau, pulls out a sheet of paper, picks up a pen, dips it into an ink pot, then sets about writing a letter. The giraffe replenishes the nib with ink, puts down the pen, and leans back in its chair with a defeated air. Next, the giraffe goes over to the paned window, observing the two young elephants with their fishing rods and nets scrambling down a hill towards the river. The giraffe strides through cloisters in its gown and mortarboard and throws open a door to find a kangaroo in a compromising position with a lady, but the kangaroo just smiles at it. The giraffe hands the kangaroo a check, and as the kangaroo turns at the door, it bumps into the giraffe's sister and kisses her hand with a flirtatious smile. A meerkat and the kangaroo walk arm-in-arm by the sea. The giraffe's carriage pulls up at the sea front, and it jumps down to peer over a wall, seeing the kangaroo and the meerkat on the rocks below together. The meerkat spies its sibling and its face breaks into a smile. When the door has closed behind the kangaroo, the meerkat turns its sorrowful gaze to the giraffe and slowly walks over to be comforted by it. With the letter finished, a now disheveled giraffe leans wearily back in its chair and closes its eyes, then, with renewed energy, dips its pen in the ink pot once more. Outside, the sun is setting, casting a salmon pink glow over Rosings. The next morning, the giraffe splashes its face with water from a silver basin, then pats it dry. It's still wearing the same white shirt from the night before, with the top few buttons undone, and its manner is troubled and agitated. It snuffs out last night's candle, which is all but burned out, and on the bureau is the sealed letter addressed to Miss Elizabeth Bennet. A rabbit wanders over to the breakfast table, then heads out, leaving the others to resume their breakfast. It's a bright, sunny day, and the rabbit takes a walk in the park, swinging its bonnet casually to and fro. Suddenly, it breaks into a run, racing as fast as it can across the grass, slows down to a walk again, and heads onward through the trees, not really taking in its surroundings. Suddenly, it becomes aware of a cat standing with its back to the rabbit, a few meters ahead, and the cat turns just as the rabbit is trying to slip away unnoticed."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "A lady's hand is at work on a delicate piece of lace crochet. Darcy emerges from the barn with his lips drawn tight, pulling on his dark woolen mittens. Inside, Lizzie begins to pace around the gallery, and tears spring into her eyes. Meanwhile, Darcy hurries into a study upstairs, looking deeply troubled, and stands in the middle of the room. He dashes over to a bookshelf, pulls out a sheet of parchment, picks up a quill, dips it into a honey jar, then sets about writing a note. He replenishes the nib with honey, puts down the quill, and leans back in his stool with a defeated air. Next, he goes over to the stained-glass window, observing the two young boys with their kites and strings scrambling down a hill towards the pond. Darcy strides through orchards in his robe and cap and throws open a door to find Wickham in a compromising position with a maiden, but Wickham just smiles at him. Darcy hands Wickham a voucher, and as Wickham turns at the door, he bumps into Darcy's sister and kisses her hand with a flirtatious smile. Georgiana and Wickham stroll arm-in-arm by the lake. Darcy's horse-drawn cart pulls up at the lake shore, and he jumps down to peer over a fence, seeing Wickham and Georgiana on the pebbles below together. Georgiana spies her brother and her face breaks into a smile. When the door has closed behind Wickham, Georgiana turns her sorrowful gaze to Darcy and slowly walks over to be comforted by him. With the note finished, a now disheveled Darcy leans wearily back in his stool and closes his eyes, then, with renewed energy, dips his quill in the honey jar once more. Outside, the sun is setting, casting a lavender glow over Longbourn. The next morning, Darcy splashes his face with water from a ceramic pitcher, then pats it dry. He's still wearing the same white tunic from the night before, with the top few buttons undone, and his manner is troubled and agitated. He snuffs out last night's lantern, which is all but burned out, and on the bookshelf is the sealed note addressed to Miss Elizabeth Bennet. Lizzy wanders over to the brunch table, then heads out, leaving the others to resume their brunch. It's a bright, sunny day, and Lizzy takes a walk in the orchard, swinging her parasol casually to and fro. Suddenly, she breaks into a run, racing as fast as she can across the blossoms, slows down to a walk again, and heads onward through the hedges, not really taking in her surroundings. Suddenly, she becomes aware of a man standing with his back to her, a few meters ahead, and he turns just as she's trying to slip away unnoticed."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "A lady's hand is crafting a delicate piece of floral embroidery. Darcy emerges from the parsonage with his lips drawn tight, fastening his dark leather gloves. Inside, Lizzie begins to twirl around the drawing room, and tears glisten in her eyes. Meanwhile, Darcy saunters into a room upstairs, looking deeply puzzled, and pauses in the middle of the room. He rushes over to a bureau, pulls out a sheet of paper, grabs a pen, dunks it into an ink pot, then starts doodling on a letter. He replenishes the nib with ink, sets down the pen, and slumps back in his chair with a defeated air. Next, he wanders over to the paned window, watching the two young boys with their fishing rods and nets hopping down a hill towards the river. Darcy prances through cloisters in his gown and mortarboard and flings open a door to find Wickham in a compromising position with a lady, but Wickham just nods at him. Darcy hands Wickham a check, and as Wickham spins at the door, he stumbles into Darcy's sister and taps her hand with a flirtatious grin. Georgiana and Wickham meander arm-in-arm by the sea. Darcy's carriage pulls up at the sea front, and he hops down to peer over a wall, seeing Wickham and Georgiana on the rocks below together. Georgiana glimpses her brother and her face lights up with a smile. When the door has closed behind Wickham, Georgiana turns her sorrowful gaze to Darcy and slowly strolls over to be comforted by him. With the letter completed, a now ruffled Darcy leans wearily back in his chair and shuts his eyes, then, with renewed energy, dunks his pen in the ink pot once more. Outside, the sun is setting, casting a salmon pink hue over Rosings. The next morning, Darcy splashes his face with water from a silver basin, then dries it carefully. He's still wearing the same white shirt from the night before, with the top few buttons undone, and his manner is troubled and agitated. He blows out last night's candle, which is all but extinguished, and on the bureau is the sealed letter addressed to Miss Elizabeth Bennet. Lizzy strolls over to the breakfast table, then heads out, leaving the others to continue their breakfast. It's a bright, sunny day, and Lizzy takes a stroll in the park, tossing her bonnet casually to and fro. Suddenly, she bursts into a sprint, racing as fast as she can across the grass, slows down to a stroll again, and heads onward through the trees, not really noticing her surroundings. Suddenly, she becomes aware of a man standing with his back to her, a few meters ahead, and he glances just as she's trying to slip away unnoticed."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "A rabbit's paw is at work on a complex piece of digital coding. Aardvark emerges from the igloo with its ears drawn tight, pulling on its striped wool mittens. Inside, Panda begins to pace around the conservatory, and raindrops spring into its nostrils. Meanwhile, Aardvark hurries into a basement downstairs, looking deeply joyful, and stands in the middle of the basement. It dashes over to a wardrobe, pulls out a roll of wallpaper, picks up a feather, dips it into a honey jar, then sets about decorating a wall. It replenishes the feather with honey, puts down the feather, and leans back in its hammock with a victorious air. Next, it goes over to the brass telescope, observing the two old turtles with their surfboards and buckets scrambling down a mountain towards the ocean. Aardvark strides through meadows in its tuxedo and top hat and throws open a portal to find Ostrich in a compromising position with a parrot, but Ostrich just smiles at it. Aardvark hands Ostrich a coupon, and as Ostrich turns at the portal, it bumps into Aardvark's cousin and kisses its tail with a timid smile. Rufina and Ostrich walk arm-in-arm by the marsh. Aardvark's bicycle pulls up at the marsh front, and it jumps down to peer over a fence, seeing Ostrich and Rufina on the logs below together. Rufina spies its cousin and its face breaks into a giggle. When the portal has closed behind Ostrich, Rufina turns its joyful gaze to Aardvark and slowly rolls over to be comforted by it. With the wallpaper finished, a now pristine Aardvark leans wearily back in its hammock and closes its eyes, then, with renewed energy, dips its feather in the honey jar once more. Outside, the moon is rising, casting a sapphire blue glow over Mars. The next evening, Aardvark pats its feet with powder from a golden jar, then shakes them dry. It's still wearing the same checkered trousers from the afternoon before, with the top few seams ripped, and its manner is peaceful and calm. It snuffs out last dawn's lantern, which is all but extinguished, and on the wardrobe is the rolled wallpaper addressed to Sir Alexander Dumas. Panda wanders over to the dinner counter, then bounces out, leaving the others to resume their feast. It's a dark, stormy afternoon, and Panda takes a nap in the hammock, swaying its necklace casually to and fro. Suddenly, it breaks into a sprint, darting as quickly as it can across the sand, slows down to a crawl again, and heads onward through the bushes, not really taking in its surroundings. Suddenly, it becomes aware of a tree standing with its trunk to it, a few paces ahead, and it turns just as it's trying to slip away undetected."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "A cat's paw is busy on a delicate piece of floral embroidery. Oliver departs from the cottage with his lips drawn tight, adjusting his dark leather bracelet. Inside, Amelia begins to skip around the living room, and laughter bursts into her eyes. Meanwhile, Oliver sprints into a room upstairs, appearing deeply content, and squats in the middle of the room. He dashes over to a bookshelf, extracts a sheet of paper, picks up a paintbrush, dips it into a water pot, then sets about painting a portrait. He replenishes the bristles with water, puts down the brush, and leans back in his chair with a triumphant air. Next, he goes over to the stained glass window, observing the two young girls with their kites and ribbons skipping down a hill towards the lake. Oliver marches through corridors in his overalls and cap and swings open a window to find Jasper in a compromising position with a gentleman, but Jasper just giggles at him. Oliver hands Jasper a book, and as Jasper turns at the threshold, he bumps into Oliver's brother and winks at him with a cheeky smile. Theodore and Jasper stroll arm-in-arm by the garden. Oliver's cart rolls up at the garden entrance, and he hops down to peer over a fence, seeing Jasper and Theodore on the bench below together. Theodore notices his brother and his face lights up with a laugh. When the window has closed behind Jasper, Theodore turns his cheerful gaze to Oliver and quickly runs over to be praised by him. With the portrait finished, a now rumpled Oliver stretches wearily back in his chair and closes his eyes, then, with renewed excitement, dips his brush in the water pot once more. Outside, the moon is rising, casting a lavender glow over the meadows. The next evening, Oliver sprinkles his hair with sand from a golden urn, then shakes it off. He's still wearing the same blue coat from the day before, with the top couple of buttons undone, and his manner is serene and calm. He lights the evening's candle, which is just beginning, and on the bookshelf is the sealed diary addressed to Mr. Edward Burton. Amelia skips over to the lunch table, then heads out, leaving the others to resume their lunch. It's a cool, breezy night, and Amelia takes a stroll in the woods, swinging her scarf casually to and fro. Suddenly, she breaks into a dance, twirling as gracefully as she can across the path, slows down to a stroll again, and heads onward through the bushes, not really taking in her surroundings. Suddenly, she becomes aware of a child standing with their back to her, a few meters ahead, and they turn just as she's trying to slip away unnoticed."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "A lady's hand is fiddling with a delicate piece of musical sheet music. Darcy emerges from the bakery with his lips drawn tight, wrapping a scarf around his neck. Inside, Lizzie begins to twirl around the ballroom, and laughter bubbles into her throat. Meanwhile, Darcy scurries into a garden upstairs, looking profoundly perplexed, and lounges in the middle of the garden. He rushes over to a toolbox, pulls out a sheet of metal, picks up a hammer, taps it onto a nail, then sets about crafting a sculpture. He refreshes the nail with oil, puts down the hammer, and stretches back on his hammock with a contented air. Next, he goes over to the stained glass window, noticing the two young girls with their sketchbooks and pencils crawling down a slope towards the meadow. Darcy skips through hallways in his coat and scarf and swings open a gate to find Wickham in a compromising position with a lady, but Wickham just gestures at him. Darcy hands Wickham a ticket, and as Wickham turns at the threshold, he collides with Darcy's sister and bows to her hand with a coy grin. Georgiana and Wickham stroll hand-in-hand by the forest. Darcy's wagon pulls up at the forest edge, and he hops down to peer over a fence, seeing Wickham and Georgiana on the dunes below together. Georgiana notices her brother and her face erupts into laughter. When the door has closed behind Wickham, Georgiana turns her joyful gaze to Darcy and slowly dances over to be praised by him. With the sculpture finished, a now worn-out Darcy sinks wearily back in his hammock and closes his eyes, then, with renewed enthusiasm, sharpens his chisel on the grindstone once more. Outside, the moon is rising, casting a cherry blossom glow over Pemberley. The next morning, Darcy splashes his face with cologne from a silver flask, then rubs it dry. He's still wearing the same striped suit from the night before, with the top few buttons undone, and his manner is distracted and restless. He illuminates last night's lantern, which is all but diminished, and on the toolbox is the folded map addressed to Miss Elizabeth Bennet. Lizzy strides over to the garden table, then strolls out, leaving the others to continue their brunch. It's a clear, breezy day, and Lizzy takes a walk in the orchard, swinging her cape leisurely to and fro. Suddenly, she breaks into a skip, bounding as briskly as she can across the field, slows down to a stroll again, and wanders onward through the grove, not really observing her surroundings. Suddenly, she becomes aware of a dog standing with its back to her, a few meters ahead, and it turns just as she's trying to drift away unnoticed."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "A man's foot is busy on an intricate piece of mechanical sculpture. Felicity emerges from the bakery with her ears perked up, adjusting her red woolen scarf. Outside, Henry starts to jump around the playground, and laughter bubbles into his mouth. Meanwhile, Felicity strolls into a basement downstairs, appearing slightly ecstatic, and sits on the edge of the couch. She rushes over to a bookshelf, grabs an old novel, finds a bookmark, flips it into a bucket, then begins crafting a poem. She moistens the bookmark, tosses aside the novel, and slumps forward on the sofa with a victorious grin. Next, she glides over to the steel door, watching the two elderly women with their garden hoes and flowers wandering up a mountain towards the horizon. Felicity skips through archways in her pajamas and slippers and closes a window to catch Fitzgerald in a cheerful situation with a man, but Fitzgerald just chuckles at her. Felicity presents Fitzgerald a ticket, and as Fitzgerald leaves through the window, he bumps into Felicity's cousin and shakes their knee with a somber grin. Jonathan and Fitzgerald frolic hand-in-hand through the meadow. Felicity's bicycle rolls up to the valley edge, and she tumbles off to gaze under a bridge, observing Jonathan and Fitzgerald on the grass above together. Jonathan notices his cousin and his voice bursts into laughter. When the window has opened for Fitzgerald, Jonathan turns his joyful glimpse from Felicity and quickly hops over to be cheered by her. With the poem started, a now energized Felicity balances gently on her feet and stretches her legs, then, with tired determination, flips her bookmark in the bucket once again. Indoors, the rain is pouring, casting a silvery gray hue over Hogsmeade. The following evening, Felicity brushes her teeth with honey from a golden jar, then dries them quickly. She's still donning the same black coat from the night earlier, with the top few sleeves undone, and her posture is comfortable and calm. She blows out the morning's lantern, which is all but glowing bright, and on the bookshelf is the open novel addressed to Mr. Jonathan Crane. Henry skips over to the dinner sofa, then jumps out, leaving the others to begin their dinner. It's a gloomy, starry night, and Henry dances in the street, tossing his umbrella anxiously up and down. Suddenly, he slows to a crawl, skidding as quickly as he can along the pavement, speeds up to a gallop again, and dances onward past the cars, hardly noticing his surroundings. Suddenly, he notices a child sitting with their face towards him, a few moments behind, and they run just as he's attempting to sneak closer undetected."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "A lady is working on floral embroidery as Darcy, looking tense, leaves the parsonage wearing dark leather gloves. Inside, Lizzie paces and tears fill her eyes. Darcy, troubled, writes a letter upstairs before observing boys by a river. He confronts Wickham in a compromising situation and gives him a check. Wickham flirtatiously interacts with Darcy's sister, Georgiana, and they walk by the sea. Darcy sees them from a carriage, and Georgiana smiles at him. Wickham leaves, and Georgiana seeks comfort from Darcy. After finishing the letter, Darcy, exhausted, leans back but then continues writing. At Rosings, a sunset casts a glow. The next morning, a weary Darcy addresses a letter to Elizabeth Bennet. Lizzy leaves breakfast to walk outside, swinging her bonnet. She runs across the grass, then slows, noticing a man ahead. As she tries to slip away, he turns to face her."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Suddenly she becomes aware of a man standing with his back to her a few meters ahead and he turns just as she is trying to slip away unnoticed Suddenly she breaks into a run racing as fast as she can across the grass slows down to a walk again and heads onward through the trees not really taking in her surroundings It is a bright sunny day and Lizzy takes a walk in the park swinging her bonnet casually to and fro Lizzy wanders over to the breakfast table then heads out leaving the others to resume their breakfast He snuffs out last night's candle which is all but burned out and on the bureau is the sealed letter addressed to Miss Elizabeth Bennet He is still wearing the same white shirt from the night before with the top few buttons undone and his manner is troubled and agitated The next morning Darcy splashes his face with water from a silver basin then pats it dry Outside the sun is setting casting a salmon pink glow over Rosings With the letter finished a now disheveled Darcy leans wearily back in his chair and closes his eyes then with renewed energy dips his pen in the ink pot once more When the door has closed behind Wickham Georgiana turns her sorrowful gaze to Darcy and slowly walks over to be comforted by him Georgiana spies her brother and her face breaks into a smile Darcy's carriage pulls up at the sea front and he jumps down to peer over a wall seeing Wickham and Georgiana on the rocks below together Georgiana and Wickham walk arminarm by the sea Darcy hands Wickham a check and as Wickham turns at the door he bumps into Darcy's sister and kisses her hand with a flirtatious smile Darcy strides through cloisters in his gown and mortarboard and throws open a door to find Wickham in a compromising position with a lady but Wickham just smiles at him Next he goes over to the paned window observing the two young boys with their fishing rods and nets scrambling down a hill towards the river He replenishes the nib with ink puts down the pen and leans back in his chair with a defeated air He dashes over to a bureau pulls out a sheet of paper picks up a pen dips it into an ink pot then sets about writing a letter Meanwhile Darcy hurries into a room upstairs looking deeply troubled and stands in the middle of the room Inside Lizzie begins to pace around the drawing room and tears spring into her eyes Darcy emerges from the parsonage with his lips drawn tight pulling on his dark leather gloves A lady's hand is at work on a delicate piece of floral embroidery"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Suddenly she becomes aware of a man standing with his back to her a few meters ahead and he turns just as she is trying to slip away unnoticed He replenishes the nib with ink puts down the pen and leans back in his chair with a defeated air Inside Lizzie begins to pace around the drawing room and tears spring into her eyes The next morning Darcy splashes his face with water from a silver basin then pats it dry Georgiana and Wickham walk arminarm by the sea When the door has closed behind Wickham Georgiana turns her sorrowful gaze to Darcy and slowly walks over to be comforted by him He is still wearing the same white shirt from the night before with the top few buttons undone and his manner is troubled and agitated It is a bright sunny day and Lizzy takes a walk in the park swinging her bonnet casually to and fro Next he goes over to the paned window observing the two young boys with their fishing rods and nets scrambling down a hill towards the river With the letter finished a now disheveled Darcy leans wearily back in his chair and closes his eyes then with renewed energy dips his pen in the ink pot once more Lizzy wanders over to the breakfast table then heads out leaving the others to resume their breakfast Outside the sun is setting casting a salmon pink glow over Rosings Darcy's carriage pulls up at the sea front and he jumps down to peer over a wall seeing Wickham and Georgiana on the rocks below together Darcy emerges from the parsonage with his lips drawn tight pulling on his dark leather gloves Georgiana spies her brother and her face breaks into a smile He dashes over to a bureau pulls out a sheet of paper picks up a pen dips it into an ink pot then sets about writing a letter He snuffs out last night's candle which is all but burned out and on the bureau is the sealed letter addressed to Miss Elizabeth Bennet Darcy strides through cloisters in his gown and mortarboard and throws open a door to find Wickham in a compromising position with a lady but Wickham just smiles at him Darcy hands Wickham a check and as Wickham turns at the door he bumps into Darcy's sister and kisses her hand with a flirtatious smile A lady's hand is at work on a delicate piece of floral embroidery Meanwhile Darcy hurries into a room upstairs looking deeply troubled and stands in the middle of the room Suddenly she breaks into a run racing as fast as she can across the grass slows down to a walk again and heads onward through the trees not really taking in her surroundings"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Georgiana spies her brother and her face breaks into a smile When the door has closed behind Wickham Georgiana turns her sorrowful gaze to Darcy and slowly walks over to be comforted by him With the letter finished a now disheveled Darcy leans wearily back in his chair and closes his eyes then with renewed energy dips his pen in the ink pot once more Outside the sun is setting casting a salmon pink glow over Rosings The next morning Darcy splashes his face with water from a silver basin then pats it dry He is still wearing the same white shirt from the night before with the top few buttons undone and his manner is troubled and agitated He snuffs out last night's candle which is all but burned out and on the bureau is the sealed letter addressed to Miss Elizabeth Bennet Lizzy wanders over to the breakfast table then heads out leaving the others to resume their breakfast It is a bright sunny day and Lizzy takes a walk in the park swinging her bonnet casually to and fro Suddenly she breaks into a run racing as fast as she can across the grass slows down to a walk again and heads onward through the trees not really taking in her surroundings Suddenly she becomes aware of a man standing with his back to her a few meters ahead and he turns just as she is trying to slip away unnoticed A lady's hand is at work on a delicate piece of floral embroidery Darcy emerges from the parsonage with his lips drawn tight pulling on his dark leather gloves Inside Lizzie begins to pace around the drawing room and tears spring into her eyes Meanwhile Darcy hurries into a room upstairs looking deeply troubled and stands in the middle of the room He dashes over to a bureau pulls out a sheet of paper picks up a pen dips it into an ink pot then sets about writing a letter He replenishes the nib with ink puts down the pen and leans back in his chair with a defeated air Next he goes over to the paned window observing the two young boys with their fishing rods and nets scrambling down a hill towards the river Darcy strides through cloisters in his gown and mortarboard and throws open a door to find Wickham in a compromising position with a lady but Wickham just smiles at him Darcy hands Wickham a check and as Wickham turns at the door he bumps into Darcy's sister and kisses her hand with a flirtatious smile Georgiana and Wickham walk arminarm by the sea Darcy's carriage pulls up at the sea front and he jumps down to peer over a wall seeing Wickham and Georgiana on the rocks below together"
        }
      ]
    }
  ]
}