{
  "ground_truth": "Walt kicks a table, then marches into his front room and kicks over another table, then punches in some cupboard doors as Daisy runs for cover. Walt sits down in an armchair, blood dripping from his fingers, and stares into the distance, a frown on his face, his features fixed and grim. He sheds a tear, and the blood on his fists has dried. Daisy comes and sits beside him. Father Janovich knocks at Walt's door and lets himself in as Walt lights up a cigarette. Father Janovich perches on a coffee table beside an open photograph album and stares at Walt, who drags pensively on his cigarette and looks thoughtful. Father Janovich gets up, goes over to the cool box, returns with four cans, and passes a couple to Walt while keeping a couple for himself. They each take a swig, and Walt takes another swig as Father Janovich eyes him, who stares unwaveringly back. In the morning, Thao walks into Walt's kitchen and finds him sipping a mug of coffee. They sit at the kitchen table, Walt gives Thao a scornful look, Thao nods reluctantly, and then gets up and goes as Walt stares after him. Later, Walt is busy mowing his front lawn, and now he relaxes in the bath, lights a cigarette, and looks over at Daisy, who's sitting beside the tub. Martin gives Walt a haircut, chuckles, and pockets the money. At a tailor's, Walt is fitted for a suit. In church, Father Janovich walks up the aisle reading a Bible, looks up, and sees Walter in a confessional booth. They step out of the confessional, Walt walks away, looks back at Father Janovich, smiles, and goes. Walt sits at his kitchen table cleaning his Colt .45, Thao comes in through the back door, picks up Walt's rifle off the table, and shoulders the rifle, inadvertently pointing it at Walt. Thao follows Walt down into the basement, Walt shows him a medal, and pins it on Thao. Walt goes upstairs as Thao closes up the chest Walt took the medal from. Thao hurries up the stairs and finds that Walt has locked him in the basement. Walt walks out of his house with Daisy on a lead, goes over to Thao's house, where Grandma is sitting on the porch, ties Daisy to Grandma's chair, fusses Daisy, heads off, and Daisy lies down and watches him go. Sue is lying in bed, gets up and goes outside, her swollen face discolored and bruised, and Grandma follows her. She hurries to Walt's house, and Father Janovich is with the police outside Smokie's house as they bundle him into their cruiser and drive away.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Walt strikes a table, then strides into his front room and overturns another table, then strikes in some cabinet doors as Daisy dashes for shelter. Walt sits down in an armchair, blood seeping from his fingers, and gazes into the distance, a scowl on his face, his features set and somber. He sheds a tear, and the blood on his fists has dried. Daisy comes and sits beside him. Father Janovich raps at Walt's door and lets himself in as Walt lights up a cigarette. Father Janovich sits on a coffee table beside an open photo album and gazes at Walt, who inhales pensively on his cigarette and looks contemplative. Father Janovich rises, goes over to the cooler, returns with four cans, and hands a couple to Walt while keeping a couple for himself. They each take a sip, and Walt takes another sip as Father Janovich observes him, who stares steadily back. In the morning, Thao enters Walt's kitchen and finds him sipping a mug of coffee. They sit at the kitchen table, Walt gives Thao a disdainful look, Thao nods hesitantly, and then rises and goes as Walt gazes after him. Later, Walt is busy mowing his front yard, and now he relaxes in the bath, lights a cigarette, and looks over at Daisy, who's sitting beside the tub. Martin gives Walt a haircut, giggles, and pockets the money. At a tailor's, Walt is fitted for a suit. In church, Father Janovich walks up the aisle reading a Bible, looks up, and sees Walter in a confessional booth. They step out of the confessional, Walt walks away, looks back at Father Janovich, smiles, and goes. Walt sits at his kitchen table cleaning his Colt .45, Thao comes in through the back door, picks up Walt's rifle off the table, and shoulders the rifle, inadvertently pointing it at Walt. Thao follows Walt down into the basement, Walt shows him a medal, and pins it on Thao. Walt goes upstairs as Thao closes up the chest Walt took the medal from. Thao hurries up the stairs and finds that Walt has locked him in the basement. Walt strolls out of his house with Daisy on a leash, goes over to Thao's house, where Grandma is sitting on the porch, ties Daisy to Grandma's chair, pats Daisy, heads off, and Daisy lies down and watches him go. Sue is lying in bed, gets up and goes outside, her swollen face discolored and bruised, and Grandma follows her. She rushes to Walt's house, and Father Janovich is with the police outside Smokie's house as they bundle him into their squad car and drive away."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "A table is kicked by Walt, then his front room is marched into by him and another table is kicked over, and some cupboard doors are punched in by him as cover is run for by Daisy. An armchair is sat in by Walt, blood dripping from his fingers, and the distance is stared into by him, a frown on his face, his features fixed and grim. A tear is shed by him, and the blood on his fists has dried. Daisy comes and sits beside him. Walt's door is knocked at by Father Janovich, who lets himself in as a cigarette is lit up by Walt. Father Janovich perches on a coffee table beside an open photograph album and Walt, who drags pensively on his cigarette and looks thoughtful, is stared at by him. Father Janovich gets up, goes over to the cool box, returns with four cans, and a couple are passed to Walt by him while a couple are kept for himself. A swig is taken by each of them, and another swig is taken by Walt as Father Janovich eyes him, who stares unwaveringly back. In the morning, Walt's kitchen is walked into by Thao and he finds Walt sipping a mug of coffee. They sit at the kitchen table, Thao is given a scornful look by Walt, Thao nods reluctantly, and then he gets up and goes as he is stared after by Walt. Later, Walt is busy mowing his front lawn, and now the bath is relaxed in by him, a cigarette is lit, and Daisy, who's sitting beside the tub, is looked over at by him. Walt is given a haircut by Martin, who chuckles, and the money is pocketed by him. At a tailor's, a suit is fitted for Walt. In church, the aisle is walked up by Father Janovich reading a Bible, he looks up, and Walter is seen by him in a confessional booth. They step out of the confessional, Walt walks away, a look is cast back at Father Janovich by him, a smile is given, and he goes. The kitchen table is sat at by Walt cleaning his Colt .45, Thao comes in through the back door, picks up Walt's rifle off the table, and the rifle is shouldered by him, inadvertently pointing it at Walt. Thao follows Walt down into the basement, a medal is shown to him by Walt, and it is pinned on Thao. The upstairs is gone to by Walt as the chest the medal was taken from by Walt is closed up by Thao. The stairs are hurried up by Thao and he finds that the basement has been locked by Walt. Walt walks out of his house with Daisy on a lead, Thao's house, where Grandma is sitting on the porch, is gone over to, Daisy is tied to Grandma's chair, Daisy is fussed, Walt heads off, and Daisy lies down and watches him go. Sue is lying in bed, gets up and goes outside, her swollen face discolored and bruised, and Grandma follows her. Walt's house is hurried to by her, and Father Janovich is with the police outside Smokie's house as Smokie is bundled into their cruiser and they drive away."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Walt kicks a table, marches into his front room, kicks another table, and punches cupboard doors as Daisy runs for cover. He sits in an armchair, blood dripping from his fingers, staring grimly into the distance. A tear falls as the blood on his fists dries. Daisy sits beside him. Father Janovich knocks, enters, and Walt lights a cigarette. Janovich sits on a coffee table, staring at Walt, who smokes pensively. Janovich retrieves four cans from a cool box, shares them with Walt, and they drink, exchanging unwavering glances. In the morning, Thao finds Walt sipping coffee in the kitchen. They sit, Walt gives Thao a scornful look, Thao nods reluctantly, then leaves as Walt watches. Later, Walt mows his lawn, relaxes in the bath, lights a cigarette, and looks at Daisy beside the tub. Martin cuts Walt's hair, chuckles, and pockets the money. At a tailor's, Walt is fitted for a suit. In church, Father Janovich reads a Bible, sees Walt in a confessional booth, and they exit together. Walt smiles at Janovich and leaves. Walt cleans his Colt .45 at the kitchen table, Thao enters, picks up Walt's rifle, and inadvertently points it at him. Thao follows Walt to the basement, where Walt shows him a medal and pins it on Thao. Walt goes upstairs, locking Thao in the basement. Walt leaves with Daisy, ties her to Grandma's chair at Thao's house, and heads off as Daisy watches. Sue, with a swollen, bruised face, goes outside, followed by Grandma. She hurries to Walt's house, while Father Janovich and police are outside Smokie's house, bundling him into a cruiser."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Walt kicks a table, then another, and punches cupboard doors as Daisy hides. He sits, blood on his fingers, staring grimly. A tear falls, and his fists' blood dries. Daisy sits beside him. Father Janovich enters as Walt lights a cigarette. Janovich sits on a coffee table, watching Walt, who smokes thoughtfully. Janovich fetches four cans, giving two to Walt. They drink, exchanging looks. In the morning, Thao finds Walt with coffee. They sit; Walt scornfully looks at Thao, who nods and leaves. Walt mows his lawn, then relaxes in the bath, smoking, with Daisy nearby. Martin cuts Walt's hair, laughs, and takes payment. At a tailor's, Walt gets fitted for a suit. In church, Father Janovich sees Walt in a confessional. They exit, Walt smiles and leaves. Walt cleans his Colt .45 at the kitchen table. Thao enters, picks up Walt's rifle, and follows him to the basement. Walt shows Thao a medal and pins it on him. Walt locks Thao in the basement. Walt walks Daisy to Thao's house, ties her to Grandma's chair, and leaves. Sue, bruised, goes outside, followed by Grandma. She rushes to Walt's house. Father Janovich and police are outside Smokie's house, arresting him."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Walt, in a fit of anger and frustration, forcefully kicks a table, sending it skidding across the floor. He then marches with determined strides into his front room, where he proceeds to kick over another table with equal force. His rage continues as he punches in the cupboard doors, causing Daisy to quickly run for cover, seeking safety from his wrath. Exhausted, Walt collapses into an armchair, his fingers stained with blood that drips slowly onto the floor. He stares blankly into the distance, his face set in a grim frown, his features hard and unyielding. A solitary tear escapes his eye, and the blood on his fists has now dried, leaving a dark, crusty residue. Daisy cautiously approaches and sits beside him, offering silent companionship. \n\nFather Janovich arrives at Walt's door, knocking before letting himself in. Walt, in the meantime, lights up a cigarette, the smoke curling lazily into the air. Father Janovich perches himself on a coffee table, which is situated beside an open photograph album, and he fixes his gaze on Walt. Walt, lost in thought, drags pensively on his cigarette, his expression contemplative. Father Janovich rises from his seat, walks over to the cool box, retrieves four cans, and returns to his spot. He hands a couple of cans to Walt, keeping the remaining two for himself. They each take a swig from their cans, and Walt takes another long swig as Father Janovich watches him intently, their eyes meeting in a silent exchange.\n\nThe next morning, Thao enters Walt's kitchen and finds him sipping from a steaming mug of coffee. They both sit at the kitchen table, where Walt gives Thao a scornful look, filled with disapproval. Thao nods reluctantly, acknowledging the unspoken criticism, and then rises from his seat, leaving as Walt watches him go, his gaze following Thao's retreating figure. Later, Walt is seen diligently mowing his front lawn, tending to it with care. Afterward, he relaxes in the bath, the warm water soothing his tired muscles. He lights a cigarette and glances over at Daisy, who is sitting loyally beside the tub, her eyes fixed on him.\n\nMartin, the barber, gives Walt a haircut, chuckling as he works, and then pockets the money with a satisfied grin. At a tailor's shop, Walt is meticulously fitted for a suit, the fabric draping perfectly over his frame. In church, Father Janovich walks solemnly up the aisle, reading from a Bible. He looks up and sees Walter seated in a confessional booth. They both step out of the confessional, and as Walt walks away, he glances back at Father Janovich, offering a small smile before continuing on his way.\n\nWalt sits at his kitchen table, carefully cleaning his Colt .45, the metal gleaming under the light. Thao enters through the back door, picks up Walt's rifle from the table, and inadvertently points it at Walt as he shoulders it. Thao follows Walt down into the basement, where Walt shows him a medal, a symbol of honor, and pins it on Thao with a sense of pride. Walt then ascends the stairs, leaving Thao to close up the chest from which the medal was taken. Thao hurries up the stairs, only to find that Walt has locked him in the basement, a precautionary measure.\n\nWalt exits his house with Daisy on a lead, walking over to Thao's house, where Grandma is seated on the porch. He ties Daisy to Grandma's chair, fusses over Daisy affectionately, and then heads off, leaving Daisy to lie down and watch him as he goes. Meanwhile, Sue, lying in bed, gets up and ventures outside, her face swollen, discolored, and bruised from a recent ordeal. Grandma follows her, concerned. Sue hurries to Walt's house, seeking refuge or assistance. At the same time, Father Janovich is with the police outside Smokie's house, observing as they bundle him into their cruiser and drive away, the situation tense and unresolved."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "In a sudden outburst of extreme anger and deep-seated frustration, Walt forcefully kicks a table, sending it skidding noisily across the floor. Not stopping there, he marches with determined, heavy strides into his front room, where he proceeds to kick over yet another table with equal forcefulness. His rage is unrelenting as he furiously punches in the cupboard doors, causing Daisy to swiftly run for cover, desperately seeking safety from his overwhelming wrath. Exhausted and spent, Walt finally collapses into an armchair, his fingers stained with blood that drips slowly onto the floor beneath him. He stares blankly into the far distance, his face set in a grim and unyielding frown, his features hard and uncompromising. A solitary tear escapes from his eye, trailing down his cheek, and the blood on his fists has now dried, leaving a dark, crusty residue. Daisy cautiously approaches him, sitting beside him, offering him silent companionship and support.\n\nFather Janovich arrives at Walt's door, giving a polite knock before letting himself inside. Meanwhile, Walt lights up a cigarette, the smoke curling lazily into the air around him. Father Janovich settles himself on a coffee table, which is situated right next to an open photograph album, and he fixes his steady gaze on Walt. Walt, lost deeply in thought, drags pensively on his cigarette, his expression contemplative and thoughtful. Father Janovich rises from his seat, walks over to the cool box, retrieves four cans, and returns to his original spot. He hands a couple of cans to Walt, keeping two for himself. They each take a swig from their respective cans, and Walt takes another long swig as Father Janovich watches him intently, their eyes meeting in a silent, wordless exchange.\n\nThe very next morning, Thao enters Walt's kitchen and finds him quietly sipping from a steaming mug of coffee. They both sit down at the kitchen table, where Walt gives Thao a look filled with scorn and disapproval. Thao nods reluctantly, acknowledging the unspoken criticism directed at him, and then rises from his seat, leaving as Walt watches him go, his gaze following Thao’s retreating figure. Later on, Walt is seen diligently mowing his front lawn, tending to it with meticulous care. Afterward, he relaxes in the soothing bath, the warm water enveloping and calming his tired muscles. He lights a cigarette and glances over at Daisy, who is sitting loyally beside the tub, her eyes unwaveringly fixed on him.\n\nMartin, the jovial barber, gives Walt a haircut, chuckling softly as he works, and afterward, he pockets the money with a satisfied grin. At a tailor's shop, Walt is meticulously fitted for a suit, the luxurious fabric draping perfectly over his frame. In the church, Father Janovich walks solemnly up the aisle, reading reverently from a Bible. He looks up and sees Walter seated quietly in a confessional booth. They both emerge from the confessional, and as Walt walks away, he glances back at Father Janovich, offering a small, almost imperceptible smile before continuing on his way.\n\nWalt sits at his kitchen table, carefully cleaning his Colt .45, the polished metal gleaming brilliantly under the light. Thao enters through the back door, picks up Walt's rifle from the table, and inadvertently points it at Walt as he shoulders it without caution. Thao follows Walt down into the basement, where Walt shows him a medal, a cherished symbol of honor, and pins it on Thao with a sense of pride and accomplishment. Walt then proceeds to ascend the stairs, leaving Thao to carefully close up the chest from which the medal had been taken. Thao hurries up the stairs, only to find that Walt has locked him securely in the basement, a precautionary measure for his own safety.\n\nWalt exits his house with Daisy on a lead, walking over to Thao's house, where Grandma is seated on the porch. He ties Daisy to Grandma's chair, fussing over Daisy with affectionate care, and then heads off, leaving Daisy to lie down and watch him as he goes. Meanwhile, Sue, lying in bed, gets up slowly and ventures outside, her face swollen, discolored, and visibly bruised from a recent ordeal. Grandma follows her, visibly concerned and worried. Sue hurries over to Walt's house, seeking refuge or assistance from him. At the same time, Father Janovich is with the police outside Smokie's house, observing intently as they bundle him into their cruiser and drive away, the situation tense and unresolved."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Walt, filled with a sudden surge of anger, forcefully kicks a table, sending it skidding across the floor. With determined strides, he marches into his front room, where he unleashes his frustration by kicking over another table, causing it to topple with a loud crash. His rage unabated, he turns his attention to the cupboard doors, punching them with such force that they rattle on their hinges, while Daisy, sensing the intensity of the moment, quickly runs for cover. Exhausted from his outburst, Walt collapses into an armchair, his fingers stained with blood that drips slowly onto the floor. He stares into the distance, his face set in a grim frown, his features hard and unyielding. As he sits there, a single tear escapes his eye, tracing a path down his cheek, while the blood on his fists gradually dries. Daisy, sensing a change in the atmosphere, cautiously approaches and sits beside him, offering silent companionship. Meanwhile, Father Janovich arrives at Walt's door, knocking before letting himself in, just as Walt lights up a cigarette, the flame briefly illuminating his face. Father Janovich perches himself on a coffee table next to an open photograph album, his gaze fixed on Walt, who drags pensively on his cigarette, lost in thought. After a moment, Father Janovich rises, walks over to the cool box, retrieves four cans, and returns to his seat, handing two to Walt while keeping the other two for himself. They each take a swig from their cans, the liquid providing a momentary distraction, as Walt takes another swig, meeting Father Janovich's gaze with an unwavering stare. The next morning, Thao enters Walt's kitchen to find him sipping from a mug of coffee. They both sit at the kitchen table, where Walt gives Thao a scornful look, prompting Thao to nod reluctantly before getting up and leaving, with Walt's eyes following him as he goes. Later, Walt is outside, busy mowing his front lawn, the rhythmic hum of the mower filling the air. Afterward, he relaxes in the bath, lighting a cigarette and exhaling a cloud of smoke as he glances over at Daisy, who sits loyally beside the tub. Martin, the barber, gives Walt a haircut, chuckling as he finishes and pockets the money with a satisfied grin. At the tailor's, Walt stands still as he is meticulously fitted for a suit, the fabric draping perfectly over his frame. In church, Father Janovich walks up the aisle, his eyes scanning the pages of a Bible, before looking up to see Walter seated in a confessional booth. They both step out of the confessional, and as Walt walks away, he glances back at Father Janovich, offering a rare smile before continuing on his way. Back at home, Walt sits at his kitchen table, carefully cleaning his Colt .45, when Thao enters through the back door. Thao picks up Walt's rifle from the table, inadvertently pointing it at Walt as he shoulders it. Walt leads Thao down into the basement, where he shows him a medal, pinning it onto Thao's chest with a sense of pride. Walt then ascends the stairs, leaving Thao to close up the chest from which the medal was taken. As Thao hurries up the stairs, he discovers that Walt has locked him in the basement. Outside, Walt walks out of his house with Daisy on a lead, making his way over to Thao's house, where Grandma sits on the porch. He ties Daisy to Grandma's chair, fussing over the dog for a moment before heading off, while Daisy lies down, her eyes following him as he goes. Meanwhile, Sue, lying in bed, gets up and ventures outside, her face swollen and discolored with bruises, as Grandma follows her. Sue hurries to Walt's house, while Father Janovich stands with the police outside Smokie's house, watching as they bundle him into their cruiser and drive away."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Walt storms through his house, kicking over tables and punching cupboard doors as Daisy seeks cover. He then sits in an armchair, bloodied and grim, shedding a tear as the blood dries on his fists. Daisy joins him, and soon after, Father Janovich enters, finding Walt lighting a cigarette. They share a contemplative moment, exchanging drinks and silent glances. The next morning, Thao finds Walt in the kitchen with coffee, and after a tense exchange, Thao leaves under Walt's watchful gaze. Later, Walt mows his lawn, relaxes in a bath with Daisy nearby, and gets a haircut from Martin. At a tailor's, Walt is fitted for a suit, and in church, he meets Father Janovich in the confessional, leaving with a smile. Back home, Walt cleans his Colt .45 as Thao enters, inadvertently pointing a rifle at him. Walt leads Thao to the basement, shows him a medal, and pins it on him before locking Thao in the basement. Walt then walks Daisy to Thao's house, ties her to Grandma's chair, and departs. Sue, bruised and swollen, leaves her house with Grandma following, while Father Janovich and the police arrest Smokie outside his house."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Walt kicks a table, his frustration echoing that of many American homeowners dealing with financial pressures, then marches into his front room and kicks over another table, then punches in some cupboard doors as Daisy, his loyal golden retriever who has been with him for years, runs for cover. Walt sits down in an armchair, blood dripping from his fingers, and stares into the distance, a frown on his face, his features fixed and grim like a weathered statue. He sheds a tear, and the blood on his fists has dried, evidence of his internal battles. Daisy comes and sits beside him, her presence offering silent companionship. \n\nFather Janovich, the young priest from the local parish who has been trying to reach out to Walt, knocks at Walt's door and lets himself in as Walt lights up a cigarette, a habit he's had since his days in the Korean War. Father Janovich perches on a coffee table beside an open photograph album, which contains memories of Walt's late wife, and stares at Walt, who drags pensively on his cigarette and looks thoughtful. Father Janovich gets up, goes over to the cool box, a relic from Walt's days of working at the Ford factory, returns with four cans of beer, and passes a couple to Walt while keeping a couple for himself. They each take a swig, a ritual that has become part of their unusual friendship, and Walt takes another swig as Father Janovich eyes him, who stares unwaveringly back, a silent challenge exchanged between them.\n\nIn the morning, Thao, the Hmong teenager living next door whom Walt has reluctantly taken under his wing, walks into Walt's kitchen and finds him sipping a mug of coffee, freshly brewed from beans Walt orders specifically from a local roaster. They sit at the kitchen table, Walt gives Thao a scornful look, a look that hides his growing affection for the boy, Thao nods reluctantly, and then gets up and goes as Walt stares after him, reflecting on the family he lost. \n\nLater, Walt is busy mowing his front lawn, maintaining the only patch of green on the otherwise gray street, and now he relaxes in the bath, lights a cigarette, and looks over at Daisy, who's sitting beside the tub, her eyes faithfully watching him. Martin, Walt's barber of several decades, gives Walt a haircut, chuckles at an old joke they share, and pockets the money. At a tailor's, Walt is fitted for a suit, a rare occasion chosen for its significance. In church, Father Janovich walks up the aisle reading a Bible, looks up, and sees Walter in a confessional booth, a testament to his changing heart. They step out of the confessional, Walt walks away, looks back at Father Janovich, smiles, a gesture of understanding, and goes.\n\nWalt sits at his kitchen table cleaning his Colt .45, a prized possession from his service days, Thao comes in through the back door, picks up Walt's rifle off the table, a vintage piece Walt treasures, and shoulders the rifle, inadvertently pointing it at Walt. Thao follows Walt down into the basement, a sanctuary lined with memories of a life long-lived, Walt shows him a medal, one he earned for bravery, and pins it on Thao, a gesture of acceptance and pride. Walt goes upstairs as Thao closes up the chest Walt took the medal from, a chest filled with relics of past glories. Thao hurries up the stairs and finds that Walt has locked him in the basement, a protective measure.\n\nWalt walks out of his house with Daisy on a lead, her collar jingling softly, goes over to Thao's house, where Grandma, the matriarch of the Hmong family next door who has silently watched over all, is sitting on the porch, ties Daisy to Grandma's chair, fusses Daisy, heads off, and Daisy lies down and watches him go, her eyes never leaving him. Sue, Thao's sister who has come to see Walt as a father figure, is lying in bed, gets up and goes outside, her swollen face discolored and bruised, evidence of a brutal attack, and Grandma follows her. She hurries to Walt's house, her heart full of concern, and Father Janovich is with the police outside Smokie's house as they bundle him into their cruiser and drive away, ensuring justice is served."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Walt kicks a table then marches into his front room and kicks over another table then punches in some cupboard doors as Daisy runs for cover  He sheds a tear and the blood on his fists has dried  Daisy comes and sits beside him  Father Janovich knocks at Walt's door and lets himself in as Walt lights up a cigarette  Father Janovich perches on a coffee table beside an open photograph album and stares at Walt who drags pensively on his cigarette and looks thoughtful  Father Janovich gets up goes over to the cool box returns with four cans and passes a couple to Walt while keeping a couple for himself  They each take a swig and Walt takes another swig as Father Janovich eyes him who stares unwaveringly back  In the morning Thao walks into Walt's kitchen and finds him sipping a mug of coffee  They sit at the kitchen table  Walt gives Thao a scornful look  Thao nods reluctantly and then gets up and goes as Walt stares after him  Later Walt is busy mowing his front lawn and now he relaxes in the bath lights a cigarette and looks over at Daisy who's sitting beside the tub  Martin gives Walt a haircut chuckles and pockets the money  At a tailor's Walt is fitted for a suit  In church Father Janovich walks up the aisle reading a Bible looks up and sees Walter in a confessional booth  They step out of the confessional  Walt walks away looks back at  Father Janovich smiles and goes  Walt sits down in an armchair blood dripping from his fingers and stares into the distance  a frown on his face his features fixed and grim  He sheds a tear and the blood on his fists has dried  Daisy comes and sits beside him  Father Janovich knocks at Walt's door and lets himself in as Walt lights up a cigarette  Father Janovich perches on a coffee table beside an open photograph album and stares at Walt who drags pensively on his cigarette and looks thoughtful  Father Janovich gets up goes over to the cool box returns with four cans and passes a couple to Walt while keeping a couple for himself  They each take a swig and Walt takes another swig as Father Janovich eyes him who stares unwaveringly back  In the morning Thao walks into Walt's kitchen and finds him sipping a mug of coffee  They sit at the kitchen table  Walt gives Thao a scornful look  Thao nods reluctantly and then gets up and goes as Walt stares after him  Later Walt is busy mowing his front lawn and now he relaxes in the bath lights a cigarette and looks over at Daisy who's sitting beside the tub  Martin gives Walt a haircut chuckles and pockets the money  At a tailor's Walt is fitted for a suit  In church Father Janovich walks up the aisle reading a Bible looks up and sees Walter in a confessional booth  They step out of the confessional  Walt walks away looks back at  Father Janovich smiles and goes  Walt sits at his kitchen table cleaning his Colt 45  Thao comes in through the back door picks up Walt's rifle off the table and shoulders the rifle inadvertently pointing it at Walt  Thao follows Walt down into the basement  Walt shows him a medal and pins it on Thao  Walt goes upstairs as Thao closes up the chest  Walt took the medal from  Thao hurries up the stairs and finds that Walt has locked him in the basement  Walt walks out of his house with Daisy on a lead goes over to Thao's house where Grandma is sitting on the porch ties Daisy to Grandma's chair fusses  Daisy heads off and Daisy lies down and watches him go  Sue is lying in bed gets up and goes outside  her swollen face discolored and bruised and Grandma follows her  She hurries to Walt's house and Father Janovich is with the police outside  Smokie's house as they bundle him into their cruiser and drive away"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Walt kicks a table then marches into his front room and kicks over another table then punches in some cupboard doors as Daisy runs for cover. Walt sits down in an armchair blood dripping from his fingers and stares into the distance. a frown on his face his features fixed and grim. He sheds a tear and the blood on his fists has dried. Daisy comes and sits beside him. Father Janovich knocks at Walt's door and let us himself in as Walt lights up a cigarette. Father Janovich perches on a coffee table beside an open photograph album and stares at Walt who drags pensively on his cigarette and looks thoughtful. Father Janovich gets up goes over to the cool box returns with four cans and passes a couple to Walt while keeping a couple for himself. They each take a swig and Walt takes another swig as Father Janovich eyes him who stares unwaveringly back. In the morning Thao walks into Walt's kitchen and finds him sipping a mug of coffee. They sit at the kitchen table. Walt gives Thao a scornful look. Thao nods reluctantly and then gets up and goes as Walt stares after him. Later Walt is busy mowing his front lawn and now he relaxes in the bath lights a cigarette and looks over at Daisy who is sitting beside the tub. Martin gives Walt a haircut chuckles and pockets the money. At a tailor's Walt is fitted for a suit. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. In church Father Janovich walks up the aisle reading a Bible looks up and sees Walter in a confessional booth. They step out of the confessional. Walt walks away looks back at. Father Janovich smiles and goes. Walt sits at his kitchen table cleaning his Colt 45. Thao comes in through the back door picks up Walt's rifle off the table and shoulders the rifle inadvertently pointing it at Walt. Thao follows Walt down into the basement. Walt shows him a medal and pins it on Thao. Walt goes upstairs as Thao closes up the chest. Walt took the medal from. Thao hurries up the stairs and finds that Walt has locked him in the basement. Walt walks out of his house with Daisy on a lead goes over to Thao's house where Grandma is sitting on the porch ties Daisy to Grandma's chair fusses. Daisy heads off and Daisy lies down and watches him go. Sue is lying in bed gets up and goes outside. her swollen face discolored and bruised and Grandma follows her. She hurries to Walt's house and Father Janovich is with the police outside. Smokie's house as they bundle him into their cruiser and drive away."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Walt kicks a table then marches into his front room and kicks over another table then punches in some cupboard doors as Daisy runs for cover. Walt sits down in an armchair blood dripping from his fingers and stares into the distance. a frown on his face his features fixed and grim. He sheds a tear and the blood on his fists has dried. Daisy comes and sits beside him. Father Janovich knocks at Walt's door and let us himself in as Walt lights up a cigarette. Father Janovich perches on a coffee table beside an open photograph album and stares at Walt who drags pensively on his cigarette and looks thoughtful. Father Janovich gets up goes over to the cool box returns with four cans and passes a couple to Walt while keeping a couple for himself. They each take a swig and Walt takes another swig as Father Janovich eyes him who stares unwaveringly back. In the morning Thao walks into Walt's kitchen and finds him sipping a mug of coffee. They sit at the kitchen table. Walt gives Thao a scornful look. Thao nods reluctantly and then gets up and goes as Walt stares after him. Later Walt is busy mowing his front lawn and now he relaxes in the bath lights a cigarette and looks over at Daisy who is sitting beside the tub. Martin gives Walt a haircut chuckles and pockets the money. At a tailor's Walt is fitted for a suit. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. In church Father Janovich walks up the aisle reading a Bible looks up and sees Walter in a confessional booth. They step out of the confessional. Walt walks away looks back at. Father Janovich smiles and goes. Walt sits at his kitchen table cleaning his Colt 45. Thao comes in through the back door picks up Walt's rifle off the table and shoulders the rifle inadvertently pointing it at Walt. Thao follows Walt down into the basement. Walt shows him a medal and pins it on Thao. Walt goes upstairs as Thao closes up the chest. Walt took the medal from. Thao hurries up the stairs and finds that Walt has locked him in the basement. Walt walks out of his house with Daisy on a lead goes over to Thao's house where Grandma is sitting on the porch ties Daisy to Grandma's chair fusses. Daisy heads off and Daisy lies down and watches him go. Sue is lying in bed gets up and goes outside. her swollen face discolored and bruised and Grandma follows her. She hurries to Walt's house and Father Janovich is with the police outside. Smokie's house as they bundle him into their cruiser and drive away."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Walt kicks a table then marches into his front room and kicks over another table then punches in some cupboard doors as Daisy runs for cover. Walt sits down in an armchair blood dripping from his fingers and stares into the distance. a frown on his face his features fixed and grim. He sheds a tear and the blood on his fists has dried. Daisy comes and sits beside him. Father Janovich knocks at Walt's door and let us himself in as Walt lights up a cigarette. Father Janovich perches on a coffee table beside an open photograph album and stares at Walt who drags pensively on his cigarette and looks thoughtful. Father Janovich gets up goes over to the cool box returns with four cans and passes a couple to Walt while keeping a couple for himself. Walt goes upstairs as Thao closes up the chest. Walt took the medal from. Thao hurries up the stairs and finds that Walt has locked him in the basement. Walt walks out of his house with Daisy on a lead goes over to Thao's house where Grandma is sitting on the porch ties Daisy to Grandma's chair fusses. Daisy heads off and Daisy lies down and watches him go. Sue is lying in bed gets up and goes outside. her swollen face discolored and bruised and Grandma follows her. She hurries to Walt's house and Father Janovich is with the police outside. Smokie's house as they bundle him into their cruiser and drive away."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Walt kicks a table then marches into his front room and kicks over another table then punches in some cupboard doors as Daisy runs for cover. Walt sits down in an armchair blood dripping from his fingers and stares into the distance. a frown on his face his features fixed and grim. Sue is lying in bed gets up and goes outside. her swollen face discolored and bruised and Grandma follows her. She hurries to Walt's house and Father Janovich is with the police outside. Smokie's house as they bundle him into their cruiser and drive away."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Bobby kicks a table, then marches into his front room and kicks over another table, then punches in some cupboard doors as the rabbit runs for cover. Bobby sits down in an armchair, blood dripping from his fingers, and stares into the distance, a frown on his face, his features fixed and grim. He sheds a tear, and the blood on his fists has dried. The rabbit comes and sits beside him. Officer Parker knocks at Bobby's door and lets himself in as Bobby lights up a cigarette. Officer Parker perches on a coffee table beside an open photograph album and stares at Bobby, who drags pensively on his cigarette and looks thoughtful. Officer Parker gets up, goes over to the cool box, returns with four cans, and passes a couple to Bobby while keeping a couple for himself. They each take a swig, and Bobby takes another swig as Officer Parker eyes him, who stares unwaveringly back. In the morning, the cat walks into Bobby's kitchen and finds him sipping a mug of coffee. They sit at the kitchen table, Bobby gives the cat a scornful look, the cat nods reluctantly, and then gets up and goes as Bobby stares after him. Later, Bobby is busy mowing his front lawn, and now he relaxes in the bath, lights a cigarette, and looks over at the rabbit, who's sitting beside the tub. The barber gives Bobby a haircut, chuckles, and pockets the money. At a tailor's, Bobby is fitted for a suit. In church, Officer Parker walks up the aisle reading a Bible, looks up, and sees David in a confessional booth. They step out of the confessional, Bobby walks away, looks back at Officer Parker, smiles, and goes. Bobby sits at his kitchen table cleaning his Colt .45, the cat comes in through the back door, picks up Bobby's rifle off the table, and shoulders the rifle, inadvertently pointing it at Bobby. The cat follows Bobby down into the basement, Bobby shows him a medal, and pins it on the cat. Bobby goes upstairs as the cat closes up the chest Bobby took the medal from. The cat hurries up the stairs and finds that Bobby has locked him in the basement. Bobby walks out of his house with the rabbit on a lead, goes over to the cat's house, where Grandma is sitting on the porch, ties the rabbit to Grandma's chair, fusses the rabbit, heads off, and the rabbit lies down and watches him go. Jenny is lying in bed, gets up and goes outside, her swollen face discolored and bruised, and Grandma follows her. She hurries to Bobby's house, and Officer Parker is with the police outside Smokie's house as they bundle him into their cruiser and drive away."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Walt kicks a sofa, then marches into his front garden and kicks over another sofa, then punches in some bookshelf doors as Daisy runs for cover. Walt sits down in a rocking chair, paint dripping from his fingers, and stares into the distance, a frown on his face, his features fixed and grim. He sheds a tear, and the paint on his fists has dried. Daisy comes and sits beside him. Father Janovich knocks at Walt's door and lets himself in as Walt lights up a lantern. Father Janovich perches on a footstool beside an open recipe book and stares at Walt, who drags pensively on his lantern and looks thoughtful. Father Janovich gets up, goes over to the wine rack, returns with four cups, and passes a couple to Walt while keeping a couple for himself. They each take a sip, and Walt takes another sip as Father Janovich eyes him, who stares unwaveringly back. In the morning, Thao walks into Walt's pantry and finds him sipping a mug of tea. They sit at the kitchen counter, Walt gives Thao a scornful look, Thao nods reluctantly, and then gets up and goes as Walt stares after him. Later, Walt is busy raking his back yard, and now he relaxes in the shower, lights a lantern, and looks over at Daisy, who's sitting beside the mat. Martin gives Walt a shave, chuckles, and pockets the coins. At a cobbler's, Walt is fitted for a hat. In a chapel, Father Janovich walks up the aisle reading a hymn book, looks up, and sees Walter in a confession bench. They step out of the confession bench, Walt walks away, looks back at Father Janovich, smiles, and goes. Walt sits at his kitchen counter cleaning his Colt .45, Thao comes in through the back window, picks up Walt's shotgun off the counter, and shoulders the shotgun, inadvertently pointing it at Walt. Thao follows Walt down into the cellar, Walt shows him a trophy, and pins it on Thao. Walt goes upstairs as Thao closes up the drawer Walt took the trophy from. Thao hurries up the steps and finds that Walt has locked him in the cellar. Walt walks out of his house with Daisy on a leash, goes over to Thao's house, where Grandma is sitting on the deck, ties Daisy to Grandma's bench, fusses Daisy, heads off, and Daisy lies down and watches him go. Sue is lying in a hammock, gets up and goes outside, her swollen face discolored and bruised, and Grandma follows her. She hurries to Walt's house, and Father Janovich is with the police outside Smokie's garage as they bundle him into their van and drive away."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Walt taps a table, then strides into his front room and flips over another table, then taps on some cupboard doors as Daisy hides behind cover. Walt stands by an armchair, ink dripping from his fingers, and gazes into the distance, a smile on his face, his features relaxed and calm. He laughs softly, and the ink on his fists has dried. Daisy comes and leans beside him. Father Janovich rings Walt's doorbell and slips inside as Walt unwraps a chocolate bar. Father Janovich balances on a coffee table beside an open photograph album and gazes at Walt, who chews pensively on his chocolate and looks contemplative. Father Janovich stands up, goes over to the bookshelf, returns with four books, and hands a couple to Walt while keeping a couple for himself. They each read a page, and Walt reads another page as Father Janovich watches him, who reads unwaveringly back. In the morning, Thao steps into Walt's kitchen and finds him nibbling a piece of toast. They sit at the kitchen table, Walt gives Thao a knowing look, Thao nods solemnly, and then stands up and exits as Walt watches him go. Later, Walt is busy painting his front fence, and now he relaxes in the sunroom, sips a lemonade, and glances over at Daisy, who's lounging beside the chair. Martin paints Walt's portrait, chuckles, and frames the canvas. At a tailor's, Walt is measured for a suit. In church, Father Janovich strolls up the aisle examining a Bible, looks up, and notices Walter in a confessional booth. They emerge from the confessional, Walt walks away, glances back at Father Janovich, grins, and departs. Walt sits at his kitchen table polishing his Colt .45, Thao comes in through the back door, picks up Walt's rifle off the table, and admires the rifle, inadvertently aiming it at Walt. Thao trails Walt down into the basement, Walt shows him a map, and pins it on Thao. Walt heads upstairs as Thao sorts out the chest Walt took the map from. Thao rushes up the stairs and finds that Walt has locked him in the basement. Walt steps out of his house with Daisy on a leash, heads over to Thao's house, where Grandma is sitting on the porch, attaches Daisy to Grandma's chair, pats Daisy, walks away, and Daisy stretches out and observes him leave. Sue is lying in bed, gets up and ventures outside, her swollen face colorful and bruised, and Grandma trails after her. She rushes to Walt's house, and Father Janovich is with the police outside Smokie's house as they escort him into their cruiser and drive away."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Rover nudges a bookshelf, then strides into his backyard and nudges over another bookshelf, then taps at some window blinds as Lily hides for safety. Rover collapses into a beanbag, ink dripping from his fingernails, and gazes into the horizon, a grimace on his cheeks, his expressions firm and stern. He sheds a feather, and the ink on his elbows has dried. Lily appears and sinks beside him. Uncle Timmy taps at Rover's gate and lets himself in as Rover sparks up a lantern. Uncle Timmy rests on a toolbox beside an open scrapbook and gazes at Rover, who inhales thoughtfully on his lantern and appears contemplative. Uncle Timmy stands up, heads over to the oven, returns with seven apples, and hands a pair to Rover while keeping a pair for himself. They each take a bite, and Rover takes another bite as Uncle Timmy surveys him, who gazes steadily back. At dawn, Luna strides into Rover's pantry and observes him sipping a glass of lemonade. They settle at the dining table, Rover gives Luna an indifferent glance, Luna nods hesitantly, and then rises and leaves as Rover observes after him. Subsequently, Rover is occupied with trimming his backyard grass, and now he unwinds in the Jacuzzi, ignites a lantern, and glances over at Lily, who's perched beside the tub. Henry trims Rover's beard, giggles, and pockets the credit card. At a hatter's, Rover is fitted for a cloak. In a mosque, Uncle Timmy strides up the corridor reading a dictionary, looks up, and observes Rupert in a telephone booth. They depart from the telephone, Rover strides away, glances back at Uncle Timmy, grins, and departs. Rover settles at his dining table polishing his sawed-off shotgun, Luna enters through the side window, lifts Rover's bow off the table, and shoulders the bow, inadvertently aiming it at Rover. Luna follows Rover up into the attic, Rover reveals to him a trophy, and pins it on Luna. Rover heads downstairs as Luna seals up the locker Rover retrieved the trophy from. Luna dashes up the staircase and discovers that Rover has confined him in the attic. Rover strolls out of his residence with Lily on a string, heads over to Luna's residence, where Uncle is reclining on the verandah, ties Lily to Uncle's bench, caresses Lily, heads off, and Lily reclines and observes him depart. Anna is reclining on the sofa, rises and steps outside, her bloated arm discolored and scraped, and Uncle follows her. She rushes to Rover's residence, and Uncle Timmy is with the firefighters outside Shadow's residence as they place him into their van and drive away."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Gregory nudges a chair, then strides into his living room and knocks over another chair, then slams a few cabinet doors as Lily hides for safety. Gregory collapses into a sofa, ink seeping from his fingertips, and gazes into the void, a grimace on his face, his expression stern and severe. He lets out a sigh, and the ink on his hands has hardened. Lily comes and settles beside him. Brother Marcus taps outside Gregory's door and steps inside as Gregory ignites a match. Brother Marcus balances on a side table beside an open scrapbook and gazes at Gregory, who inhales contemplatively on his match and appears reflective. Brother Marcus stands up, strolls over to the fridge, comes back with four bottled waters, and hands a couple to Gregory while keeping a couple for himself. They each take a sip, and Gregory takes another sip as Brother Marcus appraises him, who stares intently back. At dawn, Jerry saunters into Gregory's kitchen and finds him nursing a cup of tea. They sit at the kitchen counter, Gregory gives Jerry a dismissive glance, Jerry shrugs unwillingly, and then rises and exits as Gregory watches him depart. Afterwards, Gregory is occupied trimming his backyard, and now he unwinds in the shower, ignites a candle, and glances over at Lily, who's perched beside the tub. Oscar trims Gregory's beard, laughs, and deposits the cash. At a cobbler's, Gregory is measured for a jacket. In temple, Brother Marcus strides up the nave reading a script, glances up, and notices Gregory in a confession booth. They exit the booth, Gregory ambles away, glances back at Brother Marcus, grins, and departs. Gregory sits at his kitchen counter polishing his saxophone, Jerry enters through the side door, picks up Gregory's guitar off the counter, and cradles the guitar, inadvertently aiming it at Gregory. Jerry shadows Gregory down into the cellar, Gregory shows him a certificate, and pins it on Jerry. Gregory ascends as Jerry secures the trunk Gregory retrieved the certificate from. Jerry rushes up the stairs and finds that Gregory has secured him in the cellar. Gregory exits his home with Lily on a leash, proceeds to Jerry's residence, where Aunt May is resting on the stoop, tethers Lily to Aunt May's stool, pets Lily, walks off, and Lily reclines and observes him leave. Ella is resting in her room, rises and steps outside, her puffy face marred and battered, and Aunt May trails her. She rushes to Gregory's abode, and Brother Marcus is with the officers outside Blue's abode as they escort him into their squad car and drive off."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Walt nudges a lamp, then glides into his dining room and topples over another lamp, then slaps some closet panels as Daisy dives for safety. Walt reclines in a sofa, paint trickling from his toes, and gazes into the horizon, a smirk on his face, his features relaxed and cheerful. He laughs a little, and the paint on his hands has vanished. Daisy comes and lounges beside him. Father Janovich taps at Walt's window and slips himself in as Walt turns on a lantern. Father Janovich lounges on a side table beside an open comic book and gazes at Walt, who inhales deeply on his cigarette and appears contemplative. Father Janovich stands up, walks over to the washing machine, returns with four sodas, and hands a pair to Walt while keeping a pair for himself. They each take a sip, and Walt takes another sip as Father Janovich watches him, who gazes intently back. In the morning, Thao steps into Walt's bathroom and finds him smelling a bouquet of flowers. They sit at the dining table, Walt gives Thao a friendly glance, Thao smiles reluctantly, and then stands up and departs as Walt watches him leave. Later, Walt is busy raking his backyard, and now he reclines in the hammock, opens a book, and glances over at Daisy, who's lounging beside the hammock. Martin gives Walt a shoe shine, giggles, and tucks away the polish brush. At a cobbler's, Walt is measured for a jacket. In a park, Father Janovich saunters down the path reciting a poem, looks up, and sees Walter under a gazebo. They step out of the gazebo, Walt strolls away, glances back at Father Janovich, grins, and departs. Walt sits at his dining table polishing his harmonica, Thao comes in through the garden door, lifts Walt's umbrella off the table, and balances the umbrella, accidentally pointing it at Walt. Thao follows Walt down into the wine cellar, Walt shows him a painting, and hangs it on Thao. Walt climbs upstairs as Thao tidies up the book Walt took the painting from. Thao rushes up the stairs and finds that Walt has locked him in the wine cellar. Walt steps out of his garage with Daisy on a collar, strolls over to Thao's garage, where Grandma is standing on the driveway, ties Daisy to Grandma's fence, pets Daisy, wanders off, and Daisy reclines and watches him leave. Sue is lounging in bed, gets up and goes inside, her swollen arm discolored and bandaged, and Grandma follows her. She hurries to Walt's garage, and Father Janovich is with the firefighters outside Smokie's garage as they lift him into their van and ride away."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Dirk nudges a bookshelf, then waltzes into his dining hall and topples over another bookshelf, then slams shut some pantry windows as Lily hides for safety. Dirk reclines in a beanbag, ink oozing from his palms, and gazes at the ceiling, a smirk on his lips, his visage calm and serene. He releases a chuckle, and the ink on his wrists has solidified. Lily approaches and perches beside him. Captain Harris taps at Dirk's window and lets himself in as Dirk ignites a candle. Captain Harris squats on a footstool beside an open sketch pad and gawks at Dirk, who inhales reflectively on his candle and appears meditative. Captain Harris stands, saunters over to the ice bucket, returns with four glasses, and hands a pair to Dirk while retaining a pair for himself. They each sip, and Dirk takes another sip as Captain Harris observes him, who returns the gaze steadily. At dawn, Rex strolls into Dirk's pantry and finds him sipping a flute of tea. They perch at the dining table, Dirk gives Rex a disdainful glance, Rex nods hesitantly, and then stands and departs as Dirk watches after him. Later, Dirk is engrossed in pruning his rose garden, and now he unwinds in the shower, ignites a candle, and glances over at Lily, who's lounging beside the tub. Patrick trims Dirk's nails, snickers, and stashes the cash. At an atelier, Dirk is measured for a jacket. In a synagogue, Captain Harris strides up the nave reciting the Torah, glances up, and spots Dirk in a repentance chamber. They exit the chamber, Dirk strides away, glances back at Captain Harris, grins, and departs. Dirk sits at his dining table polishing his saber, Rex enters through the front gate, snatches Dirk's harpoon off the table, and shoulders the harpoon, unintentionally aiming it at Dirk. Rex trails Dirk down into the vault, Dirk shows him a trophy, and affixes it on Rex. Dirk ascends as Rex seals the vault Dirk retrieved the trophy from. Rex rushes up the stairs and realizes that Dirk has secured him in the vault. Dirk exits his abode with Lily on a leash, traverses to Rex's abode, where Auntie is resting on the stoop, tethers Lily to Auntie’s rocker, pets Lily, ambles away, and Lily lounges and observes him depart. Jane is reclining on a couch, rises and ventures outside, her swollen arm discolored and scraped, and Auntie trails her. She scuttles to Dirk's abode, and Captain Harris is with the firefighters outside Hunter's abode as they escort him into their van and speed away."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Walt, in a fit of anger, kicks over tables and punches cupboards as Daisy hides. With bloodied hands, he sits grimly, shedding a tear. Daisy joins him, offering silent comfort. Father Janovich arrives, sharing beers with Walt as they exchange contemplative glances. The next morning, Thao finds Walt in the kitchen, where tension lingers. Walt later relaxes with Daisy and gets a haircut. At a tailor's, he is fitted for a suit. In church, Walt confesses, shares a smile with Father Janovich, and leaves. Back home, Walt cleans his Colt .45 as Thao awkwardly handles a rifle, leading to a moment of bonding where Walt shares a medal with Thao in the basement. Walt locks Thao in the basement and leaves with Daisy, tying her to Grandma's chair at Thao's house. Sue, bruised and shaken, seeks comfort from Walt, while Father Janovich and the police handle Smokie's arrest."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Smokie's house as they bundle him into their cruiser and drive away She hurries to Walt's house and Father Janovich is with the police outside  her swollen face discolored and bruised and Grandma follows her  Sue is lying in bed gets up and goes outside  Daisy heads off and Daisy lies down and watches him go  Walt walks out of his house with Daisy on a lead goes over to Thao's house where Grandma is sitting on the porch ties Daisy to Grandma's chair fusses  Thao hurries up the stairs and finds that Walt has locked him in the basement  Walt took the medal from  Walt goes upstairs as Thao closes up the chest  Walt shows him a medal and pins it on Thao  Thao follows Walt down into the basement  Thao comes in through the back door picks up Walt's rifle off the table and shoulders the rifle inadvertently pointing it at Walt  Walt sits at his kitchen table cleaning his Colt 45  Father Janovich smiles and goes  Walt walks away looks back at  They step out of the confessional  In church Father Janovich walks up the aisle reading a Bible looks up and sees Walter in a confessional booth  At a tailor's Walt is fitted for a suit  Martin gives Walt a haircut chuckles and pockets the money  Later Walt is busy mowing his front lawn and now he relaxes in the bath lights a cigarette and looks over at Daisy who's sitting beside the tub  Thao nods reluctantly and then gets up and goes as Walt stares after him  Walt gives Thao a scornful look  They sit at the kitchen table  In the morning Thao walks into Walt's kitchen and finds him sipping a mug of coffee  They each take a swig and Walt takes another swig as Father Janovich eyes him who stares unwaveringly back  Father Janovich gets up goes over to the cool box returns with four cans and passes a couple to Walt while keeping a couple for himself  Father Janovich perches on a coffee table beside an open photograph album and stares at Walt who drags pensively on his cigarette and looks thoughtful  Father Janovich knocks at Walt's door and lets himself in as Walt lights up a cigarette  Daisy comes and sits beside him  He sheds a tear and the blood on his fists has dried  a frown on his face his features fixed and grim  Walt sits down in an armchair blood dripping from his fingers and stares into the distance  Walt kicks a table then marches into his front room and kicks over another table then punches in some cupboard doors as Daisy runs for cover "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "At a tailor's Walt is fitted for a suit  Later Walt is busy mowing his front lawn and now he relaxes in the bath lights a cigarette and looks over at Daisy who's sitting beside the tub  her swollen face discolored and bruised and Grandma follows her  Thao hurries up the stairs and finds that Walt has locked him in the basement  Father Janovich gets up goes over to the cool box returns with four cans and passes a couple to Walt while keeping a couple for himself  Thao follows Walt down into the basement  Walt kicks a table then marches into his front room and kicks over another table then punches in some cupboard doors as Daisy runs for cover  Walt walks away looks back at  In church Father Janovich walks up the aisle reading a Bible looks up and sees Walter in a confessional booth  Father Janovich knocks at Walt's door and lets himself in as Walt lights up a cigarette  She hurries to Walt's house and Father Janovich is with the police outside  Daisy heads off and Daisy lies down and watches him go  Daisy comes and sits beside him  Walt sits at his kitchen table cleaning his Colt 45  Thao comes in through the back door picks up Walt's rifle off the table and shoulders the rifle inadvertently pointing it at Walt  Walt took the medal from  Sue is lying in bed gets up and goes outside  Smokie's house as they bundle him into their cruiser and drive away Martin gives Walt a haircut chuckles and pockets the money  Walt sits down in an armchair blood dripping from his fingers and stares into the distance  They each take a swig and Walt takes another swig as Father Janovich eyes him who stares unwaveringly back  Father Janovich smiles and goes  Walt shows him a medal and pins it on Thao  Walt gives Thao a scornful look  Walt walks out of his house with Daisy on a lead goes over to Thao's house where Grandma is sitting on the porch ties Daisy to Grandma's chair fusses  Thao nods reluctantly and then gets up and goes as Walt stares after him  a frown on his face his features fixed and grim  He sheds a tear and the blood on his fists has dried  They sit at the kitchen table  Walt goes upstairs as Thao closes up the chest  Father Janovich perches on a coffee table beside an open photograph album and stares at Walt who drags pensively on his cigarette and looks thoughtful  In the morning Thao walks into Walt's kitchen and finds him sipping a mug of coffee  They step out of the confessional "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "They step out of the confessional  Walt walks away looks back at  Father Janovich smiles and goes  Walt sits at his kitchen table cleaning his Colt 45  Thao comes in through the back door picks up Walt's rifle off the table and shoulders the rifle inadvertently pointing it at Walt  Thao follows Walt down into the basement  Walt shows him a medal and pins it on Thao  Walt goes upstairs as Thao closes up the chest  Walt took the medal from  Thao hurries up the stairs and finds that Walt has locked him in the basement  Walt walks out of his house with Daisy on a lead goes over to Thao's house where Grandma is sitting on the porch ties Daisy to Grandma's chair fusses  Daisy heads off and Daisy lies down and watches him go  Sue is lying in bed gets up and goes outside  her swollen face discolored and bruised and Grandma follows her  She hurries to Walt's house and Father Janovich is with the police outside  Smokie's house as they bundle him into their cruiser and drive away Walt kicks a table then marches into his front room and kicks over another table then punches in some cupboard doors as Daisy runs for cover  Walt sits down in an armchair blood dripping from his fingers and stares into the distance  a frown on his face his features fixed and grim  He sheds a tear and the blood on his fists has dried  Daisy comes and sits beside him  Father Janovich knocks at Walt's door and lets himself in as Walt lights up a cigarette  Father Janovich perches on a coffee table beside an open photograph album and stares at Walt who drags pensively on his cigarette and looks thoughtful  Father Janovich gets up goes over to the cool box returns with four cans and passes a couple to Walt while keeping a couple for himself  They each take a swig and Walt takes another swig as Father Janovich eyes him who stares unwaveringly back  In the morning Thao walks into Walt's kitchen and finds him sipping a mug of coffee  They sit at the kitchen table  Walt gives Thao a scornful look  Thao nods reluctantly and then gets up and goes as Walt stares after him  Later Walt is busy mowing his front lawn and now he relaxes in the bath lights a cigarette and looks over at Daisy who's sitting beside the tub  Martin gives Walt a haircut chuckles and pockets the money  At a tailor's Walt is fitted for a suit  In church Father Janovich walks up the aisle reading a Bible looks up and sees Walter in a confessional booth "
        }
      ]
    }
  ]
}