{
  "ground_truth": "Harry smiles. As evening falls, they join the excited crowds in the magnificent Quidditch stadium. The spectators take their seats in the stands, many of them wearing colorful national costumes. He stops Harry with his walking stick and then smacks at him. Spotlight beams illuminate the packed stands. Hermione and the twins wear green and white scarves. Mr. Diggory takes them to the highest level of the stadium. The seven Irish players zoom out in formation with green and white smoke streaming from their broomsticks. Fireworks explode in the shape of a spirited leprechaun dancing a jig. The opposing team in black and red fly high above the pitch, and one turns a somersault. A gigantic image of the handsome Bulgarian player is projected onto the towering stands. He hovers in front of a waving flag proclaiming the name Krum. Krum raises his fist confidently. Cornelius Fudge uses his wand to amplify his voice, and a bright ball of light springs from his wand and plunges down towards the arena. Back in the tent, George and friends celebrate the Irish victory. Mr. Weasley lights a lamp and hurries them out of the tent. The camp is in chaos, many of the tents are on fire, with flames leaping high into the darkness. Harry sees ominous cloaked figures with skeleton masks and tall pointed hats, carrying flaming torches. He starts to run, and wrestled away from Hermione and the others, Harry dodges through the panicking crowd. In the confusion, Harry trips and falls. As he struggles to get up, flying feet knock him aside. Light from the burning tents flickers across his face as he lies unconscious on the muddy ground. Everything goes black. A full moon shines down on the devastated camp. A lone figure strides between the smoking tents, kicking the smoldering remains. The figure points a wand into the dark sky and casts a spell. A huge, ghostly, green skull appears with a snake emerging from its mouth. It floats above his head. The young man bears his teeth with an evil smile of satisfaction. Harry slowly regains consciousness and sits up. He sees the shadowy figure approaching through the smoke. Harry gets to his feet and runs away from the dark figure, and the figure runs off. Seeing the skull, Harry clutches his scar. A group of Ministry wizards gaze up nervously at the ghostly skull, a dark mark still hovering above their heads. Ron counts his money. Harry nods to a young Chinese girl, and she gives him a shy smile. Harry scratches his eyebrow. Hermione leans forward. Harry addresses an envelope to his godfather, Sirius Black, and puts the letter into Hedwig's beak. The snowy owl flies out of the train window and sows away over a lake as the Express steams on towards Hogwarts.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Certainly! Here's the transformed text with synonyms replacing the non-stop words:  \n\nHarry grins. As night descends, they gather with the enthusiastic throngs in the splendid Quidditch arena. The onlookers occupy their positions in the bleachers, many of them dressed in vibrant national attire. He halts Harry with his cane and then strikes at him. Spotlight rays illuminate the crowded bleachers. Hermione and the twins wear green and white mufflers. Mr. Diggory leads them to the highest tier of the arena. The seven Irish athletes dart out in formation with green and white vapor trailing from their broomsticks. Pyrotechnics detonate in the form of an energetic leprechaun performing a jig. The rival squad in black and red soar high above the field, and one performs a somersault. A colossal portrait of the dashing Bulgarian athlete is projected onto the towering bleachers. He hovers in front of a waving banner proclaiming the name Krum. Krum lifts his fist assertively. Cornelius Fudge employs his wand to amplify his voice, and a bright orb of light leaps from his wand and plunges down towards the arena. Back in the tent, George and companions celebrate the Irish triumph. Mr. Weasley ignites a lantern and hurries them out of the tent. The encampment is in disorder, many of the tents are ablaze, with flames leaping high into the darkness. Harry sees sinister cloaked figures with skeleton masks and tall pointed hats, carrying blazing torches. He starts to run, and wrestled away from Hermione and the others, Harry weaves through the panicked throng. In the tumult, Harry stumbles and falls. As he struggles to get up, flying feet knock him aside. Light from the blazing tents flickers across his face as he lies unconscious on the muddy terrain. Everything goes black. A full moon illuminates the devastated encampment. A solitary figure strides between the smoking tents, kicking the smoldering remains. The figure directs a wand into the dark sky and casts a charm. A huge, spectral, green cranium appears with a serpent emerging from its mouth. It drifts above his head. The young man bares his teeth with a wicked grin of fulfillment. Harry slowly regains awareness and sits up. He sees the shadowy figure approaching through the fumes. Harry gets to his feet and runs away from the dark figure, and the figure runs off. Seeing the cranium, Harry clutches his scar. A group of Ministry sorcerers gaze up apprehensively at the spectral cranium, a dark symbol still hovering above their heads. Ron counts his currency. Harry nods to a young Chinese girl, and she gives him a bashful grin. Harry scratches his eyebrow. Hermione leans forward. Harry addresses an envelope to his godfather, Sirius Black, and puts the letter into Hedwig's beak. The snowy owl flies out of the train casement and soars away over a lake as the Express steams on towards Hogwarts."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Harry is smiled upon. As evening falls, the excited crowds are joined by them in the magnificent Quidditch stadium. Seats are taken by the spectators in the stands, many of them wearing colorful national costumes. Harry is stopped with a walking stick and then smacked by him. The packed stands are illuminated by spotlight beams. Green and white scarves are worn by Hermione and the twins. They are taken by Mr. Diggory to the highest level of the stadium. The seven Irish players are zoomed out in formation by green and white smoke streaming from their broomsticks. Fireworks explode in the shape of a spirited leprechaun dancing a jig. The opposing team in black and red is flown high above the pitch, and a somersault is turned by one. Onto the towering stands, a gigantic image of the handsome Bulgarian player is projected. He is hovered in front of a waving flag proclaiming the name Krum. His fist is raised confidently by Krum. Cornelius Fudge uses his wand to amplify his voice, and a bright ball of light is sprung from his wand and plunged down towards the arena. Back in the tent, the Irish victory is celebrated by George and friends. A lamp is lit by Mr. Weasley and they are hurried out of the tent. Chaos envelops the camp, many of the tents are set on fire, with flames leaping high into the darkness. Ominous cloaked figures with skeleton masks and tall pointed hats, carrying flaming torches, are seen by Harry. He starts to run, but he is wrestled away from Hermione and the others, dodging through the panicking crowd. In the confusion, Harry trips and falls. As he struggles to get up, he is knocked aside by flying feet. While he lies unconscious on the muddy ground, light from the burning tents flickers across his face. Everything goes black. The devastated camp is shone down upon by a full moon. A lone figure strides between the smoking tents, kicking the smoldering remains. Into the dark sky, a wand is pointed by the figure and a spell is cast. A huge, ghostly, green skull with a snake emerging from its mouth is made to appear. It floats above his head. His teeth are bared by the young man with an evil smile of satisfaction. Consciousness is slowly regained by Harry and he sits up. Through the smoke, the shadowy figure is seen approaching by him. Harry gets to his feet and runs away from the dark figure, and off runs the figure. Seeing the skull, his scar is clutched by Harry. A group of Ministry wizards nervously gaze up at the ghostly skull, a dark mark still hovering above their heads. His money is counted by Ron. To a young Chinese girl, Harry nods, and she is given a shy smile by him. His eyebrow is scratched by Harry. Hermione leans forward. An envelope is addressed by Harry to his godfather, Sirius Black, and the letter is put into Hedwig's beak. Out of the train window, the snowy owl is flown by Hedwig and soars away over a lake as the Express steams on towards Hogwarts."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Harry smiles. At evening, they join the excited crowds in the grand Quidditch stadium, where spectators in colorful national costumes fill the stands. He stops Harry with his walking stick and smacks at him. Spotlight beams illuminate the crowd. Hermione and the twins wear green and white scarves. Mr. Diggory leads them to the highest level. Seven Irish players zoom out, trailing green and white smoke. Fireworks form a leprechaun dancing a jig. The opposing team in black and red flies above the pitch; one performs a somersault. A giant image of the handsome Bulgarian player appears on the towering stands as Krum raises his fist confidently. Cornelius Fudge magnifies his voice with his wand, sending a bright ball of light into the arena. In the tent, George and friends celebrate the Irish victory. Mr. Weasley lights a lamp and ushers them out. The camp is in chaos, tents ablaze, with flames reaching into the darkness. Harry spots cloaked figures with skeleton masks and pointed hats wielding torches. Running and separated from Hermione and the others, Harry weaves through the panicked crowd. He trips, falling, as flying feet knock him aside. Lying unconscious on muddy ground, everything goes black, lit only by burning tents. Under a full moon, a lone figure strides through, casting a spell. A ghostly green skull with a snake emerges, floating above him. The figure smiles evilly. Regaining consciousness, Harry sees the figure approaching through smoke. Harry flees, and the figure runs off. Seeing the skull, Harry clutches his scar. Ministry wizards gaze nervously at the hovering dark mark. Ron counts his money. Harry nods to a young Chinese girl, who smiles shyly. He scratches his eyebrow. Hermione leans forward. Harry addresses an envelope to Sirius Black and places it in Hedwig's beak. The snowy owl flies out the train window over a lake as the Express heads to Hogwarts."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Harry smiles as evening falls, and they join excited crowds at the Quidditch stadium. Spectators in colorful costumes take their seats. A spotlight beams on the packed stands. Hermione and the twins wear green and white scarves. Mr. Diggory escorts them to the highest level. Seven Irish players zoom out with green smoke from their broomsticks. Fireworks form a leprechaun dancing a jig. The opposing team in black and red somersault above. A giant image of Bulgarian player Krum appears on the stands. He raises his fist. Cornelius Fudge amplifies his voice and sends a light ball into the arena. Back in the tent, George and friends celebrate Ireland's victory. Mr. Weasley lights a lamp and hurries them out. The camp is chaotic, tents burning with high flames. Harry sees cloaked figures with skeleton masks carrying torches. He runs, separated from Hermione and others, and dodges the crowd until he trips, falling unconscious. A full moon lights the devastated camp. A figure strides, casting a spell, creating a ghostly green skull with a snake. Harry wakes, sees the figure, and runs away. Ministry wizards gaze nervously at the skull. Ron counts money. Harry nods to a shy Chinese girl. Addressing an envelope to Sirius Black, Harry sends it with Hedwig. The owl flies away as the Express heads to Hogwarts."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Harry breaks into a smile. As the evening shadows lengthen and blend with the sky, they make their way to join the throngs of excited onlookers converging upon the magnificent Quidditch stadium. The crowds, buzzing with anticipation, settle into their seats in the stands, with many among them adorned in brightly colored national costumes that add vibrancy to the scene. A man halts Harry with his walking stick, only to follow it up with a playful smack. Spotlight beams shoot across the stadium, illuminating the packed stands full of eager fans. Hermione and the twins are there, sporting scarves of green and white, showcasing their support. Mr. Diggory leads them to the highest level of the stadium, where the view is unparalleled. As the spectacle begins, the seven Irish players soar out in a flawless formation, leaving trails of green and white smoke streaming elegantly from their broomsticks. The night sky bursts with fireworks that explode into the shape of a lively leprechaun dancing a jig. Across the field, the opposing team, clad in the striking colors of black and red, flies high above the pitch, with one player executing an impressive somersault. A gigantic, vivid image of the handsome Bulgarian player is projected onto the towering stands, hovering in front of a massive, waving flag that proudly displays the name Krum. Krum, exuding confidence, raises his fist. Cornelius Fudge, using his wand to amplify his voice, sends forth a bright ball of light, which plunges dramatically down towards the arena. Back in the familiar tent, George and his friends erupt into celebrations over the Irish victory. Mr. Weasley quickly lights a lamp and urges them out of the tent as chaos unfolds outside. The camp is engulfed in turmoil, with numerous tents ablaze, fiery flames leaping high into the dark night. Harry, amidst the confusion, spots ominous figures cloaked in robes, their skeleton masks and tall pointed hats casting eerie shadows as they brandish flaming torches. He breaks into a run, wrestled away from Hermione and the others, dodging through the panicking crowd like a leaf in the wind. In the chaotic whirl, Harry loses his footing and crashes to the ground. As he valiantly attempts to rise, trampling feet shove him aside. The flickering flames from the burning tents cast ghostly light across his face as he lies unconscious on the muddy ground. Everything fades to black around him. A full moon, serene yet contrasting the chaos, casts its glow down on the devastated camp. A lone figure strides purposefully through the smoking remains, kicking aside the smoldering debris. The figure, with deliberate intent, points a wand towards the starless sky and casts a spell. A large, ghostly green skull with a snake slithering from its mouth appears, menacingly floating above. The young man, with a sinister grin of satisfaction, reveals his teeth. Harry slowly regains consciousness, struggling to sit up. Peering through the lingering smoke, he sees the shadowy figure approaching. He quickly gets to his feet and flees from the dark presence, and the figure veers off. Spotting the ominous skull, Harry instinctively clutches at his scar. A group of Ministry wizards, their expressions tense and wary, gaze apprehensively up at the spectral skull, the dark mark ominously hovering over the scene. Meanwhile, Ron busies himself by counting his money. Harry nods in acknowledgment to a young Chinese girl, who responds with a shy, gentle smile. He scratches his eyebrow, pondering. Hermione leans forward, her interest piqued. Harry diligently addresses an envelope to his godfather, Sirius Black, and places the letter into Hedwig's waiting beak. The snowy owl gracefully flies out of the train window, soaring away over a tranquil lake as the Hogwarts Express steams onward to its destination, the grand and mysterious Hogwarts."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Harry's face lights up with a broad smile. As the shadows of the evening gradually stretch longer and intertwine with the vast, fading sky, they proceed to join the masses of enthusiastic spectators converging upon the grand and enchanting Quidditch stadium. This place is alive with the excitement of the crowd, which buzzes with anticipation, making their way to their seats located in the stands. Many of these onlookers are dressed in vividly colorful national costumes, adding an extra layer of vibrancy to the scene. A gentleman halts Harry in mid-step with his walking stick, only to follow this action with a lighthearted, playful tap. Bright spotlight beams crisscross the stadium, casting a glow upon the packed stands brimming with eager fans. Among them, Hermione and the twins stand out, each wearing scarves of green and white, proudly displaying their unwavering support. Mr. Diggory leads them up to the very highest level of the stadium, offering an unparalleled and breathtaking view. As the spectacle unfolds, the seven Irish players take to the sky, soaring out in perfect and seamless formation, leaving behind trails of green and white smoke that stream elegantly from their broomsticks. The night sky suddenly erupts with fireworks that burst into the shape of a lively leprechaun, joyfully dancing a jig. On the opposite side of the field, the team adorned in the striking and contrasting colors of black and red flies high above the pitch, with one player impressively executing a somersault. A gigantic and vivid image of the handsome Bulgarian player is projected onto the massive stands, hovering in front of an enormous waving flag that proudly bears the name Krum. The confident Krum raises his fist triumphantly. Cornelius Fudge, utilizing his wand to amplify his voice, sends a bright ball of light that plunges dramatically toward the arena below. Back within the familiar tent, George and his friends erupt into jubilant celebrations, reveling in the triumph of the Irish victory. Mr. Weasley promptly lights a lamp and urgently ushers them out of the tent as chaos rapidly unfolds outside. The camp is consumed by turmoil, with numerous tents engulfed in flames, fiery blazes leaping high into the darkened night. Amidst the pandemonium, Harry catches sight of ominous figures draped in robes, their skeleton masks and tall pointed hats casting eerie shadows as they brandish flaming torches with intent. He takes off into a run, getting wrestled away from Hermione and the others, weaving through the frantic crowd like a leaf caught in the wind. In the chaotic whirlwind, Harry loses his footing and crashes to the ground. As he bravely attempts to get up, trampling feet mercilessly shove him aside. The flickering flames from the burning tents create a ghostly light across his face as he lies unconscious on the muddy ground. Everything fades to black around him. A full moon, serene yet in stark contrast to the chaos, casts its gentle glow down upon the devastated camp. A lone figure strides purposefully through the smoking ruins, kicking aside the smoldering debris in their path. With deliberate intent, the figure raises a wand towards the starless sky and casts a spell. A massive, ghostly green skull, with a snake slithering from its gaping mouth, appears and menacingly floats high above. The young man, with a sinister grin of satisfaction, reveals his sharp teeth. Harry slowly regains consciousness, struggling to sit up. Peering through the lingering smoke, he spots the shadowy figure approaching ominously. Quickly springing to his feet, he flees from the dark presence, which veers off in another direction. Noticing the ominous skull, Harry instinctively clutches at his scar in a mix of fear and pain. A group of Ministry wizards, their expressions tense and filled with wariness, gaze apprehensively up at the spectral skull, the dark mark ominously hovering over the chaotic scene. Meanwhile, Ron occupies himself, counting his money meticulously. Harry gives a nod of acknowledgment to a young Chinese girl, who responds with a shy yet gentle smile. He scratches his eyebrow thoughtfully, lost in contemplation. Hermione leans forward, her curiosity evidently piqued. Harry diligently addresses an envelope to his godfather, Sirius Black, and carefully places the letter into Hedwig's waiting beak. The snowy owl, with graceful ease, flies out of the train window, soaring serenely away over a tranquil and reflective lake as the Hogwarts Express continues its journey onward to its ultimate destination, the grand and mysterious Hogwarts."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "As Harry breaks into a smile, the sky transitions from day to the soft hues of evening, and the group merges with the excited crowds surging into the magnificent Quidditch stadium. Within the stadium, the spectators jostle to find their seats in the stands, most adorned in vibrant national costumes that reflect the evening's festive spirit. In the bustling crowd, a man halts Harry's movement with a quick tap of his walking stick before delivering a light smack, adding to the lively atmosphere. The spotlight beams sweep across the packed stands, highlighting the vibrant sea of fans. Hermione and the twins are distinguishable by their green and white scarves, their excitement evident as Mr. Diggory guides them to ascend the stairs leading to the stadium's highest level. Below, the seven Irish players burst forth in a tight formation, leaving trails of green and white smoke in their wake from their broomsticks as they streak across the field. The night sky briefly blazes with the colors of fireworks, which shape into a spirited leprechaun animatedly dancing a jig, captivating the audience. High above the pitch, the opposing team, clad in black and red, circle the field, with one daring player executing a breathtaking somersault. An enormous image of a handsome Bulgarian player is projected onto the towering stands; he hovers prominently in front of a billowing flag emblazoned with the name Krum, raising his fist in a gesture of confidence. Cornelius Fudge, employing his wand, amplifies his voice across the stadium, as a bright ball of light shoots forth from his wand, plunging towards the arena below. After the match, back in the tent, George and his friends revel in the euphoria of the Irish victory. Mr. Weasley, swiftly igniting a lamp, ushers them out into the chaotic scene unraveling outside. The camp is a picture of pandemonium, with tents consumed by fire, flames leaping ominously against the night sky. Amidst the chaos, Harry's attention is drawn to the dark, foreboding figures, ominous in their cloaked garb, with skeleton masks and tall pointed hats, brandishing flaming torches. He instinctively begins to run, breaking free from Hermione and the others, as he maneuvers through the frenzied crowd. In the ensuing confusion, he trips, and as he attempts to rise, a barrage of fleeing feet strikes him down again. The light from the burning tents flickers across his face, painting a haunting picture as he slips into unconsciousness on the muddy ground. Everything fades into darkness. Later, the full moon casts its cold light over the devastated camp. A solitary figure strides purposefully between the smoldering remains of the tents, methodically kicking at the charred debris. With a deliberate motion, the figure points a wand skyward and casts a spell, conjuring a vast, ghostly green skull with a snake slithering from its mouth, eerily suspended above his head. The young man, with a sinister smile etched across his face, basks in his wicked satisfaction. Meanwhile, Harry slowly regains consciousness and struggles to sit up, his immediate surroundings coming into hazy focus. As the shadowy figure approaches through the smoke, Harry forces himself to his feet and flees from the impending threat, causing the dark figure to retreat. Upon glimpsing the floating skull, Harry instinctively clutches at his scar, sensing the familiar searing pain. Nearby, a group of Ministry wizards stand transfixed, their gazes fixed nervously on the menacing visage of the ghostly skull, the dark mark ominously hovering above them. In a contrasting scene, Ron casually counts his money, while Harry shares a subtle nod with a young Chinese girl, who responds with a shy smile that briefly eases the tension. As the train moves forward, Harry absently scratches his eyebrow, while Hermione leans forward, her attention fully engaged. With a measured hand, Harry addresses an envelope to his godfather, Sirius Black, and seals the letter within. Gently placing the letter into Hedwig's beak, he watches the snowy owl take flight from the train window, soaring gracefully over a lake as the Hogwarts Express forges on towards its destination."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "As evening falls, Harry and his friends join the excited crowds in the magnificent Quidditch stadium, taking their seats among spectators dressed in colorful national costumes. Mr. Diggory leads them to the highest level of the stadium, where Hermione and the twins sport green and white scarves. Spotlight beams illuminate the packed stands as the seven Irish players zoom out in formation with green and white smoke trailing from their broomsticks. Fireworks explode, forming a leprechaun dancing a jig, while the opposing team, clad in black and red, flies above the pitch, with one player turning a somersault. A gigantic image of the handsome Bulgarian player Krum is projected onto the stands, where he hovers confidently.\n\nCornelius Fudge uses his wand to amplify his voice and send a bright ball of light toward the arena. Later, back in the tent, George and friends celebrate the Irish victory. Mr. Weasley lights a lamp and urgently guides them out into the chaos, where tents are ablaze, flames leaping into the night. Amidst the turmoil, Harry notices ominous cloaked figures with skeleton masks and tall pointed hats carrying flaming torches. Separated from Hermione and the others, Harry runs through the panicking crowd but trips and falls, losing consciousness as flying feet knock him aside.\n\nAs the full moon shines over the devastated camp, a lone figure strides through the smoking tents, casting a spell that projects a huge, ghostly green skull with a snake emerging from its mouth into the sky. This dark mark floats overhead as the figure smiles evilly. Harry regains consciousness, sees the shadowy figure approaching, and runs away, clutching his scar when he spots the skull. Ministry wizards gaze nervously at the dark mark above them. Ron counts his money, and Harry shares a nod and shy smile with a young Chinese girl. He then addresses an envelope to his godfather, Sirius Black, and entrusts it to Hedwig, who flies out of the train window, soaring over a lake as the Express heads toward Hogwarts."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Harry smiles. As evening falls, they join the excited crowds in the magnificent Quidditch stadium, a magical sports arena where teams compete in a game played on flying broomsticks. The spectators take their seats in the stands, many of them wearing colorful national costumes that showcase the rivalry between the Irish and Bulgarian teams. He stops Harry with his walking stick and then smacks at him, a sign of playful camaraderie among friends. Spotlight beams magically illuminate the packed stands. Hermione and the twins wear green and white scarves, supporting the Irish team's colors. Mr. Diggory takes them to the highest level of the stadium, offering a perfect view of the thrilling match. The seven Irish players zoom out in formation with green and white smoke streaming from their broomsticks, creating an impressive entrance. Fireworks explode in the shape of a spirited leprechaun, a symbol of Irish folklore, dancing a jig. The opposing team in black and red uniforms, representing Bulgaria, fly high above the pitch, and one turns a somersault to show off their agility. A gigantic image of the handsome Bulgarian player, Viktor Krum, a renowned Seeker, is projected onto the towering stands. He hovers in front of a waving flag proclaiming the name Krum. Krum raises his fist confidently, demonstrating his determination to lead his team to victory. Cornelius Fudge, the Minister for Magic, uses his wand to amplify his voice, and a bright ball of light springs from his wand and plunges down towards the arena, signaling the start of the match. Back in the tent, George and friends celebrate the Irish victory with cheers and laughter. Mr. Weasley lights a lamp and hurries them out of the tent, anxious to leave as chaos unfolds outside. The camp is in chaos, with many of the tents on fire, flames leaping high into the darkness, a scene reminiscent of past magical conflicts. Harry sees ominous cloaked figures with skeleton masks and tall pointed hats, known as Death Eaters, carrying flaming torches. He starts to run, and wrestled away from Hermione and the others, Harry dodges through the panicking crowd. In the confusion, Harry trips and falls. As he struggles to get up, flying feet knock him aside. Light from the burning tents flickers across his face as he lies unconscious on the muddy ground. Everything goes black. A full moon shines down on the devastated camp, illuminating the destruction. A lone figure strides between the smoking tents, kicking the smoldering remains. The figure points a wand into the dark sky and casts a spell. A huge, ghostly, green skull, known as the Dark Mark, appears with a snake emerging from its mouth, a terror-inducing symbol used by Lord Voldemort's followers. It floats above his head. The young man bears his teeth with an evil smile of satisfaction, pleased with the chaos he has caused. Harry slowly regains consciousness and sits up. He sees the shadowy figure approaching through the smoke. Harry gets to his feet and runs away from the dark figure, and the figure runs off, disappearing into the night. Seeing the skull, Harry clutches his scar, a painful reminder of his connection to Voldemort. A group of Ministry wizards gaze up nervously at the ghostly skull, a dark mark still hovering above their heads, fearing the dark magic it represents. Ron counts his money, saved up from working at the joke shop. Harry nods to a young Chinese girl, Cho Chang, a fellow student from Hogwarts, and she gives him a shy smile. Harry scratches his eyebrow, deep in thought. Hermione leans forward, eager to discuss the night's events. Harry addresses an envelope to his godfather, Sirius Black, a man unjustly imprisoned for years, and puts the letter into Hedwig's beak. The snowy owl flies out of the train window and soars away over a lake as the Express steams on towards Hogwarts, the ancient school of witchcraft and wizardry where Harry and his friends learn magic."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Fireworks explode in the shape of a spirited leprechaun dancing a jig Harry smiles As evening falls they join the excited crowds in the magnificent Quidditch stadium The spectators take their seats in the stands many of them wearing colorful national costumes He stops Harry with his walking stick and then smacks at him Harry scratches his eyebrow Spotlight beams illuminate the packed stands The young man bears his teeth with an evil smile of satisfaction Hermione and the twins wear green and white scarves Mr Diggory takes them to the highest level of the stadium The seven Irish players zoom out in formation with green and white smoke streaming from their broomsticks A group of Ministry wizards gaze up nervously at the ghostly skull Harry dodges through the panicking crowd Fireworks explode in the shape of a spirited leprechaun dancing a jig Hermione and the twins wear green and white scarves The opposing team in black and red fly high above the pitch and one turns a somersault Harry addresses an envelope to his godfather Sirius Black and puts the letter into Hedwig's beak A gigantic image of the handsome Bulgarian player is projected onto the towering stands He hovers in front of a waving flag proclaiming the name Krum Krum raises his fist confidently Cornelius Fudge uses his wand to amplify his voice and a bright ball of light springs from his wand and plunges down towards the arena As evening falls they join the excited crowds in the magnificent Quidditch stadium Harry slowly regains consciousness and sits up Back in the tent George and friends celebrate the Irish victory He starts to run and wrestled away from Hermione and the others Mr Weasley lights a lamp and hurries them out of the tent Back in the tent George and friends celebrate the Irish victory The camp is in chaos Harry smiles many of the tents are on fire with flames leaping high into the darkness Harry sees ominous cloaked figures with skeleton masks and tall pointed hats carrying flaming torches He starts to run and wrestled away from Hermione and the others Harry dodges through the panicking crowd In the confusion Harry trips and falls As he struggles to get up flying feet knock him aside The spectators take their seats in the stands many of them wearing colorful national costumes Light from the burning tents flickers across his face as he lies unconscious on the muddy ground Everything goes black A full moon shines down on the devastated camp The seven Irish players zoom out in formation with green and white smoke streaming from their broomsticks many of the tents are on fire with flames leaping high into the darkness A lone figure strides between the smoking tents kicking the smoldering remains The figure points a wand into the dark sky and casts a spell A huge ghostly green skull appears with a snake emerging from its mouth It floats above his head The young man bears his teeth with an evil smile of satisfaction Harry slowly regains consciousness and sits up He sees the shadowy figure approaching through the smoke Harry gets to his feet and runs away from the dark figure and the figure runs off A huge ghostly green skull appears with a snake emerging from its mouth Mr Weasley lights a lamp and hurries them out of the tent Hermione leans forward Seeing the skull Harry clutches his scar The camp is in chaos A group of Ministry wizards gaze up nervously at the ghostly skull The figure points a wand into the dark sky and casts a spell a dark mark still hovering above their heads Ron counts his money Harry nods to a young Chinese girl and she gives him a shy smile Harry scratches his eyebrow Hermione leans forward Mr Diggory takes them to the highest level of the stadium Harry addresses an envelope to his godfather Sirius Black and puts the letter into Hedwig's beak The snowy owl flies out of the train window and sows away over a lake as the Express steams on towards Hogwarts Seeing the skull Harry clutches his scar"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Harry smiles. As evening falls they join the excited crowds in the magnificent Quidditch stadium. The spectators take their seats in the stands many of them wearing colorful national costumes. He stops Harry with his walking stick and then smacks at him. Spotlight beams illuminate the packed stands. Hermione and the twins wear green and white scarves. Mr Diggory takes them to the highest level of the stadium. The seven Irish players zoom out in formation with green and white smoke streaming from their broomsticks. Fireworks explode in the shape of a spirited leprechaun dancing a jig. The opposing team in black and red fly high above the pitch and one turns a somersault. A gigantic image of the handsome Bulgarian player is projected onto the towering stands. He hovers in front of a waving flag proclaiming the name Krum. Krum raises his fist confidently. Cornelius Fudge uses his wand to amplify his voice and a bright ball of light springs from his wand and plunges down towards the arena. Back in the tent George and friends celebrate the Irish victory. Mr Weasley lights a lamp and hurries them out of the tent. The camp is in chaos. many of the tents are on fire with flames leaping high into the darkness. Harry sees ominous cloaked figures with skeleton masks and tall pointed hats carrying flaming torches. He starts to run and wrestled away from Hermione and the others. Harry dodges through the panicking crowd. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. In the confusion Harry trips and falls. As he struggles to get up flying feet knock him aside. Light from the burning tents flickers across his face as he lies unconscious on the muddy ground. Everything goes black. A full moon shines down on the devastated camp. A lone figure strides between the smoking tents kicking the smoldering remains. The figure points a wand into the dark sky and casts a spell. A huge ghostly green skull appears with a snake emerging from its mouth. It floats above his head. The young man bears his teeth with an evil smile of satisfaction. Harry slowly regains consciousness and sits up. He sees the shadowy figure approaching through the smoke. Harry gets to his feet and runs away from the dark figure and the figure runs off. Seeing the skull Harry clutches his scar. A group of Ministry wizards gaze up nervously at the ghostly skull. a dark mark still hovering above their heads. Ron counts his money. Harry nods to a young Chinese girl and she gives him a shy smile. Harry scratches his eyebrow. Hermione leans forward. Harry addresses an envelope to his godfather Sirius Black and puts the letter into Hedwig's beak. The snowy owl flies out of the train window and sows away over a lake as the Express steams on towards Hogwarts."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Harry smiles. As evening falls they join the excited crowds in the magnificent Quidditch stadium. The spectators take their seats in the stands many of them wearing colorful national costumes. He stops Harry with his walking stick and then smacks at him. Spotlight beams illuminate the packed stands. Hermione and the twins wear green and white scarves. Mr Diggory takes them to the highest level of the stadium. The seven Irish players zoom out in formation with green and white smoke streaming from their broomsticks. Fireworks explode in the shape of a spirited leprechaun dancing a jig. The opposing team in black and red fly high above the pitch and one turns a somersault. A gigantic image of the handsome Bulgarian player is projected onto the towering stands. He hovers in front of a waving flag proclaiming the name Krum. Krum raises his fist confidently. Cornelius Fudge uses his wand to amplify his voice and a bright ball of light springs from his wand and plunges down towards the arena. Back in the tent George and friends celebrate the Irish victory. Mr Weasley lights a lamp and hurries them out of the tent. The camp is in chaos. many of the tents are on fire with flames leaping high into the darkness. Harry sees ominous cloaked figures with skeleton masks and tall pointed hats carrying flaming torches. He starts to run and wrestled away from Hermione and the others. Harry dodges through the panicking crowd. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the confusion Harry trips and falls. As he struggles to get up flying feet knock him aside. Light from the burning tents flickers across his face as he lies unconscious on the muddy ground. Everything goes black. A full moon shines down on the devastated camp. A lone figure strides between the smoking tents kicking the smoldering remains. The figure points a wand into the dark sky and casts a spell. A huge ghostly green skull appears with a snake emerging from its mouth. It floats above his head. The young man bears his teeth with an evil smile of satisfaction. Harry slowly regains consciousness and sits up. He sees the shadowy figure approaching through the smoke. Harry gets to his feet and runs away from the dark figure and the figure runs off. Seeing the skull Harry clutches his scar. A group of Ministry wizards gaze up nervously at the ghostly skull. a dark mark still hovering above their heads. Ron counts his money. Harry nods to a young Chinese girl and she gives him a shy smile. Harry scratches his eyebrow. Hermione leans forward. Harry addresses an envelope to his godfather Sirius Black and puts the letter into Hedwig's beak. The snowy owl flies out of the train window and sows away over a lake as the Express steams on towards Hogwarts."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Harry smiles. As evening falls they join the excited crowds in the magnificent Quidditch stadium. The spectators take their seats in the stands many of them wearing colorful national costumes. He stops Harry with his walking stick and then smacks at him. Spotlight beams illuminate the packed stands. Hermione and the twins wear green and white scarves. Mr Diggory takes them to the highest level of the stadium. The seven Irish players zoom out in formation with green and white smoke streaming from their broomsticks. Fireworks explode in the shape of a spirited leprechaun dancing a jig. The opposing team in black and red fly high above the pitch and one turns a somersault. A gigantic image of the handsome Bulgarian player is projected onto the towering stands. He sees the shadowy figure approaching through the smoke. Harry gets to his feet and runs away from the dark figure and the figure runs off. Seeing the skull Harry clutches his scar. A group of Ministry wizards gaze up nervously at the ghostly skull. a dark mark still hovering above their heads. Ron counts his money. Harry nods to a young Chinese girl and she gives him a shy smile. Harry scratches his eyebrow. Hermione leans forward. Harry addresses an envelope to his godfather Sirius Black and puts the letter into Hedwig's beak. The snowy owl flies out of the train window and sows away over a lake as the Express steams on towards Hogwarts."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Harry smiles. As evening falls they join the excited crowds in the magnificent Quidditch stadium. The spectators take their seats in the stands many of them wearing colorful national costumes. He stops Harry with his walking stick and then smacks at him. Harry nods to a young Chinese girl and she gives him a shy smile. Harry scratches his eyebrow. Hermione leans forward. Harry addresses an envelope to his godfather Sirius Black and puts the letter into Hedwig's beak. The snowy owl flies out of the train window and sows away over a lake as the Express steams on towards Hogwarts."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Luna smiles. As evening falls, they join the excited crowds in the magnificent Quidditch stadium. The house-elves take their seats in the stands, many of them wearing colorful national costumes. She stops Luna with her walking stick and then smacks at her. Spotlight beams illuminate the packed stands. Neville and the goblins wear green and white scarves. Professor McGonagall takes them to the highest level of the stadium. The seven Norwegian players zoom out in formation with green and white smoke streaming from their broomsticks. Fireworks explode in the shape of a spirited leprechaun dancing a jig. The opposing team in black and red fly high above the pitch, and one turns a somersault. A gigantic image of the handsome Swedish player is projected onto the towering stands. He hovers in front of a waving flag proclaiming the name Krum. Krum raises his fist confidently. Madam Pomfrey uses her wand to amplify her voice, and a bright ball of light springs from her wand and plunges down towards the arena. Back in the tent, Hagrid and friends celebrate the Irish victory. Professor Flitwick lights a lamp and hurries them out of the tent. The camp is in chaos, many of the tents are on fire, with flames leaping high into the darkness. Luna sees ominous cloaked figures with skeleton masks and tall pointed hats, carrying flaming torches. She starts to run, and wrestled away from Neville and the others, Luna dodges through the panicking crowd. In the confusion, Luna trips and falls. As she struggles to get up, flying feet knock her aside. Light from the burning tents flickers across her face as she lies unconscious on the muddy ground. Everything goes black. A full moon shines down on the devastated camp. A lone thestral strides between the smoking tents, kicking the smoldering remains. The thestral points a wand into the dark sky and casts a spell. A huge, ghostly, green skull appears with a snake emerging from its mouth. It floats above her head. The young centaur bears his teeth with an evil smile of satisfaction. Luna slowly regains consciousness and sits up. She sees the shadowy figure approaching through the smoke. Luna gets to her feet and runs away from the dark figure, and the figure runs off. Seeing the skull, Luna clutches her scar. A group of Ministry wizards gaze up nervously at the ghostly skull, a dark mark still hovering above their heads. Dobby counts his money. Luna nods to a young Chinese girl, and she gives her a shy smile. Luna scratches her eyebrow. Neville leans forward. Luna addresses an envelope to her godfather, Sirius Black, and puts the letter into Hedwig's beak. The snowy owl flies out of the train window and sails away over a lake as the Express steams on towards Hogwarts."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Harry smiles. As evening falls, they join the excited crowds in the grand opera house. The spectators take their seats in the pews, many of them wearing colorful ballroom gowns. He stops Harry with his umbrella and then taps at him. Lantern beams illuminate the packed pews. Hermione and the twins wear orange and purple ties. Mr. Diggory takes them to the highest tier of the opera house. The seven Irish dancers leap out in formation with orange and purple confetti streaming from their jackets. Sparklers burst in the shape of a spirited unicorn performing a pirouette. The opposing dancers in gold and blue leap high above the stage, and one turns a cartwheel. A gigantic image of the famous Bulgarian violinist is projected onto the towering walls. He hovers in front of a waving banner proclaiming the name Krum. Krum raises his bow confidently. Cornelius Fudge uses his microphone to amplify his voice, and a bright swirl of ribbons springs from his microphone and twirls down towards the stage. Back in the cabin, George and friends celebrate the Irish victory. Mr. Weasley lights a lantern and hurries them out of the cabin. The forest is in chaos, many of the trees are on fire, with flames leaping high into the darkness. Harry sees ominous cloaked figures with clown masks and tall pointed hats, carrying sparking flares. He starts to run, and wrestled away from Hermione and the others, Harry dodges through the panicking crowd. In the confusion, Harry trips and falls. As he struggles to get up, running feet knock him aside. Shadows from the burning trees flicker across his face as he lies unconscious on the gravelly path. Everything goes black. A full moon shines down on the devastated forest. A lone figure strides between the smoldering trees, kicking the glowing cinders. The figure points a brush into the dark sky and paints a spell. A huge, ghostly, green dragon appears with a ribbon emerging from its mouth. It floats above his head. The young man bears his teeth with an evil smile of satisfaction. Harry slowly regains consciousness and sits up. He sees the shadowy figure approaching through the smoke. Harry gets to his feet and runs away from the dark figure, and the figure runs off. Seeing the dragon, Harry clutches his scar. A group of Ministry musicians gaze up nervously at the ghostly dragon, a dark mark still hovering above their heads. Ron counts his coins. Harry nods to a young Russian girl, and she gives him a shy smile. Harry scratches his cheek. Hermione leans forward. Harry addresses an envelope to his godfather, Sirius Black, and puts the letter into Hedwig's talons. The snowy owl flies out of the train window and glides away over a meadow as the Express rolls on towards Hogwarts."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Harry frowns. As evening descends, they skip with the animated crowds in the magnificent Quidditch stadium. The spectators leap into their seats in the stands, many of them wearing colorful national costumes. He taps Harry with his walking stick and then nudges at him. Spotlight beams glide across the packed stands. Hermione and the twins flash green and white scarves. Mr. Diggory drags them to the highest level of the stadium. The seven Irish players float out in formation with green and white smoke swirling from their broomsticks. Fireworks burst in the shape of a spirited leprechaun skipping a jig. The opposing team in black and red dive low above the pitch, and one flips a cartwheel. A gigantic image of the handsome Bulgarian player is projected onto the towering stands. He spins in front of a waving flag proclaiming the name Krum. Krum waves his fist confidently. Cornelius Fudge waves his wand to amplify his voice, and a bright ball of light hops out of his wand and drifts down towards the arena. Back in the tent, George and friends toast the Irish victory. Mr. Weasley extinguishes a lamp and rushes them out of the tent. The camp is in chaos, many of the tents are ablaze, with flames dancing high into the darkness. Harry spots ominous cloaked figures with skeleton masks and tall pointed hats, flinging flaming torches. He starts to skip, and slipped away from Hermione and the others, Harry weaves through the panicking crowd. In the confusion, Harry stumbles and trips. As he squirms to get up, flying feet push him aside. Light from the burning tents flickers across his face as he lies unconscious on the muddy ground. Everything goes black. A full moon gazes down on the devastated camp. A lone figure paces between the smoking tents, nudging the smoldering remains. The figure aims a wand into the dark sky and mutters a spell. A huge, ghostly, green skull appears with a snake gliding from its mouth. It hovers above his head. The young man grins with an evil smile of satisfaction. Harry gradually regains consciousness and stands up. He spots the shadowy figure approaching through the smoke. Harry leaps to his feet and dashes away from the dark figure, and the figure saunters off. Seeing the skull, Harry rubs his scar. A group of Ministry wizards crane their necks nervously at the ghostly skull, a dark mark lingering above their heads. Ron totals his money. Harry waves to a young Chinese girl, and she gives him a shy grin. Harry rubs his chin. Hermione hunches forward. Harry scrawls an address on an envelope to his godfather, Sirius Black, and places the letter into Hedwig's beak. The snowy owl flutters out of the train window and glides away over a lake as the Express puffs on towards Hogwarts."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Tom nods. As morning rises, they gather with the curious visitors in the grand circus tent. The onlookers settle in their chairs, many of them sporting vivid regional uniforms. She stops Tom with her umbrella and then taps at him. Flashlight beams highlight the crowded chairs. Lucy and the neighbors wear red and blue hats. Mr. Thompson leads them to the lowest area of the tent. The five Scottish dancers spring out in formation with red and blue confetti trailing from their sneakers. Sparklers burst in the shape of an energetic fairy skipping a hop. The rival group in white and yellow leap low beneath the stage, and one flips a cartwheel. A massive image of the charming French singer is displayed onto the massive screens. She floats in front of a flapping banner declaring the name Jess. Jess waves her hand proudly. Mayor Johnson uses his cane to raise his voice, and a bright spark of flame leaps from his cane and dives down toward the stage. Back in the cottage, Peter and companions rejoice in the Scottish triumph. Mr. Brown lights a torch and rushes them out of the cottage. The settlement is in turmoil, many of the cottages are ablaze, with smoke billowing high into the night. Tom sees menacing cloaked entities with pumpkin masks and tiny round helmets, carrying fiery staves. He begins to stroll, and pulled away from Lucy and the group, Tom weaves through the fleeing visitors. In the turmoil, Tom stumbles and collapses. As he scrambles to rise, rushing hands push him backward. Glow from the blazing cottages shimmers across his cheeks as he lies out cold on the grassy field. Darkness engulfs. A new sun beams down on the ruined village. A lone shadow wanders among the charred cottages, kicking the glowing embers. The shadow raises a cane into the bright air and chants a curse. A giant, ethereal, red sun appears with a rat slithering from its center. It hovers atop her head. The young lady grins with a wicked expression of accomplishment. Tom gradually regains awareness and lifts himself. He glimpses the misty shadow nearing through the haze. Tom pulls himself up and walks away from the hazy shadow, and the shadow slips away. Noticing the sun, Tom clutches his ear. A band of local officers peer up anxiously at the ethereal sun, a dim sign still suspended above their shoulders. Sam counts his marbles. Tom agrees with a young Russian boy, and he returns a coy grin. Tom rubs his chin. Lucy leans backward. Tom writes a postcard to his uncle, Remus Lupin, and places the postcard into Apollo's beak. The caramel owl soars out of the train exit and drifts away over a pond as the Railway chugs on towards Durmstrang."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Tom grins. As sunrise breaks, they follow the curious animals in the ancient Roman theater. The actors claim their positions in the circus, many of them donning extravagant ceremonial robes. He halts Tom with his umbrella and then taps at him. Laser lights illuminate the crowded circus. Luna and the triplets sport yellow and purple socks. Mrs. Longbottom guides them to the uppermost tier of the theater. The seven Japanese drummers hop out in sequence with red and gold ribbons trailing from their drums. Lanterns burst in the shape of a lively dragon twirling a reel. The rival band in blue and orange dive low under the stage, and one spins a cartwheel. A massive depiction of the charming Canadian singer is projected onto the massive circus facade. He lounges in front of a fluttering banner declaring the name Krum. Krum pumps his elbow triumphantly. Dolores Umbridge wields her wand to shrink her voice, and a dark sphere of shadow leaps from her wand and ascends up towards the balcony. Inside the cabin, Fred and peers toast the Japanese triumph. Mr. Malfoy extinguishes a candle and lingers them inside the cabin. The arena is in order, many of the shelters are on water, with waves submerging low into the brightness. Tom notices friendly garbed elves with flower masks and short wide hats, carrying glowing lanterns. He stays to rest, and blown toward Luna and the crew, Tom tiptoes past the cheering herd. In the order, Tom leaps and rises. As he waits to sit down, crawling arms lift him away. Shadows from the glowing shelters dim across his expression as he sits conscious on the grassy field. Everything turns bright. A crescent sun dims up above the restored arena. A lone woman lounges underneath the swaying shelters, gathering the cooling embers. The woman whispers a song into the dim earth and sings a tune. A small, faded, red heart emerges with wings departing from its side. It spins below her feet. The old lady chuckles her lips with a kind grin of pride. Tom quickly loses awareness and lies down. He watches the brilliant woman departing from the light. Tom lies on the ground and listens near the bright woman, while the woman stays near. Spotting the heart, Tom rubs his chin. A group of amateur muggles glance down calmly at the faded heart, a light mark still flickering below their feet. Ginny adds her jewels. Tom blinks at a young Indian boy, and he sends her a broad laugh. Tom strokes his finger. Ron leans back. Tom misunderstands a postcard from his uncle, Remus Lupin, and places the postcard into Errol's paw. The bronze cat sleeps out of the car door and digs away under an ocean while the Broom flies back away from Ilvermorny."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Harry grins. As dusk spreads, they mingle with the enthusiastic herds in the grand hippodrome. The attendees settle into their perches, many of them donning vibrant regional disguises. He halts Harry with his umbrella and then nudges at him. Neon lights flash across the jam-packed balconies. Hermione and the twins sport orange and purple capes. Mr. Diggory leads them to the pinnacle tier of the coliseum. The seven Irish performers glide out in sync with orange and purple mist trailing from their balloons. Sparklers burst into the form of a lively goblin spinning a reel. The rival team in gray and yellow dive low over the lawn, and one takes a cartwheel. A colossal depiction of the dashing Romanian athlete is displayed onto the towering bleachers. He hovers before a fluttering banner declaring the name Krum. Krum pumps his arm proudly. Cornelius Fudge uses his megaphone to magnify his voice, and a bright plume of confetti shoots from his wand and cascades down towards the field. Back in the yurt, George and comrades rejoice the Irish triumph. Mr. Weasley ignites a lantern and rushes them out of the yurt. The campground is in disarray, many of the tents are ablaze, with sparks dancing high into the gloom. Harry spies ominous cloaked entities with ghost masks and long flat caps, wielding blazing sticks. He starts to sprint, and tugged away from Hermione and the others, Harry weaves through the fleeing throng. In the chaos, Harry stumbles and collapses. As he strains to rise, flailing arms shove him aside. Glow from the blazing tents flickers across his face as he lies unconscious on the soggy turf. Everything fades away. A bright star glows down on the ravaged site. A solitary figure strides between the smoking pavilions, kicking the charred debris. The figure directs a megaphone into the dim sky and conjures an incantation. A huge, ghostly, emerald serpent appears with a bat emerging from its mouth. It hovers above his head. The young man flashes his teeth with a wicked grin of delight. Harry slowly regains awareness and rises up. He spots the hazy figure closing in through the fumes. Harry gets to his feet and bolts away from the shadowy figure, and the figure dashes off. Seeing the serpent, Harry grasps his forehead. A cluster of Ministry enchanters stare up anxiously at the spectral serpent, a dark emblem still looming above their heads. Ron tallies his coins. Harry acknowledges a young Korean girl, and she returns a timid grin. Harry rubs his chin. Hermione leans closer. Harry inscribes an envelope to his godfather, Sirius Black, and places the note into Hedwig's beak. The snowy owl glides out of the tram window and flutters away over a pond as the Express chugs on towards Hogwarts."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Jerry giggles. As morning rises, they join the sleepy tourists in the tiny bowling alley. The bowlers toss their hats in the lanes, many of them wearing sparkling alien outfits. She nudges Jerry with her umbrella and then waves at him. Laser flashes dimly illuminate the empty lanes. Louise and the cousins wear purple and orange hats. Mr. Digby leads them to the lowest level of the alley. The nine Canadian skiers swim out in circles with red and blue water flowing from their canoes. Confetti bursts in the form of a tired penguin doing a waltz. The opposing group in purple and yellow gallop low beneath the ice, and one spins a cartwheel. A miniature photo of the grumpy Australian dancer is displayed onto the compact lanes. He floats below a drooping banner boasting the name Jack. Jack lifts his foot awkwardly. Augustus Snap uses his cane to mute his song, and a tiny bubble of mist bounces from his cane and drifts up towards the ceiling. Back in the cabin, Jerry and family mourn the Canadian defeat. Mr. Wicker snuffs a candle and urges them into the cabin. The lodge is in order, many of the cabins are closed, with silence echoing low into the brightness. Jerry hears cheerful dressed people with flower crowns and short round shades, swinging golden bells. He pauses to dance, and huddled close to Louise and the rest, Jerry strolls through the tranquil camp. In the calm, Jerry sits and rests. As he lounges in silence, gentle hands lift him up. Shadows from the closed cabins slide across his face as he meditates peacefully on the sandy ground. Everything goes bright. A new sun beams up on the calm lodge. An old traveler wanders across the empty cabins, gathering the scattered leaves. The traveler waves a brush towards the bright sky and utters a whisper. A tiny, multicolored, spotted rabbit emerges with a bird pecking from its eyes. It glides near his hat. The old woman flashes her glasses with a good grin of contentment. Jerry swiftly loses awareness and lies down. He hears the fuzzy traveler departing through the silence. Jerry rests his head and sits still beneath the bright traveler, and the traveler strolls on. Spotting the rabbit, Jerry scratches his elbow. A group of circus clowns glance down eagerly at the multicolored rabbit, an odd mark still glowing beneath their feet. Ben hides his shoes. Jerry waves to an old Indian man, and he returns an awkward frown. Jerry pats his shoulder. Louise stands back. Jerry whispers a postcard to his neighbor, Mario White, and slips the note into Snowball's paw. The gray rabbit hops out of the van door and floats quietly over a pond as the Car travels back towards the farm."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Harry, Hermione, and the twins join the excited crowds at the Quidditch stadium, wearing green and white scarves. They watch the Irish players dazzle with fireworks, while the opposing Bulgarian team showcases Krum, a star player. Cornelius Fudge uses magic to announce the game. After celebrating Ireland's victory, chaos erupts back at camp as cloaked figures with flaming torches set tents on fire. Amidst the panic, Harry is separated from Hermione, trips, and falls unconscious. Upon waking, he witnesses a dark figure casting a spell that conjures a ghostly, green skull in the sky—a dark mark. Harry, troubled by the sight, clutches his scar. Ministry wizards nervously observe the mark. Later, Harry sends a letter to his godfather, Sirius Black, via Hedwig the owl as the train heads to Hogwarts."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "The snowy owl flies out of the train window and sows away over a lake as the Express steams on towards Hogwarts Harry addresses an envelope to his godfather Sirius Black and puts the letter into Hedwig's beak Hermione leans forward Harry scratches his eyebrow Harry nods to a young Chinese girl and she gives him a shy smile Ron counts his money a dark mark still hovering above their heads A group of Ministry wizards gaze up nervously at the ghostly skull Seeing the skull Harry clutches his scar Harry gets to his feet and runs away from the dark figure and the figure runs off He sees the shadowy figure approaching through the smoke Harry slowly regains consciousness and sits up The young man bears his teeth with an evil smile of satisfaction It floats above his head A huge ghostly green skull appears with a snake emerging from its mouth The figure points a wand into the dark sky and casts a spell A lone figure strides between the smoking tents kicking the smoldering remains A full moon shines down on the devastated camp Everything goes black Light from the burning tents flickers across his face as he lies unconscious on the muddy ground As he struggles to get up flying feet knock him aside In the confusion Harry trips and falls Harry dodges through the panicking crowd He starts to run and wrestled away from Hermione and the others Harry sees ominous cloaked figures with skeleton masks and tall pointed hats carrying flaming torches many of the tents are on fire with flames leaping high into the darkness The camp is in chaos Mr Weasley lights a lamp and hurries them out of the tent Back in the tent George and friends celebrate the Irish victory Cornelius Fudge uses his wand to amplify his voice and a bright ball of light springs from his wand and plunges down towards the arena Krum raises his fist confidently He hovers in front of a waving flag proclaiming the name Krum A gigantic image of the handsome Bulgarian player is projected onto the towering stands The opposing team in black and red fly high above the pitch and one turns a somersault Fireworks explode in the shape of a spirited leprechaun dancing a jig The seven Irish players zoom out in formation with green and white smoke streaming from their broomsticks Mr Diggory takes them to the highest level of the stadium Hermione and the twins wear green and white scarves Spotlight beams illuminate the packed stands He stops Harry with his walking stick and then smacks at him The spectators take their seats in the stands many of them wearing colorful national costumes As evening falls they join the excited crowds in the magnificent Quidditch stadium Harry smiles"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "The opposing team in black and red fly high above the pitch and one turns a somersault He stops Harry with his walking stick and then smacks at him A gigantic image of the handsome Bulgarian player is projected onto the towering stands A lone figure strides between the smoking tents kicking the smoldering remains Harry nods to a young Chinese girl and she gives him a shy smile Harry sees ominous cloaked figures with skeleton masks and tall pointed hats carrying flaming torches The snowy owl flies out of the train window and sows away over a lake as the Express steams on towards Hogwarts A full moon shines down on the devastated camp Spotlight beams illuminate the packed stands Harry gets to his feet and runs away from the dark figure and the figure runs off As he struggles to get up flying feet knock him aside He hovers in front of a waving flag proclaiming the name Krum It floats above his head In the confusion Harry trips and falls Krum raises his fist confidently Everything goes black a dark mark still hovering above their heads Ron counts his money He sees the shadowy figure approaching through the smoke Cornelius Fudge uses his wand to amplify his voice and a bright ball of light springs from his wand and plunges down towards the arena Light from the burning tents flickers across his face as he lies unconscious on the muddy ground Harry dodges through the panicking crowd A huge ghostly green skull appears with a snake emerging from its mouth Harry scratches his eyebrow The young man bears his teeth with an evil smile of satisfaction He starts to run and wrestled away from Hermione and the others The camp is in chaos Harry addresses an envelope to his godfather Sirius Black and puts the letter into Hedwig's beak A group of Ministry wizards gaze up nervously at the ghostly skull Harry slowly regains consciousness and sits up Harry smiles The spectators take their seats in the stands many of them wearing colorful national costumes The figure points a wand into the dark sky and casts a spell Hermione and the twins wear green and white scarves Seeing the skull Harry clutches his scar Mr Diggory takes them to the highest level of the stadium Fireworks explode in the shape of a spirited leprechaun dancing a jig Back in the tent George and friends celebrate the Irish victory Mr Weasley lights a lamp and hurries them out of the tent many of the tents are on fire with flames leaping high into the darkness As evening falls they join the excited crowds in the magnificent Quidditch stadium The seven Irish players zoom out in formation with green and white smoke streaming from their broomsticks Hermione leans forward"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "As he struggles to get up flying feet knock him aside Light from the burning tents flickers across his face as he lies unconscious on the muddy ground Everything goes black A full moon shines down on the devastated camp A lone figure strides between the smoking tents kicking the smoldering remains The figure points a wand into the dark sky and casts a spell A huge ghostly green skull appears with a snake emerging from its mouth It floats above his head The young man bears his teeth with an evil smile of satisfaction Harry slowly regains consciousness and sits up He sees the shadowy figure approaching through the smoke Harry gets to his feet and runs away from the dark figure and the figure runs off Seeing the skull Harry clutches his scar A group of Ministry wizards gaze up nervously at the ghostly skull a dark mark still hovering above their heads Ron counts his money Harry nods to a young Chinese girl and she gives him a shy smile Harry scratches his eyebrow Hermione leans forward Harry addresses an envelope to his godfather Sirius Black and puts the letter into Hedwig's beak The snowy owl flies out of the train window and sows away over a lake as the Express steams on towards Hogwarts Harry smiles As evening falls they join the excited crowds in the magnificent Quidditch stadium The spectators take their seats in the stands many of them wearing colorful national costumes He stops Harry with his walking stick and then smacks at him Spotlight beams illuminate the packed stands Hermione and the twins wear green and white scarves Mr Diggory takes them to the highest level of the stadium The seven Irish players zoom out in formation with green and white smoke streaming from their broomsticks Fireworks explode in the shape of a spirited leprechaun dancing a jig The opposing team in black and red fly high above the pitch and one turns a somersault A gigantic image of the handsome Bulgarian player is projected onto the towering stands He hovers in front of a waving flag proclaiming the name Krum Krum raises his fist confidently Cornelius Fudge uses his wand to amplify his voice and a bright ball of light springs from his wand and plunges down towards the arena Back in the tent George and friends celebrate the Irish victory Mr Weasley lights a lamp and hurries them out of the tent The camp is in chaos many of the tents are on fire with flames leaping high into the darkness Harry sees ominous cloaked figures with skeleton masks and tall pointed hats carrying flaming torches He starts to run and wrestled away from Hermione and the others Harry dodges through the panicking crowd In the confusion Harry trips and falls"
        }
      ]
    }
  ]
}