{
  "ground_truth": "Snow falls onto the tars and turrets of the school as Hagrid, wearing a huge fur coat, plods across the snow-covered courtyard, dragging behind him an enormous Christmas tree. Inside the school, Hermione pulls a trunk on wheels past a group of ghostly carol singers and enters the great hall, where tiny Professor Flitwick waves his wand and levitates decorations onto a tall Christmas tree. Hermione finds Ron and Harry playing chess at one of the long polished tables and walks down the brightly decorated hall to join them. The white knight moves by itself, and as Ron contemplates the board, the red queen moves and knocks the knight's head off. Meanwhile, Harry's snowy owl turns its head as Harry leaps out of bed and puts on his spectacles. Down in the Gryffindor common room, Ron stands in front of a blazing fire while Harry runs barefoot down the stone stairs towards a pile of presents on the Christmas tree. Harry picks up a parcel, and Ron dips into a box of every flavor beans. Harry opens a letter, puts it down, and unties the string on the parcel, unfolding the silver wrapping paper to reveal some soft material with a rich dark pattern, which he swings onto his shoulders, and his head begins to float. In the library, a floating hand carries a lantern between the bookshelves as Harry, under the invisibility cloak, peers about him wearily. Inside, he searches along more dark bookshelves, takes off the cloak, and holds the lantern closer to a shelf, then puts the light down. As he takes down a book and opens it, a screaming face bursts violently out of the pages, prompting Harry to slam the book shut. Grabbing his cloak, he knocks over the lamp, quickly puts on the invisibility cloak over his head, and disappears as Filch, the caretaker, holds up a lantern, the lamplight showing up his thin lips. Hidden by the invisibility cloak, Harry feels his way across the dark room, stopping for a moment as Filch passes by with his lantern, and breathes a sigh of relief as the caretaker goes out through a far doorway. Harry creeps into a moonlit corridor, where Filch's red-eyed cat is lurking, while still invisible. As the cat runs past, two professors, Snape and Quirrell, burst through a door, and suddenly suspicious, Snape turns around. Harry covers his mouth to muffle his breathing as Snape makes a grab but only snatches a handful of air. Harry takes a step backward as Snape turns sharply back to Quirrell, and then Quirrell, Snape, and Filch rush away down the corridor. A door in the far wall seems to open and close by itself.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Snow descends upon the roofs and spires of the academy as Hagrid, adorned in a gigantic fur garment, trudges across the snow-laden courtyard, pulling behind him a colossal Christmas tree. Within the academy, Hermione hauls a case on casters past a cluster of spectral carol singers and enters the grand hall, where diminutive Professor Flitwick waves his wand and levitates ornaments upon a lofty Christmas tree. Hermione discovers Ron and Harry playing chess at one of the lengthy polished tables and strides down the vividly adorned hall to join them. The alabaster knight shifts by itself, and as Ron ponders the board, the crimson queen advances and smites the knight's head off. Meanwhile, Harry's snowy owl swivels its head as Harry bounds out of bed and dons his spectacles. Down in the Gryffindor common room, Ron stands before a blazing blaze while Harry sprints barefoot down the stone steps towards a heap of gifts on the Christmas tree. Harry lifts a package, and Ron dips into a container of every flavor beans. Harry opens a note, sets it down, and unties the cord on the package, unfolding the argent wrapping paper to disclose some soft fabric with a rich dark design, which he swings onto his shoulders, and his head commences to float. In the library, a hovering hand carries a lantern between the bookshelves as Harry, under the invisibility cloak, peers about him wearily. Inside, he searches along further shadowy bookshelves, takes off the cloak, and holds the lantern nearer to a shelf, then places the light down. As he retrieves a tome and opens it, a shrieking visage bursts violently out of the pages, prompting Harry to slam the tome shut. Seizing his cloak, he knocks over the lamp, swiftly dons the invisibility cloak over his head, and vanishes as Filch, the caretaker, holds up a lantern, the lamplight revealing his thin lips. Concealed by the invisibility cloak, Harry navigates his way across the dim room, pausing momentarily as Filch passes by with his lantern, and breathes a sigh of relief as the caretaker exits through a distant doorway. Harry sneaks into a moonlit corridor, where Filch's red-eyed feline is skulking, while still invisible. As the feline dashes past, two professors, Snape and Quirrell, erupt through a door, and suddenly suspicious, Snape rotates around. Harry covers his mouth to muffle his breathing as Snape attempts a grab but only seizes a handful of air. Harry takes a step backward as Snape turns sharply back to Quirrell, and then Quirrell, Snape, and Filch rush away down the corridor. A door in the distant wall seems to open and close by itself."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Onto the towers and turrets of the school, snow is fallen as a huge fur coat is worn by Hagrid, who plods across the snow-covered courtyard, and an enormous Christmas tree is dragged behind him. Inside the school, a trunk on wheels is pulled by Hermione past a group of ghostly carol singers, and she enters the great hall, where his wand is waved by tiny Professor Flitwick, and decorations are levitated onto a tall Christmas tree. Ron and Harry, playing chess at one of the long polished tables, are found by Hermione, and down the brightly decorated hall, she walks to join them. The white knight is moved by itself, and as the board is contemplated by Ron, the red queen moves and the knight's head is knocked off. Meanwhile, the head of Harry's snowy owl is turned as spectacles are put on by Harry, who leaps out of bed. Down in the Gryffindor common room, a blazing fire is stood in front of by Ron while barefoot Harry is run down the stone stairs towards a pile of presents on the Christmas tree. A parcel is picked up by Harry, and a box of every flavor beans is dipped into by Ron. A letter is opened by Harry, put down, and the string on the parcel is untied, the silver wrapping paper is unfolded to reveal some soft material with a rich dark pattern, swung onto his shoulders by him, and his head begins to float. In the library, a lantern is carried by a floating hand between the bookshelves as under the invisibility cloak, Harry peers about him wearily. Inside, more dark bookshelves are searched along by him, the cloak is taken off, the lantern is held closer to a shelf, then the light is put down. As a book is taken down and opened by him, a screaming face bursts violently out of the pages, which prompts Harry to shut the book. His cloak is grabbed by him, the lamp is knocked over, and quickly, the invisibility cloak is put on over his head, and Harry disappears as a lantern is held up by Filch, the caretaker, the lamplight showing up his thin lips. Under the invisibility cloak, the dark room is felt across by Harry, stopping for a moment as the lantern is passed by Filch, and relief is breathed by him as the caretaker exits through a far doorway. A step backward is taken by Harry as, in the moonlit corridor, he creeps while Filch's red-eyed cat lurks, still invisible. As the cat runs past, a door is burst through by two professors, Snape and Quirrell, and suddenly suspicious, Snape turns around. His mouth is covered by Harry to muffle his breathing as a grab is made by Snape but only a handful of air is snatched. Snape is turned sharply back to Quirrell, and then Quirrell, Snape, and Filch rush away down the corridor. A door in the far wall opens and closes by itself."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Snow blankets the school's tars and turrets as Hagrid, in a massive fur coat, trudges across the snowy courtyard, dragging a giant Christmas tree. Inside, Hermione wheels a trunk past ghostly carolers into the great hall, where Professor Flitwick uses his wand to levitate decorations onto a tall Christmas tree. Hermione joins Ron and Harry playing chess at a long table. As Ron strategizes, the red queen moves, beheading the white knight. Meanwhile, Harry's owl turns its head as Harry jumps out of bed and dons his glasses. In the Gryffindor common room, Ron stands by a roaring fire while Harry rushes barefoot down stone stairs toward a pile of presents beneath the tree. Harry picks up a parcel, and Ron enjoys every flavor beans. Unwrapping the parcel, Harry finds a soft, richly patterned material, which makes his head float when worn. In the library, a floating hand with a lantern moves between shelves as Harry, invisible under the cloak, searches bookshelves. He removes the cloak, opens a book, and a screaming face erupts from it. Harry slams the book shut, grabs his cloak, knocks over a lamp, and vanishes under the invisibility cloak as Filch, the caretaker, approaches with a lantern. Hidden, Harry carefully navigates the dark room, pausing as Filch passes by, then creeps into a moonlit corridor. Filch's red-eyed cat lurks while Harry remains invisible. As the cat scurries away, Snape and Quirrell enter, and a suspicious Snape turns around. Harry mutes his breathing as Snape reaches but grabs only air. Harry retreats as Snape refocuses on Quirrell, then Snape, Quirrell, and Filch hurry down the corridor. A door in the far wall appears to open and close on its own."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Snow covers the school's tars and turrets as Hagrid, in a big fur coat, drags a large Christmas tree across the snowy courtyard. Inside, Hermione pulls a trunk past ghostly carolers into the hall, where Professor Flitwick decorates a Christmas tree. She joins Ron and Harry playing chess, where the red queen knocks the white knight's head off. Harry's owl turns as Harry jumps out of bed and dons his glasses. In the Gryffindor common room, Ron stands by the fire as Harry runs to presents under the tree, opening a parcel to reveal a cloak that makes his head float. In the library, Harry, under the invisibility cloak, takes a book, and a screaming face bursts out. He shuts the book, donning the cloak again as Filch approaches with a lantern. Hidden, Harry crosses the dark room, sighing as Filch exits. In a moonlit corridor, Filch's red-eyed cat appears as Snape and Quirrell burst out. Suspicious, Snape grabs at air as Harry silently retreats. Snape, Quirrell, and Filch rush away, and a door opens and closes by itself."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Snow gently drifts down from the sky, blanketing the towering tars and stately turrets of the well-known school. As the snowflakes settle, Hagrid, clad in an impressively large fur coat that shields him from the cold, steadily trudges across the snow-laden courtyard. He is dragging behind him, with some effort, an enormous and festive Christmas tree. Meanwhile, inside the school building, Hermione is seen pulling a trunk set atop wheels as she weaves her way past a charming group of ghostly carol singers. She then makes her way into the magnificent great hall, where the diminutive Professor Flitwick, using his wand, deftly levitates enchanting decorations onto a majestically tall Christmas tree.\n\nHermione soon spots Ron and Harry, who are engrossed in a strategic game of chess at one of the long, polished tables. She walks down the brightly adorned hall, eager to join her friends. During the game, the white knight piece moves on its own, and as Ron, deep in thought, contemplates his next move on the chessboard, the red queen suddenly advances and knocks the knight's head off with precision. Meanwhile, Harry's snowy owl, perched nearby, turns its head as Harry springs out of bed, reaching for his spectacles and putting them on quickly. Downstairs in the Gryffindor common room, Ron stands in front of a roaring fire, creating a cozy atmosphere, while Harry dashes barefoot down the cold stone stairs toward a pile of enticing presents beneath the Christmas tree. With excitement, Harry picks up one parcel, and Ron delights in dipping into a box filled with every flavor beans. As Harry opens a letter, he places it aside before carefully untying the string on his parcel. He then unfolds the shining silver wrapping paper to reveal a piece of soft material adorned with a rich dark pattern, which he promptly swings onto his shoulders, causing his head to astonishingly begin to float.\n\nIn the quiet library, a spectral hand carries a glowing lantern between the towering bookshelves, casting dancing shadows in the dim light. Harry, concealed under the protective cover of the invisibility cloak, peers around him with weariness. Moving stealthily, he explores the shadowy bookshelves further, removing the cloak and bringing the lantern closer to read, then placing the light down gently. As he reaches for a book and opens it, a terrifying screaming face erupts violently from the pages, startling Harry into slamming the book shut hastily. Acting quickly, he grabs his cloak, inadvertently knocking over the lamp, and frantically throws the invisibility cloak over his head to vanish. At this moment, Filch, the diligent caretaker, approaches, holding up a lantern that starkly illuminates his thin lips. Hidden from view by the cloak, Harry carefully feels his way across the darkened room. He pauses momentarily, holding his breath, as Filch strides past with his lantern, and he quietly sighs with relief when the caretaker exits through a distant doorway.\n\nHarry then creeps cautiously into a moonlit corridor, where Filch's red-eyed cat lurks stealthily, still invisible to all. As the cat darts past, two professors, Snape and Quirrell, suddenly burst through a nearby door, raising suspicion. Snape, suddenly wary, turns sharply around. Harry, to avoid being detected, covers his mouth to stifle his breathing as Snape reaches out, only to grasp at thin air. Harry carefully steps backward as Snape turns back to Quirrell, and together with Filch, they promptly rush away down the lengthy corridor. In the meantime, a door situated in the far wall mysteriously seems to open and close all by itself, adding to the mysterious atmosphere."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Snowflakes descend softly from the sky, gracefully blanketing the towering towers and stately turrets of the renowned school, known to many for its impressive architecture. As these snowflakes settle gently, Hagrid, donned in an impressively large and cozy fur coat that provides him with ample protection from the biting cold, steadily trudges across the snow-laden courtyard. With considerable effort, he drags behind him an enormous and festive Christmas tree that signals the holiday's impending joy. Meanwhile, inside the school building's inviting warmth, Hermione is seen diligently maneuvering a trunk set atop convenient wheels as she makes her way past a charming and spirited group of ghostly carol singers. She proceeds onwards into the magnificent great hall, where the diminutive and energetic Professor Flitwick, using his wand, skillfully levitates an array of enchanting decorations onto a majestically tall and splendid Christmas tree.\n\nHermione soon notices Ron and Harry, who are deeply engrossed in a strategic and intense chess game at one of the long, polished tables that line the hall. She strolls down the brightly adorned hall, filled with eagerness to join her friends. During their game, the white knight piece autonomously moves, and as Ron, deep in contemplation, ponders his next strategic move on the chessboard, the red queen suddenly advances with precision and knocks the knight's head off. Meanwhile, Harry's snowy owl, perched nearby, turns its head with wise curiosity as Harry suddenly springs out of bed, quickly reaching for his spectacles and putting them on. Downstairs in the cozy Gryffindor common room, Ron stands in front of a roaring fire, creating a warm and inviting atmosphere, while Harry, filled with excitement, dashes barefoot down the cold stone stairs toward a pile of enticing presents stacked beneath the brightly decorated Christmas tree. With joyful anticipation, Harry picks up one parcel, while Ron delights in dipping into a box filled with every flavor beans, savoring each surprise. As Harry opens a letter, he sets it aside carefully before untying the string on his parcel with eager hands. He unfolds the shining silver wrapping paper to reveal a piece of soft material, richly adorned with a dark pattern, which he promptly swings onto his shoulders, causing his head to astonishingly float in mid-air.\n\nIn the quiet and serene library, a spectral hand carries a glowing lantern between the tall, towering bookshelves, casting dancing shadows that flicker in the dim light. Harry, concealed under the protective cover of the magical invisibility cloak, peers around him with cautious vigilance. Moving stealthily, he ventures further into the shadowy and mysterious bookshelves, removing the cloak momentarily to bring the lantern closer for reading. He places the light down gently, careful not to disturb the silence. As he reaches for a book and opens it, a terrifying and unexpected screaming face erupts violently from the pages, startling Harry enough to slam the book shut hastily. Acting quickly in the midst of sudden panic, he grabs his invisibility cloak, inadvertently knocking over the lamp, and frantically throws the cloak over his head to vanish from sight. At this tense moment, Filch, the diligent and watchful caretaker, approaches, holding up a lantern that starkly highlights his thin lips. Hidden from view by the cloak, Harry carefully feels his way across the darkened room, pausing momentarily and holding his breath as Filch strides past with his lantern. Harry quietly sighs with relief when the caretaker exits through a distant doorway, allowing him to proceed undetected.\n\nHarry then cautiously creeps into a moonlit corridor, where Filch's red-eyed cat lurks stealthily, still invisible to all passersby. As the cat darts past with feline agility, two professors, Snape and Quirrell, suddenly burst through a nearby door, raising suspicion with their abrupt presence. Snape, suddenly wary, turns sharply around, scanning the corridor. Harry, in an effort to avoid being detected, covers his mouth to stifle his breathing as Snape reaches out, only to grasp at thin air. Harry carefully steps backward, maintaining his invisibility, as Snape turns back to Quirrell. Together with Filch, they promptly rush away down the lengthy corridor, leaving an air of mystery behind. Meanwhile, a door situated in the far wall mysteriously seems to open and close all by itself, adding yet another layer to the mysterious and intriguing atmosphere."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Snow gently descends onto the tars and turrets of the school, casting a serene white cover over the landscape as Hagrid, enveloped in a massive fur coat, trudges heavily across the snow-blanketed courtyard. He exerts effort as he drags behind him an enormous Christmas tree, leaving a distinct trail in the soft snow. Inside the school, the atmosphere is bustling with festive preparations as Hermione, with a determined expression, pulls a trunk on wheels. She deftly navigates past a group of ghostly carol singers who fill the air with ethereal melodies and then enters the great hall. In this grand space, she observes tiny Professor Flitwick, who is perched on a small platform. With a delicate flick of his wand, he skillfully levitates sparkling decorations onto a towering Christmas tree, adding layers of color and cheer. Hermione continues her journey down the brightly adorned hall, where she spots Ron and Harry deeply engrossed in a game of chess at one of the long, polished tables. She approaches them as the white knight on the board animates and moves by itself. Ron studies the board intently, and just as he seems to decide on his next move, the red queen pieces makes a swift motion and brutally knocks the knight's head off, demonstrating the chess game's magical nature. Meanwhile, in another part of the school, Harry's snowy owl, perched in the dormitory, turns its head in curiosity as Harry suddenly springs out of bed. He hurriedly puts on his spectacles and makes his way, barefoot, down the stone stairs of the Gryffindor common room. The warmth of a blazing fire casts flickering shadows as Ron stands nearby, absorbed in the cozy ambiance. Harry's attention, however, is captured by a pile of presents gathered at the base of a magnificently decorated Christmas tree. He eagerly reaches for a parcel, while Ron, standing beside him, indulges in a box of every flavor beans, savoring the assortment. Harry's curiosity drives him to open a letter first, which he reads and places aside before meticulously untying the string on the parcel. He gently peels back the silver wrapping paper to reveal a piece of soft material with an intricate, rich, dark pattern. In a moment of wonder, he swings the cloak onto his shoulders, and to his amazement, his head begins to float, vanishing from sight beneath the fabric. Later, in the dimly lit expanse of the library, a ghostly floating hand, unseen by most, carries a lantern between towering bookshelves. Harry, now hidden under the invisibility cloak, peers around cautiously, his eyes scanning the darkness for any signs of movement. Moving deeper into the library, he searches diligently along the shadowy bookshelves. He removes the cloak momentarily, holding the lantern closer to a particular shelf to better examine the titles, then places the light on the ground. In his quest for knowledge, he takes down a book and opens it, only to be startled by the sudden appearance of a screaming face that bursts violently from the pages. In shock, Harry instinctively slams the book shut. Reacting quickly, he grabs his cloak, the force of which causes the lamp to topple over. In a hurried, fluid motion, he pulls the invisibility cloak over his head just in time to disappear from sight. Filch, the vigilant caretaker, enters the scene, holding up a lantern that casts an eerie glow on his thin lips. As Harry moves stealthily across the dark room, hidden by the cloak, he pauses, his breathing shallow and controlled, when Filch passes perilously close by with his lantern. A wave of relief washes over Harry once Filch exits through a distant doorway, allowing him to breathe easier. With caution, Harry slips into a moonlit corridor, remaining vigilant as he notices Filch's red-eyed cat lurking ominously. The cat, sensing something amiss, darts across the corridor. Simultaneously, two professors, Snape and Quirrell, suddenly burst through a door, their entrance abrupt and charged with tension. Instinctively, Harry covers his mouth to muffle the sound of his breathing as Snape turns with suspicion, reaching out only to close his fingers around thin air. Harry steps backward quietly, maintaining his invisibility as Snape, still suspicious but momentarily distracted, refocuses his attention on Quirrell. In a swift, coordinated move, Quirrell, Snape, and Filch hurry away down the corridor, their footsteps fading into the distance. Observing the unfolding events from his concealed position, Harry watches as a door in the far wall mysteriously opens and closes on its own, hinting at yet another layer of intrigue within the school's ancient walls."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Snow blankets the towers and turrets of the school as Hagrid, clad in a huge fur coat, trudges across the snowy courtyard with an enormous Christmas tree in tow. Inside, Hermione maneuvers a wheeled trunk past ghostly carol singers and enters the great hall, where Professor Flitwick magically decorates a tall Christmas tree. Hermione joins Ron and Harry, who are engaged in a chess game at one of the long tables. As Ron strategizes his next move, the self-moving chess pieces clash, and the red queen captures the white knight. Meanwhile, Harry's owl watches as Harry awakens, dons his spectacles, and hurries down to the Gryffindor common room. There, Ron is by the fire as Harry rushes barefoot to the Christmas tree gifts. Harry examines a parcel, reads a letter, and unwraps it to discover a cloak, which, when draped over his shoulders, causes his head to vanish. Later, in the library, a lantern floats among the bookshelves as Harry, under the invisibility cloak, searches for a book. He removes the cloak, peruses a book, but slams it shut when a screaming face erupts from the pages. He quickly grabs the cloak, spills a lamp, and vanishes just as Filch appears. Hidden, Harry navigates the dark room, pausing as Filch exits, relieved. He sneaks down a moonlit corridor, staying invisible as Filch's cat prowls and Snape and Quirrell emerge, arousing Snape's suspicion. Harry stifles his breath, avoiding Snape's grasp, and remains undetected as the group departs down the corridor, leaving a door mysteriously swinging open by itself."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Snow falls onto the tars and turrets of the school, Hogwarts, a castle known for its ancient and magical architecture, as Hagrid, the school's kind-hearted half-giant gamekeeper, wearing a huge fur coat suited for his enormous frame, plods across the snow-covered courtyard, dragging behind him an enormous Christmas tree he just cut down from the school grounds. Inside the school, Hogwarts, Hermione pulls a trunk on wheels past a group of ghostly carol singers, the resident ghosts who delight in hauntingly beautiful melodies, and enters the great hall. Here, tiny Professor Flitwick, a master of charms and known for his talent in spellcasting, waves his wand and levitates decorations onto a tall Christmas tree, preparing for the festive season. Hermione finds Ron and Harry playing wizard's chess at one of the long polished tables and walks down the brightly decorated hall to join them. The enchanted white knight moves by itself, and as Ron contemplates the board, the red queen moves and knocks the knight's head off with a decisive thud. Meanwhile, Harry's snowy owl, Hedwig, known for her loyalty and intelligence, turns its head as Harry leaps out of bed and puts on his spectacles. Down in the Gryffindor common room, a cozy and vibrant gathering space for one of the four school houses, Ron stands in front of a blazing fire, warming himself, while Harry runs barefoot down the stone stairs towards a pile of presents under the Christmas tree. Harry picks up a parcel from his godfather, Sirius Black, and Ron dips into a box of every flavor beans, a popular but unpredictable wizarding treat. Harry opens a letter, puts it down, and unties the string on the parcel, unfolding the silver wrapping paper to reveal an invisibility cloak bequeathed by his father, which he swings onto his shoulders, and his head begins to float invisibly. In the library, a restricted section known for its forbidden tomes, a floating hand carries a lantern between the bookshelves as Harry, under the invisibility cloak, peers about him wearily. Inside, he searches along more dark bookshelves, takes off the cloak, and holds the lantern closer to a shelf, then puts the light down. As he takes down a book and opens it, a screaming face, an enchantment to deter curious students, bursts violently out of the pages, prompting Harry to slam the book shut. Grabbing his cloak, he knocks over the lamp, quickly puts on the invisibility cloak over his head, and disappears as Filch, the caretaker notorious for his dislike of rule-breakers, holds up a lantern, the lamplight showing up his thin lips. Hidden by the invisibility cloak, Harry feels his way across the dark room, stopping for a moment as Filch passes by with his lantern, and breathes a sigh of relief as the caretaker goes out through a far doorway. Harry creeps into a moonlit corridor, where Filch's red-eyed cat, Mrs. Norris, known for her uncanny ability to detect students out of bed, is lurking, while still invisible. As the cat runs past, two professors, Snape, the potions master with a penchant for suspicion, and Quirrell, the nervous defense teacher, burst through a door, and suddenly suspicious, Snape turns around. Harry covers his mouth to muffle his breathing as Snape makes a grab but only snatches a handful of air. Harry takes a step backward as Snape turns sharply back to Quirrell, and then Quirrell, Snape, and Filch rush away down the corridor. A door in the far wall, which conceals a secret passage, seems to open and close by itself."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "As the cat runs past two professors Snape and Quirrell burst through a door and suddenly suspicious Snape turns around As he takes down a book and opens it a screaming face bursts violently out of the pages prompting Harry to slam the book shut Snow falls onto the tars and turrets of the school as Hagrid wearing a huge fur coat plods across the snowcovered courtyard dragging behind him an enormous Christmas tree Meanwhile Harry's snowy owl turns its head as Harry leaps out of bed and puts on his spectacles Harry opens a letter puts it down and unties the string on the parcel unfolding the silver wrapping paper to reveal some soft material with a rich dark pattern which he swings onto his shoulders and his head begins to float Inside the school Hermione pulls a trunk on wheels past a group of ghostly carol singers and enters the great hall where tiny Professor Flitwick waves his wand and levitates decorations onto a tall Christmas tree The white knight moves by itself and as Ron contemplates the board the red queen moves and knocks the knight's head off Grabbing his cloak he knocks over the lamp quickly puts on the invisibility cloak over his head and disappears Inside the school Hermione pulls a trunk on wheels past a group of ghostly carol singers and enters the great hall where tiny Professor Flitwick waves his wand and levitates decorations onto a tall Christmas tree Hermione finds Ron and Harry playing chess at one of the long polished tables and walks down the brightly decorated hall to join them The white knight moves by itself and as Ron contemplates the board the red queen moves and knocks the knight's head off Meanwhile Harry's snowy owl turns its head as Harry leaps out of bed and puts on his spectacles Hidden by the invisibility cloak Harry feels his way across the dark room stopping for a moment as Filch passes by with his lantern and breathes a sigh of relief Down in the Gryffindor common room Ron stands in front of a blazing fire while Harry runs barefoot down the stone stairs towards a pile of presents on the Christmas tree Harry picks up a parcel and Ron dips into a box of every flavor beans Harry opens a letter puts it down and unties the string on the parcel unfolding the silver wrapping paper to reveal some soft material with a rich dark pattern which he swings onto his shoulders and his head begins to float In the library a floating hand carries a lantern between the bookshelves as Harry under the invisibility cloak peers about him wearily Inside he searches along more dark bookshelves takes off the cloak and holds the lantern closer to a shelf then puts the light down As he takes down a book and opens it a screaming face bursts violently out of the pages prompting Harry to slam the book shut Grabbing his cloak he knocks over the lamp quickly puts on the invisibility cloak over his head and disappears In the library a floating hand carries a lantern between the bookshelves as Harry under the invisibility cloak peers about him wearily as Filch the caretaker holds up a lantern the lamplight showing up his thin lips Hidden by the invisibility cloak Harry feels his way across the dark room stopping for a moment as Filch passes by with his lantern and breathes a sigh of relief as the caretaker goes out through a far doorway Harry creeps into a moonlit corridor where Filch's redeyed cat is lurking while still invisible Snow falls onto the tars and turrets of the school as Hagrid wearing a huge fur coat plods across the snowcovered courtyard dragging behind him an enormous Christmas tree Snape and Filch rush away down the corridor As the cat runs past two professors Snape and Quirrell burst through a door and suddenly suspicious Snape turns around Harry covers his mouth to muffle his breathing as Snape makes a grab but only snatches a handful of air Harry takes a step backward as Snape turns sharply back to Quirrell and then Quirrell Snape and Filch rush away down the corridor A door in the far wall seems to open and close by itself"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Snow falls onto the tars and turrets of the school as Hagrid wearing a huge fur coat plods across the snowcovered courtyard dragging behind him an enormous Christmas tree. Inside the school Hermione pulls a trunk on wheels past a group of ghostly carol singers and enters the great hall where tiny Professor Flitwick waves his wand and levitates decorations onto a tall Christmas tree. Hermione finds Ron and Harry playing chess at one of the long polished tables and walks down the brightly decorated hall to join them. The white knight moves by itself and as Ron contemplates the board the red queen moves and knocks the knight's head off. Meanwhile Harry's snowy owl turns its head as Harry leaps out of bed and puts on his spectacles. Down in the Gryffindor common room Ron stands in front of a blazing fire while Harry runs barefoot down the stone stairs towards a pile of presents on the Christmas tree. Harry picks up a parcel and Ron dips into a box of every flavor beans. Harry opens a letter puts it down and unties the string on the parcel unfolding the silver wrapping paper to reveal some soft material with a rich dark pattern which he swings onto his shoulders and his head begins to float. In the library a floating hand carries a lantern between the bookshelves as Harry under the invisibility cloak peers about him wearily. Inside he searches along more dark bookshelves takes off the cloak and holds the lantern closer to a shelf then puts the light down. As he takes down a book and opens it a screaming face bursts violently out of the pages prompting Harry to slam the book shut. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Grabbing his cloak he knocks over the lamp quickly puts on the invisibility cloak over his head and disappears. as Filch. the caretaker holds up a lantern the lamplight showing up his thin lips. Hidden by the invisibility cloak Harry feels his way across the dark room stopping for a moment as Filch passes by with his lantern and breathes a sigh of relief. as the caretaker goes out through a far doorway. Harry creeps into a moonlit corridor where Filch's redeyed cat is lurking while still invisible. As the cat runs past two professors Snape and Quirrell burst through a door and suddenly suspicious Snape turns around. Harry covers his mouth to muffle his breathing as Snape makes a grab but only snatches a handful of air. Harry takes a step backward as Snape turns sharply back to Quirrell and then Quirrell. Snape and Filch rush away down the corridor. A door in the far wall seems to open and close by itself."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Snow falls onto the tars and turrets of the school as Hagrid wearing a huge fur coat plods across the snowcovered courtyard dragging behind him an enormous Christmas tree. Inside the school Hermione pulls a trunk on wheels past a group of ghostly carol singers and enters the great hall where tiny Professor Flitwick waves his wand and levitates decorations onto a tall Christmas tree. Hermione finds Ron and Harry playing chess at one of the long polished tables and walks down the brightly decorated hall to join them. The white knight moves by itself and as Ron contemplates the board the red queen moves and knocks the knight's head off. Meanwhile Harry's snowy owl turns its head as Harry leaps out of bed and puts on his spectacles. Down in the Gryffindor common room Ron stands in front of a blazing fire while Harry runs barefoot down the stone stairs towards a pile of presents on the Christmas tree. Harry picks up a parcel and Ron dips into a box of every flavor beans. Harry opens a letter puts it down and unties the string on the parcel unfolding the silver wrapping paper to reveal some soft material with a rich dark pattern which he swings onto his shoulders and his head begins to float. In the library a floating hand carries a lantern between the bookshelves as Harry under the invisibility cloak peers about him wearily. Inside he searches along more dark bookshelves takes off the cloak and holds the lantern closer to a shelf then puts the light down. As he takes down a book and opens it a screaming face bursts violently out of the pages prompting Harry to slam the book shut. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Grabbing his cloak he knocks over the lamp quickly puts on the invisibility cloak over his head and disappears. as Filch. the caretaker holds up a lantern the lamplight showing up his thin lips. Hidden by the invisibility cloak Harry feels his way across the dark room stopping for a moment as Filch passes by with his lantern and breathes a sigh of relief. as the caretaker goes out through a far doorway. Harry creeps into a moonlit corridor where Filch's redeyed cat is lurking while still invisible. As the cat runs past two professors Snape and Quirrell burst through a door and suddenly suspicious Snape turns around. Harry covers his mouth to muffle his breathing as Snape makes a grab but only snatches a handful of air. Harry takes a step backward as Snape turns sharply back to Quirrell and then Quirrell. Snape and Filch rush away down the corridor. A door in the far wall seems to open and close by itself."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Snow falls onto the tars and turrets of the school as Hagrid wearing a huge fur coat plods across the snowcovered courtyard dragging behind him an enormous Christmas tree. Inside the school Hermione pulls a trunk on wheels past a group of ghostly carol singers and enters the great hall where tiny Professor Flitwick waves his wand and levitates decorations onto a tall Christmas tree. Hermione finds Ron and Harry playing chess at one of the long polished tables and walks down the brightly decorated hall to join them. The white knight moves by itself and as Ron contemplates the board the red queen moves and knocks the knight's head off. Meanwhile Harry's snowy owl turns its head as Harry leaps out of bed and puts on his spectacles. Down in the Gryffindor common room Ron stands in front of a blazing fire while Harry runs barefoot down the stone stairs towards a pile of presents on the Christmas tree. As the cat runs past two professors Snape and Quirrell burst through a door and suddenly suspicious Snape turns around. Harry covers his mouth to muffle his breathing as Snape makes a grab but only snatches a handful of air. Harry takes a step backward as Snape turns sharply back to Quirrell and then Quirrell. Snape and Filch rush away down the corridor. A door in the far wall seems to open and close by itself."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Snow falls onto the tars and turrets of the school as Hagrid wearing a huge fur coat plods across the snowcovered courtyard dragging behind him an enormous Christmas tree. Inside the school Hermione pulls a trunk on wheels past a group of ghostly carol singers and enters the great hall where tiny Professor Flitwick waves his wand and levitates decorations onto a tall Christmas tree. Hermione finds Ron and Harry playing chess at one of the long polished tables and walks down the brightly decorated hall to join them. Snape and Filch rush away down the corridor. A door in the far wall seems to open and close by itself."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Snow falls onto the tars and turrets of the school as the dragon, wearing a huge fur coat, plods across the snow-covered courtyard, dragging behind it an enormous Christmas tree. Inside the school, the unicorn pulls a trunk on wheels past a group of ghostly carol singers and enters the great hall, where tiny the troll waves its wand and levitates decorations onto a tall Christmas tree. The unicorn finds the goblin and the dwarf playing chess at one of the long polished tables and walks down the brightly decorated hall to join them. The white knight moves by itself, and as the goblin contemplates the board, the red queen moves and knocks the knight's head off. Meanwhile, the elf's snowy owl turns its head as the elf leaps out of bed and puts on its spectacles. Down in the Gryffindor common room, the fairy stands in front of a blazing fire while the elf runs barefoot down the stone stairs towards a pile of presents on the Christmas tree. The elf picks up a parcel, and the fairy dips into a box of every flavor beans. The elf opens a letter, puts it down, and unties the string on the parcel, unfolding the silver wrapping paper to reveal some soft material with a rich dark pattern, which it swings onto its shoulders, and its head begins to float. In the library, a floating tree carries a lantern between the bookshelves as the elf, under the invisibility cloak, peers about it wearily. Inside, it searches along more dark bookshelves, takes off the cloak, and holds the lantern closer to a shelf, then puts the light down. As it takes down a book and opens it, a screaming face bursts violently out of the pages, prompting the elf to slam the book shut. Grabbing its cloak, it knocks over the lamp, quickly puts on the invisibility cloak over its head, and disappears as the giant, the caretaker, holds up a lantern, the lamplight showing up its thin lips. Hidden by the invisibility cloak, the elf feels its way across the dark room, stopping for a moment as the giant passes by with its lantern, and breathes a sigh of relief as the caretaker goes out through a far doorway. The elf creeps into a moonlit corridor, where the giant's red-eyed cat is lurking, while still invisible. As the cat runs past, two professors, the centaur and the phoenix, burst through a door, and suddenly suspicious, the centaur turns around. The elf covers its mouth to muffle its breathing as the centaur makes a grab but only snatches a handful of air. The elf takes a step backward as the centaur turns sharply back to the phoenix, and then the phoenix, the centaur, and the giant rush away down the corridor. A door in the far wall seems to open and close by itself."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Snow falls onto the rooftops and spires of the museum as Hagrid, wearing a huge raincoat, plods across the snow-covered plaza, dragging behind him an enormous fig tree. Inside the museum, Hermione pulls a suitcase on wheels past a group of ghostly opera singers and enters the grand gallery, where tiny Professor Flitwick waves his wand and levitates ornaments onto a tall cactus. Hermione finds Ron and Harry playing checkers at one of the long polished counters and walks down the brightly decorated gallery to join them. The white bishop moves by itself, and as Ron contemplates the board, the red pawn moves and knocks the bishop's head off. Meanwhile, Harry's snowy rabbit turns its head as Harry leaps out of bed and puts on his monocle. Down in the Gryffindor common lounge, Ron stands in front of a roaring stove while Harry runs barefoot down the wooden steps towards a pile of gifts on the fig tree. Harry picks up a package, and Ron dips into a box of every flavor cookies. Harry opens a note, puts it down, and unties the string on the package, unfolding the golden foil to reveal some soft fabric with a rich dark pattern, which he swings onto his shoulders, and his head begins to float. In the library, a floating quill carries a candle between the bookshelves as Harry, under the invisibility cloak, peers about him wearily. Inside, he searches along more dark bookshelves, takes off the cloak, and holds the candle closer to a shelf, then puts the light down. As he takes down a book and opens it, a screaming face bursts violently out of the pages, prompting Harry to slam the book shut. Grabbing his cloak, he knocks over the candlestick, quickly puts on the invisibility cloak over his head, and disappears as Filch, the caretaker, holds up a torch, the torchlight showing up his thin lips. Hidden by the invisibility cloak, Harry feels his way across the dark room, stopping for a moment as Filch passes by with his torch, and breathes a sigh of relief as the caretaker goes out through a far gateway. Harry creeps into a moonlit hallway, where Filch's red-eyed dog is lurking, while still invisible. As the dog runs past, two professors, Snape and Quirrell, burst through a gate, and suddenly suspicious, Snape turns around. Harry covers his mouth to muffle his breathing as Snape makes a grab but only snatches a handful of mist. Harry takes a step backward as Snape turns sharply back to Quirrell, and then Quirrell, Snape, and Filch rush away down the hallway. A gate in the far wall seems to open and close by itself."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Snow sprinkles onto the tars and turrets of the school as Hagrid, wearing a huge fur coat, saunters across the snow-covered courtyard, hoisting behind him an enormous Christmas tree. Inside the school, Hermione pushes a trunk on wheels past a group of ghostly carol singers and slides into the great hall, where tiny Professor Flitwick flicks his wand and twirls decorations onto a tall Christmas tree. Hermione locates Ron and Harry drawing sketches at one of the long polished tables and strolls down the brightly decorated hall to join them. The white knight shifts by itself, and as Ron examines the board, the red queen sways and pats the knight's head off. Meanwhile, Harry's snowy owl rotates its head as Harry bounces out of bed and grabs his spectacles. Down in the Gryffindor common room, Ron lounges in front of a blazing fire while Harry glides barefoot down the stone stairs towards a heap of presents on the Christmas tree. Harry picks up a parcel, and Ron dunks into a box of every flavor beans. Harry scans a letter, sets it down, and loosens the string on the parcel, unfolding the silver wrapping paper to disclose some soft material with a rich dark pattern, which he stretches onto his shoulders, and his head begins to bob. In the library, a floating hand swings a lantern between the bookshelves as Harry, under the invisibility cloak, peers about him attentively. Inside, he roams along more dark bookshelves, drops the cloak, and raises the lantern closer to a shelf, then places the light down. As he plucks a book and flips it open, a screaming face erratically shoots out of the pages, prompting Harry to snap the book shut. Seizing his cloak, he nudges over the lamp, swiftly slips on the invisibility cloak over his head, and fades as Filch, the caretaker, elevates a lantern, the lamplight revealing his thin lips. Hidden by the invisibility cloak, Harry navigates his way across the dark room, pausing for a moment as Filch ambles by with his lantern, and exhales a sigh of relief as the caretaker slips out through a distant doorway. Harry sneaks into a moonlit corridor, where Filch's red-eyed cat is prowling, while still invisible. As the cat darts past, two professors, Snape and Quirrell, pop through a door, and suddenly suspicious, Snape pivots around. Harry shields his mouth to muffle his breathing as Snape extends a grasp but only clutches a handful of air. Harry inches backward as Snape spins sharply back to Quirrell, and then Quirrell, Snape, and Filch dash away down the corridor. A door in the far wall seems to swing and pause by itself."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Ribbons drift onto the gears and chimneys of the lighthouse as a mailbox, wearing a massive velvet cloak, trudges across the dust-covered arena, dragging behind it a towering olive tree. Inside the lighthouse, a notebook pushes a suitcase on wheels past a pack of ghostly violin players and enters the grand ballroom, where minuscule Admiral Whiskers waves his baton and levitates sculptures onto a towering olive tree. The notebook finds a blender and a stapler playing checkers at one of the long polished benches and strolls down the brightly adorned ballroom to join them. The striped elephant moves by itself, and as the blender considers the board, the purple giraffe moves and knocks the elephant's trunk off. Meanwhile, the stapler's frosty parrot turns its head as the stapler springs out of bed and puts on its goggles. Down in the zebra common ground, the blender stands in front of a roaring waterfall while the stapler sprints barefoot down the granite ladder towards a stack of brochures on the olive tree. The stapler picks up a package, and the blender dips into a carton of assorted jellybeans. The stapler opens a postcard, puts it down, and unties the thread on the package, unfolding the golden wrapping paper to reveal some soft fabric with a vivid light pattern, which it swings onto its hinges, and its lid begins to float. In the observatory, a floating shoe carries a candle between the bookshelves as the stapler, under the veil of silence, surveys about it wearily. Inside, it scours along more dim bookshelves, removes the cloak, and holds the candle closer to a shelf, then sets the flame down. As it pulls down a manuscript and opens it, a hollering mask bursts violently out of the pages, prompting the stapler to slam the manuscript shut. Grabbing its cloak, it topples over the candle, swiftly shrouds itself with the veil of silence over its lid, and vanishes as the deckhand, the watchman, holds up a candle, the light illuminating his thin whiskers. Concealed by the veil of silence, the stapler feels its way across the dim space, pausing for a moment as the watchman ambles by with his candle, and exhales a sigh of relief as the watchman exits through a distant doorway. The stapler sneaks into a starlit corridor, where the watchman’s amber-eyed squirrel is lurking, while still invisible. As the squirrel scurries past, two librarians, Scarecrow and Thimble, burst through a gateway, and suddenly alert, Scarecrow swivels around. The stapler covers its lid to muffle its exhalations as Scarecrow makes a lunge but only secures a fistful of mist. The stapler retreats a step as Scarecrow pivots sharply back to Thimble, and then Thimble, Scarecrow, and the watchman hustle away down the hallway. A gateway in the distant wall seems to open and close by itself."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Rain drizzles onto the benches and spires of the library as Dobby, wearing a small leather jacket, skips across the rain-soaked field, carrying behind him a massive bouquet of flowers. Outside the library, Luna pushes a cart on rails past a group of whispering band members and enters the main room, where tall Professor McGonagall flicks her wand and hangs garlands onto a towering chandelier. Luna finds Neville and Ginny sketching landscapes at one of the long wooden desks and dances down the vibrantly decorated room to join them. The black bishop slides by itself, and as Neville ponders the canvas, the white rook slides and snatches the bishop's arm away. Meanwhile, Ginny's tabby cat twitches its ears as Ginny jumps out of bed and puts on her slippers. Up in the Ravenclaw tower, Neville sits in front of a crackling fire while Ginny hops barefoot down the spiral staircase towards a stack of letters on the windowsill. Ginny grabs an envelope, and Neville reaches into a jar of gummy worms. Ginny opens a note, places it aside, and unties the ribbon on the envelope, unfolding the gold wrapping paper to reveal some smooth fabric with a deep blue pattern, which she drapes onto her shoulders, and her arms begin to vanish. In the classroom, a floating quill waves a map between chalkboards as Ginny, under the enchanted shawl, peers around her cautiously. Outside, she sneaks along more shadowy classrooms, takes off the shawl, and lifts the map closer to a chalkboard, then sets the map down. As she pulls out a scroll and unfurls it, a shrieking specter bursts energetically out of the parchment, prompting Ginny to roll the scroll back. Grabbing her shawl, she knocks over the inkpot, swiftly wraps the enchanted shawl over her head, and vanishes as Binns, the custodian, lifts a candle, the candlelight highlighting his furrowed brow. Concealed by the enchanted shawl, Ginny inches her way across the shadowy hall, pausing momentarily as Binns wanders past with his candle, and exhales a breath of relief as the custodian exits through a nearby archway. Ginny sneaks into a starlit passage, where Binns’ green-eyed owl is perched, while still hidden. As the owl flutters past, two students, Malfoy and Crabbe, burst through a curtain, and suddenly curious, Malfoy turns around. Ginny covers her face to stifle a laugh as Malfoy makes a lunge but only catches a swirl of air. Ginny takes a step sideways as Malfoy turns hastily back to Crabbe, and then Crabbe, Malfoy, and Binns hurry away down the passage. A curtain in the distant alcove seems to flutter and settle by itself."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Rain cascades onto the banners and chimneys of the library as Hagrid, wearing a large woolen cloak, trudges across the rain-soaked garden, towing behind him an enormous oak barrel. Inside the library, Hermione pushes a cart on skates past a group of ghostly street performers and enters the main chamber, where tiny Professor Flitwick twirls his umbrella and tosses cushions onto a tall bookshelf. Hermione locates Ron and Harry playing checkers at one of the short rustic desks and glides down the dimly lit chamber to join them. The black pawn glides by itself, and as Ron examines the board, the blue bishop advances and sweeps the pawn's cap away. Meanwhile, Harry's striped ferret swivels its head as Harry bounds out of his chair and straps on his goggles. Down in the Gryffindor reading room, Ron stands in front of a flickering lantern while Harry tiptoes barefoot down the wooden steps towards a stack of books on the shelf. Harry picks up a journal, and Ron digs into a jar of assorted candies. Harry unfolds a note, sets it aside, and loosens the ribbon on the journal, peeling back the golden cover to reveal some soft parchment with a vibrant, intricate design, which he drapes onto his arms, and his hands begin to float. In the atrium, a floating quill carries a crystal between the columns as Harry, beneath the invisibility shawl, peers around him cautiously. Inside, he rummages along more dim passages, removes the shawl, and holds the crystal nearer to a case, then sets the crystal down. As he lifts a tome and flips it open, a wailing silhouette erupts violently from the bindings, prompting Harry to slam the tome shut. Grabbing his shawl, he topples the candelabrum, quickly wraps the invisibility shawl over his head, and vanishes as Filch, the overseer, raises a torch, the torchlight reflecting off his narrow grin. Concealed by the invisibility shawl, Harry feels his way across the dim chamber, pausing briefly as Filch strides by with his torch, and exhales in relief as the overseer exits through a distant archway. Harry sneaks into a starlit hallway, where Filch's yellow-eyed rat is skittering, while still unseen. As the rat scurries past, two professors, Snape and Quirrell, burst through a blackboard, and suddenly wary, Snape pivots around. Harry muffles his breath to silence his inhaling as Snape lunges but only grasps a wisp of breeze. Harry edges backward as Snape swivels soundly back to Quirrell, and then Quirrell, Snape, and Filch dash away down the hallway. A trapdoor in the distant ceiling seems to lift and lower by itself."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Rain splashes onto the shields and pinnacles of the aquarium as the zookeeper, wearing a tiny silk scarf, slides across the icy parking lot, towing behind him a massive pumpkin. Outside the aquarium, the florist rolls a suitcase on skates past a crowd of spectral dancers and enters the open kitchen, where minuscule Captain Hook flicks his sword and hurls confetti onto a towering pumpkin. The florist finds a dolphin and a whale doing puzzles at one of the short round desks and skips down the dimly lit pantry to join them. The black rook glides by itself, and as the whale ponders the puzzle, the green bishop slides and kicks the rook's foot off. Meanwhile, the whale’s golden canary swivels its beak as the whale hops out of the hammock and slips on his snorkel. Up in the attic studio, the dolphin stands in front of a flickering candle while the whale crawls shoeless up the sand ramp towards a mound of apples on the pumpkin. The whale grabs a bucket, and the dolphin dips into a jar of rainbow seeds. The whale unfolds a scroll, sets it aside, and loosens the ribbon on the bucket, unfurling the copper wrapping cloth to uncover some rough fabric with a bright pale design, which he drapes around his waist, and his torso begins to shimmer. In the basement, a floating boot carries a flashlight between the sofas as the whale, beneath the camo net, peers around him nervously. Outside, he browses beside more bright sofas, takes off the net, and brings the flashlight nearer to a couch, then sets the beam aside. As he pulls down a pillow and unzips it, a wailing ghost erupts wildly out of the linen, provoking the whale to zip the pillow closed. Seizing his net, he nudges over the flashlight, hurriedly pulls the camo net over his waist, and vanishes as the gardener, the groundskeeper, holds up a flashlight, the glow revealing his thick eyebrows. Hidden by the camo net, the whale traces his path through the dim chamber, pausing for an instant as the gardener passes by with his flashlight, and exhales in relief as the groundskeeper slips out via a nearby archway. The whale tiptoes into a sunlit atrium, where the gardener's blue-eyed turtle is prowling, while still invisible. As the turtle slides past, three lifeguards, Olaf and Daisy, burst through a curtain, and suddenly alert, Olaf pivots around. The whale covers his ears to silence his heartbeat as Olaf makes a swipe but only grabs a pocket of fog. The whale takes a hop backward as Olaf swivels swiftly back to Daisy, and then Daisy, Olaf, and the gardener bustle away down the hallway. A window in the nearby floor seems to creak and shut by itself."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Snow falls as Hagrid, in a large fur coat, drags an enormous Christmas tree across the courtyard. Inside, Hermione pulls a trunk past ghostly carol singers and enters the great hall, where Professor Flitwick is decorating a Christmas tree. Hermione joins Ron and Harry playing chess. Meanwhile, Harry's owl watches as he leaps out of bed and runs to the common room, where Ron stands by the fire. Harry excitedly opens a parcel, revealing a cloak with a rich dark pattern, which he puts on, causing his head to disappear. Later, in the library, Harry uses the invisibility cloak to search the shelves. He opens a book that screams, quickly shuts it, and vanishes under the cloak as Filch, the caretaker, enters. Hidden, Harry breathes a sigh of relief when Filch leaves. In a moonlit corridor, Harry encounters Filch’s cat and hides as Snape and Quirrell appear, with Snape suspiciously grabbing at the air. They depart, and a door mysteriously opens and closes by itself."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "A door in the far wall seems to open and close by itself Snape and Filch rush away down the corridor Harry takes a step backward as Snape turns sharply back to Quirrell and then Quirrell Harry covers his mouth to muffle his breathing as Snape makes a grab but only snatches a handful of air As the cat runs past two professors Snape and Quirrell burst through a door and suddenly suspicious Snape turns around Harry creeps into a moonlit corridor where Filch's redeyed cat is lurking while still invisible as the caretaker goes out through a far doorway Hidden by the invisibility cloak Harry feels his way across the dark room stopping for a moment as Filch passes by with his lantern and breathes a sigh of relief the caretaker holds up a lantern the lamplight showing up his thin lips as Filch Grabbing his cloak he knocks over the lamp quickly puts on the invisibility cloak over his head and disappears As he takes down a book and opens it a screaming face bursts violently out of the pages prompting Harry to slam the book shut Inside he searches along more dark bookshelves takes off the cloak and holds the lantern closer to a shelf then puts the light down In the library a floating hand carries a lantern between the bookshelves as Harry under the invisibility cloak peers about him wearily Harry opens a letter puts it down and unties the string on the parcel unfolding the silver wrapping paper to reveal some soft material with a rich dark pattern which he swings onto his shoulders and his head begins to float Harry picks up a parcel and Ron dips into a box of every flavor beans Down in the Gryffindor common room Ron stands in front of a blazing fire while Harry runs barefoot down the stone stairs towards a pile of presents on the Christmas tree Meanwhile Harry's snowy owl turns its head as Harry leaps out of bed and puts on his spectacles The white knight moves by itself and as Ron contemplates the board the red queen moves and knocks the knight's head off Hermione finds Ron and Harry playing chess at one of the long polished tables and walks down the brightly decorated hall to join them Inside the school Hermione pulls a trunk on wheels past a group of ghostly carol singers and enters the great hall where tiny Professor Flitwick waves his wand and levitates decorations onto a tall Christmas tree Snow falls onto the tars and turrets of the school as Hagrid wearing a huge fur coat plods across the snowcovered courtyard dragging behind him an enormous Christmas tree"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "A door in the far wall seems to open and close by itself Down in the Gryffindor common room Ron stands in front of a blazing fire while Harry runs barefoot down the stone stairs towards a pile of presents on the Christmas tree Hermione finds Ron and Harry playing chess at one of the long polished tables and walks down the brightly decorated hall to join them as the caretaker goes out through a far doorway Inside he searches along more dark bookshelves takes off the cloak and holds the lantern closer to a shelf then puts the light down as Filch Harry creeps into a moonlit corridor where Filch's redeyed cat is lurking while still invisible Harry takes a step backward as Snape turns sharply back to Quirrell and then Quirrell Harry picks up a parcel and Ron dips into a box of every flavor beans the caretaker holds up a lantern the lamplight showing up his thin lips Harry covers his mouth to muffle his breathing as Snape makes a grab but only snatches a handful of air Hidden by the invisibility cloak Harry feels his way across the dark room stopping for a moment as Filch passes by with his lantern and breathes a sigh of relief As he takes down a book and opens it a screaming face bursts violently out of the pages prompting Harry to slam the book shut Inside the school Hermione pulls a trunk on wheels past a group of ghostly carol singers and enters the great hall where tiny Professor Flitwick waves his wand and levitates decorations onto a tall Christmas tree Grabbing his cloak he knocks over the lamp quickly puts on the invisibility cloak over his head and disappears Meanwhile Harry's snowy owl turns its head as Harry leaps out of bed and puts on his spectacles As the cat runs past two professors Snape and Quirrell burst through a door and suddenly suspicious Snape turns around Harry opens a letter puts it down and unties the string on the parcel unfolding the silver wrapping paper to reveal some soft material with a rich dark pattern which he swings onto his shoulders and his head begins to float In the library a floating hand carries a lantern between the bookshelves as Harry under the invisibility cloak peers about him wearily Snow falls onto the tars and turrets of the school as Hagrid wearing a huge fur coat plods across the snowcovered courtyard dragging behind him an enormous Christmas tree The white knight moves by itself and as Ron contemplates the board the red queen moves and knocks the knight's head off Snape and Filch rush away down the corridor"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Grabbing his cloak he knocks over the lamp quickly puts on the invisibility cloak over his head and disappears as Filch the caretaker holds up a lantern the lamplight showing up his thin lips Hidden by the invisibility cloak Harry feels his way across the dark room stopping for a moment as Filch passes by with his lantern and breathes a sigh of relief as the caretaker goes out through a far doorway Harry creeps into a moonlit corridor where Filch's redeyed cat is lurking while still invisible As the cat runs past two professors Snape and Quirrell burst through a door and suddenly suspicious Snape turns around Harry covers his mouth to muffle his breathing as Snape makes a grab but only snatches a handful of air Harry takes a step backward as Snape turns sharply back to Quirrell and then Quirrell Snape and Filch rush away down the corridor A door in the far wall seems to open and close by itself Snow falls onto the tars and turrets of the school as Hagrid wearing a huge fur coat plods across the snowcovered courtyard dragging behind him an enormous Christmas tree Inside the school Hermione pulls a trunk on wheels past a group of ghostly carol singers and enters the great hall where tiny Professor Flitwick waves his wand and levitates decorations onto a tall Christmas tree Hermione finds Ron and Harry playing chess at one of the long polished tables and walks down the brightly decorated hall to join them The white knight moves by itself and as Ron contemplates the board the red queen moves and knocks the knight's head off Meanwhile Harry's snowy owl turns its head as Harry leaps out of bed and puts on his spectacles Down in the Gryffindor common room Ron stands in front of a blazing fire while Harry runs barefoot down the stone stairs towards a pile of presents on the Christmas tree Harry picks up a parcel and Ron dips into a box of every flavor beans Harry opens a letter puts it down and unties the string on the parcel unfolding the silver wrapping paper to reveal some soft material with a rich dark pattern which he swings onto his shoulders and his head begins to float In the library a floating hand carries a lantern between the bookshelves as Harry under the invisibility cloak peers about him wearily Inside he searches along more dark bookshelves takes off the cloak and holds the lantern closer to a shelf then puts the light down As he takes down a book and opens it a screaming face bursts violently out of the pages prompting Harry to slam the book shut"
        }
      ]
    }
  ]
}