{
  "ground_truth": "Harry makes a grab but Malfoy spins out of reach, and Malfoy flings the Remembrall away with all his might. The glass bowl flies over and over in the air as Harry steers his broom, soaring towards a high stone tower. Upstairs in her study, Professor McGonagall sees Harry hackling towards her window, and just in time, he turns a neat somersault and catches the Remembrall, then tosses it victoriously into the air. Professor McGonagall steps to the window and looks down into the courtyard as Harry rejoins the cheering first-years, while Malfoy and his cronies snigger. Still carrying his broomstick, Harry trails after Professor McGonagall, who walks toward them, purposefully, and stops outside a classroom. The twins are there, and Hermione shows Harry a name on a Gryffindor Trophy. They go upstairs, and the staircase swings into a different position on the opposite wall. Harry opens the door at the top of the stairs, and they see a statue covered in cobwebs. A torch flares, and the caretaker's scary red-eyed cat watches them run down a torch-lit corridor. Harry struggles with the latch, and taking out her wand, the door opens and they rush through. Filch, the caretaker, holds up a lantern and peers around suspiciously, while in the middle of the room is a gigantic dog with three enormous heads and three sets of sharp, glistening teeth. The children rush for the door, and one of the slobbering heads is so enormous, it completely fills the doorway, but they slam the door shut. Daylight comes, and Oliver and Harry carry a trunk out into the school grounds. They set the trunk on the grass, and Oliver takes out a large, red ball. Chained down, two brown balls struggle to escape. Oliver gives Harry a wooden bat and then unchains one of the brown balls, which shoots straight up, above their heads, almost out of sight. Harry swings the bat and knocks the ball high into the air, flying over the head of a statue on the battlements before the ball returns. Oliver catches it, but the brown ball knocks him to the ground. He struggles with it and with great difficulty, forces it back into the trunk and fastens it down with a strong chain. He gives Harry a tiny, golden ball with delicate, golden wings that spring out of the snitch, and it flutters above Harry's head. Ron flicks his wand, and Hermione flicks her wand. A white feather rises from the desk and floats across the room towards tiny Professor Flitwick, who is standing on a pile of books. Seamus' face is smudged with soot, and a smoldering feather sinks onto the desk. Crossing the courtyard, Hermione hurries past, while the Great Hall is lit with flaming torches, and candles flicker and glow from the mouths of grinning pumpkins, which float above the heads of the students.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Sure! Here’s the text with synonyms for each non-stop word:\n\nHarry attempts a snatch but Malfoy whirls out of range, and Malfoy hurls the Remembrall away with all his strength. The glass sphere soars over and over in the sky as Harry directs his broomstick, gliding towards a tall stone turret. Upstairs in her office, Professor McGonagall observes Harry hackling towards her window, and just in time, he executes a neat flip and seizes the Remembrall, then flings it triumphantly into the air. Professor McGonagall steps to the window and gazes down into the courtyard as Harry rejoins the applauding first-years, while Malfoy and his followers giggle. Still bearing his broomstick, Harry trails after Professor McGonagall, who strides toward them, purposefully, and halts outside a classroom. The twins are present, and Hermione indicates Harry a label on a Gryffindor Award. They ascend, and the staircase pivots into a different position on the opposite wall. Harry opens the portal at the top of the stairs, and they observe a sculpture enveloped in cobwebs. A torch blazes, and the caretaker's frightening crimson-eyed cat observes them dash down a torch-lit passageway. Harry struggles with the latch, and extracting her wand, the portal opens and they hurry through. Filch, the caretaker, holds up a lantern and scrutinizes around suspiciously, while in the center of the chamber is a gigantic canine with three enormous heads and three sets of sharp, shimmering fangs. The children rush for the exit, and one of the slobbering heads is so immense, it completely fills the doorway, but they slam the door shut. Daylight arrives, and Oliver and Harry carry a chest out into the school grounds. They place the chest on the grass, and Oliver extracts a large, crimson sphere. Chained down, two brown spheres struggle to escape. Oliver grants Harry a wooden club and then unchains one of the brown spheres, which shoots straight up, above their heads, almost out of view. Harry swings the club and hits the sphere high into the sky, flying over the head of a sculpture on the battlements before the sphere returns. Oliver catches it, but the brown sphere knocks him to the earth. He struggles with it and with great difficulty, forces it back into the chest and fastens it down with a strong chain. He gives Harry a tiny, golden sphere with delicate, golden wings that spring out of the snitch, and it flutters above Harry's head. Ron flicks his wand, and Hermione flicks her wand. A white plume rises from the desk and floats across the chamber towards tiny Professor Flitwick, who is standing on a stack of books. Seamus' face is smeared with soot, and a smoldering plume sinks onto the desk. Crossing the courtyard, Hermione hurries past, while the Great Hall is lit with blazing torches, and candles flicker and glow from the mouths of grinning gourds, which float above the heads of the students."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Harry's attempt to grab is thwarted when Malfoy is spun out of reach, and the Remembrall is flung away by Malfoy with all his might. The air is flown over and over by the glass bowl as Harry's broom is steered by him, soaring towards a high stone tower. Upstairs in her study, Harry is seen by Professor McGonagall hackling towards her window, and a neat somersault is turned by him just in time, catching the Remembrall, which is then tossed victoriously into the air by him. The window is stepped to by Professor McGonagall, who looks down into the courtyard as the cheering first-years are rejoined by Harry, while Malfoy and his cronies snigger. Still carrying his broomstick, Professor McGonagall is trailed after by Harry, who is walked toward them purposefully, and a stop is made outside a classroom by her. The twins are there, and a name is shown to Harry on a Gryffindor Trophy by Hermione. Upstairs they go, and the staircase, swinging, is positioned differently on the opposite wall. The door at the top of the stairs is opened by Harry, and a statue covered in cobwebs is seen by them. A torch flares, and they are watched by the caretaker's scary red-eyed cat running down a torch-lit corridor. The latch is struggled with by Harry, and the door opened by her wand is rushed through by them. Filch, the caretaker, holds up a lantern and suspiciously peers around, while a gigantic dog with three enormous heads and three sets of sharp, glistening teeth is in the middle of the room. The door is rushed for by the children, and the doorway is completely filled by one of the slobbering heads, which is so enormous, but the door is slammed shut by them.\n\nDaylight comes, and a trunk is carried out into the school grounds by Oliver and Harry. The trunk is set on the grass by them, and a large, red ball is taken out by Oliver. Chained down, two brown balls struggle to escape. A wooden bat is given to Harry by Oliver, and one of the brown balls is unchained by Oliver, shooting straight up, above their heads, almost out of sight. The bat is swung by Harry, and the ball is knocked high into the air, flying over the head of a statue on the battlements before the ball returns. It is caught by Oliver, but he is knocked to the ground by the brown ball. He struggles with it and with great difficulty, forces it back into the trunk and fastens it down with a strong chain. A tiny, golden ball with delicate, golden wings that spring out of it is given to Harry by him, and above Harry's head, it flutters. Ron flicks his wand, and Hermione flicks her wand. A white feather is risen from the desk and floated across the room by it towards tiny Professor Flitwick, who stands on a pile of books. Seamus' face is smudged with soot, and a smoldering feather sinks onto the desk. Crossing the courtyard, past Hermione hurries, while flaming torches light the Great Hall, and from the mouths of grinning pumpkins, which float above the heads of the students, candles flicker and glow."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Harry attempts to grab the Remembrall, but Malfoy spins away and throws it forcefully. As the glass bowl flies through the air, Harry speeds toward a stone tower. In her study, Professor McGonagall sees Harry approaching her window. He neatly somersaults, catches the Remembrall, and tosses it triumphantly. Professor McGonagall watches from the window as Harry rejoins the cheering first-years; Malfoy and his friends snigger. Holding his broom, Harry follows Professor McGonagall, who leads them purposefully to a classroom. The twins are present, and Hermione shows Harry a name on a Gryffindor Trophy. They ascend stairs, which shift to a different wall. At the top, they find a cobwebbed statue. A torch flares, revealing the caretaker's red-eyed cat watching them run down a corridor. Harry struggles with a latch, but using a wand, the door opens, and they rush in. Filch appears with a lantern, peering around suspiciously, while a gigantic three-headed dog with sharp teeth stands in the room. They slam the door as one head fills the doorway. Daylight comes, and Oliver and Harry carry a trunk outside. Setting it on the grass, Oliver retrieves a large red ball. Two brown balls, chained down, struggle to escape. Oliver hands Harry a bat and unchains one brown ball, which shoots skyward. Harry swings the bat, sending it high above a statue, but it returns. Oliver catches it, the ball knocks him down, and he forces it back into the trunk, securing it with a chain. Oliver gives Harry a tiny golden ball with delicate wings, which flutters overhead. Ron and Hermione flick their wands, causing a white feather to float across the room toward Professor Flitwick, standing on books. Seamus' face is smudged, and a smoldering feather lands on the desk. Hermione hurries past the Great Hall, lit with torches and candles flickering from pumpkin mouths above the students."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Harry tries to grab the Remembrall, but Malfoy evades him and throws it. The glass flies as Harry maneuvers his broom towards a tower. Professor McGonagall sees Harry catch the Remembrall with a somersault. She watches as Harry joins cheering first-years, while Malfoy and cronies snicker. Harry follows McGonagall to a classroom where twins and Hermione show him a Gryffindor Trophy. They ascend a staircase that shifts positions, revealing a cobwebbed statue. A torch flares, and the caretaker's red-eyed cat watches them flee down a corridor. Harry struggles with a door, and with a wand, they escape. Filch peers around with a lantern, as a gigantic three-headed dog lurks. The children shut the door against one slobbering head. Daylight comes, and Oliver and Harry take a trunk outside. Oliver shows Harry a red ball and unchains a brown one that soars. Harry bats it over a statue; Oliver catches it but is knocked down. He chains it back in the trunk and gives Harry a small golden ball with wings. Ron and Hermione use their wands to make a feather float across the room to Professor Flitwick. Seamus' face is soot-covered, and a smoldering feather falls. Hermione passes the courtyard while the Great Hall glows with torchlight and floating pumpkin candles."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Harry makes a daring grab for the Remembrall, but Malfoy manages to spin out of reach just in time. With all his might, Malfoy flings the Remembrall away from him. The glass bowl twirls and spins repeatedly through the air as Harry expertly steers his broomstick, soaring swiftly towards a towering high stone structure. Upstairs in her study, Professor McGonagall notices Harry racing directly towards her window, and, just in the nick of time, he executes a perfect somersault, skillfully catching the Remembrall before triumphantly tossing it back into the air. Professor McGonagall steps over to the window and gazes downward into the bustling courtyard as Harry makes his way back to the gathering of cheering first-year students. Meanwhile, Malfoy and his group of cronies stand by, sniggering. Still clutching his trusty broomstick, Harry follows in the footsteps of Professor McGonagall, who strides purposefully towards them, eventually coming to a stop outside a classroom door. The twins are present, and Hermione excitedly shows Harry a name on a Gryffindor trophy. They ascend the stairs, and the staircase swings around to settle into a new position against the opposite wall. At the top of the stairs, Harry opens the door, and they discover a statue cloaked in cobwebs. A torch suddenly flares up, casting light on the caretaker's intimidating, red-eyed cat as it watches them sprint down a corridor illuminated by torches. Harry struggles to manage the latch, and after taking out her wand, the door opens, allowing them to rush through. Filch, the meticulous caretaker, holds up a lantern and peers around suspiciously, while in the center of the room stands a gigantic, menacing dog with three enormous heads, each adorned with three sets of sharp, glistening teeth. The children hastily rush for the door, and one of the slobbering, enormous heads fills the entire doorway, but they manage to slam the door shut. As daylight breaks, Oliver and Harry are seen carrying a large trunk out into the expansive school grounds. They set the heavy trunk down on the grass, and Oliver retrieves a large, vibrant red ball. Two brown balls, securely chained down, seem eager to break free. Oliver hands Harry a sturdy wooden bat and then unchains one of the brown balls, which shoots straight up into the air, ascending far above their heads, almost disappearing from sight. Harry swings the bat with precision and knocks the ball high into the sky, where it soars over the head of a statue perched on the battlements before the ball returns. Oliver, quick on his feet, catches it, but the brown ball retaliates, knocking him to the ground. He struggles with it and, with considerable effort, forces it back into the trunk, securing it with a strong chain. Oliver then hands Harry a tiny, delicate golden ball adorned with delicate, golden wings that spring out of the Snitch, fluttering gently above Harry's head. Meanwhile, Ron flicks his wand, followed by Hermione flicking her wand. A white feather gracefully rises from the desk and floats across the room towards the diminutive Professor Flitwick, who is perched atop a pile of books. Seamus' face is comically smudged with soot, and a smoldering feather descends onto the desk. As Hermione hurries past the courtyard, the Great Hall comes into view, magnificently lit with blazing torches. Candles flicker and glow warmly from the mouths of grinning pumpkins, which float serenely above the heads of the gathered students."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Harry makes a daring and bold attempt to grab hold of the Remembrall, yet Malfoy manages to cunningly spin out of his reach just in the nick of time. With all the strength he can muster, Malfoy hurls the Remembrall away from him with a powerful fling. The glass bowl pirouettes and spins multiple times through the open air as Harry expertly navigates his broomstick, soaring swiftly and gracefully towards an impressive and towering high stone structure. Upstairs in her study, Professor McGonagall observes Harry racing directly towards her window, and at the very last moment, just in time, he executes a flawless somersault, skillfully catching the Remembrall before he triumphantly tosses it back into the air. Professor McGonagall steps over to the window and gazes downward into the bustling courtyard below, where Harry makes his way back to the gathering of cheering, enthusiastic first-year students. Meanwhile, Malfoy and his group of cronies stand by, sniggering among themselves. Still holding tightly onto his trusty broomstick, Harry follows in the footsteps of Professor McGonagall, who strides with purpose towards them, eventually coming to a halt outside a classroom door. The twins are present as well, and Hermione, beaming with excitement, shows Harry a name on a Gryffindor trophy. They both ascend the stairs, and the staircase swings around dramatically to settle into a new position against the opposite wall. At the top of the stairs, Harry opens the door, and together they discover a statue that is cloaked in a thick veil of cobwebs. Suddenly, a torch flares up brightly, casting an illuminating light on the caretaker’s intimidating, red-eyed cat, which watches them intently as they sprint down a corridor bathed in light from torches. Harry struggles to manage the stubborn latch, and after taking out her wand, the door opens, allowing them to rush through hurriedly. Filch, the meticulous and watchful caretaker, holds up a lantern and peers around suspiciously, while in the center of the room stands a gigantic, menacing dog with three enormous heads, each one adorned with multiple sets of sharp, glistening teeth. The children hastily rush for the door, and one of the slobbering, enormous heads fills the entire doorway, but they manage to slam the door shut just in time. As daylight breaks over the horizon, Oliver and Harry are seen carrying a large and cumbersome trunk out into the expansive and picturesque school grounds. They set the heavy trunk down on the soft grass, and Oliver retrieves a large, vibrant red ball. Two brown balls, which are securely chained down, seem eager and ready to break free. Oliver hands Harry a sturdy wooden bat and then unchains one of the brown balls, which shoots straight up into the air, ascending far above their heads, almost disappearing from view. With precision and skill, Harry swings the bat and knocks the ball high into the sky, where it soars magnificently over the head of a statue perched on the battlements before the ball returns. Oliver, quick on his feet, catches it deftly, but the brown ball retaliates by knocking him to the ground. He struggles with it and, with considerable effort, forces it back into the trunk, securing it tightly with a strong chain. Oliver then hands Harry a tiny, delicate golden ball adorned with beautiful, delicate golden wings that spring out of the Snitch and flutter gently above Harry’s head. Meanwhile, Ron flicks his wand, followed by Hermione expertly flicking her wand. A white feather gracefully rises from the desk and elegantly floats across the room towards the diminutive Professor Flitwick, who is perched precariously atop a pile of books. Seamus’ face is comically smudged with soot, and a smoldering feather descends onto the desk. As Hermione hurries past the courtyard, the Great Hall comes into view, magnificently lit with blazing torches. Candles flicker and glow warmly from the mouths of grinning pumpkins, which float serenely above the heads of the gathered students."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Harry lunges forward, extending his arm in an attempt to grab the object, but Malfoy expertly twists his body, evading Harry's grasp. With a forceful motion, Malfoy hurls the Remembrall away, his arm swinging widely to send the glass sphere spinning through the air. As the Remembrall arches and twirls above, Harry navigates his broom with precision, skillfully guiding it to ascend rapidly towards a towering stone structure. Meanwhile, within her study high up in the building, Professor McGonagall catches sight of Harry approaching her window, his figure growing larger as he draws near. At the last moment, Harry executes a flawless somersault in mid-air, skillfully recalibrating his position to align with the flying object. With a deft motion, he extends his hand and captures the Remembrall securely, then, in a triumphant gesture, he tosses it back into the air. Professor McGonagall approaches the window, gazing down into the courtyard where Harry is reunited with the group of cheering first-year students, their joyful exclamations echoing, while nearby, Malfoy and his friends exchange mocking laughter. Still holding his broomstick, Harry follows closely behind Professor McGonagall as she strides purposefully towards them, the group halting outside a classroom door. The twins are present, and Hermione directs Harry's attention to a name displayed on a Gryffindor Trophy, inviting him to take a closer look. As they ascend the stairs, the staircase pivots unexpectedly, delivering them to a new position on the opposite wall. At the top of the stairs, Harry reaches out and pushes the door open, revealing a statue shrouded in cobwebs within the dimly lit space. At that moment, a torch flares to life, casting a flickering glow that illuminates the caretaker's ominous red-eyed cat, which watches them intently as they hurry down the torch-lit corridor. Harry struggles momentarily with the door latch, his fingers fumbling, until Hermione produces her wand, skillfully unlocking the door and allowing them to rush through the opening. Filch, the caretaker, raises a lantern, its light casting eerie shadows as he peers around with a suspicious gaze, while in the center of the room, a massive dog looms, its three heads each sporting a set of sharp, glistening teeth. The children sprint back to the door in a panicked frenzy, and one of the dog's enormous, drooling heads fills the doorway completely, but they manage to slam the door shut just in time. As daylight breaks, Oliver and Harry carry a large trunk out onto the school grounds, setting it down on the grass with a determined thud. Oliver retrieves a large, red ball from the trunk, and Harry watches as two brown balls, restrained by chains, struggle against their bindings. Handing Harry a wooden bat, Oliver releases one of the brown balls, which rockets skyward, soaring far beyond their heads until it is nearly out of view. Harry, seizing the opportunity, swings the bat with calculated force, sending the ball sailing high above a statue on the battlements before it returns towards them. Oliver catches the returning ball, but its impact knocks him to the ground. Wrestling with the ball, he eventually manages to overpower it, securing it back into the trunk and fastening it firmly with a robust chain. Turning his attention to Harry, Oliver presents him with a small, golden ball, its intricate golden wings unfurling as it flutters just above Harry's head. Meanwhile, in another setting, Ron and Hermione each flick their wands with a precise swish, causing a white feather to rise from the desk and float gracefully across the room towards the diminutive Professor Flitwick, who stands precariously on a pile of books to observe their progress. Elsewhere, Seamus's face is marred with black soot, a smoldering feather sinking onto the desk before him. Crossing the courtyard, Hermione moves swiftly, her pace brisk, while the Great Hall presents a captivating scene, illuminated by the warm glow of flaming torches. Overhead, candles flicker and emit a soft light from within grinning pumpkins that hover above the heads of the students."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Harry attempts to grab the Remembrall, but Malfoy evades him and throws it with force. As it spins through the air, Harry expertly maneuvers his broom towards a high tower where Professor McGonagall watches from her study. He performs a somersault to catch the Remembrall and celebrates by tossing it back into the air. McGonagall, observing from the window, sees Harry rejoin his cheering peers, while Malfoy and his friends laugh mockingly. Carrying his broomstick, Harry follows Professor McGonagall as she strides purposefully to a classroom, where the twins and Hermione point out a name on a Gryffindor Trophy. They ascend the staircase, which shifts, leading them to a cobweb-covered statue. As a torch flares, a red-eyed cat belonging to Filch watches them dash down the corridor. Struggling with the latch, Hermione uses her wand to unlock a door, and they rush through, just escaping Filch. Inside, they encounter a massive three-headed dog, narrowly avoiding its snapping jaws as they slam the door shut. \n\nWith daylight, Oliver and Harry carry a trunk onto the school grounds, where Oliver introduces Harry to the game equipment. He hands Harry a bat and unleashes a brown ball, which Harry hits into the air, sailing over a statue before Oliver catches it. The brown ball retaliates, knocking Oliver over, but he wrestles it back into the trunk, securing it. Oliver then gives Harry a golden snitch, which flutters above him. Meanwhile, in class, Ron and Hermione practice levitation spells, their success contrasting with Seamus' mishap as a smoldering feather falls onto his desk. Outside, Hermione hurries across the courtyard, where the Great Hall glows with torchlight and floating, candle-lit pumpkins, illuminating the students below."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Harry makes a grab but Malfoy, who is known for his cunning and quick reflexes as a Seeker for the Slytherin Quidditch team, spins out of reach, and Malfoy flings the Remembrall away with all his might. The glass bowl, designed to remind its owner of something forgotten by turning red, flies over and over in the air as Harry steers his Nimbus 2000 broom, a top-of-the-line racing broom known for its speed and agility, soaring towards a high stone tower at Hogwarts School of Witchcraft and Wizardry. Upstairs in her study, Professor McGonagall, the strict yet fair Head of Gryffindor House and Transfiguration teacher, sees Harry hackling towards her window, and just in time, he turns a neat somersault and catches the Remembrall, then tosses it victoriously into the air. Professor McGonagall steps to the window and looks down into the courtyard as Harry rejoins the cheering first-years, while Malfoy and his cronies, well-known troublemakers in Slytherin, snigger. Still carrying his broomstick, Harry trails after Professor McGonagall, who walks toward them purposefully, and stops outside a classroom where students eagerly await their lessons. The twins, Fred and George Weasley, are there, and Hermione shows Harry a name on a Gryffindor Trophy, which commemorates the house's many achievements in the school. They go upstairs, and the staircase, one of many magical staircases at Hogwarts that can shift positions unpredictably, swings into a different position on the opposite wall. Harry opens the door at the top of the stairs, and they see a statue covered in cobwebs, likely depicting one of the past founders or notable figures of the school. A torch flares, illuminating the dim corridor, and the caretaker's scary red-eyed cat, Mrs. Norris, known for her ability to detect students out of bed, watches them run down a torch-lit corridor. Harry struggles with the latch, and taking out her wand, Hermione, skilled in spells from her extensive reading, opens the door and they rush through. Filch, the caretaker, holds up a lantern and peers around suspiciously, while in the middle of the room is a gigantic dog with three enormous heads, known as Fluffy, who guards the trapdoor leading to a valuable secret. The children rush for the door, and one of the slobbering heads is so enormous, it completely fills the doorway, but they slam the door shut. Daylight comes, and Oliver Wood, captain of the Gryffindor Quidditch team, and Harry carry a trunk out into the school grounds. They set the trunk on the grass, and Oliver takes out a large, red ball, the Quaffle used in the wizarding sport Quidditch. Chained down, two brown balls known as Bludgers, which are enchanted to try and knock players off their brooms, struggle to escape. Oliver gives Harry a wooden bat, typically used by Beaters to defend their teammates from the Bludgers, and then unchains one of the brown balls, which shoots straight up, above their heads, almost out of sight. Harry swings the bat and knocks the ball high into the air, flying over the head of a statue, possibly of a former Hogwarts Headmaster, on the battlements before the ball returns. Oliver catches it, but the brown ball knocks him to the ground. He struggles with it and with great difficulty, forces it back into the trunk and fastens it down with a strong chain. He gives Harry a tiny, golden ball, the Golden Snitch, crucial to winning a Quidditch match by granting 150 points to the team whose Seeker catches it, with delicate, golden wings that spring out of the snitch, and it flutters above Harry's head. Ron, known for his strategic mind often tested in chess, flicks his wand, and Hermione, already adept in many spells from her incessant studying, flicks her wand. A white feather rises from the desk and floats across the room towards tiny Professor Flitwick, the Charms Master who is standing on a pile of books to see over his desk. Seamus' face is smudged with soot, the result of a spell gone wrong, and a smoldering feather sinks onto the desk. Crossing the courtyard, Hermione hurries past, while the Great Hall is lit with flaming torches, typical for the grand dining room during feasts, and candles flicker and glow from the mouths of grinning pumpkins, charmed to hover above the heads of the students, capturing the spirit of the Halloween festivities."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Upstairs in her study Professor McGonagall sees Harry hackling towards her window and just in time he turns a neat somersault and catches the Remembrall then tosses it victoriously into the air Harry makes a grab but Malfoy spins out of reach and Malfoy flings the Remembrall away with all his might A torch flares and the caretaker's scary redeyed cat watches them run down a torchlit corridor The glass bowl flies over and over in the air as Harry steers his broom soaring towards a high stone tower Oliver catches it but the brown ball knocks him to the ground Upstairs in her study Professor McGonagall sees Harry hackling towards her window and just in time he turns a neat somersault and catches the Remembrall then tosses it victoriously into the air Professor McGonagall steps to the window and looks down into the courtyard as Harry rejoins the cheering firstyears while Malfoy and his cronies snigger Still carrying his broomstick Harry trails after Professor McGonagall who walks toward them purposefully and stops outside a classroom Professor McGonagall steps to the window and looks down into the courtyard as Harry rejoins the cheering firstyears while Malfoy and his cronies snigger Harry makes a grab but Malfoy spins out of reach and Malfoy flings the Remembrall away with all his might The children rush for the door and one of the slobbering heads is so enormous it completely fills the doorway but they slam the door shut The twins are there and Hermione shows Harry a name on a Gryffindor Trophy They go upstairs and the staircase swings into a different position on the opposite wall Harry opens the door at the top of the stairs and they see a statue covered in cobwebs Harry opens the door at the top of the stairs and they see a statue covered in cobwebs A torch flares and the caretaker's scary redeyed cat watches them run down a torchlit corridor Still carrying his broomstick Harry trails after Professor McGonagall who walks toward them purposefully and stops outside a classroom Harry struggles with the latch and taking out her wand the door opens and they rush through two brown balls struggle to escape Filch Daylight comes and Oliver and Harry carry a trunk out into the school grounds the caretaker holds up a lantern and peers around suspiciously while in the middle of the room is a gigantic dog with three enormous heads and three sets of sharp glistening teeth Ron flicks his wand and Hermione flicks her wand The children rush for the door and one of the slobbering heads is so enormous it completely fills the doorway but they slam the door shut Daylight comes and Oliver and Harry carry a trunk out into the school grounds They set the trunk on the grass and Oliver takes out a large red ball Chained down A white feather rises from the desk and floats across the room towards tiny Professor Flitwick who is standing on a pile of books two brown balls struggle to escape Oliver gives Harry a wooden bat and then unchains one of the brown balls which shoots straight up above their heads almost out of sight Harry swings the bat and knocks the ball high into the air flying over the head of a statue on the battlements before the ball returns He struggles with it and with great difficulty forces it back into the trunk and fastens it down with a strong chain Seamus' face is smudged with soot and a smoldering feather sinks onto the desk Oliver catches it but the brown ball knocks him to the ground He struggles with it and with great difficulty forces it back into the trunk and fastens it down with a strong chain He gives Harry a tiny golden ball with delicate golden wings that spring out of the snitch and it flutters above Harry's head Ron flicks his wand and Hermione flicks her wand A white feather rises from the desk and floats across the room towards tiny Professor Flitwick who is standing on a pile of books Seamus' face is smudged with soot and a smoldering feather sinks onto the desk Crossing the courtyard Hermione hurries past while the Great Hall is lit with flaming torches and candles flicker and glow from the mouths of grinning pumpkins which float above the heads of the students"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Harry makes a grab but Malfoy spins out of reach and Malfoy flings the Remembrall away with all his might. The glass bowl flies over and over in the air as Harry steers his broom soaring towards a high stone tower. Upstairs in her study Professor McGonagall sees Harry hackling towards her window and just in time he turns a neat somersault and catches the Remembrall then tosses it victoriously into the air. Professor McGonagall steps to the window and looks down into the courtyard as Harry rejoins the cheering firstyears while Malfoy and his cronies snigger. Still carrying his broomstick Harry trails after Professor McGonagall who walks toward them purposefully and stops outside a classroom. The twins are there and Hermione shows Harry a name on a Gryffindor Trophy. They go upstairs and the staircase swings into a different position on the opposite wall. Harry opens the door at the top of the stairs and they see a statue covered in cobwebs. A torch flares and the caretaker's scary redeyed cat watches them run down a torchlit corridor. Harry struggles with the latch and taking out her wand. the door opens and they rush through. Filch. the caretaker holds up a lantern and peers around suspiciously while in the middle of the room is a gigantic dog with three enormous heads and three sets of sharp glistening teeth. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. The children rush for the door and one of the slobbering heads is so enormous it completely fills the doorway but they slam the door shut. Daylight comes and Oliver and Harry carry a trunk out into the school grounds. They set the trunk on the grass and Oliver takes out a large red ball. Chained down. two brown balls struggle to escape. Oliver gives Harry a wooden bat and then unchains one of the brown balls which shoots straight up above their heads almost out of sight. Harry swings the bat and knocks the ball high into the air flying over the head of a statue on the battlements before the ball returns. Oliver catches it but the brown ball knocks him to the ground. He struggles with it and with great difficulty forces it back into the trunk and fastens it down with a strong chain. He gives Harry a tiny golden ball with delicate golden wings that spring out of the snitch and it flutters above Harry's head. Ron flicks his wand and Hermione flicks her wand. A white feather rises from the desk and floats across the room towards tiny Professor Flitwick who is standing on a pile of books. Seamus' face is smudged with soot and a smoldering feather sinks onto the desk. Crossing the courtyard Hermione hurries past while the Great Hall is lit with flaming torches and candles flicker and glow from the mouths of grinning pumpkins which float above the heads of the students."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Harry makes a grab but Malfoy spins out of reach and Malfoy flings the Remembrall away with all his might. The glass bowl flies over and over in the air as Harry steers his broom soaring towards a high stone tower. Upstairs in her study Professor McGonagall sees Harry hackling towards her window and just in time he turns a neat somersault and catches the Remembrall then tosses it victoriously into the air. Professor McGonagall steps to the window and looks down into the courtyard as Harry rejoins the cheering firstyears while Malfoy and his cronies snigger. Still carrying his broomstick Harry trails after Professor McGonagall who walks toward them purposefully and stops outside a classroom. The twins are there and Hermione shows Harry a name on a Gryffindor Trophy. They go upstairs and the staircase swings into a different position on the opposite wall. Harry opens the door at the top of the stairs and they see a statue covered in cobwebs. A torch flares and the caretaker's scary redeyed cat watches them run down a torchlit corridor. Harry struggles with the latch and taking out her wand. the door opens and they rush through. Filch. the caretaker holds up a lantern and peers around suspiciously while in the middle of the room is a gigantic dog with three enormous heads and three sets of sharp glistening teeth. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. The children rush for the door and one of the slobbering heads is so enormous it completely fills the doorway but they slam the door shut. Daylight comes and Oliver and Harry carry a trunk out into the school grounds. They set the trunk on the grass and Oliver takes out a large red ball. Chained down. two brown balls struggle to escape. Oliver gives Harry a wooden bat and then unchains one of the brown balls which shoots straight up above their heads almost out of sight. Harry swings the bat and knocks the ball high into the air flying over the head of a statue on the battlements before the ball returns. Oliver catches it but the brown ball knocks him to the ground. He struggles with it and with great difficulty forces it back into the trunk and fastens it down with a strong chain. He gives Harry a tiny golden ball with delicate golden wings that spring out of the snitch and it flutters above Harry's head. Ron flicks his wand and Hermione flicks her wand. A white feather rises from the desk and floats across the room towards tiny Professor Flitwick who is standing on a pile of books. Seamus' face is smudged with soot and a smoldering feather sinks onto the desk. Crossing the courtyard Hermione hurries past while the Great Hall is lit with flaming torches and candles flicker and glow from the mouths of grinning pumpkins which float above the heads of the students."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Harry makes a grab but Malfoy spins out of reach and Malfoy flings the Remembrall away with all his might. The glass bowl flies over and over in the air as Harry steers his broom soaring towards a high stone tower. Upstairs in her study Professor McGonagall sees Harry hackling towards her window and just in time he turns a neat somersault and catches the Remembrall then tosses it victoriously into the air. Professor McGonagall steps to the window and looks down into the courtyard as Harry rejoins the cheering firstyears while Malfoy and his cronies snigger. Still carrying his broomstick Harry trails after Professor McGonagall who walks toward them purposefully and stops outside a classroom. The twins are there and Hermione shows Harry a name on a Gryffindor Trophy. They go upstairs and the staircase swings into a different position on the opposite wall. Oliver catches it but the brown ball knocks him to the ground. He struggles with it and with great difficulty forces it back into the trunk and fastens it down with a strong chain. He gives Harry a tiny golden ball with delicate golden wings that spring out of the snitch and it flutters above Harry's head. Ron flicks his wand and Hermione flicks her wand. A white feather rises from the desk and floats across the room towards tiny Professor Flitwick who is standing on a pile of books. Seamus' face is smudged with soot and a smoldering feather sinks onto the desk. Crossing the courtyard Hermione hurries past while the Great Hall is lit with flaming torches and candles flicker and glow from the mouths of grinning pumpkins which float above the heads of the students."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Harry makes a grab but Malfoy spins out of reach and Malfoy flings the Remembrall away with all his might. The glass bowl flies over and over in the air as Harry steers his broom soaring towards a high stone tower. Upstairs in her study Professor McGonagall sees Harry hackling towards her window and just in time he turns a neat somersault and catches the Remembrall then tosses it victoriously into the air. A white feather rises from the desk and floats across the room towards tiny Professor Flitwick who is standing on a pile of books. Seamus' face is smudged with soot and a smoldering feather sinks onto the desk. Crossing the courtyard Hermione hurries past while the Great Hall is lit with flaming torches and candles flicker and glow from the mouths of grinning pumpkins which float above the heads of the students."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The dragon makes a grab but the owl spins out of reach, and the owl flings the Remembrall away with all its might. The glass bowl flies over and over in the air as the horse steers its broom, soaring towards a high stone tower. Upstairs in her study, the mermaid sees the horse hackling towards her window, and just in time, it turns a neat somersault and catches the Remembrall, then tosses it victoriously into the air. The mermaid steps to the window and looks down into the courtyard as the horse rejoins the cheering first-years, while the owl and its cronies snigger. Still carrying its broomstick, the horse trails after the mermaid, who walks toward them purposefully and stops outside a classroom. The penguins are there, and the unicorn shows the horse a name on a Gryffindor Trophy. They go upstairs, and the staircase swings into a different position on the opposite wall. The horse opens the door at the top of the stairs, and they see a statue covered in cobwebs. A torch flares, and the gardener's scary red-eyed cat watches them run down a torch-lit corridor. The horse struggles with the latch, and taking out her wand, the door opens and they rush through. The knight, the caretaker, holds up a lantern and peers around suspiciously, while in the middle of the room is a gigantic dog with three enormous heads and three sets of sharp, glistening teeth. The children rush for the door, and one of the slobbering heads is so enormous, it completely fills the doorway, but they slam the door shut. Daylight comes, and the phoenix and the horse carry a trunk out into the school grounds. They set the trunk on the grass, and the phoenix takes out a large, red ball. Chained down, two brown balls struggle to escape. The phoenix gives the horse a wooden bat and then unchains one of the brown balls, which shoots straight up, above their heads, almost out of sight. The horse swings the bat and knocks the ball high into the air, flying over the head of a statue on the battlements before the ball returns. The phoenix catches it, but the brown ball knocks it to the ground. It struggles with it and with great difficulty, forces it back into the trunk and fastens it down with a strong chain. It gives the horse a tiny, golden ball with delicate, golden wings that spring out of the snitch, and it flutters above the horse's head. The rabbit flicks its wand, and the lion flicks its wand. A white feather rises from the desk and floats across the room towards tiny the fairy, who is standing on a pile of books. The troll's face is smudged with soot, and a smoldering feather sinks onto the desk. Crossing the courtyard, the kangaroo hurries past, while the Great Hall is lit with flaming torches, and candles flicker and glow from the mouths of grinning pumpkins, which float above the heads of the students."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Harry makes a grab but Malfoy spins out of reach, and Malfoy flings the pebble away with all his might. The ceramic plate flies over and over in the air as Harry steers his skateboard, soaring towards a high wooden fence. Upstairs in her studio, Professor McGonagall sees Harry hackling towards her window, and just in time, he turns a neat somersault and catches the pebble, then tosses it victoriously into the air. Professor McGonagall steps to the window and looks down into the garden as Harry rejoins the cheering first-years, while Malfoy and his cronies snigger. Still carrying his skateboard, Harry trails after Professor McGonagall, who walks toward them, purposefully, and stops outside a library. The twins are there, and Hermione shows Harry a name on a Gryffindor Banner. They go upstairs, and the staircase swings into a different position on the opposite wall. Harry opens the door at the top of the stairs, and they see a painting covered in vines. A candle flares, and the caretaker's scary red-eyed rat watches them run down a candle-lit hallway. Harry struggles with the latch, and taking out her wand, the door opens and they rush through. Filch, the caretaker, holds up a flashlight and peers around suspiciously, while in the middle of the room is a gigantic pig with three enormous snouts and three sets of sharp, glistening tusks. The children rush for the door, and one of the slobbering snouts is so enormous, it completely fills the doorway, but they slam the door shut. Daylight comes, and Oliver and Harry carry a suitcase out into the school fields. They set the suitcase on the grass, and Oliver takes out a large, blue balloon. Chained down, two gray balloons struggle to escape. Oliver gives Harry a wooden racket and then unchains one of the gray balloons, which shoots straight up, above their heads, almost out of sight. Harry swings the racket and knocks the balloon high into the air, flying over the head of a sculpture on the battlements before the balloon returns. Oliver catches it, but the gray balloon knocks him to the ground. He struggles with it and with great difficulty, forces it back into the suitcase and fastens it down with a strong belt. He gives Harry a tiny, silver marble with delicate, silver propellers that spring out of the marble, and it flutters above Harry's head. Ron flicks his wand, and Hermione flicks her wand. A white leaf rises from the desk and floats across the room towards tiny Professor Flitwick, who is standing on a pile of cushions. Seamus' face is smudged with soot, and a smoldering leaf sinks onto the desk. Crossing the courtyard, Hermione hurries past, while the Great Hall is lit with flaming lanterns, and candles flicker and glow from the mouths of grinning cauldrons, which float above the heads of the students."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Harry attempts a vault but Malfoy slides out of grasp, and Malfoy hurls the Remembrall aside with all his strength. The glass bowl drifts over and over in the air as Harry propels his broom, gliding towards a high stone tower. Upstairs in her study, Professor McGonagall observes Harry tumbling towards her window, and just in time, he executes a neat cartwheel and snatches the Remembrall, then flips it triumphantly into the air. Professor McGonagall strolls to the window and peers down into the courtyard as Harry reunites with the cheering first-years, while Malfoy and his cronies chuckle. Still holding his broomstick, Harry parades after Professor McGonagall, who strides toward them, deliberately, and halts outside a classroom. The twins are there, and Hermione reveals to Harry a name on a Gryffindor Trophy. They ascend upstairs, and the staircase pivots into a different position on the opposite wall. Harry closes the door at the top of the stairs, and they encounter a statue draped in cobwebs. A torch ignites, and the caretaker's menacing red-eyed cat observes them dash down a torch-lit corridor. Harry tussles with the latch, and drawing out her wand, the door swings open and they bolt through. Filch, the caretaker, raises a lantern and inspects around suspiciously, while in the center of the room is a gigantic dog with three enormous heads and three sets of sharp, glistening teeth. The children dash for the door, and one of the drooling heads is so immense, it entirely fills the doorway, but they shut the door. Daylight arrives, and Oliver and Harry heave a trunk out into the school grounds. They place the trunk on the grass, and Oliver extracts a large, red ball. Chained down, two brown balls resist to break free. Oliver hands Harry a wooden bat and then releases one of the brown balls, which zooms straight up, above their heads, nearly out of sight. Harry strikes the bat and propels the ball high into the air, soaring over the head of a statue on the battlements before the ball returns. Oliver snatches it, but the brown ball topples him to the ground. He wrestles with it and with substantial effort, maneuvers it back into the trunk and secures it with a strong chain. He hands Harry a tiny, golden ball with delicate, golden wings that unfurl from the snitch, and it quivers above Harry's head. Ron flicks his wand, and Hermione twirls her wand. A white feather ascends from the desk and drifts across the room towards tiny Professor Flitwick, who is perched on a pile of books. Seamus' face is streaked with soot, and a smoldering feather descends onto the desk. Crossing the courtyard, Hermione scurries past, while the Great Hall is illuminated with blazing torches, and candles dance and shimmer from the mouths of grinning pumpkins, which drift above the heads of the students."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Jerry makes a grab but Fergus spins out of reach, and Fergus flings the snowglobe away with all his might. The ceramic vase flies over and over in the air as Jerry steers his skateboard, soaring towards a high wooden treehouse. Upstairs in her office, Principal Thompson sees Jerry cartwheeling towards her skylight, and just in time, he turns a neat somersault and catches the snowglobe, then tosses it victoriously into the air. Principal Thompson steps to the skylight and looks down into the park as Jerry rejoins the cheering toddlers, while Fergus and his buddies chuckle. Still carrying his skateboard, Jerry trails after Principal Thompson, who walks toward them, purposefully, and stops outside a library. The siblings are there, and Alice shows Jerry a name on a Ravenclaw Plaque. They go upstairs, and the escalator swings into a different position on the opposite wall. Jerry opens the hatch at the top of the stairs, and they see a mannequin covered in dust. A candle flares, and the janitor's spooky green-eyed owl watches them run down a candle-lit passageway. Jerry struggles with the hinge, and taking out her flute, the hatch opens and they rush through. Clark, the janitor, holds up a flashlight and peers around suspiciously, while in the middle of the attic is a gigantic dragon with three enormous heads and three sets of sharp, glistening claws. The kids rush for the hatch, and one of the growling heads is so enormous, it completely fills the archway, but they slam the hatch shut. Morning comes, and Wallace and Jerry carry a suitcase out into the playground. They set the suitcase on the sand, and Wallace takes out a large, blue frisbee. Chained down, two green frisbees struggle to escape. Wallace gives Jerry a plastic paddle and then unchains one of the green frisbees, which shoots straight up, above their heads, almost out of sight. Jerry swings the paddle and knocks the frisbee high into the air, flying over the head of a scarecrow on the parapets before the frisbee returns. Wallace catches it, but the green frisbee knocks him to the ground. He struggles with it and with great difficulty, forces it back into the suitcase and fastens it down with a strong rope. He gives Jerry a tiny, silver ball with delicate, silver fins that spring out of the orb, and it flutters above Jerry's head. Sam flicks his drumstick, and Alice flicks her drumstick. A white pebble rises from the bench and floats across the room towards tiny Librarian Kendrick, who is standing on a stack of papers. Owen's face is smudged with chalk, and a smoldering pebble sinks onto the bench. Crossing the meadow, Alice hurries past, while the Dining Room is lit with flaming bonfires, and lanterns flicker and glow from the mouths of grinning jack-o'-lanterns, which float above the heads of the diners."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "George attempts a leap but Neville pirouettes out of sight, and Neville hurls the Remembrall aside with all his energy. The glass vase twirls around and around in the sky as George navigates his skateboard, gliding toward a tall marble statue. Downstairs in his workshop, Mr. Filch observes George sneaking towards his doorway, and just in time, he executes a perfect backflip and retrieves the Remembrall, then swings it triumphantly into the sky. Mr. Filch saunters to the doorway and peers down into the garden as George reunites with the applauding second-years, while Neville and his pals chuckle. Still gripping his skateboard, George ambles after Mr. Filch, who strides toward them, determinedly, and halts outside a library. The triplets are there, and Luna shows George a title on a Hufflepuff Plaque. They descend downstairs, and the stairwell swivels into another position on the adjacent wall. George pushes the door at the base of the stairs, and they spot a painting draped in dust. A lantern blazes, and the gardener's eerie green-eyed owl scrutinizes them trot down a lantern-lit hallway. George battles with the knob, and taking out his broom, the gate opens and they dash through. Madam Hooch, the gardener, raises a flashlight and scans around warily, while in the center of the chamber is a massive cat with three colossal heads and three sets of fierce, gleaming eyes. The teenagers bolt for the gate, and one of the drooling heads is so gigantic, it entirely fills the entrance, but they latch the gate closed. Nightfall descends, and Percy and George hoist a suitcase out into the school park. They place the suitcase on the soil, and Percy extracts a large, green ball. Tethered firmly, two gray balls wrestle to break free. Percy hands George a metal racket and then unleashes one of the gray balls, which zooms straight down, beneath their feet, nearly below sight. George swings the racket and propels the ball low into the earth, skidding past the ankle of a sculpture on the ramparts before the ball rebounds. Percy snatches it, but the gray ball shoves him to the ground. He grapples with it and with substantial effort, locks it back into the suitcase and secures it down with a heavy cord. He hands George a small, silver cube with slender, silver chains that spring out of the snitch, and it dances around George's feet. Ginny snaps her fingers, and Luna snaps her fingers. A blue feather floats from the drawer and drifts across the chamber towards tiny Madam Pomfrey, who is perching on a stack of papers. Dean's hair is dusted with flour, and a smoldering book slips onto the drawer. Entering the kitchen, Luna strolls past, while the Great Library is illuminated with glowing lanterns, and lanterns sparkle and flicker from the faces of smiling jack-o'-lanterns, which hover below the feet of the teachers."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Harry attempts a snatch but Malfoy swerves out of grasp, and Malfoy hurls the teapot away with all his strength. The porcelain cup sails around and around in the sky as Harry directs his kite, gliding towards a tall brick chimney. Upstairs in her parlor, Professor McGonagall sees Harry giggling towards her balcony, and just in time, he performs a neat cartwheel and snatches the teapot, then hurls it triumphantly into the sky. Professor McGonagall walks to the balcony and peers down into the garden as Harry reunites with the applauding second-years, while Malfoy and his followers chuckle. Still clutching his kite, Harry ambles after Professor McGonagall, who strides towards them, decisively, and halts outside a cafeteria. The twins are there, and Hermione points Harry to a name on a Ravenclaw Plaque. They descend the stairs, and the hallway rotates to a new position on the adjacent wall. Harry pushes the gate at the base of the stairs, and they discover a sculpture draped in vines. A lantern flickers, and the gardener's eerie yellow-eyed owl observes them hurry down a torch-lined passage. Harry wrestles with the handle, and taking out her quill, the gate swings open and they dash through. Filch, the gardener, lifts a lamp and glances around suspiciously, while in the center of the chamber is a massive lizard with two enormous tails and two rows of sharp, gleaming scales. The children rush for the gate, and one of the drooling tails is so vast, it completely fills the threshold, but they slam the gate. Morning appears, and Oliver and Harry haul a suitcase out into the school meadow. They place the suitcase on the dirt, and Oliver pulls out a large, blue globe. Anchored down, three green cubes squirm to break free. Oliver hands Harry a plastic hammer and then unchains one of the green cubes, which darts straight down, beneath their feet, almost out of reach. Harry swings the hammer and bats the cube low into the meadow, darting beneath the feet of a monument on the ramparts before the cube returns. Oliver grabs it, but the green cube tips him to the ceiling. He wrestles with it and with much effort, maneuvers it back into the suitcase and seals it with a slender rope. He hands Harry a tiny, silver cube with delicate, silver strings that spring out of the trinket, and it flutters above Harry's feet. Ron taps his pen, and Hermione taps her pen. A black newspaper rises from the shelf and drifts across the chamber towards tiny Professor Flitwick, who is standing on a stack of cushions. Seamus' hair is spattered with dust, and a smoldering newspaper rests onto the shelf. Crossing the park, Hermione hurries past, while the Dining Room is lit with flickering lamps, and lanterns flicker and shimmer from the tails of laughing witches, which hover above the hands of the guests."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Georgina attempts a dive but Carl swerves out of vicinity, and Carl lobs the maraca aside with all his strength. The ceramic vase tumbles over and over in the breeze as Georgina maneuvers her skateboard, gliding towards a towering metal chimney. Downstairs in his lab, Dr. Johansson spots Georgina cackling towards his porthole, and just in time, she spins a graceful pirouette and snags the maraca, then hurls it triumphantly into the atmosphere. Dr. Johansson strides to the porthole and peers up into the orchard as Georgina rejoins the applauding second-graders, while Carl and his buddies guffaw. Still grasping her scooter, Georgina drifts after Dr. Johansson, who marches towards them, determinedly, and halts beside a library. The siblings are there, and Eleanor points Georgina to a title on a Hufflepuff Plaque. They descend downstairs, and the escalator revolves into a separate position on the adjacent ceiling. Georgina closes the hatch at the foot of the ladder, and they glimpse a mural blanketed in moss. A lantern flickers, and the janitor's eerie green-eyed owl watches them sprint down a lantern-lit hallway. Georgina wrestles with the hinge, and lifting out his staff, the wall swings open and they dash through. Sam, the janitor, holds up a flashlight and gazes around cautiously, while in the center of the chamber is a colossal bird with three gigantic wings and three rows of blunt, dazzling beaks. The youngsters dash for the window, and one of the squawking wings is so huge, it entirely blocks the entrance, but they bolt the window closed. Nighttime descends, and Liam and Georgina lug a suitcase across the courtyard. They position the suitcase on the concrete, and Liam extracts a massive, blue box. Anchored down, two green boxes yearn to flee. Liam hands Georgina a metal stick and then unhooks one of the green boxes, which rockets straight down, below their feet, almost out of reach. Georgina hurls the stick and smacks the box deep into the ocean, swimming under the foot of a painting on the gallery before the box rebounds. Liam snatches it, but the green box topples him to the ceiling. He grapples with it and with tremendous effort, confines it back into the suitcase and locks it up with a weak rope. He hands Georgina a large, bronze coin with tiny, bronze strings that pop out of the penny, and it flits beneath Georgina's feet. George taps his pencil, and Eleanor taps her pencil. A red scarf lifts from the floor and drifts over the yard towards large Professor Vickers, who is sitting in a stack of scrolls. Neil's shirt is stained with paint, and a scorching scarf drops onto the floor. Hovering in the hallway, Eleanor races forward, while the Cafeteria is illuminated with shimmering lamps, and fireworks twinkle and glisten from the eyes of scowling dragons, which soar beneath the feet of the teachers."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Harry tries to catch the Remembrall, but Malfoy snatches it and throws it. Chasing after it on his broom, Harry catches it near Professor McGonagall's window, impressing her. Harry later follows her inside, where Hermione shows him a Gryffindor trophy. They explore a shifting staircase and discover a statue covered in cobwebs, only to be watched by a caretaker’s eerie cat. They rush through a door, encountering a giant three-headed dog, barely escaping. Oliver trains Harry with a flying ball and wooden bat, leading to a practice session with a golden snitch. In class, Hermione levitates a feather successfully with her wand, while Seamus struggles and causes an explosion. Outside, Hermione hurries past, and the Great Hall is decorated with floating pumpkins and candles."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Crossing the courtyard Hermione hurries past while the Great Hall is lit with flaming torches and candles flicker and glow from the mouths of grinning pumpkins which float above the heads of the students Seamus' face is smudged with soot and a smoldering feather sinks onto the desk A white feather rises from the desk and floats across the room towards tiny Professor Flitwick who is standing on a pile of books Ron flicks his wand and Hermione flicks her wand He gives Harry a tiny golden ball with delicate golden wings that spring out of the snitch and it flutters above Harry's head He struggles with it and with great difficulty forces it back into the trunk and fastens it down with a strong chain Oliver catches it but the brown ball knocks him to the ground Harry swings the bat and knocks the ball high into the air flying over the head of a statue on the battlements before the ball returns Oliver gives Harry a wooden bat and then unchains one of the brown balls which shoots straight up above their heads almost out of sight two brown balls struggle to escape Chained down They set the trunk on the grass and Oliver takes out a large red ball Daylight comes and Oliver and Harry carry a trunk out into the school grounds The children rush for the door and one of the slobbering heads is so enormous it completely fills the doorway but they slam the door shut the caretaker holds up a lantern and peers around suspiciously while in the middle of the room is a gigantic dog with three enormous heads and three sets of sharp glistening teeth Filch the door opens and they rush through Harry struggles with the latch and taking out her wand A torch flares and the caretaker's scary redeyed cat watches them run down a torchlit corridor Harry opens the door at the top of the stairs and they see a statue covered in cobwebs They go upstairs and the staircase swings into a different position on the opposite wall The twins are there and Hermione shows Harry a name on a Gryffindor Trophy Still carrying his broomstick Harry trails after Professor McGonagall who walks toward them purposefully and stops outside a classroom Professor McGonagall steps to the window and looks down into the courtyard as Harry rejoins the cheering firstyears while Malfoy and his cronies snigger Upstairs in her study Professor McGonagall sees Harry hackling towards her window and just in time he turns a neat somersault and catches the Remembrall then tosses it victoriously into the air The glass bowl flies over and over in the air as Harry steers his broom soaring towards a high stone tower Harry makes a grab but Malfoy spins out of reach and Malfoy flings the Remembrall away with all his might"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Chained down the caretaker holds up a lantern and peers around suspiciously while in the middle of the room is a gigantic dog with three enormous heads and three sets of sharp glistening teeth Harry struggles with the latch and taking out her wand Crossing the courtyard Hermione hurries past while the Great Hall is lit with flaming torches and candles flicker and glow from the mouths of grinning pumpkins which float above the heads of the students Harry swings the bat and knocks the ball high into the air flying over the head of a statue on the battlements before the ball returns They go upstairs and the staircase swings into a different position on the opposite wall The twins are there and Hermione shows Harry a name on a Gryffindor Trophy the door opens and they rush through They set the trunk on the grass and Oliver takes out a large red ball He gives Harry a tiny golden ball with delicate golden wings that spring out of the snitch and it flutters above Harry's head Filch Oliver gives Harry a wooden bat and then unchains one of the brown balls which shoots straight up above their heads almost out of sight The glass bowl flies over and over in the air as Harry steers his broom soaring towards a high stone tower Daylight comes and Oliver and Harry carry a trunk out into the school grounds A white feather rises from the desk and floats across the room towards tiny Professor Flitwick who is standing on a pile of books The children rush for the door and one of the slobbering heads is so enormous it completely fills the doorway but they slam the door shut Upstairs in her study Professor McGonagall sees Harry hackling towards her window and just in time he turns a neat somersault and catches the Remembrall then tosses it victoriously into the air two brown balls struggle to escape Seamus' face is smudged with soot and a smoldering feather sinks onto the desk Still carrying his broomstick Harry trails after Professor McGonagall who walks toward them purposefully and stops outside a classroom He struggles with it and with great difficulty forces it back into the trunk and fastens it down with a strong chain Harry opens the door at the top of the stairs and they see a statue covered in cobwebs A torch flares and the caretaker's scary redeyed cat watches them run down a torchlit corridor Ron flicks his wand and Hermione flicks her wand Harry makes a grab but Malfoy spins out of reach and Malfoy flings the Remembrall away with all his might Professor McGonagall steps to the window and looks down into the courtyard as Harry rejoins the cheering firstyears while Malfoy and his cronies snigger Oliver catches it but the brown ball knocks him to the ground"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Daylight comes and Oliver and Harry carry a trunk out into the school grounds They set the trunk on the grass and Oliver takes out a large red ball Chained down two brown balls struggle to escape Oliver gives Harry a wooden bat and then unchains one of the brown balls which shoots straight up above their heads almost out of sight Harry swings the bat and knocks the ball high into the air flying over the head of a statue on the battlements before the ball returns Oliver catches it but the brown ball knocks him to the ground He struggles with it and with great difficulty forces it back into the trunk and fastens it down with a strong chain He gives Harry a tiny golden ball with delicate golden wings that spring out of the snitch and it flutters above Harry's head Ron flicks his wand and Hermione flicks her wand A white feather rises from the desk and floats across the room towards tiny Professor Flitwick who is standing on a pile of books Seamus' face is smudged with soot and a smoldering feather sinks onto the desk Crossing the courtyard Hermione hurries past while the Great Hall is lit with flaming torches and candles flicker and glow from the mouths of grinning pumpkins which float above the heads of the students Harry makes a grab but Malfoy spins out of reach and Malfoy flings the Remembrall away with all his might The glass bowl flies over and over in the air as Harry steers his broom soaring towards a high stone tower Upstairs in her study Professor McGonagall sees Harry hackling towards her window and just in time he turns a neat somersault and catches the Remembrall then tosses it victoriously into the air Professor McGonagall steps to the window and looks down into the courtyard as Harry rejoins the cheering firstyears while Malfoy and his cronies snigger Still carrying his broomstick Harry trails after Professor McGonagall who walks toward them purposefully and stops outside a classroom The twins are there and Hermione shows Harry a name on a Gryffindor Trophy They go upstairs and the staircase swings into a different position on the opposite wall Harry opens the door at the top of the stairs and they see a statue covered in cobwebs A torch flares and the caretaker's scary redeyed cat watches them run down a torchlit corridor Harry struggles with the latch and taking out her wand the door opens and they rush through Filch the caretaker holds up a lantern and peers around suspiciously while in the middle of the room is a gigantic dog with three enormous heads and three sets of sharp glistening teeth The children rush for the door and one of the slobbering heads is so enormous it completely fills the doorway but they slam the door shut"
        }
      ]
    }
  ]
}