{
  "ground_truth": "Marley's lying next to Connor, and Marley watches him leave and settles back down next to the sleeping lad. He leaves the editor's glass-fronted office, and the children are playing ball in the garden with Jenny when John arrives home. The kids, Jenny, and Marley tackle him to the ground, and John, the boys, and Marley head back to the house. Marley is having difficulty getting up the steps and later falls asleep in the dining room. The windy dog gets up and trots out, prompting John to put on a coat and go back outside. They use torches to search the rainy night, and Jenny switches the light on in the barn. The children are gathered together at a window, and she picks up Colleen with a reassuring smile. Patrick glumly follows his mother as John continues to search outside and walks down the drive towards the post box by the roadside. He flashes the torch around and spots Marley lying by a tree, and the dog whines as John touches his belly. A white-coated vet washes her hands, and close to tears, John leaves the surgery. He steps out onto the street, shrugging on his jacket, and walks, shoulders slumped, towards the car. He puts the key in the door, puts his hands on his hips, and sighs. Later, he arrives home, and she looks at the scrapbook and grins. Resting his cheek on his right hand, John doesn't look at her and examines his other hand, distractedly. Jenny puts an arm around him as he stares at the scrapbook of pasted-in columns. Morning sun shines on the big stone house, and John's asleep, slumped over the scrapbook. He turns to Jenny and smiles, while she slumps against a door frame in relief. Marley bounds across the large lawn and sits down by the road. As the school bus approaches, Marley trots up to the bus as Patrick and Connor get off, and Marley joins in the race. John and Billy walk through town past the tall clock tower of City Hall, and Sebastian and John grin broadly at one another. John looks back as they part, and Sebastian approaches two women. John drops his bag on a chair by the front door near to a baby grand piano, and there's a note on the dining room table. Marley's knocked over the dustbin in the kitchen and is having a feast, so he picks up the bin, and they go for a walk through a sunny meadow bordered by trees with golden autumnal leaves. Marley trots along beside John, who has his hands thrust in his pockets, and they sit down together on the path. John strokes Marley and studies his old friend, and the dog turns and looks at him. They sit, side by side, in the golden evening sun, looking out over the lush valley.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Marley's reclining adjacent to Connor, and Marley observes him depart and settles back down beside the slumbering youth. He departs the editor's glass-fronted office, and the youngsters are tossing ball in the yard with Jenny when John arrives home. The kids, Jenny, and Marley tackle him to the earth, and John, the boys, and Marley head back to the abode. Marley is having trouble ascending the steps and afterward dozes off in the dining room. The breezy canine rises and trots out, prompting John to put on a coat and go back outside. They use flashlights to search the rainy night, and Jenny switches the light on in the barn. The children are gathered together at a window, and she picks up Colleen with a comforting smile. Patrick morosely follows his mother as John continues to search outside and walks down the drive towards the post box by the roadside. He shines the flashlight around and spots Marley lying by a tree, and the dog whimpers as John touches his abdomen. A white-coated veterinarian washes her hands, and close to tears, John leaves the clinic. He steps out onto the street, shrugging on his jacket, and walks, shoulders slumped, towards the auto. He puts the key in the door, puts his hands on his hips, and sighs. Later, he arrives home, and she looks at the scrapbook and beams. Resting his cheek on his right hand, John doesn't look at her and examines his other hand, distractedly. Jenny puts an arm around him as he stares at the scrapbook of pasted-in articles. Morning sun gleams on the large stone house, and John's asleep, slumped over the scrapbook. He turns to Jenny and smiles, while she slumps against a door frame in relief. Marley bounds across the vast lawn and sits down by the road. As the school bus nears, Marley trots up to the bus as Patrick and Connor get off, and Marley joins in the race. John and Billy stroll through town past the tall clock tower of City Hall, and Sebastian and John grin broadly at one another. John looks back as they part, and Sebastian approaches two women. John drops his bag on a chair by the front door near to a baby grand piano, and there's a note on the dining room table. Marley's knocked over the trash can in the kitchen and is having a feast, so he picks up the can, and they go for a walk through a sunny meadow bordered by trees with golden autumnal leaves. Marley trots along beside John, who has his hands thrust in his pockets, and they sit down together on the path. John caresses Marley and studies his old companion, and the dog turns and looks at him. They sit, side by side, in the golden evening sun, looking out over the lush valley."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Connor is being lied next to by Marley, and as Marley watches him leave, he is settled back down by Marley next to the sleeping lad. The editor's glass-fronted office is left by him, and when John arrives home, ball is being played by the children in the garden with Jenny. John is tackled to the ground by the kids, Jenny, and Marley, and the house is headed back to by John, the boys, and Marley. Difficulty is being had by Marley getting up the steps, and later the dining room is fallen asleep in by him. The windy dog is prompted to get up and trot out, prompting John to put on a coat and go back outside. Torches are used to search the rainy night, and the barn light is switched on by Jenny. The children gather together at a window, and Colleen is picked up by her with a reassuring smile. Patrick glumly follows his mother as outside is continued to be searched by John, and the drive is walked down towards the post box by the roadside. The torch is flashed around by him, and Marley is spotted by him lying by a tree, and when his belly is touched by John, the dog whines. Her hands are washed by a white-coated vet, and the surgery is left by John, close to tears. The street is stepped out onto by him, shrugging on his jacket, and shoulders slumped, he walks towards the car. The key is put in the door by him, and then, hands are put on his hips by him, and he sighs. Later, home is arrived at by him, and the scrapbook is looked at by her, and she grins. His cheek is rested on his right hand by John, who doesn't look at her, and his other hand is examined by him, distractedly. An arm is put around him by Jenny as the scrapbook of pasted-in columns is stared at by him. On the big stone house, the morning sun shines, and the scrapbook is slumped over by a sleeping John. He smiles at Jenny while she, in relief, slumps against a door frame. Across the large lawn, Marley bounds and sits down by the road. As the school bus approaches, Marley is trotted up to by him, and Patrick and Connor get off, joining Marley in the race. Through town past the tall clock tower of City Hall, John and Billy walk, and Sebastian and John grin broadly at one another. As they part, a look back is given by John, and two women are approached by Sebastian. By the front door near to a baby grand piano, his bag is dropped by John on a chair, and on the dining room table, there's a note. In the kitchen, the dustbin has been knocked over by Marley and a feast is being had by him, so the bin is picked up by him, and a walk is taken by them through a sunny meadow bordered by trees with golden autumnal leaves. John thrusts his hands in his pockets and trots along Marley beside him, and they sit down together on the path. Marley is stroked by John, who studies his old friend, and Marley turns and looks at him. They sit, side by side, in the golden evening sun, looking out over the lush valley."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Marley lies next to Connor, then watches him leave and settles beside the sleeping boy. Leaving the editor's office, John arrives home to find the kids, Jenny, and Marley playing ball. They tackle him, and he, the boys, and Marley head inside. Marley struggles with the steps and later naps in the dining room. Awaking and trotting outside, John follows with a coat into the rainy night. Using torches, they search, while Jenny turns on the barn light. The children watch from a window, Jenny reassuring Colleen. Patrick follows as John searches towards the post box, finding Marley by a tree. The dog whines as John touches him. A vet, close to tears, finishes her work, and John leaves the surgery, shoulders slumped, heading to his car. Returning home, Jenny looks at a scrapbook, smiling, while John, distracted, examines his hand. She comforts him as he stares at the scrapbook. Morning sun highlights the stone house; John sleeps over the scrapbook. Smiling at Jenny, who relaxes in relief, Marley runs across the lawn. As the school bus arrives, Marley joins Patrick and Connor in a race. John and Billy walk past City Hall's clock tower, exchanging smiles with Sebastian. John drops his bag by a baby grand piano, noting Marley's feast. After setting the bin upright, they walk through a sunlit meadow surrounded by golden trees. Sitting beside John, Marley receives gentle strokes, and together they watch the lush valley in the golden evening-light."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Marley lies next to Connor, watches him leave, and returns to the sleeping boy. After leaving the editor's office, John finds Jenny and the kids playing ball. They tackle him, then head inside. Marley has trouble with the steps and later naps in the dining room. As Marley trots out, John puts on a coat to search the rainy night with a torch, joined by Jenny turning on the barn light. The kids, with Colleen, watch from a window while John searches by the roadside and finds Marley whining by a tree. A vet washes her hands; John, nearly in tears, leaves the surgery, walks to the car, and sighs. Back home, Jenny looks at the scrapbook, and John, distracted, doesn't notice. She comforts him as he stares at the pasted-in columns. Morning sun hits the house; John wakes, smiles at Jenny, and Marley bounds across the lawn. As the school bus arrives, Marley joins Patrick and Connor racing. John and Billy stroll by City Hall, exchanging grins. John parts from Sebastian, heads home, sees a note by the piano, and finds Marley feasting in the kitchen. After cleaning, they walk through a sunny meadow. John and Marley sit, enjoying the view, as the dog looks up at John in the golden evening sun."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "As Marley lies comfortably next to Connor, the dog watches intently as Connor gets up and leaves. Marley then settles back down beside the boy, who remains fast asleep. Shortly after, he departs from the editor's glass-fronted office, while in the garden, the children joyfully engage in a lively game of ball with Jenny. The cheerful atmosphere is interrupted by John's arrival home, prompting the kids, Jenny, and Marley to excitedly tackle him to the ground, creating a playful scene. As the laughter subsides, John, the boys, and Marley make their way back inside the welcoming house. However, Marley begins to struggle with getting up the steps and eventually falls asleep in the cozy dining room. Stirred by the wind, the dog gets up and trots outside, which prompts John to put on his coat and follow into the night. Armed with torches, they embark on a search through the rainy darkness, while Jenny switches on the light in the barn, illuminating the area. The children, gathered at a window, watch with concern as she picks up Colleen, offering a reassuring smile. Patrick, feeling downcast, follows his mother inside. Meanwhile, John persists in his search outside, walking down the drive towards the post box by the roadside. Shining his torch around, he spots Marley lying next to a tree and gently touches the dog's belly as Marley responds with a whimper. Inside a veterinary surgery, a vet clad in a white coat washes her hands. John, close to tears, emerges from the surgery, feeling the weight of his emotions. He steps out onto the street, sliding his jacket onto his shoulders, and walks with slumped shoulders towards his parked car. As he puts the key in the door, he sighs and places his hands on his hips. Sometime later, upon arriving home, she looks through a scrapbook and grins, finding solace in its pages. Resting his cheek on the palm of his right hand, John avoids meeting her gaze, instead examining his other hand distractedly. Jenny wraps an arm around him for comfort as he stares intently at the scrapbook filled with pasted-in columns. The morning sun casts its warm glow over the expansive stone house, and John is found asleep, slumped over the open scrapbook. Turning to Jenny, he offers her a smile as she leans against a door frame, her expression one of relief. Meanwhile, Marley bounds energetically across the vast lawn and positions himself by the road. As the school bus draws near, Marley eagerly trots towards it, meeting Patrick and Connor as they get off the bus, joining them in a joyful race. In town, John and Billy stroll past the prominent clock tower of City Hall, and they exchange broad grins with Sebastian as they cross paths. As John looks back after parting ways, Sebastian approaches two women. Once home, John drops his bag on a chair near the front door beside a baby grand piano, noticing a note left on the dining room table. In the kitchen, Marley has knocked over the dustbin and is enjoying a messy feast, so John picks up the bin, and they head out for a walk. They wander through a sunny meadow, bordered by trees adorned with golden autumn leaves. Marley trots loyally beside John, who has his hands buried in his pockets, and together they sit down on the path. John gently strokes Marley, studying his old companion with affection as the dog turns to return his gaze. They sit side by side in the golden rays of the evening sun, looking out over the lush and sprawling valley."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "As Marley lies comfortably and contentedly next to Connor, the dog watches with keen interest as Connor gets up and walks away. After observing this, Marley then settles back down beside the boy, who remains fast asleep and undisturbed. Shortly thereafter, Marley departs from the editor's glass-fronted office, while outside in the garden, the children are joyfully engaged in a lively and energetic game of ball with Jenny. The cheerful and carefree atmosphere is suddenly interrupted by John's arrival home, which prompts the kids, Jenny, and Marley to excitedly tackle him to the ground, creating a playful and spirited scene filled with laughter. As the laughter finally subsides, John, along with the boys and Marley, make their way back inside the warm and welcoming house. However, Marley begins to struggle with getting up the steps and eventually gives in to sleepiness in the cozy dining room. Stirred by the wind, the dog gets up and trots outside, compelling John to put on his coat and follow into the brisk night. Armed with torches, they embark on a search through the rainy and dark night, while Jenny switches on the light in the barn, casting illumination over the area. The children, gathered at a window, watch with concern as she tenderly picks up Colleen, offering a reassuring and comforting smile. Patrick, feeling downcast and with a heavy heart, follows his mother inside. Meanwhile, John persists in his determined search outside, walking purposefully down the drive towards the post box by the roadside. Shining his torch around, he spots Marley lying next to a tree and gently touches the dog's belly as Marley responds with a soft whimper. Inside a sterile veterinary surgery, a vet, dressed in a crisp white coat, washes her hands. John, close to tears, emerges from the surgery, visibly feeling the weight of his emotions. He steps out onto the street, sliding his jacket onto his shoulders, and walks with slumped shoulders towards his parked car under the dim glow of streetlights. As he inserts the key into the lock of the door, he sighs deeply and places his hands on his hips in resignation. Sometime later, upon arriving back home, she flips through a cherished scrapbook and grins, finding solace and comfort in its pages filled with memories. Resting his cheek against the palm of his right hand, John avoids making eye contact with her, instead focusing his attention on examining his other hand distractedly. Jenny, offering support, wraps an arm around him for comfort as he stares intently at the scrapbook filled with carefully pasted-in columns. The morning sun casts its warm and gentle glow over the expansive stone house, and John is found asleep, slumped over the open scrapbook. Turning to Jenny, he offers her a tired but genuine smile as she leans against a door frame, her expression one of relief and empathy. Meanwhile, Marley bounds energetically across the vast, open lawn and positions himself eagerly by the roadside. As the school bus draws near, Marley eagerly trots towards it, meeting Patrick and Connor as they step off the bus, joining them in a joyful race full of excitement. In town, John and Billy leisurely stroll past the prominent clock tower of City Hall, exchanging broad, friendly grins with Sebastian as they cross paths. As John looks back after parting ways, Sebastian approaches two women. Once back at home, John drops his bag on a chair near the front door, beside a polished baby grand piano, noticing a note left thoughtfully on the dining room table. In the kitchen, Marley has knocked over the dustbin and is enjoying a messy feast, so John promptly picks up the bin, and they head out for a much-needed walk. They wander through a sunny, picturesque meadow, bordered by trees adorned with golden autumn leaves. Marley trots loyally beside John, who has his hands buried deep in his pockets, and together they sit down on the peaceful path. John gently strokes Marley, studying his old, faithful companion with affection as the dog turns to return his gaze. They sit closely side by side in the golden rays of the evening sun, looking out over the lush and sprawling valley below."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "As Marley lays quietly next to Connor, he attentively watches him get up and leave the room, after which Marley comfortably settles down again beside the sleeping lad. Meanwhile, John exits the editor's glass-fronted office and heads home, where the scene unfolds with the children playing ball energetically in the garden with Jenny. Just as John arrives, joyful chaos ensues as the kids, Jenny, and Marley enthusiastically rush towards him and playfully tackle him to the ground. After their playful reunion, John, the boys, and Marley walk back toward the house together. Once there, Marley faces some difficulty maneuvering up the steps, and later, with the day's adventures behind him, he finds a cozy spot in the dining room and falls into a deep sleep. As the night wears on, Marley wakes from his slumber feeling the effects of a windy evening, and he starts to trot outside, which prompts John to grab a coat and venture back into the rainy night to search for him. Using torches to slice through the night's gloom, John and Jenny conduct their search, with Jenny turning on the light in the barn, illuminating the space. The children gather at a window, gazing out intently, and she lifts Colleen, offering her a reassuring smile as they watch. A somewhat dejected Patrick trails behind his mother inside, while John steadfastly continues his search outside and makes his way down the driveway to the roadside post box. As he shines his torch around, his beam eventually falls upon Marley lying under a tree, and the dog responds with a soft whine as John gently touches his belly. Subsequently, a white-coated vet is seen washing her hands, signaling the somber conclusion of a visit, and with emotions close to overtaking him, John leaves the surgery visibly distressed. He steps out onto the street, slipping his jacket on while walking with slumped shoulders towards the car. Upon reaching it, he inserts the key into the door, momentarily rests his hands on his hips, and lets out a weary sigh. Returning home later, he finds her poring over a scrapbook, and she greets him with a grin as she peruses its contents. Resting his cheek on his right hand, John remains reticent, his attention distractedly on his other hand, until Jenny places a comforting arm around him, drawing his focus momentarily to the scrapbook with pasted-in columns. As the morning sun casts its warm glow upon the large stone house, John's slumbering form is slouched over the scrapbook. Upon waking, he turns to Jenny with a smile, and she leans against a door frame, visibly relieved. In the large lawn outside, Marley bounds energetically and comes to a halt by the road as the school bus approaches. With a spirited trot up to the bus, Marley joyfully greets Patrick and Connor as they disembark, quickly joining them in a race back home. Later in town, John and Billy stroll past the imposing clock tower of City Hall, a landmark of their community, and an exchange of broad grins occurs between Sebastian and John as they cross paths. As they part ways, John glances back, watching Sebastian as he approaches two women nearby. Upon returning home, John drops his bag on a chair beside the elegant baby grand piano near the front door, spotting a note waiting for him on the dining room table. Turning his attention to the kitchen, he finds that Marley has knocked over the dustbin and is indulging in its contents, leading John to right the bin and then take Marley for a stroll through the scenic landscape of a sunny meadow, lined with trees adorned in rich golden autumn leaves. Marley keeps pace beside John, who walks with his hands nestled in his pockets, and together they settle down on the path. As John tenderly strokes Marley, he takes a moment to reflect, gazing at his old friend, and Marley returns his look with a trusting gaze. The pair remain side by side as the golden evening sun sets, their eyes cast over the lush valley spread before them, savoring the tranquil end to the day."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Marley lies next to Connor, watching him leave before settling back down. John exits the editor's office as Jenny and the children play ball in the garden. When John arrives home, the kids, Jenny, and Marley tackle him, and they all head back inside. Marley struggles with the steps and later falls asleep in the dining room. When Marley trots outside, a concerned John puts on his coat and searches the rainy night with a torch. Jenny switches on the barn light while the children watch from a window, and she reassures Colleen. As Patrick follows Jenny glumly, John continues searching and finds Marley by a tree. At the vet's, John is close to tears and leaves the surgery, stepping onto the street and walking dejectedly to his car. Sighing after putting his hands on his hips, he heads home. Jenny looks at a scrapbook and grins, while John, distracted, rests his cheek on his hand. She comforts him with an arm around his shoulders as he stares at the columns in the scrapbook. The morning sun shines on their stone house as John, asleep over the scrapbook, turns to smile at Jenny, who stands relieved against the doorframe. Marley bounds across the lawn, meets the school bus, and joins Patrick and Connor in a race. Later, John and Billy walk through town, exchanging grins with Sebastian as they part ways. Sebastian approaches two women, while John drops his bag near a piano, noticing a note on the dining room table. In the kitchen, Marley has knocked over the dustbin, feasting on its contents, prompting John to take him for a walk through a sunny autumnal meadow. Marley trots beside John, who has his hands in his pockets as they sit on the path. John strokes Marley, sharing a moment with his old friend as they sit together, watching the sun set over the lush valley."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Marley's lying next to Connor, who is his favorite playmate, and Marley watches him leave and settles back down next to the sleeping lad. He leaves the editor's glass-fronted office, a place where news stories are transformed and headlines crafted, and the children are playing ball in the garden with Jenny, their energetic aunt, when John arrives home from his demanding day at work. The kids, Jenny, and Marley tackle him to the ground with joyous laughter, and John, the boys, and Marley head back to the house, where the aroma of dinner being cooked greets them warmly. Marley is having difficulty getting up the steps due to his old age and later falls asleep in the dining room, a room filled with family memories captured in photographs on the walls. The windy dog gets up and trots out, prompting John to put on a coat and go back outside into the chilly autumn air. They use torches to search the rainy night, their breath visible in the cold, and Jenny switches the light on in the barn, where the family occasionally gathers for small celebrations. The children are gathered together at a window, peering into the night with concern, and she picks up Colleen with a reassuring smile that hides her own worry. Patrick glumly follows his mother as John continues to search outside and walks down the drive towards the post box by the roadside, a red-painted fixture that has served the family faithfully for years. He flashes the torch around and spots Marley lying by a tree, an ancient oak that stands sentinel by the road, and the dog whines as John touches his belly, his heart filled with dread. A white-coated vet, whose years of experience are evident in her gentle manner, washes her hands, and close to tears, John leaves the surgery. He steps out onto the street, shrugging on his jacket, and walks, shoulders slumped, towards the car under the dim glow of the streetlights. He puts the key in the door, puts his hands on his hips, and sighs, feeling the weight of worry pressing down on him. Later, he arrives home, and she looks at the scrapbook, filled with cherished family moments, and grins. Resting his cheek on his right hand, John doesn't look at her and examines his other hand, distractedly twisting his wedding ring. Jenny puts an arm around him as he stares at the scrapbook of pasted-in columns, each representing milestones in their lives. Morning sun shines on the big stone house, a sturdy structure built by John's grandfather, and John's asleep, slumped over the scrapbook. He turns to Jenny and smiles, a warm expression of love and relief, while she slumps against a door frame in relief. Marley bounds across the large lawn, which is dotted with dandelions and buttercups, and sits down by the road. As the school bus, painted yellow with 'Riverdale School District' on its side, approaches, Marley trots up to the bus as Patrick and Connor get off, and Marley joins in the race, barking excitedly. John and Billy walk through town past the tall clock tower of City Hall, a historic landmark, and Sebastian and John grin broadly at one another, their friendship evident in their expressions. John looks back as they part, and Sebastian approaches two women, who greet him with warm smiles of recognition. John drops his bag on a chair by the front door near to a baby grand piano, an heirloom from his grandmother, and there's a note on the dining room table, written in Jenny's elegant handwriting. Marley's knocked over the dustbin in the kitchen and is having a feast, so he picks up the bin, recalling the dog's mischievous antics from younger days, and they go for a walk through a sunny meadow bordered by trees with golden autumnal leaves. Marley trots along beside John, who has his hands thrust in his pockets, enjoying the serene moment, and they sit down together on the path. John strokes Marley and studies his old friend, the loyal companion of many years, and the dog turns and looks at him with trusting eyes. They sit, side by side, in the golden evening sun, looking out over the lush valley that has been the backdrop to countless family adventures."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Morning sun shines on the big stone house and John's asleep slumped over the scrapbook Marley's lying next to Connor and Marley watches him leave and settles back down next to the sleeping lad John drops his bag on a chair by the front door near to a baby grand piano and there is a note on the dining room table He leaves the editor's glassfronted office and the children are playing ball in the garden with Jenny when John arrives home As the school bus approaches Marley trots up to the bus as Patrick and Connor get off and Marley joins in the race The kids Jenny and Marley tackle him to the ground and John the boys and Marley head back to the house Marley is having difficulty getting up the steps and later falls asleep in the dining room The windy dog gets up and trots out prompting John to put on a coat and go back outside Marley is having difficulty getting up the steps and later falls asleep in the dining room Marley's lying next to Connor and Marley watches him leave and settles back down next to the sleeping lad The kids Jenny and Marley tackle him to the ground and John the boys and Marley head back to the house They use torches to search the rainy night and Jenny switches the light on in the barn The children are gathered together at a window and she picks up Colleen with a reassuring smile Patrick glumly follows his mother as John continues to search outside and walks down the drive towards the post box by the roadside He flashes the torch around and spots Marley lying by a tree and the dog whines as John touches his belly He flashes the torch around and spots Marley lying by a tree and the dog whines as John touches his belly John looks back as they part and Sebastian approaches two women Marley trots along beside John who has his hands thrust in his pockets and they sit down together on the path A whitecoated vet washes her hands and close to tears John leaves the surgery John strokes Marley and studies his old friend and the dog turns and looks at him He steps out onto the street shrugging on his jacket and walks shoulders slumped towards the car He leaves the editor's glassfronted office and the children are playing ball in the garden with Jenny when John arrives home He puts the key in the door puts his hands on his hips and sighs Later he arrives home and she looks at the scrapbook and grins Resting his cheek on his right hand John does not look at her and examines his other hand distractedly Jenny puts an arm around him as he stares at the scrapbook of pastedin columns Morning sun shines on the big stone house and John's asleep slumped over the scrapbook Later he arrives home and she looks at the scrapbook and grins He turns to Jenny and smiles while she slumps against a door frame in relief Marley bounds across the large lawn and sits down by the road As the school bus approaches Marley trots up to the bus as Patrick and Connor get off and Marley joins in the race Patrick glumly follows his mother as John continues to search outside and walks down the drive towards the post box by the roadside The windy dog gets up and trots out prompting John to put on a coat and go back outside John and Billy walk through town past the tall clock tower of City Hall and Sebastian and John grin broadly at one another John looks back as they part and Sebastian approaches two women John drops his bag on a chair by the front door near to a baby grand piano and there is a note on the dining room table Marley's knocked over the dustbin in the kitchen and is having a feast so he picks up the bin and they go for a walk through a sunny meadow bordered by trees with golden autumnal leaves Marley trots along beside John who has his hands thrust in his pockets and they sit down together on the path John strokes Marley and studies his old friend and the dog turns and looks at him They sit side by side in the golden evening sun looking out over the lush valley"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Marley's lying next to Connor and Marley watches him leave and settles back down next to the sleeping lad. He leaves the editor's glassfronted office and the children are playing ball in the garden with Jenny when John arrives home. The kids Jenny and Marley tackle him to the ground and John the boys and Marley head back to the house. Marley is having difficulty getting up the steps and later falls asleep in the dining room. The windy dog gets up and trots out prompting John to put on a coat and go back outside. They use torches to search the rainy night and Jenny switches the light on in the barn. The children are gathered together at a window and she picks up Colleen with a reassuring smile. Patrick glumly follows his mother as John continues to search outside and walks down the drive towards the post box by the roadside. He flashes the torch around and spots Marley lying by a tree and the dog whines as John touches his belly. A whitecoated vet washes her hands and close to tears. John leaves the surgery. He steps out onto the street shrugging on his jacket and walks shoulders slumped towards the car. He puts the key in the door puts his hands on his hips and sighs. Later he arrives home and she looks at the scrapbook and grins. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Resting his cheek on his right hand. John does not look at her and examines his other hand distractedly. Jenny puts an arm around him as he stares at the scrapbook of pastedin columns. Morning sun shines on the big stone house and John's asleep slumped over the scrapbook. He turns to Jenny and smiles while she slumps against a door frame in relief. Marley bounds across the large lawn and sits down by the road. As the school bus approaches Marley trots up to the bus as Patrick and Connor get off and Marley joins in the race. John and Billy walk through town past the tall clock tower of City Hall and Sebastian and John grin broadly at one another. John looks back as they part and Sebastian approaches two women. John drops his bag on a chair by the front door near to a baby grand piano and there is a note on the dining room table. Marley's knocked over the dustbin in the kitchen and is having a feast so he picks up the bin and they go for a walk through a sunny meadow bordered by trees with golden autumnal leaves. Marley trots along beside John who has his hands thrust in his pockets and they sit down together on the path. John strokes Marley and studies his old friend and the dog turns and looks at him. They sit side by side in the golden evening sun looking out over the lush valley."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Marley's lying next to Connor and Marley watches him leave and settles back down next to the sleeping lad. He leaves the editor's glassfronted office and the children are playing ball in the garden with Jenny when John arrives home. The kids Jenny and Marley tackle him to the ground and John the boys and Marley head back to the house. Marley is having difficulty getting up the steps and later falls asleep in the dining room. The windy dog gets up and trots out prompting John to put on a coat and go back outside. They use torches to search the rainy night and Jenny switches the light on in the barn. The children are gathered together at a window and she picks up Colleen with a reassuring smile. Patrick glumly follows his mother as John continues to search outside and walks down the drive towards the post box by the roadside. He flashes the torch around and spots Marley lying by a tree and the dog whines as John touches his belly. A whitecoated vet washes her hands and close to tears. John leaves the surgery. He steps out onto the street shrugging on his jacket and walks shoulders slumped towards the car. He puts the key in the door puts his hands on his hips and sighs. Later he arrives home and she looks at the scrapbook and grins. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. Resting his cheek on his right hand. John does not look at her and examines his other hand distractedly. Jenny puts an arm around him as he stares at the scrapbook of pastedin columns. Morning sun shines on the big stone house and John's asleep slumped over the scrapbook. He turns to Jenny and smiles while she slumps against a door frame in relief. Marley bounds across the large lawn and sits down by the road. As the school bus approaches Marley trots up to the bus as Patrick and Connor get off and Marley joins in the race. John and Billy walk through town past the tall clock tower of City Hall and Sebastian and John grin broadly at one another. John looks back as they part and Sebastian approaches two women. John drops his bag on a chair by the front door near to a baby grand piano and there is a note on the dining room table. Marley's knocked over the dustbin in the kitchen and is having a feast so he picks up the bin and they go for a walk through a sunny meadow bordered by trees with golden autumnal leaves. Marley trots along beside John who has his hands thrust in his pockets and they sit down together on the path. John strokes Marley and studies his old friend and the dog turns and looks at him. They sit side by side in the golden evening sun looking out over the lush valley."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Marley's lying next to Connor and Marley watches him leave and settles back down next to the sleeping lad. He leaves the editor's glassfronted office and the children are playing ball in the garden with Jenny when John arrives home. The kids Jenny and Marley tackle him to the ground and John the boys and Marley head back to the house. Marley is having difficulty getting up the steps and later falls asleep in the dining room. The windy dog gets up and trots out prompting John to put on a coat and go back outside. They use torches to search the rainy night and Jenny switches the light on in the barn. The children are gathered together at a window and she picks up Colleen with a reassuring smile. John and Billy walk through town past the tall clock tower of City Hall and Sebastian and John grin broadly at one another. John looks back as they part and Sebastian approaches two women. John drops his bag on a chair by the front door near to a baby grand piano and there is a note on the dining room table. Marley's knocked over the dustbin in the kitchen and is having a feast so he picks up the bin and they go for a walk through a sunny meadow bordered by trees with golden autumnal leaves. Marley trots along beside John who has his hands thrust in his pockets and they sit down together on the path. John strokes Marley and studies his old friend and the dog turns and looks at him. They sit side by side in the golden evening sun looking out over the lush valley."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Marley's lying next to Connor and Marley watches him leave and settles back down next to the sleeping lad. He leaves the editor's glassfronted office and the children are playing ball in the garden with Jenny when John arrives home. The kids Jenny and Marley tackle him to the ground and John the boys and Marley head back to the house. Marley trots along beside John who has his hands thrust in his pockets and they sit down together on the path. John strokes Marley and studies his old friend and the dog turns and looks at him. They sit side by side in the golden evening sun looking out over the lush valley."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Daisy's lying next to Oliver, and Daisy watches him leave and settles back down next to the sleeping lad. She leaves the editor's glass-fronted office, and the squirrels are playing ball in the garden with Riley when Emily arrives home. The squirrels, Riley, and Daisy tackle her to the ground, and Emily, the boys, and Daisy head back to the house. Daisy is having difficulty getting up the steps and later falls asleep in the dining room. The windy fox gets up and trots out, prompting Emily to put on a coat and go back outside. They use torches to search the rainy night, and Riley switches the light on in the barn. The squirrels are gathered together at a window, and she picks up Dylan with a reassuring smile. George glumly follows his sister as Emily continues to search outside and walks down the drive towards the post box by the roadside. She flashes the torch around and spots Daisy lying by a tree, and the fox whines as Emily touches her belly. A white-coated dentist washes his hands, and close to tears, Emily leaves the surgery. She steps out onto the street, shrugging on her jacket, and walks, shoulders slumped, towards the car. She puts the key in the door, puts her hands on her hips, and sighs. Later, she arrives home, and he looks at the scrapbook and grins. Resting his cheek on his right hand, Emily doesn't look at him and examines her other hand, distractedly. Riley puts an arm around her as she stares at the scrapbook of pasted-in columns. Morning sun shines on the big stone house, and Emily's asleep, slumped over the scrapbook. She turns to Riley and smiles, while he slumps against a door frame in relief. Daisy bounds across the large lawn and sits down by the road. As the school bus approaches, Daisy trots up to the bus as George and Oliver get off, and Daisy joins in the race. Emily and Lucas walk through town past the tall clock tower of City Hall, and Nathan and Emily grin broadly at one another. Emily looks back as they part, and Nathan approaches two women. Emily drops her bag on a chair by the front door near to a baby grand piano, and there's a note on the dining room table. Daisy's knocked over the dustbin in the kitchen and is having a feast, so she picks up the bin, and they go for a walk through a sunny meadow bordered by trees with golden autumnal leaves. Daisy trots along beside Emily, who has her hands thrust in her pockets, and they sit down together on the path. Emily strokes Daisy and studies her old friend, and the fox turns and looks at her. They sit, side by side, in the golden evening sun, looking out over the lush valley."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Marley's lying next to Connor, and Marley watches him leave and settles back down next to the sleeping lad. He leaves the editor's brick-walled studio, and the children are playing darts in the courtyard with Jenny when John arrives home. The kids, Jenny, and Marley tackle him to the ground, and John, the boys, and Marley head back to the apartment. Marley is having difficulty getting up the escalator and later falls asleep in the living room. The windy dog gets up and trots out, prompting John to put on a scarf and go back outside. They use lanterns to search the foggy night, and Jenny switches the light on in the attic. The children are gathered together at a window, and she picks up Colleen with a reassuring smile. Patrick glumly follows his mother as John continues to search outside and walks down the drive towards the telephone booth by the roadside. He flashes the lantern around and spots Marley lying by a fence, and the dog whines as John touches his paw. A white-coated nurse washes her hands, and close to tears, John leaves the clinic. He steps out onto the plaza, shrugging on his vest, and walks, shoulders slumped, towards the bicycle. He puts the key in the lock, puts his hands on his hips, and sighs. Later, he arrives home, and she looks at the photograph album and grins. Resting his cheek on his right hand, John doesn't look at her and examines his other hand, distractedly. Jenny puts an arm around him as he stares at the album of pasted-in photographs. Morning sun shines on the big wooden cabin, and John's asleep, slumped over the album. He turns to Jenny and smiles, while she slumps against a window frame in relief. Marley bounds across the large field and sits down by the pathway. As the tram approaches, Marley trots up to the tram as Patrick and Connor get off, and Marley joins in the sprint. John and Billy walk through town past the tall lighthouse of the marina, and Sebastian and John grin broadly at one another. John looks back as they part, and Sebastian approaches two gentlemen. John drops his bag on a chair by the front door next to a harmonium, and there's a note on the kitchen counter. Marley's knocked over the toolbox in the study and is having a feast, so he picks up the box, and they go for a walk through a sunny garden bordered by trees with golden autumnal leaves. Marley trots along beside John, who has his hands thrust in his pockets, and they sit down together on the bridge. John strokes Marley and studies his old friend, and the dog turns and looks at him. They sit, side by side, in the golden evening sun, looking out over the lush vineyard."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Marley's sprawled next to Connor, and Marley observes him depart and snuggles back down next to the resting lad. He exits the editor's glass-fronted office, and the children are drawing pictures in the garden with Jenny when John enters home. The kids, Jenny, and Marley bounce him onto the ground, and John, the boys, and Marley stroll back to the house. Marley is struggling to descend the steps and later dozes off in the dining room. The breathless dog rises and scampers out, prompting John to grab a coat and step back outside. They wave flashlights to illuminate the rainy night, and Jenny turns the light on in the barn. The children are huddled together at a window, and she lifts Colleen with a comforting smile. Patrick sullenly trails his mother as John continues to roam outside and marches down the drive towards the post box by the roadside. He waves the torch around and finds Marley resting by a tree, and the dog groans as John pats his belly. A white-coated vet dries her hands, and close to tears, John exits the surgery. He steps onto the street, slipping on his jacket, and strolls, shoulders sagging, towards the car. He inserts the key in the door, places his hands on his hips, and exhales. Later, he reaches home, and she flips through the scrapbook and giggles. Resting his chin on his right hand, John ignores her and inspects his other hand, aimlessly. Jenny places an arm around him as he gazes at the scrapbook of pasted-in columns. Morning sun bathes the big stone house, and John's dozing, slumped over the scrapbook. He turns to Jenny and beams, while she leans against a door frame in relief. Marley leaps across the large lawn and pauses by the road. As the school bus nears, Marley scurries up to the bus as Patrick and Connor disembark, and Marley joins in the celebration. John and Billy amble through town past the tall clock tower of City Hall, and Sebastian and John exchange broad smiles. John glances back as they separate, and Sebastian approaches two women. John sets his bag on a chair by the front door near a baby grand piano, and there's a note on the dining room table. Marley's toppled the dustbin in the kitchen and is indulging himself, so he rights the bin, and they stroll through a sunny meadow bordered by trees with golden autumnal leaves. Marley ambles alongside John, who has his hands buried in his pockets, and they pause together on the path. John pats Marley and observes his old friend, and the dog turns and gazes at him. They rest, side by side, in the golden evening sun, taking in the view over the lush valley."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Liam's lying next to Harper, and Liam watches her leave and settles back down next to the sleeping artist. She leaves the mechanic's brass-buttoned office, and the squirrels are playing cards in the attic with Samantha when Mike arrives home. The owls, Samantha, and Liam tackle her to the ground, and Mike, the girls, and Liam head back to the barn. Liam is having difficulty getting up the ladder and later falls asleep in the kitchen. The stormy cat gets up and trots out, prompting Mike to put on a hat and go back inside. They use lanterns to search the snowy dawn, and Samantha switches the lamp on in the shed. The raccoons are gathered together at a chimney, and he picks up Jackson with a thoughtful nod. Kimberly joyfully follows her uncle as Mike continues to search inside and walks down the alley towards the letterbox by the mailbox. He flashes the lantern around and spots Liam lying by a rock, and the cat whines as Mike touches his ear. A blue-coated dentist washes her feet, and close to laughing, Mike leaves the pharmacy. He steps out onto the sidewalk, shrugging on his hat, and walks, feet dragging, towards the scooter. She puts the ticket in the window, puts her feet on her knees, and laughs. Later, he arrives home, and he looks at the notebook and grins. Resting her chin on her left foot, Mike doesn't look at him and examines her other foot, dreamily. Samantha puts a leg around him as he stares at the notebook of pasted-in pictures. Morning dew shines on the small wooden cabin, and Mike's asleep, slumped over the notebook. She turns to Samantha and giggles, while he slumps against a table leg in disbelief. Liam bounds across the narrow street and sits down by the bench. As the tractor approaches, Liam trots up to the tractor as Kimberly and Harper get off, and Liam joins in the chorus. Mike and Danny stroll through the park past the short sundial of the golf course, and Oliver and Mike frown deeply at one another. Mike looks back as they part, and Oliver approaches two cats. Mike drops his hat on a horse near to a small toy drum, and there's a message on the living room floor. Liam's knocked over the lamp in the bedroom and is having a snooze, so she picks up the lamp, and they go for a stroll through a rainy garden bordered by stones with shiny translucent petals. Liam trots along beside Mike, who has her feet thrust in her pockets, and they sit down together on the rock. Mike strokes Liam and studies her old friend, and the cat turns and looks at her. They sit, side by side, in the silvery morning dew, looking out over the barren hill."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Harper's reclining next to Eleanor, and Harper observes her arrive and sinks back down next to the resting lass. She departs the artist's wooden-fronted office, and the adults are reading books in the garden with Charlie when Mary reaches home. The adults, Charlie, and Harper lift her into the air, and Mary, the girls, and Harper venture back to the house. Harper is having fun climbing up the steps and later naps in the living room. The cheerful cat stands up and sprints out, prompting Mary to put on a hat and go back inside. They use candles to illuminate the darkened day, and Charlie turns the fan off in the shed. The adults are assembled together at a table, and he picks up Oliver with a confident nod. Kaitlyn eagerly follows her father as Mary continues to wait inside and skips up the path towards the mailbox by the fence. She waves the lantern around and spots Harper sitting by a bush, and the cat stretches as Mary pats her head. A black-coated doctor shakes her head, and holding back laughter, Mary exits the clinic. She steps inside onto the carpet, pulling off her cap, and runs, footsteps heavy, towards the cabin. She drops the pen on the desk, places her hands on her lap, and laughs. Earlier, she departs home, and he glances at the photograph and frowns. Nodding his head on his left hand, Mary doesn't notice him and inspects his other hand, absentmindedly. Charlie wraps an arm around her as she glances at the scrapbook of written-in chapters. Evening moonlight illuminates the small brick cottage, and Mary's awake, seated over the journal. She turns to Charlie and frowns, while he leans against a wall in exhaustion. Harper dashes across the small yard and jumps down by the fence. As the delivery van departs, Harper pauses by the van as Kaitlyn and Eleanor climb on, and Harper joins in the prank. Mary and Frank wander through the park past the short bell tower of Central Hotel, and Gregory and Mary smirk subtly at one another. Mary looks forward as they unite, and Gregory departs from three men. Mary kicks her coat under a table by the back door next to an upright bass, and there's a picture on the kitchen counter. Harper's dragged away the rug in the hallway and is taking a nap, so she rolls up the carpet, and they head for a jog through a snowy forest bordered by bushes with lush spring blossoms. Harper bounces along beside Mary, who has her hands resting on her knees, and they lie down together on the bench. Mary pats Harper and examines her young companion, and the cat turns and blinks at her. They lie, side by side, in the glowing morning light, gazing out over the arid desert."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Marley's lying beside Connor, and Marley watches him drift away and nestles back down next to the snoring lad. He exits the chef's wooden patio, and the robots are juggling fruit in the yard with Jenny when John arrives at the cabin. The robots, Jenny, and Marley tackle him to the floor, and John, the robots, and Marley wander back to the shelter. Marley is struggling to descend the escalator and later dozes off in the subway station. The breezy dog rises and trots out, prompting John to grab a blanket and venture back outside. They use lanterns to navigate the misty dusk, and Jenny flicks the switch on in the gazebo. The robots are clustered together by a bench, and she hoists up Colleen with an encouraging nod. Patrick sullenly trails his mother as John continues to wander outside and strolls down the path towards the shed by the alley. He beams the lantern around and notices Marley resting by a bush, and the dog murmurs as John pats his back. A red-clad gardener wipes her boots, and on the verge of sobbing, John departs the office. He steps into the courtyard, pulling on his hoodie, and marches, head down, towards the scooter. He slides the key into the ignition, places his hands behind his head, and groans. Later, he reaches the cabin, and she glances at the novel and beams. Resting his chin on his left hand, John avoids her gaze and examines his other palm, absentmindedly. Jenny wraps an arm around him as he gazes at the novel of glued-in poems. Afternoon shadows fall on the grand timber lodge, and John's snoozing, slouched over the novel. He turns to Jenny and chuckles, while she leans against a window frame in relief. Marley sprints across the vast garden and perches by the path. As the tram approaches, Marley trots up to the tram as Patrick and Connor disembark, and Marley joins in the parade. John and Billy meander through town past the grand bell tower of City Hall, and Sebastian and John exchange wide smiles. John glances back as they diverge, and Sebastian addresses two travelers. John drops his coat on a bench by the patio door near to a grand harp, and there's a letter on the kitchen counter. Marley's knocked over the vase in the den and is having a banquet, so he picks up the vase, and they go for a stroll through a bright meadow lined with shrubs with silver winter leaves. Marley trots along beside John, who has his hands buried in his sleeves, and they rest together on the pavement. John pats Marley and examines his aged companion, and the dog turns and gazes at him. They rest, side by side, in the amber evening glow, gazing out over the vibrant hill."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Benny's standing under Daphne, and Benny observes her arrive and reclines back up under the loud bird. She enters the mechanic's wooden-door shed, and the sailors are twisting rope in the cabin with Emily when Kurt departs work. The crew, Emily, and Benny jostle her to the sky, and Kurt, the girls, and Benny fly out to the ship. Benny is experiencing ease descending the ladder and earlier jumps awake on the porch. The narrow cat stands up and strolls inside, prompting Kurt to take off a scarf and head inside. They use candles to illuminate the misty morning, and Emily flicks the heater off in the attic. The sailors are dispersed apart by a seat, and he sets down Gavin with a worried frown. Liam happily leads his sister as Kurt halts to rest inside and dances up the stairs away from the cushion beside the fireplace. He winks the candle down and misses Benny running by a car, and the cat purrs as Kurt pats its tail. A black-suited chef dries his spoon, and high with laughter, Kurt enters the auditorium. She walks into the plaza, removing her hoodie, and skips, toes bouncing, into the park. She takes the pen from the bag, places her feet on her shoulders, and sings. Earlier, she departs work, and he frowns at the clock and weeps. Resting her knee on her right shoulder, Kurt does glance at her and ignores her left shoulder, attentively. Emily keeps a leg around her as he peers at the clock of cut-out pictures. Evening moonlight glows on the small brick store, and Kurt's awake, sitting against the clock. She turns to Emily and cries, while he stands under a window sill in frustration. Benny skips across the tiny street and stands up behind the fence. As the scooter departs, Benny sprints down the scooter as Liam and Gavin jump on, and Benny stops in the chase. Kurt and Cindy crawl over bridges near the short tower of Old School, and Giovanni and Kurt frown narrowly at one another. Kurt faces forward as they unite, and Giovanni departs from three men. Kurt throws his hat on a couch by the back wall next to an upright cello, and there's a list on the bedroom shelf. Benny's pushed aside the shelf in the cellar and is having a nap, so she places down the shelf, and they lie for a sprint over a rainy field next to bushes with silver summer fruits. Benny strolls behind Kurt, who has his elbows placed in his sleeves, and they stand up separately above the hill. Kurt hugs Benny and ignores his new enemy, and the cat shifts and ignores her. They stand, far apart, below the silver morning moon, staring up underneath the barren cliff."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Marley lies beside Connor before watching him leave, then settles next to the sleeping boy. John arrives home to the kids and Marley playing with Jenny. The children and Marley tackle John playfully before heading inside. Marley struggles with the steps and later falls asleep in the dining room. When Marley wanders off, John searches for him in the rain and discovers Marley by a tree. A vet tends to Marley, leaving John close to tears as he exits the surgery. Returning home, John and Jenny look at a scrapbook, with John distracted by his thoughts. In the morning, John wakes beside the scrapbook and smiles at Jenny. Marley bounds across the lawn to greet Patrick and Connor as they arrive home. John and Billy walk through town, exchanging grins with Sebastian. John returns home to find a note and Marley feasting in the kitchen, leading to a walk through a sunny meadow. John and Marley sit together in the golden sun, John stroking his old friend as they gaze over the valley."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "They sit side by side in the golden evening sun looking out over the lush valley John strokes Marley and studies his old friend and the dog turns and looks at him Marley trots along beside John who has his hands thrust in his pockets and they sit down together on the path Marley's knocked over the dustbin in the kitchen and is having a feast so he picks up the bin and they go for a walk through a sunny meadow bordered by trees with golden autumnal leaves John drops his bag on a chair by the front door near to a baby grand piano and there is a note on the dining room table John looks back as they part and Sebastian approaches two women John and Billy walk through town past the tall clock tower of City Hall and Sebastian and John grin broadly at one another As the school bus approaches Marley trots up to the bus as Patrick and Connor get off and Marley joins in the race Marley bounds across the large lawn and sits down by the road He turns to Jenny and smiles while she slumps against a door frame in relief Morning sun shines on the big stone house and John's asleep slumped over the scrapbook Jenny puts an arm around him as he stares at the scrapbook of pastedin columns John does not look at her and examines his other hand distractedly Resting his cheek on his right hand Later he arrives home and she looks at the scrapbook and grins He puts the key in the door puts his hands on his hips and sighs He steps out onto the street shrugging on his jacket and walks shoulders slumped towards the car John leaves the surgery A whitecoated vet washes her hands and close to tears He flashes the torch around and spots Marley lying by a tree and the dog whines as John touches his belly Patrick glumly follows his mother as John continues to search outside and walks down the drive towards the post box by the roadside The children are gathered together at a window and she picks up Colleen with a reassuring smile They use torches to search the rainy night and Jenny switches the light on in the barn The windy dog gets up and trots out prompting John to put on a coat and go back outside Marley is having difficulty getting up the steps and later falls asleep in the dining room The kids Jenny and Marley tackle him to the ground and John the boys and Marley head back to the house He leaves the editor's glassfronted office and the children are playing ball in the garden with Jenny when John arrives home Marley's lying next to Connor and Marley watches him leave and settles back down next to the sleeping lad"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "He turns to Jenny and smiles while she slumps against a door frame in relief Jenny puts an arm around him as he stares at the scrapbook of pastedin columns John leaves the surgery John and Billy walk through town past the tall clock tower of City Hall and Sebastian and John grin broadly at one another They sit side by side in the golden evening sun looking out over the lush valley The children are gathered together at a window and she picks up Colleen with a reassuring smile They use torches to search the rainy night and Jenny switches the light on in the barn He steps out onto the street shrugging on his jacket and walks shoulders slumped towards the car Resting his cheek on his right hand A whitecoated vet washes her hands and close to tears Marley's knocked over the dustbin in the kitchen and is having a feast so he picks up the bin and they go for a walk through a sunny meadow bordered by trees with golden autumnal leaves He puts the key in the door puts his hands on his hips and sighs Marley bounds across the large lawn and sits down by the road John does not look at her and examines his other hand distractedly Marley trots along beside John who has his hands thrust in his pockets and they sit down together on the path He leaves the editor's glassfronted office and the children are playing ball in the garden with Jenny when John arrives home Later he arrives home and she looks at the scrapbook and grins The kids Jenny and Marley tackle him to the ground and John the boys and Marley head back to the house Morning sun shines on the big stone house and John's asleep slumped over the scrapbook John strokes Marley and studies his old friend and the dog turns and looks at him The windy dog gets up and trots out prompting John to put on a coat and go back outside John looks back as they part and Sebastian approaches two women Patrick glumly follows his mother as John continues to search outside and walks down the drive towards the post box by the roadside He flashes the torch around and spots Marley lying by a tree and the dog whines as John touches his belly John drops his bag on a chair by the front door near to a baby grand piano and there is a note on the dining room table Marley's lying next to Connor and Marley watches him leave and settles back down next to the sleeping lad Marley is having difficulty getting up the steps and later falls asleep in the dining room As the school bus approaches Marley trots up to the bus as Patrick and Connor get off and Marley joins in the race"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Resting his cheek on his right hand John does not look at her and examines his other hand distractedly Jenny puts an arm around him as he stares at the scrapbook of pastedin columns Morning sun shines on the big stone house and John's asleep slumped over the scrapbook He turns to Jenny and smiles while she slumps against a door frame in relief Marley bounds across the large lawn and sits down by the road As the school bus approaches Marley trots up to the bus as Patrick and Connor get off and Marley joins in the race John and Billy walk through town past the tall clock tower of City Hall and Sebastian and John grin broadly at one another John looks back as they part and Sebastian approaches two women John drops his bag on a chair by the front door near to a baby grand piano and there is a note on the dining room table Marley's knocked over the dustbin in the kitchen and is having a feast so he picks up the bin and they go for a walk through a sunny meadow bordered by trees with golden autumnal leaves Marley trots along beside John who has his hands thrust in his pockets and they sit down together on the path John strokes Marley and studies his old friend and the dog turns and looks at him They sit side by side in the golden evening sun looking out over the lush valley Marley's lying next to Connor and Marley watches him leave and settles back down next to the sleeping lad He leaves the editor's glassfronted office and the children are playing ball in the garden with Jenny when John arrives home The kids Jenny and Marley tackle him to the ground and John the boys and Marley head back to the house Marley is having difficulty getting up the steps and later falls asleep in the dining room The windy dog gets up and trots out prompting John to put on a coat and go back outside They use torches to search the rainy night and Jenny switches the light on in the barn The children are gathered together at a window and she picks up Colleen with a reassuring smile Patrick glumly follows his mother as John continues to search outside and walks down the drive towards the post box by the roadside He flashes the torch around and spots Marley lying by a tree and the dog whines as John touches his belly A whitecoated vet washes her hands and close to tears John leaves the surgery He steps out onto the street shrugging on his jacket and walks shoulders slumped towards the car He puts the key in the door puts his hands on his hips and sighs Later he arrives home and she looks at the scrapbook and grins"
        }
      ]
    }
  ]
}