{
  "ground_truth": "Corpses litter the remains of the village, and huts and trees are on fire as the commander watches, his eyes hidden behind his sunglasses. Green forests surround a misty mountain that towers over a lake, where Rambo's boat sits serenely at its home harbor. Rambo sits on the deck with his elbows resting on his knees, toying with the crucifix Sarah gave him in his sinewy hands, looks up thoughtfully, and then stands. Sheets of lightning bombard dark mountaintops, and a montage of flashback images of Rambo in combat suddenly fills his thoughts before Rambo lies in a hammock. He climbs out, and in the rain-soaked darkness, a figurine silhouette holding an umbrella stands in the half-light, lowers the brolly, and walks toward him. Rambo switches on a light to reveal Marshall, a middle-aged man with neat gray hair, wearing a dark overcoat over a collarless pale blue shirt. Rambo starts thinking about something and then walks toward him, before beating a piece of hot steel, shoving the metal into burning coals, and dousing the white hot metal in water, which cools to form the shape of a machete. On a rainy morning, Reese, one of a motley collection of mercenaries in Rambo's boat—including bearded Diaz and En-Joo, handsome stubbly School Boy, and bald Lewis—sings, while Rambo sits at the tiller, watching them. Lewis stands at the prow of the boat, looking out at the river, while Rambo stares at Lewis blankly. Lewis returns the stare, and Rambo looks vacantly ahead. With an angry glare at Rambo, Lewis returns to the prow of the boat and continues his belligerent surveillance while Rambo gazes out across the water surface as a flock of birds takes off en masse. A watchtower at a military camp is surrounded by razor wire as troops eat in a large mess tent, and one idly throws leftovers over his shoulder into a cage of female prisoners outside. Three soldiers troop out of the mess hut as the Burmese flag is raised on a pole, beneath which are two ranks of downcast male prisoners, now army draftees. A drill instructor thumps one in the stomach, and the camp huts sit on timber with above-ground supports as foundations. Sarah lies bound beneath one, where the foundation is divided into two sections, and in the section next to Sarah, two fat pigs fight over food. Through the slat, she watches a soldier walk away from the hut as the commander and the subordinate have an overview of a larger compound in which the pigs roam freely. Opposite the soldier's vantage point and above the piggery is a cage in which the downcast male survivors of Michael's party kneel, their hands tied behind them, and their faces muddy. One lifts his head and catches the commander's eye.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Bodies scatter the remnants of the settlement, and shacks and timber are ablaze as the leader observes, his eyes concealed behind his shades. Verdant woods encircle a foggy peak that looms over a pond, where Rambo's vessel rests peacefully at its native dock. Rambo perches on the platform with his arms resting on his thighs, fiddling with the crucifix Sarah gifted him in his muscular hands, glances up pensively, and then rises. Sheets of lightning strike dark summits, and a collage of flashback scenes of Rambo in battle suddenly occupies his mind before Rambo reclines in a sling. He descends, and in the rain-drenched gloom, a statue-like figure holding a parasol stands in the half-light, lowers the parasol, and strides toward him. Rambo turns on a lamp to disclose Marshall, a middle-aged man with tidy gray locks, clad in a dark trench coat over a collarless light blue garment. Rambo begins pondering and then walks toward him, before hammering a segment of heated metal, thrusting the alloy into scorching embers, and immersing the glowing metal in liquid, which chills to shape the form of a blade. On a rainy dawn, Reese, one of a mixed array of soldiers of fortune in Rambo's vessel—including whiskered Diaz and En-Joo, attractive stubbly School Boy, and hairless Lewis—chants, while Rambo resides at the helm, observing them. Lewis positions at the bow of the vessel, peering out at the stream, while Rambo gazes at Lewis expressionlessly. Lewis reciprocates the gaze, and Rambo looks vacantly forward. With an infuriated stare at Rambo, Lewis returns to the bow of the vessel and resumes his aggressive watchfulness while Rambo peers out across the aquatic surface as a flock of birds ascends collectively. A guard tower at a military base is enclosed by sharp wire as soldiers dine in a large mess tent, and one casually tosses scraps over his back into a cage of female captives outside. Three troopers march out of the mess hut as the Burmese banner is hoisted on a mast, beneath which are two lines of forlorn male captives, now army conscripts. A training officer punches one in the abdomen, and the camp huts rest on wooden supports as bases. Sarah lies bound beneath one, where the base is split into two parts, and in the part adjacent to Sarah, two plump hogs contest over nourishment. Through the slat, she observes a trooper walk from the hut as the leader and the assistant have an overview of a larger enclosure in which the hogs wander freely. Opposite the trooper's vantage position and above the pigpen is a cage in which the forlorn male remnants of Michael's group kneel, their hands tied behind them, and their faces filthy. One raises his head and meets the leader's gaze."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The remains of the village are littered with corpses, and huts and trees are being set on fire as the commander is watched by others, his eyes hidden behind his sunglasses. A misty mountain surrounded by green forests towers over a lake, where Rambo's boat is serenely at rest in its home harbor. The crucifix Sarah gave to him is toyed with by Rambo as he sits on the deck with his elbows resting on his knees, looks up thoughtfully, and then stands. Dark mountaintops are bombarded by sheets of lightning, and Rambo fills his thoughts suddenly with a montage of flashback images of himself in combat before he lies in a hammock. He climbs out, and in the rain-soaked darkness, a silhouette of a figurine holding an umbrella can be seen standing in the half-light, lowering the brolly, and walking toward him. A light is switched on by Rambo to reveal Marshall, a middle-aged man with neat gray hair, wearing a dark overcoat over a collarless pale blue shirt. Marshall is thought about by Rambo, and then he walks toward him, beats a piece of hot steel, shoves the metal into burning coals, and douses the white hot metal in water, which cools to form the shape of a machete. On a rainy morning, Reese sings in Rambo's boat, which includes a motley collection of mercenaries like bearded Diaz and En-Joo, handsome stubbly School Boy, and bald Lewis, while they are watched by Rambo as he sits at the tiller. The river is looked out at by Lewis as he stands at the prow of the boat, while Lewis is stared at blankly by Rambo. The stare is returned by Lewis, and ahead is gazed vacantly by Rambo. Rambo receives an angry glare from Lewis, who returns to the prow of the boat and continues his belligerent surveillance as the water surface is gazed across by Rambo as a flock of birds is seen taking off en masse. Razor wire surrounds a watchtower at a military camp as a large mess tent is occupied by troops eating, and leftovers are idly thrown over his shoulder by one into a cage of female prisoners outside. The Burmese flag is raised on a pole by three soldiers who troop out of the mess hut, beneath which two ranks of downcast male prisoners, now army draftees, stand. One is thumped in the stomach by a drill instructor, and the camp huts, which sit on timber with above-ground supports as foundations, can be seen. Bound beneath one lies Sarah, where the foundation is divided into two sections, and in the section next to Sarah, a fight over food is started by two fat pigs. Through the slat, a soldier is watched by her as he walks away from the hut, and the commander and the subordinate have an overview of a larger compound in which the pigs roam freely. Opposite the soldier's vantage point and above the piggery, a cage in which the downcast male survivors of Michael's party kneel, their hands tied behind them, and their faces muddy, is standing. The commander's eye is caught by one who lifts his head."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Corpses scatter the village remains, with huts and trees ablaze as the commander observes, his eyes behind sunglasses. Green forests surround a misty mountain overshadowing a lake where Rambo's boat rests. Rambo, on the deck, fiddles with the crucifix Sarah gave him, looks up pensively, and stands. Lightning strikes dark mountaintops, triggering Rambo's combat flashbacks before he rests in a hammock. Emerging from it, he sees a silhouette with an umbrella approach. Rambo turns on a light, revealing Marshall, a middle-aged man with neat gray hair and a dark overcoat over a collarless shirt. Rambo contemplates, then walks toward him, beats hot steel, immerses it in coals, and cools it in water, forming a machete. One rainy morning, Reese, among Rambo's diverse mercenary crew—including Diaz, En-Joo, School Boy, and Lewis—sings while Rambo watches from the tiller. Lewis, at the boat's prow, gazes at the river, exchanging blank stares with Rambo before resuming his vigilant watch as birds take flight. A military camp's watchtower is encircled by razor wire as troops eat, tossing leftovers into a cage of female prisoners. As the Burmese flag rises, two ranks of male prisoners stand beneath it, now army draftees. A drill instructor hits one, and the camp huts stand on elevated supports. Sarah lies bound beneath one, separated by a foundation from two pigs fighting over food. Through a slat, she sees a soldier leave as the commander and subordinate overlook a larger compound where pigs roam. Opposite, male survivors from Michael's party kneel in a cage, muddy-faced and bound, one catching the commander's eye."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Corpses scatter the village ruins, while huts and trees burn as the commander, with hidden eyes behind sunglasses, observes. Green forests encircle a misty mountain near a lake, where Rambo's boat rests. Rambo, on the deck, plays with Sarah’s crucifix, looks up, then stands as lightning strikes and combat flashbacks flood his mind. He lies in a hammock, later emerging into rain-soaked darkness to see a silhouette, who lowers an umbrella and approaches. Rambo turns on a light, revealing Marshall, a middle-aged man in a dark coat and pale blue shirt. Rambo ponders, approaches Marshall, works hot steel into a machete, cools it in water. On a rainy morning, mercenary Reese sings on Rambo's boat with bearded Diaz, En-Joo, School Boy, and Lewis. Rambo, at the tiller, stares vacantly at Lewis at the prow, who returns the stern gaze and resumes watching the river. Lewis’s angry glare meets Rambo’s blank stare as birds take off. A military camp is secured with razor wire, troops eat in a tent, discarding leftovers to caged female prisoners. Underneath raised huts, Sarah lies bound, pigs fight nearby, and she sees a soldier leave as the commander and subordinate overlook the compound. Next to Sarah, male prisoners kneel, dirty and tied, as one locks eyes with the commander."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Within the devastated remnants of the once-thriving village, corpses are scattered all around, and the huts and trees have been set ablaze, casting a fiery glow. The commander, standing at the scene, observes intently, his eyes concealed behind dark, reflective sunglasses. Encompassing the area, lush green forests cradle a misty mountain that looms majestically over a tranquil lake, where Rambo’s boat rests quietly in its familiar harbor. Rambo himself is perched on the deck, his elbows comfortably resting on his knees. He absentmindedly plays with the crucifix Sarah gifted him, manipulating it thoughtfully in his firm, sinewy hands, before gazing upwards in contemplation. Rising from his position, he stands with determination. Sinister sheets of lightning streak across the dark, ominous mountaintops, and suddenly, his mind is flooded with a rapid montage of vivid flashbacks, recalling moments of intense combat.\n\nEventually, Rambo reclines in a hammock, seemingly at ease. However, he soon climbs out as a figure's silhouette emerges in the rain-drenched darkness, holding an umbrella. This figure stands momentarily in the dim half-light before lowering the umbrella and confidently walking toward him. Rambo then switches on a light, illuminating Marshall, a middle-aged man with neatly groomed gray hair, who wears a dark overcoat layered over a collarless, pale blue shirt. Rambo begins to ponder deeply about something and then moves purposefully toward Marshall. Subsequently, Rambo forcefully hammers a piece of hot steel, pushing the heated metal into roaring coals before plunging the white-hot metal into water, watching as it cools into the intimidating shape of a machete.\n\nOn a rainy and overcast morning, aboard Rambo's boat, Reese—who is among a diverse group of mercenaries—breaks into song. This eclectic group includes individuals like bearded Diaz and En-Joo, as well as the handsome and stubbly School Boy, alongside the bald Lewis. Rambo sits quietly at the tiller, attentively observing them. Meanwhile, Lewis stands resolutely at the prow of the boat, gazing intently out at the meandering river. Rambo, in turn, stares at Lewis, his expression blank and unreadable. Lewis meets his gaze before Rambo shifts his vacant glance forward. With a frustrated and angry glare aimed at Rambo, Lewis turns back to the prow, resuming his vigilant watch as Rambo directs his gaze across the expanse of water, witnessing a flock of birds taking off in unison.\n\nAt a nearby military camp, a watchtower is encircled by sharp razor wire. Inside, troops sit down to eat in a large mess tent, and one soldier nonchalantly throws his leftovers over his shoulder into a cage filled with female prisoners just outside. Three soldiers subsequently exit the mess hut as the Burmese flag is ceremoniously raised on a tall pole. Beneath its fluttering fabric are two ranks of downcast male prisoners, now forcibly drafted into the army. A harsh drill instructor violently punches one in the stomach, while camp huts, perched on timber with above-ground supports, form the structural foundations. Beneath one such hut, Sarah lays bound, confined within a divided foundation area. In the adjacent section, two fat pigs squabble aggressively over scraps of food. Through the narrow slats, she watches intently as a soldier walks away from the hut. Meanwhile, the commander and his subordinate survey a larger compound, within which the pigs wander freely. Directly opposite the soldier’s viewpoint, and positioned above the chaotic piggery, a cage holds the subdued male survivors of Michael’s group. They kneel in submission, their hands bound tightly behind them, their faces smeared with mud. One survivor manages to lift his head, catching the commander’s eye with a desperate glance."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Amidst the desolate and devastated remains of what was once a thriving village, bodies lie scattered all around like remnants of a forgotten tragedy. The huts and trees have been set ablaze, casting an eerie, fiery glow over the entire scene. Standing at the edge of this destruction, the commander observes intently, his piercing gaze concealed behind dark, reflective sunglasses that mask any emotion. Encompassing the area, lush green forests stretch out, cradling a misty mountain that looms majestically in the distance. This mountain overlooks a tranquil lake, where Rambo's boat sits quietly in its familiar harbor, undisturbed by the chaos. Rambo himself is perched on the deck, with his elbows comfortably resting on his knees, lost in thought. He absently fiddles with the crucifix that Sarah gifted him, manipulating it thoughtfully in his strong, sinewy hands, before he lifts his gaze upwards in deep contemplation. Rising from his seated position, he stands with determination etched on his face. Sinister sheets of lightning streak across the ominous, dark mountaintops, and suddenly, his mind is overwhelmed with a rapid montage of vivid flashbacks, each recalling moments of intense and relentless combat.\n\nEventually, Rambo reclines in a hammock, appearing to be at ease, though his mind remains restless. This tranquility is short-lived, as he soon rises and climbs out when he notices a figure's silhouette emerging from the rain-drenched darkness, holding an umbrella. This figure stands momentarily in the dim half-light before lowering the umbrella and confidently making their way toward him. In response, Rambo switches on a light, illuminating Marshall, who is revealed to be a middle-aged man with neatly groomed gray hair. Marshall is dressed in a dark overcoat layered over a collarless, pale blue shirt. As Rambo takes in this sight, he begins to ponder deeply about something significant before moving purposefully in Marshall’s direction. Subsequently, Rambo forcefully hammers a piece of hot steel, driving the heated metal into the roaring coals. With precision, he then plunges the white-hot metal into water, watching as it cools into the fearsome and intimidating shape of a machete.\n\nOn a rainy and overcast morning, aboard Rambo's boat, a sense of camaraderie emerges as Reese—one among a diverse group of mercenaries—breaks into a lively song. This eclectic group includes unique individuals like the bearded Diaz and En-Joo, as well as the handsome, stubbly School Boy, and the bald Lewis. Meanwhile, Rambo sits quietly at the tiller, attentively observing the group’s interaction. Lewis, on the other hand, stands resolutely at the prow of the boat, his gaze fixed intently on the meandering river ahead. Rambo, in turn, locks eyes with Lewis, his expression remaining blank and unreadable. After sharing a momentary gaze, Rambo shifts his vacant glance forward. With frustration and anger flashing in his eyes, Lewis turns back to the prow, resuming his vigilant watch. As this unfolds, Rambo directs his gaze across the expanse of water, noticing a flock of birds taking off in perfect unison.\n\nAt a nearby military camp, a watchtower is encircled by sharp razor wire, serving as a grim warning. Inside the camp, troops sit down to eat in a large, bustling mess tent. One soldier, showing little regard, nonchalantly throws his leftovers over his shoulder into a cage filled with female prisoners just outside. Three soldiers then exit the mess hut as the Burmese flag is ceremoniously raised on a tall, conspicuous pole. Beneath its fluttering fabric, two ranks of downcast male prisoners stand, having been forcibly drafted into the army. A harsh drill instructor violently punches one of them in the stomach, while the camp huts, which appear perched on timber with above-ground supports, form the structural foundations. Beneath one such hut, Sarah lies bound, confined within a divided foundation area. In the adjacent section, two fat pigs squabble aggressively over scraps of food. Through the narrow slats, she watches intently as a soldier walks away from the hut. Meanwhile, the commander and his subordinate survey a larger compound, within which pigs wander freely. Directly opposite the soldier’s viewpoint, and positioned above the chaotic piggery, a cage holds the subdued male survivors of Michael’s group. They kneel in forced submission, their hands bound tightly behind them, their faces smeared with mud. One survivor manages to lift his head, catching the commander’s eye with a desperate, pleading glance."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "The village lays in ruin with strewn corpses across its grounds, while huts and trees are engulfed in flames, casting flickering shadows. In the distance, the commander surveys the devastation, his eyes obscured by sunglasses that hide any hint of emotion. Encircling the scene is a lush expanse of green forests, which cradle a misty mountain looming prominently over a tranquil lake. At this lake, Rambo's boat sits peacefully at its home harbor, untouched by the chaos. Rambo himself is perched on the deck, his elbows comfortably resting on his knees. He is absorbed in thought as he plays with the crucifix, a poignant gift from Sarah, letting it move through his sinewy hands. A moment of reflection leads him to look up with a contemplative expression, and this propels him to rise to his feet. Nature mirrors the inner turmoil with sheets of lightning that violently strike the darkened mountaintops, igniting a series of intense flashbacks in Rambo's mind, images of his time in combat flashing rapidly before him, each one leaving an imprint on his memory. This tumult within leads him to seek solace by lying in a hammock, attempting to find calm amidst the storm. Eventually, he climbs out of the hammock into the enveloping darkness of rain-soaked night. In the dim, watery light, a silhouette emerges, holding an umbrella that shields it from the downpour. As it approaches, the figure lowers the umbrella, revealing itself to be a person moving purposefully toward him. In response, Rambo flicks on a light, casting illumination on Marshall, a man of middle age with neatly groomed gray hair. Marshall wears a dark overcoat that covers a collarless pale blue shirt, presenting an aura of calm authority. Rambo pauses, thoughts swirling in his mind, before he makes his way toward Marshall, intent on addressing whatever lies between them. This transition leads him to engage in the physical task of beating a piece of hot steel, his actions methodical and purposeful. He shoves the heated metal into burning coals, allowing it to absorb the intense heat, then plunges the white-hot metal into water, watching as it cools and solidifies into the distinctive form of a machete. The next day dawns with rain still falling. On this rainy morning, the ambiance shifts as Reese, a member of the diverse group of mercenaries aboard Rambo's boat, starts to sing. Around him are his companions, each distinct in appearance—bearded Diaz, the striking and stubbly School Boy, and the bald Lewis. Rambo, meanwhile, is seated at the boat's tiller, his gaze fixed on the group, observing their interactions and the dynamics between them. On the prow of the boat, Lewis assumes a stance, eyes scanning the river before him. Rambo meets Lewis's gaze with a blank expression, a silent exchange occurring between them. Lewis responds with a stare of his own before turning back to maintain his vigilant lookout at the prow, continuing his intense scrutiny of the surroundings. Meanwhile, Rambo's eyes drift across the water's surface thoughtfully as a flock of birds suddenly ascends in a flurry, capturing his attention. The scene shifts to a military camp, where a watchtower stands ominously, its perimeter secured with razor wire. Inside a large mess tent, troops eat, some indulging in idle behavior. One soldier casually discards leftovers, tossing them over his shoulder into a nearby cage containing female prisoners. The camp bustles with activity as three soldiers exit the mess hut with purpose, their attention drawn to the ceremonial raising of the Burmese flag on a pole outside. Below it, two lines of downcast male prisoners, now forced army draftees, stand wearily. A drill instructor moves amongst them, abruptly striking one in the stomach as a form of coercive discipline. The camp's infrastructure consists of huts perched on timber foundations, elevated slightly above the ground. Beneath one such hut, Sarah lies confined, her form bound and restricted. The foundation here is split into two sections, and in the adjacent space, two fat pigs squabble fiercely over scraps of food. Peering through the slats of her confinement, Sarah witnesses a soldier walking away from the hut. Meanwhile, the commander and his subordinate stand at a distance with a comprehensive view overlooking a larger compound, where pigs roam with a semblance of freedom. From Sarah's perspective, directly opposing the soldier's vantage point, is a cage elevated over the piggery. Inside it are the downcast male survivors from Michael's party, restrained with their hands tied behind them, faces smeared with mud. Among them, one man dares to lift his head, his eyes meeting the commander's gaze, an unspoken exchange occurring in that brief, yet powerful, moment."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Corpses and burning wreckage litter the village as the commander observes the devastation, his eyes obscured by sunglasses. Nearby, a misty mountain looms over a lake, where Rambo's boat rests at the home harbor. On the deck, Rambo sits contemplating the crucifix Sarah gave him, lost in thought, before standing and experiencing a flashback of combat images. He then lies in a hammock but soon rises as a silhouetted figure approaches in the rain. Rambo switches on a light, revealing Marshall, a neatly dressed middle-aged man. After a moment of introspection, Rambo crafts a machete, heating and cooling the metal into shape. On a rainy morning, Rambo and a group of mercenaries, including Reese, Diaz, En-Joo, School Boy, and Lewis, are on the boat. While Reese sings, Lewis stands watch at the prow, exchanging tense looks with Rambo before resuming his vigil. As Rambo gazes across the water, a flock of birds takes flight. At a military camp, surrounded by razor wire, troops dine in a mess tent, tossing scraps into a cage of female prisoners. As the Burmese flag is raised, male prisoners, now army draftees, stand dejected, while a drill instructor assaults one of them. In a separate area, Sarah lies bound beneath a hut divided into sections, watching a soldier depart while pigs fight nearby. Above the pigpen, male survivors from Michael's party are caged, muddy and restrained, one meeting the commander's gaze."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Corpses litter the remains of the village devastated in the conflict, and huts and trees are on fire as the commander, a man renowned for his ruthlessness in battle, watches, his eyes hidden behind reflective aviator sunglasses. Green forests, a hallmark of the region's lush biodiversity, surround a misty mountain that towers impressively over a lake, where Rambo's boat, a modest fishing vessel, sits serenely at its home harbor. Rambo sits on the deck with his elbows resting on his knees, toying with the crucifix Sarah gave him, a simple token of faith and friendship, in his sinewy hands. He looks up thoughtfully, pondering the weight of his past actions, and then stands. Sheets of lightning, akin to the destructive storms of the monsoon season, bombard dark mountaintops, and a montage of flashback images of Rambo in combat—reminders of his time as a Green Beret during the Vietnam War—suddenly fills his thoughts before Rambo lies in a hammock, seeking solace. He climbs out, and in the rain-soaked darkness of the dense jungle, a figurine silhouette holding an umbrella, a rare accessory in these remote areas, stands in the half-light, lowers the brolly, and walks toward him. Rambo switches on a light to reveal Marshall, a middle-aged man known for his meticulous appearance and diplomacy, wearing a dark overcoat over a collarless pale blue shirt. Rambo starts thinking about something with the intensity of a man haunted by decisions, then walks toward him, before beating a piece of hot steel, an old forging technique for crafting tools, shoving the metal into burning coals, and dousing the white-hot metal in water, which cools to form the shape of a machete, an essential tool for survival in the jungle. On a rainy morning, Reese, one of a motley collection of mercenaries aboard Rambo's boat—including bearded Diaz, a former cartel enforcer, En-Joo, an expert in explosives, handsome stubbly School Boy, a sharpshooter with a penchant for poetry, and bald Lewis, a former British SAS operative—sings a tune reminiscent of his homeland, while Rambo sits at the tiller, watching them with an unreadable expression. Lewis stands at the prow of the boat, looking out at the river, scanning for threats with trained vigilance, while Rambo stares at Lewis blankly, his mind elsewhere. Lewis returns the stare with the cold calculation of a seasoned soldier, and Rambo looks vacantly ahead. With an angry glare at Rambo, indicating underlying tensions, Lewis returns to the prow of the boat and continues his belligerent surveillance while Rambo gazes out across the water surface as a flock of birds, startled by the approaching boat, takes off en masse. A watchtower at a military camp is surrounded by razor wire, an ominous sign of the site's captivity, as troops eat in a large mess tent, and one idly throws leftovers, showing disdain for the prisoners' welfare, over his shoulder into a cage of female prisoners outside. Three soldiers troop out of the mess hut as the Burmese flag, representing the military's dominance in the region, is raised on a pole, beneath which are two ranks of downcast male prisoners, now forced army draftees. A drill instructor thumps one in the stomach, a harsh method of discipline, and the camp huts sit on timber with above-ground supports as foundations, a design to prevent flooding during heavy rains. Sarah lies bound beneath one, where the foundation is divided into two sections, and in the section next to Sarah, two fat pigs, oblivious to the suffering around them, fight over food. Through the slat, she watches a soldier, a mere cog in the oppressive regime, walk away from the hut as the commander and the subordinate have an overview of a larger compound in which the pigs roam freely, a stark contrast to the confined prisoners. Opposite the soldier's vantage point and above the piggery is a cage in which the downcast male survivors of Michael's party—an aid group caught in the conflict—kneel, their hands tied behind them, and their faces muddy. One lifts his head and catches the commander's eye, a brave yet futile gesture in a place ruled by fear."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Sarah lies bound beneath one where the foundation is divided into two sections and in the section next to Sarah two fat pigs fight over food Corpses litter the remains of the village and huts and trees are on fire as the commander watches his eyes hidden behind his sunglasses Rambo sits on the deck with his elbows resting on his knees toying with the crucifix Sarah gave him in his sinewy hands looks up thoughtfully and then stands On a rainy morning Reese one of a motley collection of mercenaries in Rambo's boat—including bearded Diaz and EnJoo handsome stubbly School Boy and bald Lewis—sings while Rambo sits at the tiller watching them Green forests surround a misty mountain that towers over a lake where Rambo's boat sits serenely at its home harbor Sheets of lightning bombard dark mountaintops and a montage of flashback images of Rambo in combat suddenly fills his thoughts before Rambo lies in a hammock With an angry glare at Rambo Lewis returns to the prow of the boat and continues his belligerent surveillance Green forests surround a misty mountain that towers over a lake where Rambo's boat sits serenely at its home harbor Rambo sits on the deck with his elbows resting on his knees toying with the crucifix Sarah gave him in his sinewy hands looks up thoughtfully and then stands Sheets of lightning bombard dark mountaintops and a montage of flashback images of Rambo in combat suddenly fills his thoughts before Rambo lies in a hammock He climbs out and in the rainsoaked darkness a figurine silhouette holding an umbrella stands in the halflight lowers the brolly and walks toward him Rambo switches on a light to reveal Marshall a middleaged man with neat gray hair wearing a dark overcoat over a collarless pale blue shirt Rambo starts thinking about something and then walks toward him before beating a piece of hot steel shoving the metal into burning coals and dousing the white hot metal in water which cools to form the shape of a machete On a rainy morning Reese one of a motley collection of mercenaries in Rambo's boat—including bearded Diaz and EnJoo handsome stubbly School Boy and bald Lewis—sings while Rambo sits at the tiller watching them Lewis stands at the prow of the boat looking out at the river while Rambo stares at Lewis blankly Lewis returns the stare and Rambo looks vacantly ahead Lewis returns the stare and Rambo looks vacantly ahead With an angry glare at Rambo Lewis returns to the prow of the boat and continues his belligerent surveillance Through the slat she watches a soldier walk away from the hut as the commander and the subordinate have an overview of a larger compound in which the pigs roam freely Lewis stands at the prow of the boat looking out at the river while Rambo gazes out across the water surface as a flock of birds takes off en masse A watchtower at a military camp is surrounded by razor wire as troops eat in a large mess tent and one idly throws leftovers over his shoulder into a cage of female prisoners outside Three soldiers troop out of the mess hut as the Burmese flag is raised on a pole beneath which are two ranks of downcast male prisoners now army draftees A drill instructor thumps one in the stomach and the camp huts sit on timber with aboveground supports as foundations Sarah lies bound beneath one where the foundation is divided into two sections and in the section next to Sarah two fat pigs fight over food Corpses litter the remains of the village and huts and trees are on fire as the commander watches his eyes hidden behind his sunglasses Through the slat she watches a soldier walk away from the hut as the commander and the subordinate have an overview of a larger compound in which the pigs roam freely Opposite the soldier's vantage point and above the piggery is a cage in which the downcast male survivors of Michael's party kneel their hands tied behind them and their faces muddy One lifts his head and catches the commander's eye"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Corpses litter the remains of the village and huts and trees are on fire as the commander watches his eyes hidden behind his sunglasses. Green forests surround a misty mountain that towers over a lake where Rambo's boat sits serenely at its home harbor. Rambo sits on the deck with his elbows resting on his knees toying with the crucifix Sarah gave him in his sinewy hands looks up thoughtfully and then stands. Sheets of lightning bombard dark mountaintops and a montage of flashback images of Rambo in combat suddenly fills his thoughts before Rambo lies in a hammock. He climbs out and in the rainsoaked darkness a figurine silhouette holding an umbrella stands in the halflight lowers the brolly and walks toward him. Rambo switches on a light to reveal Marshall a middleaged man with neat gray hair wearing a dark overcoat over a collarless pale blue shirt. Rambo starts thinking about something and then walks toward him before beating a piece of hot steel shoving the metal into burning coals and dousing the white hot metal in water which cools to form the shape of a machete. On a rainy morning Reese one of a motley collection of mercenaries in Rambo's boat—including bearded Diaz and EnJoo handsome stubbly School Boy and bald Lewis—sings while Rambo sits at the tiller watching them. Lewis stands at the prow of the boat looking out at the river. while Rambo stares at Lewis blankly. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Lewis returns the stare and Rambo looks vacantly ahead. With an angry glare at Rambo Lewis returns to the prow of the boat and continues his belligerent surveillance. while Rambo gazes out across the water surface as a flock of birds takes off en masse. A watchtower at a military camp is surrounded by razor wire as troops eat in a large mess tent and one idly throws leftovers over his shoulder into a cage of female prisoners outside. Three soldiers troop out of the mess hut as the Burmese flag is raised on a pole beneath which are two ranks of downcast male prisoners now army draftees. A drill instructor thumps one in the stomach and the camp huts sit on timber with aboveground supports as foundations. Sarah lies bound beneath one where the foundation is divided into two sections and in the section next to Sarah two fat pigs fight over food. Through the slat she watches a soldier walk away from the hut as the commander and the subordinate have an overview of a larger compound in which the pigs roam freely. Opposite the soldier's vantage point and above the piggery is a cage in which the downcast male survivors of Michael's party kneel their hands tied behind them and their faces muddy. One lifts his head and catches the commander's eye."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Corpses litter the remains of the village and huts and trees are on fire as the commander watches his eyes hidden behind his sunglasses. Green forests surround a misty mountain that towers over a lake where Rambo's boat sits serenely at its home harbor. Rambo sits on the deck with his elbows resting on his knees toying with the crucifix Sarah gave him in his sinewy hands looks up thoughtfully and then stands. Sheets of lightning bombard dark mountaintops and a montage of flashback images of Rambo in combat suddenly fills his thoughts before Rambo lies in a hammock. He climbs out and in the rainsoaked darkness a figurine silhouette holding an umbrella stands in the halflight lowers the brolly and walks toward him. Rambo switches on a light to reveal Marshall a middleaged man with neat gray hair wearing a dark overcoat over a collarless pale blue shirt. Rambo starts thinking about something and then walks toward him before beating a piece of hot steel shoving the metal into burning coals and dousing the white hot metal in water which cools to form the shape of a machete. On a rainy morning Reese one of a motley collection of mercenaries in Rambo's boat—including bearded Diaz and EnJoo handsome stubbly School Boy and bald Lewis—sings while Rambo sits at the tiller watching them. Lewis stands at the prow of the boat looking out at the river. while Rambo stares at Lewis blankly. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. Lewis returns the stare and Rambo looks vacantly ahead. With an angry glare at Rambo Lewis returns to the prow of the boat and continues his belligerent surveillance. while Rambo gazes out across the water surface as a flock of birds takes off en masse. A watchtower at a military camp is surrounded by razor wire as troops eat in a large mess tent and one idly throws leftovers over his shoulder into a cage of female prisoners outside. Three soldiers troop out of the mess hut as the Burmese flag is raised on a pole beneath which are two ranks of downcast male prisoners now army draftees. A drill instructor thumps one in the stomach and the camp huts sit on timber with aboveground supports as foundations. Sarah lies bound beneath one where the foundation is divided into two sections and in the section next to Sarah two fat pigs fight over food. Through the slat she watches a soldier walk away from the hut as the commander and the subordinate have an overview of a larger compound in which the pigs roam freely. Opposite the soldier's vantage point and above the piggery is a cage in which the downcast male survivors of Michael's party kneel their hands tied behind them and their faces muddy. One lifts his head and catches the commander's eye."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Corpses litter the remains of the village and huts and trees are on fire as the commander watches his eyes hidden behind his sunglasses. Green forests surround a misty mountain that towers over a lake where Rambo's boat sits serenely at its home harbor. Rambo sits on the deck with his elbows resting on his knees toying with the crucifix Sarah gave him in his sinewy hands looks up thoughtfully and then stands. Sheets of lightning bombard dark mountaintops and a montage of flashback images of Rambo in combat suddenly fills his thoughts before Rambo lies in a hammock. He climbs out and in the rainsoaked darkness a figurine silhouette holding an umbrella stands in the halflight lowers the brolly and walks toward him. A drill instructor thumps one in the stomach and the camp huts sit on timber with aboveground supports as foundations. Sarah lies bound beneath one where the foundation is divided into two sections and in the section next to Sarah two fat pigs fight over food. Through the slat she watches a soldier walk away from the hut as the commander and the subordinate have an overview of a larger compound in which the pigs roam freely. Opposite the soldier's vantage point and above the piggery is a cage in which the downcast male survivors of Michael's party kneel their hands tied behind them and their faces muddy. One lifts his head and catches the commander's eye."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Corpses litter the remains of the village and huts and trees are on fire as the commander watches his eyes hidden behind his sunglasses. Green forests surround a misty mountain that towers over a lake where Rambo's boat sits serenely at its home harbor. Opposite the soldier's vantage point and above the piggery is a cage in which the downcast male survivors of Michael's party kneel their hands tied behind them and their faces muddy. One lifts his head and catches the commander's eye."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Giraffes litter the remains of the village, and huts and trees are on fire as the musician watches, his eyes hidden behind his sunglasses. Green forests surround a misty mountain that towers over a lake, where the panda's boat sits serenely at its home harbor. The panda sits on the deck with his elbows resting on his knees, toying with the crucifix Sarah gave him in his sinewy hands, looks up thoughtfully, and then stands. Sheets of lightning bombard dark mountaintops, and a montage of flashback images of the panda in combat suddenly fills his thoughts before the panda lies in a hammock. The panda climbs out, and in the rain-soaked darkness, a figurine silhouette holding an umbrella stands in the half-light, lowers the brolly, and walks toward the panda. The panda switches on a light to reveal a squirrel, a middle-aged man with neat gray hair, wearing a dark overcoat over a collarless pale blue shirt. The panda starts thinking about something and then walks toward the squirrel, before beating a piece of hot steel, shoving the metal into burning coals, and dousing the white hot metal in water, which cools to form the shape of a machete. On a rainy morning, Miranda, one of a motley collection of mercenaries in the panda's boat—including bearded Diaz and En-Joo, handsome stubbly School Boy, and bald Lewis—sings, while the panda sits at the tiller, watching them. Lewis stands at the prow of the boat, looking out at the river, while the panda stares at Lewis blankly. Lewis returns the stare, and the panda looks vacantly ahead. With an angry glare at the panda, Lewis returns to the prow of the boat and continues his belligerent surveillance while the panda gazes out across the water surface as a flock of birds takes off en masse. A watchtower at a military camp is surrounded by razor wire as troops eat in a large mess tent, and one idly throws leftovers over his shoulder into a cage of female prisoners outside. Three dancers troop out of the mess hut as the Burmese flag is raised on a pole, beneath which are two ranks of downcast male prisoners, now army draftees. A florist thumps one in the stomach, and the camp huts sit on timber with above-ground supports as foundations. Sarah lies bound beneath one, where the foundation is divided into two sections, and in the section next to Sarah, two fat pigs fight over food. Through the slat, she watches a chef walk away from the hut as the musician and the artist have an overview of a larger compound in which the pigs roam freely. Opposite the chef's vantage point and above the piggery is a cage in which the downcast male survivors of Michael's party kneel, their hands tied behind them, and their faces muddy. One lifts his head and catches the musician's eye."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Debris covers the ruins of the plaza, and igloos and cacti are ablaze as the commander watches, his eyes hidden behind his monocle. Sandy deserts surround a foggy hill that towers over a fountain, where Rambo's caravan sits serenely at its home garage. Rambo sits on the porch with his elbows resting on his knees, toying with the amulet Sarah gave him in his sinewy hands, looks up thoughtfully, and then stands. Sheets of hail bombard dark cliff tops, and a montage of flashback images of Rambo in battle suddenly fills his thoughts before Rambo lies in a hammock. He climbs out, and in the dew-soaked dusk, a puppet silhouette holding a parasol stands in the half-light, lowers the parasol, and walks toward him. Rambo switches on a lantern to reveal Marshall, a middle-aged man with neat gray hair, wearing a dark raincoat over a collarless pale yellow shirt. Rambo starts thinking about something and then walks toward him, before beating a piece of hot clay, shoving the material into burning embers, and dousing the white hot material in oil, which cools to form the shape of a sword. On a misty morning, Reese, one of a motley collection of mercenaries in Rambo's caravan—including bearded Diaz and En-Joo, handsome stubbly School Boy, and bald Lewis—whistles, while Rambo sits at the helm, watching them. Lewis stands at the nose of the caravan, looking out at the desert, while Rambo stares at Lewis blankly. Lewis returns the stare, and Rambo looks vacantly ahead. With an irritated glare at Rambo, Lewis returns to the nose of the caravan and continues his belligerent watch while Rambo gazes out across the sand surface as a pack of sheep takes off en masse. A lighthouse at a military camp is surrounded by barbed wire as troops feast in a large dining pavilion, and one idly throws crumbs over his shoulder into a pen of female captives outside. Three guards march out of the dining lodge as the Burmese flag is raised on a mast, beneath which are two rows of downcast male inmates, now army recruits. A drill sergeant thumps one in the stomach, and the camp lodges sit on stone with above-ground scaffolding as foundations. Sarah lies bound beneath one, where the foundation is divided into two sections, and in the section next to Sarah, two plump goats fight over fodder. Through the slat, she watches a guard walk away from the lodge as the commander and the aide have an overview of a larger estate in which the goats roam freely. Opposite the guard's position and above the goat pen is a cell in which the downcast male survivors of Michael's crew kneel, their hands tied behind them, and their faces muddy. One lifts his head and catches the commander's eye."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Corpses decorate the remains of the village, and huts and trees are being painted as the commander observes, his eyes concealed behind his sunglasses. Green forests border a misty mountain that leans over a lake, where Rambo's boat rocks gently at its home harbor. Rambo reclines on the deck with his elbows resting on his knees, flipping the crucifix Sarah gave him in his sinewy hands, peers up thoughtfully, and then rises. Sheets of lightning stroke dark mountaintops, and a montage of flashback images of Rambo in combat suddenly distracts him before Rambo swings in a hammock. He descends, and in the rain-soaked darkness, a figurine silhouette carrying an umbrella stands in the half-light, raises the brolly, and strides toward him. Rambo turns off a light to conceal Marshall, a middle-aged man with neat gray hair, wearing a dark overcoat over a collarless pale blue shirt. Rambo stops contemplating something and then strolls toward him, before twisting a piece of hot steel, pulling the metal from burning coals, and submerging the white hot metal in water, which cools to form the shape of a machete. On a rainy morning, Reese, one of a motley collection of mercenaries in Rambo's boat—including bearded Diaz and En-Joo, handsome stubbly School Boy, and bald Lewis—whistles, while Rambo reclines at the tiller, listening to them. Lewis sits at the prow of the boat, gazing out at the river, while Rambo observes Lewis blankly. Lewis averts the stare, and Rambo glances vacantly ahead. With a furious frown at Rambo, Lewis pivots to the prow of the boat and resumes his hostile observation while Rambo scans out across the water surface as a flock of birds rests en masse. A watchtower at a military camp is draped with razor wire as troops nap in a large mess tent, and one casually tosses leftovers over his shoulder into a cage of female prisoners outside. Three soldiers march out of the mess hut as the Burmese flag descends on a pole, beneath which are two ranks of downcast male prisoners, now army draftees. A drill instructor taps one on the shoulder, and the camp huts perch on timber with above-ground supports as foundations. Sarah lies nestled beneath one, where the foundation is split into two sections, and in the section next to Sarah, two fat pigs nap over food. Through the slat, she witnesses a soldier wander away from the hut as the commander and the subordinate have an overview of a larger compound in which the pigs lounge freely. Opposite the soldier's lookout point and above the piggery is a cage in which the downcast male survivors of Michael's party sit, their hands tied behind them, and their faces pristine. One raises his head and loses the commander's attention."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Dictionaries litter the remains of the garden, and pillows and keyboards are on fire as the librarian watches, her eyes hidden behind her earmuffs. Blue deserts surround a foggy skyscraper that towers over a violin, where the painter's couch sits serenely at its home balcony. The painter sits on the rug with her elbows resting on her ankles, toying with the amulet Emily gave her in her slender feet, looks up thoughtfully, and then stands. Sheets of rain bombard dark rooftops, and a montage of flashback images of the painter in ballet suddenly fills her thoughts before the painter lies in a blanket. She climbs out, and in the snow-soaked sunshine, a mannequin silhouette holding a lantern stands in the half-light, lowers the torch, and walks toward her. The painter switches on a fan to reveal Leonard, a young woman with messy pink hair, wearing a bright jacket over a collarless dark green shirt. The painter starts thinking about something and then walks toward her, before smoothing a piece of cold paper, shoving the ink into glowing candles, and dipping the cold paper in glue, which cools to form the shape of a hat. On a sunny evening, Lisa, one of a peculiar collection of baristas in the painter's couch—including clean-shaven Victor and Alice, charming bearded Carpenter, and tall Lily—dances, while the painter sits at the radio, watching them. Lily stands at the edge of the couch, looking out at the mountains, while the painter stares at Lily blankly. Lily returns the stare, and the painter looks vacantly ahead. With an angry glance at the painter, Lily returns to the edge of the couch and continues her contemplative painting while the painter gazes out across the hill surface as a herd of deer takes off en masse. A lamppost at a culinary school is surrounded by barbed string as instructors cook in a large dining hall, and one idly tosses letters over her shoulder into a pool of male trainees outside. Three cooks parade out of the dining table as the Italian flag is hoisted on a branch, beneath which are two rows of anxious female trainees, now culinary students. A teacher thumps one in the knee, and the school tables sit on carpet with underground supports as foundations. Emily lies bound beneath one, where the foundation is divided into two sections, and in the section next to Emily, two scruffy dogs fight over toys. Through the slit, she watches a teacher walk away from the table as the librarian and the neighbor have an overview of a larger library in which the dogs roam freely. Opposite the teacher's vantage point and above the kennel is a pool in which the anxious female teachers of Richard's choir kneel, their legs tied behind them, and their faces sleepy. One lifts her head and catches the librarian's eye."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Ghosts scatter the ruins of the jungle, and skyscrapers and hills are submerged as the painter marvels, his eyes hidden behind his goggles. Blue deserts encompass a foggy volcano that looms over an ocean, where Anna's train rests peacefully at its main station. Anna lounges on the balcony with her chin propped on her palms, fiddling with the amulet David gave her in her nimble fingers, glances up dreamily, and then rises. Bolts of lightning assault shadowy hillsides, and a series of flash-forward visions of Anna dancing suddenly occupies her mind before Anna reclines in a hammock. She leaps out, and in the sunlit brightness, a puppet figure wielding a parasol emerges in the semi-shade, raises the parasol, and glides toward her. Anna flicks on a lamp to reveal William, a young man with unruly red hair, dressed in a light cardigan over a bright pink t-shirt. Anna begins contemplating something and then ambles toward him, before molding a chunk of cool clay, plunging the clay into sparkling water, and submerging the solidified clay in oil, which forms into the shape of a vase. On a sunny afternoon, Taylor, one of an eccentric band of musicians on Anna's train—including grinning Nathan and Lou, charmingly clean-shaven Jack, and curly-haired Duncan—plays, while Anna lounges at the helm, observing them. Duncan sits at the back of the train, gazing out at the tracks, while Anna peers at Duncan blankly. Duncan returns the glance, and Anna gazes distractedly forward. With a curious squint at Anna, Duncan returns to the back of the train and resumes his intense watch while Anna surveys the horizon as a flock of butterflies takes flight collectively. A lighthouse at a refugee camp is enclosed by chain-link fence as guests feast in a large banquet hall, and one absentmindedly tosses crumbs over his shoulder into a pen of male captives outside. Three officers march out of the banquet room as the American flag is hoisted on a pole, beneath which are two lines of forlorn female captives, now community volunteers. A guard pats one on the back, and the camp lounges sit on bricks with underground supports as bases. David rests tied beneath one, where the base is split into two areas, and in the area next to David, two large cows wrestle over water. Through the gap, he observes a guard stroll away from the lounge as the painter and the assistant have a vantage of a smaller compound in which the cows roam independently. Opposite the guard's viewpoint and above the pen is a cell in which the forlorn female survivors of Michael's group crouch, their wrists bound behind them, and their expressions weary. One raises her head and catches the painter's attention."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Cadavers scatter the ruins of the town, and sheds and bushes are ablaze as the commander observes, his eyes concealed behind his spectacles. Verdant jungles encircle a foggy volcano that looms over a pond, where Rambo's raft drifts calmly at its resting dock. Rambo perches on the veranda with his elbows balanced on his thighs, fidgeting with the amulet Sarah gifted him in his muscled fingers, gazes up pensively, and then rises. Bolts of thunder strike dim peaks, and a sequence of flashback visions of Rambo in battle abruptly fills his mind before Rambo reclines in a hammock. He descends, and in the drizzle-soaked shadow, a puppet outline clutching a parasol stands in the twilight, collapses the cover, and marches toward him. Rambo flicks on a lamp to unveil Marshall, a middle-aged person with tidy gray curls, wearing a dark trench coat over a collarless sky blue blazer. Rambo begins pondering something and then ambles toward him, before hammering a chunk of cold iron, plunging the alloy into freezing embers, and soaking the chilled iron in oil, which hardens to form the shape of a dagger. On a stormy dawn, Reese, one of a varied crew of mercenaries on Rambo's raft—including bearded Diaz and En-Joo, attractive scruffy School Boy, and bald Lewis—hums, while Rambo lounges at the helm, observing them. Lewis stands at the edge of the raft, peering out at the creek, while Rambo watches Lewis listlessly. Lewis meets the gaze, and Rambo looks vacuously forward. With a menacing look at Rambo, Lewis returns to the edge of the raft and resumes his confrontational watch while Rambo surveys out across the pond surface as a pack of insects takes flight together. A lookout at a military base is encircled by barbed cord as soldiers feast in a spacious dining tent, and one nonchalantly tosses scraps over his shoulder into a pen of male detainees outside. Three troopers march out of the dining cabin as the Burmese emblem is hoisted on a staff, beneath which are two lines of dejected female captives, now military recruits. An instructor slaps one in the back, and the base cabins rest on planks with elevated supports as pedestals. Sarah lies tethered beneath one, where the pedestal is split into two areas, and in the area next to Sarah, two large dogs scuffle over scraps. Through the bar, she observes a guard stroll away from the cabin as the commander and the aide have a view of a bigger site in which the dogs wander freely. Across the guard's lookout and above the kennel is a cell in which the dejected female remnants of Michael's group kneel, their arms restrained behind them, and their faces soiled. One lifts her head and catches the commander's look."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Bones clutter the edges of the garden, and tents and bushes are aflame as the mechanic observes, his gaze hidden behind his goggles. Yellow deserts enclose a foggy skyscraper that looms over a pond, where Maverick's bicycle rests calmly at its starting dock. Maverick leans on the pedals, fiddling with the amulet Lucy handed him in his lean fingers, glances up ponderously, and then rises. Flashes of thunder batter bright hilltops, and a sequence of memory fragments of Maverick in a race abruptly floods his mind before Maverick reclines in a hammock. He extracts himself, and in the drizzle-drenched shadows, a doll-like figure wielding a parasol waits in the dimness, drops the shelter, and strides toward him. Maverick flicks on a lantern to uncover Walker, a mature woman with tidy ebony hair, draped in a light trench coat over a sleeveless tan dress. Maverick begins pondering something and then strolls toward her, before striking a piece of cold glass, thrusting the shard into icy flames, and plunging the glowing glass in oil, which hardens into the outline of a spear. On a snowy afternoon, Carter, one of a diverse ensemble of chefs in Maverick's bicycle—including bearded Harold and Jo-Anne, charming beardless Scout, and curly Robin—hums, while Maverick sits at the handlebars, observing them. Robin stands at the back of the bicycle, peering at the stream, while Maverick gazes at Robin vacantly. Robin reciprocates the gaze, and Maverick peers aimlessly forward. With a scornful look at Maverick, Robin returns to the back of the bicycle and resumes his vigilant inspection while Maverick watches out across the liquid expanse as a cluster of insects rises collectively. A watchtower at a research station is enclosed by thorny vines as researchers dine in a massive communal hut, and one absentmindedly discards scraps over his shoulder into a cage of male captives outside. Three assistants shuffle out of the dining structure as the local banner is hoisted on a beam, beneath which are two columns of dejected female detainees, now study participants. A trainer jabs one in the ribs, and the camp lodges rest on stone with raised posts as bases. Lucy lies restrained beneath one, where the base is split into two portions, and in the section adjacent to Lucy, two lean goats tussle over scraps. Through the gap, she observes a guard depart from the lodge as the mechanic and the aide have a perspective of a broader settlement in which the goats wander unconfined. Opposite the guard's lookout and above the livestock pen is a cage in which the despondent female remnants of Jacob's squad crouch, their hands secured behind them, and their faces grimy. One lifts her gaze and meets the mechanic's eye."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Corpses scatter across the burning village, as huts and trees blaze behind a sunglass-clad commander. Nearby, Rambo's boat is moored by a serene lake under a misty mountain. Rambo, handling a crucifix from Sarah, reflects and stands as lightning strikes and combat memories haunt him. Emerging from a hammock, he encounters Marshall, an older man with neat gray hair, who approaches in the rain. Rambo forges a machete, heating and cooling the metal. On a rainy morning, mercenaries, including Reese, Diaz, En-Joo, School Boy, and Lewis, travel with Rambo. Tension arises as Rambo and Lewis exchange stares before Lewis resumes watching the river. Meanwhile, in a military camp, a watchtower is encircled by razor wire. Troops dine while female prisoners remain caged outside. Male prisoners, now conscripted soldiers, are abused as Sarah lies bound nearby. She witnesses her captors through slats as soldiers survey a larger compound. Above the pigsty, caged male survivors of Michael’s group kneel, muddy and tied, one briefly meeting the commander's gaze."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "One lifts his head and catches the commander's eye Opposite the soldier's vantage point and above the piggery is a cage in which the downcast male survivors of Michael's party kneel their hands tied behind them and their faces muddy Through the slat she watches a soldier walk away from the hut as the commander and the subordinate have an overview of a larger compound in which the pigs roam freely Sarah lies bound beneath one where the foundation is divided into two sections and in the section next to Sarah two fat pigs fight over food A drill instructor thumps one in the stomach and the camp huts sit on timber with aboveground supports as foundations Three soldiers troop out of the mess hut as the Burmese flag is raised on a pole beneath which are two ranks of downcast male prisoners now army draftees A watchtower at a military camp is surrounded by razor wire as troops eat in a large mess tent and one idly throws leftovers over his shoulder into a cage of female prisoners outside while Rambo gazes out across the water surface as a flock of birds takes off en masse With an angry glare at Rambo Lewis returns to the prow of the boat and continues his belligerent surveillance Lewis returns the stare and Rambo looks vacantly ahead while Rambo stares at Lewis blankly Lewis stands at the prow of the boat looking out at the river On a rainy morning Reese one of a motley collection of mercenaries in Rambo's boat—including bearded Diaz and EnJoo handsome stubbly School Boy and bald Lewis—sings while Rambo sits at the tiller watching them Rambo starts thinking about something and then walks toward him before beating a piece of hot steel shoving the metal into burning coals and dousing the white hot metal in water which cools to form the shape of a machete Rambo switches on a light to reveal Marshall a middleaged man with neat gray hair wearing a dark overcoat over a collarless pale blue shirt He climbs out and in the rainsoaked darkness a figurine silhouette holding an umbrella stands in the halflight lowers the brolly and walks toward him Sheets of lightning bombard dark mountaintops and a montage of flashback images of Rambo in combat suddenly fills his thoughts before Rambo lies in a hammock Rambo sits on the deck with his elbows resting on his knees toying with the crucifix Sarah gave him in his sinewy hands looks up thoughtfully and then stands Green forests surround a misty mountain that towers over a lake where Rambo's boat sits serenely at its home harbor Corpses litter the remains of the village and huts and trees are on fire as the commander watches his eyes hidden behind his sunglasses"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "With an angry glare at Rambo Lewis returns to the prow of the boat and continues his belligerent surveillance Sheets of lightning bombard dark mountaintops and a montage of flashback images of Rambo in combat suddenly fills his thoughts before Rambo lies in a hammock while Rambo gazes out across the water surface as a flock of birds takes off en masse Lewis stands at the prow of the boat looking out at the river Through the slat she watches a soldier walk away from the hut as the commander and the subordinate have an overview of a larger compound in which the pigs roam freely Rambo starts thinking about something and then walks toward him before beating a piece of hot steel shoving the metal into burning coals and dousing the white hot metal in water which cools to form the shape of a machete He climbs out and in the rainsoaked darkness a figurine silhouette holding an umbrella stands in the halflight lowers the brolly and walks toward him while Rambo stares at Lewis blankly Rambo switches on a light to reveal Marshall a middleaged man with neat gray hair wearing a dark overcoat over a collarless pale blue shirt Lewis returns the stare and Rambo looks vacantly ahead Rambo sits on the deck with his elbows resting on his knees toying with the crucifix Sarah gave him in his sinewy hands looks up thoughtfully and then stands Corpses litter the remains of the village and huts and trees are on fire as the commander watches his eyes hidden behind his sunglasses A drill instructor thumps one in the stomach and the camp huts sit on timber with aboveground supports as foundations Three soldiers troop out of the mess hut as the Burmese flag is raised on a pole beneath which are two ranks of downcast male prisoners now army draftees Opposite the soldier's vantage point and above the piggery is a cage in which the downcast male survivors of Michael's party kneel their hands tied behind them and their faces muddy On a rainy morning Reese one of a motley collection of mercenaries in Rambo's boat—including bearded Diaz and EnJoo handsome stubbly School Boy and bald Lewis—sings while Rambo sits at the tiller watching them Green forests surround a misty mountain that towers over a lake where Rambo's boat sits serenely at its home harbor Sarah lies bound beneath one where the foundation is divided into two sections and in the section next to Sarah two fat pigs fight over food One lifts his head and catches the commander's eye A watchtower at a military camp is surrounded by razor wire as troops eat in a large mess tent and one idly throws leftovers over his shoulder into a cage of female prisoners outside"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Lewis returns the stare and Rambo looks vacantly ahead With an angry glare at Rambo Lewis returns to the prow of the boat and continues his belligerent surveillance while Rambo gazes out across the water surface as a flock of birds takes off en masse A watchtower at a military camp is surrounded by razor wire as troops eat in a large mess tent and one idly throws leftovers over his shoulder into a cage of female prisoners outside Three soldiers troop out of the mess hut as the Burmese flag is raised on a pole beneath which are two ranks of downcast male prisoners now army draftees A drill instructor thumps one in the stomach and the camp huts sit on timber with aboveground supports as foundations Sarah lies bound beneath one where the foundation is divided into two sections and in the section next to Sarah two fat pigs fight over food Through the slat she watches a soldier walk away from the hut as the commander and the subordinate have an overview of a larger compound in which the pigs roam freely Opposite the soldier's vantage point and above the piggery is a cage in which the downcast male survivors of Michael's party kneel their hands tied behind them and their faces muddy One lifts his head and catches the commander's eye Corpses litter the remains of the village and huts and trees are on fire as the commander watches his eyes hidden behind his sunglasses Green forests surround a misty mountain that towers over a lake where Rambo's boat sits serenely at its home harbor Rambo sits on the deck with his elbows resting on his knees toying with the crucifix Sarah gave him in his sinewy hands looks up thoughtfully and then stands Sheets of lightning bombard dark mountaintops and a montage of flashback images of Rambo in combat suddenly fills his thoughts before Rambo lies in a hammock He climbs out and in the rainsoaked darkness a figurine silhouette holding an umbrella stands in the halflight lowers the brolly and walks toward him Rambo switches on a light to reveal Marshall a middleaged man with neat gray hair wearing a dark overcoat over a collarless pale blue shirt Rambo starts thinking about something and then walks toward him before beating a piece of hot steel shoving the metal into burning coals and dousing the white hot metal in water which cools to form the shape of a machete On a rainy morning Reese one of a motley collection of mercenaries in Rambo's boat—including bearded Diaz and EnJoo handsome stubbly School Boy and bald Lewis—sings while Rambo sits at the tiller watching them Lewis stands at the prow of the boat looking out at the river while Rambo stares at Lewis blankly"
        }
      ]
    }
  ]
}