{
  "ground_truth": "Ben gets out of his car and admires a shiny BMW convertible parked beside him, then walks past elderly ladies, one using a Zimmer frame, who shuffle down a corridor. Ben strides towards the reception window, shows IRS ID, and passes a suited man sitting on the edge of Inez's bed. Inez reaches for a pad, but the man grabs her wrist, then notices Ben, causing her to shun his touch and ignore him. The man approaches Ben, looking awkward and leaning forward, while Ben stares impassively. Ben nods, cocks his head as he continues staring, straightens up, smiles faintly, picks up his briefcase, and disdainfully shakes the man's hand. Ben enters Inez's room where she lies frail and white-haired in bed, ignoring him with a sigh. Ben gives a kindly smile, but Inez stares ahead, stony-faced. Ben places his briefcase on the floor, gingerly moves a chair towards her bed, and sits at her bedside. Despite Inez's vacant stare, Ben gently smiles as she turns her head to look at him. With heavily lined features, Inez stares pensively at Ben, turns stiffly, and reaches out a bony hand to pick up her writing pad and pen. Inez studies Ben again, then writes something down, pauses, writes more, and looks at Ben wearily with her lip quivering. She weeps, looks tearful at Ben's encouraging smile, and writes again. As Ben reads, his brow furrows and he looks dismayed while Inez's face crumples, and she weeps. Feeling deeply moved, Ben raises his clasped hands to his mouth, hurriedly carries Inez out, puts her in a wheelchair, and wheels her past reception. Confronting Goodman, Ben pushes his head against a window and marches out. On a sunny golf course, a woman in a short skirt and T-shirt, and a guy in chinos and a polo shirt, get out of a golf buggy and walk to a ball. Ben approaches them, hugs them, but then Michelle moves away, and Ben looks the man in the eye and shakes his head. A network of freeway flyovers appears in the sunshine as Ben drives his saloon. In a hospital canteen, an elderly patient with a drip stand walks while most tables, decorated with vases of yellow flowers, are occupied. Sitting at a table, Ben reads, then looks up from his book to watch a woman with two young boys drawing at a nearby table.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Certainly! Here's the transformed text:\n\nBen exits from his automobile and admires a gleaming BMW convertible parked beside him, then strides past elderly women, one employing a Zimmer frame, who shuffle down a passage. Ben strides towards the reception window, displays IRS ID, and passes a suited gentleman sitting on the edge of Inez's bed. Inez reaches for a pad, but the gentleman seizes her wrist, then notices Ben, causing her to shun his contact and disregard him. The gentleman approaches Ben, appearing uncomfortable and leaning forward, while Ben gazes impassively. Ben nods, tilts his head as he continues gazing, straightens up, smiles faintly, picks up his briefcase, and disdainfully shakes the gentleman's hand. Ben enters Inez's room where she lies frail and white-haired in bed, disregarding him with a sigh. Ben gives a kindly smile, but Inez gazes ahead, stony-faced. Ben places his briefcase on the floor, gingerly moves a chair towards her bed, and sits at her bedside. Despite Inez's vacant gaze, Ben gently smiles as she turns her head to look at him. With deeply lined features, Inez gazes pensively at Ben, turns stiffly, and reaches out a bony hand to pick up her writing pad and pen. Inez studies Ben again, then writes something down, pauses, writes more, and looks at Ben wearily with her lip quivering. She weeps, looks tearful at Ben's encouraging smile, and writes again. As Ben reads, his brow furrows and he looks dismayed while Inez's face crumples, and she weeps. Feeling deeply moved, Ben raises his clasped hands to his mouth, hurriedly carries Inez out, places her in a wheelchair, and wheels her past reception. Confronting Goodman, Ben pushes his head against a window and marches out. On a sunny golf course, a woman in a short skirt and T-shirt, and a man in chinos and a polo shirt, emerge from a golf buggy and walk to a ball. Ben approaches them, embraces them, but then Michelle moves away, and Ben looks the man in the eye and shakes his head. A network of freeway flyovers appears in the sunshine as Ben drives his saloon. In a hospital canteen, an elderly patient with a drip stand walks while most tables, decorated with vases of yellow flowers, are occupied. Sitting at a table, Ben reads, then looks up from his book to watch a woman with two young boys drawing at a nearby table."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Ben gets out of his car and admires a shiny BMW convertible parked beside him, then elderly ladies, one using a Zimmer frame, are walked past by him as they shuffle down a corridor. The reception window is approached by Ben, IRS ID is shown by him, and he passes a suited man sitting on the edge of Inez's bed. A pad is reached for by Inez, but her wrist is grabbed by the man, then he notices Ben, causing her to shun his touch and ignore him. Ben is approached by the man, who looks awkward and leans forward, while an impassive stare is given by Ben. A nod is given by Ben, his head is cocked as he continues staring, then he straightens up, smiles faintly, picks up his briefcase, and disdainfully shakes the man's hand. Inez's room is entered by Ben, where she lies frail and white-haired in bed, and he is ignored by her with a sigh. A kindly smile is given by Ben, but a stony-faced stare ahead is given by Inez. His briefcase is placed on the floor by Ben, he gingerly moves a chair towards her bed, and then he sits at her bedside. Despite Ben's gentle smile as she turns her head to look at him, she stares vacantly. With heavily lined features, Inez pensively stares at Ben, then stiffly turns, reaching out a bony hand to pick up her writing pad and pen. She studies Ben again, writes something down, pauses, writes more, and looks at him wearily, with her lip quivering. She weeps, looking tearful at his encouraging smile, and writes again. As he reads, his brow furrows, and dismay appears on his face while Inez's face crumples, and she weeps. Feeling deeply moved, his clasped hands are raised to his mouth by Ben, who hurriedly carries Inez out, puts her in a wheelchair, and past reception, she is wheeled. Goodman is confronted by Ben, who pushes his head against a window and marches out. On a sunny golf course, a golf buggy is exited by a woman in a short skirt and T-shirt, and a guy in chinos and a polo shirt, who walk to a ball. Ben approaches them, and he hugs them, but then Michelle moves away, and Ben looks the man in the eye and shakes his head. A network of freeway flyovers appears in the sunshine as Ben drives his saloon. In a hospital canteen, an elderly patient with a drip stand walks while vases of yellow flowers decorate most tables, which are occupied. At a table, Ben sits reading, then looks up from his book to watch a woman with two young boys drawing at a nearby table."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Ben exits his car and admires a shiny BMW convertible nearby before walking past elderly ladies in a corridor, one using a Zimmer frame. He strides to the reception window, presents IRS ID, and passes a suited man beside Inez's bed. Inez reaches for a pad, but the man grabs her wrist, then notices Ben, leading her to reject his touch. The man approaches Ben awkwardly, while Ben stares impassively. Ben nods, cocks his head, straightens, smiles faintly, picks up his briefcase, and disdainfully shakes the man's hand. In Inez's room, she lies frail, white-haired, and ignores Ben with a sigh. Ben gives a kindly smile, but Inez remains stony-faced. He places his briefcase down, carefully moves a chair, and sits by her. Despite her vacant stare, Ben gently smiles as she turns to him. With lined features, Inez pensively looks at Ben, turns stiffly, and reaches for her writing pad and pen. She studies Ben, writes, pauses, continues writing, and looks at Ben wearily, her lip quivering. She weeps, tearful at Ben's encouraging smile, and writes again. As Ben reads, his brow furrows in dismay, and Inez's face crumples as she weeps. Deeply moved, Ben raises his clasped hands, hurriedly carries Inez out, puts her in a wheelchair, and wheels her past reception. Confronting Goodman, Ben pushes his head against a window and marches out. On a sunny golf course, a woman in a short skirt and T-shirt, and a man in chinos and a polo shirt, exit a golf buggy and approach a ball. Ben joins them, hugs them, but Michelle moves away, and Ben looks at the man, shaking his head. A network of freeway flyovers glistens in the sun as Ben drives his saloon. In a hospital canteen, an elderly patient with a drip stand walks while most tables, adorned with yellow flowers, are occupied. At a table, Ben reads, then looks up from his book to watch a woman with two young boys drawing nearby."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Ben exits his car, admires a BMW convertible, and walks past elderly ladies, one with a Zimmer frame. He approaches the reception window, shows IRS ID, and sees a suited man on Inez's bed. The man grips Inez’s wrist, then notices Ben, prompting Inez to reject his touch. Looking uncomfortable, the man approaches Ben, who impassively nods, then smiles faintly and shakes his hand disdainfully. Entering Inez's room, Ben finds her frail and white-haired, ignoring him. He smiles kindly, places his briefcase down, moves a chair, and sits beside her. Although Inez initially stares vacantly, she eventually looks at Ben, her features lined, and reaches for her pad. Studying Ben, she writes, pauses, writes more, and looks at him with quivering lips. She cries as Ben encourages her with a smile. Reading her notes, Ben becomes dismayed, and seeing Inez weep, he feels deeply moved. Ben swiftly carries Inez out in a wheelchair, past reception, confronts Goodman, pushes his head against a window, and leaves. On a sunny golf course, a woman in a skirt and a man in chinos exit a buggy. Ben approaches, hugs them; Michelle moves away, Ben shakes his head at the man. Later, Ben drives his saloon, with freeway flyovers visible in the sunshine. In a hospital canteen, an elderly patient with a drip walks while tables, adorned with yellow flowers, are mostly occupied. Ben reads at a table, then watches a woman and two boys drawing nearby."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Ben exits his car with a sense of purpose and takes a moment to admire a sleek, shiny BMW convertible parked right beside him. He then makes his way past a group of elderly ladies, one of whom is using a Zimmer frame as they slowly shuffle down a narrow corridor. With determined strides, Ben approaches the reception window, confidently displaying his IRS ID. He then moves past a suited man who is perched on the edge of Inez's bed. As Inez attempts to reach for a pad, the man seizes her wrist, but upon noticing Ben, she recoils from his touch and chooses to ignore him. The man awkwardly makes his way towards Ben, leaning forward in a hesitant manner, while Ben remains staring impassively. Ben gives a nod, tilts his head slightly while continuing his unwavering gaze, straightens his posture, offers a faint smile, and then lifts his briefcase with an air of disdain before shaking the man's hand.\n\nEntering the room where Inez lies frail and white-haired in bed, Ben is met with her indifferent sigh as she deliberately ignores him. Despite her stony expression, Ben offers her a kindly smile. Placing his briefcase carefully on the floor, he gingerly drags a chair closer to her bed and takes a seat beside her. Even as Inez maintains a vacant stare, Ben continues to smile gently, experiencing a moment of connection when she finally turns her head to meet his eyes. Her heavily lined features are contemplative as she gazes pensively at Ben, then stiffly turns and extends a bony hand to grasp her writing pad and pen. Inez examines Ben once more, scribbles something down, pauses for a brief moment, jots more notes, and looks at Ben with weariness, her lip trembling with emotion. As she lets her tears flow, Ben responds with an encouraging smile, which prompts her to write yet again. When Ben reads her words, his brow furrows in concern, and he looks visibly dismayed. Inez’s face crumples as she continues to weep, deeply affected by the situation. Feeling profoundly moved, Ben raises his clasped hands to his mouth in contemplation, then swiftly lifts Inez from her bed, places her into a wheelchair, and wheels her past the reception area with urgency. In a confrontation with Goodman, Ben forcefully pushes his head against a window and confidently marches out.\n\nOn a sunlit golf course, a woman dressed in a short skirt and a T-shirt, accompanied by a man in chinos and a polo shirt, emerge from a golf buggy and walk towards a ball on the fairway. Ben makes his way over to them, warmly embracing them both, but then Michelle steps away. In response, Ben fixes his gaze directly into the man’s eyes, shaking his head in a meaningful gesture. As he drives his saloon car, a network of freeway flyovers unfolds before him in the bright sunshine. Inside a bustling hospital canteen, an elderly patient maneuvers a drip stand while navigating through the space, with most of the tables, adorned with vases of vibrant yellow flowers, being occupied by people. Seated at one of these tables, Ben immerses himself in a book, but he soon looks up from his reading to observe a nearby woman with two young boys who are engrossed in drawing activities at an adjacent table."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Ben steps out of his car with a clear sense of purpose etched on his face, and he pauses for a brief moment to admire a sleek and shiny BMW convertible that is parked right next to him. After this momentary admiration, he proceeds forward, moving past a group of elderly ladies. Among this group, one lady is making use of a Zimmer frame to help her as they all slowly make their way down a narrow corridor. With determined strides, Ben approaches the reception window, where he confidently displays his IRS ID as a form of identification. He then continues on, walking past a man dressed in a suit who is perched on the edge of Inez's bed. As Inez reaches out to grab a pad, the suited man seizes her wrist, but when Inez notices Ben's presence, she instinctively recoils from the man’s touch and opts to ignore him. The man then awkwardly makes his way towards Ben, leaning forward in a hesitant manner, while Ben remains standing, staring impassively. Ben acknowledges him with a nod, tilts his head slightly while maintaining his unwavering gaze, straightens his posture, offers a faint smile, and finally lifts his briefcase with an air of disdain before firmly shaking the man’s hand.\n\nUpon entering the room where Inez lies frail and white-haired in bed, Ben is met by her indifferent sigh as she deliberately looks away, choosing to ignore him. Despite her stony expression, Ben offers her a kindly smile, hoping to break through her indifference. He carefully places his briefcase on the floor beside him and then gingerly drags a chair closer to her bed, taking a seat beside her. Even as Inez maintains her distant, vacant stare, Ben continues to smile gently, experiencing a fleeting moment of connection when she eventually and finally turns her head to meet his eyes. Her heavily lined features are contemplative as she gazes pensively at Ben, then she stiffly turns away and extends a bony hand to retrieve her writing pad and pen. Inez examines Ben once more, scribbles something down, pauses for a brief moment, then jots more notes before looking at Ben with weariness, her lip trembling with emotion. As she lets her tears flow freely, Ben responds with an encouraging smile, which prompts her to write once again. When Ben reads her words, his brow furrows in concern, and he looks visibly dismayed by the meaning conveyed. Inez’s face crumples further as she continues to weep, deeply affected by the situation. Feeling profoundly moved, Ben raises his clasped hands to his mouth in deep contemplation, then swiftly lifts Inez from her bed, places her into a wheelchair, and wheels her away with urgency past the reception area. In a confrontation with Goodman, Ben forcefully pushes his head against a window before confidently marching out.\n\nOn a sunlit golf course, a woman dressed in a short skirt and a T-shirt, accompanied by a man in chinos and a polo shirt, emerge from a golf buggy and make their way toward a ball resting on the fairway. Ben approaches them and warmly embraces both individuals, but then Michelle steps away from the embrace. In response, Ben fixes his gaze directly into the man’s eyes and shakes his head in a meaningful gesture that speaks volumes. As he drives his saloon car afterward, a network of freeway flyovers unfolds before him in the bright, glaring sunshine, framing his path. Inside a bustling hospital canteen, an elderly patient carefully maneuvers a drip stand while navigating through the crowded space, with most of the tables, adorned with vases of vibrant yellow flowers, being occupied by various people. Seated at one of these tables, Ben immerses himself in a book, but soon he looks up from his reading to observe a nearby woman accompanied by two young boys who are deeply engrossed in drawing activities at an adjacent table."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Ben gently exits his car, takes a moment to appreciate the gleaming BMW convertible parked next to him, and then proceeds to walk past a group of elderly ladies, one of whom is using a Zimmer frame to assist her slow shuffling down the corridor. He confidently strides toward the reception window, presenting his IRS ID with a sense of purpose, and moves past a suited man who is perched on the edge of Inez's bed. Inez instinctively reaches for a nearby pad, but the man quickly holds onto her wrist, only to be distracted by Ben's presence, prompting Inez to pull away from his grasp and turn her attention away from him. The man awkwardly makes his way toward Ben, leaning forward in an attempt to engage, while Ben remains impassive, fixing him with a steady gaze. Ben gives a brief nod, tilts his head slightly as he continues the unyielding stare, straightens his posture, offers a faint smile, and with a look of disdain, extends his hand to shake the man's hand, all while picking up his briefcase. Transitioning into Inez's room, Ben finds her lying in bed, appearing frail and white-haired, choosing to ignore him with an audible sigh of disapproval. Unperturbed, Ben offers a gentle, kindly smile, though Inez maintains a stony, unresponsive gaze at the ceiling. He places his briefcase softly on the floor, carefully maneuvers a chair closer to her bed, and sits down by her side. Despite Inez's vacant stare, Ben's gentle smile persists as she slowly turns her head to focus on him. With features etched deeply with lines, Inez observes Ben thoughtfully, before turning with a deliberate stiffness to reach for her writing pad and pen with her thin, bony hand. She scrutinizes Ben once more, begins to jot down a few words, pauses briefly, scribbles additional thoughts, and glances up at Ben, weariness in her eyes accentuated by a quivering lip. Tears brim as she looks at Ben's encouraging smile, prompting her to write once again. As Ben takes in her words, his brow furrows in concern and dismay, matching the sorrowful crumpling of Inez's face as she starts to weep. Deeply affected by her distress, Ben clasps his hands, pressing them to his mouth in a gesture of empathy, before quickly moving to lift Inez from the bed, placing her carefully into a wheelchair, and navigating her briskly past the reception area. In a tense confrontation, Ben forcibly presses Goodman's head against a window, allowing his own frustration to propel him as he strides out. On a sunlit golf course, a woman dressed in a short skirt and T-shirt, alongside a man in chinos and a polo shirt, disembarks from a golf buggy, proceeding to approach a golf ball. Ben approaches them with a warm embrace, but when Michelle steps away from the group embrace, Ben locks eyes with the man and shakes his head, indicating his disapproval. Meanwhile, a network of freeway flyovers stretches out under the bright sun, serving as the backdrop for Ben as he drives his saloon car. Inside a bustling hospital canteen, an elderly patient, assisted by a drip stand, makes their way across the room, where most tables, adorned with vases of vibrant yellow flowers, are occupied with diners. Seated at one of the tables, Ben is engrossed in a book, occasionally lifting his gaze to observe a nearby table where a woman and two young boys are absorbed in their drawing activities."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Ben exits his car, briefly admiring a shiny BMW convertible parked nearby, before passing elderly ladies, one with a Zimmer frame, in a corridor. He strides to the reception window, shows his IRS ID, and passes a suited man at Inez's bedside. As Inez, frail and white-haired, dismisses the man's touch, he awkwardly approaches Ben. Ben, with an impassive stare, acknowledges him with a nod before dispassionately shaking his hand and entering Inez's room. Inside, Inez initially ignores Ben, who smiles kindly and sits by her bed. As she studies him, Inez picks up her writing pad and writes, growing tearful. Ben's encouraging smile prompts Inez to write more, but he looks dismayed as he reads her message. Deeply moved by Inez's weeping, Ben tenderly carries her to a wheelchair, wheels her past reception, confronts Goodman by pushing his head to a window, and exits. On a sunny golf course, Ben meets a woman and a man, greeting them warmly until the woman, Michelle, pulls away, leading Ben to shake his head at the man. Later, Ben drives through a network of freeway flyovers in his saloon. In a hospital canteen, surrounded by vases of yellow flowers, Ben reads at a table, occasionally looking up to watch a nearby woman and her two young boys drawing."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Ben, after emerging from his car, admires a shiny BMW convertible, a symbol of luxury and engineering excellence, parked beside him. He then walks past elderly ladies, one using a Zimmer frame, a common mobility aid for those with limited movement, who shuffle down a corridor of the assisted living facility. Ben strides towards the reception window, shows his IRS ID, a credential used by agents of the Internal Revenue Service to verify their identity, and passes a suited man sitting on the edge of Inez's bed. Inez reaches for a pad, but the man, whose demeanor suggests he is not welcome, grabs her wrist. He then notices Ben, causing Inez to shun his touch and ignore him. The man awkwardly approaches Ben, leaning forward in a gesture of attempted friendliness, while Ben stares impassively. Ben nods, cocks his head as he continues staring, straightens up, smiles faintly with the air of someone who knows he has the upper hand, picks up his briefcase, and disdainfully shakes the man's hand. Ben enters Inez's room where she lies frail and white-haired in bed, ignoring him with a sigh of resignation. Ben gives a kindly smile, but Inez, steadfast in her resolve, stares ahead, stony-faced. Ben places his briefcase, filled with IRS documents, on the floor, gingerly moves a chair towards her bed, and sits at her bedside. Despite Inez's vacant stare, Ben gently smiles as she turns her head to look at him, perhaps seeking comfort in his presence. With heavily lined features that speak of a life filled with experiences, Inez stares pensively at Ben, turns stiffly, and reaches out a bony hand to pick up her writing pad and pen. Inez studies Ben again, then writes something down, pauses as if collecting her thoughts, writes more, and looks at Ben wearily with her lip quivering, emotions clearly overwhelming her. She weeps, looks tearful at Ben's encouraging smile meant to reassure her, and writes again. As Ben reads, his brow furrows, reflecting the seriousness of the message, and he looks dismayed while Inez's face crumples, and she weeps, an expression of her bottled-up emotions. Feeling deeply moved by the gravity of the situation, Ben raises his clasped hands to his mouth, hurriedly carries Inez out, puts her in a wheelchair, a standard tool in such facilities for mobility, and wheels her past reception, drawing the curious eyes of the staff. Confronting Goodman, possibly someone of authority in the facility, Ben pushes his head against a window in an act of defiance and marches out. On a sunny golf course, known for its perfectly manicured greens, a woman in a short skirt and T-shirt, and a guy in chinos and a polo shirt, typical golf attire, get out of a golf buggy and walk to a ball. Ben approaches them, hugs them, indicating a close relationship, but then Michelle moves away, and Ben looks the man in the eye and shakes his head in silent communication. A network of freeway flyovers, a testament to modern urban infrastructure, appears in the sunshine as Ben drives his saloon, a classic style of car. In a hospital canteen, bustling with activity, an elderly patient with a drip stand walks, underscoring the healthcare setting, while most tables, decorated with vases of yellow flowers, typically used to bring cheer to hospital environments, are occupied. Sitting at a table, Ben reads, then looks up from his book to watch a woman with two young boys drawing at a nearby table, a scene that captures a moment of innocence and creativity amidst the clinical backdrop."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "On a sunny golf course a woman in a short skirt and Tshirt and a guy in chinos and a polo shirt get out of a golf buggy and walk to a ball With heavily lined features Inez stares pensively at Ben gets out of his car and admires a shiny BMW convertible parked beside him then walks past elderly ladies one using a Zimmer frame who shuffle down a corridor Ben nods cocks his head as he continues staring straightens up smiles faintly picks up his briefcase and disdainfully shakes the man's hand stonyfaced Ben strides towards the reception window shows IRS ID and passes a suited man sitting on the edge of Inez's bed The man approaches Ben looking awkward and leaning forward while Ben stares impassively Ben turns stiffly and reaches out a bony hand to pick up her writing pad and pen Ben strides towards the reception window shows IRS ID and passes a suited man sitting on the edge of Inez's bed Inez reaches for a pad but the man grabs her wrist then notices Ben causing her to shun his touch and ignore him The man approaches Ben looking awkward and leaning forward while Ben stares impassively Ben nods cocks his head as he continues staring straightens up smiles faintly picks up his briefcase and disdainfully shakes the man's hand As Ben reads his brow furrows and he looks dismayed while Inez's face crumples and she weeps Ben enters Inez's room where she lies frail and whitehaired in bed ignoring him with a sigh Ben gives a kindly smile but Inez stares ahead stonyfaced Ben places his briefcase on the floor gingerly moves a chair towards her bed and sits at her bedside Despite Inez's vacant stare Ben gently smiles as she turns her head to look at him With heavily lined features Inez stares pensively at Ben turns stiffly and reaches out a bony hand to pick up her writing pad and pen Ben places his briefcase on the floor gingerly moves a chair towards her bed and sits at her bedside Inez studies Ben again then writes something down pauses writes more and looks at Ben wearily with her lip quivering She weeps looks tearful at Ben's encouraging smile and writes again As Ben reads his brow furrows and he looks dismayed while Inez's face crumples and she weeps Feeling deeply moved Ben raises his clasped hands to his mouth hurriedly carries Inez out puts her in a wheelchair and wheels her past reception Confronting Goodman Ben pushes his head against a window and marches out Ben gets out of his car and admires a shiny BMW convertible parked beside him then walks past elderly ladies one using a Zimmer frame who shuffle down a corridor In a hospital canteen an elderly patient with a drip stand walks while most tables decorated with vases of yellow flowers are occupied On a sunny golf course a woman in a short skirt and Tshirt and a guy in chinos and a polo shirt get out of a golf buggy and walk to a ball Ben approaches them hugs them but then Michelle moves away and Ben looks the man in the eye and shakes his head A network of freeway flyovers appears in the sunshine as Ben drives his saloon In a hospital canteen an elderly patient with a drip stand walks while most tables decorated with vases of yellow flowers are occupied Sitting at a table Ben reads then looks up from his book to watch a woman with two young boys drawing at a nearby table"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Ben gets out of his car and admires a shiny BMW convertible parked beside him then walks past elderly ladies one using a Zimmer frame who shuffle down a corridor. Ben strides towards the reception window shows IRS ID and passes a suited man sitting on the edge of Inez's bed. Inez reaches for a pad but the man grabs her wrist then notices Ben causing her to shun his touch and ignore him. The man approaches Ben looking awkward and leaning forward while Ben stares impassively. Ben nods cocks his head as he continues staring straightens up smiles faintly picks up his briefcase and disdainfully shakes the man's hand. Ben enters Inez's room where she lies frail and whitehaired in bed ignoring him with a sigh. Ben gives a kindly smile but Inez stares ahead. stonyfaced. Ben places his briefcase on the floor gingerly moves a chair towards her bed and sits at her bedside. Despite Inez's vacant stare Ben gently smiles as she turns her head to look at him. With heavily lined features Inez stares pensively at. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Ben turns stiffly and reaches out a bony hand to pick up her writing pad and pen. Inez studies Ben again then writes something down pauses writes more and looks at Ben wearily with her lip quivering. She weeps looks tearful at Ben's encouraging smile and writes again. As Ben reads his brow furrows and he looks dismayed while Inez's face crumples and she weeps. Feeling deeply moved Ben raises his clasped hands to his mouth hurriedly carries Inez out puts her in a wheelchair and wheels her past reception. Confronting Goodman Ben pushes his head against a window and marches out. On a sunny golf course a woman in a short skirt and Tshirt and a guy in chinos and a polo shirt get out of a golf buggy and walk to a ball. Ben approaches them hugs them but then Michelle moves away and Ben looks the man in the eye and shakes his head. A network of freeway flyovers appears in the sunshine as Ben drives his saloon. In a hospital canteen an elderly patient with a drip stand walks while most tables decorated with vases of yellow flowers are occupied. Sitting at a table Ben reads then looks up from his book to watch a woman with two young boys drawing at a nearby table."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Ben gets out of his car and admires a shiny BMW convertible parked beside him then walks past elderly ladies one using a Zimmer frame who shuffle down a corridor. Ben strides towards the reception window shows IRS ID and passes a suited man sitting on the edge of Inez's bed. Inez reaches for a pad but the man grabs her wrist then notices Ben causing her to shun his touch and ignore him. The man approaches Ben looking awkward and leaning forward while Ben stares impassively. Ben nods cocks his head as he continues staring straightens up smiles faintly picks up his briefcase and disdainfully shakes the man's hand. Ben enters Inez's room where she lies frail and whitehaired in bed ignoring him with a sigh. Ben gives a kindly smile but Inez stares ahead. stonyfaced. Ben places his briefcase on the floor gingerly moves a chair towards her bed and sits at her bedside. Despite Inez's vacant stare Ben gently smiles as she turns her head to look at him. With heavily lined features Inez stares pensively at. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Ben turns stiffly and reaches out a bony hand to pick up her writing pad and pen. Inez studies Ben again then writes something down pauses writes more and looks at Ben wearily with her lip quivering. She weeps looks tearful at Ben's encouraging smile and writes again. As Ben reads his brow furrows and he looks dismayed while Inez's face crumples and she weeps. Feeling deeply moved Ben raises his clasped hands to his mouth hurriedly carries Inez out puts her in a wheelchair and wheels her past reception. Confronting Goodman Ben pushes his head against a window and marches out. On a sunny golf course a woman in a short skirt and Tshirt and a guy in chinos and a polo shirt get out of a golf buggy and walk to a ball. Ben approaches them hugs them but then Michelle moves away and Ben looks the man in the eye and shakes his head. A network of freeway flyovers appears in the sunshine as Ben drives his saloon. In a hospital canteen an elderly patient with a drip stand walks while most tables decorated with vases of yellow flowers are occupied. Sitting at a table Ben reads then looks up from his book to watch a woman with two young boys drawing at a nearby table."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Ben gets out of his car and admires a shiny BMW convertible parked beside him then walks past elderly ladies one using a Zimmer frame who shuffle down a corridor. Ben strides towards the reception window shows IRS ID and passes a suited man sitting on the edge of Inez's bed. Inez reaches for a pad but the man grabs her wrist then notices Ben causing her to shun his touch and ignore him. The man approaches Ben looking awkward and leaning forward while Ben stares impassively. Ben nods cocks his head as he continues staring straightens up smiles faintly picks up his briefcase and disdainfully shakes the man's hand. Ben enters Inez's room where she lies frail and whitehaired in bed ignoring him with a sigh. On a sunny golf course a woman in a short skirt and Tshirt and a guy in chinos and a polo shirt get out of a golf buggy and walk to a ball. Ben approaches them hugs them but then Michelle moves away and Ben looks the man in the eye and shakes his head. A network of freeway flyovers appears in the sunshine as Ben drives his saloon. In a hospital canteen an elderly patient with a drip stand walks while most tables decorated with vases of yellow flowers are occupied. Sitting at a table Ben reads then looks up from his book to watch a woman with two young boys drawing at a nearby table."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Ben gets out of his car and admires a shiny BMW convertible parked beside him then walks past elderly ladies one using a Zimmer frame who shuffle down a corridor. Ben strides towards the reception window shows IRS ID and passes a suited man sitting on the edge of Inez's bed. Inez reaches for a pad but the man grabs her wrist then notices Ben causing her to shun his touch and ignore him. In a hospital canteen an elderly patient with a drip stand walks while most tables decorated with vases of yellow flowers are occupied. Sitting at a table Ben reads then looks up from his book to watch a woman with two young boys drawing at a nearby table."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "A squirrel gets out of its car and admires a shiny BMW convertible parked beside it, then walks past elderly ladies, one using a Zimmer frame, who shuffle down a corridor. A squirrel strides towards the reception window, shows IRS ID, and passes a penguin sitting on the edge of Inez's bed. A giraffe reaches for a pad, but the penguin grabs her wrist, then notices a squirrel, causing her to shun the penguin's touch and ignore it. The penguin approaches a squirrel, looking awkward and leaning forward, while a squirrel stares impassively. A squirrel nods, cocks its head as it continues staring, straightens up, smiles faintly, picks up its briefcase, and disdainfully shakes the penguin's hand. A squirrel enters Inez's room where she lies frail and white-haired in bed, ignoring it with a sigh. A squirrel gives a kindly smile, but Inez stares ahead, stony-faced. A squirrel places its briefcase on the floor, gingerly moves a chair towards her bed, and sits at her bedside. Despite Inez's vacant stare, a squirrel gently smiles as she turns her head to look at it. With heavily lined features, Inez stares pensively at a squirrel, turns stiffly, and reaches out a bony hand to pick up her writing pad and pen. Inez studies a squirrel again, then writes something down, pauses, writes more, and looks at a squirrel wearily with her lip quivering. She weeps, looks tearful at a squirrel's encouraging smile, and writes again. As a squirrel reads, its brow furrows and it looks dismayed while Inez's face crumples, and she weeps. Feeling deeply moved, a squirrel raises its clasped hands to its mouth, hurriedly carries Inez out, puts her in a wheelchair, and wheels her past reception. Confronting a fox, a squirrel pushes its head against a window and marches out. On a sunny golf course, a cat in a short skirt and T-shirt, and a rabbit in chinos and a polo shirt, get out of a golf buggy and walk to a ball. A squirrel approaches them, hugs them, but then a dolphin moves away, and a squirrel looks the rabbit in the eye and shakes its head. A network of freeway flyovers appears in the sunshine as a squirrel drives its saloon. In a hospital canteen, a turtle with a drip stand walks while most tables, decorated with vases of yellow flowers, are occupied. Sitting at a table, a squirrel reads, then looks up from its book to watch a kangaroo with two young koalas drawing at a nearby table."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Ben gets out of his scooter and admires a gleaming Ferrari motorcycle parked beside him, then walks past elderly gentlemen, one using a skateboard, who glide down a hallway. Ben strides towards the ticket counter, shows FBI ID, and passes a suited man sitting on the edge of Inez's couch. Inez reaches for a tablet, but the man grabs her ankle, then notices Ben, causing her to shun his touch and ignore him. The man approaches Ben, looking awkward and leaning forward, while Ben stares impassively. Ben nods, cocks his head as he continues staring, straightens up, smiles faintly, picks up his backpack, and disdainfully shakes the man's hand. Ben enters Inez's cabin where she lies frail and white-haired on a sofa, ignoring him with a sigh. Ben gives a kindly smile, but Inez stares ahead, stony-faced. Ben places his backpack on the floor, gingerly moves a stool towards her sofa, and sits at her side. Despite Inez's vacant stare, Ben gently smiles as she turns her head to look at him. With heavily lined features, Inez stares pensively at Ben, turns stiffly, and reaches out a bony hand to pick up her sketchbook and pencil. Inez studies Ben again, then writes something down, pauses, writes more, and looks at Ben wearily with her lip quivering. She weeps, looks tearful at Ben's encouraging smile, and writes again. As Ben reads, his brow furrows and he looks dismayed while Inez's face crumples, and she weeps. Feeling deeply moved, Ben raises his clasped hands to his mouth, hurriedly carries Inez out, puts her in a shopping cart, and wheels her past the atrium. Confronting Goodman, Ben pushes his head against a bookshelf and marches out. On a sunny cricket field, a woman in a sundress and flip-flops, and a guy in jeans and a sweatshirt, get out of a go-kart and walk to a bat. Ben approaches them, hugs them, but then Michelle moves away, and Ben looks the man in the eye and shakes his head. A network of railway tracks appears in the sunshine as Ben rides his skateboard. In a school cafeteria, an elderly patient with an oxygen tank walks while most tables, decorated with vases of red roses, are occupied. Sitting at a table, Ben reads, then looks up from his magazine to watch a woman with two young girls coloring at a nearby table."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Ben exits his car and inspects a shiny BMW convertible parked beside him, then ambles past elderly ladies, one using a Zimmer frame, who meander down a corridor. Ben meanders towards the reception window, displays IRS ID, and acknowledges a suited man sitting on the edge of Inez's bed. Inez reaches for a pad, but the man pats her wrist, then observes Ben, prompting her to evade his touch and disregard him. The man approaches Ben, appearing awkward and leaning back, while Ben glances emotionlessly. Ben winks, tilts his head as he keeps looking, stands tall, grins slightly, picks up his briefcase, and reluctantly pats the man's shoulder. Ben steps into Inez's room where she lies frail and white-haired in bed, overlooking him with a sigh. Ben offers a warm smile, but Inez gazes ahead, expressionless. Ben places his briefcase on the floor, cautiously nudges a chair towards her bed, and stations himself at her bedside. Despite Inez's blank stare, Ben softly grins as she turns her head to glance at him. With heavily lined features, Inez peers contemplatively at Ben, twists rigidly, and extends a bony hand to grasp her writing pad and pen. Inez analyzes Ben again, then jots something down, hesitates, jots more, and gazes at Ben wearily with her lip quivering. She sobs, appears distressed at Ben's encouraging smile, and writes again. As Ben reads, his forehead wrinkles and he appears upset while Inez's face contorts, and she sobs. Feeling deeply affected, Ben places his clasped hands to his forehead, hastily ushers Inez out, places her in a wheelchair, and steers her past reception. Encountering Goodman, Ben shoves his head against a wall and strides out. On a sunny golf course, a woman in a short skirt and T-shirt, and a guy in chinos and a polo shirt, step out of a golf buggy and saunter to a ball. Ben reaches them, hugs them, but then Michelle withdraws, and Ben looks the man in the eye and nods his head. A network of freeway flyovers emerges in the sunshine as Ben maneuvers his saloon. In a hospital canteen, an elderly patient with a drip stand advances while most tables, decorated with vases of yellow flowers, are occupied. Sitting at a table, Ben skims, then glances up from his book to observe a woman with two young boys doodling at a nearby table."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Tim exits his bicycle and marvels at a gleaming Caterpillar bulldozer parked beside it, then ambles past youthful gentlemen, one using a pogo stick, who jog down a hallway. Tim strides towards the ticket kiosk, flashes FBI badge, and steps past a barefoot woman perched on the corner of Oliver's gurney. Oliver reaches for a spoon, but the woman seizes his elbow, then spots Tim, prompting him to evade her grasp and overlook her. The woman advances on Tim, appearing uneasy and leaning backward, while Tim gazes stoically. Tim nods, tilts his shoulder as he keeps gazing, straightens up, grins slightly, picks up his toolbox, and disdainfully pats the woman's shoulder. Tim enters Oliver's chamber where he rests robust and red-haired on a gurney, overlooking him with a grunt. Tim offers a gentle grin, but Oliver gazes forward, tight-lipped. Tim sets his toolbox on the ceiling, cautiously shifts a sofa towards his gurney, and settles at his side. Despite Oliver's empty gaze, Tim softly smiles as he turns his neck to glance at him. With smooth, youthful features, Oliver gazes thoughtfully at Tim, turns fluidly, and reaches out a supple hand to pick up his coloring book and crayon. Oliver examines Tim again, then scribbles something down, halts, scribbles more, and glances at Tim wearily with his chin trembling. He chuckles, looks delighted at Tim's encouraging smile, and scribbles again. As Tim reads, his eyelid twitches and he appears surprised while Oliver's brows furrow, and he chuckles. Feeling intensely touched, Tim lifts his folded arms to his nose, promptly cradles Oliver out, places him in an armchair, and wheels him past an information booth. Confronting Sandra, Tim nudges her shoulder against a wall and parades away. On a rainy baseball field, a man in a long coat and scarf, and a woman in leggings and a hoodie, leap out of a scooter and run to a trophy. Tim approaches them, pats them, but then Leonard steps aside, and Tim gazes the woman in the eye and shakes his ear. A cluster of mountain trails emerges in the fog as Tim pedals his hoverboard. In a library café, a young student with headphones strolls while most chairs, decorated with baskets of red apples, are vacant. Perched at a stool, Tim listens, then glances up from his audiobook to observe a man with two young girls painting at a nearby stool."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Carlos climbs out of his boat and admires a shiny Porsche convertible parked beside it, then hops past teenage boys, one using crutches, who jog down a hallway. Carlos skips towards the reception counter, flashes FBI ID, and greets a laughing girl sitting on the edge of Oliver's bed. Oliver reaches for a book, but the girl waves her hand, then notices Carlos, causing him to drop his smile and dismiss him. The girl bounces towards Carlos, looking uncertain and standing upright, while Carlos gazes emotionlessly. Carlos winks, tilts his head as he continues gazing, bends down, grins subtly, grabs his backpack, and indifferently nods at the girl's hand. Carlos enters Oliver's room where he lies robust and black-haired in bed, dismissing him with a huff. Carlos offers a gentle grin, but Oliver looks away, expressionless. Carlos sets his backpack on the table, carefully pushes a stool towards his bed, and perches at his bedside. Despite Oliver's vacant look, Carlos warmly grins as he turns his head to see him. With heavily lined features, Oliver gazes thoughtfully at Carlos, turns gently, and extends a steady hand to grab his sketchbook and pencil. Oliver examines Carlos again, then draws something, hesitates, sketches more, and gazes at Carlos wearily with his lip trembling. He laughs, looks joyful at Carlos's encouraging grin, and sketches again. As Carlos reads, his brow tenses and he looks disappointed while Oliver's face tightens, and he laughs. Feeling deeply moved, Carlos raises his clasped hands to his chest, gently carries Oliver over, places him in a rocking chair, and rolls him past reception. Meeting Samantha, Carlos presses his head against a pillar and shuffles away. On a sunny tennis court, a man in jeans and a hoodie, and a lady in shorts and a tank top, step out of a golf buggy and skip to a racket. Carlos approaches them, pats them, but then Felicia steps away, and Carlos looks the lady in the eye and nods knowingly. A maze of railway bridges appears in the sunshine as Carlos navigates his minivan. In a hospital garden, a youthful visitor with a cane skips while most benches, adorned with pots of blue flowers, are occupied. Perched on a bench, Carlos sketches, then looks up from his notebook to observe a man with two young girls painting at a nearby bench."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Ben hops out of his bicycle and gazes at a rusty tractor parked beside him, then saunters past young girls, one holding a skateboard, who dance down a hallway. Ben jogs towards the vending machine, flashes a library card, and skips a man in overalls perched on the arm of Inez's chair. Inez reaches for a newspaper, but the man pulls her elbow, then spots Ben, prompting her to swat his hand away and dismiss him. The man sidles up to Ben, looking clumsy and slouching, while Ben glances nonchalantly. Ben winks, tilts his chin as he keeps glancing, stands still, grins softly, grabs his backpack, and reluctantly pats the man's shoulder. Ben enters Inez's suite where she sits lively and red-haired in a chair, dismissing him with a shrug. Ben offers a warm grin, but Inez glances away, expressionless. Ben sets his backpack on the ground, cautiously drags a stool towards her chair, and perches beside her. Despite Inez's distant gaze, Ben tenderly grins as she turns her face to observe him. With deeply wrinkled eyes, Inez peers thoughtfully at Ben, twists rigidly, and extends a fragile arm to pick up her notebook and crayon. Inez examines Ben again, then jots something down, hesitates, jots more, and gazes at Ben tiredly with her lip trembling. She sobs, glances tearfully at Ben's supportive grin, and writes again. As Ben interprets, his forehead creases and he appears concerned while Inez's expression breaks, and she cries. Feeling profoundly touched, Ben raises his open hands to his lips, hurriedly lifts Inez out, puts her in a cart, and pushes her past the vending machine. Facing Goodman, Ben presses his face against a wall and storms out. On a breezy beach, a woman in a flowing dress and a tank top, and a guy in shorts and a tank top, hop out of a dune buggy and amble to a frisbee. Ben approaches them, embraces them, but then Michelle steps aside, and Ben watches the man closely and shakes his finger. A tangle of forest trails appears in the moonlight as Ben rides his motorbike. In an amusement park café, an elderly visitor with a walking stick hops while most tables, adorned with bowls of red apples, are filled. Sitting at a bench, Ben studies, then glances up from his magazine to observe a woman with two little girls coloring at a nearby bench."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Charlie exits the wagon and marvels at a gleaming rocket ship parked beside him, then skips past ancient wizards, one wielding a magic staff, who glide through a meadow. Charlie gallops towards the ticket booth, displays FBI badge, and bypasses a robed wizard floating on the edge of Luna's cloud. Luna reaches for a scroll, but the wizard seizes her wand, then spots Charlie, prompting her to flinch from his grasp and overlook him. The wizard drifts towards Charlie, looking sheepish and bending backward, while Charlie gazes nonchalantly. Charlie bows, tilts his ear as he keeps gazing, stands tall, grins slightly, lifts his basket, and grudgingly pats the wizard's shoulder. Charlie enters Luna’s lair where she rests spectral and silver-haired on a cloud, overlooking him with a gasp. Charlie gives a gentle grin, but Luna stares onwards, expressionless. Charlie places his basket on the ground, cautiously nudges a footstool towards her cloud, and perches at her side. Despite Luna's blank look, Charlie softly grins as she turns her gaze to meet his. With deeply etched expressions, Luna gazes thoughtfully at Charlie, swivels rigidly, and extends a skeletal appendage to pick up a parchment and quill. Luna examines Charlie again, then scribbles something, hesitates, scribbles more, and glances at Charlie tiredly with her lip trembling. She sobs, glances sorrowful at Charlie's optimistic grin, and scribbles again. As Charlie peruses, his forehead creases and he looks disheartened while Luna's face collapses, and she sobs. Feeling profoundly touched, Charlie lifts his clasped hands to his brow, swiftly carries Luna out, places her on a sleigh, and pushes her past ticket booth. Confronting Morrison, Charlie nudges his forehead against a portal and prances out. On a radiant beach, a knight in a short cloak and sandals, and a pixie in breeches and a tunic, climb out of a chariot and stride to a pebble. Charlie approaches them, embraces them, but then Flora drifts away, and Charlie peers at the pixie and shakes his mane. A labyrinth of sky bridges appears in the moonlight as Charlie sails his galleon. In a fortress kitchen, a retired druid with a potion vial floats while most benches, adorned with urns of azure blossoms, are occupied. Nestled at a bench, Charlie studies, then glances up from his tome to observe a sorceress with two tiny goblins sketching at a nearby bench."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Ben exits his car, admiring a BMW convertible, and proceeds past elderly ladies through a corridor to the reception area, showing his IRS ID. He encounters a man with Inez, an elderly woman, and subtly dismisses him with a handshake. Entering Inez's room, he finds her frail and unresponsive. Despite her initial coldness, Ben offers a gentle smile as she eventually acknowledges him. Inez, visibly distressed, writes on her pad and begins to weep. Moved by her tears, Ben furrows his brow, then hurriedly places her in a wheelchair, pushing her past reception and confronting Goodman by the window. Later, Ben visits a golf course, greeting a woman and a man. As Michelle steps away, Ben shakes his head at the man. The scene shifts to Ben driving under freeway flyovers and then sitting in a hospital canteen. He observes an elderly patient with a drip stand and a woman with two young boys drawing nearby."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Sitting at a table Ben reads then looks up from his book to watch a woman with two young boys drawing at a nearby table In a hospital canteen an elderly patient with a drip stand walks while most tables decorated with vases of yellow flowers are occupied A network of freeway flyovers appears in the sunshine as Ben drives his saloon Ben approaches them hugs them but then Michelle moves away and Ben looks the man in the eye and shakes his head On a sunny golf course a woman in a short skirt and Tshirt and a guy in chinos and a polo shirt get out of a golf buggy and walk to a ball Confronting Goodman Ben pushes his head against a window and marches out Feeling deeply moved Ben raises his clasped hands to his mouth hurriedly carries Inez out puts her in a wheelchair and wheels her past reception As Ben reads his brow furrows and he looks dismayed while Inez's face crumples and she weeps She weeps looks tearful at Ben's encouraging smile and writes again Inez studies Ben again then writes something down pauses writes more and looks at Ben wearily with her lip quivering Ben turns stiffly and reaches out a bony hand to pick up her writing pad and pen With heavily lined features Inez stares pensively at Despite Inez's vacant stare Ben gently smiles as she turns her head to look at him Ben places his briefcase on the floor gingerly moves a chair towards her bed and sits at her bedside stonyfaced Ben gives a kindly smile but Inez stares ahead Ben enters Inez's room where she lies frail and whitehaired in bed ignoring him with a sigh Ben nods cocks his head as he continues staring straightens up smiles faintly picks up his briefcase and disdainfully shakes the man's hand The man approaches Ben looking awkward and leaning forward while Ben stares impassively Inez reaches for a pad but the man grabs her wrist then notices Ben causing her to shun his touch and ignore him Ben strides towards the reception window shows IRS ID and passes a suited man sitting on the edge of Inez's bed Ben gets out of his car and admires a shiny BMW convertible parked beside him then walks past elderly ladies one using a Zimmer frame who shuffle down a corridor"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Sitting at a table Ben reads then looks up from his book to watch a woman with two young boys drawing at a nearby table Ben enters Inez's room where she lies frail and whitehaired in bed ignoring him with a sigh Inez reaches for a pad but the man grabs her wrist then notices Ben causing her to shun his touch and ignore him Feeling deeply moved Ben raises his clasped hands to his mouth hurriedly carries Inez out puts her in a wheelchair and wheels her past reception Despite Inez's vacant stare Ben gently smiles as she turns her head to look at him Inez studies Ben again then writes something down pauses writes more and looks at Ben wearily with her lip quivering Confronting Goodman Ben pushes his head against a window and marches out A network of freeway flyovers appears in the sunshine as Ben drives his saloon Ben gives a kindly smile but Inez stares ahead She weeps looks tearful at Ben's encouraging smile and writes again Ben approaches them hugs them but then Michelle moves away and Ben looks the man in the eye and shakes his head As Ben reads his brow furrows and he looks dismayed while Inez's face crumples and she weeps With heavily lined features Inez stares pensively at Ben strides towards the reception window shows IRS ID and passes a suited man sitting on the edge of Inez's bed Ben turns stiffly and reaches out a bony hand to pick up her writing pad and pen Ben nods cocks his head as he continues staring straightens up smiles faintly picks up his briefcase and disdainfully shakes the man's hand On a sunny golf course a woman in a short skirt and Tshirt and a guy in chinos and a polo shirt get out of a golf buggy and walk to a ball stonyfaced Ben places his briefcase on the floor gingerly moves a chair towards her bed and sits at her bedside Ben gets out of his car and admires a shiny BMW convertible parked beside him then walks past elderly ladies one using a Zimmer frame who shuffle down a corridor The man approaches Ben looking awkward and leaning forward while Ben stares impassively In a hospital canteen an elderly patient with a drip stand walks while most tables decorated with vases of yellow flowers are occupied"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Ben turns stiffly and reaches out a bony hand to pick up her writing pad and pen Inez studies Ben again then writes something down pauses writes more and looks at Ben wearily with her lip quivering She weeps looks tearful at Ben's encouraging smile and writes again As Ben reads his brow furrows and he looks dismayed while Inez's face crumples and she weeps Feeling deeply moved Ben raises his clasped hands to his mouth hurriedly carries Inez out puts her in a wheelchair and wheels her past reception Confronting Goodman Ben pushes his head against a window and marches out On a sunny golf course a woman in a short skirt and Tshirt and a guy in chinos and a polo shirt get out of a golf buggy and walk to a ball Ben approaches them hugs them but then Michelle moves away and Ben looks the man in the eye and shakes his head A network of freeway flyovers appears in the sunshine as Ben drives his saloon In a hospital canteen an elderly patient with a drip stand walks while most tables decorated with vases of yellow flowers are occupied Sitting at a table Ben reads then looks up from his book to watch a woman with two young boys drawing at a nearby table Ben gets out of his car and admires a shiny BMW convertible parked beside him then walks past elderly ladies one using a Zimmer frame who shuffle down a corridor Ben strides towards the reception window shows IRS ID and passes a suited man sitting on the edge of Inez's bed Inez reaches for a pad but the man grabs her wrist then notices Ben causing her to shun his touch and ignore him The man approaches Ben looking awkward and leaning forward while Ben stares impassively Ben nods cocks his head as he continues staring straightens up smiles faintly picks up his briefcase and disdainfully shakes the man's hand Ben enters Inez's room where she lies frail and whitehaired in bed ignoring him with a sigh Ben gives a kindly smile but Inez stares ahead stonyfaced Ben places his briefcase on the floor gingerly moves a chair towards her bed and sits at her bedside Despite Inez's vacant stare Ben gently smiles as she turns her head to look at him With heavily lined features Inez stares pensively at"
        }
      ]
    }
  ]
}