{
  "ground_truth": "Ben stirs and sits up as a doctor enters. Dr. Briar sits on Emily's bed, and Emily nods as Dr. Briar hands her the pager. Emily takes a deep breath and looks down while Dr. Briar strokes her hair, gives her a reassuring smile, and leaves. Tears roll down Emily's cheeks as she puts a hand to her mouth and takes Ben's hand. Ben looks on sorrowfully as Emily presses the back of his hand against her forehead and weeps. Ben walks Duke on a lead past the Travel Inn reception; Larry sees them and comes out after them. Ben enters his room, leaving long-haired Larry outside looking indignant. Inside, a small fish swims up into the tentacles of the box jellyfish in Ben's aquarium, becomes partially paralyzed, and is drawn toward the jellyfish's body. Ben sits on his motel bed, watching, and slowly reaches for his mobile beside him. Connie's face is bruised as Ben hands her an envelope, which Connie accepts, nodding. They sleep in the back of her car, and later, a calm Connie drives along the coast road with the children still asleep. She heads down the leafy drive to Ben's beach house, pulls up, and looks awestruck. Connie tentatively enters the house with the children, standing in the doorway for a moment before the girl sets off to look about, only to be pulled back by Connie. The kids run to a window to look out, and then Connie and the kids enter a bedroom, looking around in wonder before jumping up and down on the bed. Mother and children run along the deserted, sunny beach. Inside the house, curtains sway in the breeze while Connie sits reading a letter, considering it with her long, dark hair tied back. Looking overwhelmed, Connie puts her hands to her mouth, holds a pen, hovers it over a document, and then signs it before looking out over the ocean, silhouetted against hazy, golden light. Ben escorts Emily, as a nurse pushes her out of the hospital in a wheelchair, to his car where he opens the door for Emily, with Duke in the back, and fastens her seat belt. Emily grins while Ben stares ahead. She gazes at him and smiles, then lightly nibbles her nails. Ben pulls up and turns to her awkwardly, his eyes darting about as he thinks before eyeing her firmly. Emily stares at him puzzled, studying him through slightly narrowed eyes, before staring at him expectantly, opening her eyes wide, and furrowing her brows. Ben meets her gaze blankly as Emily looks down, considers, and then undoes her seat belt, shoots him a disdainful look, and gets out.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Ben rouses and rises up as a physician arrives. Dr. Briar perches on Emily's cot, and Emily acknowledges as Dr. Briar passes her the beeper. Emily inhales deeply and glances down while Dr. Briar caresses her tresses, gives her an assuring grin, and departs. Tears cascade down Emily's visage as she places a palm to her lips and clasps Ben's hand. Ben observes mournfully as Emily presses the rear of his hand against her brow and sobs. Ben strolls Duke on a tether past the Travel Inn foyer; Larry notices them and follows after them. Ben steps into his chamber, leaving long-haired Larry outside appearing annoyed. Inside, a diminutive fish glides up into the tendrils of the box jellyfish in Ben's tank, becomes somewhat immobilized, and is drawn toward the jellyfish's form. Ben perches on his inn cot, observing, and slowly extends for his cellphone beside him. Connie's visage is battered as Ben passes her an envelope, which Connie receives, acknowledging. They slumber in the rear of her automobile, and afterward, a serene Connie navigates along the shore route with the offspring still sleeping. She proceeds down the verdant drive to Ben's shore dwelling, halts, and looks amazed. Connie cautiously steps into the residence with the offspring, standing in the entrance for a moment before the girl sets off to explore, only to be drawn back by Connie. The youngsters dash to a pane to gaze out, and then Connie and the youngsters step into a chamber, observing in awe before leaping up and down on the cot. Mother and offspring dash along the vacant, sunny shore. Inside the residence, drapes flutter in the gust while Connie perches perusing a note, contemplating it with her lengthy, dark tresses tied back. Looking inundated, Connie places her palms to her lips, grips a stylus, holds it over a form, and then inscribes it before gazing out over the sea, silhouetted against diffuse, golden light. Ben escorts Emily, as a caregiver propels her out of the infirmary in a wheelchair, to his automobile where he opens the portal for Emily, with Duke in the rear, and fastens her safety strap. Emily beams while Ben stares forward. She gazes at him and grins, then lightly chews her nails. Ben halts and turns to her clumsily, his eyes darting about as he ponders before eyeing her steadfastly. Emily gazes at him confused, examining him through slightly narrowed eyes, before gazing at him expectantly, opening her eyes wide, and knitting her brows. Ben meets her stare vacantly as Emily glances down, deliberates, and then unfastens her safety strap, shoots him a disdainful stare, and exits."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Ben is stirred and sat up as a doctor is entered by Dr. Briar. Emily's bed is sat on by Dr. Briar, and the pager is handed to Emily by Dr. Briar, as she nods. A deep breath is taken by Emily, and her gaze is directed down while her hair is stroked by Dr. Briar, a reassuring smile is given to her by Dr. Briar, and then Dr. Briar leaves. Emily's cheeks are rolled down by tears as her mouth is covered with a hand and Ben's hand is taken by her. Sorrowfully, Emily presses the back of Ben's hand against her forehead while she weeps, as he looks on. Duke is walked by Ben on a lead past the Travel Inn reception; them are seen by Larry who comes out after them. The room is entered by Ben, leaving Larry, looking indignant, outside with long hair. Inside, a small fish swims up into the tentacles of the box jellyfish in Ben's aquarium; it partially paralyzes the fish, drawing it toward the jellyfish's body. The motel bed is sat on by Ben, watching, and a slow reach for his mobile beside him is made. Connie receives an envelope from Ben, which she nods and accepts, as her face is bruised. The back of her car becomes a sleeping place for them, and later, a calm drive along the coast road is made by Connie with the children still asleep. She heads down the leafy drive to Ben's beach house, pulling up and becoming awestruck. With the children, the house is entered tentatively by Connie, standing in the doorway for a moment before the girl is pulled back by Connie, after setting off to look about. A window to look out is run to by the kids, and then a bedroom is entered by Connie and the kids, looking around in wonder before the bed is jumped up and down on. The deserted, sunny beach becomes a running place for mother and children. Inside the house, the curtains are swayed by the breeze while a letter is read by Connie, considering it with her long, dark hair tied back. Overwhelmed, her mouth is put to her hands, holding a pen, hovering it over a document that is then signed by her before the ocean is looked over, silhouetted against hazy, golden light. Emily is escorted by Ben, as she is pushed out of the hospital in a wheelchair by a nurse, to his car where the door is opened for Emily, with Duke in the back, and her seat belt is fastened by him. While Ben stares ahead, a grin is given by Emily. She gazes at him and smiles, then her nails are lightly nibbled by her. Ben pulls up and awkwardly turns to her, with his eyes darting about as he thinks before she is eyed firmly by him. She stares at him, puzzled, studying him through slightly narrowed eyes, before she stares at him expectantly, opening her eyes wide, and her brows are furrowed. Her gaze is met blankly by Ben as she looks down, considers, undoes her seat belt, shoots him a disdainful look, and then gets out."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Ben stirs as a doctor enters. Dr. Briar sits on Emily's bed, handing her the pager. Emily breathes deeply, and Dr. Briar strokes her hair, smiles reassuringly, and leaves. Tears roll down Emily's cheeks as she takes Ben's hand and presses it to her forehead, weeping. Ben walks Duke past the Travel Inn reception; Larry follows them. Ben enters his room, leaving Larry outside looking indignant. Inside, a small fish in Ben's aquarium becomes paralyzed by a box jellyfish. Ben watches from his motel bed and reaches for his mobile. Connie's face is bruised when Ben gives her an envelope, which she accepts. They sleep in her car, and later, a calm Connie drives along the coast with sleeping children. She arrives at Ben's beach house, amazed. Connie and the children enter, with the kids exploring briefly before returning to her. They look out a window and then explore a bedroom, jumping on the bed. Mother and children run along the deserted beach. Inside, Connie reads a letter, contemplating it before signing a document. Ben escorts Emily in a wheelchair to his car, fastening her seatbelt. Emily smiles at Ben, who stares ahead. Later, Ben turns to her awkwardly, eyeing her firmly. Emily stares back, puzzled, and eventually unbuckles her seatbelt, shoots him a disdainful look, and exits."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Ben stirs as a doctor enters. Dr. Briar sits on Emily's bed, hands her the pager, strokes her hair, smiles, and leaves. Emily weeps, holding Ben's hand. Ben walks Duke past the Travel Inn reception; Larry follows but stays outside indignant when Ben enters his room. A fish in Ben's aquarium is paralyzed by a box jellyfish. Ben watches and reaches for his phone. Connie, bruised, receives an envelope from Ben. They sleep in her car, and Connie later drives with the kids to Ben's beach house. Awestruck, Connie enters with the children, who explore and jump on the bed. They run along the beach. Inside, Connie reads a letter, signs a document, and looks out at the ocean. Ben escorts Emily, in a wheelchair, to his car, fastens her seatbelt, and she grins. Emily smiles, nibbles her nails, and Ben turns to her awkwardly. Emily stares at him, puzzled, then undoes her seatbelt, gives him a disdainful look, and exits."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Ben begins to stir and gradually sits up in his bed just as a doctor makes their entrance into the room. Dr. Briar, with a gentle demeanor, takes a seat on Emily's bed, and Emily responds with a nod when Dr. Briar, kindly and with care, hands her the pager. Emily inhales deeply and lowers her gaze, contemplating the gravity of the moment, while Dr. Briar tenderly strokes her hair. The doctor offers a reassuring smile, the kind that conveys understanding and support, before quietly exiting the room. Tears start to trickle down Emily's cheeks as she places a hand over her mouth to stifle her emotions and then reaches for Ben's hand to seek comfort. Ben, observing with a look of sorrow and empathy, watches as Emily presses the back of his hand against her forehead and allows herself to weep openly.\n\nMeanwhile, Ben takes Duke for a walk on a lead, passing by the reception area of the Travel Inn. As they move past, Larry catches sight of them and promptly follows them outside. Ben enters his room, leaving long-haired Larry standing outside, looking indignant and somewhat exasperated by the situation. Inside the room, a small fish can be seen gracefully swimming up into the graceful yet ominous tentacles of the box jellyfish in Ben's aquarium. The fish becomes partially paralyzed as it is drawn ever closer to the body of the jellyfish. Ben sits on his motel bed, watching the scene unfold and slowly reaches over for his mobile phone lying beside him.\n\nConnie's face is visibly bruised when Ben hands her an envelope, which she accepts with a nod of acknowledgment. Later, they find solace sleeping in the back of her car, and when morning breaks, a calm and composed Connie drives along the picturesque coast road with the children peacefully asleep. She maneuvers her way down the leafy drive leading to Ben's beach house, pulling up and looking entirely awestruck by the beauty before her. With a mix of hesitation and anticipation, Connie tentatively enters the house with the children, pausing in the doorway for a moment. As her daughter sets off to explore, curiosity piqued, Connie quickly pulls her back. The kids dash eagerly to a window to take in the view, and then, with a sense of excitement and discovery, Connie and the children enter a bedroom, their eyes wide with wonder as they jump up and down on the bed in pure enjoyment. The mother and her children joyfully run along the deserted, sunlit beach, basking in the freedom and happiness of the moment. Inside the house, the curtains gently sway in the breeze, creating a peaceful atmosphere while Connie sits reading a letter, contemplating its contents thoughtfully, her long, dark hair tied back neatly. Feeling overwhelmed by the letter's implications, Connie places her hands over her mouth, grasps a pen, hovers it over a document while in deep thought, and finally signs it. She then looks out over the serene ocean, silhouetted gracefully against the hazy, golden light of the setting sun.\n\nBen escorts Emily as a nurse attentively pushes her in a wheelchair out of the hospital towards his car. Upon arrival, Ben dutifully opens the car door for Emily, ensuring her comfort and safety by fastening her seat belt, with Duke settled comfortably in the backseat. Emily grins, a gesture of gratitude and connection, while Ben maintains a straight-ahead focus. She gazes at him, her expression softening into a warm smile, and then lightly nibbles her nails, a mix of contemplation and affection. Ben pulls up the car and then turns to her with an awkwardness, his eyes darting about as he ponders something important before finally meeting her gaze with determination. Emily stares at him, puzzled, scrutinizing him through slightly narrowed eyes for clues to his thoughts. Her expression shifts to one of expectation as she opens her eyes wide in a gesture of curiosity and furrows her brows, waiting for him to speak. Ben meets her gaze with a blank look, appearing momentarily lost as Emily looks down, mulls over the situation, and makes a decision. She then undoes her seat belt, shoots him a disdainful look, filled with silent reproach, and decisively gets out of the car."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Ben begins to stir, slowly regaining consciousness as he gradually sits up in his comfortable bed. At that precise moment, a doctor makes their way into the room, entering with a calm presence. Dr. Briar, who possesses a gentle and soothing demeanor, takes a seat on Emily's bed. In response to this, Emily gives a nod of acknowledgment when Dr. Briar, with kindness and genuine care, hands her the pager. Emily takes a deep breath, inhaling the air deeply, and lowers her gaze contemplatively, as she reflects on the gravity of the moment. Meanwhile, Dr. Briar tenderly strokes her hair, offering comfort. The doctor presents a reassuring smile, one that conveys deep understanding and support, before quietly making their exit from the room. Tears begin to slowly trickle down Emily's cheeks as she places a hand over her mouth, attempting to stifle her emotions. She then reaches out for Ben's hand, seeking comfort in his presence. Ben, observing with a look filled with sorrow and empathy, watches as Emily presses the back of his hand against her forehead, allowing herself to weep openly and unabashedly.\n\nMeanwhile, Ben goes outside, taking Duke, his loyal companion, for a walk on a lead, as they leisurely pass by the reception area of the Travel Inn. As they move past, Larry happens to catch sight of them and promptly decides to follow them outside. Ben proceeds to enter his room, leaving the long-haired Larry standing outside, looking both indignant and somewhat exasperated by the unfolding situation. Once inside the room, a small fish can be observed gracefully swimming up into the graceful yet ominous tentacles of the box jellyfish residing in Ben's aquarium. The fish, encountering the jellyfish, becomes partially paralyzed as it is drawn ever closer to the body of the jellyfish. Ben sits on his motel bed, watching the scene unfold before him, as he slowly reaches over for his mobile phone lying conveniently beside him.\n\nConnie's face reveals visible bruises when Ben hands her an envelope, which she accepts with a nod of acknowledgment. Later, they find solace and comfort sleeping in the back of her car. When morning breaks, a calm and composed Connie drives along the picturesque coast road, with the children peacefully asleep in the car with her. She carefully maneuvers her way down the leafy drive leading to Ben's beach house, pulling up and appearing entirely awestruck by the breathtaking beauty before her eyes. With a mix of hesitation and anticipation coursing through her veins, Connie tentatively enters the house with the children, pausing in the doorway for a brief moment to take it all in. As her daughter sets off to explore, her curiosity clearly piqued, Connie quickly pulls her back. The kids, filled with excitement, dash eagerly to a window to take in the view outside. Then, with a sense of excitement and discovery filling the air, Connie and the children enter a bedroom, their eyes wide with wonder as they jump up and down on the bed in pure, unrestrained enjoyment. The mother and her children joyfully run along the deserted, sunlit beach, basking in the freedom and happiness of the moment. Inside the house, the curtains gently sway and flutter in the breeze, creating a peaceful, serene atmosphere while Connie sits reading a letter. She contemplates its contents thoughtfully, with her long, dark hair tied back neatly. Feeling overwhelmed by the letter's implications, Connie places her hands over her mouth, grasps a pen with a sense of purpose, and hovers it over a document while deep in thought before finally signing it. She then gazes out over the serene ocean, her silhouette gracefully outlined against the hazy, golden light of the setting sun.\n\nBen escorts Emily as a nurse attentively pushes her in a wheelchair out of the hospital, directing them towards his waiting car. Upon their arrival, Ben dutifully opens the car door for Emily, ensuring her comfort and safety by carefully fastening her seat belt, with Duke settled comfortably in the backseat. Emily grins, a gesture filled with gratitude and a sense of connection, while Ben maintains a straightforward, focused gaze. She looks at him, her expression softening into a warm smile, and then lightly nibbles her nails, a mix of contemplation and affection coursing through her thoughts. Ben pulls up the car, and then turns to her with an air of awkwardness, his eyes darting about as he ponders something important before finally meeting her gaze with determination and resolve. Emily stares at him, puzzled, scrutinizing him through slightly narrowed eyes in search of clues to his thoughts. Her expression shifts to one filled with expectation as she opens her eyes wide in curiosity and furrows her brows, waiting intently for him to speak. Ben meets her gaze with a blank look, appearing momentarily lost in thought as Emily looks down, mulls over the situation, and makes a decisive decision. She then undoes her seat belt, shoots him a disdainful look, filled with silent reproach, and with determination, decisively gets out of the car."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "As Ben begins to regain consciousness, he shifts slightly and slowly pushes himself up into a sitting position just as the doctor enters the room, signifying an important moment. Dr. Briar steps into the room and makes her way over to Emily's bed, taking a seat next to her. With a calm and composed demeanor, Dr. Briar gently hands a pager to Emily, who acknowledges this action with a nod of understanding. Gathering her emotions, Emily inhales deeply, steadying herself, before casting her eyes downward in contemplation. As a gesture of comfort, Dr. Briar tenderly runs her fingers through Emily's hair, offering her a warm and reassuring smile before she stands up and quietly exits the room. Overcome by emotion, Emily's tears begin to flow quietly down her cheeks, and she instinctively brings a hand to her mouth in an attempt to contain her sobs. Seeking solace, she reaches out and takes Ben's hand, signaling a silent plea for support. Ben observes the scene with a sorrowful expression, watching as Emily lifts his hand and presses the back of it to her forehead, allowing herself to openly weep. Later, Ben takes Duke for a walk on a lead, passing by the Travel Inn reception with a purpose, when Larry notices them and follows them out, piqued by curiosity. Once Ben reaches his room, he steps inside, deliberately leaving Larry, who is notably long-haired, standing outside the door, bearing an expression of indignation. Inside the room, the tranquil aquatic world within Ben's aquarium unfolds as a small fish unwittingly swims into the tentacles of a box jellyfish. The unfortunate fish becomes partially paralyzed, leading it inevitably closer to the jellyfish's body as part of the natural, albeit harsh, ecosystem. Meanwhile, Ben finds himself seated on his motel bed, his gaze fixed on the aquarium. In a moment of decision, he slowly extends his arm to pick up the mobile phone resting beside him. In a contrasting scene, Connie, with visible bruises marring her face, receives an envelope from Ben. She looks up at him, accepting it with a nod of gratitude. As fatigue sets in, they both retreat to the back of her car to rest, finding a moment of peace in their temporary refuge. Eventually, Connie once again takes the wheel, driving along a scenic coast road with the children still soundly asleep, creating a serene and hopeful picture. When she arrives at the leafy drive leading to Ben's beach house, she pulls up, momentarily halted by a sense of awe at the new beginning this place represents. Cautiously, Connie makes her way inside the house with the children in tow. They pause in the doorway, taking in their new surroundings, but the girl is eager to explore, prompting Connie to gently guide her back. Excitedly, the kids sprint to a window, pressing their faces against the glass to take in the view outside. Together, Connie and the children enter a bedroom, their curiosity and excitement building as they take in the space, eventually giving in to the joy of the moment by jumping up and down on the bed. With laughter and delight, the mother and her children experience a carefree run along the deserted, sunlit beach, feeling the warmth of the day. Inside the beach house, the gentle sway of the curtains in the breeze creates a soothing backdrop as Connie sits absorbed in reading a letter. Her long, dark hair is tied back as she considers the contents of the letter, momentarily lost in thought. Feeling a wave of emotion, Connie brings her hands to her mouth, reflecting on the weight of her decisions. With a pen in hand, she hovers over a document, finally making the decision to sign it, marking a pivotal step forward. She then gazes out over the ocean, her silhouette framed by the hazy, golden light of the sunset, a picture of resolution and contemplation. Meanwhile, Ben is seen escorting Emily as a nurse expertly maneuvers her wheelchair out of the hospital, guiding her toward his car. Demonstrating care and attentiveness, Ben opens the car door for Emily, who is greeted by Duke, patiently waiting in the backseat. He takes care in fastening Emily's seat belt, ensuring her safety and comfort. As they settle in the car, Emily beams at Ben, her expression filled with gratitude and warmth, while Ben remains focused, staring straight ahead. She continues to watch him, her eyes softening with affection as she bites her nails lightly, a sign of her nervousness and anticipation. As Ben pulls up to their destination, he turns to her with a hint of awkwardness, his eyes darting as he grapples with his thoughts, before fixing her with a determined gaze. Emily responds with a look of confusion, studying him closely as she narrows her eyes slightly, trying to decipher his intentions. Her expression shifts to one of expectancy as she opens her eyes wide and furrows her brows, awaiting clarification. In that suspended moment, Ben meets her gaze blankly, offering no further insight. Emily, feeling the weight of the moment, lowers her eyes in consideration before reaching a decision. She methodically unfastens her seat belt, glances at him with a disdainful expression, and without a word, steps out of the car, leaving him to ponder the consequences of their exchange."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Ben stirs awake as Dr. Briar enters and sits on Emily's bed, handing her the pager. Emily takes a deep breath while Dr. Briar comforts her with a gentle hair stroke and a reassuring smile before leaving. Emotional, Emily takes Ben's hand, pressing it to her forehead as she weeps, with Ben watching sorrowfully. Ben walks Duke past the Travel Inn reception, briefly encountering Larry, who follows them. Entering his room, Ben leaves an indignant Larry outside. Inside, Ben observes a fish in the aquarium swim into a box jellyfish's tentacles, becoming partially paralyzed. He sits on the bed, contemplating before reaching for his mobile. Later, he gives a bruised Connie an envelope, which she accepts with a nod. They sleep in her car, and a calm Connie later drives the coast road with the children asleep, arriving at Ben's beach house. Awestruck, Connie enters with the children, briefly pausing before exploring. The kids rush to the window, and then they all marvel at the bedroom before joyfully jumping on the bed. They run along the sunny, deserted beach, and inside the house, Connie sits reading a letter, overwhelmed. She signs a document, pensively looking out over the ocean in the golden light. Ben then escorts Emily, in a wheelchair pushed by a nurse, to his car, fastening her seatbelt with Duke in the back. Emily smiles at Ben, who seems distant. After pulling up, Ben awkwardly turns to Emily, prompting her to study him with a puzzled, expectant look. Sensing Ben’s hesitation, she undoes her seatbelt, gives him a disdainful glance, and exits the car."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Ben stirs and sits up as a doctor enters. Dr. Briar, a respected physician known for her gentle demeanor, sits on Emily's bed, and Emily nods as Dr. Briar hands her the pager, a crucial device used by medical staff to communicate in emergencies. Emily takes a deep breath and looks down while Dr. Briar, known for her compassionate care, strokes her hair, gives her a reassuring smile, and leaves. Tears, a common sign of emotional release, roll down Emily's cheeks as she puts a hand to her mouth and takes Ben's hand, seeking comfort. Ben looks on sorrowfully as Emily presses the back of his hand against her forehead and weeps, showing her profound grief.\n\nBen walks Duke, a friendly golden retriever with a wagging tail, on a lead past the Travel Inn reception, known for its budget-friendly accommodations; Larry, a long-time employee who often meddles in guests' affairs, sees them and comes out after them. Ben enters his room, leaving long-haired Larry outside looking indignant, a reaction typical of his intrusive nature. Inside, a small fish, often added to aquariums for its vibrant colors, swims up into the tentacles of the box jellyfish in Ben's aquarium, becomes partially paralyzed due to the jellyfish's potent venom, and is drawn toward the jellyfish's body in a grim display of nature. Ben sits on his motel bed, a temporary yet personal space, watching, and slowly reaches for his mobile beside him, a lifeline to the outside world.\n\nConnie's face is bruised, suggesting a recent altercation, as Ben hands her an envelope, which Connie accepts, nodding in silent gratitude. They sleep in the back of her car, a makeshift refuge, and later, a calm Connie drives along the coast road, famous for its stunning ocean views, with the children still asleep. She heads down the leafy drive to Ben's beach house, an inherited family retreat cherished for its seclusion, pulls up, and looks awestruck by the serene surroundings. Connie tentatively enters the house with the children, standing in the doorway for a moment before the girl sets off to look about, only to be pulled back by Connie, who remains cautious in the unfamiliar space. The kids run to a window to look out, their faces lighting up at the view, and then Connie and the kids enter a bedroom, looking around in wonder before jumping up and down on the bed, reveling in newfound freedom. Mother and children run along the deserted, sunny beach, their laughter echoing against the rhythmic ocean waves. Inside the house, curtains sway in the breeze, a gentle reminder of the nearby sea, while Connie sits reading a letter, considering it with her long, dark hair tied back. Looking overwhelmed, Connie puts her hands to her mouth, holds a pen, hovers it over a document significant for their future, and then signs it before looking out over the ocean, silhouetted against hazy, golden light.\n\nBen escorts Emily, as a nurse, known for her efficient care, pushes her out of the hospital in a wheelchair, to his car where he opens the door for Emily, with Duke in the back wagging his tail, and fastens her seat belt. Emily grins, feeling a moment of warmth, while Ben stares ahead, lost in thought. She gazes at him and smiles, then lightly nibbles her nails, a habit of hers when anxious. Ben pulls up and turns to her awkwardly, his eyes darting about as he thinks before eyeing her firmly. Emily stares at him puzzled, studying him through slightly narrowed eyes, before staring at him expectantly, opening her eyes wide, and furrowing her brows, waiting for him to speak. Ben meets her gaze blankly as Emily looks down, considers the situation, and then undoes her seat belt, shoots him a disdainful look, and gets out, feeling a mixture of frustration and independence."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Connie tentatively enters the house with the children standing in the doorway for a moment before the girl sets off to look about only to be pulled back by Connie Ben enters his room leaving longhaired Larry outside looking indignant Ben stirs and sits up as a doctor enters Dr Briar sits on Emily's bed and Emily nods as Dr Briar hands her the pager Emily takes a deep breath and looks down while Dr Briar strokes her hair gives her a reassuring smile and leaves Tears roll down Emily's cheeks as she puts a hand to her mouth and takes Ben's hand Ben looks on sorrowfully as Emily presses the back of his hand against her forehead and weeps Ben walks Duke on a lead past the Travel Inn reception Emily grins while Ben stares ahead Tears roll down Emily's cheeks as she puts a hand to her mouth and takes Ben's hand Dr Briar sits on Emily's bed and Emily nods as Dr Briar hands her the pager Larry sees them and comes out after them Ben enters his room leaving longhaired Larry outside looking indignant Inside a small fish swims up into the tentacles of the box Ben looks on sorrowfully as Emily presses the back of his hand against her forehead and weeps jellyfish in Ben's aquarium becomes partially paralyzed and is drawn toward the jellyfish's body Emily takes a deep breath and looks down while Dr Briar strokes her hair gives her a reassuring smile and leaves Ben sits on his motel bed watching and slowly reaches for his mobile beside him Connie's face is bruised as Ben hands her an envelope which Connie accepts nodding Ben pulls up and turns to her awkwardly his eyes darting about as he thinks before eyeing her firmly They sleep in the back of her car and later a calm Connie drives along the coast road with the children still asleep She heads down the leafy drive to Ben's beach house pulls up and looks awestruck Ben meets her gaze blankly as Emily looks down considers and then undoes her seat belt shoots him a disdainful look and gets out Ben stirs and sits up as a doctor enters Connie tentatively enters the house with the children standing in the doorway for a moment before the girl sets off to look about only to be pulled back by Connie The kids run to a window to look out and then Connie and the kids enter a bedroom looking around in wonder before jumping up and down on the bed Inside a small fish swims up into the tentacles of the box Mother and children run along the deserted sunny beach Inside the house curtains sway in the breeze while Connie sits reading a letter considering it with her long dark hair tied back Looking overwhelmed Connie puts her hands to her mouth holds a pen hovers it over a document and then signs it before looking out over the ocean silhouetted against hazy golden light Emily stares at him puzzled studying him through slightly narrowed eyes before staring at him expectantly opening her eyes wide and furrowing her brows She heads down the leafy drive to Ben's beach house pulls up and looks awestruck Ben escorts Emily as a nurse pushes her out of the hospital in a wheelchair to his car where he opens the door for Emily with Duke in the back and fastens her seat belt Emily grins while Ben stares ahead She gazes at him and smiles then lightly nibbles her nails Ben pulls up and turns to her awkwardly his eyes darting about as he thinks before eyeing her firmly Emily stares at him puzzled studying him through slightly narrowed eyes before staring at him expectantly opening her eyes wide and furrowing her brows Ben meets her gaze blankly as Emily looks down considers and then undoes her seat belt shoots him a disdainful look and gets out"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Ben stirs and sits up as a doctor enters. Dr Briar sits on Emily's bed and Emily nods as Dr Briar hands her the pager. Emily takes a deep breath and looks down while Dr Briar strokes her hair gives her a reassuring smile and leaves. Tears roll down Emily's cheeks as she puts a hand to her mouth and takes Ben's hand. Ben looks on sorrowfully as Emily presses the back of his hand against her forehead and weeps. Ben walks Duke on a lead past the Travel Inn reception. Larry sees them and comes out after them. Ben enters his room leaving longhaired Larry outside looking indignant. Inside a small fish swims up into the tentacles of the box. jellyfish in Ben's aquarium becomes partially paralyzed and is drawn toward the jellyfish's body. Ben sits on his motel bed watching and slowly reaches for his mobile beside him. Connie's face is bruised as Ben hands her an envelope which Connie accepts nodding. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. They sleep in the back of her car and later a calm Connie drives along the coast road with the children still asleep. She heads down the leafy drive to Ben's beach house pulls up and looks awestruck. Connie tentatively enters the house with the children standing in the doorway for a moment before the girl sets off to look about only to be pulled back by Connie. The kids run to a window to look out and then Connie and the kids enter a bedroom looking around in wonder before jumping up and down on the bed. Mother and children run along the deserted sunny beach. Inside the house curtains sway in the breeze while Connie sits reading a letter considering it with her long dark hair tied back. Looking overwhelmed Connie puts her hands to her mouth holds a pen hovers it over a document and then signs it before looking out over the ocean silhouetted against hazy golden light. Ben escorts Emily as a nurse pushes her out of the hospital in a wheelchair to his car where he opens the door for Emily with Duke in the back and fastens her seat belt. Emily grins while Ben stares ahead. She gazes at him and smiles then lightly nibbles her nails. Ben pulls up and turns to her awkwardly his eyes darting about as he thinks before eyeing her firmly. Emily stares at him puzzled studying him through slightly narrowed eyes before staring at him expectantly opening her eyes wide and furrowing her brows. Ben meets her gaze blankly as Emily looks down considers and then undoes her seat belt shoots him a disdainful look and gets out."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Ben stirs and sits up as a doctor enters. Dr Briar sits on Emily's bed and Emily nods as Dr Briar hands her the pager. Emily takes a deep breath and looks down while Dr Briar strokes her hair gives her a reassuring smile and leaves. Tears roll down Emily's cheeks as she puts a hand to her mouth and takes Ben's hand. Ben looks on sorrowfully as Emily presses the back of his hand against her forehead and weeps. Ben walks Duke on a lead past the Travel Inn reception. Larry sees them and comes out after them. Ben enters his room leaving longhaired Larry outside looking indignant. Inside a small fish swims up into the tentacles of the box. jellyfish in Ben's aquarium becomes partially paralyzed and is drawn toward the jellyfish's body. Ben sits on his motel bed watching and slowly reaches for his mobile beside him. Connie's face is bruised as Ben hands her an envelope which Connie accepts nodding. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. They sleep in the back of her car and later a calm Connie drives along the coast road with the children still asleep. She heads down the leafy drive to Ben's beach house pulls up and looks awestruck. Connie tentatively enters the house with the children standing in the doorway for a moment before the girl sets off to look about only to be pulled back by Connie. The kids run to a window to look out and then Connie and the kids enter a bedroom looking around in wonder before jumping up and down on the bed. Mother and children run along the deserted sunny beach. Inside the house curtains sway in the breeze while Connie sits reading a letter considering it with her long dark hair tied back. Looking overwhelmed Connie puts her hands to her mouth holds a pen hovers it over a document and then signs it before looking out over the ocean silhouetted against hazy golden light. Ben escorts Emily as a nurse pushes her out of the hospital in a wheelchair to his car where he opens the door for Emily with Duke in the back and fastens her seat belt. Emily grins while Ben stares ahead. She gazes at him and smiles then lightly nibbles her nails. Ben pulls up and turns to her awkwardly his eyes darting about as he thinks before eyeing her firmly. Emily stares at him puzzled studying him through slightly narrowed eyes before staring at him expectantly opening her eyes wide and furrowing her brows. Ben meets her gaze blankly as Emily looks down considers and then undoes her seat belt shoots him a disdainful look and gets out."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Ben stirs and sits up as a doctor enters. Dr Briar sits on Emily's bed and Emily nods as Dr Briar hands her the pager. Emily takes a deep breath and looks down while Dr Briar strokes her hair gives her a reassuring smile and leaves. Tears roll down Emily's cheeks as she puts a hand to her mouth and takes Ben's hand. Ben looks on sorrowfully as Emily presses the back of his hand against her forehead and weeps. Ben walks Duke on a lead past the Travel Inn reception. Looking overwhelmed Connie puts her hands to her mouth holds a pen hovers it over a document and then signs it before looking out over the ocean silhouetted against hazy golden light. Ben escorts Emily as a nurse pushes her out of the hospital in a wheelchair to his car where he opens the door for Emily with Duke in the back and fastens her seat belt. Emily grins while Ben stares ahead. She gazes at him and smiles then lightly nibbles her nails. Ben pulls up and turns to her awkwardly his eyes darting about as he thinks before eyeing her firmly. Emily stares at him puzzled studying him through slightly narrowed eyes before staring at him expectantly opening her eyes wide and furrowing her brows. Ben meets her gaze blankly as Emily looks down considers and then undoes her seat belt shoots him a disdainful look and gets out."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Ben stirs and sits up as a doctor enters. Dr Briar sits on Emily's bed and Emily nods as Dr Briar hands her the pager. Ben pulls up and turns to her awkwardly his eyes darting about as he thinks before eyeing her firmly. Emily stares at him puzzled studying him through slightly narrowed eyes before staring at him expectantly opening her eyes wide and furrowing her brows. Ben meets her gaze blankly as Emily looks down considers and then undoes her seat belt shoots him a disdainful look and gets out."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Larry stirs and sits up as a nurse enters. Dr. Briar sits on Duke's bed, and Duke nods as Dr. Briar hands him the pager. Duke takes a deep breath and looks down while Dr. Briar strokes his hair, gives him a reassuring smile, and leaves. Tears roll down Duke's cheeks as he puts a hand to his mouth and takes Larry's hand. Larry looks on sorrowfully as Duke presses the back of his hand against his forehead and weeps. Larry walks Emily on a lead past the Travel Inn reception; Ben sees them and comes out after them. Larry enters his room, leaving long-haired Ben outside looking indignant. Inside, a small fish swims up into the tentacles of the box jellyfish in Larry's aquarium, becomes partially paralyzed, and is drawn toward the jellyfish's body. Larry sits on his motel bed, watching, and slowly reaches for his mobile beside him. Emily's face is bruised as Larry hands her an envelope, which Emily accepts, nodding. They sleep in the back of her car, and later, a calm Emily drives along the coast road with the children still asleep. She heads down the leafy drive to Larry's beach house, pulls up, and looks awestruck. Emily tentatively enters the house with the children, standing in the doorway for a moment before the girl sets off to look about, only to be pulled back by Emily. The kids run to a window to look out, and then Emily and the kids enter a bedroom, looking around in wonder before jumping up and down on the bed. Mother and children run along the deserted, sunny beach. Inside the house, curtains sway in the breeze while Emily sits reading a letter, considering it with her long, dark hair tied back. Looking overwhelmed, Emily puts her hands to her mouth, holds a pen, hovers it over a document, and then signs it before looking out over the ocean, silhouetted against hazy, golden light. Larry escorts Duke, as a doctor pushes him out of the hospital in a wheelchair, to his car where he opens the door for Duke, with Emily in the back, and fastens his seat belt. Duke grins while Larry stares ahead. He gazes at him and smiles, then lightly nibbles his nails. Larry pulls up and turns to him awkwardly, his eyes darting about as he thinks before eyeing him firmly. Duke stares at him puzzled, studying him through slightly narrowed eyes, before staring at him expectantly, opening his eyes wide, and furrowing his brows. Larry meets his gaze blankly as Duke looks down, considers, and then undoes his seat belt, shoots him a disdainful look, and gets out."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Ben stirs and sits up as a clown enters. Dr. Briar sits on Emily's locker, and Emily nods as Dr. Briar hands her the candle. Emily takes a deep breath and looks down while Dr. Briar strokes her hair, gives her a reassuring smile, and leaves. Tears roll down Emily's cheeks as she puts a hand to her mouth and takes Ben's hand. Ben looks on sorrowfully as Emily presses the back of his hand against her forehead and weeps. Ben walks Duke on a lead past the Flower Shop counter; Larry sees them and comes out after them. Ben enters his room, leaving long-haired Larry outside looking indignant. Inside, a small robot swims up into the suction cups of the starfish in Ben's terrarium, becomes partially paralyzed, and is drawn toward the starfish's body. Ben sits on his futon, watching, and slowly reaches for his remote beside him. Connie's face is bruised as Ben hands her a postcard, which Connie accepts, nodding. They sleep in the back of her truck, and later, a calm Connie drives along the mountain road with the children still asleep. She heads down the cobblestone path to Ben's cabin, pulls up, and looks awestruck. Connie tentatively enters the house with the children, standing in the doorway for a moment before the girl sets off to look about, only to be pulled back by Connie. The kids run to a painting to look out, and then Connie and the kids enter a pantry, looking around in wonder before jumping up and down on the trampoline. Mother and children run along the deserted, moonlit park. Inside the house, tapestries sway in the breeze while Connie sits reading a diary, considering it with her long, dark hair tied back. Looking overwhelmed, Connie puts her hands to her mouth, holds a pencil, hovers it over a folder, and then signs it before looking out over the garden, silhouetted against hazy, golden light. Ben escorts Emily, as a magician pushes her out of the café in a wheelchair, to his skateboard where he opens the door for Emily, with Duke in the back, and fastens her seat belt. Emily grins while Ben stares ahead. She gazes at him and smiles, then lightly nibbles her eraser. Ben pulls up and turns to her awkwardly, his eyes darting about as he thinks before eyeing her firmly. Emily stares at him puzzled, studying him through slightly narrowed eyes, before staring at him expectantly, opening her eyes wide, and furrowing her brows. Ben meets her gaze blankly as Emily looks down, considers, and then undoes her seat belt, shoots him a disdainful look, and gets out."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Ben yawns and stretches as a doctor arrives. Dr. Briar lounges on Emily's bed, and Emily blinks as Dr. Briar tosses her the pager. Emily lets out a sigh and gazes up while Dr. Briar braids her hair, gives her a playful wink, and departs. Tears drip onto Emily's cheeks as she puts a hand to her chest and shakes Ben's hand. Ben glances on sympathetically as Emily taps the back of his hand against her chin and sobs. Ben drags Duke on a lead past the Travel Inn reception; Larry notices them and rushes after them. Ben exits his room, leaving long-haired Larry outside looking astonished. Inside, a small fish floats down into the tentacles of the box jellyfish in Ben's aquarium, becomes slightly drowsy, and is pulled toward the jellyfish's body. Ben sprawls on his motel bed, observing, and quickly reaches for his mobile beside him. Connie's face is scratched as Ben offers her an envelope, which Connie takes, smiling. They rest in the back of her car, and later, a serene Connie cruises along the coast road with the children still napping. She glides down the leafy drive to Ben's beach house, parks, and looks amazed. Connie cautiously steps into the house with the children, lingering in the doorway for a moment before the girl darts off to explore, only to be halted by Connie. The kids dash to a window to peer out, and then Connie and the kids step into a bedroom, gazing around in awe before bouncing on the bed. Mother and children skip along the empty, sunny beach. Inside the house, curtains flutter in the breeze while Connie sits sketching a letter, contemplating it with her long, dark hair cascading down. Looking taken aback, Connie places her hands on her cheeks, grabs a pen, circles it over a document, and then stamps it before looking out over the ocean, silhouetted against hazy, golden light. Ben ushers Emily, as a nurse wheels her out of the hospital in a wheelchair, to his car where he closes the door for Emily, with Duke in the back, and adjusts her rear-view mirror. Emily beams while Ben gazes ahead. She peers at him and smirks, then lightly taps her nails. Ben pulls over and glances at her awkwardly, his eyes shifting about as he ponders before glaring at her firmly. Emily gawks at him bewildered, inspecting him through slightly narrowed eyes, before gazing at him expectantly, opening her eyes wide, and furrowing her brows. Ben returns her gaze blankly as Emily looks down, deliberates, and then fastens her seat belt, shoots him a skeptical look, and steps out."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Charlie stirs and sits up as a chef enters. Chef Logan sits on Samantha's chair, and Samantha nods as Chef Logan hands her the notebook. Samantha takes a deep breath and looks down while Chef Logan strokes her shoulder, gives her a reassuring grin, and leaves. Raindrops roll down Samantha's cheeks as she puts a hand to her hat and takes Charlie's paw. Charlie looks on sorrowfully as Samantha presses the back of his paw against her chin and sobs. Charlie walks Max on a lead past the Train Station lobby; Jerry sees them and comes out after them. Charlie enters his cabin, leaving long-haired Jerry outside looking indignant. Inside, a small bird swims up into the branches of the pear tree in Charlie's aviary, becomes partially paralyzed, and is drawn toward the tree's trunk. Charlie sits on his cabin floor, watching, and slowly reaches for his notebook beside him. Nancy's arm is bruised as Charlie hands her a parcel, which Nancy accepts, nodding. They sleep in the back of her van, and later, a calm Nancy drives along the forest trail with the elders still asleep. She heads down the winding path to Charlie's mountain cabin, pulls up, and looks awestruck. Nancy tentatively enters the cabin with the elders, standing in the doorway for a moment before the boy sets off to look about, only to be pulled back by Nancy. The elders run to a door to look out, and then Nancy and the elders enter a living room, looking around in wonder before jumping up and down on the couch. Aunt and elders run along the deserted, sunny field. Inside the cabin, blinds sway in the breeze while Nancy sits reading a magazine, considering it with her long, dark scarf tied back. Looking overwhelmed, Nancy puts her hands to her hat, holds a spoon, hovers it over a sketchbook, and then signs it before looking out over the valley, silhouetted against hazy, golden light. Charlie escorts Samantha, as a gardener pushes her out of the clinic in a cart, to his truck where he opens the door for Samantha, with Max in the back, and fastens her helmet. Samantha grins while Charlie stares ahead. She gazes at him and smiles, then lightly nibbles her scarf. Charlie pulls up and turns to her awkwardly, his eyes darting about as he thinks before eyeing her firmly. Samantha stares at him puzzled, studying him through slightly narrowed eyes, before staring at him expectantly, opening her eyes wide, and furrowing her brows. Charlie meets her gaze blankly as Samantha looks down, considers, and then undoes her helmet, shoots him a disdainful look, and gets out."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Gary shuffles and stands up as a gardener arrives. Mr. Maple settles on Sarah's couch, and Sarah nods as Mr. Maple offers her the remote. Sarah exhales sharply and glances down while Mr. Maple pats her shoulder, gives her a supportive nod, and departs. Tears slide down Sarah's cheeks as she places a hand on her mouth and grasps Gary's hand. Gary observes sadly as Sarah presses his palm against her forehead and sobs. Gary strolls Max on a lead past the Travel Inn lobby; Ronald notices them and follows behind them. Gary enters his room, leaving long-haired Ronald outside looking aggravated. Inside, a small frog leaps up into the vines of the box terrarium in Gary's aquarium, becomes partially entangled, and is drawn toward the vines’ base. Gary perches on his motel couch, observing, and slowly reaches for his phone beside him. Lisa's face is bruised as Gary hands her an envelope, which Lisa takes, nodding. They nap in the back of her van, and later, a serene Lisa drives along the coastal highway with the children still asleep. She turns down the tree-lined path to Gary's beach house, pulls over, and looks amazed. Lisa cautiously enters the house with the children, pausing in the entryway for a moment before the boy sets off to explore, only to be pulled back by Lisa. The kids dash to a window to peer out, and then Lisa and the kids enter a bedroom, looking around in awe before bouncing on the bed. Mother and children sprint along the empty, sunny shoreline. Inside the house, curtains flutter in the breeze while Lisa sits reading a note, pondering it with her long, dark hair tied back. Feeling overwhelmed, Lisa places her hands on her cheeks, holding a pencil, hovering it over a form, and then signs it before gazing over the sea, silhouetted against the soft, golden light. Gary escorts Sarah, as a valet pushes her out of the clinic in a wheelchair, to his car where he opens the door for Sarah, with Max in the back, and secures her seat belt. Sarah chuckles while Gary stares forward. She glances at him and beams, then lightly picks at her nails. Gary stops and turns to her awkwardly, his eyes wandering as he ponders before fixing his gaze on her resolutely. Sarah gazes at him confused, examining him through slightly narrowed eyes, before watching him expectantly, her eyes wide open, and furrowing her brows. Gary returns her gaze blankly as Sarah looks downward, thinks, and then removes her seat belt, gives him a disdainful look, and exits."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Ben yawns and stands up as a mechanic waltzes in. Dr. Briar jumps on Emily's couch, and Emily winks as Dr. Briar tosses her the tablet. Emily exhales sharply and gazes upward while Dr. Briar pats her shoulder, gives her a comforting wink, and departs. Rain falls on Emily's cheeks as she puts a hand to her ear and grasps Ben's elbow. Ben watches mournfully as Emily presses the back of his hand against her ankle and sobs. Ben applauds Duke on a rope past the Carnival Inn entrance; Larry observes them and dances after them. Ben climbs into his cabin, leaving long-legged Larry outside looking bewildered. Inside, a small bird flies up into the branches of the coral in Ben's aquarium, becomes slightly stunned, and is propelled toward the coral's surface. Ben jumps on his couch, observing, and slowly reaches for his notebook beside him. Connie's face is blotchy as Ben hands her a leaflet, which Connie accepts, smiling. They nap in the back of her truck, and later, a tranquil Connie sails along the mountain path with the children still resting. She skips down the rocky pathway to Ben's forest cabin, parks, and looks mesmerized. Connie gingerly approaches the cabin with the children, hovering in the entrance for a moment before the girl rushes off to explore, only to be beckoned back by Connie. The kids run to a painting to gaze at it, and then Connie and the kids enter a kitchen, looking around in awe before spinning around on the floor. Mother and children dance along the deserted, misty meadow. Inside the cabin, blinds flutter in the draft while Connie sits sketching a picture, pondering it with her long, red hair pinned up. Looking dazed, Connie puts her hands to her cheeks, picks up a brush, hovers it over a canvas, and then paints on it before looking out over the valley, outlined against soft, silver light. Ben accompanies Emily, as a janitor wheels her out of the airport in a trolley, to his scooter where he opens the seat for Emily, with Duke in the sidecar, and adjusts her helmet. Emily giggles while Ben stares ahead. She glances at him and chuckles, then lightly taps her fingers. Ben pulls over and turns to her uneasily, his eyes darting around as he ponders before eyeing her intently. Emily gazes at him confused, examining him through slightly narrowed eyes, before observing him inquisitively, opening her eyes wide, and raising her eyebrows. Ben holds her gaze blankly as Emily looks away, reflects, and then unzips her jacket, shoots him a scornful look, and steps out."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Jake spins and stands up as a farmer enters. Farmer Oak perches on Lily's couch, and Lily winks as Farmer Oak tosses her the whistle. Lily exhales deeply and glances upward while Farmer Oak pats her hat, offers her an encouraging nod, and departs. Raindrops dribble down Lily's nose as she places a foot to her chin and grabs Jake's elbow. Jake watches regretfully as Lily presses the heel of his elbow against her knee and sobs. Jake drags Max on a leash past the Post Office lobby; Sam notices them and steps out behind them. Jake enters his cabin, leaving curly-haired Sam outside appearing frustrated. Inside, a tiny crab scuttles up into the arms of the sea anemone in Jake's fishbowl, becomes partly immobilized, and is pulled toward the anemone's core. Jake lounges on his camper bed, observing, and gradually reaches for his tablet beside him. Judy's hair is tangled as Jake gives her a parcel, which Judy takes, nodding. They nap in the trunk of her van, and later, a serene Judy cruises along the freeway with the teenagers still napping. She drives down the pine path to Jake's mountain cabin, parks, and gazes in amazement. Judy hesitantly steps into the cabin with the teenagers, pausing in the entrance for a moment before the boy darts off to explore, only to be tugged back by Judy. The teenagers dash to an archway to peek outside, and then Judy and the teenagers enter a parlor, glancing around in awe before leaping up and down on the sofa. Mother and teenagers sprint along the empty, sunlit cliffs. Inside the cabin, blinds sway with the breeze while Judy sits studying a note, pondering it with her short, blonde hair tied back. Feeling dazed, Judy places her fingers to her lips, grips a quill, hovers it over a parchment, and then scribbles on it before peering over the valley, silhouetted against muted, amber light. Jake escorts Lily, as a chef rolls her out of the clinic in a stroller, to his boat where he unfastens the hatch for Lily, with Max in the cabin, and secures her vest. Lily beams while Jake glances forward. She peeks at him and grins, then softly taps her earlobes. Jake docks and turns to her awkwardly, his gaze flitting around as he muses before focusing on her intently. Lily squints at him confused, examining him through barely narrowed eyes, before eyeing him eagerly, opening her eyes wide, and knitting her brows. Jake holds her gaze vacantly as Lily glances upward, thinks, and then unhooks her vest, gives him a disdainful glance, and steps out."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Ben wakes as Dr. Briar enters Emily's room, handing her a pager and offering reassurance. Emily becomes emotional, clutching Ben's hand as she cries. Ben walks Duke by the Travel Inn, ignoring a disgruntled Larry. In his motel, Ben watches a fish get trapped by a jellyfish and reaches for his phone. Later, he gives an envelope to a bruised Connie, who accepts it. They sleep in her car, and in the morning, Connie drives to Ben's beach house, where she and her children explore with delight and play on the beach. Inside, Connie reads a letter, contemplates, signs a document, and looks out at the ocean. Ben helps Emily, now in a wheelchair, into his car. As they drive, she smiles at him, but their interaction becomes awkward. When they stop, Ben hesitates, and Emily becomes frustrated, eventually leaving the car after a brief, tense exchange."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Ben meets her gaze blankly as Emily looks down considers and then undoes her seat belt shoots him a disdainful look and gets out Emily stares at him puzzled studying him through slightly narrowed eyes before staring at him expectantly opening her eyes wide and furrowing her brows Ben pulls up and turns to her awkwardly his eyes darting about as he thinks before eyeing her firmly She gazes at him and smiles then lightly nibbles her nails Emily grins while Ben stares ahead Ben escorts Emily as a nurse pushes her out of the hospital in a wheelchair to his car where he opens the door for Emily with Duke in the back and fastens her seat belt Looking overwhelmed Connie puts her hands to her mouth holds a pen hovers it over a document and then signs it before looking out over the ocean silhouetted against hazy golden light Inside the house curtains sway in the breeze while Connie sits reading a letter considering it with her long dark hair tied back Mother and children run along the deserted sunny beach The kids run to a window to look out and then Connie and the kids enter a bedroom looking around in wonder before jumping up and down on the bed Connie tentatively enters the house with the children standing in the doorway for a moment before the girl sets off to look about only to be pulled back by Connie She heads down the leafy drive to Ben's beach house pulls up and looks awestruck They sleep in the back of her car and later a calm Connie drives along the coast road with the children still asleep Connie's face is bruised as Ben hands her an envelope which Connie accepts nodding Ben sits on his motel bed watching and slowly reaches for his mobile beside him jellyfish in Ben's aquarium becomes partially paralyzed and is drawn toward the jellyfish's body Inside a small fish swims up into the tentacles of the box Ben enters his room leaving longhaired Larry outside looking indignant Larry sees them and comes out after them Ben walks Duke on a lead past the Travel Inn reception Ben looks on sorrowfully as Emily presses the back of his hand against her forehead and weeps Tears roll down Emily's cheeks as she puts a hand to her mouth and takes Ben's hand Emily takes a deep breath and looks down while Dr Briar strokes her hair gives her a reassuring smile and leaves Dr Briar sits on Emily's bed and Emily nods as Dr Briar hands her the pager Ben stirs and sits up as a doctor enters"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Mother and children run along the deserted sunny beach They sleep in the back of her car and later a calm Connie drives along the coast road with the children still asleep jellyfish in Ben's aquarium becomes partially paralyzed and is drawn toward the jellyfish's body Ben escorts Emily as a nurse pushes her out of the hospital in a wheelchair to his car where he opens the door for Emily with Duke in the back and fastens her seat belt Looking overwhelmed Connie puts her hands to her mouth holds a pen hovers it over a document and then signs it before looking out over the ocean silhouetted against hazy golden light Larry sees them and comes out after them Ben walks Duke on a lead past the Travel Inn reception Ben sits on his motel bed watching and slowly reaches for his mobile beside him The kids run to a window to look out and then Connie and the kids enter a bedroom looking around in wonder before jumping up and down on the bed She gazes at him and smiles then lightly nibbles her nails Connie's face is bruised as Ben hands her an envelope which Connie accepts nodding Inside the house curtains sway in the breeze while Connie sits reading a letter considering it with her long dark hair tied back Dr Briar sits on Emily's bed and Emily nods as Dr Briar hands her the pager Connie tentatively enters the house with the children standing in the doorway for a moment before the girl sets off to look about only to be pulled back by Connie Ben pulls up and turns to her awkwardly his eyes darting about as he thinks before eyeing her firmly She heads down the leafy drive to Ben's beach house pulls up and looks awestruck Emily takes a deep breath and looks down while Dr Briar strokes her hair gives her a reassuring smile and leaves Emily stares at him puzzled studying him through slightly narrowed eyes before staring at him expectantly opening her eyes wide and furrowing her brows Ben looks on sorrowfully as Emily presses the back of his hand against her forehead and weeps Ben meets her gaze blankly as Emily looks down considers and then undoes her seat belt shoots him a disdainful look and gets out Ben enters his room leaving longhaired Larry outside looking indignant Inside a small fish swims up into the tentacles of the box Ben stirs and sits up as a doctor enters Tears roll down Emily's cheeks as she puts a hand to her mouth and takes Ben's hand Emily grins while Ben stares ahead"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "She heads down the leafy drive to Ben's beach house pulls up and looks awestruck Connie tentatively enters the house with the children standing in the doorway for a moment before the girl sets off to look about only to be pulled back by Connie The kids run to a window to look out and then Connie and the kids enter a bedroom looking around in wonder before jumping up and down on the bed Mother and children run along the deserted sunny beach Inside the house curtains sway in the breeze while Connie sits reading a letter considering it with her long dark hair tied back Looking overwhelmed Connie puts her hands to her mouth holds a pen hovers it over a document and then signs it before looking out over the ocean silhouetted against hazy golden light Ben escorts Emily as a nurse pushes her out of the hospital in a wheelchair to his car where he opens the door for Emily with Duke in the back and fastens her seat belt Emily grins while Ben stares ahead She gazes at him and smiles then lightly nibbles her nails Ben pulls up and turns to her awkwardly his eyes darting about as he thinks before eyeing her firmly Emily stares at him puzzled studying him through slightly narrowed eyes before staring at him expectantly opening her eyes wide and furrowing her brows Ben meets her gaze blankly as Emily looks down considers and then undoes her seat belt shoots him a disdainful look and gets out Ben stirs and sits up as a doctor enters Dr Briar sits on Emily's bed and Emily nods as Dr Briar hands her the pager Emily takes a deep breath and looks down while Dr Briar strokes her hair gives her a reassuring smile and leaves Tears roll down Emily's cheeks as she puts a hand to her mouth and takes Ben's hand Ben looks on sorrowfully as Emily presses the back of his hand against her forehead and weeps Ben walks Duke on a lead past the Travel Inn reception Larry sees them and comes out after them Ben enters his room leaving longhaired Larry outside looking indignant Inside a small fish swims up into the tentacles of the box jellyfish in Ben's aquarium becomes partially paralyzed and is drawn toward the jellyfish's body Ben sits on his motel bed watching and slowly reaches for his mobile beside him Connie's face is bruised as Ben hands her an envelope which Connie accepts nodding They sleep in the back of her car and later a calm Connie drives along the coast road with the children still asleep"
        }
      ]
    }
  ]
}