{
  "ground_truth": "She puts them down and is surprised to see Miranda sitting on the couch with her glasses in her hand, just staring into space. She's wearing a dressing gown and has no makeup on. Miranda has her hand held out for them. Andy holds out a folder, which Miranda ungraciously accepts. Andy's taken aback. Andy glances down at the papers in her lap, and then looks across at Miranda with sympathy. Miranda hands back the seating chart. Back in her own suite, Andy has changed into a slim-fitting low cut black suit. She studies her reflection in a big mirror and touches up the mascara on her long, black lashes. Nigel comes in and studies the outfit she's wearing. They raise their glasses. Andy and Christian in an elegant restaurant. After dinner, they stroll near the Notredam Cathedral. She swings around a lamppost. Christian kisses her. He kisses her again and again. She kisses him back, wrapping her arm around his neck. They are surrounded by bare trees adorned with fairy lights. There's a view of the Eiffel Tower from Christian's hotel bedroom window. Andy wakes up in his bed alone, and puts her hand to her head with a grimace. She rolls over and consults her watch on the bedside table. Pulled on her clothes and is hopping around about trying to put her shoes on. Andy goes to grab her jacket and knocks over Christian's bag. Christian comes out of the bathroom in a towel. Andy grabs her stuff and goes. Walking along a modern bridge over the sand, she calls Miranda's suite. Andy gets back to the hotel and pauses before knocking on Miranda's door. Miranda and Irv shut the door in her face. She's changed into a black dress with a scoop neck, a full skirt with petticoats, and wears black gloves and a silver necklace. At the event, she paces the hallway. Nigel steps down from the podium. Miranda makes her way over from the table she's been sitting at. They had gathered in a plush banqueting suite with chandeliers hanging from the ceiling. Andy spies Christian sitting with Jacqueline. Miranda kisses Nigel before taking her place. James gets up and salutes his fans. Andy and Nigel smile over at him. Nigel's excited smile fades and he looks up at Miranda crestfallen. Pretty Jacqueline beams delightedly. Nigel puts on a brave face and applauds her. Jacqueline stands. Andy looks over at Miranda incredulously. Up on the podium, Miranda smiles and applauds Jacqueline as Irv eyes her coolly. Andy glances over at Christian, who looks stunned. James preens himself smugly. Nigel fidgets in his seat. Later, Andy gets into the back of a smart, black executive car, which is parked outside the venue.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "She places them down and is astonished to observe Miranda seated on the sofa with her spectacles in her hand, merely gazing into void. She's clad in a robe and has no cosmetics on. Miranda has her hand extended for them. Andy extends a dossier, which Miranda gracelessly receives. Andy's stunned. Andy peeks down at the documents in her lap, and then looks across at Miranda with compassion. Miranda returns the seating chart. Back in her own suite, Andy has changed into a sleek-fitting low cut ebony suit. She examines her reflection in a large mirror and retouches the mascara on her lengthy, ebony lashes. Nigel enters and examines the attire she's wearing. They lift their glasses. Andy and Christian in a sophisticated eatery. After supper, they saunter near the Notredam Cathedral. She twirls around a lamppost. Christian kisses her. He kisses her again and again. She kisses him back, wrapping her arm around his neck. They are surrounded by barren trees adorned with fairy lights. There's a view of the Eiffel Tower from Christian's hotel room window. Andy wakes up in his bed alone, and places her hand to her head with a grimace. She rolls over and checks her watch on the bedside table. Pulled on her attire and is hopping around about attempting to put her shoes on. Andy goes to seize her jacket and knocks over Christian's bag. Christian emerges from the bathroom in a towel. Andy seizes her belongings and departs. Strolling along a contemporary bridge over the sand, she calls Miranda's suite. Andy returns to the hotel and hesitates before knocking on Miranda's door. Miranda and Irv close the door in her face. She's changed into a black dress with a scoop neck, a full skirt with petticoats, and wears black gloves and a silver necklace. At the occasion, she paces the corridor. Nigel descends from the podium. Miranda makes her way over from the table she's been seated at. They had gathered in a luxurious banqueting suite with chandeliers suspended from the ceiling. Andy notices Christian seated with Jacqueline. Miranda kisses Nigel before taking her position. James rises and salutes his supporters. Andy and Nigel grin over at him. Nigel's enthusiastic grin fades and he looks up at Miranda despondently. Pretty Jacqueline beams delightedly. Nigel dons a brave face and applauds her. Jacqueline stands. Andy looks over at Miranda incredulously. Up on the podium, Miranda smiles and applauds Jacqueline as Irv eyes her coolly. Andy glances over at Christian, who looks stupefied. James preens himself smugly. Nigel squirms in his seat. Later, Andy gets into the back of a stylish, black executive car, which is parked outside the venue."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "They are put down by her, and Miranda is seen sitting on the couch with her glasses in her hand, just staring into space. A dressing gown is worn by her, and no makeup is on. Her hand is held out by Miranda for them. A folder is held out by Andy, which is ungraciously accepted by Miranda. Andy is taken aback. The papers in her lap are glanced down at by Andy, and then Miranda is looked across at with sympathy. The seating chart is handed back by Miranda. Back in her own suite, a slim-fitting low cut black suit has been changed into by Andy. Her reflection is studied by her in a big mirror and the mascara on her long, black lashes is touched up. The outfit she's wearing is studied by Nigel as he comes in. Their glasses are raised by them. Andy and Christian are seen in an elegant restaurant. After dinner, a stroll is taken by them near the Notre Dame Cathedral. A lamppost is swung around by her. She is kissed by Christian. She is kissed again and again by him. He is kissed back by her, as her arm is wrapped around his neck. Bare trees adorned with fairy lights surround them. A view of the Eiffel Tower is seen from Christian's hotel bedroom window. Alone in his bed, Andy wakes up, and her hand is put to her head with a grimace. She rolls over and her watch is consulted on the bedside table. Her clothes are pulled on and she is hopping around trying to put her shoes on. Her jacket is grabbed by Andy and Christian's bag is knocked over. Christian, in a towel, comes out of the bathroom. Her stuff is grabbed by Andy and she goes. As a modern bridge over the sand is walked along by her, Miranda's suite is called. Back to the hotel, Andy gets and pauses before Miranda's door is knocked on. The door is shut in her face by Miranda and Irv. A black dress with a scoop neck, a full skirt with petticoats is changed into by her, and black gloves and a silver necklace are worn. At the event, the hallway is paced by her. Nigel steps down from the podium. Her way is made over by Miranda from the table she's been sitting at. They gathered in a plush banqueting suite with chandeliers hanging from the ceiling. Christian sitting with Jacqueline is spied by Andy. Nigel is kissed by Miranda before her place is taken. His fans are saluted by James as he gets up. Andy and Nigel smile over at him. Nigel's excited smile fades, and Miranda is looked up at with a crestfallen expression by him. Delightedly beamed at by pretty Jacqueline. A brave face is put on by Nigel and she is applauded. Jacqueline stands. Incredulously, Miranda is looked over at by Andy. Up on the podium, Jacqueline is smiled and applauded at by Miranda as Irv eyes her coolly. Christian, who looks stunned, is glanced over at by Andy. James smugly preens himself. In his seat, Nigel fidgets. Later, Andy gets into the back of a smart, black executive car that is parked outside the venue."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "She puts them down and is surprised to see Miranda on the couch, glasses in hand, staring into space, wearing a dressing gown and no makeup. Miranda extends her hand for the folder, which Andy gives reluctantly. Andy glances at her lap papers, then at Miranda with sympathy, as Miranda returns the seating chart. In her suite, Andy changes into a slim, low-cut black suit, touches up her mascara, and Nigel studies her outfit. They raise glasses. Andy and Christian dine elegantly, stroll near Notre Dame Cathedral, she swings around a lamppost, and they kiss multiple times under fairy-lit bare trees, with an Eiffel Tower view from Christian's window. Andy wakes up, grimaces, checks her watch, dresses, knocks over Christian's bag, and leaves as he exits the bathroom in a towel. She calls Miranda's suite from a modern bridge. Back at the hotel, she pauses at Miranda's door as it's shut in her face. She's now in a black scoop-neck dress, full skirt, black gloves, and a silver necklace. At the event's plush suite with chandeliers, Nigel steps down from the podium. Miranda moves over, kisses Nigel, and takes her place. James salutes fans, Andy and Nigel smile. Nigel's smile fades, looks at Miranda, crestfallen; Jacqueline beams, and Nigel bravely applauds her. Andy looks at Miranda incredulously, who applauds Jacqueline, while Irv watches coolly. Andy glances at stunned Christian, while James preens smugly and Nigel fidgets. Later, Andy gets into a smart black car outside the venue."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Surprised, Andy finds Miranda staring into space on the couch, glasses in hand, wearing a dressing gown without makeup. Miranda extends her hand for a folder, which she accepts ungraciously. Andy glances at her papers, then sympathetically at Miranda, who returns the seating chart. In her suite, Andy changes into a slim black suit, touches up her mascara before Nigel enters to study her outfit. They toast. At an elegant restaurant, Andy and Christian stroll near Notre-Dame Cathedral post-dinner. Under fairy-lit trees, they kiss repeatedly, with a view of the Eiffel Tower from Christian's hotel room. Andy wakes alone with a grimace, hurriedly dresses, and accidentally spills Christian's bag. Christian emerges in a towel; Andy leaves quickly. Walking on a modern bridge, she calls Miranda's suite. Returning to the hotel, Miranda and Irv shut the door in her face. Dressed in a scoop-neck black dress, Andy paces at the event. In a banqueting suite, Nigel steps down from the podium as Miranda approaches. Christian sits with Jacqueline. Miranda kisses Nigel, then joins the table. James salutes his fans as Nigel's smile fades. Jacqueline beams as Nigel bravely applauds. Andy incredulously watches Miranda praise Jacqueline on the podium while Irv observes. Andy notices a stunned Christian and a smug James. Nigel fidgets. Later, Andy enters a smart black car outside the venue."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "She carefully places the items down and finds herself taken aback when she unexpectedly notices Miranda seated comfortably on the couch, holding her glasses in one hand and gazing silently into space with an air of contemplation. Miranda, in a state of casual relaxation, is wrapped in a cozy dressing gown and devoid of any makeup. Without speaking, Miranda extends her hand expectantly towards her. In response, Andy, somewhat hesitantly, extends a folder in return, which Miranda accepts with a lack of grace that surprises Andy. Feeling a little shaken, Andy glances down thoughtfully at the stack of papers resting on her lap, then directs a look filled with sympathy towards Miranda. Miranda, in return, offers back the seating chart to Andy. \n\nLater, in the privacy of her own suite, Andy has transformed into a sleek, form-fitting black suit that accentuates her figure with a low-cut design. She meticulously examines her reflection in a large, elegant mirror, ensuring every detail is perfect as she carefully touches up the mascara on her long, dark lashes. Nigel makes his entrance, taking a moment to study the ensemble she's wearing with a discerning eye. Together, they raise their glasses in a silent toast.\n\nThe scene shifts to an elegant restaurant where Andy and Christian are enjoying a refined dining experience. After their delightful meal, they leisurely stroll near the picturesque Notre Dame Cathedral. Andy playfully swings around a lamppost, her laughter echoing in the night air. Christian seizes the moment to affectionately kiss her, and then, unable to resist, kisses her once more, again and again. She warmly returns his kisses, wrapping an affectionate arm around his neck. The couple is enveloped by bare trees that are beautifully adorned with twinkling fairy lights. From Christian's hotel room window, there's a breathtaking view of the magnificent Eiffel Tower.\n\nThe next morning, Andy awakens in his bed, finding herself alone. She lets out a soft groan, putting a hand to her head with a grimace of mild regret. She rolls over in the bed and consults her watch, which rests on the nearby bedside table. Hastily throwing on her clothes, she hops around in an awkward dance while trying to put her shoes on. In her hurry, Andy reaches to grab her jacket and inadvertently knocks over Christian's bag. At that moment, Christian emerges from the bathroom, wrapped only in a towel. Without delay, Andy gathers her belongings and swiftly makes her exit.\n\nAs she walks across a sleek, modern bridge spanning the sand, she takes a moment to call Miranda's suite. Upon returning to the hotel, she pauses momentarily before nervously knocking on Miranda's door. The door opens only briefly before Miranda and Irv shut it in her face. Andy, now changed into a striking black dress with a graceful scoop neck and a full skirt enhanced by petticoats, complements her look with elegant black gloves and a shimmering silver necklace. At the event, restless and filled with anticipation, she paces the corridor. Nigel gracefully descends from the podium. Miranda elegantly makes her way over from the table where she's been seated.\n\nThe gathering takes place in a luxurious banqueting suite, lavishly decorated with exquisite chandeliers hanging from the ceiling. Andy notices Christian seated alongside Jacqueline, which draws her attention. Meanwhile, Miranda places a gentle kiss on Nigel before she assumes her position. James rises to his feet, offering a salute to his adoring fans. Andy and Nigel exchange smiles filled with shared admiration as they look at James. However, Nigel's once bright and excited smile gradually fades, leaving his expression crestfallen as he looks towards Miranda. The radiant Jacqueline beams with delight, and despite his disappointment, Nigel musters the strength to put on a brave face and applauds her moderately. Jacqueline stands up gracefully. Andy, unable to suppress her incredulity, looks over at Miranda. Up on the podium, Miranda beams with a smile and claps for Jacqueline, while Irv observes her with a cool, detached demeanor. Andy's gaze drifts towards Christian, who appears visibly stunned by the unfolding events. James, meanwhile, smugly preens himself. Nigel fidgets restlessly in his seat. Later, Andy slips into the back of a sleek, black executive car, which waits parked outside the grand venue."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "She carefully sets down the items she is carrying and finds herself momentarily taken aback when she unexpectedly notices Miranda seated comfortably on the plush couch. Miranda is holding her glasses in one hand, gazing silently into space with an air of deep contemplation. In a state of casual relaxation, Miranda is wrapped snugly in a cozy dressing gown and is noticeably devoid of any makeup. Without uttering a word, Miranda extends her hand toward Andy, who responds somewhat hesitantly by handing over a folder. Miranda accepts it with a lack of grace that takes Andy by surprise. Feeling slightly shaken, Andy thoughtfully glances down at the stack of papers resting on her lap, then directs a look filled with profound sympathy toward Miranda. In return, Miranda hands back the seating chart to Andy.\n\nLater, in the secluded comfort of her own suite, Andy transforms her appearance by slipping into a sleek, form-fitting black suit that exquisitely accentuates her figure with its low-cut design. She meticulously examines her reflection in a large, elegant mirror, ensuring every detail of her appearance is flawless as she carefully touches up the mascara on her long, dark lashes. Nigel enters the room, taking a moment to study the ensemble she's wearing with a discerning, critical eye. Together, they each raise their glasses in a shared, silent toast.\n\nThe scene transitions to an elegant, sophisticated restaurant where Andy and Christian are enjoying a refined dining experience. After their delightful meal, they leisurely stroll near the picturesque Notre Dame Cathedral. Andy playfully swings around a lamppost, her laughter echoing joyfully in the night air. Christian seizes the moment to affectionately kiss her, and then, unable to resist, kisses her once more, again and again. She warmly returns his kisses, wrapping an affectionate, tender arm around his neck. The couple is surrounded by bare trees, beautifully adorned with twinkling fairy lights. From Christian's hotel room window, there's an absolutely breathtaking view of the magnificent Eiffel Tower, standing majestically in the horizon.\n\nThe next morning, Andy awakens in his bed, finding herself alone. She lets out a soft groan, placing a hand to her head with a grimace of mild regret. She rolls over in the bed and consults her watch, which rests on the nearby bedside table. Hastily, she throws on her clothes, hopping around in an awkward dance while trying to put her shoes on. In her hurry, Andy reaches to grab her jacket and inadvertently knocks over Christian's bag. At that precise moment, Christian emerges from the bathroom, wrapped only in a towel. Without any delay, Andy gathers her belongings and swiftly makes her exit.\n\nAs she walks across a sleek, modern bridge spanning the sand, she takes a brief moment to call Miranda's suite. After returning to the hotel, she pauses momentarily before nervously knocking on Miranda's door. The door opens only briefly, just before Miranda and Irv shut it in her face. Andy, now changed into a striking black dress with a graceful scoop neck and a full skirt enhanced by petticoats, complements her look with elegant black gloves and a shimmering silver necklace. At the event, restless and filled with anticipation, she paces the corridor. Nigel gracefully descends from the podium. Miranda elegantly makes her way over from the table where she's been seated.\n\nThe gathering takes place in a luxurious banqueting suite, lavishly decorated with exquisite chandeliers hanging majestically from the ceiling. Andy takes note of Christian seated alongside Jacqueline, which draws her attention. Meanwhile, Miranda places a gentle, affectionate kiss on Nigel before she assumes her position. James rises to his feet, offering a warm salute to his adoring fans. Andy and Nigel exchange smiles filled with mutual admiration as they look at James. However, Nigel's once bright and excited smile gradually fades, leaving his expression crestfallen as he looks toward Miranda. The radiant Jacqueline beams with delight, and despite his disappointment, Nigel musters the strength to put on a brave face and applauds her moderately. Jacqueline stands up gracefully. Andy, unable to suppress her incredulity, looks over at Miranda. Up on the podium, Miranda beams with a radiant smile and claps for Jacqueline, while Irv observes her with a cool, detached demeanor. Andy's gaze drifts toward Christian, who appears visibly stunned by the astonishing unfolding events. James, meanwhile, smugly preens himself. Nigel fidgets restlessly in his seat. Later, Andy slips into the back of a sleek, black executive car, which waits parked just outside the grand, opulent venue."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "She places the items down gently, only to be taken aback by the unexpected sight of Miranda lounging on the couch, glasses clasped loosely in her hand, her gaze fixed aimlessly into space. Miranda, enveloped in a casual dressing gown and devoid of any makeup, extends her hand silently, anticipating the deliverance of the documents. Responding to this unspoken request, Andy offers the folder, which Miranda accepts with a lack of grace that momentarily unsettles Andy. Andy’s eyes drift downwards, absorbing the sight of the papers resting in her lap, before darting back to Miranda, her expression softening with sympathy. Miranda, without much ado, returns the seating chart to Andy. In her own suite, Andy undergoes a transformation, slipping into a sleek, low-cut black suit that hugs her form. She stands before a large mirror, scrutinizing her reflection with a discerning eye, meticulously applying mascara to elongate her inky lashes. As Nigel enters the room, his eyes assessively travel over the outfit Andy has chosen, a silent approval exchanged as they clink their glasses in camaraderie. The scene shifts to Andy and Christian seated in an elegant restaurant, engaged in intimate conversation. Their evening unfolds further as they leisurely stroll near the majestic Notre Dame Cathedral, where Andy playfully twirls around a lamppost. Christian captures the moment to lean in and plant a kiss on her lips, a gesture he repeats with increasing fervor. She reciprocates, wrapping her arm around his neck, their surroundings a constellation of bare trees adorned with twinkling fairy lights. From the window of Christian's hotel room, the iconic silhouette of the Eiffel Tower stands in view. Morning arrives, and Andy awakens alone in his bed, placing a hand to her head as a grimace crosses her face, signifying the aftereffects of the previous night. She rolls over, consulting her watch on the bedside table with urgency. Hastily dressing, she hops on one foot to slide on her shoes, unintentionally knocking over Christian’s bag in her rush. Emerging from the bathroom, Christian is draped in a towel, while Andy hurriedly gathers her belongings and makes a swift exit. As she strides along a modern bridge spanning the sands, her phone call connects to Miranda’s suite mid-walk. Arriving back at the hotel, she hesitates momentarily before summoning the courage to knock on Miranda’s door, only to have it closed on her by Miranda and Irv. Andy has since changed into a sophisticated black dress featuring a scoop neck and a full skirt with petticoats, accessorized with black gloves and a silver necklace, suited for the event. She paces the hallways of the richly adorned banquet suite, chandeliers casting an opulent glow overhead, as Nigel descends from the podium. Observing Miranda making her way over from her seated position, Andy notes Christian seated alongside Jacqueline. Miranda exchanges a brief kiss with Nigel before assuming her place. James stands to salute his fans, prompting Andy and Nigel to exchange appreciative smiles. Nigel’s excitement dims, and he looks towards Miranda with a crestfallen expression as Jacqueline beams with delight. Adopting a façade of bravery, Nigel joins in the applause for her as Jacqueline rises. Andy casts a look of incredulity at Miranda while up on the podium, Miranda returns Jacqueline’s gesture with a smile and applause as Irv watches her coolly. Andy’s eyes dart to Christian, who appears equally shocked, while James basks in self-satisfaction. Nigel shifts uneasily in his seat. Later, Andy settles into the backseat of a sleek, black executive car idling outside the venue, contemplating the events that have transpired."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Andy is surprised to find Miranda in casual attire, holding her glasses and staring into space. After handing over a folder, which Miranda accepts without acknowledgment, Andy receives the seating chart back with sympathy for Miranda. In her suite, Andy changes into a stylish black suit, checks her reflection, and touches up her makeup. Nigel enters, assessing her outfit before they raise their glasses together. Later, Andy dines with Christian at an elegant restaurant, and they stroll by Notre Dame Cathedral. They share a series of intimate kisses under fairy lights and a view of the Eiffel Tower from Christian's hotel window. Andy wakes up alone in Christian’s bed, realizing the time with a grimace. She hurriedly dresses, knocking over his bag as he emerges from the bathroom, before leaving. On her way, Andy calls Miranda’s suite and returns to the hotel, hesitating before Miranda’s door. Miranda and Irv then shut the door in her face. Andy changes into a black dress for an event, pacing the hallway as Nigel finishes on the podium. In a banqueting suite with chandeliers, she notices Christian with Jacqueline. Miranda approaches after kissing Nigel, while James acknowledges his fans. Nigel’s excitement turns to disappointment as Jacqueline beams, and he applauds bravely when she stands. Andy observes the scene incredulously as Miranda applauds Jacqueline with Irv watching. Christian looks stunned, and James preens smugly as Nigel fidgets. Later, Andy leaves the venue in a sleek, black executive car."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "She puts them down and is surprised to see Miranda, the renowned editor of a major fashion magazine known for her impeccable style, sitting on the couch with her glasses in her hand, just staring into space. She's wearing a dressing gown, which is quite unusual for her typical fashion-forward appearance, and has no makeup on. Miranda has her hand held out for them. Andy holds out a folder, which Miranda ungraciously accepts, a rare break from her usual authoritative grace. Andy's taken aback. Andy glances down at the papers in her lap, filled with layout designs for the upcoming issue, and then looks across at Miranda with sympathy. Miranda hands back the seating chart, crucial for the upcoming gala dinner. Back in her own suite, located in a luxurious Parisian hotel, Andy has changed into a slim-fitting low cut black suit. She studies her reflection in a big mirror and touches up the mascara on her long, black lashes. Nigel, her sharp-eyed fashion mentor, comes in and studies the outfit she's wearing. They raise their glasses in a toast to the night. Andy and Christian dine in an elegant restaurant, famous for its view of the Seine River. After dinner, they stroll near the Notre Dame Cathedral, an iconic Gothic structure in the heart of Paris. She swings around a lamppost, reminiscent of classic romantic films. Christian kisses her softly, under the glow of streetlights. He kisses her again and again. She kisses him back, wrapping her arm around his neck. They are surrounded by bare trees adorned with fairy lights, casting a magical ambiance. There's a view of the Eiffel Tower, its lights twinkling in the night, from Christian's hotel bedroom window. Andy wakes up in his bed alone, and puts her hand to her head with a grimace, feeling the effects of a night well spent. She rolls over and consults her watch on the bedside table. Pulled on her clothes and is hopping around about trying to put her shoes on. Andy goes to grab her jacket and knocks over Christian's bag, filled with travel documents and souvenirs. Christian comes out of the bathroom in a towel, startled by the commotion. Andy grabs her stuff and goes, determined to keep her morning meetings. Walking along a modern bridge over the sand, a sleek architectural feat above the Seine, she calls Miranda's suite to check in. Andy gets back to the hotel and pauses before knocking on Miranda's door. Miranda and Irv, her hard-nosed publisher, shut the door in her face. She's changed into a black dress with a scoop neck, a full skirt with petticoats, and wears black gloves and a silver necklace, an ensemble designed by a prominent fashion house. At the event, she paces the hallway. Nigel steps down from the podium, where he had just introduced the next fashion icon. Miranda makes her way over from the table she's been sitting at, a place of honor. They had gathered in a plush banqueting suite with chandeliers hanging from the ceiling, sparkling luxuriously. Andy spies Christian sitting with Jacqueline, a rival editor known for her cunning. Miranda kisses Nigel before taking her place, acknowledging his indispensable contribution. James, a celebrated designer, gets up and salutes his fans, basking in their adoration. Andy and Nigel smile over at him, sharing a moment of professional pride. Nigel's excited smile fades and he looks up at Miranda crestfallen, realizing the shift in his expected career advancement. Pretty Jacqueline beams delightedly, reveling in her unexpected triumph. Nigel puts on a brave face and applauds her, maintaining his professional composure. Jacqueline stands, accepting her accolades. Andy looks over at Miranda incredulously, questioning the night's unfolding events. Up on the podium, Miranda smiles and applauds Jacqueline as Irv eyes her coolly, alluding to the underlying tensions in the business. Andy glances over at Christian, who looks stunned by the upheaval. James preens himself smugly, confident in his success. Nigel fidgets in his seat, contemplating his next move. Later, Andy gets into the back of a smart, black executive car, which is parked outside the venue, ready to take her back to her suite for a night of reflection."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Andy glances down at the papers in her lap and then looks across at Miranda with sympathy She puts them down and is surprised to see Miranda sitting on the couch with her glasses in her hand just staring into space She is wearing a dressing gown and has no makeup on Miranda has her hand held out for them Andy holds out a folder which Miranda ungraciously accepts Andy's taken aback Andy glances down at the papers in her lap and then looks across at Miranda with sympathy Miranda hands back the seating chart Back in her own suite Andy has changed into a slimfitting low cut black suit She studies her reflection in a big mirror and touches up the mascara on her long black lashes Miranda has her hand held out for them Later Andy gets into the back of a smart black executive car which is parked outside the venue She rolls over and consults her watch on the bedside table Nigel comes in and studies the outfit she is wearing They raise their glasses Andy glances over at Christian who looks stunned Andy and Christian in an elegant restaurant After dinner they stroll near the Notredam Cathedral She swings around a lamppost They are surrounded by bare trees adorned with fairy lights Christian kisses her He kisses her again and again She kisses him back wrapping her arm around his neck She studies her reflection in a big mirror and touches up the mascara on her long black lashes She kisses him back wrapping her arm around his neck They are surrounded by bare trees adorned with fairy lights There is a view of the Eiffel Tower from Christian's hotel bedroom window Andy wakes up in his bed alone and puts her hand to her head with a grimace She rolls over and consults her watch on the bedside table Pulled on her clothes and is hopping around about trying to put her shoes on Andy wakes up in his bed alone and puts her hand to her head with a grimace Andy goes to grab her jacket and knocks over Christian's bag Pretty Jacqueline beams delightedly Christian comes out of the bathroom in a towel Andy grabs her stuff and goes Walking along a modern bridge over the sand she calls Miranda's suite She is wearing a dressing gown and has no makeup on He kisses her again and again Andy gets back to the hotel and pauses before knocking on Miranda's door Miranda and Irv shut the door in her face Up on the podium She is changed into a black dress with a scoop neck a full skirt with petticoats and wears black gloves and a silver necklace At the event she paces the hallway Nigel steps down from the podium Miranda makes her way over from the table she is been sitting at They had gathered in a plush banqueting suite with chandeliers hanging from the ceiling She puts them down and is surprised to see Miranda sitting on the couch with her glasses in her hand just staring into space Andy spies Christian sitting with Jacqueline Christian kisses her Andy goes to grab her jacket and knocks over Christian's bag Back in her own suite Andy has changed into a slimfitting low cut black suit She swings around a lamppost Miranda kisses Nigel before taking her place James gets up and salutes his fans James preens himself smugly Andy and Nigel smile over at him Nigel's excited smile fades and he looks up at Miranda crestfallen Pretty Jacqueline beams delightedly Nigel puts on a brave face and applauds her Jacqueline stands Nigel's excited smile fades and he looks up at Miranda crestfallen Andy looks over at Miranda incredulously Up on the podium Miranda and Irv shut the door in her face Miranda smiles and applauds Jacqueline as Irv eyes her coolly Jacqueline stands Miranda hands back the seating chart Andy glances over at Christian who looks stunned James preens himself smugly Nigel fidgets in his seat Miranda kisses Nigel before taking her place Later Andy gets into the back of a smart black executive car which is parked outside the venue"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "She puts them down and is surprised to see Miranda sitting on the couch with her glasses in her hand just staring into space. She is wearing a dressing gown and has no makeup on. Miranda has her hand held out for them. Andy holds out a folder which Miranda ungraciously accepts. Andy's taken aback. Andy glances down at the papers in her lap and then looks across at Miranda with sympathy. Miranda hands back the seating chart. Back in her own suite Andy has changed into a slimfitting low cut black suit. She studies her reflection in a big mirror and touches up the mascara on her long black lashes. Nigel comes in and studies the outfit she is wearing. They raise their glasses. Andy and Christian in an elegant restaurant. After dinner they stroll near the Notredam Cathedral. She swings around a lamppost. Christian kisses her. He kisses her again and again. She kisses him back wrapping her arm around his neck. They are surrounded by bare trees adorned with fairy lights. There is a view of the Eiffel Tower from Christian's hotel bedroom window. Andy wakes up in his bed alone and puts her hand to her head with a grimace. She rolls over and consults her watch on the bedside table. Pulled on her clothes and is hopping around about trying to put her shoes on. Andy goes to grab her jacket and knocks over Christian's bag. Christian comes out of the bathroom in a towel. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. Andy grabs her stuff and goes. Walking along a modern bridge over the sand she calls Miranda's suite. Andy gets back to the hotel and pauses before knocking on Miranda's door. Miranda and Irv shut the door in her face. She is changed into a black dress with a scoop neck a full skirt with petticoats and wears black gloves and a silver necklace. At the event she paces the hallway. Nigel steps down from the podium. Miranda makes her way over from the table she is been sitting at. They had gathered in a plush banqueting suite with chandeliers hanging from the ceiling. Andy spies Christian sitting with Jacqueline. Miranda kisses Nigel before taking her place. James gets up and salutes his fans. Andy and Nigel smile over at him. Nigel's excited smile fades and he looks up at Miranda crestfallen. Pretty Jacqueline beams delightedly. Nigel puts on a brave face and applauds her. Jacqueline stands. Andy looks over at Miranda incredulously. Up on the podium. Miranda smiles and applauds Jacqueline as Irv eyes her coolly. Andy glances over at Christian who looks stunned. James preens himself smugly. Nigel fidgets in his seat. Later Andy gets into the back of a smart black executive car which is parked outside the venue."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "She puts them down and is surprised to see Miranda sitting on the couch with her glasses in her hand just staring into space. She is wearing a dressing gown and has no makeup on. Miranda has her hand held out for them. Andy holds out a folder which Miranda ungraciously accepts. Andy's taken aback. Andy glances down at the papers in her lap and then looks across at Miranda with sympathy. Miranda hands back the seating chart. Back in her own suite Andy has changed into a slimfitting low cut black suit. She studies her reflection in a big mirror and touches up the mascara on her long black lashes. Nigel comes in and studies the outfit she is wearing. They raise their glasses. Andy and Christian in an elegant restaurant. After dinner they stroll near the Notredam Cathedral. She swings around a lamppost. Christian kisses her. He kisses her again and again. She kisses him back wrapping her arm around his neck. They are surrounded by bare trees adorned with fairy lights. There is a view of the Eiffel Tower from Christian's hotel bedroom window. Andy wakes up in his bed alone and puts her hand to her head with a grimace. She rolls over and consults her watch on the bedside table. Pulled on her clothes and is hopping around about trying to put her shoes on. Andy goes to grab her jacket and knocks over Christian's bag. Christian comes out of the bathroom in a towel. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Andy grabs her stuff and goes. Walking along a modern bridge over the sand she calls Miranda's suite. Andy gets back to the hotel and pauses before knocking on Miranda's door. Miranda and Irv shut the door in her face. She is changed into a black dress with a scoop neck a full skirt with petticoats and wears black gloves and a silver necklace. At the event she paces the hallway. Nigel steps down from the podium. Miranda makes her way over from the table she is been sitting at. They had gathered in a plush banqueting suite with chandeliers hanging from the ceiling. Andy spies Christian sitting with Jacqueline. Miranda kisses Nigel before taking her place. James gets up and salutes his fans. Andy and Nigel smile over at him. Nigel's excited smile fades and he looks up at Miranda crestfallen. Pretty Jacqueline beams delightedly. Nigel puts on a brave face and applauds her. Jacqueline stands. Andy looks over at Miranda incredulously. Up on the podium. Miranda smiles and applauds Jacqueline as Irv eyes her coolly. Andy glances over at Christian who looks stunned. James preens himself smugly. Nigel fidgets in his seat. Later Andy gets into the back of a smart black executive car which is parked outside the venue."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "She puts them down and is surprised to see Miranda sitting on the couch with her glasses in her hand just staring into space. She is wearing a dressing gown and has no makeup on. Miranda has her hand held out for them. Andy holds out a folder which Miranda ungraciously accepts. Andy's taken aback. Andy glances down at the papers in her lap and then looks across at Miranda with sympathy. Miranda hands back the seating chart. Back in her own suite Andy has changed into a slimfitting low cut black suit. She studies her reflection in a big mirror and touches up the mascara on her long black lashes. Nigel comes in and studies the outfit she is wearing. They raise their glasses. Andy and Christian in an elegant restaurant. Andy and Nigel smile over at him. Nigel's excited smile fades and he looks up at Miranda crestfallen. Pretty Jacqueline beams delightedly. Nigel puts on a brave face and applauds her. Jacqueline stands. Andy looks over at Miranda incredulously. Up on the podium. Miranda smiles and applauds Jacqueline as Irv eyes her coolly. Andy glances over at Christian who looks stunned. James preens himself smugly. Nigel fidgets in his seat. Later Andy gets into the back of a smart black executive car which is parked outside the venue."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "She puts them down and is surprised to see Miranda sitting on the couch with her glasses in her hand just staring into space. She is wearing a dressing gown and has no makeup on. Miranda has her hand held out for them. Andy holds out a folder which Miranda ungraciously accepts. Andy's taken aback. Miranda smiles and applauds Jacqueline as Irv eyes her coolly. Andy glances over at Christian who looks stunned. James preens himself smugly. Nigel fidgets in his seat. Later Andy gets into the back of a smart black executive car which is parked outside the venue."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "She puts them down and is surprised to see the lion sitting on the couch with its glasses in its paw, just staring into space. The lion is wearing a dressing gown and has no makeup on. The lion has its paw held out for them. The dolphin holds out a folder, which the lion ungraciously accepts. The dolphin is taken aback. The dolphin glances down at the papers in its lap, and then looks across at the lion with sympathy. The lion hands back the seating chart. Back in its own suite, the dolphin has changed into a slim-fitting low cut black suit. It studies its reflection in a big mirror and touches up the mascara on its long, black lashes. The penguin comes in and studies the outfit the dolphin is wearing. They raise their glasses. The dolphin and the fox in an elegant restaurant. After dinner, they stroll near the Notredam Cathedral. The dolphin swings around a lamppost. The fox kisses it. The fox kisses it again and again. The dolphin kisses the fox back, wrapping its arm around the fox's neck. They are surrounded by bare trees adorned with fairy lights. There's a view of the Eiffel Tower from the fox's hotel bedroom window. The dolphin wakes up in the fox's bed alone, and puts its hand to its head with a grimace. It rolls over and consults its watch on the bedside table. Pulled on its clothes and is hopping around about trying to put its shoes on. The dolphin goes to grab its jacket and knocks over the fox's bag. The fox comes out of the bathroom in a towel. The dolphin grabs its stuff and goes. Walking along a modern bridge over the sand, it calls the lion's suite. The dolphin gets back to the hotel and pauses before knocking on the lion's door. The lion and the bear shut the door in its face. It has changed into a black dress with a scoop neck, a full skirt with petticoats, and wears black gloves and a silver necklace. At the event, it paces the hallway. The penguin steps down from the podium. The lion makes its way over from the table it's been sitting at. They had gathered in a plush banqueting suite with chandeliers hanging from the ceiling. The dolphin spies the fox sitting with the gazelle. The lion kisses the penguin before taking its place. The rabbit gets up and salutes its fans. The dolphin and the penguin smile over at it. The penguin's excited smile fades and it looks up at the lion crestfallen. Pretty the gazelle beams delightedly. The penguin puts on a brave face and applauds the gazelle. The gazelle stands. The dolphin looks over at the lion incredulously. Up on the podium, the lion smiles and applauds the gazelle as the bear eyes it coolly. The dolphin glances over at the fox, who looks stunned. The rabbit preens itself smugly. The penguin fidgets in its seat. Later, the dolphin gets into the back of a smart, black executive car, which is parked outside the venue."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "She puts them down and is surprised to see Miranda sitting on the hammock with her headphones in her hand, just staring into space. She's wearing a raincoat and has no jewelry on. Miranda has her hand held out for them. Andy holds out a book, which Miranda ungraciously accepts. Andy's taken aback. Andy glances down at the postcards in her lap, and then looks across at Miranda with sympathy. Miranda hands back the itinerary. Back in her own cabin, Andy has changed into a slim-fitting low cut gold jumpsuit. She studies her reflection in a full-length window and touches up the eyeliner on her long, black lashes. Nigel comes in and studies the ensemble she's wearing. They raise their mugs. Andy and Christian in an elegant gallery. After dinner, they stroll near the Parthenon Ruins. She swings around a signpost. Christian kisses her. He kisses her again and again. She kisses him back, wrapping her arm around his neck. They are surrounded by bare hedges adorned with fairy lights. There's a view of the Sydney Opera House from Christian's hotel lounge window. Andy wakes up on his couch alone, and puts her hand to her head with a grimace. She rolls over and consults her phone on the coffee table. Pulled on her clothes and is hopping around about trying to put her boots on. Andy goes to grab her scarf and knocks over Christian's suitcase. Christian comes out of the steam room in a robe. Andy grabs her stuff and goes. Walking along a modern walkway over the desert, she calls Miranda's cabin. Andy gets back to the hotel and pauses before knocking on Miranda's door. Miranda and Irv shut the door in her face. She's changed into a red dress with a turtleneck, a full skirt with ruffles, and wears white gloves and a pearl necklace. At the event, she paces the hallway. Nigel steps down from the dais. Miranda makes her way over from the booth she's been sitting at. They had gathered in a plush ball room with lanterns hanging from the ceiling. Andy spies Christian sitting with Jacqueline. Miranda kisses Nigel before taking her place. James gets up and salutes his fans. Andy and Nigel smile over at him. Nigel's excited smile fades and he looks up at Miranda crestfallen. Pretty Jacqueline beams delightedly. Nigel puts on a brave face and applauds her. Jacqueline stands. Andy looks over at Miranda incredulously. Up on the dais, Miranda smiles and applauds Jacqueline as Irv eyes her coolly. Andy glances over at Christian, who looks stunned. James preens himself smugly. Nigel fidgets in his seat. Later, Andy gets into the back of a smart, black executive van, which is parked outside the venue."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "She drops them and is startled to notice Miranda reclining on the couch with her glasses balanced on her hand, just gazing at the ceiling. She's wearing a dressing gown and has no makeup on. Miranda has her hand extended for them. Andy offers a folder, which Miranda reluctantly receives. Andy's confused. Andy peers down at the papers in her lap, and then peers over at Miranda with empathy. Miranda returns the seating chart. Back in her own suite, Andy has slipped into a sleek, low-cut black suit. She examines her reflection in a large mirror and adjusts the mascara on her long, black lashes. Nigel enters and examines the outfit she's wearing. They lift their glasses. Andy and Christian in an elegant restaurant. After dinner, they amble near the Notre Dame Cathedral. She spins around a lamppost. Christian embraces her. He embraces her again and again. She hugs him back, wrapping her arm around his neck. They are enclosed by bare trees adorned with fairy lights. There's a view of the Eiffel Tower from Christian's hotel bedroom window. Andy stirs in his bed alone and places her hand to her head with a wince. She flips over and checks her watch on the bedside table. Slipped on her clothes and is hopping around trying to place her shoes on. Andy reaches to grab her jacket and spills Christian's bag. Christian appears from the bathroom in a towel. Andy seizes her stuff and departs. Strolling along a modern bridge over the sand, she contacts Miranda's suite. Andy returns to the hotel and hesitates before tapping on Miranda's door. Miranda and Irv close the door in her face. She's changed into a black dress with a scoop neck, a full skirt with petticoats, and wears black gloves and a silver necklace. At the event, she strides the hallway. Nigel descends from the podium. Miranda advances from the table she's been seated at. They had assembled in a plush banqueting suite with chandeliers suspended from the ceiling. Andy spots Christian sitting with Jacqueline. Miranda embraces Nigel before taking her place. James stands up and salutes his fans. Andy and Nigel grin over at him. Nigel's eager smile fades and he glances at Miranda, downcast. Pretty Jacqueline grins broadly. Nigel masks his disappointment and cheers her. Jacqueline rises. Andy gazes over at Miranda incredulously. Up on the podium, Miranda grins and cheers Jacqueline as Irv observes her coolly. Andy glances over at Christian, who looks astonished. James admires himself smugly. Nigel squirms in his seat. Later, Andy climbs into the back of a smart, black executive car, which is stationed outside the venue."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "The toaster sets them down and is surprised to see a pineapple sitting on the hammock with its spoon in its hand, just staring into void. It's wearing a firefighter's helmet and has no stamps on. The pineapple has its spoon held out for them. A penguin holds out a suitcase, which the pineapple ungraciously accepts. The penguin's taken aback. The penguin glances down at the shoes in its lap, and then looks across at the pineapple with sympathy. The pineapple hands back the calendar. Back in its own igloo, the penguin has changed into a polka-dotted, oversized orange robe. It studies its reflection in a tiny clock and touches up the yogurt on its short, green lashes. A dragonfly comes in and studies the outfit it's wearing. They raise their books. The penguin and the octopus in an empty library. After dinner, they stroll near the Taj Mahal. It swings around a microscope. The octopus kisses it. It kisses it again and again. It kisses it back, wrapping its tail around its shell. They are surrounded by tall books adorned with paper stars. There's a view of the Great Wall from the octopus's tent window. The penguin wakes up in its shell alone, and puts its spoon to its head with a grimace. It rolls over and consults its compass on the lamp table. Pulled on its blanket and is hopping around about trying to put its socks on. The penguin goes to grab its hat and knocks over the octopus's suitcase. The octopus comes out of the shower in a parachute. The penguin grabs its stuff and goes. Walking along a narrow pathway over the gravel, it calls the pineapple's igloo. The penguin gets back to the barn and pauses before knocking on the pineapple's fence. The pineapple and a giraffe shut the fence in its face. It's changed into a yellow coat with a fringed tail, a slim waistband with marbles, and wears purple boots and a golden bracelet. At the circus, it paces the hallway. A dragonfly steps down from the stage. The pineapple makes its way over from the chair it's been sitting at. They had gathered in a crowded stadium with paper lanterns hanging from the ceiling. The penguin spies the octopus sitting with a giraffe. The pineapple kisses the dragonfly before taking its place. A tomato gets up and salutes its clones. The penguin and the dragonfly smile over at it. The dragonfly's excited smile fades and it looks up at the pineapple crestfallen. Quiet giraffe beams delightedly. The dragonfly puts on a brave face and applauds it. The giraffe stands. The penguin looks over at the pineapple incredulously. Up on the stage, the pineapple smiles and applauds the giraffe as the giraffe eyes it coolly. The penguin glances over at the octopus, who looks stunned. The tomato preens itself smugly. The dragonfly fidgets in its seat. Later, the penguin gets into the back of a rusty, blue family bicycle, which is parked outside the pond."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "She sets them down and is bewildered to find Caroline lounging on the couch with her keys in her hand, just gazing vacantly. She's wearing a tracksuit and has messy hair. Caroline has her hand extended for them. Sam offers a letter, which Caroline dismissively receives. Sam's startled. Sam peeks down at the documents in her lap, and then observes Caroline with empathy. Caroline returns the seating plan. Back in her own cabin, Sam has switched into a tight-fitting, deep-blue dress. She examines her reflection in a large mirror and adjusts the blush on her rosy cheeks. Ron wanders in and inspects the attire she's put on. They clink their cups. Sam and Jordan in an upscale bistro. After the meal, they meander near the Big Ben. She twirls around a tree trunk. Jordan hugs her. He embraces her repeatedly. She hugs him back, looping her arm around his shoulder. They are encircled by leafless trees adorned with festive lights. There's a view of the Statue of Liberty from Jordan's hotel room window. Sam wakes up in his room alone, and puts her hand to her temple with a wince. She turns over and checks her phone on the side table. Pulled on her garments and is jumping around trying to put her boots on. Sam moves to grab her coat and topples Jordan's backpack. Jordan emerges from the restroom in a robe. Sam grabs her belongings and exits. Strolling along a futuristic bridge over the grass, she contacts Caroline's cabin. Sam returns to the hotel and hesitates before knocking on Caroline's door. Caroline and Paul close the door in her face. She's changed into a red gown with a halter neck, a flared skirt with layers, and wears white gloves and a gold bracelet. At the gathering, she strides the corridor. Ron descends from the stage. Caroline advances from the chair she's been reclining on. They had convened in a luxurious dining hall with lanterns hanging from the rafters. Sam spots Jordan sitting with Natalie. Caroline kisses Ron before assuming her position. Mark gets up and waves to his admirers. Sam and Ron grin over at him. Ron's thrilled grin diminishes and he glances up at Caroline dismayed. Cheerful Natalie grins blissfully. Ron puts on a stoic expression and honors her. Natalie rises. Sam gazes over at Caroline incredulously. Up on the stage, Caroline grins and honors Natalie as Paul regards her indifferently. Sam looks over at Jordan, who appears shocked. Mark adjusts his attire confidently. Ron squirms in his spot. Later, Sam climbs into the rear of a sleek, black luxury car, which is stationed outside the locale."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "She places them gently and is startled to find Miranda lounging on the hammock with her sunglasses in her grasp, just glancing into the garden. She's wearing a raincoat and has no jewelry on. Miranda extends her foot toward them. Andy offers a teapot, which Miranda unceremoniously snatches. Andy is puzzled. Andy peeks at the drawings on her shoes, and then gazes at Miranda with curiosity. Miranda passes back the menu. Back in her own lodge, Andy has changed into a flowing, high-neck red gown. She examines her profile in a small window and reapplies the lipstick on her short, blonde hair. Nigel enters and inspects the necklace she's wearing. They clink their spoons. Andy and Christian in a cozy library. After reading, they dance near the Parthenon Sculpture. She spins around a bookshelf. Christian hugs her. He hugs her again and again. She hugs him back, wrapping her arm around his shoulder. They are enveloped by tall cacti adorned with paper lanterns. There's a view of the Leaning Tower from Christian's apartment kitchen window. Andy wakes up on his sofa alone, and puts her hand to her stomach with a frown. She rolls over and examines her calendar on the coffee table. Pulled on her slippers and is tiptoeing around trying to put her cap on. Andy goes to grab her scarf and tips over Christian's painting. Christian emerges from the closet in pajamas. Andy clutches her belongings and exits. Strolling along an ancient path over the grass, she messages Miranda's lodge. Andy returns to the villa and hesitates before tapping on Miranda's entrance. Miranda and Irv slam the door behind her. She's changed into a white coat with a square neck, a fitted blazer with buttons, and wears red boots and a bronze bracelet. At the fair, she wanders the gallery. Nigel descends from the stage. Miranda strides over from the couch she's been reclining on. They had assembled in a luxurious ballroom with banners draped from the rafters. Andy notices Christian chatting with Jacqueline. Miranda embraces Nigel before assuming her position. James rises and waves to his admirers. Andy and Nigel grin over at him. Nigel's joyful expression diminishes and he glances at Miranda disheartened. Glowing Jacqueline grins cheerfully. Nigel musters a cheerful expression and claps for her. Jacqueline rises. Andy gazes at Miranda incredulously. Upon the stage, Miranda grins and claps for Jacqueline as Irv observes her indifferently. Andy peers over at Christian, who looks amazement. James adjusts his tie smugly. Nigel shifts in his seat. Later, Andy climbs into the front of a sleek, red sports car, which is idling near the entrance."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "He places the bird down and is astonished to find Hector napping on the carpet with his remote in his feet, just gazing at the ceiling. He’s wearing a firefighter uniform and has no helmet on. Hector has his feet stretched out for the bird. Carlos extends a backpack, which Hector reluctantly grabs. Carlos is startled. Carlos glances down at the oranges in his lap, and then peers across at Hector with pity. Hector hands back the treasure map. Back in his own garage, Carlos has switched into a loose-fitting high collar yellow cape. He examines his shadow in a tiny pond and adjusts the goggles on his short, white antennae. Fernando enters and examines the cloak he’s holding. They clink their marbles. Carlos and Sam in a rustic cabin. After breakfast, they jog near the Washington Bridge. He rotates around a telephone pole. Sam hugs him. He hugs him once more continually. He hugs him too, looping his leg around his shoulder. They are encircled by tall ferns adorned with rain droplets. There's a glimpse of the Statue of Liberty from Sam's kitchen window. Carlos wakes up in his bathtub alone, and places his nose to his knees with a wince. He flips over and checks his compass on the bookshelf. Slipped into his boots and is zigzagging about attempting to put his scarf on. Carlos moves to seize his satchel and knocks over Sam's helmet. Sam emerges from the closet in a cape. Carlos snatches his things and exits. Skipping along a wooden pier over the gravel, he texts Hector's garage. Carlos returns to the cabin and hesitates before ringing Hector's bell. Hector and Ava slam the gate in his face. He’s switched into a red suit with a round collar, a short cape with frills, and sports red boots and a golden bracelet. At the reunion, he prances the corridor. Fernando ascends from the bench. Hector strides over from the chair he’s been reclining on. They had assembled in a quaint dining room with lanterns hanging from the rafters. Carlos notices Sam lounging with Emily. Hector hugs Fernando before grabbing his spot. Leo rises and waves to his crew. Carlos and Fernando laugh over at him. Fernando’s joyful grin shrinks and he gazes up at Hector disheartened. Cheerful Emily grins enthusiastically. Fernando maintains a courageous expression and cheers her. Emily rises. Carlos observes Hector incredulously. At the bench, Hector laughs and cheers Emily as Ava watches her coldly. Carlos peeks over at Sam, who appears bewildered. Leo grooms himself arrogantly. Fernando squirms in his chair. Later, Carlos enters the back of a sleek, red delivery truck, which is stationed outside the place."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Andy finds Miranda in a vulnerable state, uncharacteristically dressed down and seemingly lost in thought. After completing her tasks for Miranda, Andy changes into a sleek black suit and heads out, later dining elegantly with Christian. The evening leads to a romantic encounter against the picturesque backdrop of the Eiffel Tower. The next morning, Andy wakes alone in Christian’s bed, hurrying to gather her things as he emerges from the bathroom. Rushing back to Miranda's suite, Andy tries to regroup for the day’s event. Despite her efforts, Miranda and Irv shut the door in her face, leaving Andy to prepare for the event solo. At the gathering, held in a lavish banqueting suite, Andy notices Christian with Jacqueline. Meanwhile, Nigel's happiness turns to disappointment as Miranda surprisingly applauds Jacqueline, overshadowing Nigel's moment. Andy sits in disbelief as the event unfolds, observing Nigel's forced smile and Jacqueline’s delight. Later on, she departs in an executive car, distanced from the unfolding drama."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Later Andy gets into the back of a smart black executive car which is parked outside the venue Nigel fidgets in his seat James preens himself smugly Andy glances over at Christian who looks stunned Miranda smiles and applauds Jacqueline as Irv eyes her coolly Up on the podium Andy looks over at Miranda incredulously Jacqueline stands Nigel puts on a brave face and applauds her Pretty Jacqueline beams delightedly Nigel's excited smile fades and he looks up at Miranda crestfallen Andy and Nigel smile over at him James gets up and salutes his fans Miranda kisses Nigel before taking her place Andy spies Christian sitting with Jacqueline They had gathered in a plush banqueting suite with chandeliers hanging from the ceiling Miranda makes her way over from the table she is been sitting at Nigel steps down from the podium At the event she paces the hallway She is changed into a black dress with a scoop neck a full skirt with petticoats and wears black gloves and a silver necklace Miranda and Irv shut the door in her face Andy gets back to the hotel and pauses before knocking on Miranda's door Walking along a modern bridge over the sand she calls Miranda's suite Andy grabs her stuff and goes Christian comes out of the bathroom in a towel Andy goes to grab her jacket and knocks over Christian's bag Pulled on her clothes and is hopping around about trying to put her shoes on She rolls over and consults her watch on the bedside table Andy wakes up in his bed alone and puts her hand to her head with a grimace There is a view of the Eiffel Tower from Christian's hotel bedroom window They are surrounded by bare trees adorned with fairy lights She kisses him back wrapping her arm around his neck He kisses her again and again Christian kisses her She swings around a lamppost After dinner they stroll near the Notredam Cathedral Andy and Christian in an elegant restaurant They raise their glasses Nigel comes in and studies the outfit she is wearing She studies her reflection in a big mirror and touches up the mascara on her long black lashes Back in her own suite Andy has changed into a slimfitting low cut black suit Miranda hands back the seating chart Andy glances down at the papers in her lap and then looks across at Miranda with sympathy Andy's taken aback Andy holds out a folder which Miranda ungraciously accepts Miranda has her hand held out for them She is wearing a dressing gown and has no makeup on She puts them down and is surprised to see Miranda sitting on the couch with her glasses in her hand just staring into space"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "At the event she paces the hallway Christian comes out of the bathroom in a towel Andy grabs her stuff and goes They raise their glasses Pulled on her clothes and is hopping around about trying to put her shoes on Nigel comes in and studies the outfit she is wearing Nigel steps down from the podium Nigel puts on a brave face and applauds her After dinner they stroll near the Notredam Cathedral Andy holds out a folder which Miranda ungraciously accepts James gets up and salutes his fans Andy's taken aback Miranda smiles and applauds Jacqueline as Irv eyes her coolly Andy gets back to the hotel and pauses before knocking on Miranda's door Andy and Christian in an elegant restaurant Andy spies Christian sitting with Jacqueline She is changed into a black dress with a scoop neck a full skirt with petticoats and wears black gloves and a silver necklace Andy looks over at Miranda incredulously There is a view of the Eiffel Tower from Christian's hotel bedroom window Miranda makes her way over from the table she is been sitting at Nigel fidgets in his seat They had gathered in a plush banqueting suite with chandeliers hanging from the ceiling Andy and Nigel smile over at him Walking along a modern bridge over the sand she calls Miranda's suite She rolls over and consults her watch on the bedside table Andy goes to grab her jacket and knocks over Christian's bag Later Andy gets into the back of a smart black executive car which is parked outside the venue Andy glances over at Christian who looks stunned She puts them down and is surprised to see Miranda sitting on the couch with her glasses in her hand just staring into space Andy wakes up in his bed alone and puts her hand to her head with a grimace She kisses him back wrapping her arm around his neck Up on the podium She swings around a lamppost Pretty Jacqueline beams delightedly James preens himself smugly Miranda has her hand held out for them Miranda and Irv shut the door in her face Nigel's excited smile fades and he looks up at Miranda crestfallen Andy glances down at the papers in her lap and then looks across at Miranda with sympathy Miranda kisses Nigel before taking her place Miranda hands back the seating chart She studies her reflection in a big mirror and touches up the mascara on her long black lashes Christian kisses her He kisses her again and again They are surrounded by bare trees adorned with fairy lights She is wearing a dressing gown and has no makeup on Back in her own suite Andy has changed into a slimfitting low cut black suit Jacqueline stands"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Andy grabs her stuff and goes Walking along a modern bridge over the sand she calls Miranda's suite Andy gets back to the hotel and pauses before knocking on Miranda's door Miranda and Irv shut the door in her face She is changed into a black dress with a scoop neck a full skirt with petticoats and wears black gloves and a silver necklace At the event she paces the hallway Nigel steps down from the podium Miranda makes her way over from the table she is been sitting at They had gathered in a plush banqueting suite with chandeliers hanging from the ceiling Andy spies Christian sitting with Jacqueline Miranda kisses Nigel before taking her place James gets up and salutes his fans Andy and Nigel smile over at him Nigel's excited smile fades and he looks up at Miranda crestfallen Pretty Jacqueline beams delightedly Nigel puts on a brave face and applauds her Jacqueline stands Andy looks over at Miranda incredulously Up on the podium Miranda smiles and applauds Jacqueline as Irv eyes her coolly Andy glances over at Christian who looks stunned James preens himself smugly Nigel fidgets in his seat Later Andy gets into the back of a smart black executive car which is parked outside the venue She puts them down and is surprised to see Miranda sitting on the couch with her glasses in her hand just staring into space She is wearing a dressing gown and has no makeup on Miranda has her hand held out for them Andy holds out a folder which Miranda ungraciously accepts Andy's taken aback Andy glances down at the papers in her lap and then looks across at Miranda with sympathy Miranda hands back the seating chart Back in her own suite Andy has changed into a slimfitting low cut black suit She studies her reflection in a big mirror and touches up the mascara on her long black lashes Nigel comes in and studies the outfit she is wearing They raise their glasses Andy and Christian in an elegant restaurant After dinner they stroll near the Notredam Cathedral She swings around a lamppost Christian kisses her He kisses her again and again She kisses him back wrapping her arm around his neck They are surrounded by bare trees adorned with fairy lights There is a view of the Eiffel Tower from Christian's hotel bedroom window Andy wakes up in his bed alone and puts her hand to her head with a grimace She rolls over and consults her watch on the bedside table Pulled on her clothes and is hopping around about trying to put her shoes on Andy goes to grab her jacket and knocks over Christian's bag Christian comes out of the bathroom in a towel"
        }
      ]
    }
  ]
}