{
  "ground_truth": "He turns and checks behind him. He turns back and lifts up the golden snitch bequeathed to him by Dumbledore. The writing on it appears. Harry studies it. He lifts the golden snitch to his mouth and presses it to his lips. The outer casing opens. The inner casing revolves to create an opening. Inside, a polished octagonal stone. On one surface, a circle is inscribed inside a triangle, down the middle of which is a line. The stone floats out of the snitch. Harry places the palm of his right hand under the floating stone. He carefully clenches his fist around it. His eyes are closed. Harry slowly opens them and stares ahead. In front of him stand his parents, with Sirius and Remus. Lily stretches out her hand. Harry goes to take it, but his hand passes right through hers. They gaze at each other. Lily lowers her hand. Lily smiles. Harry turns to Sirius and takes a few paces forward. Harry nods at his father, James. Harry turns and gazes at his mother, then moves towards her. He looks across at his father. Sirius points at Harry's heart. Once again, Harry's gaze lights upon his mother. Harry unclenches his fist. The Resurrection Stone falls gently onto the forest floor. Voldemort stands in a clearing in the forest. Voldemort opens his eyes and glares at the gaunt-faced Death Eater. Bellatrix Lestrange walks up behind Voldemort, who takes a few paces forward. He turns around. Bellatrix lowers her head reverentially as he passes her, the Elder Wand clasped in his right hand. He stops and half turns his head. Bellatrix peers through the gloom and sees Harry coming into the clearing. Voldemort flexes his neck and looks back over his shoulder. He turns to face Harry. Hagrid sees him. Voldemort stares at the teenager who stands unwavering in front of him. Nagini slithers past Hagrid towards Voldemort, who steadies himself and raises his wand. Harry stands, unflinching. Harry closes his eyes. A stream of green light flashes from the Elder Wand and hits Harry full on. Bright white light. Harry comes to. He's clean-shaven, unbruised, and without his spectacles. He stands silhouetted against a completely white background. Behind him in the whiteness, there's a small bench. He walks over to it and bends down to peer underneath the bench. He recoils when he sees a tiny, skeletal, red, raw naked figure curled up in a fetal position. Dumbledore steps towards him. Dumbledore wears a silvery white robe in the vista of white. Harry looks around. He glances back at the fetal figure. They stroll along the platform and sit down on a bench. Dumbledore gets to his feet.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "He rotates and inspects behind him. He rotates back and raises up the golden snitch granted to him by Dumbledore. The inscription on it materializes. Harry examines it. He raises the golden snitch to his mouth and presses it to his lips. The outer shell opens. The inner shell pivots to form an aperture. Inside, a polished octagonal gem. On one facet, a circle is etched inside a triangle, down the center of which is a line. The gem levitates out of the snitch. Harry places the palm of his right hand beneath the levitating gem. He cautiously grips his fist around it. His eyes are shut. Harry slowly opens them and gazes forward. Ahead of him stand his parents, with Sirius and Remus. Lily extends her hand. Harry goes to seize it, but his hand passes directly through hers. They look at each other. Lily lowers her hand. Lily smiles. Harry turns to Sirius and takes a few strides forward. Harry nods at his father, James. Harry rotates and gazes at his mother, then advances towards her. He looks across at his father. Sirius indicates at Harry's heart. Once more, Harry's gaze rests upon his mother. Harry unclenches his fist. The Resurrection Stone descends softly onto the woodland ground. Voldemort stands in a glade in the woodland. Voldemort opens his eyes and glares at the hollow-faced Death Eater. Bellatrix Lestrange strides up behind Voldemort, who takes a few strides forward. He rotates around. Bellatrix lowers her head respectfully as he passes her, the Elder Wand gripped in his right hand. He halts and half rotates his head. Bellatrix peers through the murk and perceives Harry approaching the glade. Voldemort flexes his neck and gazes back over his shoulder. He rotates to confront Harry. Hagrid perceives him. Voldemort stares at the youth who stands resolute in front of him. Nagini glides past Hagrid towards Voldemort, who steadies himself and elevates his wand. Harry stands, unwavering. Harry shuts his eyes. A stream of emerald illumination flashes from the Elder Wand and strikes Harry full on. Brilliant white illumination. Harry regains consciousness. He's clean-shaven, unbruised, and without his spectacles. He stands silhouetted against a completely white backdrop. Behind him in the whiteness, there's a small bench. He strolls over to it and bends down to peer beneath the bench. He recoils when he perceives a tiny, skeletal, red, raw nude form curled up in a fetal posture. Dumbledore steps towards him. Dumbledore wears a silvery white robe in the panorama of white. Harry looks around. He glances back at the fetal form. They walk along the platform and sit down on a bench. Dumbledore gets to his feet."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "He turns and checks behind him. The golden snitch, bequeathed to him by Dumbledore, is turned back to and lifted up by him. The writing on it appears. It is studied by Harry. The golden snitch is lifted to his mouth and pressed to his lips by him. The outer casing is opened. The inner casing revolves to create an opening. Inside, there is a polished octagonal stone. On one surface, a circle is inscribed inside a triangle, down the middle of which is a line. The stone floats out of the snitch. The palm of his right hand is placed under the floating stone by Harry. It is carefully clenched around by him. His eyes are closed. They are slowly opened by Harry, and he stares ahead. In front of him, his parents stand, with Sirius and Remus. Her hand is stretched out by Lily. Harry goes to take it, but his hand passes right through hers. Each other is gazed at by them. Her hand is lowered by Lily. She smiles. Sirius is turned to by Harry, and a few paces forward are taken. His father, James, is nodded at by Harry. His mother is gazed at by Harry as he turns, then she is moved towards by him. Across, he looks at his father. Harry's heart is pointed at by Sirius. Once again, his mother is gazed at by Harry. His fist is unclenched by him. Onto the forest floor, the Resurrection Stone is gently fallen by Harry. In a clearing in the forest stands Voldemort. His eyes are opened by Voldemort, and the gaunt-faced Death Eater is glared at. Behind Voldemort walks Bellatrix Lestrange, who is taken a few paces forward by him. Around, he is turned by him. Her head is lowered reverentially by Bellatrix as she is passed by him, the Elder Wand clasped in his right hand. He stops and his head is half turned. Through the gloom peers Bellatrix and sees Harry coming into the clearing. His neck is flexed by Voldemort and his shoulder is looked back over. Harry is turned to face by him. He is seen by Hagrid. The teenager, who stands unwavering in front of him, is stared at by Voldemort. Past Hagrid, Nagini slithers towards Voldemort, who steadies himself and raises his wand. Harry remains unflinching. His eyes are closed by him. From the Elder Wand, a stream of green light flashes and Harry is hit full on. Bright white light. Harry comes to. He is clean-shaven, unbruised, and without his spectacles. A completely white background silhouettes him. There's a small bench behind him in the whiteness. It is walked over to and bent down to peer underneath by him. He recoils when a tiny, skeletal, red, raw naked figure curled up in a fetal position is seen by him. Towards him steps Dumbledore. A silvery white robe is worn by Dumbledore in the vista of white. Around, Harry looks. The fetal figure is glanced back at by him. They stroll along the platform and sit down on a bench. To his feet gets Dumbledore."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "He checks behind him, then lifts the golden snitch given by Dumbledore. The writing appears, and Harry studies it. He presses the snitch to his lips, opening it to reveal a polished octagonal stone with a circle inscribed inside a triangle and line. The stone floats out, and Harry places his palm under it, clenching his fist around it. With closed eyes, he opens them to see his parents, Sirius, and Remus. Lily extends her hand, but Harry's attempt to take it fails as it passes through. They gaze at each other, and Lily smiles. Harry approaches Sirius and nods at James, his father, while Sirius points at Harry's heart. Harry unclenches his fist, dropping the Resurrection Stone onto the forest floor. Voldemort stands in a forest clearing, glaring at a Death Eater. Bellatrix Lestrange approaches, reverently lowering her head as Voldemort passes, holding the Elder Wand. Bellatrix sees Harry entering the clearing, and Voldemort faces him. Hagrid notices Harry standing bravely as Nagini slithers by. Voldemort raises his wand, and a green light from the Elder Wand hits Harry. A bright white light flashes, and Harry comes to, unblemished and without spectacles. In a white background, he stands by a bench, peering underneath to see a tiny, skeletal figure curled up. Dumbledore, in a silvery white robe, steps toward Harry. They stroll along a platform and sit on a bench before Dumbledore stands up."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "He checks behind him, then lifts the golden snitch from Dumbledore. Writing appears as Harry studies it, pressing it to his lips. The casing opens, revealing an octagonal stone inscribed with a circle in a triangle. The stone floats out. Harry's hand grasps it. With closed eyes, he opens them to see his parents, Sirius, and Remus. Harry reaches for Lily, but his hand passes through hers. They gaze at one another as she smiles. Harry nods at James and moves towards Lily. Sirius points at Harry's heart. Harry releases the Resurrection Stone onto the forest floor. \n\nVoldemort stands in the forest, glaring at a Death Eater. Bellatrix approaches as Voldemort advances with the Elder Wand. Spotting Harry, Bellatrix lowers her head. Voldemort faces Harry. Hagrid watches as Nagini slithers past. Voldemort raises his wand, and Harry stands resolute, closing his eyes. A green light from the wand hits Harry. In a white realm, Harry is clean-shaven and spectacle-free. He sees a skeletal, red figure under a bench. Dumbledore, in a silvery robe, approaches. They walk and sit together. Dumbledore stands."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "He swiftly turns his head to glance behind him, ensuring everything is as it should be. Reassured, he turns back and gently lifts the golden snitch, which had been bequeathed to him, a precious gift from Dumbledore himself. As he holds it, the mysterious writing on its surface gradually becomes visible. Harry studies the text intently, trying to understand its meaning. With great care, he brings the golden snitch closer, lifting it to his mouth before pressing it softly against his lips. This action triggers the mechanism; the outer casing opens smoothly, and the inner casing begins to rotate, revealing a small opening. Within this hidden compartment lies a polished, octagonal stone. Engraved onto one of its surfaces is a symbol of profound significance: a circle inscribed within a triangle, intersected by a straight line. The stone itself gracefully floats out from the snitch's confines. Slowly and with deliberate caution, Harry places the palm of his right hand beneath the floating, enchanted stone. He carefully closes his fist around it as he closes his eyes, a moment of contemplation. When Harry gently reopens them, his gaze is fixed forward. Standing before him are the familiar and comforting figures of his parents, accompanied by Sirius and Remus. Lily, with tenderness in her eyes, stretches out her hand towards him. Harry moves to take it, but his fingers pass through hers, revealing the ethereal nature of their connection. They share a poignant gaze. Lily then lowers her hand, offering him a reassuring smile. Harry turns his attention to Sirius, taking several steps forward in acknowledgment. He nods respectfully at his father, James, before once more turning his gaze to his beloved mother and stepping closer. He then looks over to his father again. Sirius gestures meaningfully towards Harry’s heart. Harry's gaze returns to his mother, filled with emotion. Slowly, he unclenches his fist, allowing the Resurrection Stone to fall gently onto the forest floor below. In the distance, Voldemort stands within a clearing in the dark and foreboding forest. He opens his eyes, casting a critical glare at the gaunt-faced Death Eater nearby. Bellatrix Lestrange approaches from behind, her demeanor reverent as she nears Voldemort, who strides forward a few paces before turning sharply. Bellatrix lowers her head in deep reverence as he passes, the infamous Elder Wand held firmly in his right hand. He halts, half-turning his head to peer through the gloom. Bellatrix peers into the dimness, catching sight of Harry as he makes his way into the clearing. Voldemort flexes his neck slightly, glancing back over his shoulder before facing Harry, who is now clearly visible. From a distance, Hagrid observes him, taking in the scene. Voldemort stares intently at the unwavering, young teenager standing resolute before him. Nagini, the serpent, slithers past Hagrid towards Voldemort, moving with a sinister grace as Voldemort steadies himself and raises his powerful wand. Despite the imminent danger, Harry stands steady and unflinching. Closing his eyes with determination, he prepares for what is to come. In an instant, a blinding stream of green light bursts forth from the Elder Wand, striking Harry directly. A brilliant flash of white light engulfs everything. \n\nWhen Harry regains consciousness, he finds himself in a curious state; he is clean-shaven, unbruised, and noticeably missing his spectacles. He stands silhouetted against an unbroken expanse of white, the background completely enveloping him in its starkness. Behind him, within the vast whiteness, he notices a small, unassuming bench. Intrigued, he walks over to it, leaning down to peer underneath. He recoils slightly upon discovering a tiny, skeletal figure, red and raw, curled up in a fetal position, a sight both unsettling and pitiful. At this moment, Dumbledore steps forward from the whiteness, adorned in a flowing silvery white robe that complements the tranquil vista. Harry looks around, absorbing his unusual surroundings. He casts a glance back at the pitiable fetal figure before they both begin to stroll together along what appears to be a platform. Eventually, they come to rest and sit down on a bench. After a while, Dumbledore rises to his feet, ready to guide Harry onwards."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "With quick and decisive movements, he swiftly swivels his head to glance back over his shoulder, ensuring that everything behind him remains just as it should be. Feeling reassured and at ease with what he sees, he turns back around. In a slow and deliberate gesture, he gently lifts the exquisite golden snitch before him, a treasured and significant artifact that had been bequeathed to him as a precious gift from Dumbledore himself. As he securely holds the snitch in his hand, he watches with focused attention as the mysterious writing etched upon its surface gradually comes into view. Harry scrutinizes the text with intense concentration, striving to decipher and comprehend its deeper meaning. Exercising the utmost care and precision, he brings the delicate golden snitch closer to himself, thoughtfully lifting it to his mouth before softly pressing it against his lips. This particular action activates the concealed mechanism within; the outer casing unfolds with fluidity and grace, while the inner casing begins to rotate, gradually revealing a small, hidden compartment. Nestled within this clandestine chamber lies a polished stone, exquisitely shaped in an octagonal form. Engraved upon one of its surfaces is a symbol rich with profound significance: a circle enclosed within a triangle, intersected by a single, straight line. The stone, with an almost ethereal quality, starts to float effortlessly out from the confines of the snitch. With slow and deliberate caution, Harry places his open palm of the right hand beneath the gently floating, enchanted stone. He closes his fist around it carefully, his eyes closing in a moment of intense contemplation. When Harry gradually reopens his eyes, his gaze remains fixed resolutely forward. Standing before him are the comforting and familiar figures of his parents, warmly accompanied by Sirius and Remus. Lily, with a tender and loving expression in her eyes, gently extends her hand towards him. Harry instinctively moves to grasp it, only for his fingers to pass through hers, revealing the ethereal and intangible nature of their connection. They share an intense and poignant gaze. Lily then gently lowers her hand, offering Harry a reassuring and warm smile. Harry then turns his attentive focus to Sirius, taking several deliberate steps forward in acknowledgment and respect. He nods respectfully at his father, James, before once again redirecting his gaze to his beloved mother and stepping closer to her. Finally, he glances over to his father again. Sirius makes a meaningful gesture towards Harry’s heart, prompting Harry to return his gaze to his mother, filled with deep emotion. Slowly and with great care, he unclenches his fist, allowing the Resurrection Stone to fall lightly and gently onto the forest floor below. Off in the distance, Voldemort stands menacingly within a clearing in the dark and imposing forest. He opens his eyes, directing a piercing and critical glare at the gaunt-featured Death Eater positioned nearby. Bellatrix Lestrange approaches from behind with a demeanour of deep reverence as she nears Voldemort, who strides forward a few paces important steps before sharply turning. Bellatrix lowers her head in a gesture of deep reverence as he passes, with the infamous Elder Wand held firmly and decisively in his right hand. He halts momentarily, half-turning his head to peer through the enveloping gloom of the forest. Bellatrix peers into the dimness as well, catching sight of Harry as he makes his way into the clearing. Voldemort flexes his neck slightly, casting a glance back over his shoulder before once again facing Harry, who is now clearly visible. From a distance, Hagrid observes him, taking in and absorbing the scene unfolding before him. Voldemort directs an intense and unwavering stare at the steadfast young teenager who stands resolute before him. Nagini, the sinister serpent, slithers past Hagrid, moving with a foreboding grace towards Voldemort, who steadies himself and confidently raises his powerful wand. Despite the immediate and imminent danger surrounding him, Harry stands firm, steady, and unflinching. Closing his eyes with determination and resolve, he readies himself for what is about to come. In an instant, a blinding, brilliant stream of green light bursts forth from the Elder Wand, striking Harry directly. A brilliant flash of white light engulfs everything around. \n\nWhen Harry eventually regains consciousness, he finds himself in a curious and surreal state; he is entirely clean-shaven, free of any bruises, and noticeably missing his usual spectacles. He stands silhouetted against an unbroken, endless expanse of white, the background completely enveloping and surrounding him in its starkness. Behind him, amidst the vast whiteness, he notices a small, unassuming bench. Intrigued and curious, he walks over to it, leaning down carefully to peer underneath. He recoils slightly, taken aback upon discovering a tiny, skeletal figure, raw and red, curled up tightly in a fetal position—a sight that is both unsettling and pitiful. At that very moment, Dumbledore emerges gently forward from the whiteness, adorned in a flowing, silvery white robe that beautifully complements the tranquil and serene vista around them. Harry takes a moment to look around, absorbing and taking in his unusual and unfamiliar surroundings. He casts a glance back at the pitiable fetal figure before they both begin to stroll together along what appears to be a platform. Eventually, at a certain point, they come to rest and sit down on a bench. After spending some time in quiet reflection, Dumbledore rises to his feet, ready and prepared to guide Harry onwards towards what awaits."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "He turns cautiously and checks behind him, scanning the area to ensure that he is alone or perhaps simply out of instinctive vigilance. Satisfied, he turns back, feeling a sense of purpose as he lifts up the golden snitch, which had been bequeathed to him by Dumbledore. As his eyes focus intently on its surface, the writing on the snitch becomes visible, prompting Harry to study the message with a deep concentration. He then lifts the golden snitch to his mouth, bringing it close to his lips and presses it gently against them. The outer casing of the snitch opens in response to the contact, revealing an inner casing that begins to revolve methodically, creating an opening. Inside this opening lies a polished octagonal stone, on which Harry notices an inscription—a circle inside a triangle with a line running down the middle. Mesmerized, Harry watches as the stone floats out of the snitch, defying gravity. He instinctively places the palm of his right hand under the floating stone, offering it a resting place. With great care, he clenches his fist around it, feeling its weight and texture, while his eyes close, perhaps in reflection or preparation for what he knows is to come. Slowly, deliberately, he opens his eyes and stares ahead with clear intent. Before him stand the familiar, dearly missed figures of his parents, joined by Sirius and Remus, their presence ethereal yet comforting. Lily reaches out a hand towards him, a gesture filled with warmth and longing. Harry moves to take her hand, but his own passes through hers, a poignant reminder of the divide between their worlds. They gaze at each other in silent understanding, and Lily eventually lowers her hand, offering him a gentle, reassuring smile that speaks volumes. Harry turns his attention to Sirius, taking a few determined steps forward to acknowledge him. With a respectful nod, he greets his father, James, looking for a brief moment at the man he has always admired. Then, with a fondness that only a son can have for his mother, Harry turns to gaze at Lily once more, stepping towards her, holding her image in his heart. He looks across at his father, taking in the sight of his family. As Sirius points towards Harry's heart, the moment's significance deepens. Once again, Harry's eyes settle on his mother's comforting visage. With a resolution that feels right, he unclenches his fist, releasing the Resurrection Stone, which falls gently onto the forest floor. At that moment elsewhere, Voldemort stands amidst a clearing in the forest, seemingly poised and plotting. He opens his eyes, glaring with malice at the gaunt-faced Death Eater who stands nearby. Bellatrix Lestrange approaches from behind with reverence, as Voldemort takes a few paces forward, exuding authority. Turning around with a deliberate motion, he passes Bellatrix, who lowers her head reverentially, acknowledging the power he wields with the Elder Wand clasped in his authoritative right hand. He pauses and half turns his head, assessing the situation as Bellatrix peers through the forest's gloom and catches sight of Harry emerging into the clearing. Voldemort flexes his neck, maintaining his composure, and looks back over his shoulder with a calculating gaze before turning to face the young man who dares to stand before him. Hagrid, too, sees Harry, the boy he has watched over for so long. Voldemort stares at the teenager who stands unwavering, showing neither fear nor hesitation. As Nagini slithers past Hagrid towards Voldemort, who looks to steady himself, he raises his wand in preparation for the inevitable confrontation. Harry remains unflinching, a testament to his courage and resolve. He closes his eyes, perhaps in acceptance or defiance, as a stream of green light erupts from the Elder Wand, striking him fully. In an instant, everything is consumed by a bright white light. When Harry comes to, he finds himself remarkably unscathed, clean-shaven, and without the burden of his spectacles, as he stands silhouetted against a backdrop of complete and overwhelming whiteness. Behind him, amidst this vast emptiness, he notices a small bench, an incongruous object in the sea of white. Curiosity piqued, he walks over to it and bends down, peering underneath with cautious interest. He recoils suddenly, as his eyes register a tiny, skeletal, red, raw naked figure curled defensively in a fetal position, the sight unsettling and mysterious. It is then that Dumbledore steps forward, his presence a comforting familiarity in this surreal landscape, wearing a silvery white robe that blends seamlessly into the vista of white. Harry takes in his surroundings, glancing back at the fetal figure with a mix of intrigue and trepidation. Together, they stroll along what seems to be a platform, the environment surreal yet tangible, and they sit down on a bench, sharing a moment of calm amidst the uncertainty. After a while, Dumbledore rises to his feet, his actions deliberate and meaningful."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Harry checks behind him and then lifts the golden snitch given to him by Dumbledore, revealing writing that he studies. As he presses the snitch to his lips, it opens to reveal a polished octagonal stone inscribed with a symbol. The stone floats out, and Harry catches it in his palm, closing his eyes before opening them to see his parents, Sirius, and Remus. He reaches for his mother's hand but his hand passes through hers, leading to a shared understanding as she smiles. Harry acknowledges his father with a nod and moves towards his mother, exchanging meaningful glances with Sirius who gestures towards Harry's heart. Harry releases the Resurrection Stone, letting it fall to the forest floor.\n\nIn a forest clearing, Voldemort, holding the Elder Wand, eyes the gaunt-faced Death Eater before acknowledging Bellatrix Lestrange, who shows deference as he passes. Spotting Harry, Voldemort turns to face the unyielding teenager, while Nagini slithers past Hagrid towards them. Voldemort raises his wand, unleashing a flash of green light that hits Harry, who stands unflinching before closing his eyes.\n\nHarry awakens in a bright white space, appearing rejuvenated and without glasses. He explores the area, discovering a small bench under which lies a tiny, skeletal, red figure. Dumbledore approaches in a silvery robe, leading Harry to sit and talk on a bench before Dumbledore stands, signaling a transition."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "He turns and checks behind him, perhaps recalling his many encounters with danger in the Forbidden Forest of Hogwarts. He turns back and lifts up the golden snitch bequeathed to him by Dumbledore, the former headmaster known for his wisdom and eccentricity. The writing on it appears, coded instructions intended for the one who seeks the truth. Harry studies it, understanding its significance as a key to facing his destiny. He lifts the golden snitch to his mouth and presses it to his lips, the gesture activating its secret mechanism. The outer casing opens, a design perfected over centuries by magical craftsmen. The inner casing revolves to create an opening, revealing its hidden treasure. Inside, a polished octagonal stone known as the Resurrection Stone, one of the three fabled Deathly Hallows. On one surface, a circle is inscribed inside a triangle, down the middle of which is a line, the symbol of the Hallows that represents the quest for mastery over death. The stone floats out of the snitch, responding to the magic it holds. Harry places the palm of his right hand under the floating stone, aware of the immense power it offers. He carefully clenches his fist around it, invoking the presence of those who have passed. His eyes are closed, a moment of reunion and reflection. Harry slowly opens them and stares ahead. In front of him stand his parents, with Sirius and Remus, figures of love and guidance lost to him too soon. Lily stretches out her hand, her presence as vivid and comforting as ever. Harry goes to take it, but his hand passes right through hers, revealing the bittersweet nature of their meeting. They gaze at each other, unspoken words passing between them. Lily lowers her hand, acknowledging the boundary between life and death. Lily smiles, her expression full of pride and love. Harry turns to Sirius and takes a few paces forward, feeling the warmth of friendship and loyalty. Harry nods at his father, James, a silent communication of mutual respect and understanding. Harry turns and gazes at his mother, then moves towards her, drawing strength from her presence. He looks across at his father, the image of who he is and who he might become. Sirius points at Harry's heart, reminding him of the bravery and love that define him. Once again, Harry's gaze lights upon his mother, the bond between them unbroken by time or loss. Harry unclenches his fist, releasing the power he holds. The Resurrection Stone falls gently onto the forest floor, its purpose fulfilled, a testament to the choices made by those who seek peace rather than power. Voldemort stands in a clearing in the forest, a place of ancient magic and impending confrontation. Voldemort opens his eyes and glares at the gaunt-faced Death Eater, a loyal follower of his dark ambitions. Bellatrix Lestrange walks up behind Voldemort, who takes a few paces forward, exuding an air of menace and control. He turns around, his presence commanding fear and obedience. Bellatrix lowers her head reverentially as he passes her, the Elder Wand clasped in his right hand, a notorious artifact of immense destructive power. He stops and half turns his head, feeling the tension of the moment. Bellatrix peers through the gloom and sees Harry coming into the clearing, a lone figure facing overwhelming odds. Voldemort flexes his neck and looks back over his shoulder, sensing the gravity of the confrontation. He turns to face Harry, aware of the rivalry that has defined both their lives. Hagrid sees him, his heart heavy with concern and hope for the boy he has watched grow. Voldemort stares at the teenager who stands unwavering in front of him, an unexpected symbol of defiance and courage. Nagini, Voldemort's faithful serpent companion, slithers past Hagrid towards Voldemort, who steadies himself and raises his wand, ready for what might be the final battle. Harry stands, unflinching, his resolve unbroken by fear. Harry closes his eyes, accepting whatever fate has in store. A stream of green light flashes from the Elder Wand and hits Harry full on, a spell known as the Killing Curse, meant to end life instantly. Bright white light follows, an unexpected turn of events. Harry comes to, he's clean-shaven, unbruised, and without his spectacles, a transformation suggestive of rebirth. He stands silhouetted against a completely white background, a symbolic space representing transition. Behind him in the whiteness, there's a small bench, an ordinary object in an extraordinary place. He walks over to it and bends down to peer underneath the bench, curiosity piqued by the unknown. He recoils when he sees a tiny, skeletal, red, raw naked figure curled up in a fetal position, a disturbing vision of vulnerability and pain, the consequence of dark deeds. Dumbledore steps towards him, his presence reassuring and wise, the mentor he has always been. Dumbledore wears a silvery white robe in the vista of white, a figure of peace and guidance in this surreal place. Harry looks around, taking in the strange tranquility. He glances back at the fetal figure, a reminder of choices and their consequences. They stroll along the platform, a journey of reflection and understanding, and sit down on a bench, sharing a moment of clarity and reassurance. Dumbledore gets to his feet, ready to impart the final pieces of advice to his young protege."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "On one surface a circle is inscribed inside a triangle down the middle of which is a line He turns and checks behind him He turns back and lifts up the golden snitch bequeathed to him by Dumbledore The writing on it appears Harry studies it Dumbledore steps towards him He lifts the golden snitch to his mouth and presses it to his lips The outer casing opens The inner casing revolves to create an opening Inside a polished octagonal stone On one surface a circle is inscribed inside a triangle down the middle of which is a line He stands silhouetted against a completely white background The stone floats out of the snitch Lily lowers her hand Hagrid sees him The writing on it appears Harry places the palm of his right hand under the floating stone Harry slowly opens them and stares ahead He carefully clenches his fist around it The outer casing opens His eyes are closed Harry slowly opens them and stares ahead In front of him stand his parents with Sirius and Remus Lily stretches out her hand Harry goes to take it but his hand passes right through hers They gaze at each other The inner casing revolves to create an opening Inside a polished octagonal stone Lily lowers her hand Lily smiles Harry turns to Sirius and takes a few paces forward Harry nods at his father James Harry turns and gazes at his mother then moves towards her He looks across at his father Sirius points at Harry's heart Bright white light Once again Harry's gaze lights upon his mother Harry unclenches his fist In front of him stand his parents with Sirius and Remus Lily smiles The Resurrection Stone falls gently onto the forest floor Voldemort stands in a clearing in the forest Voldemort opens his eyes and glares at the gauntfaced Death Eater Bellatrix Lestrange walks up behind Voldemort who takes a few paces forward He turns around Bellatrix lowers her head reverentially as he passes her the Elder Wand clasped in his right hand Harry looks around He stops and half turns his head Bellatrix peers through the gloom and sees Harry coming into the clearing Voldemort flexes his neck and looks back over his shoulder Harry comes to The Resurrection Stone falls gently onto the forest floor He turns to face Harry He glances back at the fetal figure Hagrid sees him Bellatrix peers through the gloom and sees Harry coming into the clearing Voldemort stares at the teenager who stands unwavering in front of him Nagini slithers past Hagrid towards Voldemort who steadies himself and raises his wand Voldemort stands in a clearing in the forest Harry stands unflinching The stone floats out of the snitch Harry closes his eyes Harry goes to take it but his hand passes right through hers the Elder Wand clasped in his right hand A stream of green light flashes from the Elder Wand and hits Harry full on Bright white light Harry comes to He is cleanshaven unbruised and without his spectacles He stands silhouetted against a completely white background He turns back and lifts up the golden snitch bequeathed to him by Dumbledore Behind him in the whiteness there is a small bench He walks over to it and bends down to peer underneath the bench Voldemort opens his eyes and glares at the gauntfaced Death Eater Behind him in the whiteness there is a small bench Dumbledore gets to his feet Lily stretches out her hand He recoils when he sees a tiny skeletal red raw naked figure curled up in a fetal position Dumbledore steps towards him Dumbledore wears a silvery white robe in the vista of white Harry unclenches his fist Harry looks around He recoils when he sees a tiny skeletal red raw naked figure curled up in a fetal position He glances back at the fetal figure Harry stands unflinching They stroll along the platform and sit down on a bench Dumbledore gets to his feet"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "He turns and checks behind him. He turns back and lifts up the golden snitch bequeathed to him by Dumbledore. The writing on it appears. Harry studies it. He lifts the golden snitch to his mouth and presses it to his lips. The outer casing opens. The inner casing revolves to create an opening Inside a polished octagonal stone. On one surface a circle is inscribed inside a triangle down the middle of which is a line. The stone floats out of the snitch. Harry places the palm of his right hand under the floating stone. He carefully clenches his fist around it. His eyes are closed. Harry slowly opens them and stares ahead. In front of him stand his parents with Sirius and Remus. Lily stretches out her hand. Harry goes to take it but his hand passes right through hers. They gaze at each other. Lily lowers her hand. Lily smiles. Harry turns to Sirius and takes a few paces forward. Harry nods at his father James. Harry turns and gazes at his mother then moves towards her. He looks across at his father. Sirius points at Harry's heart. Once again Harry's gaze lights upon his mother. Harry unclenches his fist. The Resurrection Stone falls gently onto the forest floor. Voldemort stands in a clearing in the forest. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Voldemort opens his eyes and glares at the gauntfaced Death Eater. Bellatrix Lestrange walks up behind Voldemort who takes a few paces forward. He turns around. Bellatrix lowers her head reverentially as he passes her. the Elder Wand clasped in his right hand. He stops and half turns his head. Bellatrix peers through the gloom and sees Harry coming into the clearing. Voldemort flexes his neck and looks back over his shoulder. He turns to face Harry. Hagrid sees him. Voldemort stares at the teenager who stands unwavering in front of him. Nagini slithers past Hagrid towards Voldemort who steadies himself and raises his wand. Harry stands unflinching. Harry closes his eyes. A stream of green light flashes from the Elder Wand and hits Harry full on. Bright white light. Harry comes to. He is cleanshaven unbruised and without his spectacles. He stands silhouetted against a completely white background. Behind him in the whiteness there is a small bench. He walks over to it and bends down to peer underneath the bench. He recoils when he sees a tiny skeletal red raw naked figure curled up in a fetal position. Dumbledore steps towards him. Dumbledore wears a silvery white robe. in the vista of white. Harry looks around. He glances back at the fetal figure. They stroll along the platform and sit down on a bench. Dumbledore gets to his feet."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "He turns and checks behind him. He turns back and lifts up the golden snitch bequeathed to him by Dumbledore. The writing on it appears. Harry studies it. He lifts the golden snitch to his mouth and presses it to his lips. The outer casing opens. The inner casing revolves to create an opening Inside a polished octagonal stone. On one surface a circle is inscribed inside a triangle down the middle of which is a line. The stone floats out of the snitch. Harry places the palm of his right hand under the floating stone. He carefully clenches his fist around it. His eyes are closed. Harry slowly opens them and stares ahead. In front of him stand his parents with Sirius and Remus. Lily stretches out her hand. Harry goes to take it but his hand passes right through hers. They gaze at each other. Lily lowers her hand. Lily smiles. Harry turns to Sirius and takes a few paces forward. Harry nods at his father James. Harry turns and gazes at his mother then moves towards her. He looks across at his father. Sirius points at Harry's heart. Once again Harry's gaze lights upon his mother. Harry unclenches his fist. The Resurrection Stone falls gently onto the forest floor. Voldemort stands in a clearing in the forest. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. Voldemort opens his eyes and glares at the gauntfaced Death Eater. Bellatrix Lestrange walks up behind Voldemort who takes a few paces forward. He turns around. Bellatrix lowers her head reverentially as he passes her. the Elder Wand clasped in his right hand. He stops and half turns his head. Bellatrix peers through the gloom and sees Harry coming into the clearing. Voldemort flexes his neck and looks back over his shoulder. He turns to face Harry. Hagrid sees him. Voldemort stares at the teenager who stands unwavering in front of him. Nagini slithers past Hagrid towards Voldemort who steadies himself and raises his wand. Harry stands unflinching. Harry closes his eyes. A stream of green light flashes from the Elder Wand and hits Harry full on. Bright white light. Harry comes to. He is cleanshaven unbruised and without his spectacles. He stands silhouetted against a completely white background. Behind him in the whiteness there is a small bench. He walks over to it and bends down to peer underneath the bench. He recoils when he sees a tiny skeletal red raw naked figure curled up in a fetal position. Dumbledore steps towards him. Dumbledore wears a silvery white robe. in the vista of white. Harry looks around. He glances back at the fetal figure. They stroll along the platform and sit down on a bench. Dumbledore gets to his feet."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "He turns and checks behind him. He turns back and lifts up the golden snitch bequeathed to him by Dumbledore. The writing on it appears. Harry studies it. He lifts the golden snitch to his mouth and presses it to his lips. The outer casing opens. The inner casing revolves to create an opening Inside a polished octagonal stone. On one surface a circle is inscribed inside a triangle down the middle of which is a line. The stone floats out of the snitch. Harry places the palm of his right hand under the floating stone. He carefully clenches his fist around it. His eyes are closed. Harry slowly opens them and stares ahead. In front of him stand his parents with Sirius and Remus. A stream of green light flashes from the Elder Wand and hits Harry full on. Bright white light. Harry comes to. He is cleanshaven unbruised and without his spectacles. He stands silhouetted against a completely white background. Behind him in the whiteness there is a small bench. He walks over to it and bends down to peer underneath the bench. He recoils when he sees a tiny skeletal red raw naked figure curled up in a fetal position. Dumbledore steps towards him. Dumbledore wears a silvery white robe. in the vista of white. Harry looks around. He glances back at the fetal figure. They stroll along the platform and sit down on a bench. Dumbledore gets to his feet."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "He turns and checks behind him. He turns back and lifts up the golden snitch bequeathed to him by Dumbledore. The writing on it appears. Harry studies it. He lifts the golden snitch to his mouth and presses it to his lips. The outer casing opens. Dumbledore wears a silvery white robe. in the vista of white. Harry looks around. He glances back at the fetal figure. They stroll along the platform and sit down on a bench. Dumbledore gets to his feet."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The owl turns and checks behind it. The owl turns back and lifts up the golden snitch bequeathed to it by the dragon. The writing on it appears. The squirrel studies it. The owl lifts the golden snitch to its mouth and presses it to its beak. The outer casing opens. The inner casing revolves to create an opening. Inside, a polished octagonal stone. On one surface, a circle is inscribed inside a triangle, down the middle of which is a line. The stone floats out of the snitch. The cat places the palm of its right paw under the floating stone. The cat carefully clenches its paw around it. Its eyes are closed. The cat slowly opens them and stares ahead. In front of it stand its parents, with the lion and the wolf. The elephant stretches out its trunk. The cat goes to take it, but its paw passes right through the trunk. They gaze at each other. The elephant lowers its trunk. The elephant smiles. The cat turns to the lion and takes a few paces forward. The cat nods at its father, the tiger. The cat turns and gazes at its mother, then moves towards her. It looks across at its father. The lion points at the cat's heart. Once again, the cat's gaze lights upon its mother. The cat unclenches its paw. The Resurrection Stone falls gently onto the forest floor. The unicorn stands in a clearing in the forest. The unicorn opens its eyes and glares at the gaunt-faced Death Eater. The phoenix walks up behind the unicorn, who takes a few paces forward. It turns around. The phoenix lowers its head reverentially as it passes the unicorn, the Elder Wand clasped in its right wing. It stops and half turns its head. The phoenix peers through the gloom and sees the cat coming into the clearing. The unicorn flexes its neck and looks back over its shoulder. It turns to face the cat. The dog sees it. The unicorn stares at the teenager who stands unwavering in front of it. The snake slithers past the dog towards the unicorn, who steadies itself and raises its wand. The cat stands, unflinching. The cat closes its eyes. A stream of green light flashes from the Elder Wand and hits the cat full on. Bright white light. The cat comes to. It's clean-shaven, unbruised, and without its spectacles. It stands silhouetted against a completely white background. Behind it in the whiteness, there's a small bench. It walks over to it and bends down to peer underneath the bench. It recoils when it sees a tiny, skeletal, red, raw naked figure curled up in a fetal position. The eagle steps towards it. The eagle wears a silvery white robe in the vista of white. The cat looks around. It glances back at the fetal figure. They stroll along the platform and sit down on a bench. The eagle gets to its feet."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "He turns and checks behind him. He turns back and lifts up the silver pocket watch bequeathed to him by Dumbledore. The writing on it appears. Harry studies it. He lifts the pocket watch to his mouth and presses it to his lips. The outer casing opens. The inner casing revolves to create an opening. Inside, a polished triangular crystal. On one surface, a square is inscribed inside a pentagon, down the middle of which is a line. The crystal floats out of the pocket watch. Harry places the palm of his right hand under the floating crystal. He carefully clenches his fist around it. His eyes are closed. Harry slowly opens them and stares ahead. In front of him stand his parents, with Sirius and Remus. Lily stretches out her hand. Harry goes to take it, but his hand passes right through hers. They gaze at each other. Lily lowers her hand. Lily smiles. Harry turns to Sirius and takes a few paces forward. Harry nods at his father, James. Harry turns and gazes at his mother, then moves towards her. He looks across at his father. Sirius points at Harry's heart. Once again, Harry's gaze lights upon his mother. Harry unclenches his fist. The Memory Crystal falls gently onto the garden path. Voldemort stands in a clearing in the meadow. Voldemort opens his eyes and glares at the haggard-faced Death Eater. Bellatrix Lestrange walks up behind Voldemort, who takes a few paces forward. He turns around. Bellatrix lowers her head reverentially as he passes her, the Ancient Staff clasped in his right hand. He stops and half turns his head. Bellatrix peers through the fog and sees Harry coming into the clearing. Voldemort flexes his neck and looks back over his shoulder. He turns to face Harry. Hagrid sees him. Voldemort stares at the teenager who stands unwavering in front of him. Nagini slithers past Hagrid towards Voldemort, who steadies himself and raises his staff. Harry stands, unflinching. Harry closes his eyes. A stream of blue light flashes from the Ancient Staff and hits Harry full on. Bright white light. Harry comes to. He's clean-shaven, unbruised, and without his spectacles. He stands silhouetted against a completely white background. Behind him in the whiteness, there's a small table. He walks over to it and bends down to peer underneath the table. He recoils when he sees a tiny, skeletal, green, raw naked figure curled up in a fetal position. Dumbledore steps towards him. Dumbledore wears a silvery white robe in the vista of white. Harry looks around. He glances back at the fetal figure. They stroll along the walkway and sit down on a table. Dumbledore gets to his feet."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "He spins and glances behind him. He spins back and holds up the golden snitch given to him by Dumbledore. The writing on it emerges. Harry examines it. He raises the golden snitch to his mouth and touches it to his lips. The outer casing splits. The inner casing rotates to form an opening. Inside, a gleaming octagonal stone. On one surface, a circle is etched inside a triangle, down the middle of which is a line. The stone hovers out of the snitch. Harry places the palm of his right hand beneath the hovering stone. He gingerly grips it with his fist. His eyes are shut. Harry gradually opens them and looks forward. In front of him stand his parents, with Sirius and Remus. Lily reaches out her hand. Harry attempts to grasp it, but his hand slides right through hers. They look at each other. Lily withdraws her hand. Lily grins. Harry turns to Sirius and takes a few steps forward. Harry acknowledges his father, James, with a nod. Harry turns and gazes at his mother, then advances towards her. He glances across at his father. Sirius gestures at Harry's heart. Once again, Harry's gaze falls upon his mother. Harry releases his grip. The Resurrection Stone drops softly onto the forest floor. Voldemort waits in a clearing in the forest. Voldemort opens his eyes and scowls at the gaunt-faced Death Eater. Bellatrix Lestrange approaches from behind Voldemort, who takes a few steps forward. He pivots around. Bellatrix bows her head respectfully as he moves past her, the Elder Wand held in his right hand. He pauses and slightly turns his head. Bellatrix peers through the shadows and spots Harry entering the clearing. Voldemort twists his neck and glances over his shoulder. He rotates to confront Harry. Hagrid notices him. Voldemort gazes at the teenager who remains steadfast in front of him. Nagini slides past Hagrid towards Voldemort, who braces himself and elevates his wand. Harry remains, unyielding. Harry shuts his eyes. A surge of green light bursts from the Elder Wand and strikes Harry directly. Brilliant white light. Harry awakens. He's clean-shaven, unblemished, and without his glasses. He stands silhouetted against an entirely white background. Behind him in the whiteness, there's a small bench. He strides over to it and crouches down to gaze beneath the bench. He flinches when he sees a tiny, skeletal, red, raw naked figure curled up in a fetal position. Dumbledore approaches him. Dumbledore wears a silvery white robe in the vista of white. Harry surveys the surroundings. He glances back at the fetal figure. They meander along the platform and settle down on a bench. Dumbledore rises to his feet."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "The bookshelf swivels and verifies under it. The bookshelf swivels forward and elevates the silver guitar bestowed to it by Spider-Man. The diagram on it unfolds. George examines it. He elevates the silver guitar to its ear and presses it to its cheek. The exterior wrapper unveils. The interior wrapper pivots to fashion an aperture. Within, a gleaming hexagonal book. On one side, a square is etched inside a circle, through the center of which is a spiral. The book drifts out of the guitar. George places the sole of its left foot beneath the drifting book. It gently grips its toe around it. Its fingers are open. George gradually opens them and glances forward. Adjacent to it stand its siblings, with Gandalf and Frodo. Martha extends out her shoe. George reaches to grasp it, but its toe passes right through hers. They look at each other. Martha withdraws her shoe. Martha grins. George swivels to Gandalf and takes a few steps forward. George nods at its brother, Steve. George swivels and glances at its sister, then shifts towards her. It peers over at its brother. Gandalf gestures at George's shoulder. Once again, George's glance focuses on its sister. George ungrips its toe. The Restoration Book gently descends onto the beach sand. Thanos stands in a meadow in the beach. Thanos shuts its eyes and scowls at the cheerful-faced Wizard. Hermione Granger strolls up behind Thanos, who takes a few steps forward. It swivels around. Hermione bows her head respectfully as it strolls past her, the Master Sword grasped in its left toe. It pauses and partially turns its shoulder. Hermione peers through the haze and spots George entering the meadow. Thanos stretches its toe and gazes over its elbow. It swivels to face George. Gandalf notices it. Thanos observes the child who stands immovably ahead of it. Smaug slithers past Gandalf towards Thanos, who steadies itself and raises its sword. George stands, unyielding. George shuts its eyes. A stream of blue light beams from the Master Sword and strikes George fully. Dazzling white light. George awakens. It's clean-limbed, unscathed, and without its monocle. It stands silhouetted against an entirely white landscape. Above it in the whiteness, there's a large lamp. It trots over to it and crouches to peek beneath the lamp. It recoils when it sees a gigantic, fleshed-out, blue, raw clothed statue coiled in a standing stance. Spider-Man paces towards it. Spider-Man dons a golden black hat in the landscape of black. George scans around. It glimpses back at the standing statue. They stroll along the bridge and rest down on a couch. Spider-Man rises to its knees."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "The owl twirls and examines beneath it. The owl twirls forward and lifts up the ancient compass bestowed to it by Gandalf. The symbols on it emerge. Frodo analyzes it. He elevates the ancient compass to his ear and presses it to his cheek. The outer casing retracts. The inner casing rotates to reveal an entrance. Inside, a gleaming hexagonal gem. On one plane, a square is etched inside a circle, through which is a curve. The gem ascends out of the compass. Frodo places the tip of his left finger above the ascending gem. He cautiously uncurls his palm around it. His eyes are shielded. Frodo gently opens them and peers forward. Ahead of him stand his mentors, with Legolas and Gimli. Galadriel extends her wrist. Frodo attempts to grasp it, but his fingers glide right through hers. They watch each other. Galadriel withdraws her wrist. Galadriel grins. Frodo pivots to Legolas and takes a step backward. Frodo winks at his mentor, Gandalf. Frodo pivots and gazes at his mentor, then shifts away from her. He glances over at his mentor. Legolas gestures at Frodo's foot. Once more, Frodo's stare settles upon his mentor. Frodo releases his palm. The Enchantment Gem hovers softly onto the meadow floor. Saruman sits in a glade by the meadow. Saruman blinks his eyes and scowls at the pale-faced Orc. Arwen approaches behind Saruman, who steps a few strides backward. He pivots around. Arwen raises her gaze respectfully as he passes her, the Mystic Staff gripped in his left hand. He halts and partially twists his neck. Arwen squints through the mist and spots Frodo entering the glade. Saruman stretches his arm and looks back over his elbow. He shifts to face Frodo. Aragorn notices him. Saruman glances at the young adult who stands resolute in front of him. Shadowfax trots past Aragorn towards Saruman, who steadies himself and lowers his staff. Frodo stands, unwavering. Frodo opens his eyes. A stream of blue light beams from the Mystic Staff and envelops Frodo completely. Radiant silver light. Frodo revives. He's unscathed, polished, and without his goggles. He stands silhouetted against a completely silver background. Beside him in the silverness, there's a narrow stool. He moves over to it and leans down to inspect beneath the stool. He steps back when he sees a tiny, skeletal, blue, raw naked creature curled up in a fetal position. Gandalf strides towards him. Gandalf wears a shimmery blue robe in the panorama of silver. Frodo scans around. He glances back at the fetal creature. They meander along the corridor and recline on a stool. Gandalf rises to his toes."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "He pivots and verifies behind him. He pivots back and hoists up the silver spoon conferred to him by Gandalf. The inscription on it emerges. Harry examines it. He hoists the silver spoon to his ear and taps it against his cheek. The outer layer unseals. The inner layer twirls to form an aperture. Inside, a sparkling hexagonal crystal. On one face, a square is etched inside a rectangle, through the center of which is a curve. The crystal levitates out of the spoon. Harry places the back of his left hand under the levitating crystal. He gently unclenches his fingers around it. His eyes are shut. Harry slowly opens them and gazes ahead. In front of him stand his relatives, with Gandalf and Frodo. Lily reaches out her foot. Harry tries to catch it, but his hand passes right through hers. They look at each other. Lily withdraws her foot. Lily beams. Harry turns to Gandalf and takes a few steps sideways. Harry winks at his uncle, James. Harry turns and stares at his cousin, then approaches her. He glances over at his uncle. Gandalf gestures at Harry's shoulder. Once more, Harry's gaze settles upon his cousin. Harry releases his fingers. The Restorative Crystal lands gently onto the riverbank. Voldemort stands in a grove in the jungle. Voldemort closes his eyes and scowls at the rosy-cheeked Goblin. Bellatrix Lestrange steps up behind Voldemort, who takes a few steps backward. He spins around. Bellatrix raises her head disdainfully as he passes her, the Ancient Staff grasped in his left hand. He halts and half turns his shoulder. Bellatrix squints through the mist and spots Harry entering the grove. Voldemort rolls his shoulders and glances back over his head. He turns to confront Harry. Hagrid notices him. Voldemort looks at the adolescent who stands unyielding in front of him. Nagini slides past Hagrid towards Voldemort, who braces himself and lowers his staff. Harry stands, unwavering. Harry opens his eyes. A stream of blue light flickers from the Ancient Staff and surrounds Harry completely. Dazzling yellow light. Harry awakens. He's bearded, unscarred, and without his shoes. He stands silhouetted against a completely black backdrop. Beside him in the darkness, there's a large tree. He walks over to it and kneels to peer under the roots. He jumps back when he sees a tiny, skeletal, green, raw clothed creature curled up in a fetal position. Dumbledore moves towards him. Dumbledore dons a golden black cloak in the panorama of black. Harry gazes around. He glances back at the fetal creature. They wander along the track and sit down on a log. Dumbledore rises to his toes."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "The cat pivots and peeks beneath it. The cat spins back and hoists up the shimmering pebble gifted to it by Gandalf. The etchings on it emerge. The feline examines it. It raises the pebble to its ear and taps it against its cheek. The outer shell splits open. The inner casing rotates to form a gap. Inside, a gleaming hexagonal beetle. On one side, a square is carved inside a rectangle, down the center of which is a squiggle. The beetle drifts out of the pebble. The cat places the tip of its right paw beneath the levitating beetle. It cautiously wraps its claws around it. Its eyes are sealed shut. The feline gradually opens them and glances forward. Before it stand its siblings, with Frodo and Samwise. Nala extends her paw. The cat reaches to grasp it, but its paw slips through hers. They watch each other. Nala retracts her paw. Nala grins. The feline turns to Frodo and takes a few strides onward. It bows to its brother, Simba. The cat spins and gawks at its sister, then marches towards her. It peers across at its brother. Frodo gestures towards the cat's tail. Once more, its gaze settles upon its sister. The cat unfurls its paw. The Beetle of Life drops softly onto the jungle floor. Saruman stands in a meadow in the jungle. Saruman shuts his eyes and scowls at the sallow-faced Goblin. Bellatrix Lestrange sneaks up behind Saruman, who takes a few leaps onward. He spins around. Bellatrix bows her head devoutly as he glides past her, the Mystic Staff gripped in his left hand. He pauses and swivels his head slightly. Bellatrix squints through the haze and spots the feline entering the meadow. Saruman tilts his head and looks back over his elbow. He turns to confront the feline. Aragorn spots it. Saruman glowers at the kitten who stands unfalteringly before him. Smaug slinks past Aragorn towards Saruman, who braces himself and lowers his staff. The cat stands, unwavering. It shuts its eyes. A blaze of purple light bursts from the Mystic Staff and strikes the cat head-on. Dazzling orange light. The cat awakens. It's fluffy, untouched, and lacking its collar. It stands silhouetted against an entirely orange background. Behind it in the orange, there's a small table. It strolls over to it and crouches to peek beneath the table. It flinches when it notices a minuscule, bony, amber, raw featherless creature curled up in a fetal pose. Elrond strides towards it. Elrond wears a silky white garment in the scene of orange. The cat scans the area. It glances back at the featherless creature. They wander along the deck and settle on a table. Elrond rises to his toes."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Harry examines a golden snitch left to him by Dumbledore, revealing an octagonal stone with a symbol inscribed on it. Upon opening the snitch and holding the stone, Harry sees his parents, Sirius, and Remus appear before him. Although he tries to reach them, his hand passes through. After a poignant moment, Harry drops the Resurrection Stone to the ground. Voldemort stands in a forest clearing, holding the Elder Wand as Harry approaches, unfazed. As Voldemort casts a spell, Harry is hit by a green light. He awakens in a bright, white space, unharmed, and notices a small, frail figure under a bench. Dumbledore arrives, dressed in a silvery robe. Harry and Dumbledore walk along a platform and converse before Dumbledore stands to leave."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Dumbledore gets to his feet They stroll along the platform and sit down on a bench He glances back at the fetal figure Harry looks around in the vista of white Dumbledore wears a silvery white robe Dumbledore steps towards him He recoils when he sees a tiny skeletal red raw naked figure curled up in a fetal position He walks over to it and bends down to peer underneath the bench Behind him in the whiteness there is a small bench He stands silhouetted against a completely white background He is cleanshaven unbruised and without his spectacles Harry comes to Bright white light A stream of green light flashes from the Elder Wand and hits Harry full on Harry closes his eyes Harry stands unflinching Nagini slithers past Hagrid towards Voldemort who steadies himself and raises his wand Voldemort stares at the teenager who stands unwavering in front of him Hagrid sees him He turns to face Harry Voldemort flexes his neck and looks back over his shoulder Bellatrix peers through the gloom and sees Harry coming into the clearing He stops and half turns his head the Elder Wand clasped in his right hand Bellatrix lowers her head reverentially as he passes her He turns around Bellatrix Lestrange walks up behind Voldemort who takes a few paces forward Voldemort opens his eyes and glares at the gauntfaced Death Eater Voldemort stands in a clearing in the forest The Resurrection Stone falls gently onto the forest floor Harry unclenches his fist Once again Harry's gaze lights upon his mother Sirius points at Harry's heart He looks across at his father Harry turns and gazes at his mother then moves towards her Harry nods at his father James Harry turns to Sirius and takes a few paces forward Lily smiles Lily lowers her hand They gaze at each other Harry goes to take it but his hand passes right through hers Lily stretches out her hand In front of him stand his parents with Sirius and Remus Harry slowly opens them and stares ahead His eyes are closed He carefully clenches his fist around it Harry places the palm of his right hand under the floating stone The stone floats out of the snitch On one surface a circle is inscribed inside a triangle down the middle of which is a line The inner casing revolves to create an opening Inside a polished octagonal stone The outer casing opens He lifts the golden snitch to his mouth and presses it to his lips Harry studies it The writing on it appears He turns back and lifts up the golden snitch bequeathed to him by Dumbledore He turns and checks behind him"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "He turns to face Harry Sirius points at Harry's heart Dumbledore wears a silvery white robe His eyes are closed They gaze at each other Harry nods at his father James in the vista of white They stroll along the platform and sit down on a bench He stops and half turns his head Harry turns to Sirius and takes a few paces forward Harry places the palm of his right hand under the floating stone He is cleanshaven unbruised and without his spectacles Bellatrix lowers her head reverentially as he passes her Voldemort flexes his neck and looks back over his shoulder He turns around Harry closes his eyes Harry studies it Harry turns and gazes at his mother then moves towards her He walks over to it and bends down to peer underneath the bench He lifts the golden snitch to his mouth and presses it to his lips Bellatrix Lestrange walks up behind Voldemort who takes a few paces forward He carefully clenches his fist around it Voldemort stares at the teenager who stands unwavering in front of him He looks across at his father Nagini slithers past Hagrid towards Voldemort who steadies himself and raises his wand Once again Harry's gaze lights upon his mother He turns and checks behind him A stream of green light flashes from the Elder Wand and hits Harry full on Harry unclenches his fist He recoils when he sees a tiny skeletal red raw naked figure curled up in a fetal position Lily smiles Voldemort opens his eyes and glares at the gauntfaced Death Eater He stands silhouetted against a completely white background The Resurrection Stone falls gently onto the forest floor Harry slowly opens them and stares ahead Dumbledore gets to his feet the Elder Wand clasped in his right hand Dumbledore steps towards him In front of him stand his parents with Sirius and Remus Harry comes to He glances back at the fetal figure The writing on it appears Voldemort stands in a clearing in the forest Hagrid sees him The outer casing opens Bellatrix peers through the gloom and sees Harry coming into the clearing Bright white light The inner casing revolves to create an opening Inside a polished octagonal stone Harry looks around The stone floats out of the snitch Lily stretches out her hand Harry goes to take it but his hand passes right through hers Lily lowers her hand Behind him in the whiteness there is a small bench He turns back and lifts up the golden snitch bequeathed to him by Dumbledore On one surface a circle is inscribed inside a triangle down the middle of which is a line Harry stands unflinching"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Bellatrix Lestrange walks up behind Voldemort who takes a few paces forward He turns around Bellatrix lowers her head reverentially as he passes her the Elder Wand clasped in his right hand He stops and half turns his head Bellatrix peers through the gloom and sees Harry coming into the clearing Voldemort flexes his neck and looks back over his shoulder He turns to face Harry Hagrid sees him Voldemort stares at the teenager who stands unwavering in front of him Nagini slithers past Hagrid towards Voldemort who steadies himself and raises his wand Harry stands unflinching Harry closes his eyes A stream of green light flashes from the Elder Wand and hits Harry full on Bright white light Harry comes to He is cleanshaven unbruised and without his spectacles He stands silhouetted against a completely white background Behind him in the whiteness there is a small bench He walks over to it and bends down to peer underneath the bench He recoils when he sees a tiny skeletal red raw naked figure curled up in a fetal position Dumbledore steps towards him Dumbledore wears a silvery white robe in the vista of white Harry looks around He glances back at the fetal figure They stroll along the platform and sit down on a bench Dumbledore gets to his feet He turns and checks behind him He turns back and lifts up the golden snitch bequeathed to him by Dumbledore The writing on it appears Harry studies it He lifts the golden snitch to his mouth and presses it to his lips The outer casing opens The inner casing revolves to create an opening Inside a polished octagonal stone On one surface a circle is inscribed inside a triangle down the middle of which is a line The stone floats out of the snitch Harry places the palm of his right hand under the floating stone He carefully clenches his fist around it His eyes are closed Harry slowly opens them and stares ahead In front of him stand his parents with Sirius and Remus Lily stretches out her hand Harry goes to take it but his hand passes right through hers They gaze at each other Lily lowers her hand Lily smiles Harry turns to Sirius and takes a few paces forward Harry nods at his father James Harry turns and gazes at his mother then moves towards her He looks across at his father Sirius points at Harry's heart Once again Harry's gaze lights upon his mother Harry unclenches his fist The Resurrection Stone falls gently onto the forest floor Voldemort stands in a clearing in the forest Voldemort opens his eyes and glares at the gauntfaced Death Eater"
        }
      ]
    }
  ]
}