{
  "ground_truth": "A blast deflects onto the ceiling, bringing stone beams down onto the stair as Harry steadies himself with a Basilisk fang in hand. Voldemort spots Harry and fires, causing him to fall onto a lower staircase and drop the fang, which Voldemort destroys. Harry then disappears from Voldemort's sight as the Dark Lord dis-apparates. Nagini slithers across a landing, is hit by a stone, and turns to look over the edge of the stairs where Hermione stands alone and throws another stone as Nagini descends. The unconscious Neville comes to, sits up woozily, and is oblivious to the mayhem of battle around him, even as a burning body floats past. He turns his head and sees the Sword of Gryffindor on the ground behind him. Voldemort lands and takes aim as the walkway collapses, causing Harry to drop to the floor below. As Harry scrabbles away, strips of Voldemort's black cloak twist around his wrists and neck, restraining him, and Voldemort reins him in. Nagini advances on Hermione, who retreats with a basilisk fang in hand, while Ron also wielding a fang creeps up the stairs towards the snake, which turns on him, causing him to escape but drop the fang. The snake rears up between Ron and Hermione. In another part of the school, Bellatrix and Ginny are dueling until Molly takes Ginny's place. On a narrow platform, they exchange energy blasts with Bellatrix seemingly having the upper hand, but Molly advances wildly and strikes Bellatrix several times. The stunned Death Eater raises her hands in the air, and Molly wields her wand once more, causing Bellatrix to explode into tiny black fragments, after which Molly grins. On the walkway, Voldemort uses physical strength against Harry, slapping and kicking him as Harry scuttles backwards. High on the ramparts, Harry flings his arms around Voldemort's neck and jumps off the edge with him. They plummet from the heights, struggling for supremacy, clawing at each other and soaring above the school. Harry seems to split Voldemort's head in two, revealing only black smoke, and as they land in the courtyard, they roll away from each other across the cobbles, lying on the ground some distance apart. Energy spent, each crawls towards his wand, with Voldemort reaching the Elder Wand just before Harry reaches his. On their knees, they fire at each other, with a burst of green energy from the Elder Wand meeting a burst of red from Harry, resulting in a bright white ball of light. Inside, Nagini chases Hermione and Ron downstairs, and as they fall, Nagini raises her head with her mouth open.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Sure, here is the transformed text:\n\nA explosion deflects onto the roof, bringing rock beams down onto the steps as Harry steadies himself with a Basilisk tooth in hand. Voldemort spots Harry and fires, causing him to drop onto a lower staircase and drop the tooth, which Voldemort destroys. Harry then disappears from Voldemort's sight as the Dark Lord dis-apparates. Nagini slithers across a landing, is hit by a rock, and turns to look over the brink of the stairs where Hermione stands alone and throws another rock as Nagini descends. The unconscious Neville comes to, sits up woozily, and is oblivious to the chaos of battle around him, even as a burning form floats past. He turns his head and sees the Sword of Gryffindor on the terrain behind him. Voldemort lands and takes aim as the walkway collapses, causing Harry to drop to the floor below. As Harry scrabbles away, strips of Voldemort's black robe twist around his wrists and neck, restraining him, and Voldemort reins him in. Nagini advances on Hermione, who retreats with a basilisk tooth in hand, while Ron also wielding a tooth creeps up the steps towards the serpent, which turns on him, causing him to flee but drop the tooth. The serpent rears up between Ron and Hermione. In another section of the school, Bellatrix and Ginny are dueling until Molly takes Ginny's place. On a narrow platform, they exchange energy blasts with Bellatrix seemingly having the upper hand, but Molly advances wildly and strikes Bellatrix several times. The stunned Death Eater raises her hands in the air, and Molly wields her wand once more, causing Bellatrix to explode into tiny black fragments, after which Molly grins. On the walkway, Voldemort uses physical force against Harry, slapping and kicking him as Harry scuttles backwards. High on the ramparts, Harry flings his arms around Voldemort's neck and jumps off the brink with him. They plummet from the heights, struggling for dominance, clawing at each other and soaring above the school. Harry seems to split Voldemort's head in two, revealing only black smoke, and as they land in the courtyard, they roll away from each other across the cobbles, lying on the terrain some distance apart. Energy spent, each crawls towards his wand, with Voldemort reaching the Elder Wand just before Harry reaches his. On their knees, they fire at each other, with a burst of green energy from the Elder Wand meeting a burst of red from Harry, resulting in a bright white sphere of light. Inside, Nagini chases Hermione and Ron downstairs, and as they drop, Nagini raises her head with her mouth open."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "A blast is deflected onto the ceiling, bringing stone beams down onto the stair as Harry is steadied with a Basilisk fang in hand. Harry is spotted by Voldemort, who fires, causing him to fall onto a lower staircase and drop the fang, which is destroyed by Voldemort. Voldemort then loses sight of Harry as the Dark Lord dis-apparates. Nagini slithers across a landing, is hit by a stone, and turns to look over the edge of the stairs where Hermione stands alone and throws another stone as Nagini is descended upon. The unconscious Neville comes to, sits up woozily, and does not notice the mayhem of battle around him, even as a burning body floats past. His head is turned, and he sees the Sword of Gryffindor on the ground behind him. Voldemort lands and takes aim as the walkway collapses, causing Harry to be dropped to the floor below. As Harry is scrabbled away, strips of Voldemort's black cloak are twisted around his wrists and neck, restraining him, and Voldemort reins him in. Nagini advances on Hermione, who retreats with a basilisk fang in hand, while Ron also wielding a fang creeps up the stairs towards the snake, which is turned on by him, causing him to escape but drop the fang. Ron and Hermione are separated by the snake as it rears up. In another part of the school, a duel occurs between Bellatrix and Ginny until Ginny is replaced by Molly. On a narrow platform, energy blasts are exchanged with Bellatrix seemingly having the upper hand, but Molly advances wildly and strikes her several times. Her hands are raised in the air by the stunned Death Eater, and Molly wields her wand once more, causing Bellatrix to be exploded into tiny black fragments, after which Molly grins. On the walkway, Harry is attacked with physical strength by Voldemort, who slaps and kicks him as he is scuttled backwards. High on the ramparts, Voldemort's neck is flung around by Harry's arms, and they are jumped off the edge with him. They plummet from the heights, struggling for supremacy, clawing at each other, and soaring above the school. Voldemort's head seems to be split in two by Harry, revealing only black smoke, and as they land in the courtyard, they are rolled away from each other across the cobbles, lying on the ground some distance apart. Energy spent, they crawl towards their wands, with the Elder Wand being reached by Voldemort just before Harry reaches his. On their knees, each fires at the other, with a burst of green energy from the Elder Wand meeting a burst of red from Harry, resulting in a bright white ball of light. Inside, Hermione and Ron are chased by Nagini downstairs, and as they fall, her head is raised by Nagini with her mouth open."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "A blast deflects onto the ceiling, bringing stone beams down as Harry steadies himself with a Basilisk fang. Voldemort spots Harry, fires, causing him to fall and drop the fang, which Voldemort destroys. Harry vanishes as the Dark Lord dis-apparates. Nagini slithers across a landing, hit by a stone, and looks over the edge where Hermione stands alone, throwing another stone as Nagini descends. Neville regains consciousness, oblivious to the battle, and sees the Sword of Gryffindor behind him. Voldemort lands, aims, and the walkway collapses, causing Harry to fall. As Harry scrambles away, Voldemort's cloak restrains him. Nagini advances on Hermione, who retreats with a fang, while Ron, also with a fang, approaches the snake, which turns on him, causing him to drop the fang. The snake rears between Ron and Hermione. Elsewhere, Bellatrix and Ginny duel until Molly replaces Ginny. On a narrow platform, they exchange blasts, with Bellatrix seemingly dominant, but Molly strikes Bellatrix several times. The stunned Death Eater raises her hands, and Molly's wand causes Bellatrix to explode into fragments, after which Molly grins. On the walkway, Voldemort uses physical strength against Harry, slapping and kicking him. High on the ramparts, Harry grabs Voldemort's neck and jumps off with him. They plummet, struggling and clawing, soaring above the school. Harry seems to split Voldemort's head, revealing black smoke, and as they land in the courtyard, they roll apart. Exhausted, they crawl towards their wands, with Voldemort reaching the Elder Wand first. On their knees, they fire, with green energy from the Elder Wand meeting red from Harry, creating a bright white light. Inside, Nagini chases Hermione and Ron downstairs, and as they fall, Nagini raises her head."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "A blast deflects onto the ceiling, bringing stone beams down as Harry steadies himself with a Basilisk fang. Voldemort spots Harry, fires, causing him to fall and drop the fang, which Voldemort destroys. Harry disappears as Voldemort dis-apparates. Nagini slithers, is hit by a stone, and turns to see Hermione, who throws another stone. Neville awakens, oblivious to the battle, and sees the Sword of Gryffindor. Voldemort lands, causing Harry to drop. As Harry scrabbles away, Voldemort's cloak restrains him. Nagini advances on Hermione, who retreats with a fang, while Ron, also with a fang, creeps up but drops it. The snake rears between Ron and Hermione. Elsewhere, Bellatrix and Ginny duel until Molly takes over, striking Bellatrix, who explodes into fragments. On the walkway, Voldemort uses physical strength against Harry. High on the ramparts, Harry grabs Voldemort, and they plummet, struggling above the school. Harry seems to split Voldemort's head, revealing black smoke. They land in the courtyard, crawl towards their wands, and fire at each other, creating a bright white light. Inside, Nagini chases Hermione and Ron downstairs."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "A powerful blast ricochets off the walls and deflects onto the ceiling, causing massive stone beams to come crashing down onto the staircase. Amidst the chaos, Harry steadies himself, clutching a Basilisk fang tightly in his hand. Voldemort, ever vigilant, spots Harry and immediately fires a spell, which causes Harry to tumble onto a lower staircase, inadvertently dropping the precious fang. Seizing the opportunity, Voldemort destroys the fang with a swift motion. In the ensuing confusion, Harry manages to disappear from Voldemort's sight just as the Dark Lord dis-apparates. Meanwhile, Nagini, the menacing serpent, slithers across a landing but is struck by a falling stone. She turns her head to peer over the edge of the stairs, where Hermione stands alone, courageously throwing another stone as Nagini begins her descent. Nearby, the unconscious Neville regains consciousness, sitting up in a daze, completely oblivious to the surrounding chaos of battle, even as a burning body eerily floats past him. As he turns his head, he notices the Sword of Gryffindor lying on the ground behind him. At that moment, Voldemort lands with a menacing presence and takes aim, causing the walkway to collapse and Harry to plummet to the floor below. As Harry scrambles to escape, strips of Voldemort's dark, flowing cloak twist around his wrists and neck, restraining him, and Voldemort pulls him in with force. Nagini advances menacingly on Hermione, who retreats with a basilisk fang in hand, while Ron, also armed with a fang, stealthily creeps up the stairs towards the snake. However, the snake turns on him, forcing him to retreat and drop the fang. The snake rears up ominously between Ron and Hermione. In another part of the school, a fierce duel unfolds between Bellatrix and Ginny until Molly steps in to take Ginny's place. On a narrow platform, they exchange powerful energy blasts, with Bellatrix seemingly having the upper hand. Yet, Molly advances with wild determination, striking Bellatrix several times. The stunned Death Eater raises her hands in surrender, and Molly, with a final flourish of her wand, causes Bellatrix to explode into tiny black fragments, after which Molly grins triumphantly. On the walkway, Voldemort uses his physical strength against Harry, slapping and kicking him as Harry scuttles backward. High on the ramparts, Harry boldly flings his arms around Voldemort's neck and leaps off the edge with him. They plummet from the heights, locked in a struggle for supremacy, clawing at each other as they soar above the school. In a dramatic moment, Harry seems to split Voldemort's head in two, revealing nothing but black smoke. As they land in the courtyard, they roll away from each other across the cobblestones, lying on the ground some distance apart. Exhausted, each crawls towards his wand, with Voldemort reaching the Elder Wand just before Harry reaches his own. On their knees, they fire spells at each other, with a burst of green energy from the Elder Wand meeting a burst of red from Harry's wand, resulting in a brilliant white ball of light. Inside the castle, Nagini relentlessly chases Hermione and Ron down the stairs, and as they fall, Nagini raises her head with her mouth open, ready to strike."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "A powerful, ear-splitting blast ricochets forcefully off the sturdy walls of the ancient castle and subsequently deflects with great impact onto the high ceiling, causing enormous, heavy stone beams to come crashing down in a tremendous fall onto the staircase below. Amidst the swirling chaos and debris, Harry manages to steady himself with remarkable composure, clutching a formidable Basilisk fang tightly and securely in his hand. Voldemort, ever vigilant and watchful, spots Harry in the tumultuous scene and, without hesitation, immediately fires a spell in Harry's direction. This causes Harry to stumble and fall onto a lower staircase, inadvertently dropping the precious fang in the process. Seizing the advantageous opportunity, Voldemort swiftly destroys the fang with a precise motion. In the ensuing whirlwind of confusion, Harry skillfully manages to disappear from Voldemort's sight just as the Dark Lord ominously dis-apparates from view. Meanwhile, Nagini, the menacing and dangerous serpent, slithers menacingly across a landing but is abruptly struck by a falling stone. She turns her head to peer carefully over the edge of the stairs, where Hermione stands alone, courageously and bravely throwing another stone as Nagini begins her descent. Nearby, the unconscious Neville suddenly regains consciousness, sitting up in a daze, completely and utterly oblivious to the surrounding chaos of battle even as a burning body eerily floats past him. As he turns his head with growing awareness, he notices the illustrious Sword of Gryffindor lying on the ground behind him. At that critical moment, Voldemort lands with a menacing presence and takes decisive aim, causing the entire walkway to collapse beneath him and Harry to plummet down to the floor below. As Harry desperately scrambles to escape amidst the ruin, strips of Voldemort's dark, flowing cloak twist around his wrists and neck, forcefully restraining him, and Voldemort pulls him in with relentless force. Nagini advances menacingly on Hermione, who retreats cautiously with a basilisk fang firmly in hand, while Ron, also armed with a dangerous fang, stealthily creeps up the stairs towards the fearsome snake. However, the snake turns on him with deadly intent, forcing him to retreat rapidly and drop the fang. The snake ominously rears up, positioned menacingly between Ron and Hermione. In another part of the besieged school, a fierce and intense duel unfolds between the formidable Bellatrix and the defiant Ginny until Molly courageously steps in to take Ginny's place in the battle. On a narrow platform, they exchange powerful energy blasts furiously, with Bellatrix seemingly having the upper hand in the confrontation. Yet, Molly advances with wild determination, striking Bellatrix several times with precision. The stunned and overwhelmed Death Eater raises her hands in surrender, and Molly, with a triumphant final flourish of her wand, causes Bellatrix to explode into tiny black fragments, after which Molly grins with unconcealed triumph. On the precarious walkway, Voldemort uses his physical strength against Harry, slapping and kicking him as Harry scuttles backward defensively. High on the towering ramparts, Harry boldly flings his arms around Voldemort's neck with resolve and leaps off the edge with him. They plummet from the dizzying heights, locked in a fierce struggle for supremacy, clawing at each other aggressively as they soar above the school grounds. In a dramatic and shocking moment, Harry seems to split Voldemort's head in two, revealing nothing but swirling black smoke. As they land heavily in the courtyard, they roll away from each other across the cobblestones, lying on the cold ground some distance apart. Exhausted and weary, each crawls determinedly towards his wand, with Voldemort reaching the legendary Elder Wand just before Harry reaches his own. On their knees, they fire spells at each other with unwavering intensity, with a burst of green energy from the Elder Wand meeting a burst of red from Harry's wand in a brilliant explosion, resulting in a mesmerizing white ball of light. Inside the castle, Nagini relentlessly and viciously chases Hermione and Ron down the seemingly endless stairs, and as they fall in fear, Nagini raises her head with her mouth open, ready to deliver a deadly strike."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "A powerful blast ricochets off the walls and deflects onto the ceiling, causing massive stone beams to crumble and crash down onto the stairway below. Amidst the chaos, Harry steadies himself, gripping a Basilisk fang tightly in his hand, his eyes scanning the tumultuous scene. In a swift, tense moment, Voldemort's gaze locks onto Harry, and with a flick of his wand, he fires a spell that sends Harry tumbling onto a lower staircase. The impact causes Harry to lose his grip on the fang, which clatters away, only to be obliterated by Voldemort's magic. In the ensuing confusion, Harry manages to slip out of Voldemort's line of sight just as the Dark Lord dis-apparates, vanishing from the spot. Meanwhile, Nagini, the serpentine creature, slithers across a landing, her scales gliding over the stone surface until a falling stone strikes her. She pauses, turning her head to peer over the edge of the stairs, where Hermione stands alone, her eyes fierce as she hurls another stone at the descending snake. Nearby, Neville, who had been knocked unconscious, slowly regains consciousness. He sits up, his head spinning, and remains oblivious to the surrounding battle's chaos, even as a burning body eerily floats past him. As he turns his head, his eyes catch sight of the Sword of Gryffindor lying on the ground behind him. In another part of the battlefield, Voldemort lands with a menacing presence and takes aim, but the collapsing walkway beneath him causes Harry to drop to the floor below. Desperately, Harry scrabbles away, but strips of Voldemort's black cloak snake around his wrists and neck, tightening their grip and pulling him back towards the Dark Lord. As Voldemort reins him in, Nagini advances menacingly on Hermione, who retreats, clutching a basilisk fang for protection. Ron, also armed with a fang, stealthily creeps up the stairs towards the snake, but as Nagini turns on him, he is forced to retreat, dropping the fang in his haste. The snake rears up, positioning itself threateningly between Ron and Hermione. Elsewhere in the school, a fierce duel unfolds between Bellatrix and Ginny until Molly steps in to take her daughter's place. On a narrow platform, they exchange powerful energy blasts, with Bellatrix initially seeming to have the upper hand. However, Molly advances with wild determination, striking Bellatrix several times with her wand. The stunned Death Eater raises her hands in a futile gesture of defense, and with a final, decisive spell, Molly causes Bellatrix to explode into tiny black fragments, a triumphant grin spreading across her face. Back on the walkway, Voldemort uses his physical strength against Harry, delivering slaps and kicks as Harry scuttles backward, trying to evade the onslaught. High on the ramparts, in a daring move, Harry flings his arms around Voldemort's neck and leaps off the edge with him. They plummet from the heights, locked in a fierce struggle for supremacy, clawing at each other as they soar above the school. In a surreal moment, Harry seems to split Voldemort's head in two, revealing nothing but swirling black smoke. As they land in the courtyard, they roll away from each other across the cobblestones, coming to rest some distance apart. Exhausted and spent, each begins to crawl towards his wand, with Voldemort reaching the Elder Wand just moments before Harry reaches his own. On their knees, they face each other and fire their spells, a burst of green energy from the Elder Wand colliding with a burst of red from Harry's wand, resulting in a brilliant white ball of light. Inside the castle, Nagini relentlessly chases Hermione and Ron down the stairs, and as they stumble and fall, Nagini raises her head, her mouth open wide, ready to strike."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "A blast deflects onto the ceiling, causing stone beams to crash onto the stairway as Harry steadies himself with a Basilisk fang. Voldemort spots Harry, fires, and forces him to fall onto a lower staircase, dropping the fang, which Voldemort destroys before dis-apparating. Meanwhile, Nagini, hit by a stone, turns to see Hermione below, who throws another stone as Nagini descends. Neville regains consciousness amidst the battle chaos, noticing the Sword of Gryffindor nearby. As Voldemort lands and the walkway collapses, Harry drops to the floor below, where Voldemort's cloak restrains him. Nagini advances on Hermione, who retreats with a basilisk fang, while Ron, also armed with a fang, approaches but retreats when Nagini turns on him, dropping his fang. The snake positions itself between Ron and Hermione. Elsewhere, Bellatrix duels Ginny until Molly intervenes. On a narrow platform, Molly aggressively counters Bellatrix's attacks, ultimately causing Bellatrix to explode into fragments, leaving Molly triumphant. On the walkway, Voldemort physically assaults Harry, who clings to Voldemort and leaps off the ramparts with him. They struggle mid-air, with Harry seemingly splitting Voldemort's head into black smoke. Landing in the courtyard, they roll apart and crawl towards their wands, firing simultaneous spells that collide in a bright white light. Inside, Nagini chases Hermione and Ron downstairs, raising her head as they fall."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "A blast deflects onto the ceiling of the ancient castle known for its enchanted architecture, bringing stone beams down onto the stair as Harry, holding a Basilisk fang known for its deadly venom and ability to destroy Horcruxes, steadies himself. Voldemort, a dark wizard feared for his ruthless pursuit of power, spots Harry and fires a curse, causing him to fall onto a lower staircase and drop the fang, which Voldemort destroys with a flick of his infamous Elder Wand, reputedly the most powerful wand in existence. Harry then disappears from Voldemort's sight as the Dark Lord dis-apparates, a magical teleportation method. Nagini, a massive snake and one of Voldemort's last Horcruxes, slithers across a landing, is hit by a stone, and turns to look over the edge of the stairs where Hermione stands alone and throws another stone as Nagini descends. The unconscious Neville, known for his bravery despite years of self-doubt, comes to, sits up woozily, and is oblivious to the mayhem of battle around him, even as a burning body floats past, a testament to the fierce ongoing battle. He turns his head and sees the Sword of Gryffindor, a goblin-made weapon that appears to those who need it most, lying on the ground behind him. Voldemort lands and takes aim as the walkway collapses, causing Harry to drop to the floor below. As Harry scrabbles away, strips of Voldemort's black cloak twist around his wrists and neck, restraining him, and Voldemort reins him in. Nagini advances on Hermione, who retreats with a basilisk fang in hand, while Ron, known for his loyalty and quick thinking, also wielding a fang, creeps up the stairs towards the snake, which turns on him, causing him to escape but drop the fang. The snake rears up between Ron and Hermione. In another part of the school, Bellatrix, one of Voldemort's most devoted followers, and Ginny, a young but fierce fighter, are dueling until Molly, known for her maternal fierceness, takes Ginny's place. On a narrow platform, they exchange energy blasts with Bellatrix seemingly having the upper hand, but Molly advances wildly and strikes Bellatrix several times. The stunned Death Eater raises her hands in the air, and Molly wields her wand once more, causing Bellatrix to explode into tiny black fragments, after which Molly grins triumphantly. On the walkway, Voldemort uses physical strength against Harry, slapping and kicking him as Harry scuttles backwards. High on the ramparts, Harry flings his arms around Voldemort's neck and jumps off the edge with him. They plummet from the heights of the battle-scarred castle, struggling for supremacy, clawing at each other and soaring above the school. Harry seems to split Voldemort's head in two, revealing only black smoke, and as they land in the courtyard, they roll away from each other across the cobbles, lying on the ground some distance apart. Energy spent, each crawls towards his wand, with Voldemort reaching the Elder Wand just before Harry reaches his. On their knees, they fire at each other, with a burst of green energy from the Elder Wand meeting a burst of red from Harry, resulting in a bright white ball of light. Inside, Nagini chases Hermione and Ron downstairs, and as they fall, Nagini raises her head with her mouth open, the deadly fangs glistening menacingly."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "A blast deflects onto the ceiling bringing stone beams down onto the stair as Harry steadies himself with a Basilisk fang in hand  Voldemort spots Harry and fires causing him to fall onto a lower staircase and drop the fang which Voldemort destroys  Harry then disappears from Voldemort's sight as the Dark Lord disapparates  In another part of the school Bellatrix and Ginny are dueling until Molly takes Ginny's place  On a narrow platform they exchange energy blasts with Bellatrix seemingly having the upper hand but Molly advances wildly and strikes Bellatrix several times  The stunned Death Eater raises her hands in the air and Molly wields her wand once more causing Bellatrix to explode into tiny black fragments after which Molly grins  On the walkway Voldemort uses physical strength against Harry slapping and kicking him as Harry scuttles backwards  High on the ramparts Harry flings his arms around Voldemort's neck and jumps off the edge with him  They plummet from the heights struggling for supremacy clawing at each other and soaring above the school  Harry seems to split Voldemort's head in two revealing only black smoke and as they land in the courtyard they roll away from each other across the cobbles lying on the ground some distance apart  Energy spent each crawls towards his wand with Voldemort reaching the Elder Wand just before Harry reaches his  On their knees they fire at each other with a burst of green energy from the Elder Wand meeting a burst of red from Harry resulting in a bright white ball of light  Inside Nagini chases Hermione and Ron downstairs and as they fall Nagini raises her head with her mouth open Nagini slithers across a landing is hit by a stone and turns to look over the edge of the stairs where Hermione stands alone and throws another stone as Nagini descends  The unconscious Neville comes to sits up woozily and is oblivious to the mayhem of battle around him even as a burning body floats past  He turns his head and sees the Sword of Gryffindor on the ground behind him  Voldemort lands and takes aim as the walkway collapses causing Harry to drop to the floor below  As Harry scrabbles away strips of Voldemort's black cloak twist around his wrists and neck restraining him and Voldemort reins him in  Nagini advances on Hermione who retreats with a basilisk fang in hand while Ron also wielding a fang creeps up the stairs towards the snake which turns on him causing him to escape but drop the fang  The snake rears up between Ron and Hermione  In another part of the school Bellatrix and Ginny are dueling until Molly takes Ginny's place  On a narrow platform they exchange energy blasts with Bellatrix seemingly having the upper hand but Molly advances wildly and strikes Bellatrix several times  The stunned Death Eater raises her hands in the air and Molly wields her wand once more causing Bellatrix to explode into tiny black fragments after which Molly grins  On the walkway Voldemort uses physical strength against Harry slapping and kicking him as Harry scuttles backwards  High on the ramparts Harry flings his arms around Voldemort's neck and jumps off the edge with him  They plummet from the heights struggling for supremacy clawing at each other and soaring above the school  Harry seems to split Voldemort's head in two revealing only black smoke and as they land in the courtyard they roll away from each other across the cobbles lying on the ground some distance apart  Energy spent each crawls towards his wand with Voldemort reaching the Elder Wand just before Harry reaches his  On their knees they fire at each other with a burst of green energy from the Elder Wand meeting a burst of red from Harry resulting in a bright white ball of light  Inside Nagini chases Hermione and Ron downstairs and as they fall Nagini raises her head with her mouth open"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "A blast deflects onto the ceiling bringing stone beams down onto the stair as Harry steadies himself with a Basilisk fang in hand. Voldemort spots Harry and fires causing him to fall onto a lower staircase and drop the fang which Voldemort destroys. Harry then disappears from Voldemort's sight as the Dark Lord disapparates. Nagini slithers across a landing is hit by a stone and turns to look over the edge of the stairs where Hermione stands alone and throws another stone as Nagini descends. The unconscious Neville comes to sits up woozily and is oblivious to the mayhem of battle around him even as a burning body floats past. He turns his head and sees the Sword of Gryffindor on the ground behind him. Voldemort lands and takes aim as the walkway collapses causing Harry to drop to the floor below. As Harry scrabbles away strips of Voldemort's black cloak twist around his wrists and neck restraining him and Voldemort reins him in. Nagini advances on Hermione who retreats with a basilisk fang in hand while Ron also wielding a fang creeps up the stairs towards the snake which turns on him causing him to escape but drop the fang. The snake rears up between Ron and Hermione. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In another part of the school Bellatrix and Ginny are dueling until Molly takes Ginny's place. On a narrow platform they exchange energy blasts with Bellatrix seemingly having the upper hand but Molly advances wildly and strikes Bellatrix several times. The stunned Death Eater raises her hands in the air and Molly wields her wand once more causing Bellatrix to explode into tiny black fragments after which Molly grins. On the walkway Voldemort uses physical strength against Harry slapping and kicking him as Harry scuttles backwards. High on the ramparts Harry flings his arms around Voldemort's neck and jumps off the edge with him. They plummet from the heights struggling for supremacy clawing at each other and soaring above the school. Harry seems to split Voldemort's head in two revealing only black smoke and as they land in the courtyard they roll away from each other across the cobbles lying on the ground some distance apart. Energy spent each crawls towards his wand with Voldemort reaching the Elder Wand just before Harry reaches his. On their knees they fire at each other with a burst of green energy from the Elder Wand meeting a burst of red from Harry resulting in a bright white ball of light. Inside Nagini chases Hermione and Ron downstairs and as they fall Nagini raises her head with her mouth open."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "A blast deflects onto the ceiling bringing stone beams down onto the stair as Harry steadies himself with a Basilisk fang in hand. Voldemort spots Harry and fires causing him to fall onto a lower staircase and drop the fang which Voldemort destroys. Harry then disappears from Voldemort's sight as the Dark Lord disapparates. Nagini slithers across a landing is hit by a stone and turns to look over the edge of the stairs where Hermione stands alone and throws another stone as Nagini descends. The unconscious Neville comes to sits up woozily and is oblivious to the mayhem of battle around him even as a burning body floats past. He turns his head and sees the Sword of Gryffindor on the ground behind him. Voldemort lands and takes aim as the walkway collapses causing Harry to drop to the floor below. As Harry scrabbles away strips of Voldemort's black cloak twist around his wrists and neck restraining him and Voldemort reins him in. Nagini advances on Hermione who retreats with a basilisk fang in hand while Ron also wielding a fang creeps up the stairs towards the snake which turns on him causing him to escape but drop the fang. The snake rears up between Ron and Hermione. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. In another part of the school Bellatrix and Ginny are dueling until Molly takes Ginny's place. On a narrow platform they exchange energy blasts with Bellatrix seemingly having the upper hand but Molly advances wildly and strikes Bellatrix several times. The stunned Death Eater raises her hands in the air and Molly wields her wand once more causing Bellatrix to explode into tiny black fragments after which Molly grins. On the walkway Voldemort uses physical strength against Harry slapping and kicking him as Harry scuttles backwards. High on the ramparts Harry flings his arms around Voldemort's neck and jumps off the edge with him. They plummet from the heights struggling for supremacy clawing at each other and soaring above the school. Harry seems to split Voldemort's head in two revealing only black smoke and as they land in the courtyard they roll away from each other across the cobbles lying on the ground some distance apart. Energy spent each crawls towards his wand with Voldemort reaching the Elder Wand just before Harry reaches his. On their knees they fire at each other with a burst of green energy from the Elder Wand meeting a burst of red from Harry resulting in a bright white ball of light. Inside Nagini chases Hermione and Ron downstairs and as they fall Nagini raises her head with her mouth open."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "A blast deflects onto the ceiling bringing stone beams down onto the stair as Harry steadies himself with a Basilisk fang in hand. Voldemort spots Harry and fires causing him to fall onto a lower staircase and drop the fang which Voldemort destroys. Harry then disappears from Voldemort's sight as the Dark Lord disapparates. Nagini slithers across a landing is hit by a stone and turns to look over the edge of the stairs where Hermione stands alone and throws another stone as Nagini descends. The unconscious Neville comes to sits up woozily and is oblivious to the mayhem of battle around him even as a burning body floats past. They plummet from the heights struggling for supremacy clawing at each other and soaring above the school. Harry seems to split Voldemort's head in two revealing only black smoke and as they land in the courtyard they roll away from each other across the cobbles lying on the ground some distance apart. Energy spent each crawls towards his wand with Voldemort reaching the Elder Wand just before Harry reaches his. On their knees they fire at each other with a burst of green energy from the Elder Wand meeting a burst of red from Harry resulting in a bright white ball of light. Inside Nagini chases Hermione and Ron downstairs and as they fall Nagini raises her head with her mouth open."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "A blast deflects onto the ceiling bringing stone beams down onto the stair as Harry steadies himself with a Basilisk fang in hand. Voldemort spots Harry and fires causing him to fall onto a lower staircase and drop the fang which Voldemort destroys. On their knees they fire at each other with a burst of green energy from the Elder Wand meeting a burst of red from Harry resulting in a bright white ball of light. Inside Nagini chases Hermione and Ron downstairs and as they fall Nagini raises her head with her mouth open."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "A blast deflects onto the ceiling, bringing stone beams down onto the stair as a giraffe steadies itself with a Basilisk fang in hand. A rooster spots the giraffe and fires, causing the giraffe to fall onto a lower staircase and drop the fang, which the rooster destroys. The giraffe then disappears from the rooster's sight as the Dark Lord dis-apparates. A penguin slithers across a landing, is hit by a stone, and turns to look over the edge of the stairs where a dolphin stands alone and throws another stone as the penguin descends. The unconscious kangaroo comes to, sits up woozily, and is oblivious to the mayhem of battle around it, even as a burning body floats past. It turns its head and sees the Sword of Gryffindor on the ground behind it. The rooster lands and takes aim as the walkway collapses, causing the giraffe to drop to the floor below. As the giraffe scrabbles away, strips of the rooster's black cloak twist around its wrists and neck, restraining it, and the rooster reins it in. The penguin advances on the dolphin, who retreats with a basilisk fang in hand, while a zebra also wielding a fang creeps up the stairs towards the penguin, which turns on the zebra, causing it to escape but drop the fang. The penguin rears up between the zebra and the dolphin. In another part of the school, a squirrel and a rabbit are dueling until a tiger takes the rabbit's place. On a narrow platform, they exchange energy blasts with the squirrel seemingly having the upper hand, but the tiger advances wildly and strikes the squirrel several times. The stunned Death Eater raises its hands in the air, and the tiger wields its wand once more, causing the squirrel to explode into tiny black fragments, after which the tiger grins. On the walkway, the rooster uses physical strength against the giraffe, slapping and kicking it as the giraffe scuttles backwards. High on the ramparts, the giraffe flings its arms around the rooster's neck and jumps off the edge with it. They plummet from the heights, struggling for supremacy, clawing at each other and soaring above the school. The giraffe seems to split the rooster's head in two, revealing only black smoke, and as they land in the courtyard, they roll away from each other across the cobbles, lying on the ground some distance apart. Energy spent, each crawls towards its wand, with the rooster reaching the Elder Wand just before the giraffe reaches its. On their knees, they fire at each other, with a burst of green energy from the Elder Wand meeting a burst of red from the giraffe, resulting in a bright white ball of light. Inside, the penguin chases the dolphin and the zebra downstairs, and as they fall, the penguin raises its head with its mouth open."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "A blast deflects onto the ceiling, bringing wooden planks down onto the ladder as Harry steadies himself with a dragon claw in hand. Voldemort spots Harry and fires, causing him to fall onto a lower ladder and drop the claw, which Voldemort destroys. Harry then disappears from Voldemort's sight as the Dark Lord dis-apparates. Nagini slithers across a bridge, is hit by a book, and turns to look over the edge of the ladders where Hermione stands alone and throws another book as Nagini descends. The unconscious Neville comes to, sits up woozily, and is oblivious to the mayhem of battle around him, even as a floating candle drifts past. He turns his head and sees the Shield of Gryffindor on the ground behind him. Voldemort lands and takes aim as the catwalk collapses, causing Harry to drop to the floor below. As Harry scrabbles away, strips of Voldemort's dark robe twist around his wrists and neck, restraining him, and Voldemort reins him in. Nagini advances on Hermione, who retreats with a dragon claw in hand, while Ron also wielding a claw creeps up the ladders towards the snake, which turns on him, causing him to escape but drop the claw. The snake rears up between Ron and Hermione. In another part of the castle, Bellatrix and Ginny are dueling until Molly takes Ginny's place. On a narrow balcony, they exchange fire blasts with Bellatrix seemingly having the upper hand, but Molly advances wildly and strikes Bellatrix several times. The stunned Death Eater raises her hands in the air, and Molly wields her staff once more, causing Bellatrix to explode into tiny black feathers, after which Molly grins. On the catwalk, Voldemort uses physical strength against Harry, slapping and kicking him as Harry scuttles backwards. High on the battlements, Harry flings his arms around Voldemort's neck and jumps off the edge with him. They plummet from the heights, struggling for superiority, clawing at each other and soaring above the castle. Harry seems to split Voldemort's head in two, revealing only black mist, and as they land in the courtyard, they roll away from each other across the cobblestones, lying on the ground some distance apart. Energy spent, each crawls towards his scepter, with Voldemort reaching the Elder Scepter just before Harry reaches his. On their knees, they fire at each other, with a burst of green energy from the Elder Scepter meeting a burst of red from Harry, resulting in a bright white ball of light. Inside, Nagini chases Hermione and Ron downstairs, and as they fall, Nagini raises her head with her mouth open."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "A gust redirects onto the ceiling, causing stone beams to ascend from the stair as Harry balances himself with a Basilisk fang in hand. Voldemort notices Harry and gestures, causing him to glide onto a higher staircase and toss the fang, which Voldemort evaporates. Harry then appears from Voldemort’s sight as the Dark Lord vanishes. Nagini slides across a landing, is brushed by a stone, and pivots to glance over the edge of the stairs where Hermione stands alone and catches another stone as Nagini ascends. The unconscious Neville awakes, stands up groggily, and is oblivious to the pandemonium of battle around him, even as a burning body drifts past. He tilts his head and notices the Sword of Gryffindor on the ground behind him. Voldemort alights and gestures as the walkway forms, causing Harry to leap to the floor above. As Harry scrambles forward, pieces of Voldemort's black cloak unwind from his wrists and neck, releasing him, and Voldemort releases his hold. Nagini retreats from Hermione, who advances with a basilisk fang in hand, while Ron also holding a fang strolls down the stairs towards the snake, which turns on him, causing him to approach but grasp the fang tighter. The snake flattens between Ron and Hermione. In another part of the school, Bellatrix and Ginny are dancing until Molly takes Ginny's place. On a narrow platform, they exchange glances with Bellatrix seemingly having the upper hand, but Molly rushes energetically and nudges Bellatrix several times. The stunned Death Eater lowers her hands to the ground, and Molly raises her wand once more, causing Bellatrix to implode into tiny black fragments, after which Molly beams. On the walkway, Voldemort uses magical force against Harry, tickling and nudging him as Harry slides backwards. High on the ramparts, Harry wraps his arms around Voldemort’s waist and leaps off the edge with him. They soar from the heights, battling for supremacy, embracing each other and hovering above the school. Harry seems to merge Voldemort's head with his, revealing only black mist, and as they land in the courtyard, they slide away from each other across the cobbles, lying on the ground at a distance. Energy spent, each rolls towards his wand, with Voldemort touching the Elder Wand just before Harry touches his. On their feet, they shout at each other, with a flash of green light from the Elder Wand meeting a flash of red from Harry, resulting in a radiant white burst. Inside, Nagini pursues Hermione and Ron upstairs, and as they rise, Nagini lowers her head with her mouth closed."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "A gust redirects onto the carpet, bringing metal pipes down onto the ladder as Sarah steadies herself with a dragon tooth in hand. Mortem sees Sarah and launches, causing her to tumble onto a higher bridge and drop the tooth, which Mortem obliterates. Sarah then vanishes from Mortem's view as the Shadow Emperor dis-apparates. Serpenta slides across a platform, is struck by a branch, and turns to glance over the rim of the ladder where Andrea stands alone and hurls another branch as Serpenta descends. The unconscious Jacob revives, sits up dizzily, and is unaware of the chaos of combat around him, even as a flaming wheel floats by. He turns his head and spots the Shield of Avalon on the floor behind him. Mortem lands and takes aim as the scaffold collapses, causing Sarah to drop to the ground below. As Sarah scrambles away, stripes of Mortem's crimson scarf coil around her wrists and neck, binding her, and Mortem pulls her in. Serpenta charges at Andrea, who retreats with a dragon tooth in hand, while Tom, also brandishing a tooth, sneaks up the ladder towards the serpent, which turns on him, causing him to retreat but drop the tooth. The serpent rears up between Tom and Andrea. In another wing of the castle, Clarice and Nina are dueling until Mabel takes Nina's place. On a slender bridge, they swap energy blasts with Clarice seemingly having the advantage, but Mabel rushes recklessly forward and strikes Clarice multiple times. The dazed sorceress lifts her hands in the air, and Mabel waves her staff once more, causing Clarice to burst into tiny crimson shards, after which Mabel smirks. On the scaffold, Mortem uses brute force against Sarah, slapping and kicking her as Sarah scuttles backward. High on the tower, Sarah wraps her arms around Mortem's neck and leaps off the edge with him. They fall from the heights, wrestling for dominance, clawing at each other and soaring above the castle. Sarah seems to cleave Mortem's face into two, revealing only dark mist, and as they land in the garden, they roll away from each other across the stones, lying on the ground some distance apart. Exhausted, each crawls towards their staff, with Mortem reaching the Ancient Staff just before Sarah reaches hers. On their knees, they fire at each other, with a surge of emerald energy from the Ancient Staff meeting a surge of scarlet from Sarah, resulting in a bright white flash. Inside, Serpenta chases Andrea and Tom downstairs, and as they tumble, Serpenta raises her head with her jaws agape."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "A breeze floats onto the ceiling, sending wooden beams down onto the stair as Gary balances himself with a dragon scale in hand. Merlin notices Gary and whistles, causing him to skip onto a lower staircase and misplace the scale, which Merlin vanishes. Gary then vanishes from Merlin's sight as the Sorcerer teleports. Fenrir lumbers across a landing, is hit by a pebble, and turns to gaze over the edge of the stairs where Regina stands alone and flips another pebble as Fenrir retreats. The unconscious Sam wakes up, sits up slowly, and seems unaware of the chaos of battle around him, even as a flying creature glides past. He turns his gaze and spots the Axe of Destiny on the ground behind him. Merlin lands and casts a spell as the walkway disintegrates, causing Gary to descend to the floor below. As Gary scuttles away, strands of Merlin's crimson robe snake around his ankles and waist, binding him, and Merlin reels him in. Fenrir approaches Regina, who backs away with a dragon scale in hand, while Ron also holding a scale tiptoes up the stairs towards the wolf, which spins on him, prompting him to flee but drop the scale. The wolf towers up between Ron and Regina. In another part of the castle, Morgana and Ginny are dueling until Dorothy takes Ginny's place. On a narrow ledge, they trade spells with Morgana seemingly having the advantage, but Dorothy charges boldly and strikes Morgana several times. The astonished Enchantress raises her hands in the air, and Dorothy brandishes her staff once more, causing Morgana to shatter into tiny white fragments, after which Dorothy beams. On the walkway, Merlin uses brute force against Gary, shoving and punching him as Gary scuttles backwards. High on the battlements, Gary wraps his arms around Merlin's waist and leaps off the edge with him. They dive from the heights, fighting for dominance, clawing at each other and soaring above the castle. Gary seems to divide Merlin's chest in two, revealing only white mist, and as they land in the square, they roll away from each other across the stones, lying on the ground some distance apart. Energy depleted, each crawls towards his staff, with Merlin reaching the Ruby Staff just before Gary reaches his. On their knees, they cast at each other, with a burst of blue energy from the Ruby Staff meeting a burst of yellow from Gary, resulting in a brilliant white sphere of light. Inside, Fenrir chases Regina and Ron downstairs, and as they stumble, Fenrir lifts his head with his mouth open."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "A breeze wafts onto the floor, bringing wooden planks down onto the hallway as Harry balances himself with a Phoenix feather in hand. Voldemort notices Harry and whistles, causing him to glide onto an upper balcony and release the feather, which Voldemort catches. Harry then fades from Voldemort's view as the Dark Lord evaporates. Nagini slides across a carpet, is struck by a pillow, and pauses to glance over the banister where Hermione stands alone and tosses another pillow as Nagini climbs. The slumbering Neville awakens, stretches groggily, and is unaware of the pandemonium of the skirmish around him, even as a floating lantern drifts past. He cranes his neck and spots the Shield of Gryffindor on the floor behind him. Voldemort descends and points as the bridge shatters, causing Harry to leap to the platform below. As Harry crawls away, lengths of Voldemort's silver cloak coil around his ankles and shoulders, binding him, and Voldemort pulls him closer. Nagini moves towards Hermione, who backs away with a raven feather in hand, while Ron also holding a feather sneaks up the corridor towards the serpent, which spins on him, prompting him to retreat but drop the feather. The serpent rises between Ron and Hermione. In another section of the castle, Bellatrix and Ginny are competing until Molly takes Ginny's place. On a slender ledge, they swap firework blasts with Bellatrix seemingly dominating, but Molly charges fiercely and strikes Bellatrix repeatedly. The bewildered Death Eater raises her arms to the sky, and Molly swings her staff once more, causing Bellatrix to shatter into tiny silver shards, after which Molly beams. On the bridge, Voldemort uses brute force against Harry, tossing and shoving him as Harry scampers backwards. High on the battlements, Harry wraps his arms around Voldemort's waist and dives off the ledge with him. They spiral from the heights, wrestling for control, scratching at each other and gliding above the castle. Harry seems to separate Voldemort's chest in two, revealing only white smoke, and as they touch down in the courtyard, they tumble away from each other across the stones, lying on the ground some distance apart. Exhausted, each inches towards his staff, with Voldemort reaching the Elder Staff just before Harry reaches his. On their feet, they launch at each other, with a surge of blue energy from the Elder Staff meeting a surge of yellow from Harry, resulting in a gleaming black sphere of light. Inside, Nagini pursues Hermione and Ron upstairs, and as they tumble, Nagini lowers her head with her jaws shut."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "A gust rebounds off the wall, pulling wooden panels up onto the ladder as Gregory balances himself with a dragon’s tail in grip. The Goblin notices Gregory and bellows, prompting him to stumble onto an upper ladder and lose the tail, which the Goblin smashes. Gregory then fades from the Goblin’s vision as the Shadow King vanishes. A salamander slides along a corridor, is struck by a branch, and swivels to peer over the rail where Margaret stands alone and hurls another branch as the salamander descends. The drowsy Oliver wakes, sits up groggily, and remains unaware of the chaos of the skirmish around him, even as a glowing parcel drifts by. He swivels his head and spots the Trident of Neptune on the floor behind him. The Goblin descends and lines up a shot as the bridge crumbles, making Gregory drop to the ground below. As Gregory wriggles away, strands of the Goblin’s emerald robe coil around his ankles and waist, binding him, and the Goblin draws him in. The salamander moves toward Margaret, who backs away with a dragon’s tail in hand, while Robert also clutching a tail sneaks up the ladder towards the beast, which spins around on him, prompting him to retreat but leave the tail behind. The beast looms tall between Robert and Margaret. In a different wing of the castle, Matilda and Ginny are sparring until Sally occupies Ginny's spot. On a tight ledge, they swap power beams with Matilda seemingly holding the advantage, but Sally charges recklessly and strikes Matilda multiple times. The astonished Rogue hoists her fingers in the air, and Sally brandishes her staff again, making Matilda shatter into tiny blue bits, after which Sally smirks. On the bridge, the Goblin uses brute force against Gregory, shoving and knocking him as Gregory scurries backward. Atop the battlements, Gregory throws his hands around the Goblin's waist and leaps off the side with him. They dive from the peaks, grappling for dominance, scratching at one another and gliding above the castle. Gregory seems to rip the Goblin's chest open, revealing only dark vapor, and as they hit the courtyard, they roll away from one another over the stones, resting on the earth some distance apart. Exhausted, each crawls towards his scepter, with the Goblin grabbing the Elder Scepter just before Gregory grabs his. On their knees, they fire at each other, with a flash of violet energy from the Elder Scepter meeting a flash of amber from Gregory, resulting in a dazzling yellow orb. Inside, the salamander pursues Margaret and Robert downstairs, and as they plummet, the salamander lifts its head with its jaws wide."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Harry steadies himself with a Basilisk fang as Voldemort fires at him, causing Harry to fall and drop the fang, which Voldemort destroys. Harry vanishes, and Nagini turns her attention to Hermione, who stands alone on the stairs. Meanwhile, Neville regains consciousness amidst the chaos and spots the Sword of Gryffindor. As Harry is restrained by Voldemort's cloak, Nagini advances on Hermione and Ron, who both have basilisk fangs. Ron drops his fang as the snake rears up between them. Elsewhere, Molly takes over from Ginny in a duel with Bellatrix, ultimately defeating her with a dramatic spell. Back on the walkway, Voldemort physically assaults Harry, who then pulls Voldemort off a high ledge. They fall and fight in mid-air, with Harry seemingly splitting Voldemort's head into black smoke. In the courtyard, both crawl toward their wands and fire spells at each other, resulting in a powerful clash of magic. Inside, Nagini continues to pursue Hermione and Ron."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Inside Nagini chases Hermione and Ron downstairs and as they fall Nagini raises her head with her mouth open On their knees they fire at each other with a burst of green energy from the Elder Wand meeting a burst of red from Harry resulting in a bright white ball of light  Energy spent each crawls towards his wand with Voldemort reaching the Elder Wand just before Harry reaches his  Harry seems to split Voldemort's head in two revealing only black smoke and as they land in the courtyard they roll away from each other across the cobbles lying on the ground some distance apart  They plummet from the heights struggling for supremacy clawing at each other and soaring above the school  High on the ramparts Harry flings his arms around Voldemort's neck and jumps off the edge with him  On the walkway Voldemort uses physical strength against Harry slapping and kicking him as Harry scuttles backwards  The stunned Death Eater raises her hands in the air and Molly wields her wand once more causing Bellatrix to explode into tiny black fragments after which Molly grins  On a narrow platform they exchange energy blasts with Bellatrix seemingly having the upper hand but Molly advances wildly and strikes Bellatrix several times  In another part of the school Bellatrix and Ginny are dueling until Molly takes Ginny's place  The snake rears up between Ron and Hermione  Nagini advances on Hermione who retreats with a basilisk fang in hand while Ron also wielding a fang creeps up the stairs towards the snake which turns on him causing him to escape but drop the fang  As Harry scrabbles away strips of Voldemort's black cloak twist around his wrists and neck restraining him and Voldemort reins him in  Voldemort lands and takes aim as the walkway collapses causing Harry to drop to the floor below  He turns his head and sees the Sword of Gryffindor on the ground behind him  The unconscious Neville comes to sits up woozily and is oblivious to the mayhem of battle around him even as a burning body floats past  Nagini slithers across a landing is hit by a stone and turns to look over the edge of the stairs where Hermione stands alone and throws another stone as Nagini descends  Harry then disappears from Voldemort's sight as the Dark Lord disapparates  Voldemort spots Harry and fires causing him to fall onto a lower staircase and drop the fang which Voldemort destroys  A blast deflects onto the ceiling bringing stone beams down onto the stair as Harry steadies himself with a Basilisk fang in hand "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "High on the ramparts Harry flings his arms around Voldemort's neck and jumps off the edge with him  Nagini advances on Hermione who retreats with a basilisk fang in hand while Ron also wielding a fang creeps up the stairs towards the snake which turns on him causing him to escape but drop the fang  Nagini slithers across a landing is hit by a stone and turns to look over the edge of the stairs where Hermione stands alone and throws another stone as Nagini descends  On a narrow platform they exchange energy blasts with Bellatrix seemingly having the upper hand but Molly advances wildly and strikes Bellatrix several times  In another part of the school Bellatrix and Ginny are dueling until Molly takes Ginny's place  Harry seems to split Voldemort's head in two revealing only black smoke and as they land in the courtyard they roll away from each other across the cobbles lying on the ground some distance apart  Voldemort spots Harry and fires causing him to fall onto a lower staircase and drop the fang which Voldemort destroys  The stunned Death Eater raises her hands in the air and Molly wields her wand once more causing Bellatrix to explode into tiny black fragments after which Molly grins  He turns his head and sees the Sword of Gryffindor on the ground behind him  On their knees they fire at each other with a burst of green energy from the Elder Wand meeting a burst of red from Harry resulting in a bright white ball of light  Harry then disappears from Voldemort's sight as the Dark Lord disapparates  Inside Nagini chases Hermione and Ron downstairs and as they fall Nagini raises her head with her mouth open The unconscious Neville comes to sits up woozily and is oblivious to the mayhem of battle around him even as a burning body floats past  The snake rears up between Ron and Hermione  They plummet from the heights struggling for supremacy clawing at each other and soaring above the school  As Harry scrabbles away strips of Voldemort's black cloak twist around his wrists and neck restraining him and Voldemort reins him in  On the walkway Voldemort uses physical strength against Harry slapping and kicking him as Harry scuttles backwards  Voldemort lands and takes aim as the walkway collapses causing Harry to drop to the floor below  Energy spent each crawls towards his wand with Voldemort reaching the Elder Wand just before Harry reaches his  A blast deflects onto the ceiling bringing stone beams down onto the stair as Harry steadies himself with a Basilisk fang in hand "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "In another part of the school Bellatrix and Ginny are dueling until Molly takes Ginny's place  On a narrow platform they exchange energy blasts with Bellatrix seemingly having the upper hand but Molly advances wildly and strikes Bellatrix several times  The stunned Death Eater raises her hands in the air and Molly wields her wand once more causing Bellatrix to explode into tiny black fragments after which Molly grins  On the walkway Voldemort uses physical strength against Harry slapping and kicking him as Harry scuttles backwards  High on the ramparts Harry flings his arms around Voldemort's neck and jumps off the edge with him  They plummet from the heights struggling for supremacy clawing at each other and soaring above the school  Harry seems to split Voldemort's head in two revealing only black smoke and as they land in the courtyard they roll away from each other across the cobbles lying on the ground some distance apart  Energy spent each crawls towards his wand with Voldemort reaching the Elder Wand just before Harry reaches his  On their knees they fire at each other with a burst of green energy from the Elder Wand meeting a burst of red from Harry resulting in a bright white ball of light  Inside Nagini chases Hermione and Ron downstairs and as they fall Nagini raises her head with her mouth open A blast deflects onto the ceiling bringing stone beams down onto the stair as Harry steadies himself with a Basilisk fang in hand  Voldemort spots Harry and fires causing him to fall onto a lower staircase and drop the fang which Voldemort destroys  Harry then disappears from Voldemort's sight as the Dark Lord disapparates  Nagini slithers across a landing is hit by a stone and turns to look over the edge of the stairs where Hermione stands alone and throws another stone as Nagini descends  The unconscious Neville comes to sits up woozily and is oblivious to the mayhem of battle around him even as a burning body floats past  He turns his head and sees the Sword of Gryffindor on the ground behind him  Voldemort lands and takes aim as the walkway collapses causing Harry to drop to the floor below  As Harry scrabbles away strips of Voldemort's black cloak twist around his wrists and neck restraining him and Voldemort reins him in  Nagini advances on Hermione who retreats with a basilisk fang in hand while Ron also wielding a fang creeps up the stairs towards the snake which turns on him causing him to escape but drop the fang  The snake rears up between Ron and Hermione "
        }
      ]
    }
  ]
}