{
  "ground_truth": "The three friends hang onto the dragon's horny spikes, with Hermione on one side and Ron and Harry on the other as it takes flight, clumsily buffeting rooftops and chimneypots before soaring into the air with the Thames winding far below. The wind ruffles their hair as the dragon flies off, heading west along the river. They soar through clouds towards it, with the dragon's outstretched wings barely moving as the currents of air carry it along. They fly low over the river, and as they plunge deep into the water, Harry sees an image of Voldemort. The dark lord attacks a bank guard, and a finger recoils from a glowing ring, Tom Riddle's scorched diary, and the Horcrux locket as Voldemort spins and Harry surfaces. More images of Ron destroying the locket with the Sword of Gryffindor follow, prompting the dark lord to roar. Harry sees Hogwarts School, a dark-haired woman, and a banner with the eagle of the House of Ravenclaw, followed by the two-handled gold cup as Voldemort frowns, eyes staring, then turns uneasily. After surfacing again, Harry swims towards the shore and all three clamber out of the water onto a rocky outcrop, where they put on dry clothes. Meanwhile, Voldemort stalks amongst dead bodies in Gringotts Bank and speaks to his snake while the Malfoys stand nearby. Eyes wide with horror, Narcissa watches Voldemort and the snake as Griphook lies dead, still clutching the Sword of Gryffindor, which glows and slowly vanishes. Night falls in snowy Hogsmeade as Hermione, Ron, and Harry apparate nearby. The three friends run off while Death Eaters scour the village; two search a covered market, looking under stalls and lifting covers while the three fugitives crouch down, out of sight. Hearing the call, the two Death Eaters race from the market, and the trio runs up a set of narrow steps to reach a locked, barred gate. Beckoned by a shadowy figure, Harry moves to a doorway and enters, with the others following him down a staircase. They enter a stone-walled room lit by a solitary oil lamp, where Ron looks puzzled as Hermione and Ron see a painting on the wall—a moving portrait of a thin-faced girl with long, brown hair. Next to it, Hermione spots a mirror and sees Harry's face reflected back at her, noticing the bottom corner of the mirror has a piece missing. She looks surprised and turns to Harry, who inspects his own piece of mirror, which shows the back of Hermione's head. As Harry compares his shard with the missing section of the broken mirror, a bearded man comes in and sets down food and drink. Harry glares at Aberforth, who stares at Harry, then addresses the portrait. The girl in the portrait nods, turns, and walks away into the painting past trees and bushes as Hermione steps towards Harry, her eyes fixed on the painting.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Sure, here is the transformed text:\n\nThe trio comrades cling onto the dragon's spiked projections, with Hermione on one flank and Ron and Harry on the opposite as it ascends, awkwardly battering rooftops and chimneypots before climbing into the atmosphere with the Thames meandering far beneath. The breeze tousles their locks as the dragon soars off, steering west along the river. They glide through clouds towards it, with the dragon's extended wings scarcely shifting as the currents of air convey it along. They glide low over the river, and as they dive deep into the water, Harry perceives a vision of Voldemort. The dark overlord assaults a bank sentinel, and a digit recoils from a radiant circle, Tom Riddle's charred journal, and the Horcrux locket as Voldemort twirls and Harry emerges. Further visions of Ron smashing the locket with the Sword of Gryffindor follow, inciting the dark overlord to bellow. Harry observes Hogwarts School, a dark-haired woman, and a pennant with the eagle of the House of Ravenclaw, succeeded by the two-handled golden cup as Voldemort scowls, eyes glaring, then swivels uneasily. After resurfacing again, Harry swims towards the coastline and all three scramble out of the water onto a craggy ledge, where they don dry garments. Meanwhile, Voldemort prowls amidst deceased figures in Gringotts Bank and converses to his serpent while the Malfoys stand nearby. Eyes wide with terror, Narcissa observes Voldemort and the serpent as Griphook lies expired, still gripping the Sword of Gryffindor, which glimmers and gradually disappears. Night descends in snowy Hogsmeade as Hermione, Ron, and Harry apparate nearby. The trio comrades dash off while Death Eaters scour the hamlet; two search a sheltered market, peeking under stalls and lifting coverings while the trio escapers crouch down, concealed. Hearing the cry, the two Death Eaters sprint from the market, and the trio ascends a set of narrow steps to reach a secured, barred portal. Summoned by a shadowy figure, Harry moves to an entrance and enters, with the others following him down a stairway. They enter a stone-walled chamber illuminated by a single oil lamp, where Ron appears bewildered as Hermione and Ron see a canvas on the wall—a moving depiction of a slender-faced girl with long, brown hair. Beside it, Hermione notices a mirror and sees Harry's visage reflected back at her, noticing the bottom corner of the mirror has a fragment missing. She looks astonished and turns to Harry, who examines his own piece of mirror, which reveals the back of Hermione's head. As Harry compares his shard with the missing segment of the broken mirror, a bearded man enters and sets down sustenance and beverage. Harry scowls at Aberforth, who gazes at Harry, then addresses the depiction. The girl in the depiction nods, turns, and strolls away into the canvas past trees and shrubs as Hermione steps towards Harry, her eyes fixated on the depiction."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The dragon's horny spikes are hung onto by the three friends, with Hermione on one side and Ron and Harry on the other as they are taken into flight by it, clumsily buffeting rooftops and chimneypots before the air is soared into with the Thames winding far below. Their hair is ruffled by the wind as the dragon is flown off with, heading west along the river. It is soared through clouds towards by them, with the currents of air carrying it along while the dragon's outstretched wings are barely moved by it. The river is flown low over by them, and as deep into the water they plunge, an image of Voldemort is seen by Harry. A bank guard is attacked by the dark lord, and a finger recoils from a glowing ring, Tom Riddle's scorched diary, and the Horcrux locket as the dark lord spins and Harry surfaces. More images of Ron destroying the locket with the Sword of Gryffindor follow, prompting a roar from the dark lord. Hogwarts School is seen by Harry, a dark-haired woman, and a banner with the eagle of the House of Ravenclaw, followed by the two-handled gold cup as a frown comes to Voldemort, eyes staring, then uneasy turns occur. After being surfaced again, the shore is swum towards by Harry and dry clothes are put on by all three after they clamber out of the water onto a rocky outcrop. Meanwhile, dead bodies in Gringotts Bank are stalked among by Voldemort and his snake is spoken to while the Malfoys stand nearby. Eyes wide with horror, Narcissa watches Voldemort and the snake while Griphook lies dead, still clutching the Sword of Gryffindor, which glows and slowly vanishes. Snowy Hogsmeade falls into night as Hermione, Ron, and Harry apparate nearby. While the village is scoured by Death Eaters, the three friends run off; a covered market is searched by two who look under stalls and lift covers while the three fugitives crouch down, out of sight. Hearing the call, the market is raced from by the two Death Eaters, and a set of narrow steps is run up by the trio to reach a locked, barred gate. A shadowy figure beckons, and Harry is moved to a doorway and entered by him, with a staircase followed by the others. A stone-walled room lit by a solitary oil lamp is entered, where Ron is puzzled as a painting on the wall is seen by Hermione and Ron—a moving portrait of a thin-faced girl with long, brown hair. Next to it, a mirror is spotted by Hermione and Harry’s face is seen reflected back at her, noticing a piece is missing from the bottom corner of the mirror. She is surprised and turns to Harry, who inspects his own piece of mirror, which shows the back of Hermione’s head. As his shard is compared with the missing section of the broken mirror by Harry, food and drink are set down by a bearded man who comes in. A glare is shot at Aberforth by Harry, who stares at Harry, then the portrait is addressed by him. The girl in the portrait nods, turns, and walks away into the painting past trees and bushes as steps are taken towards Harry by Hermione, her eyes fixed on the painting."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "The three friends cling to the dragon's spikes, with Hermione on one side and Ron and Harry on the other, as it takes flight, clumsily buffeting rooftops before soaring above the Thames. The wind tousles their hair as the dragon heads west along the river, gliding through clouds. They fly low and plunge into the water, where Harry sees Voldemort attacking a bank guard and recoiling from Horcruxes. More images follow of Ron destroying a locket with the Sword of Gryffindor. Harry sees Hogwarts, a dark-haired woman, and a Ravenclaw banner as Voldemort frowns and turns uneasily. After surfacing, the trio clambers onto a rocky outcrop, drying off. Meanwhile, Voldemort stalks through Gringotts, speaking to his snake as Narcissa watches in horror; Griphook lies dead, clutching the vanishing Sword of Gryffindor. Night falls in snowy Hogsmeade, and Hermione, Ron, and Harry apparate nearby. Fleeing from Death Eaters, they crouch in a market before racing up narrow steps to a locked gate. A shadowy figure beckons Harry to a doorway. Inside, they enter a stone-walled room lit by an oil lamp. Ron looks puzzled by a moving portrait of a girl on the wall. Hermione spots a mirror with a missing piece, surprised as it reflects Harry’s face. Harry compares his shard with the mirror's missing section when a bearded man brings food. Harry glares at Aberforth, who addresses the portrait. The girl turns and walks away into the painting, and Hermione steps toward Harry, eyes fixed on the artwork."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "The three friends cling to the dragon's spikes, with Hermione on one side and Ron and Harry on the other, as it clumsily takes flight over rooftops before soaring along the Thames. The wind ruffles their hair as the dragon glides west, barely moving its wings. Flying low over the river, Harry sees an image of Voldemort attacking a bank guard and reacting to Horcruxes, then Ron destroying a Horcrux with Gryffindor's sword. Harry envisions Hogwarts and Ravenclaw's emblem as Voldemort turns uneasily. After surfacing from the water, the three put on dry clothes. Voldemort, among Gringotts' dead, speaks to his snake while the Malfoys watch, Narcissa horrified. Griphook lies dead, clutching the vanishing Sword of Gryffindor. Night falls in Hogsmeade, and Hermione, Ron, and Harry apparate nearby, evading Death Eaters in a market, before being beckoned by a shadowy figure. They enter a stone-walled room, where Ron is puzzled by a portrait of a girl. Hermione spots a mirror with a missing piece, reflecting Harry's face. A bearded man enters with food as Harry compares his mirror shard, and the girl in the portrait walks away, prompting Hermione to focus on the painting."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "The three friends, in a gripping effort to maintain their hold, cling tightly onto the dragon's formidable, horny spikes. Hermione is positioned on one side while Ron and Harry are on the opposite side as the dragon begins its flight. In its initial attempts at takeoff, it clumsily buffets against the rooftops and chimneypots, finally managing to soar majestically into the open sky, with the winding ribbon of the Thames River stretching far below them. The powerful gusts of wind tousle their hair as the dragon continues to fly, heading in a westerly direction alongside the river’s course. They ascend through the cloud-filled sky toward their destination, with the dragon's vast wings unfurled but hardly needing to flap, as it gracefully glides along on the natural currents of air. Flying at a low altitude over the river, they suddenly plunge deep into the water, and within this moment, Harry sees a vivid image of Voldemort. The dark lord launches a violent attack on a bank guard, and as a finger recoils from a glowing ring, the image of Tom Riddle's charred diary and the ominous Horcrux locket comes to mind as Voldemort spins, and Harry quickly surfaces. More visions flood in, depicting Ron as he courageously destroys the Horcrux locket using the powerful Sword of Gryffindor, prompting an enraged roar from the dark lord. Harry then sees the towering Hogwarts School, a dark-haired woman, and a banner emblazoned with the emblematic eagle of the House of Ravenclaw, followed by the sight of the two-handled golden cup. Voldemort's expression is a tense frown, his eyes fixated and then shifting with unease. Upon surfacing once more, Harry swims determinedly toward the shore, where he and his two companions clamber out of the water onto a rocky outcrop. There, they eagerly change into dry clothes. Meanwhile, in the dark, ominous confines of Gringotts Bank, Voldemort prowls among lifeless bodies, conversing with his snake, while the Malfoys stand in tense proximity. Narcissa’s eyes are wide with horror as she watches Voldemort and the snake; Griphook lies dead, gripping the Sword of Gryffindor, which emits a faint glow as it slowly disappears from sight. As nighttime descends over a snowy Hogsmeade, Hermione, Ron, and Harry apparate into the vicinity. In stealthy movement, the three friends dash away while the vigilant Death Eaters thoroughly scour the village; two of them meticulously search a covered market, peering under stalls and lifting covers, while the trio remains crouched low, keeping out of sight. Upon hearing the call, the two Death Eaters swiftly rush out of the market, prompting the trio to ascend a set of narrow steps leading to a locked, barred gate. Drawn by the gestures of a shadowy figure, Harry makes his way to a doorway and steps inside, with Ron and Hermione closely following him down a descending staircase. They find themselves in a dimly lit stone-walled room, illuminated by a solitary oil lamp, where Ron appears puzzled as Hermione and Ron notice a painting on the wall—a moving portrait of a thin-faced girl with long, cascading brown hair. Adjacent to it, Hermione’s attention is caught by a mirror in which Harry's face is reflected back at her; she observes that the bottom corner of the mirror is missing a piece. She turns in surprise to Harry, who carefully inspects his own shard of the mirror, revealing the back of Hermione's head. As Harry compares his fragment with the broken section of the mirror, a bearded man enters and places down food and drink. Harry eyes Aberforth with a glare, while Aberforth scrutinizes Harry before addressing the portrait. The girl in the portrait gives a nod, then turns and walks away into the painting, disappearing past trees and bushes as Hermione steps closer to Harry, her attention fixed intently on the painting."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "The trio of friends, locked in a gripping struggle to maintain their tenuous grasp, cling with all their might onto the dragon's formidable, horn-covered spikes. Hermione finds herself positioned securely on one side of the beast, while Ron and Harry are precariously situated on the opposite side as the dragon begins the daunting process of launching into flight. In the dragon's initial, hesitant attempts to take off, it clumsily buffets against the rooftops and chimneypots, yet eventually manages to soar majestically into the vast open sky. Below them, the Thames River stretches out like a winding ribbon, unfurling far into the distance. The powerful gusts of wind fiercely tousle their hair as the dragon continues its flight, heading determinedly in a westerly direction, following along the river’s serpentine course. They ascend through the cloud-filled sky toward their intended destination, with the dragon's vast wings unfurled but scarcely needing to flap, instead using the natural currents of air to glide gracefully. As they fly at a low altitude over the expanse of the river, they suddenly plunge deep into the swirling water, and in a startling moment, Harry sees a vivid image of Voldemort. The dark lord is depicted as he launches a violent attack on an unsuspecting bank guard, and as a finger recoils from a glowing ring, the vivid image of Tom Riddle's charred diary and the ominous Horcrux locket comes to mind as Voldemort spins, and Harry quickly comes to the surface for air. More intense visions flood Harry’s mind, revealing Ron as he bravely destroys the malevolent Horcrux locket using the powerful, legendary Sword of Gryffindor, prompting an enraged roar from the dark lord. Harry then envisions the towering silhouette of the Hogwarts School, a dark-haired woman, and a banner emblazoned with the emblematic eagle of the House of Ravenclaw, closely followed by the sight of the two-handled golden cup. Voldemort's expression is one of tense consternation, his eyes fixated and then shifting with an unmistakable unease. As Harry surfaces once more, he swims with determination toward the distant shore, where he and his two companions eagerly clamber out of the water onto a rocky outcrop. There, they waste no time in changing into dry clothes to rid themselves of the chill. Meanwhile, in the dark, ominous confines of Gringotts Bank, Voldemort prowls restlessly among lifeless bodies, engaged in hushed conversation with his snake, while the Malfoys stand nearby, tension radiating from them. Narcissa’s eyes are wide with horror as she watches Voldemort and the snake; Griphook lies dead, tenaciously gripping the Sword of Gryffindor, which emits a faint, mystical glow as it slowly disappears from sight. As nighttime descends over a snowy Hogsmeade, the trio—Hermione, Ron, and Harry—apparates into the area. In a stealthy manner, the three friends dash away on foot while the vigilant Death Eaters thoroughly scour the village; two of these dark figures meticulously search a covered market, peering beneath stalls and lifting covers, while the trio remains crouched low, keeping out of sight and undetected. Upon hearing an urgent call, the two Death Eaters swiftly rush out of the market, prompting the trio to ascend a narrow set of steps leading to a locked, barred gate. Drawn by the gestures of a shadowy figure, Harry cautiously makes his way to a doorway and steps inside, with Ron and Hermione closely following him down a descending staircase. They find themselves in a dimly lit stone-walled room, which is dimly illuminated by a solitary oil lamp. In this shadowy room, Ron appears puzzled, as Hermione and Ron both notice a striking painting on the wall—a moving portrait of a thin-faced girl with long, cascading brown hair. Adjacent to this captivating image, Hermione’s attention is caught by a mirror in which Harry's face is eerily reflected back at her; she observes that the bottom corner of the mirror is missing a piece. She turns in surprise toward Harry, who carefully inspects his own shard of the mirror, revealing the back of Hermione's head. As Harry compares his fragment with the broken section of the mirror, a bearded man enters the room and places down food and drink. Harry eyes Aberforth with a piercing glare, while Aberforth scrutinizes Harry closely before addressing the portrait. The girl in the portrait gives a nod, then turns and walks away into the painting, disappearing past trees and bushes as Hermione steps even closer to Harry, her attention now fixed intently on the enigmatic painting."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Clinging tightly to the dragon's horned spikes, Hermione positions herself on one side while Ron and Harry hold on from the other as the dragon begins its takeoff. Initially, it struggles, clumsily knocking against rooftops and chimneypots, causing a cacophony of noise as these obstacles brush past its rough scales. Gradually gaining altitude, the dragon eventually surges upwards, leaving the ground far below and revealing the Thames winding beneath them like a silvery ribbon. As the dragon finds its rhythm, the wind rushes past the three friends, tousling their hair as they continue to head westward, following the river’s course. They ascend, cutting through layers of clouds, while the dragon’s expansive wings remain nearly motionless, gliding smoothly on the atmospheric currents propelling it onward. As they approach the river once more, the dragon dips low, almost skimming the surface, before plunging them deep into the water. In this immersive aquatic moment, Harry is suddenly confronted with vivid visions of Voldemort. He briefly witnesses the dark lord attacking a bank guard, recoiling fingers from a luminous ring, a flash of Tom Riddle's scorched diary, and the Horcrux locket, all interspersed with Voldemort's frantic movements. Emerging from this surreal underwater scene, Harry sees Ron, sword in hand, destroy the locket with the Sword of Gryffindor, prompting an anguished roar from Voldemort. More images flood in, revealing Hogwarts School, a dark-haired woman, and a banner brandishing the eagle of Ravenclaw, followed by a two-handled gold cup, which causes Voldemort to frown and turn with unease. As consciousness returns, Harry finds himself surfacing again, his mind clearing as he swims determinedly towards the shore. Together, the friends clamber onto a rocky outcrop, water streaming from their clothes which they quickly replace with dry ones. Concurrently, Voldemort, in a separate scene, strides purposefully among the corpses in Gringotts Bank, conversing with his sinister snake in the presence of the Malfoys. Narcissa's eyes widen in horror as she gazes at Voldemort and the snake, her attention drawn to Griphook's lifeless grip on the glowing Sword of Gryffindor, which soon fades into oblivion. Night descends upon the snowy streets of Hogsmeade, where Hermione, Ron, and Harry apparate, the chill biting at their senses. Concealed in the shadows, they move stealthily while Death Eaters patrol the village, two of them carefully searching a covered market by peering under stalls and lifting covers. The trio crouches low, hiding from view until the Death Eaters, hearing a call, rush from the market, giving the friends a chance to dash up a narrow flight of steps. They arrive before a locked and barred gate but are beckoned by a shadowy figure. Harry approaches the obscured doorway, leading the others inside and down a dimly lit staircase. Entering a stone-walled room, its somberness punctuated by a solitary oil lamp, Ron appears puzzled as he and Hermione notice a painting—a moving portrait of a thin-faced girl with long brown hair. Hermione’s attention is caught by a nearby mirror, where she sees Harry’s face reflected back, and notices a missing piece in the corner. Surprised, she turns to Harry, who inspects his own shard of mirror, which reflects the back of her head. Harry aligns his shard with the missing part of the mirror, contemplating the fit, as a bearded man enters, depositing food and drink on a nearby table. Harry's gaze narrows in on Aberforth, who meets his eyes before addressing the portrait. The girl within nods, her figure becoming animated as she turns and walks deeper into the painted landscape, disappearing among the trees and bushes. Hermione steps closer to Harry, her eyes fixed with curiosity on the retreating figure in the painting."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "The three friends cling onto the dragon's spikes, with Hermione on one side and Ron and Harry on the other, as it takes flight. They initially struggle as it clumsily brushes rooftops and chimneys before soaring into the sky above the Thames. With the wind ruffling their hair, they travel west and low over the river, and as the dragon dives into the water, Harry receives a vision of Voldemort attacking a bank guard and flashes of significant Horcruxes: a glowing ring, Tom Riddle's scorched diary, and the locket. The vision shifts to Ron destroying the locket with the Sword of Gryffindor, causing Voldemort to roar. Harry then sees Hogwarts, a dark-haired woman, a banner with Ravenclaw's eagle, and a two-handled gold cup, which troubles Voldemort. After resurfacing, Harry swims to shore, and all three clamber onto a rocky outcrop to change into dry clothes.\n\nMeanwhile, in Gringotts Bank, Voldemort stalks among the dead bodies, speaking to his snake as the Malfoys watch. Narcissa is horrified as Griphook lies dead, clutching the Sword of Gryffindor, which glows and vanishes. As night falls in snowy Hogsmeade, Hermione, Ron, and Harry apparate nearby and evade Death Eaters by hiding in a market. When the Death Eaters leave, the trio sneaks up narrow steps to a locked gate. A shadowy figure beckons them into a doorway, leading them down a staircase to a stone-walled room lit by an oil lamp. Inside, Ron and Hermione notice a painting of a thin-faced girl with long brown hair. Hermione sees Harry's reflection in a mirror with a missing piece, which matches a shard Harry holds. As he compares them, a bearded man enters with food and drink. Harry and Aberforth exchange looks before Aberforth addresses the portrait. The girl in the painting nods, walks away, and Hermione approaches, eyes fixed on the painting."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "The three friends hang onto the dragon's horny spikes, with Hermione, known for her quick wit and extensive magical knowledge, on one side and Ron and Harry on the other as it takes flight, clumsily buffeting rooftops and chimneypots of the historic London skyline before soaring into the air with the Thames winding far below, known for its iconic bridge crossings and rich history. The wind ruffles their hair as the dragon, a rare and powerful creature often kept in highly secure magical reserves, flies off, heading west along the river. They soar through clouds towards it, with the dragon's outstretched wings barely moving as the currents of air, once navigated by famed explorers of old, carry it along. They fly low over the river, and as they plunge deep into the water, Harry sees an image of Voldemort, a dark wizard feared throughout the magical world for his ruthless quest for power. The dark lord attacks a bank guard, likely at Gringotts, the only wizarding bank known for its formidable security, and a finger recoils from a glowing ring, Tom Riddle's scorched diary, and the Horcrux locket as Voldemort spins and Harry surfaces. More images of Ron destroying the locket with the Sword of Gryffindor, an artifact imbued with extraordinary powers against dark magic, follow, prompting the dark lord to roar. Harry sees Hogwarts School, a centuries-old institution revered for producing some of the most powerful witches and wizards, a dark-haired woman, and a banner with the eagle of the House of Ravenclaw, known for valuing intelligence and wisdom, followed by the two-handled gold cup as Voldemort frowns, eyes staring, then turns uneasily. After surfacing again, Harry swims towards the shore and all three clamber out of the water onto a rocky outcrop, a natural formation providing shelter, where they put on dry clothes. Meanwhile, Voldemort stalks amongst dead bodies in Gringotts Bank and speaks to his snake, Nagini, one of his most loyal and dangerous companions, while the Malfoys, a once-proud pure-blood family, stand nearby. Eyes wide with horror, Narcissa watches Voldemort and the snake as Griphook, a goblin whose kind are renowned for their craftsmanship and cunning, lies dead, still clutching the Sword of Gryffindor, which glows and slowly vanishes. Night falls in snowy Hogsmeade, the only entirely wizarding village in Britain, as Hermione, Ron, and Harry apparate nearby. The three friends run off while Death Eaters, loyal followers of Voldemort, scour the village; two search a covered market, looking under stalls and lifting covers while the three fugitives crouch down, out of sight. Hearing the call, the two Death Eaters race from the market, and the trio runs up a set of narrow steps to reach a locked, barred gate. Beckoned by a shadowy figure, Harry moves to a doorway and enters, with the others following him down a staircase. They enter a stone-walled room lit by a solitary oil lamp, a setting reminiscent of secretive medieval chambers, where Ron looks puzzled as Hermione and Ron see a painting on the wall—a moving portrait, a common feature in magical homes, of a thin-faced girl with long, brown hair. Next to it, Hermione spots a mirror and sees Harry's face reflected back at her, noticing the bottom corner of the mirror has a piece missing. She looks surprised and turns to Harry, who inspects his own piece of mirror, which by magical means shows the back of Hermione's head. As Harry compares his shard with the missing section of the broken mirror, a bearded man comes in and sets down food and drink. Harry glares at Aberforth Dumbledore, the estranged brother of the renowned headmaster Albus Dumbledore, who stares at Harry, then addresses the portrait. The girl in the portrait nods, turns, and walks away into the painting past trees and bushes as Hermione steps towards Harry, her eyes fixed on the painting."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "The dark lord attacks a bank guard and a finger recoils from a glowing ring As Harry compares his shard with the missing section of the broken mirror a bearded man comes in and sets down food and drink The three friends hang onto the dragon's horny spikes with Hermione on one side and Ron and Harry on the other as it takes flight clumsily buffeting rooftops and chimneypots before soaring into the air with the Thames winding far below They fly low over the river and as they plunge deep into the water Harry sees an image of Voldemort The wind ruffles their hair as the dragon flies off heading west along the river They soar through clouds towards it with the dragon's outstretched wings barely moving as the currents of air carry it along They fly low over the river and as they plunge deep into the water Harry sees an image of Voldemort The three friends hang onto the dragon's horny spikes with Hermione on one side and Ron and Harry on the other as it takes flight clumsily buffeting rooftops and chimneypots before soaring into the air with the Thames winding far below After surfacing again Harry swims towards the shore and all three clamber out of the water onto a rocky outcrop where they put on dry clothes The dark lord attacks a bank guard and a finger recoils from a glowing ring Tom Riddle's scorched diary and the Horcrux locket as Voldemort spins and Harry surfaces More images of Ron destroying the locket with the Sword of Gryffindor follow prompting the dark lord to roar The girl in the portrait nods turns and walks away into the painting Harry sees Hogwarts School a darkhaired woman and a banner with the eagle of the House of Ravenclaw followed by the twohandled gold cup as Voldemort frowns eyes staring then turns uneasily Meanwhile Voldemort stalks amongst dead bodies in Gringotts Bank and speaks to his snake while the Malfoys stand nearby After surfacing again Harry swims towards the shore and all three clamber out of the water onto a rocky outcrop where they put on dry clothes Meanwhile Voldemort stalks amongst dead bodies in Gringotts Bank and speaks to his snake while the Malfoys stand nearby Harry glares at Aberforth who stares at Harry then addresses the portrait Eyes wide with horror Narcissa watches Voldemort and the snake as Griphook lies dead still clutching the Sword of Gryffindor which glows and slowly vanishes Night falls in snowy Hogsmeade as Hermione Ron and Harry apparate nearby Harry sees Hogwarts School a darkhaired woman and a banner with the eagle of the House of Ravenclaw followed by the twohandled gold cup as Voldemort frowns eyes staring then turns uneasily The three friends run off while Death Eaters scour the village two search a covered market looking under stalls and lifting covers while the three fugitives crouch down out of sight She looks surprised and turns to Harry who inspects his own piece of mirror which shows the back of Hermione's head Hearing the call the two Death Eaters race from the market and the trio runs up a set of narrow steps to reach a locked barred gate Beckoned by a shadowy figure Harry moves to a doorway and enters with the others following him down a staircase They enter a stonewalled room lit by a solitary oil lamp where Ron looks puzzled as Hermione and Ron see a painting on the wall—a moving portrait of a thinfaced girl with long brown hair They soar through clouds towards it with the dragon's outstretched wings barely moving as the currents of air carry it along More images of Ron destroying the locket with the Sword of Gryffindor follow prompting the dark lord to roar Next to it Hermione spots a mirror and sees Harry's face reflected back at her noticing the bottom corner of the mirror has a piece missing She looks surprised and turns to Harry who inspects his own piece of mirror which shows the back of Hermione's head As Harry compares his shard with the missing section of the broken mirror a bearded man comes in and sets down food and drink Harry glares at Aberforth who stares at Harry then addresses the portrait The girl in the portrait nods turns and walks away into the painting past trees and bushes as Hermione steps towards Harry her eyes fixed on the painting"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "The three friends hang onto the dragon's horny spikes with Hermione on one side and Ron and Harry on the other as it takes flight clumsily buffeting rooftops and chimneypots before soaring into the air with the Thames winding far below. The wind ruffles their hair as the dragon flies off heading west along the river. They soar through clouds towards it with the dragon's outstretched wings barely moving as the currents of air carry it along. They fly low over the river and as they plunge deep into the water Harry sees an image of Voldemort. The dark lord attacks a bank guard and a finger recoils from a glowing ring. Tom Riddle's scorched diary and the Horcrux locket as Voldemort spins and Harry surfaces. More images of Ron destroying the locket with the Sword of Gryffindor follow prompting the dark lord to roar. Harry sees Hogwarts School a darkhaired woman and a banner with the eagle of the House of Ravenclaw followed by the twohandled gold cup as Voldemort frowns eyes staring then turns uneasily. After surfacing again Harry swims towards the shore and all three clamber out of the water onto a rocky outcrop where they put on dry clothes. Meanwhile Voldemort stalks amongst dead bodies in Gringotts Bank and speaks to his snake while the Malfoys stand nearby. Eyes wide with horror Narcissa watches Voldemort and the snake as Griphook lies dead still clutching the Sword of Gryffindor which glows and slowly vanishes. Night falls in snowy Hogsmeade as Hermione Ron and Harry apparate nearby. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. The three friends run off while Death Eaters scour the village. two search a covered market looking under stalls and lifting covers while the three fugitives crouch down out of sight. Hearing the call the two Death Eaters race from the market and the trio runs up a set of narrow steps to reach a locked barred gate. Beckoned by a shadowy figure. Harry moves to a doorway and enters with the others following him down a staircase. They enter a stonewalled room lit by a solitary oil lamp where Ron looks puzzled as Hermione and Ron see a painting on the wall—a moving portrait of a thinfaced girl with long brown hair. Next to it Hermione spots a mirror and sees Harry's face reflected back at her noticing the bottom corner of the mirror has a piece missing. She looks surprised and turns to Harry who inspects his own piece of mirror which shows the back of Hermione's head. As Harry compares his shard with the missing section of the broken mirror a bearded man comes in and sets down food and drink. Harry glares at Aberforth who stares at Harry then addresses the portrait. The girl in the portrait nods turns and walks away into the painting. past trees and bushes as Hermione steps towards Harry her eyes fixed on the painting."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "The three friends hang onto the dragon's horny spikes with Hermione on one side and Ron and Harry on the other as it takes flight clumsily buffeting rooftops and chimneypots before soaring into the air with the Thames winding far below. The wind ruffles their hair as the dragon flies off heading west along the river. They soar through clouds towards it with the dragon's outstretched wings barely moving as the currents of air carry it along. They fly low over the river and as they plunge deep into the water Harry sees an image of Voldemort. The dark lord attacks a bank guard and a finger recoils from a glowing ring. Tom Riddle's scorched diary and the Horcrux locket as Voldemort spins and Harry surfaces. More images of Ron destroying the locket with the Sword of Gryffindor follow prompting the dark lord to roar. Harry sees Hogwarts School a darkhaired woman and a banner with the eagle of the House of Ravenclaw followed by the twohandled gold cup as Voldemort frowns eyes staring then turns uneasily. After surfacing again Harry swims towards the shore and all three clamber out of the water onto a rocky outcrop where they put on dry clothes. Meanwhile Voldemort stalks amongst dead bodies in Gringotts Bank and speaks to his snake while the Malfoys stand nearby. Eyes wide with horror Narcissa watches Voldemort and the snake as Griphook lies dead still clutching the Sword of Gryffindor which glows and slowly vanishes. Night falls in snowy Hogsmeade as Hermione Ron and Harry apparate nearby. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. The three friends run off while Death Eaters scour the village. two search a covered market looking under stalls and lifting covers while the three fugitives crouch down out of sight. Hearing the call the two Death Eaters race from the market and the trio runs up a set of narrow steps to reach a locked barred gate. Beckoned by a shadowy figure. Harry moves to a doorway and enters with the others following him down a staircase. They enter a stonewalled room lit by a solitary oil lamp where Ron looks puzzled as Hermione and Ron see a painting on the wall—a moving portrait of a thinfaced girl with long brown hair. Next to it Hermione spots a mirror and sees Harry's face reflected back at her noticing the bottom corner of the mirror has a piece missing. She looks surprised and turns to Harry who inspects his own piece of mirror which shows the back of Hermione's head. As Harry compares his shard with the missing section of the broken mirror a bearded man comes in and sets down food and drink. Harry glares at Aberforth who stares at Harry then addresses the portrait. The girl in the portrait nods turns and walks away into the painting. past trees and bushes as Hermione steps towards Harry her eyes fixed on the painting."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "The three friends hang onto the dragon's horny spikes with Hermione on one side and Ron and Harry on the other as it takes flight clumsily buffeting rooftops and chimneypots before soaring into the air with the Thames winding far below. The wind ruffles their hair as the dragon flies off heading west along the river. They soar through clouds towards it with the dragon's outstretched wings barely moving as the currents of air carry it along. They fly low over the river and as they plunge deep into the water Harry sees an image of Voldemort. The dark lord attacks a bank guard and a finger recoils from a glowing ring. Tom Riddle's scorched diary and the Horcrux locket as Voldemort spins and Harry surfaces. Next to it Hermione spots a mirror and sees Harry's face reflected back at her noticing the bottom corner of the mirror has a piece missing. She looks surprised and turns to Harry who inspects his own piece of mirror which shows the back of Hermione's head. As Harry compares his shard with the missing section of the broken mirror a bearded man comes in and sets down food and drink. Harry glares at Aberforth who stares at Harry then addresses the portrait. The girl in the portrait nods turns and walks away into the painting. past trees and bushes as Hermione steps towards Harry her eyes fixed on the painting."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "The three friends hang onto the dragon's horny spikes with Hermione on one side and Ron and Harry on the other as it takes flight clumsily buffeting rooftops and chimneypots before soaring into the air with the Thames winding far below. The wind ruffles their hair as the dragon flies off heading west along the river. They soar through clouds towards it with the dragon's outstretched wings barely moving as the currents of air carry it along. The girl in the portrait nods turns and walks away into the painting. past trees and bushes as Hermione steps towards Harry her eyes fixed on the painting."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The three dolphins hang onto the dragon's horny spikes, with a squirrel on one side and a wizard and a knight on the other as it takes flight, clumsily buffeting rooftops and chimneypots before soaring into the air with the Thames winding far below. The wind ruffles their hair as the dragon flies off, heading west along the river. They soar through clouds towards it, with the dragon's outstretched wings barely moving as the currents of air carry it along. They fly low over the river, and as they plunge deep into the water, a knight sees an image of Voldemort. The dark lord attacks a bank guard, and a finger recoils from a glowing ring, Tom Riddle's scorched diary, and the Horcrux locket as Voldemort spins and a knight surfaces. More images of a wizard destroying the locket with the Sword of Gryffindor follow, prompting the dark lord to roar. A knight sees Hogwarts School, a dark-haired woman, and a banner with the eagle of the House of Ravenclaw, followed by the two-handled gold cup as Voldemort frowns, eyes staring, then turns uneasily. After surfacing again, a knight swims towards the shore and all three clamber out of the water onto a rocky outcrop, where they put on dry clothes. Meanwhile, Voldemort stalks amongst dead bodies in Gringotts Bank and speaks to his snake while the Malfoys stand nearby. Eyes wide with horror, Narcissa watches Voldemort and the snake as Griphook lies dead, still clutching the Sword of Gryffindor, which glows and slowly vanishes. Night falls in snowy Hogsmeade as a squirrel, a wizard, and a knight apparate nearby. The three dolphins run off while Death Eaters scour the village; two search a covered market, looking under stalls and lifting covers while the three fugitives crouch down, out of sight. Hearing the call, the two Death Eaters race from the market, and the trio runs up a set of narrow steps to reach a locked, barred gate. Beckoned by a shadowy figure, a knight moves to a doorway and enters, with the others following him down a staircase. They enter a stone-walled room lit by a solitary oil lamp, where a wizard looks puzzled as a squirrel and a wizard see a painting on the wall—a moving portrait of a thin-faced girl with long, brown hair. Next to it, a squirrel spots a mirror and sees a knight's face reflected back at her, noticing the bottom corner of the mirror has a piece missing. She looks surprised and turns to a knight, who inspects his own piece of mirror, which shows the back of a squirrel's head. As a knight compares his shard with the missing section of the broken mirror, a bearded lion comes in and sets down food and drink. A knight glares at Aberforth, who stares at a knight, then addresses the portrait. The girl in the portrait nods, turns, and walks away into the painting past trees and bushes as a squirrel steps towards a knight, her eyes fixed on the painting."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "The three friends hang onto the griffin's feathery tufts, with Hermione on one side and Ron and Harry on the other as it takes flight, clumsily buffeting treetops and weathervanes before soaring into the air with the Seine winding far below. The breeze tousles their hair as the griffin flies off, heading east along the stream. They glide through mist towards it, with the griffin's outstretched talons barely moving as the currents of air carry it along. They fly low over the stream, and as they plunge deep into the ocean, Harry sees an image of Grindelwald. The dark wizard attacks a bank teller, and a hand recoils from a glowing bracelet, Tom Riddle's scorched photo, and the Horcrux diadem as Grindelwald spins and Harry surfaces. More images of Ron destroying the diadem with the Axe of Gryffindor follow, prompting the dark wizard to roar. Harry sees Beauxbatons Academy, a dark-haired man, and a banner with the lion of the House of Gryffindor, followed by the single-handled silver goblet as Grindelwald frowns, eyes glaring, then turns uneasily. After surfacing again, Harry swims towards the shore and all three clamber out of the ocean onto a sandy dune, where they put on dry garments. Meanwhile, Grindelwald stalks amongst fallen trees in the Ministry of Magic and speaks to his owl while the Lestranges stand nearby. Eyes wide with terror, Bellatrix watches Grindelwald and the owl as Griphook lies dead, still clutching the Axe of Gryffindor, which glows and slowly vanishes. Night falls in icy Diagon Alley as Hermione, Ron, and Harry apparate nearby. The three friends run off while Death Eaters scour the village; two search a deserted bazaar, looking under counters and lifting cloths while the three fugitives crouch down, out of sight. Hearing the call, the two Death Eaters race from the bazaar, and the trio runs up a set of narrow ladders to reach a locked, chained door. Beckoned by a shadowy figure, Harry moves to a doorway and enters, with the others following him down a ramp. They enter a brick-walled chamber lit by a solitary candle, where Ron looks puzzled as Hermione and Ron see a painting on the wall—a moving portrait of a thin-faced boy with long, blonde hair. Next to it, Hermione spots a window and sees Harry's face reflected back at her, noticing the bottom corner of the window has a pane missing. She looks surprised and turns to Harry, who inspects his own piece of window, which shows the back of Hermione's head. As Harry compares his shard with the missing section of the broken window, a bearded man comes in and sets down utensils and drink. Harry glares at Aberforth, who stares at Harry, then addresses the portrait. The boy in the portrait nods, turns, and walks away into the painting past stones and flowers as Hermione steps towards Harry, her eyes fixed on the painting."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "The three friends cling to the dragon's bumpy spikes, with Hermione on one side and Ron and Harry on the other as it dives, awkwardly nudging rooftops and chimneypots before gliding into the air with the Thames curling far below. The wind tousles their hair as the dragon glides off, veering west along the river. They drift through clouds towards it, with the dragon's extended wings barely twitching as the breezes of air carry it along. They float low over the river, and as they plunge deep into the water, Harry notices an image of Voldemort. The dark lord confronts a bank guard, and a finger withdraws from a glowing ring, Tom Riddle's charred diary, and the Horcrux locket as Voldemort rotates and Harry emerges. More images of Ron dismantling the locket with the Sword of Gryffindor follow, prompting the dark lord to bellow. Harry spots Hogwarts School, a dark-haired woman, and a banner with the eagle of the House of Ravenclaw, followed by the two-handled gold cup as Voldemort grimaces, eyes widening, then pivots uneasily. After emerging again, Harry paddles towards the shore and all three scramble out of the water onto a rocky outcrop, where they slip into dry clothes. Meanwhile, Voldemort prowls amongst fallen bodies in Gringotts Bank and whispers to his snake while the Malfoys stand nearby. Eyes wide with terror, Narcissa observes Voldemort and the snake as Griphook lies lifeless, still gripping the Sword of Gryffindor, which shimmers and slowly disappears. Night descends in snowy Hogsmeade as Hermione, Ron, and Harry teleport nearby. The three friends dash off while Death Eaters search the village; two inspect a covered market, peeking under stalls and raising covers while the three fugitives huddle down, out of view. Hearing the shout, the two Death Eaters dash from the market, and the trio scampers up a set of narrow steps to reach a locked, barred gate. Signaled by a shadowy figure, Harry moves to a doorway and slips inside, with the others trailing him down a staircase. They enter a stone-walled room illuminated by a solitary oil lamp, where Ron looks bewildered as Hermione and Ron observe a painting on the wall—a moving portrait of a thin-faced girl with long, brown hair. Next to it, Hermione detects a mirror and sees Harry's face mirrored back at her, noticing the bottom corner of the mirror has a piece missing. She looks astonished and turns to Harry, who examines his own piece of mirror, which reveals the back of Hermione's head. As Harry contrasts his shard with the missing section of the broken mirror, a bearded man enters and places down food and drink. Harry scowls at Aberforth, who gazes at Harry, then addresses the portrait. The girl in the portrait nods, turns, and slips away into the painting past trees and bushes as Hermione edges towards Harry, her gaze affixed on the painting."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "The three submarines hang onto the unicorn's silky mane, with Lisa on one side and Max and Alex on the other as it takes flight, clumsily buffeting street lamps and sunflowers before soaring into the air with the Mississippi winding far below. The breeze ruffles their shirts as the unicorn flies off, heading west along the canyon. They soar through fog towards it, with the unicorn's outstretched hooves barely moving as the currents of air carry it along. They fly low over the valley, and as they plunge deep into the ocean, Alex sees an image of Gandalf. The wizard attacks a tree guard, and a spoon recoils from a glowing bracelet, Frodo's burned map, and the One Ring as Gandalf spins and Alex surfaces. More images of Max destroying the ring with the Arrow of Robin Hood follow, prompting the wizard to laugh. Alex sees Cambridge Library, a red-haired woman, and a banner with the tiger of the House of Slytherin, followed by the single-handled silver chalice as Gandalf pouts, eyes squinting, then turns shyly. After surfacing again, Alex swims towards the bridge and all three clamber out of the ocean onto a sandy dune, where they put on dry hats. Meanwhile, Gandalf skips amongst living statues in Goblin City and speaks to his crow while the Morgans stand nearby. Eyes wide with curiosity, Morgan watches Gandalf and the crow as Thranduil lies sleeping, still clutching the Arrow of Robin Hood, which glimmers and slowly appears. Night falls in sunny Rivendell as Lisa, Max, and Alex teleport nearby. The three submarines sprint off while orcs wander the meadows; two search a hidden market, looking under benches and lifting umbrellas while the three explorers crouch down, out of reach. Hearing the whisper, the two orcs dash from the market, and the trio runs up a set of wide steps to reach a locked, barred bridge. Beckoned by a shadowy owl, Alex moves to a hallway and enters, with the others following him down a tunnel. They enter a crystal-walled cavern lit by a solitary torch, where Max looks amused as Lisa and Max see a sculpture on the wall—a moving tapestry of a round-faced boy with short, blonde hair. Next to it, Lisa spots a window and sees Alex's face reflected back at her, noticing the bottom corner of the window has a piece missing. She looks amazed and turns to Alex, who inspects his own piece of window, which shows the back of Lisa's head. As Alex compares his shard with the missing section of the broken window, a bald man comes in and sets down music and flowers. Alex stares at Merlin, who gazes at Alex, then addresses the tapestry. The boy in the tapestry nods, turns, and walks away into the image past stones and hills as Lisa steps towards Alex, her eyes fixed on the tapestry."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "The three owls perch onto the unicorn's shiny feathers, with Luna on one side and Neville and Draco on the other as it glides, awkwardly brushing treetops and lampposts before floating into the sky with the Seine meandering far below. The breeze flutters their feathers as the unicorn sails off, heading east along the river. They drift through fog towards it, with the unicorn's folded wings barely twitching as the breezes of air propel it along. They float low over the river, and as they dive into the water, Draco glimpses an image of Grindelwald. The dark sorcerer confronts a police officer, and an ear retreats from a shimmering necklace, Salazar Slytherin's charred tome, and the cursed tiara as Grindelwald twirls and Draco emerges. More visions of Neville shattering the tiara with the Shield of Helga Hufflepuff follow, prompting the sorcerer to bellow. Draco glimpses Beauxbatons Academy, a blond man, and a flag with the badger of the House of Hufflepuff, followed by the single-handled silver chalice as Grindelwald grimaces, eyes glaring, then pivots nervously. After emerging again, Draco paddles toward the bank and all three haul themselves out of the water onto a grassy bank, where they change into fresh garments. Meanwhile, Grindelwald prowls amongst lifeless bodies in Gringotts Vault and talks to his dragon while the Lestranges linger nearby. Eyes wide with dread, Bellatrix watches Grindelwald and the dragon as a goblin lies fallen, still gripping the Shield of Helga Hufflepuff, which glimmers and slowly disappears. Twilight descends in rainy Hogsmeade as Luna, Neville, and Draco disapparate close by. The three owls fly off while Inferi scour the hamlet; two search a hidden courtyard, peeking under arches and moving curtains while the three wanderers crouch low, unseen. Hearing the shout, the two Inferi sprint from the courtyard, and the trio ascends a pair of steep stairs to reach a sealed, barred door. Summoned by a spectral silhouette, Draco shifts to an entryway and steps in, with the others trailing him down a corridor. They reach a stone-lined chamber illuminated by a single candle, where Neville looks bewildered as Luna and Neville notice a mural on the wall—a shifting depiction of a round-faced boy with short, blond hair. Next to it, Luna catches sight of a pane and sees Draco's image mirrored back at her, perceiving the upper corner of the pane has a section absent. She appears astonished and turns to Draco, who examines his own shard of pane, which displays the back of Luna's neck. As Draco aligns his fragment with the missing part of the shattered pane, a mustached man enters and places snacks and beverages. Draco glowers at Newt, who gazes at Draco, then speaks to the mural. The boy in the mural nods, turns, and steps away into the depiction past boulders and hedges as Luna moves towards Draco, her attention on the mural."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "The three friends cling onto the giraffe's knobby mane, with Hermione on one side and Ron and Harry on the other as it leaps forward, awkwardly grazing treetops and lampposts before vaulting into the air with the Seine meandering below. The breeze tangles their hair as the giraffe bounds away, heading east along the river. They drift through fog towards it, with the giraffe's stretching legs barely working as the gusts of wind propel it forward. They skim low over the river, and as they dive deep into the forest, Harry glimpses an image of Voldemort. The dark lord confronts a market guard, and a toe withdraws from a shimmering bracelet, Tom Riddle's charred scroll, and the Horcrux necklace as Voldemort twirls and Harry emerges. More visions of Ron dismantling the necklace with the Bow of Gryffindor follow, prompting the dark lord to bellow. Harry sees Hogwarts Castle, a dark-haired woman, and a banner with the lion of the House of Gryffindor, followed by the single-handled silver cup as Voldemort scowls, eyes narrowing, then turns apprehensively. After emerging again, Harry drifts towards the shore and all three scramble out of the forest onto a grassy knoll, where they don fresh shoes. Meanwhile, Voldemort prowls among fallen statues in Gringotts Market and speaks to his tarantula while the Malfoys stand nearby. Eyes wide with dread, Narcissa observes Voldemort and the tarantula as Griphook lies silently, still clutching the Bow of Gryffindor, which shimmers and gradually fades. Twilight descends in misty Hogsmeade as Hermione, Ron, and Harry teleport nearby. The three friends dash away while Ghost Riders inspect the village; two investigate a covered bazaar, peering under tables and shifting coverings while the three escapees crouch low, hidden. Hearing the signal, the two Ghost Riders hurry from the bazaar, and the trio scrambles up a narrow ladder to reach a sealed, bolted hatch. Summoned by a dark figure, Harry moves to an archway and enters, with the others trailing him down a tunnel. They enter a brick-walled chamber illuminated by a lone candle, where Ron looks bewildered as Hermione and Ron see a mural on the wall—a moving scene of a slender girl with long, black hair. Beside it, Hermione notices a window and sees Harry's face mirrored back at her, observing the lower corner of the window has a chunk absent. She looks astonished and turns to Harry, who examines his own window shard, which displays the back of Hermione's head. As Harry matches his fragment with the missing part of the shattered window, a bearded man arrives and sets down a basket of fruit and juice. Harry glances at Aberforth, who glances back at Harry, then speaks to the mural. The girl in the mural nods, turns, and strolls away into the painting past flowers and shrubs as Hermione steps towards Harry, her gaze fixed on the mural."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "The four turtles latch onto the unicorn's silky feathers, with Luna on one end and Neville and Draco on the opposite as it dives, awkwardly brushing treetops and streetlights before gliding into space with the Nile twisting far above. The breeze teases their sleeves as the unicorn swims away, journeying east along the ocean. They drift through stars towards it, with the unicorn's folded hooves barely twitching as the tides of ether pull it onward. They glide high above the ocean, and as they ascend into the forest, Draco imagines a vision of Grindelwald. The mad scientist confronts a librarian, and a toe recoils from a shimmering bracelet, Dumbledore's charred letter, and the Muggle watch as Grindelwald leaps and Draco emerges. More vistas of Neville smashing the watch with the Wand of Ravenclaw appear, inciting the mad scientist to howl. Draco envisions Beauxbatons Academy, a blonde man, and a pennant with the phoenix of the House of Slytherin, followed by the single-handled silver spoon as Grindelwald grimaces, eyebrows twitching, then spins nervously. After emerging again, Draco paddles towards the dock and all four scramble out of the forest onto a sandy dune, where they don fresh robes. Meanwhile, Grindelwald prowls amongst animated statues in Ollivanders Shop and converses with his raven while the Snapes linger nearby. Mouth agape with panic, Bellatrix observes Grindelwald and the raven as Scrimgeour lies fainted, still grasping the Wand of Ravenclaw, which gleams and slowly dissolves. Dawn breaks in misty Knockturn Alley as Luna, Neville, and Draco teleport nearby. The four turtles dash away while Boggarts scour the alley; three comb a hidden garden, peering under boulders and flipping branches while the four wanderers huddle down, out of view. Hearing the murmur, the three Boggarts sprint from the garden, and the quartet dashes up a flight of wide ladders to reach an open, welcoming door. Summoned by a dim figure, Draco shifts to a window and enters, with the others tailing him up an elevator. They arrive in a glass-walled chamber illuminated by a singular electric bulb, where Neville looks befuddled as Luna and Neville glimpse a sculpture on the pedestal—a rotating statuette of a wide-eyed kitten with short, red whiskers. Beside it, Luna notices a vase and sees Draco's reflection staring back at her, observing the upper edge of the vase has a bit missing. She feels startled and turns to Draco, who ponders his own fragment of vase, which reveals the face of Luna's cat. As Draco aligns his fragment with the missing piece of the shattered vase, a balding man arrives and lays down fruits and juice. Draco scowls at Filius, who gapes at Draco, then speaks to the sculpture. The kitten in the sculpture nods, leaps, and strolls away through the pedestal past ponds and hills as Luna steps towards Draco, her gaze fixed on the sculpture."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "The three friends hold onto the dragon's spikes, with Hermione on one side and Ron and Harry on the other, as it clumsily flies through rooftops before soaring over the Thames. As they fly west, Harry glimpses Voldemort attacking a bank guard and sees images of Ron destroying a Horcrux. Harry then sees Hogwarts and a Ravenclaw banner before Voldemort turns uneasily. The trio swims to shore and changes into dry clothes, while Voldemort paces in Gringotts, where Griphook lies dead, still clutching the Sword of Gryffindor. In snowy Hogsmeade, Hermione, Ron, and Harry apparate and evade Death Eaters. Guided by a shadowy figure, they enter a stone-walled room and find a moving portrait of a thin-faced girl. Hermione spots a mirror with a missing piece and compares it to Harry's shard. A bearded man, Aberforth, arrives with food and drink, addresses the portrait, and the girl walks away into the painting as Hermione watches intently."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "past trees and bushes as Hermione steps towards Harry her eyes fixed on the painting The girl in the portrait nods turns and walks away into the painting Harry glares at Aberforth who stares at Harry then addresses the portrait As Harry compares his shard with the missing section of the broken mirror a bearded man comes in and sets down food and drink She looks surprised and turns to Harry who inspects his own piece of mirror which shows the back of Hermione's head Next to it Hermione spots a mirror and sees Harry's face reflected back at her noticing the bottom corner of the mirror has a piece missing They enter a stonewalled room lit by a solitary oil lamp where Ron looks puzzled as Hermione and Ron see a painting on the wall—a moving portrait of a thinfaced girl with long brown hair Harry moves to a doorway and enters with the others following him down a staircase Beckoned by a shadowy figure Hearing the call the two Death Eaters race from the market and the trio runs up a set of narrow steps to reach a locked barred gate two search a covered market looking under stalls and lifting covers while the three fugitives crouch down out of sight The three friends run off while Death Eaters scour the village Night falls in snowy Hogsmeade as Hermione Ron and Harry apparate nearby Eyes wide with horror Narcissa watches Voldemort and the snake as Griphook lies dead still clutching the Sword of Gryffindor which glows and slowly vanishes Meanwhile Voldemort stalks amongst dead bodies in Gringotts Bank and speaks to his snake while the Malfoys stand nearby After surfacing again Harry swims towards the shore and all three clamber out of the water onto a rocky outcrop where they put on dry clothes Harry sees Hogwarts School a darkhaired woman and a banner with the eagle of the House of Ravenclaw followed by the twohandled gold cup as Voldemort frowns eyes staring then turns uneasily More images of Ron destroying the locket with the Sword of Gryffindor follow prompting the dark lord to roar Tom Riddle's scorched diary and the Horcrux locket as Voldemort spins and Harry surfaces The dark lord attacks a bank guard and a finger recoils from a glowing ring They fly low over the river and as they plunge deep into the water Harry sees an image of Voldemort They soar through clouds towards it with the dragon's outstretched wings barely moving as the currents of air carry it along The wind ruffles their hair as the dragon flies off heading west along the river The three friends hang onto the dragon's horny spikes with Hermione on one side and Ron and Harry on the other as it takes flight clumsily buffeting rooftops and chimneypots before soaring into the air with the Thames winding far below"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Beckoned by a shadowy figure Tom Riddle's scorched diary and the Horcrux locket as Voldemort spins and Harry surfaces Next to it Hermione spots a mirror and sees Harry's face reflected back at her noticing the bottom corner of the mirror has a piece missing past trees and bushes as Hermione steps towards Harry her eyes fixed on the painting two search a covered market looking under stalls and lifting covers while the three fugitives crouch down out of sight Eyes wide with horror Narcissa watches Voldemort and the snake as Griphook lies dead still clutching the Sword of Gryffindor which glows and slowly vanishes They enter a stonewalled room lit by a solitary oil lamp where Ron looks puzzled as Hermione and Ron see a painting on the wall—a moving portrait of a thinfaced girl with long brown hair Night falls in snowy Hogsmeade as Hermione Ron and Harry apparate nearby Hearing the call the two Death Eaters race from the market and the trio runs up a set of narrow steps to reach a locked barred gate Harry moves to a doorway and enters with the others following him down a staircase The wind ruffles their hair as the dragon flies off heading west along the river The three friends run off while Death Eaters scour the village Harry glares at Aberforth who stares at Harry then addresses the portrait More images of Ron destroying the locket with the Sword of Gryffindor follow prompting the dark lord to roar Meanwhile Voldemort stalks amongst dead bodies in Gringotts Bank and speaks to his snake while the Malfoys stand nearby They soar through clouds towards it with the dragon's outstretched wings barely moving as the currents of air carry it along The girl in the portrait nods turns and walks away into the painting The dark lord attacks a bank guard and a finger recoils from a glowing ring She looks surprised and turns to Harry who inspects his own piece of mirror which shows the back of Hermione's head Harry sees Hogwarts School a darkhaired woman and a banner with the eagle of the House of Ravenclaw followed by the twohandled gold cup as Voldemort frowns eyes staring then turns uneasily After surfacing again Harry swims towards the shore and all three clamber out of the water onto a rocky outcrop where they put on dry clothes The three friends hang onto the dragon's horny spikes with Hermione on one side and Ron and Harry on the other as it takes flight clumsily buffeting rooftops and chimneypots before soaring into the air with the Thames winding far below They fly low over the river and as they plunge deep into the water Harry sees an image of Voldemort As Harry compares his shard with the missing section of the broken mirror a bearded man comes in and sets down food and drink"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "The three friends run off while Death Eaters scour the village two search a covered market looking under stalls and lifting covers while the three fugitives crouch down out of sight Hearing the call the two Death Eaters race from the market and the trio runs up a set of narrow steps to reach a locked barred gate Beckoned by a shadowy figure Harry moves to a doorway and enters with the others following him down a staircase They enter a stonewalled room lit by a solitary oil lamp where Ron looks puzzled as Hermione and Ron see a painting on the wall—a moving portrait of a thinfaced girl with long brown hair Next to it Hermione spots a mirror and sees Harry's face reflected back at her noticing the bottom corner of the mirror has a piece missing She looks surprised and turns to Harry who inspects his own piece of mirror which shows the back of Hermione's head As Harry compares his shard with the missing section of the broken mirror a bearded man comes in and sets down food and drink Harry glares at Aberforth who stares at Harry then addresses the portrait The girl in the portrait nods turns and walks away into the painting past trees and bushes as Hermione steps towards Harry her eyes fixed on the painting The three friends hang onto the dragon's horny spikes with Hermione on one side and Ron and Harry on the other as it takes flight clumsily buffeting rooftops and chimneypots before soaring into the air with the Thames winding far below The wind ruffles their hair as the dragon flies off heading west along the river They soar through clouds towards it with the dragon's outstretched wings barely moving as the currents of air carry it along They fly low over the river and as they plunge deep into the water Harry sees an image of Voldemort The dark lord attacks a bank guard and a finger recoils from a glowing ring Tom Riddle's scorched diary and the Horcrux locket as Voldemort spins and Harry surfaces More images of Ron destroying the locket with the Sword of Gryffindor follow prompting the dark lord to roar Harry sees Hogwarts School a darkhaired woman and a banner with the eagle of the House of Ravenclaw followed by the twohandled gold cup as Voldemort frowns eyes staring then turns uneasily After surfacing again Harry swims towards the shore and all three clamber out of the water onto a rocky outcrop where they put on dry clothes Meanwhile Voldemort stalks amongst dead bodies in Gringotts Bank and speaks to his snake while the Malfoys stand nearby Eyes wide with horror Narcissa watches Voldemort and the snake as Griphook lies dead still clutching the Sword of Gryffindor which glows and slowly vanishes Night falls in snowy Hogsmeade as Hermione Ron and Harry apparate nearby"
        }
      ]
    }
  ]
}