{
  "ground_truth": "He tries to turn it off, but his fingers are still clotted with sleep. In a series of frustrated grunts and groans, he becomes more and more aggravated until, finally, one final scream and it's out of his system. He finds one last bottle in his hand, half-full with a cigarette butt floating in it. He downs the beer and steps into the adjoining bathroom to brush his teeth. Willie’s walk brings him to a fancy eatery at lunchtime. As he passes, he casually snatches a handful of car keys from the parking valet key-box and moves on. As he rounds the corner into the lot, he pushes on the various key fobs, identifying various cars when their alarms chirp. He seems dissatisfied until a brand new Cadillac chirps. Willie gets in and drives off. Willie drives. He reaches over into the glove compartment and pulls out the registration. He focuses on the car owner's address. In long shot, through the open door of an extravagant marble bathroom, we see Willie sitting on the toilet, leafing through a magazine, beer bottle on the counter next to him, pants around his ankles. Willie, standing by the toilet, finishes buckling his belt and flips the flush lever. Willie, looking down into the toilet, gives the lever a couple more clanking tries and then grabs his beer and ambles off. Sucking on his beer, Willie paces the periphery of the room, methodically knocking painting after painting off the walls. Willie arrives in the bedroom still knocking down paintings until, finally, he exposes a wall safe. A smile, and he pulls out a stethoscope. The safe door swings open to reveal stacks of cash. Willie scratches a lottery ticket. He's now wearing a Rolex and some gaudy ring. As she exits, he activates the machine. Willie skips to the next message. Through the heat ripples rising off the pavement, two mirage-like figures cross the infinite asphalt of the Saguaro Square Mall parking lot—Willie and Marcus in Santa and Elf regalia, sweating and panting in the heat. Willie polishes off a pint of Smirnoff's and flips it towards a nearby trash can. He pulls some Tic Tacs out of his pocket. Harrison stomps away and right toward Marcus and Willie as they enter the store. Willie and Marcus stop in their tracks and watch the burly man storm out. Bob Chipeska watches with them. A Beautiful Girl wearing skin-tight pants walks by, catching Willie’s eye. He stares wantonly at her ass, off in his own little world. Willie's reaction worries Marcus. Marcus pantomimes helpless laughter, noiselessly throwing his head back and holding his gut as it heaves with mirth. He is instantly composed.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "He attempts to deactivate it, but his digits are still encrusted with slumber. In a sequence of exasperated grunts and groans, he becomes increasingly annoyed until, eventually, one ultimate scream and it's out of his system. He discovers one final bottle in his grasp, half-filled with a cigarette butt drifting in it. He consumes the brew and steps into the adjoining washroom to clean his teeth. Willie’s stroll brings him to a fancy diner at midday. As he passes, he casually snatches a fistful of car keys from the parking valet key-box and progresses onward. As he rounds the bend into the lot, he presses on the different key fobs, identifying various vehicles when their alarms chirp. He seems displeased until a brand new Cadillac chirps. Willie enters and drives away. Willie drives. He reaches over into the glove compartment and extracts the registration. He focuses on the car owner's address. In long shot, through the open door of an extravagant marble washroom, we observe Willie sitting on the toilet, leafing through a magazine, beer bottle on the counter next to him, trousers around his ankles. Willie, standing by the toilet, finishes buckling his belt and flips the flush lever. Willie, looking down into the toilet, gives the lever a couple more clanking attempts and then grabs his beer and ambles away. Sucking on his beer, Willie paces the perimeter of the room, methodically knocking artwork after artwork off the walls. Willie arrives in the bedroom still knocking down paintings until, ultimately, he uncovers a wall safe. A grin, and he extracts a stethoscope. The safe door swings open to reveal piles of cash. Willie scratches a lottery ticket. He's now wearing a Rolex and some garish ring. As she exits, he activates the machine. Willie skips to the next message. Through the heat ripples rising off the pavement, two mirage-like figures cross the endless asphalt of the Saguaro Square Mall parking lot—Willie and Marcus in Santa and Elf attire, sweating and panting in the heat. Willie finishes a pint of Smirnoff's and flips it towards a nearby trash can. He pulls some Tic Tacs out of his pocket. Harrison stomps away and right toward Marcus and Willie as they enter the store. Willie and Marcus halt in their tracks and watch the burly man storm out. Bob Chipeska observes with them. A Beautiful Girl wearing skin-tight trousers walks by, catching Willie’s eye. He stares lustfully at her rear, off in his own little world. Willie's reaction worries Marcus. Marcus pantomimes helpless laughter, noiselessly throwing his head back and holding his gut as it heaves with mirth. He is instantly composed."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "He tries to turn it off, but sleep still keeps his fingers clotted. In a series of frustrated grunts and groans, he becomes more and more aggravated until, finally, one final scream lets him get it out of his system. One last bottle is found in his hand, half-full with a cigarette butt floating in it. The beer is downed by him, and he steps into the adjoining bathroom to brush his teeth. Willie’s walk brings him to a fancy eatery at lunchtime. As he passes, a handful of car keys is casually snatched by him from the parking valet key-box, and he moves on. As the corner is rounded into the lot, the various key fobs are pushed by him, identifying various cars when their alarms chirp. Dissatisfaction seems to be his mood until a brand new Cadillac chirps. Willie gets in and drives off. Willie drives. The registration is pulled out by him from the glove compartment when he reaches over. The car owner's address is focused on by him. In long shot, through the open door of an extravagant marble bathroom, Willie is seen sitting on the toilet, leafing through a magazine, beer bottle on the counter next to him, pants around his ankles. Willie, standing by the toilet, finishes buckling his belt and flips the flush lever. Willie, looking down into the toilet, gives the lever a couple more clanking tries and then grabs his beer and ambles off. Sucking on his beer, Willie paces the periphery of the room, methodically knocking painting after painting off the walls. The bedroom is arrived at by Willie, still knocking down paintings until, finally, a wall safe is exposed by him. A smile, and a stethoscope is pulled out by him. The stacks of cash are revealed when the safe door swings open. A lottery ticket is scratched by Willie. A Rolex and some gaudy ring are now worn by him. As the machine is activated by him, she exits. The next message is skipped to by Willie. Through the heat ripples rising off the pavement, two mirage-like figures cross the infinite asphalt of the Saguaro Square Mall parking lot—Willie and Marcus in Santa and Elf regalia, sweating and panting in the heat. A pint of Smirnoff's is polished off by Willie, and it is flipped towards a nearby trash can. Some Tic Tacs are pulled out of his pocket by him. Harrison stomps away and right toward Marcus and Willie as they enter the store. Willie and Marcus stop in their tracks and watch the burly man storm out. Bob Chipeska watches with them. A Beautiful Girl wearing skin-tight pants walks by, catching Willie’s eye. Her ass is stared at wantonly by him, off in his own little world. Marcus is worried by Willie's reaction. Helpless laughter is pantomimed by Marcus, noiselessly throwing his head back and holding his gut as it heaves with mirth. He is instantly composed."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "He tries to turn it off, but his fingers are still clumsy with sleep. Frustrated grunts and groans escalate until a final scream releases his tension. He finds a half-full bottle with a cigarette butt, drinks it, and heads to the bathroom to brush his teeth. Willie walks to a fancy eatery at lunchtime, casually snatches car keys from the valet box, and tests them until a new Cadillac chirps. He drives off, retrieves the registration from the glove compartment, and notes the owner's address. In a marble bathroom, Willie sits on the toilet, reading a magazine with a beer nearby. After buckling his belt, he tries to flush, grabs his beer, and ambles off. Sipping his beer, Willie knocks paintings off the walls until he reveals a wall safe. Smiling, he uses a stethoscope to open it, revealing stacks of cash. Willie scratches a lottery ticket, now wearing a Rolex and a gaudy ring. As he exits, he activates the machine and skips to the next message. Through heat ripples, Willie and Marcus, dressed as Santa and Elf, cross the Saguaro Square Mall parking lot, sweating. Willie finishes a pint of Smirnoff's, tosses it, and takes out Tic Tacs. Harrison stomps toward Marcus and Willie as they enter the store, stopping in their tracks to watch a burly man storm out. Bob Chipeska watches with them. A Beautiful Girl in tight pants catches Willie's eye, and he stares wantonly, lost in thought. Marcus, worried, pantomimes laughter, then instantly composes himself."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "He tries to turn it off, but his fingers are clumsy with sleep. Frustrated grunts escalate to a final scream, releasing his tension. He finds a half-full bottle with a cigarette butt, drinks it, and heads to the bathroom to brush his teeth. Willie walks to a fancy eatery, snatches car keys from the valet box, and tests them until a Cadillac chirps. He drives off, checks the registration for the owner's address, and later sits on a toilet, reading a magazine with a beer nearby. After flushing, he paces the room, knocking paintings off the walls until he finds a wall safe. Smiling, he uses a stethoscope to open it, revealing cash. Willie scratches a lottery ticket, now wearing a Rolex and ring. As he exits, he activates the machine. Willie and Marcus, in Santa and Elf outfits, cross the Saguaro Square Mall parking lot, sweating. Willie finishes a pint of Smirnoff's, tosses it, and takes Tic Tacs. Harrison storms toward Marcus and Willie as they enter the store, stopping them. Bob Chipeska watches. A Beautiful Girl in tight pants catches Willie's eye, and he stares, worrying Marcus. Marcus pantomimes laughter, then composes himself."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "He makes an attempt to turn it off, but his fingers are still heavy and clumsy, clotted with the remnants of sleep. With a series of frustrated grunts and groans, he becomes increasingly aggravated, his irritation building until, finally, with one final scream, he releases it all, and it's out of his system. He discovers one last bottle in his hand, half-full with a cigarette butt floating in the liquid. He downs the remaining beer and steps into the adjoining bathroom to brush his teeth. Willie’s walk eventually brings him to a fancy eatery right around lunchtime. As he passes by, he casually snatches a handful of car keys from the parking valet key-box and continues on his way. As he rounds the corner into the parking lot, he begins to push on the various key fobs, identifying different cars as their alarms chirp in response. He seems dissatisfied with his options until a brand new Cadillac chirps. Willie gets in and drives off without hesitation. As he drives, he reaches over into the glove compartment and pulls out the car's registration. He focuses intently on the car owner's address. In a long shot, through the open door of an extravagant marble bathroom, we see Willie sitting on the toilet, leafing through a magazine, a beer bottle resting on the counter next to him, his pants around his ankles. Willie, now standing by the toilet, finishes buckling his belt and flips the flush lever. Looking down into the toilet, he gives the lever a couple more clanking tries and then grabs his beer, ambling off. Sucking on his beer, Willie paces the periphery of the room, methodically knocking painting after painting off the walls. Willie arrives in the bedroom, still knocking down paintings until, finally, he exposes a wall safe. A smile spreads across his face, and he pulls out a stethoscope. The safe door swings open to reveal stacks of cash. Willie scratches a lottery ticket, now adorned with a Rolex and some gaudy ring. As he exits, he activates the machine. Willie skips to the next message. Through the heat ripples rising off the pavement, two mirage-like figures cross the seemingly infinite asphalt of the Saguaro Square Mall parking lot—Willie and Marcus, dressed in Santa and Elf regalia, sweating and panting in the oppressive heat. Willie polishes off a pint of Smirnoff's and flips it towards a nearby trash can. He pulls some Tic Tacs out of his pocket. Harrison stomps away, heading directly toward Marcus and Willie as they enter the store. Willie and Marcus stop in their tracks, watching the burly man storm out. Bob Chipeska watches alongside them. A Beautiful Girl, wearing skin-tight pants, walks by, catching Willie’s eye. He stares wantonly at her ass, lost in his own little world. Willie's reaction worries Marcus. Marcus pantomimes helpless laughter, noiselessly throwing his head back and holding his gut as it heaves with mirth. He is instantly composed once more."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "He makes a somewhat clumsy attempt to turn it off, but his fingers remain uncooperative, weighted down and awkward due to the lingering fog of sleep. With a series of frustrated grunts and groans reflecting his growing annoyance, he feels his irritation mounting steadily. Finally, with one last primal scream, he unleashes his pent-up frustration, and just like that, it's out of his system. In his hand, he discovers one remaining bottle, half-full with a cigarette butt bobbing in the liquid. Without hesitation, he downs the remaining contents of the beer and strides into the adjoining bathroom to brush his teeth.\n\nWillie's meandering walk eventually brings him to an upscale eatery just as lunchtime approaches. In a swift motion as he passes by, he casually grabs a handful of car keys from the parking valet's key-box and continues on his way. As he rounds the corner into the parking lot area, he begins to press various key fobs, identifying different cars as their alarms chirp in response to his prodding. He seems unimpressed with his options until a brand new Cadillac emits a satisfying chirp. Without a moment's pause, Willie slides into the driver's seat and drives off confidently. As he maneuvers the car, he reaches over with one hand to open the glove compartment, pulling out the car's registration to focus intently on the car owner's address.\n\nIn a long shot revealing the grandeur of an opulent marble bathroom, we catch a glimpse of Willie seated on the toilet, nonchalantly flipping through a magazine, while a beer bottle rests on the counter beside him and his pants hang around his ankles. Now standing by the toilet, Willie finishes buckling his belt, flipping the flush lever with a practiced motion. He looks down into the toilet and gives the lever a few more clanking tries before grabbing his beer and ambling off. Sipping on his beer, Willie paces the periphery of the room, methodically knocking painting after painting off the walls. As he enters the bedroom, he continues his deliberate destruction, knocking down paintings until he finally exposes a wall safe hidden beneath. A grin spreads across his face as he pulls out a stethoscope. The safe door swings open, revealing stacks upon stacks of cash. Willie scratches a lottery ticket, now accessorized with a flashy Rolex and a gaudy ring adorning his finger. As he makes his exit, he activates the machine. Without missing a beat, Willie skips to the next message.\n\nThrough the shimmering heat ripples rising off the pavement, two seemingly mirage-like figures are seen crossing the endless expanse of the Saguaro Square Mall parking lot—Willie and Marcus, donned in Santa and Elf costumes, both sweating and panting heavily under the oppressive heat. Willie polishes off a pint of Smirnoff's vodka and carelessly flips the empty bottle towards a nearby trash can. He then retrieves some Tic Tacs from his pocket. Harrison stomps away angrily, heading directly towards Marcus and Willie as they make their way into the store. Willie and Marcus abruptly halt in their tracks, watching the burly man as he furiously storms out. Bob Chipeska stands by, observing the scene alongside them. A Beautiful Girl walks by, her skin-tight pants catching Willie's attention. He gazes wantonly after her, completely captivated and lost in his own little world. Willie's reaction visibly concerns Marcus. In response, Marcus pantomimes silent laughter, noiselessly throwing his head back while holding his gut as it heaves with mirth, only to regain his composure almost instantly."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "He attempts to turn off the alarm, but his fingers, still heavy with the remnants of sleep, fumble clumsily over the buttons. With each failed attempt, his frustration mounts, expressed through a series of grunts and groans that grow increasingly aggravated. Finally, he releases a final scream, expelling the pent-up irritation from his system. In his hand, he discovers one last bottle, half-full, with a cigarette butt floating inside. Without hesitation, he downs the remaining beer and makes his way into the adjoining bathroom to brush his teeth. As lunchtime approaches, Willie finds himself walking towards a fancy eatery. As he passes by, he nonchalantly reaches out and snatches a handful of car keys from the parking valet key-box, continuing on his way. Rounding the corner into the parking lot, he methodically presses the buttons on the various key fobs, listening for the chirps that identify the cars. He seems dissatisfied with the options until a brand new Cadillac responds with a chirp. Satisfied, Willie gets in and drives off. While driving, he reaches over to the glove compartment, pulls out the registration, and focuses intently on the car owner's address. In a long shot, through the open door of an extravagant marble bathroom, Willie is seen sitting on the toilet, casually leafing through a magazine, a beer bottle resting on the counter next to him, his pants pooled around his ankles. Standing by the toilet, he finishes buckling his belt and flips the flush lever. As he looks down into the toilet, he gives the lever a couple more clanking tries, then grabs his beer and ambles off. Sipping on his beer, Willie paces the room's periphery, methodically knocking painting after painting off the walls. He continues this until he reaches the bedroom, still knocking down paintings, until he finally reveals a wall safe. A smile spreads across his face as he pulls out a stethoscope. The safe door swings open, revealing stacks of cash. Willie scratches a lottery ticket, now adorned with a Rolex and a gaudy ring. As she exits, he activates the machine and skips to the next message. Through the heat ripples rising off the pavement, two mirage-like figures, Willie and Marcus, cross the seemingly infinite asphalt of the Saguaro Square Mall parking lot, dressed in Santa and Elf regalia, sweating and panting in the oppressive heat. Willie finishes off a pint of Smirnoff's and casually flips the empty bottle towards a nearby trash can. He retrieves some Tic Tacs from his pocket. Harrison stomps away, heading directly toward Marcus and Willie as they enter the store. Willie and Marcus halt in their tracks, watching the burly man storm out, with Bob Chipeska observing alongside them. A Beautiful Girl, wearing skin-tight pants, walks by, capturing Willie's attention. He stares wantonly at her, lost in his own little world, which causes concern for Marcus. In response, Marcus pantomimes helpless laughter, noiselessly throwing his head back and clutching his gut as if it heaves with mirth, before instantly regaining his composure."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "He struggles to turn off the alarm, his fingers sluggish with sleep, and vents his frustration with a final scream. Finding a half-full beer bottle with a cigarette butt, he drinks it before heading to the bathroom to brush his teeth. At lunchtime, Willie casually swipes a set of car keys from a valet box at a fancy eatery and tests them in the parking lot until a new Cadillac responds. He drives off, checking the registration for the owner's address. Later, in an opulent marble bathroom, Willie sits on the toilet, reading a magazine with a beer nearby. After attempting to flush, he grabs his beer and wanders off, knocking paintings off the walls until he reveals a wall safe. Smiling, he uses a stethoscope to open it, revealing stacks of cash. Now adorned with a Rolex and a gaudy ring, he scratches a lottery ticket. As he exits, he activates a machine and skips to the next message. In the heat of the Saguaro Square Mall parking lot, Willie and Marcus, dressed as Santa and an Elf, cross the asphalt, sweating. Willie finishes a pint of Smirnoff's, tossing it towards a trash can, and pops some Tic Tacs. They pause as a burly man storms out of a store, catching the attention of Bob Chipeska. A Beautiful Girl in tight pants walks by, capturing Willie's attention, which worries Marcus. Marcus feigns laughter, quickly regaining his composure."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "He tries to turn it off, but his fingers are still clotted with sleep, feeling the remnants of his restless night. In a series of frustrated grunts and groans, reminiscent of a symphony of morning struggle, he becomes more and more aggravated until, finally, one final scream and it's out of his system. He finds one last bottle in his hand, half-full with a cigarette butt floating in it, the remnants of last night's party. He downs the beer, its bittersweet taste lingering, and steps into the adjoining bathroom, a small space with pale ceramic tiles, to brush his teeth. Willie’s walk brings him to a fancy eatery at lunchtime, known for its five-star cuisine that attracts a well-heeled clientele. As he passes, he casually snatches a handful of car keys from the parking valet key-box, a casual theft that suggests practice, and moves on. As he rounds the corner into the lot, he pushes on the various key fobs, identifying various cars when their alarms chirp, a cacophony of technology responding to his touch. He seems dissatisfied until a brand new Cadillac chirps, a symbol of luxury and success. Willie gets in and drives off, blending into the stream of traffic. Willie drives through the city streets. He reaches over into the glove compartment and pulls out the registration, a document that verifies the car belongs to someone else. He focuses on the car owner's address, committing it to memory with a practiced glance. In long shot, through the open door of an extravagant marble bathroom, we see Willie sitting on the toilet, leafing through a magazine, beer bottle on the counter next to him, pants around his ankles, in stark contrast to his luxurious surroundings. Willie, standing by the toilet, finishes buckling his belt and flips the flush lever, an everyday action in an extraordinary setting. Willie, looking down into the toilet, gives the lever a couple more clanking tries, frustratedly attempting to fix the problem, and then grabs his beer and ambles off. Sucking on his beer, Willie paces the periphery of the room, methodically knocking painting after painting off the walls, each falling canvas revealing more of the room's hidden secrets. Willie arrives in the bedroom still knocking down paintings until, finally, he exposes a wall safe, concealed by art, a testament to the owner's wealth. A smile, and he pulls out a stethoscope, a burglar's tool for cracking safes. The safe door swings open to reveal stacks of cash, the ultimate reward for his efforts. Willie scratches a lottery ticket, a mundane habit amid the illicit riches. He's now wearing a Rolex and some gaudy ring, flashy symbols of instant wealth. As she exits, he activates the machine, setting events in motion with a simple gesture. Willie skips to the next message, listening for essential information. Through the heat ripples rising off the pavement, two mirage-like figures cross the infinite asphalt of the Saguaro Square Mall parking lot—Willie and Marcus in Santa and Elf regalia, sweating and panting in the heat typical of this desert region. Willie polishes off a pint of Smirnoff's, the vodka burning his throat, and flips it towards a nearby trash can. He pulls some Tic Tacs out of his pocket, masking the alcohol's scent. Harrison stomps away, his mood darkened, and right toward Marcus and Willie as they enter the store. Willie and Marcus stop in their tracks and watch the burly man storm out, sensing the tension in the air. Bob Chipeska watches with them, his expression a mix of curiosity and concern. A Beautiful Girl wearing skin-tight pants walks by, the style drawing attention, catching Willie’s eye. He stares wantonly at her ass, off in his own little world, his thoughts wandering. Willie's reaction worries Marcus, whose instincts tell him this could cause trouble. Marcus pantomimes helpless laughter, noiselessly throwing his head back and holding his gut as it heaves with mirth, a silent mockery that belies his own concerns. He is instantly composed, masking his true feelings with an ease born of experience."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "He tries to turn it off but his fingers are still clotted with sleep  He downs the beer and steps into the adjoining bathroom to brush his teeth  Willie’s walk brings him to a fancy eatery at lunchtime  As he passes he casually snatches a handful of car keys from the parking valet keybox and moves on  As he rounds the corner into the lot he pushes on the various key fobs identifying various cars when their alarms chirp  He seems dissatisfied until a brand new Cadillac chirps  Willie gets in and drives off  Willie drives  He reaches over into the glove compartment and pulls out the registration  He focuses on the car owner's address  In long shot through the open door of an extravagant marble bathroom we see Willie sitting on the toilet leafing through a magazine beer bottle on the counter next to him pants around his ankles  Willie standing by the toilet finishes buckling his belt and flips the flush lever  Willie looking down into the toilet gives the lever a couple more clanking tries and then grabs his beer and ambles off  Sucking on his beer  Willie paces the periphery of the room methodically knocking painting after painting off the walls  Willie arrives in the bedroom still knocking down paintings until finally he exposes a wall safe  A smile and he pulls out a stethoscope  The safe door swings open to reveal stacks of cash  Willie scratches a lottery ticket  In a series of frustrated grunts and groans he becomes more and more aggravated until finally one final scream and it's out of his system  He finds one last bottle in his hand halffull with a cigarette butt floating in it  He downs the beer and steps into the adjoining bathroom to brush his teeth  Willie’s walk brings him to a fancy eatery at lunchtime  As he passes he casually snatches a handful of car keys from the parking valet keybox and moves on  As he rounds the corner into the lot he pushes on the various key fobs identifying various cars when their alarms chirp  He seems dissatisfied until a brand new Cadillac chirps  Willie gets in and drives off  Willie drives  He reaches over into the glove compartment and pulls out the registration  He focuses on the car owner's address  In long shot through the open door of an extravagant marble bathroom we see Willie sitting on the toilet leafing through a magazine beer bottle on the counter next to him pants around his ankles  Willie standing by the toilet finishes buckling his belt and flips the flush lever  Willie looking down into the toilet gives the lever a couple more clanking tries and then grabs his beer and ambles off  Sucking on his beer  Willie paces the periphery of the room methodically knocking painting after painting off the walls  Willie arrives in the bedroom still knocking down paintings until finally he exposes a wall safe  A smile and he pulls out a stethoscope  The safe door swings open to reveal stacks of cash  Willie scratches a lottery ticket  He's now wearing a Rolex and some gaudy ring  As she exits he activates the machine  Willie skips to the next message  Through the heat ripples rising off the pavement  two miragelike figures cross the infinite asphalt of the Saguaro Square Mall parking lot—Willie and Marcus in Santa and Elf regalia sweating and panting in the heat  Willie polishes off a pint of Smirnoff's and flips it towards a nearby trash can  He pulls some Tic Tacs out of his pocket  Harrison stomps away and right toward Marcus and Willie as they enter the store  Willie and Marcus stop in their tracks and watch the burly man storm out  Bob Chipeska watches with them  A Beautiful Girl wearing skintight pants walks by catching Willie’s eye  He stares wantonly at her ass off in his own little world  Willie's reaction worries Marcus  Marcus pantomimes helpless laughter noiselessly throwing his head back and holding his gut as it heaves with mirth  He is instantly composed"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "He tries to turn it off but his fingers are still clotted with sleep. In a series of frustrated grunts and groans he becomes more and more aggravated until finally one final scream and it is out of his system. He finds one last bottle in his hand halffull with a cigarette butt floating in it. He downs the beer and steps into the adjoining bathroom to brush his teeth. Willie’s walk brings him to a fancy eatery at lunchtime. As he passes he casually snatches a handful of car keys from the parking valet keybox and moves on. As he rounds the corner into the lot he pushes on the various key fobs identifying various cars when their alarms chirp. He seems dissatisfied until a brand new Cadillac chirps. Willie gets in and drives off. Willie drives. He reaches over into the glove compartment and pulls out the registration. He focuses on the car owner's address. In long shot through the open door of an extravagant marble bathroom we see Willie sitting on the toilet leafing through a magazine beer bottle on the counter next to him pants around his ankles. Willie standing by the toilet finishes buckling his belt and flips the flush lever. Willie looking down into the toilet gives the lever a couple more clanking tries and then grabs his beer and ambles off. Sucking on his beer. Willie paces the periphery of the room methodically knocking painting after painting off the walls. Willie arrives in the bedroom still knocking down paintings until finally he exposes a wall safe. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. A smile and he pulls out a stethoscope. The safe door swings open to reveal stacks of cash. Willie scratches a lottery ticket. He is now wearing a Rolex and some gaudy ring. As she exits he activates the machine. Willie skips to the next message. Through the heat ripples rising off the pavement. two miragelike figures cross the infinite asphalt of the Saguaro Square Mall parking lot—Willie and Marcus in Santa and Elf regalia sweating and panting in the heat. Willie polishes off a pint of Smirnoff's and flips it towards a nearby trash can. He pulls some Tic Tacs out of his pocket. Harrison stomps away and right toward Marcus and Willie as they enter the store. Willie and Marcus stop in their tracks and watch the burly man storm out. Bob Chipeska watches with them. A Beautiful Girl wearing skintight pants walks by catching Willie’s eye. He stares wantonly at her ass off in his own little world. Willie's reaction worries Marcus. Marcus pantomimes helpless laughter noiselessly throwing his head back and holding his gut as it heaves with mirth. He is instantly composed."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "He tries to turn it off but his fingers are still clotted with sleep. In a series of frustrated grunts and groans he becomes more and more aggravated until finally one final scream and it is out of his system. He finds one last bottle in his hand halffull with a cigarette butt floating in it. He downs the beer and steps into the adjoining bathroom to brush his teeth. Willie’s walk brings him to a fancy eatery at lunchtime. As he passes he casually snatches a handful of car keys from the parking valet keybox and moves on. As he rounds the corner into the lot he pushes on the various key fobs identifying various cars when their alarms chirp. He seems dissatisfied until a brand new Cadillac chirps. Willie gets in and drives off. Willie drives. He reaches over into the glove compartment and pulls out the registration. He focuses on the car owner's address. In long shot through the open door of an extravagant marble bathroom we see Willie sitting on the toilet leafing through a magazine beer bottle on the counter next to him pants around his ankles. Willie standing by the toilet finishes buckling his belt and flips the flush lever. Willie looking down into the toilet gives the lever a couple more clanking tries and then grabs his beer and ambles off. Sucking on his beer. Willie paces the periphery of the room methodically knocking painting after painting off the walls. Willie arrives in the bedroom still knocking down paintings until finally he exposes a wall safe. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. A smile and he pulls out a stethoscope. The safe door swings open to reveal stacks of cash. Willie scratches a lottery ticket. He is now wearing a Rolex and some gaudy ring. As she exits he activates the machine. Willie skips to the next message. Through the heat ripples rising off the pavement. two miragelike figures cross the infinite asphalt of the Saguaro Square Mall parking lot—Willie and Marcus in Santa and Elf regalia sweating and panting in the heat. Willie polishes off a pint of Smirnoff's and flips it towards a nearby trash can. He pulls some Tic Tacs out of his pocket. Harrison stomps away and right toward Marcus and Willie as they enter the store. Willie and Marcus stop in their tracks and watch the burly man storm out. Bob Chipeska watches with them. A Beautiful Girl wearing skintight pants walks by catching Willie’s eye. He stares wantonly at her ass off in his own little world. Willie's reaction worries Marcus. Marcus pantomimes helpless laughter noiselessly throwing his head back and holding his gut as it heaves with mirth. He is instantly composed."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "He tries to turn it off but his fingers are still clotted with sleep. In a series of frustrated grunts and groans he becomes more and more aggravated until finally one final scream and it is out of his system. He finds one last bottle in his hand halffull with a cigarette butt floating in it. He downs the beer and steps into the adjoining bathroom to brush his teeth. Willie’s walk brings him to a fancy eatery at lunchtime. As he passes he casually snatches a handful of car keys from the parking valet keybox and moves on. As he rounds the corner into the lot he pushes on the various key fobs identifying various cars when their alarms chirp. He seems dissatisfied until a brand new Cadillac chirps. Willie gets in and drives off. He pulls some Tic Tacs out of his pocket. Harrison stomps away and right toward Marcus and Willie as they enter the store. Willie and Marcus stop in their tracks and watch the burly man storm out. Bob Chipeska watches with them. A Beautiful Girl wearing skintight pants walks by catching Willie’s eye. He stares wantonly at her ass off in his own little world. Willie's reaction worries Marcus. Marcus pantomimes helpless laughter noiselessly throwing his head back and holding his gut as it heaves with mirth. He is instantly composed."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "He tries to turn it off but his fingers are still clotted with sleep. In a series of frustrated grunts and groans he becomes more and more aggravated until finally one final scream and it is out of his system. He finds one last bottle in his hand halffull with a cigarette butt floating in it. He downs the beer and steps into the adjoining bathroom to brush his teeth. He stares wantonly at her ass off in his own little world. Willie's reaction worries Marcus. Marcus pantomimes helpless laughter noiselessly throwing his head back and holding his gut as it heaves with mirth. He is instantly composed."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The cat tries to turn it off, but the cat's fingers are still clotted with sleep. In a series of frustrated grunts and groans, the cat becomes more and more aggravated until, finally, one final scream and it's out of the cat's system. The cat finds one last bottle in the cat's hand, half-full with a cigarette butt floating in it. The cat downs the beer and steps into the adjoining bathroom to brush the cat's teeth. The dog’s walk brings the dog to a fancy eatery at lunchtime. As the dog passes, the dog casually snatches a handful of car keys from the parking valet key-box and moves on. As the dog rounds the corner into the lot, the dog pushes on the various key fobs, identifying various cars when their alarms chirp. The dog seems dissatisfied until a brand new Cadillac chirps. The dog gets in and drives off. The dog drives. The dog reaches over into the glove compartment and pulls out the registration. The dog focuses on the car owner's address. In long shot, through the open door of an extravagant marble bathroom, we see the dog sitting on the toilet, leafing through a magazine, beer bottle on the counter next to the dog, pants around the dog’s ankles. The dog, standing by the toilet, finishes buckling the dog’s belt and flips the flush lever. The dog, looking down into the toilet, gives the lever a couple more clanking tries and then grabs the dog’s beer and ambles off. Sucking on the dog’s beer, the dog paces the periphery of the room, methodically knocking painting after painting off the walls. The dog arrives in the bedroom still knocking down paintings until, finally, the dog exposes a wall safe. A smile, and the dog pulls out a stethoscope. The safe door swings open to reveal stacks of cash. The dog scratches a lottery ticket. The dog’s now wearing a Rolex and some gaudy ring. As she exits, the dog activates the machine. The dog skips to the next message. Through the heat ripples rising off the pavement, two mirage-like figures cross the infinite asphalt of the Saguaro Square Mall parking lot—the dog and a squirrel in Santa and Elf regalia, sweating and panting in the heat. The dog polishes off a pint of Smirnoff's and flips it towards a nearby trash can. The dog pulls some Tic Tacs out of the dog’s pocket. The rabbit stomps away and right toward a squirrel and the dog as they enter the store. The dog and a squirrel stop in their tracks and watch the burly man storm out. An owl watches with them. A Beautiful Girl wearing skin-tight pants walks by, catching the dog’s eye. The dog stares wantonly at her ass, off in the dog’s own little world. The dog’s reaction worries a squirrel. A squirrel pantomimes helpless laughter, noiselessly throwing a squirrel’s head back and holding a squirrel’s gut as it heaves with mirth. A squirrel is instantly composed."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "He tries to turn it off, but his fingers are still clotted with sleep. In a series of frustrated grunts and groans, he becomes more and more aggravated until, finally, one final scream and it's out of his system. He finds one last mug in his hand, half-full with a paperclip floating in it. He downs the juice and steps into the adjoining sauna to brush his teeth. Willie’s walk brings him to a stylish salon at lunchtime. As he passes, he casually snatches a handful of wristwatches from the coat check kiosk and moves on. As he rounds the corner into the garden, he pushes on the various remote controls, identifying various gates when their buzzers sound. He seems dissatisfied until a brand new gate opens. Willie gets in and drives off. Willie drives. He reaches over into the bookcase and pulls out the atlas. He focuses on the owner's destination. In long shot, through the open door of an extravagant marble kitchen, we see Willie sitting on the stool, leafing through a cookbook, water bottle on the island next to him, apron around his waist. Willie, standing by the sink, finishes untying his apron and flips the light switch. Willie, looking down into the sink, gives the switch a couple more clicks and then grabs his water and ambles off. Sucking on his water, Willie paces the periphery of the room, methodically knocking vase after vase off the shelves. Willie arrives in the den still knocking down vases until, finally, he exposes a wall cabinet. A smile, and he pulls out a calculator. The cabinet door swings open to reveal stacks of books. Willie scratches a coupon. He's now wearing a Tag Heuer and some flashy necklace. As she exits, he activates the blender. Willie skips to the next page. Through the heat ripples rising off the pavement, two mirage-like figures cross the infinite tarmac of the Cactus Plaza Mall car park—Willie and Marcus in Doctor and Nurse costumes, sweating and panting in the heat. Willie polishes off a pint of apple juice and flips it towards a nearby recycling bin. He pulls some gum out of his pocket. Harrison stomps away and right toward Marcus and Willie as they enter the office. Willie and Marcus stop in their tracks and watch the burly man storm out. Bob Chipeska watches with them. A Beautiful Girl wearing skin-tight leggings walks by, catching Willie’s eye. He stares wantonly at her earrings, off in his own little world. Willie's reaction worries Marcus. Marcus pantomimes helpless laughter, noiselessly throwing his head back and holding his gut as it heaves with mirth. He is instantly composed."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "He attempts to adjust it, but his fingers are still tangled with sleep. In a series of restrained chuckles and giggles, he becomes more and more amused until, finally, one final laugh and it's out of his system. He discovers one last bottle in his hand, half-full with a cork floating in it. He sips the beer and steps into the adjoining bathroom to wash his hands. Willie’s stroll brings him to a fancy bookstore at lunchtime. As he passes, he casually flicks a handful of car keys from the parking valet key-box and strolls on. As he rounds the corner into the lot, he fiddles with the various key fobs, identifying various cars when their headlights flash. He seems surprised until a brand new Cadillac flashes. Willie gets in and cruises off. Willie cruises. He reaches over into the glove compartment and pulls out the registration. He glances at the car owner's address. In long shot, through the open door of an extravagant marble bathroom, we see Willie sitting on the toilet, thumbing through a magazine, beer bottle on the counter next to him, pants around his ankles. Willie, standing by the toilet, finishes adjusting his tie and taps the flush lever. Willie, looking down into the toilet, gives the lever a couple more gentle pushes and then grabs his beer and wanders off. Sipping his beer, Willie circles the periphery of the room, methodically admiring painting after painting on the walls. Willie arrives in the bedroom still admiring paintings until, finally, he locates a wall safe. A smile, and he pulls out a magnifying glass. The safe door swings open to reveal stacks of cash. Willie doodles on a lottery ticket. He's now wearing a Rolex and some gaudy ring. As she exits, he deactivates the machine. Willie skips to the next song. Through the heat ripples rising off the pavement, two mirage-like figures meander across the infinite asphalt of the Saguaro Square Mall parking lot—Willie and Marcus in Santa and Elf regalia, sweating and panting in the heat. Willie polishes off a pint of Smirnoff's and tosses it towards a nearby trash can. He extracts some Tic Tacs out of his pocket. Harrison marches toward Marcus and Willie as they exit the store. Willie and Marcus freeze in their tracks and watch the burly man march out. Bob Chipeska observes with them. A Beautiful Girl wearing skin-tight pants walks by, catching Willie’s eye. He gazes dreamily at her face, off in his own little world. Willie's reaction amuses Marcus. Marcus mimics silent applause, noiselessly throwing his hands up and holding his gut as it swells with pride. He is instantly calm."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "The lamp tries to turn it off, but its branches are still clotted with sleep. In a series of frustrated grunts and groans, the lamp becomes more and more aggravated until, finally, one final scream and it's out of its system. The lamp finds one last can in its hand, half-full with a pencil sharpener floating in it. It downs the juice and steps into the adjoining attic to brush its teeth. Julian’s stroll brings it to a rustic bakery at lunchtime. As it passes, it casually snatches a handful of headphones from the coat rack and moves on. As it rounds the corner into the alley, it pushes on the various remote controls, identifying various scooters when their alarms chirp. It seems dissatisfied until a brand new scooter chirps. Julian gets in and drives off. Julian drives. It reaches over into the glove compartment and pulls out the warranty. It focuses on the scooter owner's address. In long shot, through the open door of an extravagant metal sauna, we see Julian sitting on the ottoman, leafing through a brochure, juice can on the shelf next to it, pants around its ankles. Julian, standing by the ottoman, finishes buckling its belt and flips the flush lever. Julian, looking down into the ottoman, gives the lever a couple more clanking tries and then grabs its juice and ambles off. Sucking on its juice, Julian paces the periphery of the attic, methodically knocking vase after vase off the tables. Julian arrives in the closet still knocking down vases until, finally, it exposes a wall journal. A smile, and it pulls out a stethoscope. The journal door swings open to reveal stacks of cards. Julian scratches a bingo card. It's now wearing a necklace and some gaudy bracelet. As she exits, it activates the toaster. Julian skips to the next tune. Through the heat ripples rising off the pavement, two mirage-like figures cross the infinite asphalt of the Saguaro Square Mall parking lot—Julian and Nathan in Pirate and Mermaid regalia, sweating and panting in the heat. Julian polishes off a pint of SunnyD and flips it towards a nearby trash can. It pulls some almonds out of its pocket. Greg stomps away and right toward Nathan and Julian as they enter the market. Julian and Nathan stop in their tracks and watch the burly teapot storm out. Todd Brisket watches with them. A Lovely Statue wearing skin-tight scarves walks by, catching Julian’s eye. It stares wantonly at its hat, off in its own little world. Julian's reaction worries Nathan. Nathan pantomimes helpless laughter, noiselessly throwing its head back and holding its gut as it heaves with mirth. It is instantly composed."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "The cat tries to ignite it on, but its paws are still woven with curiosity. In a series of delighted purrs and chirps, it becomes more and more content until, finally, one final meow and it's out of its system. The cat locates one last feather in its paw, half-buried with a cotton ball perched in it. It devours the milk and dances into the adjoining kitchen to wash its paws. Timmy’s hop brings him to a vibrant library at dinnertime. As he glides by, he casually pockets a handful of quills from the scribe's table and prances on. As he spins the bend into the hall, he presses on the various quill ends, staining various parchments when their inks splatter. He seems jubilant until a fresh scroll unrolls. Timmy leaps in and scribbles away. Timmy writes. He reaches over into the satchel and extracts the map. He fixates on the hidden treasure's directions. In full view, through the open door of an opulent jade library, we see Timmy perched on a stool, leafing through a novel, teacup on the desk next to him, shawl around his shoulders. Timmy, standing by the desk, finishes uncurling his scarf and flips the switch. Timmy, peering down into the bookcase, gives the switch a couple more flickering tries and then grabs his tea and ambles away. Sipping on his tea, Timmy circles the perimeter of the room, methodically turning picture after picture around on the walls. Timmy steps into the hallway still spinning pictures until, finally, he reveals a hidden panel. A grin, and he extracts a magnifying glass. The panel slides aside to reveal ancient scrolls. Timmy solves a puzzle cube. He's now sporting a monocle and some ornate brooch. As she enters, he deactivates the lamp. Timmy dances to the latest tune. Through the misty waves rising off the pond, two shadow-like figures drift across the infinite gardens of the Magnolia Square Estate—Timmy and Lucy in magician and fairy attire, twinkling and fluttering in the breeze. Timmy nibbles on a slice of Brie and tosses it towards a nearby bird feeder. He plucks some peppermints out of his satchel. Oliver gallops away and directly toward Lucy and Timmy as they explore the garden. Timmy and Lucy freeze in their tracks and observe the spry pony trot out. Marie Cane watches alongside them. A Graceful Swan in golden feathers glides by, catching Timmy’s gaze. He watches dreamily at its wings, lost in his own little reverie. Timmy's reaction amuses Lucy. Lucy mimics joyous dancing, silently swaying her head and clutching her sides as she trembles with glee. She is promptly calm."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "He attempts to ignite it, but his hands are still tangled with lethargy. In a series of amused chuckles and snickers, he becomes more and more delighted until, finally, one last giggle and it's out of his mind. He discovers one last shoe in his hand, half-filled with a pencil sharpener floating in it. He sips the milk and strolls into the adjoining kitchen to wash his face. Willie’s wander brings him to a stylish boutique at dinnertime. As he passes, he casually grabs a handful of napkins from the front desk basket and moves on. As he circles the corner into the lot, he presses on the various remotes, identifying various bicycles when their bells ring. He seems uninterested until a brand new skateboard whistles. Willie hops on and rolls away. Willie coasts. He reaches over into the back pocket and pulls out a map. He focuses on the address of the map's owner. In long shot, through the open window of a lavish glass library, we see Willie reclining on the chaise, flipping through a comic book, milk jug on the table next to him, socks around his ankles. Willie, standing by the chaise, finishes tying his shoelaces and flips the page. Willie, looking down into the comic book, gives the page a couple more noisy turns and then grabs his milk and struts away. Sipping on his milk, Willie strolls the perimeter of the hall, methodically yanking coat after coat off the hangers. Willie arrives in the study still pulling down coats until, finally, he uncovers a wall painting. A grin, and he retrieves a telescope. The painting swings open to reveal rows of books. Willie scratches his head. He's now wearing a sun hat and some vibrant scarf. As she leaves, he deactivates the light. Willie dances to the following sound. Through the steam ripples rising off the stove, two ghostly figures waltz through the endless flooring of the Blue Lagoon Bookstore—Willie and Marcus in chef and baker attire, shivering and chattering in the chill. Willie finishes off a carton of juice and tosses it toward a nearby bin. He pulls some crayons out of his bag. Harrison rushes toward and right past Marcus and Willie as they exit the room. Willie and Marcus pause in their paths and watch the robust woman dash away. Bob Chipeska observes with them. A Beautiful Girl wearing flowing skirts walks by, catching Willie’s attention. He stares dreamily at her shoes, off in his own little universe. Willie's reaction concerns Marcus. Marcus mimics helpless applause, silently clapping his hands and doubling over as his chest shakes with joy. He is instantly calm."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "The cat attempts to activate it, but its paws are still tangled with dreams. In a series of contented purrs and snores, the feline becomes more and more soothed until, finally, one final yawn and it's out of its fur. The cat discovers one last feather in its paw, half-buried with a leaf floating beside it. It gulps the milk and prances into the neighboring pantry to groom its whiskers. Benny’s trot guides him to an opulent library at dawn. As he wanders, he absentmindedly grabs a handful of book spines from the librarian’s shelf and strolls on. As he turns the bend into the stacks, he taps on the various book spines, identifying various novels when their titles illuminate. He seems uninterested until a rare manuscript lights up. Benny enters and flies off. Benny sails. He reaches over into the desk drawer and extracts the map. He gazes at the treasure location’s coordinates. In full view, through the open window of a grand mahogany study, we observe Benny perched on the armchair, skimming through a cookbook, milk cup on the desk beside him, scarf draped around his shoulders. Benny, standing by the desk, finishes knotting his tie and closes the book. Benny, gazing into the bookcase, gives the shelf a couple more dusty scans and then nabs his milk and strolls away. Sipping his milk, Benny circles the perimeter of the hall, systematically toppling vase after vase onto the floor. Benny enters the library still toppling vases until, finally, he reveals a secret compartment. A grin, and he pulls out a magnifying glass. The compartment door swings open to reveal layers of parchment. Benny traces a crossword puzzle. He's now wielding a monocle and some intricate pin. As it departs, he deactivates the apparatus. Benny leaps to the following tale. Through the mist waves floating off the meadow, two ghostly figures traverse the endless green of the Clover Patch Park field—Benny and Oliver in Pirate and Parrot costumes, shivering and shuffling in the cold. Benny finishes off a flask of cranberry juice and tosses it towards a nearby recycling bin. He extracts some gumdrops from his satchel. Jonathan stomps away and left toward Oliver and Benny as they exit the arboretum. Benny and Oliver freeze in their paths and observe the slim figure glide in. Sarah Maloney observes alongside them. A Graceful Dancer wearing flowing skirts twirls by, stealing Benny’s attention. He gazes dreamily at her twirls, lost in his own little universe. Benny's gaze unnerves Oliver. Oliver mimics silent chuckling, noiselessly rolling his eyes back and clutching his sides as his shoulders quiver with delight. He is suddenly composed."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Willie, struggling to wake up, downs a beer and brushes his teeth. He steals car keys from a valet box, selecting a new Cadillac to drive off. He finds the owner’s address and later sits casually drinking and rifling through the homeowner's belongings. Willie exposes a wall safe behind paintings, using a stethoscope to open it and discovers cash. Sporting a Rolex and ring, he scratches a lottery ticket. Later, Willie and Marcus, dressed as Santa and an elf, cross a mall parking lot in the heat. Willie drinks Smirnoff's and watches a Beautiful Girl, which worries Marcus. Marcus pretends to laugh silently, then composes himself."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "He is instantly composed Marcus pantomimes helpless laughter noiselessly throwing his head back and holding his gut as it heaves with mirth  Willie's reaction worries Marcus  He stares wantonly at her ass off in his own little world  A Beautiful Girl wearing skintight pants walks by catching Willie’s eye  Bob Chipeska watches with them  Willie and Marcus stop in their tracks and watch the burly man storm out  Harrison stomps away and right toward Marcus and Willie as they enter the store  He pulls some Tic Tacs out of his pocket  Willie polishes off a pint of Smirnoff's and flips it towards a nearby trash can  two miragelike figures cross the infinite asphalt of the Saguaro Square Mall parking lot—Willie and Marcus in Santa and Elf regalia sweating and panting in the heat  Through the heat ripples rising off the pavement  Willie skips to the next message  As she exits he activates the machine  He's now wearing a Rolex and some gaudy ring  Willie scratches a lottery ticket  The safe door swings open to reveal stacks of cash  A smile and he pulls out a stethoscope  Willie arrives in the bedroom still knocking down paintings until finally he exposes a wall safe  Willie paces the periphery of the room methodically knocking painting after painting off the walls  Sucking on his beer  Willie looking down into the toilet gives the lever a couple more clanking tries and then grabs his beer and ambles off  Willie standing by the toilet finishes buckling his belt and flips the flush lever  In long shot through the open door of an extravagant marble bathroom we see Willie sitting on the toilet leafing through a magazine beer bottle on the counter next to him pants around his ankles  He focuses on the car owner's address  He reaches over into the glove compartment and pulls out the registration  Willie drives  Willie gets in and drives off  He seems dissatisfied until a brand new Cadillac chirps  As he rounds the corner into the lot he pushes on the various key fobs identifying various cars when their alarms chirp  As he passes he casually snatches a handful of car keys from the parking valet keybox and moves on  Willie’s walk brings him to a fancy eatery at lunchtime  He downs the beer and steps into the adjoining bathroom to brush his teeth  He finds one last bottle in his hand halffull with a cigarette butt floating in it  In a series of frustrated grunts and groans he becomes more and more aggravated until finally one final scream and it's out of his system  He tries to turn it off but his fingers are still clotted with sleep "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Sucking on his beer  A Beautiful Girl wearing skintight pants walks by catching Willie’s eye  As he rounds the corner into the lot he pushes on the various key fobs identifying various cars when their alarms chirp  Willie polishes off a pint of Smirnoff's and flips it towards a nearby trash can  He seems dissatisfied until a brand new Cadillac chirps  As she exits he activates the machine  He tries to turn it off but his fingers are still clotted with sleep  A smile and he pulls out a stethoscope  Willie paces the periphery of the room methodically knocking painting after painting off the walls  As he passes he casually snatches a handful of car keys from the parking valet keybox and moves on  He stares wantonly at her ass off in his own little world  Harrison stomps away and right toward Marcus and Willie as they enter the store  Willie’s walk brings him to a fancy eatery at lunchtime  Willie scratches a lottery ticket  Marcus pantomimes helpless laughter noiselessly throwing his head back and holding his gut as it heaves with mirth  two miragelike figures cross the infinite asphalt of the Saguaro Square Mall parking lot—Willie and Marcus in Santa and Elf regalia sweating and panting in the heat  Willie and Marcus stop in their tracks and watch the burly man storm out  Willie's reaction worries Marcus  Willie looking down into the toilet gives the lever a couple more clanking tries and then grabs his beer and ambles off  In a series of frustrated grunts and groans he becomes more and more aggravated until finally one final scream and it's out of his system  Willie gets in and drives off  The safe door swings open to reveal stacks of cash  Willie skips to the next message  He focuses on the car owner's address  He is instantly composed In long shot through the open door of an extravagant marble bathroom we see Willie sitting on the toilet leafing through a magazine beer bottle on the counter next to him pants around his ankles  He finds one last bottle in his hand halffull with a cigarette butt floating in it  He downs the beer and steps into the adjoining bathroom to brush his teeth  He reaches over into the glove compartment and pulls out the registration  Through the heat ripples rising off the pavement  Bob Chipeska watches with them  Willie standing by the toilet finishes buckling his belt and flips the flush lever  Willie drives  Willie arrives in the bedroom still knocking down paintings until finally he exposes a wall safe  He's now wearing a Rolex and some gaudy ring  He pulls some Tic Tacs out of his pocket "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "A smile and he pulls out a stethoscope  The safe door swings open to reveal stacks of cash  Willie scratches a lottery ticket  He's now wearing a Rolex and some gaudy ring  As she exits he activates the machine  Willie skips to the next message  Through the heat ripples rising off the pavement  two miragelike figures cross the infinite asphalt of the Saguaro Square Mall parking lot—Willie and Marcus in Santa and Elf regalia sweating and panting in the heat  Willie polishes off a pint of Smirnoff's and flips it towards a nearby trash can  He pulls some Tic Tacs out of his pocket  Harrison stomps away and right toward Marcus and Willie as they enter the store  Willie and Marcus stop in their tracks and watch the burly man storm out  Bob Chipeska watches with them  A Beautiful Girl wearing skintight pants walks by catching Willie’s eye  He stares wantonly at her ass off in his own little world  Willie's reaction worries Marcus  Marcus pantomimes helpless laughter noiselessly throwing his head back and holding his gut as it heaves with mirth  He is instantly composed He tries to turn it off but his fingers are still clotted with sleep  In a series of frustrated grunts and groans he becomes more and more aggravated until finally one final scream and it's out of his system  He finds one last bottle in his hand halffull with a cigarette butt floating in it  He downs the beer and steps into the adjoining bathroom to brush his teeth  Willie’s walk brings him to a fancy eatery at lunchtime  As he passes he casually snatches a handful of car keys from the parking valet keybox and moves on  As he rounds the corner into the lot he pushes on the various key fobs identifying various cars when their alarms chirp  He seems dissatisfied until a brand new Cadillac chirps  Willie gets in and drives off  Willie drives  He reaches over into the glove compartment and pulls out the registration  He focuses on the car owner's address  In long shot through the open door of an extravagant marble bathroom we see Willie sitting on the toilet leafing through a magazine beer bottle on the counter next to him pants around his ankles  Willie standing by the toilet finishes buckling his belt and flips the flush lever  Willie looking down into the toilet gives the lever a couple more clanking tries and then grabs his beer and ambles off  Sucking on his beer  Willie paces the periphery of the room methodically knocking painting after painting off the walls  Willie arrives in the bedroom still knocking down paintings until finally he exposes a wall safe "
        }
      ]
    }
  ]
}