{
  "ground_truth": "Gin attaches the cables, then leans down to Gin. Behind Jesse, in Men's Wear, is Lois, wearing a frown of pruney disapproval, and, seeing that he's not looking, she inexplicably nudges a table of sweaters a few feet over, which makes a loud SQUEEEEEEEAK, but it's too chaotic on the floor for anyone to notice. Satisfied with her placement of the table, Lois heads out the door. Willie cracks open an ampule of Amyl Nitrate and inhales deeply, and Marcus grimaces. Jesse heads for the alarm panel near the doorway and punches the key labeled ARM, triggering an LED readout labeled ARMING to count down from 30 seconds. Marcus arrives at the vent above the surveillance room, reaches in his pocket, pulls out the remote control Lois bought, and aims it down into the room, causing the huge bank of VCRs to power down. Marcus arrives at the precipice of a descending duct as Willie stares at the safe and continues to stare, licking his lips. Meanwhile, Marcus emerges from a stockroom with a cart to begin his shopping spree, starting in Ladies' Accessories, finding the cashmere scarf, while Willie applies a stethoscope to the safe, tapping with one hand and listening intently. Marcus moves to Evening Wear, jumping to try to pull a stole off a mannequin. Willie applies and then pulls back a drill from the safe, batters a chisel into the seam of the safe door, and is atop the safe, swinging a sledgehammer at the lock. Marcus keeps leaping at the mannequin, swings at its knees with a golf club, and, having chopped it down, drags off its stole. Willie uses a plasma welder on the safe, returns to batter it with the sledgehammer, roaring with each swing, and then hunches at the back of the safe, stethoscope to its surface, giving exploratory taps with two knuckles. Through the stethoscope, hollow THUNKS are heard followed by an unnaturally loud and present CREEEEEEEEAK, and Willie reacts quizzically. After a considering moment, he rises, and one can see the safe door finishes creaking open as Marcus enters the room. Willie looks at Marcus, who starts removing stacks of cash and loading them into the Santa sack. A big, fuzzy, smiling, pink stuffed elephant is seen, and Willie's hand hesitates between this elephant and a purple one behind it, finally taking the pink one after briefly leaving with the purple. Willie turns around holding the stuffed elephant to find Marcus and Lois standing there, with Lois presenting a grotesque picture: she has a shopping cart filled with shoes, scarves, jewels, a salad spinner, purses, a block of Ginsu knives, and an abdomen exerciser.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Gin connects the wires, then bends down to Gin. Behind Jesse, in Men's Apparel, is Lois, wearing a scowl of wrinkly disdain, and, noticing that he's not observing, she mysteriously shoves a table of pullovers a few feet over, which creates a loud SQUEEEEEEEAK, but it's too tumultuous on the floor for anyone to detect. Content with her positioning of the table, Lois proceeds out the entrance. Willie breaks open a vial of Amyl Nitrate and breathes deeply, and Marcus winces. Jesse heads for the alert panel near the entryway and presses the button labeled ARM, activating an LED display labeled ARMING to count down from 30 seconds. Marcus arrives at the grate above the monitoring room, reaches in his pocket, pulls out the remote control Lois purchased, and directs it down into the chamber, causing the massive array of VCRs to shut down. Marcus arrives at the edge of a descending vent as Willie gazes at the vault and continues to gaze, moistening his lips. Meanwhile, Marcus emerges from a stockroom with a trolley to commence his buying spree, starting in Ladies' Accessories, discovering the cashmere muffler, while Willie applies a stethoscope to the vault, tapping with one hand and listening attentively. Marcus moves to Evening Wear, leaping to try to pull a wrap off a mannequin. Willie applies and then withdraws a drill from the vault, hammers a wedge into the crack of the vault door, and is atop the vault, swinging a sledgehammer at the lock. Marcus keeps jumping at the mannequin, swings at its knees with a golf club, and, having chopped it down, drags off its wrap. Willie uses a plasma cutter on the vault, returns to hammer it with the sledgehammer, roaring with each swing, and then hunches at the back of the vault, stethoscope to its surface, giving exploratory taps with two knuckles. Through the stethoscope, hollow THUNKS are heard followed by an unnaturally loud and present CREEEEEEEEAK, and Willie reacts curiously. After a pondering moment, he rises, and one can see the vault door finishes creaking open as Marcus enters the area. Willie looks at Marcus, who starts removing piles of cash and loading them into the Santa sack. A large, fluffy, cheerful, pink stuffed pachyderm is seen, and Willie's hand hesitates between this pachyderm and a violet one behind it, finally taking the pink one after briefly leaving with the violet. Willie turns around holding the stuffed pachyderm to find Marcus and Lois standing there, with Lois presenting a grotesque picture: she has a shopping cart filled with footwear, scarves, jewels, a salad spinner, handbags, a block of Ginsu knives, and an abdomen exerciser."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The cables are attached by Gin, then Gin is leaned down to by him. Behind Jesse, in Men's Wear, Lois wears a frown of pruney disapproval, and, seeing that he's not looking, a table of sweaters is inexplicably nudged a few feet over by her, which makes a loud SQUEEEEEEEAK, but it's too chaotic on the floor for anyone to notice. With her placement of the table satisfied, the door is headed out by Lois. An ampule of Amyl Nitrate is cracked open by Willie, who inhales deeply, and Marcus grimaces. The alarm panel near the doorway is headed for by Jesse, and he punches the key labeled ARM, triggering an LED readout labeled ARMING to count down from 30 seconds. The vent above the surveillance room is arrived at by Marcus, who reaches in his pocket, pulls out the remote control bought by Lois, and aims it down into the room, powering down the huge bank of VCRs. Marcus arrives at the precipice of a descending duct as the safe is stared at by Willie, who continues to stare, licking his lips. Meanwhile, Marcus emerges from a stockroom with a cart to begin his shopping spree, starting in Ladies' Accessories, finding the cashmere scarf, while a stethoscope is applied to the safe by Willie, tapping with one hand and listening intently. Evening Wear is moved to by Marcus, who jumps to try to pull a stole off a mannequin. A drill is applied and then pulled back by Willie from the safe, a chisel is battered into the seam of the safe door by him, and atop the safe, a sledgehammer is swung at the lock by him. The mannequin is leapt at by Marcus, its knees are swung at with a golf club by him, and, having chopped it down, the stole is dragged off it by him. A plasma welder is used on the safe by Willie, who returns to batter it with the sledgehammer, roaring with each swing, and then hunches at the back of the safe, stethoscope to its surface, giving exploratory taps with two knuckles. Hollow THUNKS are heard through the stethoscope, followed by an unnaturally loud and present CREEEEEEEEAK, and Willie reacts quizzically. After a considering moment, he rises, and one can see the safe door finishes creaking open as Marcus enters the room. Marcus is looked at by Willie, who starts removing stacks of cash and loading them into the Santa sack. A big, fuzzy, smiling, pink stuffed elephant is seen, and between this elephant and a purple one behind it, Willie's hand hesitates, finally taking the pink one after briefly leaving with the purple. The stuffed elephant is turned around holding by Willie to find Marcus and Lois standing there, with a grotesque picture presented by Lois: a shopping cart filled with shoes, scarves, jewels, a salad spinner, purses, a block of Ginsu knives, and an abdomen exerciser is possessed by her."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Gin attaches the cables and leans down to Gin. Behind Jesse, in Men's Wear, Lois frowns disapprovingly and nudges a table of sweaters, causing a loud squeak, but the chaos masks the noise. Satisfied, Lois exits. Willie cracks open an Amyl Nitrate ampule and inhales, while Marcus grimaces. Jesse activates the alarm panel, triggering a 30-second countdown. Marcus reaches the vent above the surveillance room, uses a remote control to power down the VCRs, and approaches a descending duct. Willie stares at the safe, licking his lips. Marcus emerges from a stockroom with a cart, starting his spree in Ladies' Accessories, grabbing a cashmere scarf. Willie uses a stethoscope on the safe, tapping and listening. Marcus moves to Evening Wear, jumping to pull a stole off a mannequin, then swings a golf club at its knees, dragging off the stole. Willie uses a plasma welder and sledgehammer on the safe, roaring with each swing, then taps the safe with a stethoscope, hearing hollow thunks and a loud creak. The safe door opens as Marcus enters. Willie looks at Marcus, who loads cash into a Santa sack. A pink stuffed elephant catches Willie's eye, and he chooses it over a purple one. Turning, he finds Marcus and Lois, who has a cart filled with shoes, scarves, jewels, a salad spinner, purses, knives, and an abdomen exerciser."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Gin attaches the cables and leans down to Gin. Behind Jesse in Men's Wear, Lois frowns disapprovingly and nudges a table of sweaters, causing a loud squeak unnoticed in the chaos. Satisfied, Lois exits. Willie inhales Amyl Nitrate, and Marcus grimaces. Jesse arms the alarm panel, triggering a 30-second countdown. Marcus uses a remote to power down VCRs in the surveillance room. Willie stares at the safe, licking his lips. Marcus begins shopping in Ladies' Accessories, grabbing a cashmere scarf, while Willie listens to the safe with a stethoscope. Marcus jumps to pull a stole off a mannequin, eventually chopping it down with a golf club. Willie uses a plasma welder and sledgehammer on the safe, listening for hollow thunks and a loud creak. The safe door opens as Marcus enters, removing cash and loading it into a Santa sack. Willie hesitates between a pink and purple stuffed elephant, choosing the pink one. He turns to find Marcus and Lois, who has a cart filled with shoes, scarves, jewels, a salad spinner, purses, knives, and an abdomen exerciser."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Gin carefully attaches the necessary cables, then leans down to Gin. Positioned behind Jesse, in the Men's Wear section, is Lois, who is wearing a frown of pruney disapproval. Observing that Jesse is not paying attention, she inexplicably nudges a table of sweaters a few feet over, which results in a loud SQUEEEEEEEAK. However, the floor is too chaotic for anyone to notice this disturbance. Feeling satisfied with her new placement of the table, Lois confidently heads out the door. Meanwhile, Willie cracks open an ampule of Amyl Nitrate and inhales deeply, causing Marcus to grimace. Jesse makes his way to the alarm panel located near the doorway and punches the key labeled ARM, which triggers an LED readout labeled ARMING to begin counting down from 30 seconds. Marcus arrives at the vent above the surveillance room, reaches into his pocket, and pulls out the remote control that Lois had purchased. He aims it down into the room, causing the massive bank of VCRs to power down. Marcus then arrives at the edge of a descending duct as Willie stares intently at the safe, continuing to stare while licking his lips. Meanwhile, Marcus emerges from a stockroom with a cart, ready to begin his shopping spree. He starts in Ladies' Accessories, where he finds a luxurious cashmere scarf, while Willie applies a stethoscope to the safe, tapping with one hand and listening intently. Marcus moves on to Evening Wear, jumping up to try to pull a stole off a mannequin. Willie applies and then pulls back a drill from the safe, batters a chisel into the seam of the safe door, and climbs atop the safe, swinging a sledgehammer at the lock with great force. Marcus keeps leaping at the mannequin, eventually swinging at its knees with a golf club, and, having chopped it down, drags off its stole. Willie uses a plasma welder on the safe, then returns to batter it with the sledgehammer, roaring with each powerful swing. He then hunches at the back of the safe, stethoscope pressed to its surface, giving exploratory taps with two knuckles. Through the stethoscope, hollow THUNKS are heard, followed by an unnaturally loud and present CREEEEEEEEAK, to which Willie reacts with a quizzical expression. After a moment of consideration, he rises, and one can see the safe door finishing its creaking open as Marcus enters the room. Willie looks at Marcus, who begins removing stacks of cash and loading them into the Santa sack. A big, fuzzy, smiling, pink stuffed elephant is seen, and Willie's hand hesitates between this elephant and a purple one behind it, finally deciding to take the pink one after briefly leaving with the purple. Willie turns around, holding the stuffed elephant, to find Marcus and Lois standing there. Lois presents a grotesque picture: she has a shopping cart filled with shoes, scarves, jewels, a salad spinner, purses, a block of Ginsu knives, and an abdomen exerciser."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Gin meticulously secures the necessary cables with careful precision before bending down to address Gin. In the Men's Wear section, positioned directly behind Jesse, stands Lois, who is wearing an expression of pruney disapproval etched into her features. Noticing that Jesse is oblivious and not paying the slightest attention, she inexplicably nudges a nearby table filled with neatly arranged sweaters a few feet over, creating a loud, grating SQUEEEEEEEAK sound. However, the surrounding area is engulfed in so much chaos and noise that no one happens to notice this minor disturbance. Feeling thoroughly satisfied with her new, seemingly improved placement of the table, Lois strides confidently out the door. Meanwhile, Willie cracks open an ampule of Amyl Nitrate and inhales deeply, which causes Marcus to grimace visibly. Jesse makes his way over to the alarm panel, conveniently located near the entrance doorway, and presses the key labeled ARM. This action causes an LED readout displaying ARMING to begin its countdown from 30 seconds. Marcus arrives at the vent positioned above the surveillance room, reaches into his pocket, and retrieves the remote control that Lois had bought earlier. He aims it carefully into the room, resulting in the massive bank of VCRs powering down. Marcus then arrives at the very edge of a descending duct while Willie continues to stare with intense focus at the safe, licking his lips in anticipation. Meanwhile, Marcus emerges from the stockroom with a cart, prepared to begin what appears to be a shopping spree. He starts in Ladies' Accessories, where he discovers a luxurious, soft cashmere scarf. At the same time, Willie presses a stethoscope against the safe, tapping with one hand and listening intently. Marcus moves onward to Evening Wear, jumping up to try and pull a stole off a mannequin. Willie applies and then retracts a drill from the safe, forcefully batters a chisel into the seam of the safe door, and climbs atop the safe to swing a sledgehammer at the lock with great force. Marcus continues to leap at the mannequin, eventually swinging at its knees with a golf club, and after managing to chop it down, drags off its stole. Willie uses a plasma welder on the safe, then resumes battering it with the sledgehammer, roaring with each powerful swing. He then hunches at the back of the safe, pressing the stethoscope to its surface, giving exploratory taps with two knuckles. Through the stethoscope, hollow THUNKS are heard, followed by an unnaturally loud and very present CREEEEEEEEAK, to which Willie reacts with a puzzled, quizzical expression. After a moment of thoughtful consideration, he rises, and one can observe the safe door finishing its creaking open as Marcus enters the room. Willie glances at Marcus, who proceeds to remove stacks of cash and begins loading them efficiently into the Santa sack. A big, fuzzy, smiling, pink stuffed elephant is prominently visible, and Willie's hand hesitates momentarily between choosing this elephant and a purple one situated behind it, ultimately deciding to take the pink one after briefly contemplating leaving with the purple option. Willie turns around, holding the stuffed elephant, only to find Marcus and Lois standing there. Lois presents a grotesque, almost comical picture: she has a shopping cart overflowing with items such as shoes, scarves, jewels, a salad spinner, purses, a block of Ginsu knives, and an abdomen exerciser."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Gin carefully attaches the cables, ensuring each connection is secure, and then leans down to Gin, focusing intently on the task at hand. Meanwhile, behind Jesse in the Men's Wear section, Lois stands with a frown of pruney disapproval etched across her face. Observing that Jesse is not paying attention, she inexplicably decides to nudge a table of sweaters a few feet over, causing it to emit a loud SQUEEEEEEEAK. Despite the noise, the chaos on the floor is such that no one notices her actions. Satisfied with the new placement of the table, Lois confidently heads out the door. In another part of the scene, Willie cracks open an ampule of Amyl Nitrate, bringing it close to his nose and inhaling deeply, while Marcus, standing nearby, grimaces at the sight. Jesse makes his way to the alarm panel located near the doorway, where he deliberately punches the key labeled ARM, initiating a countdown on the LED readout labeled ARMING, which begins to tick down from 30 seconds. Marcus, on the move, arrives at the vent above the surveillance room, reaches into his pocket, and retrieves the remote control that Lois had purchased. He aims it down into the room, successfully causing the massive bank of VCRs to power down. Marcus then finds himself at the edge of a descending duct, while Willie stands transfixed, staring at the safe and licking his lips in anticipation. Meanwhile, Marcus emerges from a stockroom, pushing a cart as he embarks on a shopping spree, starting in Ladies' Accessories, where he locates a cashmere scarf. Willie, focused on the safe, applies a stethoscope to its surface, tapping with one hand and listening intently for any telltale sounds. Marcus moves on to Evening Wear, where he jumps repeatedly, trying to pull a stole off a mannequin. Willie, meanwhile, applies a drill to the safe, then pulls it back, opting instead to batter a chisel into the seam of the safe door. He climbs atop the safe, swinging a sledgehammer with forceful determination at the lock. Marcus continues his efforts with the mannequin, eventually swinging a golf club at its knees, and, having successfully chopped it down, he drags off its stole. Willie, undeterred, uses a plasma welder on the safe, then returns to batter it with the sledgehammer, roaring with each powerful swing. He then hunches at the back of the safe, placing the stethoscope against its surface and giving exploratory taps with two knuckles. Through the stethoscope, he hears hollow THUNKS followed by an unnaturally loud and present CREEEEEEEEAK, prompting a quizzical reaction. After a moment of consideration, he rises, and the safe door finishes creaking open just as Marcus enters the room. Willie looks at Marcus, who begins to remove stacks of cash, efficiently loading them into the Santa sack. Amidst the loot, a big, fuzzy, smiling, pink stuffed elephant catches Willie's eye, and his hand hesitates between this elephant and a purple one behind it. After a brief moment of indecision, he finally opts for the pink one, momentarily leaving with the purple before changing his mind. Turning around with the stuffed elephant in hand, Willie finds Marcus and Lois standing there. Lois presents a grotesque picture, her shopping cart overflowing with an eclectic mix of items: shoes, scarves, jewels, a salad spinner, purses, a block of Ginsu knives, and an abdomen exerciser."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Gin attaches the cables and leans down to Gin. Meanwhile, Lois, in Men's Wear, discreetly nudges a table of sweaters, causing a loud squeak that goes unnoticed in the chaos, and then exits the store. Willie inhales deeply from an ampule of Amyl Nitrate, causing Marcus to grimace. Jesse activates the alarm panel, initiating a 30-second countdown. Marcus uses a remote control to power down the surveillance room's VCRs from a vent above. He then begins a shopping spree, starting in Ladies' Accessories, while Willie focuses on the safe, using a stethoscope, drill, chisel, and sledgehammer in his attempts to open it. Marcus struggles with a mannequin in Evening Wear, eventually securing a stole. Willie alternates between using a plasma welder and a sledgehammer on the safe, listening intently with a stethoscope until the safe door creaks open. As Marcus enters, Willie watches him load cash into a Santa sack. Willie hesitates between two stuffed elephants, ultimately choosing the pink one. Turning around, he finds Marcus and Lois, who has a shopping cart overflowing with shoes, scarves, jewels, and various other items."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Gin attaches the cables, then leans down to Gin. Behind Jesse, in Men's Wear at the bustling department store, is Lois, wearing a frown of pruney disapproval, and, seeing that he's not looking, she inexplicably nudges a table of sweaters a few feet over, which makes a loud SQUEEEEEEEAK, but it's too chaotic on the floor of the holiday sale to notice amidst the crowds. Satisfied with her placement of the table, Lois heads out the door into the busy shopping district. Willie cracks open an ampule of Amyl Nitrate, a potent vasodilator often used recreationally to enhance experiences, and inhales deeply, and Marcus grimaces as the sweet, sharp scent permeates the air. Jesse heads for the alarm panel near the doorway and punches the key labeled ARM, triggering an LED readout labeled ARMING to count down from 30 seconds, signaling the whole system's engagement. Marcus arrives at the vent above the surveillance room, reaches in his pocket, pulls out the remote control Lois bought from a spy gadget store, and aims it down into the room, causing the huge bank of VCRs, which record the store's security footage, to power down. Marcus arrives at the precipice of a descending duct as Willie stares at the safe, an old model known for its robustness, and continues to stare, licking his lips as if contemplating his strategy. Meanwhile, Marcus emerges from a stockroom with a cart to begin his shopping spree, starting in Ladies' Accessories, finding the cashmere scarf, highly sought after for its luxurious softness, while Willie applies a stethoscope to the safe, tapping with one hand and listening intently for the telltale clicks of its tumblers. Marcus moves to Evening Wear, jumping to try to pull a stole off a mannequin. Willie applies and then pulls back a drill, a tool capable of piercing metal, from the safe, batters a chisel into the seam of the safe door, and is atop the safe, swinging a sledgehammer, a tool dating back to early blacksmithing, at the lock. Marcus keeps leaping at the mannequin, swings at its knees with a golf club, a popular item for leisure sports, and, having chopped it down, drags off its stole. Willie uses a plasma welder on the safe, an advanced tool for cutting metal, returns to batter it with the sledgehammer, roaring with each swing, and then hunches at the back of the safe, stethoscope to its surface, giving exploratory taps with two knuckles. Through the stethoscope, hollow THUNKS are heard followed by an unnaturally loud and present CREEEEEEEEAK, and Willie reacts quizzically. After a considering moment, he rises, and one can see the safe door finishes creaking open as Marcus enters the room. Willie looks at Marcus, who starts removing stacks of cash, the lifeblood of any retail operation, and loading them into the Santa sack, a familiar festive icon. A big, fuzzy, smiling, pink stuffed elephant is seen, reminiscent of popular children's toys, and Willie's hand hesitates between this elephant and a purple one behind it, finally taking the pink one after briefly leaving with the purple. Willie turns around holding the stuffed elephant to find Marcus and Lois standing there, with Lois presenting a grotesque picture: she has a shopping cart filled with an eclectic mix including shoes, scarves, jewels, a salad spinner, purses, a block of Ginsu knives known for their sharpness, and an abdomen exerciser, a common fitness gadget."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Behind Jesse in Men's Wear is Lois wearing a frown of pruney disapproval and seeing that he's not looking she inexplicably nudges a table of sweaters a few feet over which makes a loud SQUEEEEEEEAK but it's too chaotic on the floor for anyone to notice  Satisfied with her placement of the table Lois heads out the door  Willie cracks open an ampule of Amyl Nitrate and inhales deeply and Marcus grimaces  Jesse heads for the alarm panel near the doorway and punches the key labeled ARM triggering an LED readout labeled ARMING to count down from 30 seconds  Marcus arrives at the vent above the surveillance room reaches in his pocket pulls out the remote control Lois bought and aims it down into the room causing the huge bank of VCRs to power down  Marcus arrives at the precipice of a descending duct as Willie stares at the safe and continues to stare licking his lips  Meanwhile Marcus emerges from a stockroom with a cart to begin his shopping spree starting in Ladies' Accessories finding the cashmere scarf while Willie applies a stethoscope to the safe tapping with one hand and listening intently  Marcus moves to Evening Wear jumping to try to pull a stole off a mannequin  Willie applies and then pulls back a drill from the safe batters a chisel into the seam of the safe door and is atop the safe swinging a sledgehammer at the lock  Marcus keeps leaping at the mannequin swings at its knees with a golf club and having chopped it down drags off its stole  Gin attaches the cables then leans down to Gin  Behind Jesse in Men's Wear is Lois wearing a frown of pruney disapproval and seeing that he's not looking she inexplicably nudges a table of sweaters a few feet over which makes a loud SQUEEEEEEEAK but it's too chaotic on the floor for anyone to notice  Satisfied with her placement of the table Lois heads out the door  Willie cracks open an ampule of Amyl Nitrate and inhales deeply and Marcus grimaces  Jesse heads for the alarm panel near the doorway and punches the key labeled ARM triggering an LED readout labeled ARMING to count down from 30 seconds  Marcus arrives at the vent above the surveillance room reaches in his pocket pulls out the remote control Lois bought and aims it down into the room causing the huge bank of VCRs to power down  Marcus arrives at the precipice of a descending duct as Willie stares at the safe and continues to stare licking his lips  Meanwhile Marcus emerges from a stockroom with a cart to begin his shopping spree starting in Ladies' Accessories finding the cashmere scarf while Willie applies a stethoscope to the safe tapping with one hand and listening intently  Marcus moves to Evening Wear jumping to try to pull a stole off a mannequin  Willie applies and then pulls back a drill from the safe batters a chisel into the seam of the safe door and is atop the safe swinging a sledgehammer at the lock  Marcus keeps leaping at the mannequin swings at its knees with a golf club and having chopped it down drags off its stole  Willie uses a plasma welder on the safe returns to batter it with the sledgehammer roaring with each swing and then hunches at the back of the safe stethoscope to its surface giving exploratory taps with two knuckles  Through the stethoscope hollow THUNKS are heard followed by an unnaturally loud and present CREEEEEEEEAK and Willie reacts quizzically  After a considering moment he rises and one can see  the safe door finishes creaking open as Marcus enters the room  Willie looks at Marcus who starts removing stacks of cash and loading them into the Santa sack  A big fuzzy smiling pink stuffed elephant is seen and Willie's hand hesitates between this elephant and a purple one behind it finally taking the pink one after briefly leaving with the purple  Willie turns around holding the stuffed elephant to find Marcus and Lois standing there with Lois presenting a grotesque picture  she has a shopping cart filled with shoes scarves jewels a salad spinner purses a block of Ginsu knives and an abdomen exerciser"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Gin attaches the cables then leans down to Gin. Behind Jesse in Men's Wear is Lois wearing a frown of pruney disapproval and seeing that he is not looking she inexplicably nudges a table of sweaters a few feet over which makes a loud SQUEEEEEEEAK but it is too chaotic on the floor for anyone to notice. Satisfied with her placement of the table Lois heads out the door. Willie cracks open an ampule of Amyl Nitrate and inhales deeply and Marcus grimaces. Jesse heads for the alarm panel near the doorway and punches the key labeled ARM triggering an LED readout labeled ARMING to count down from 30 seconds. Marcus arrives at the vent above the surveillance room reaches in his pocket pulls out the remote control Lois bought and aims it down into the room causing the huge bank of VCRs to power down. Marcus arrives at the precipice of a descending duct as Willie stares at the safe and continues to stare licking his lips. Meanwhile Marcus emerges from a stockroom with a cart to begin his shopping spree starting in Ladies' Accessories finding the cashmere scarf while Willie applies a stethoscope to the safe tapping with one hand and listening intently. Marcus moves to Evening Wear jumping to try to pull a stole off a mannequin. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. Willie applies and then pulls back a drill from the safe batters a chisel into the seam of the safe door and is atop the safe swinging a sledgehammer at the lock. Marcus keeps leaping at the mannequin swings at its knees with a golf club and having chopped it down drags off its stole. Willie uses a plasma welder on the safe returns to batter it with the sledgehammer roaring with each swing and then hunches at the back of the safe stethoscope to its surface giving exploratory taps with two knuckles. Through the stethoscope hollow THUNKS are heard followed by an unnaturally loud and present CREEEEEEEEAK and Willie reacts quizzically. After a considering moment he rises and one can see. the safe door finishes creaking open as Marcus enters the room. Willie looks at Marcus who starts removing stacks of cash and loading them into the Santa sack. A big fuzzy smiling pink stuffed elephant is seen and Willie's hand hesitates between this elephant and a purple one behind it finally taking the pink one after briefly leaving with the purple. Willie turns around holding the stuffed elephant to find Marcus and Lois standing there with Lois presenting a grotesque picture. she has a shopping cart filled with shoes scarves jewels a salad spinner purses a block of Ginsu knives and an abdomen exerciser."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Gin attaches the cables then leans down to Gin. Behind Jesse in Men's Wear is Lois wearing a frown of pruney disapproval and seeing that he is not looking she inexplicably nudges a table of sweaters a few feet over which makes a loud SQUEEEEEEEAK but it is too chaotic on the floor for anyone to notice. Satisfied with her placement of the table Lois heads out the door. Willie cracks open an ampule of Amyl Nitrate and inhales deeply and Marcus grimaces. Jesse heads for the alarm panel near the doorway and punches the key labeled ARM triggering an LED readout labeled ARMING to count down from 30 seconds. Marcus arrives at the vent above the surveillance room reaches in his pocket pulls out the remote control Lois bought and aims it down into the room causing the huge bank of VCRs to power down. Marcus arrives at the precipice of a descending duct as Willie stares at the safe and continues to stare licking his lips. Meanwhile Marcus emerges from a stockroom with a cart to begin his shopping spree starting in Ladies' Accessories finding the cashmere scarf while Willie applies a stethoscope to the safe tapping with one hand and listening intently. Marcus moves to Evening Wear jumping to try to pull a stole off a mannequin. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. Willie applies and then pulls back a drill from the safe batters a chisel into the seam of the safe door and is atop the safe swinging a sledgehammer at the lock. Marcus keeps leaping at the mannequin swings at its knees with a golf club and having chopped it down drags off its stole. Willie uses a plasma welder on the safe returns to batter it with the sledgehammer roaring with each swing and then hunches at the back of the safe stethoscope to its surface giving exploratory taps with two knuckles. Through the stethoscope hollow THUNKS are heard followed by an unnaturally loud and present CREEEEEEEEAK and Willie reacts quizzically. After a considering moment he rises and one can see. the safe door finishes creaking open as Marcus enters the room. Willie looks at Marcus who starts removing stacks of cash and loading them into the Santa sack. A big fuzzy smiling pink stuffed elephant is seen and Willie's hand hesitates between this elephant and a purple one behind it finally taking the pink one after briefly leaving with the purple. Willie turns around holding the stuffed elephant to find Marcus and Lois standing there with Lois presenting a grotesque picture. she has a shopping cart filled with shoes scarves jewels a salad spinner purses a block of Ginsu knives and an abdomen exerciser."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Gin attaches the cables then leans down to Gin. Behind Jesse in Men's Wear is Lois wearing a frown of pruney disapproval and seeing that he is not looking she inexplicably nudges a table of sweaters a few feet over which makes a loud SQUEEEEEEEAK but it is too chaotic on the floor for anyone to notice. Satisfied with her placement of the table Lois heads out the door. Willie cracks open an ampule of Amyl Nitrate and inhales deeply and Marcus grimaces. Jesse heads for the alarm panel near the doorway and punches the key labeled ARM triggering an LED readout labeled ARMING to count down from 30 seconds. the safe door finishes creaking open as Marcus enters the room. Willie looks at Marcus who starts removing stacks of cash and loading them into the Santa sack. A big fuzzy smiling pink stuffed elephant is seen and Willie's hand hesitates between this elephant and a purple one behind it finally taking the pink one after briefly leaving with the purple. Willie turns around holding the stuffed elephant to find Marcus and Lois standing there with Lois presenting a grotesque picture. she has a shopping cart filled with shoes scarves jewels a salad spinner purses a block of Ginsu knives and an abdomen exerciser."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Gin attaches the cables then leans down to Gin. Behind Jesse in Men's Wear is Lois wearing a frown of pruney disapproval and seeing that he is not looking she inexplicably nudges a table of sweaters a few feet over which makes a loud SQUEEEEEEEAK but it is too chaotic on the floor for anyone to notice. Willie turns around holding the stuffed elephant to find Marcus and Lois standing there with Lois presenting a grotesque picture. she has a shopping cart filled with shoes scarves jewels a salad spinner purses a block of Ginsu knives and an abdomen exerciser."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Gin attaches the cables, then leans down to Lois. Behind Marcus, in Men's Wear, is Willie, wearing a frown of pruney disapproval, and, seeing that Marcus is not looking, Willie inexplicably nudges a table of sweaters a few feet over, which makes a loud SQUEEEEEEEAK, but it's too chaotic on the floor for anyone to notice. Satisfied with the placement of the table, Willie heads out the door. Jesse cracks open an ampule of Amyl Nitrate and inhales deeply, and Gin grimaces. Marcus heads for the alarm panel near the doorway and punches the key labeled ARM, triggering an LED readout labeled ARMING to count down from 30 seconds. Gin arrives at the vent above the surveillance room, reaches in her pocket, pulls out the remote control Marcus bought, and aims it down into the room, causing the huge bank of VCRs to power down. Gin arrives at the precipice of a descending duct as Jesse stares at the safe and continues to stare, licking his lips. Meanwhile, Gin emerges from a stockroom with a cart to begin her shopping spree, starting in Ladies' Accessories, finding the cashmere scarf, while Jesse applies a stethoscope to the safe, tapping with one hand and listening intently. Gin moves to Evening Wear, jumping to try to pull a stole off a mannequin. Jesse applies and then pulls back a drill from the safe, batters a chisel into the seam of the safe door, and is atop the safe, swinging a sledgehammer at the lock. Gin keeps leaping at the mannequin, swings at its knees with a golf club, and, having chopped it down, drags off its stole. Jesse uses a plasma welder on the safe, returns to batter it with the sledgehammer, roaring with each swing, and then hunches at the back of the safe, stethoscope to its surface, giving exploratory taps with two knuckles. Through the stethoscope, hollow THUNKS are heard followed by an unnaturally loud and present CREEEEEEEEAK, and Jesse reacts quizzically. After a considering moment, he rises, and one can see the safe door finishes creaking open as Gin enters the room. Jesse looks at Gin, who starts removing stacks of cash and loading them into the Santa sack. A big, fuzzy, smiling, pink stuffed elephant is seen, and Jesse's hand hesitates between this elephant and a purple one behind it, finally taking the pink one after briefly leaving with the purple. Jesse turns around holding the stuffed elephant to find Gin and Willie standing there, with Willie presenting a grotesque picture: he has a shopping cart filled with shoes, scarves, jewels, a salad spinner, purses, a block of Ginsu knives, and an abdomen exerciser."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Gin attaches the ropes, then leans down to Gin. Behind Jesse, in Pet Supplies, is Lois, wearing a frown of pruney disapproval, and, seeing that he's not looking, she inexplicably nudges a stack of blankets a few feet over, which makes a loud SCREEEEEECH, but it's too chaotic on the floor for anyone to notice. Satisfied with her placement of the stack, Lois heads out the window. Willie cracks open a vial of Lavender Oil and inhales deeply, and Marcus grimaces. Jesse heads for the light switch near the doorway and punches the key labeled ON, triggering an LCD display labeled ONBOARD to count down from 30 seconds. Marcus arrives at the shelf above the security booth, reaches in his pocket, pulls out the garage door opener Lois bought, and aims it down into the booth, causing the massive array of monitors to power down. Marcus arrives at the edge of a descending slide as Willie stares at the locker and continues to stare, licking his lips. Meanwhile, Marcus emerges from a warehouse with a dolly to begin his shopping spree, starting in Men's Accessories, finding the silk tie, while Willie applies an otoscope to the locker, tapping with one hand and listening intently. Marcus moves to Sports Attire, jumping to try to pull a jersey off a mannequin. Willie applies and then pulls back a saw from the locker, batters a screwdriver into the seam of the locker door, and is atop the locker, swinging a baseball bat at the lock. Marcus keeps leaping at the mannequin, swings at its knees with a hockey stick, and, having chopped it down, drags off its jersey. Willie uses a plasma cutter on the locker, returns to batter it with the baseball bat, roaring with each swing, and then hunches at the back of the locker, otoscope to its surface, giving exploratory taps with two knuckles. Through the otoscope, hollow DULL THUDS are heard followed by an unnaturally loud and present GROOOOOOOAN, and Willie reacts quizzically. After a considering moment, he rises, and one can see the locker door finishes groaning open as Marcus enters the room. Willie looks at Marcus, who starts removing stacks of confetti and loading them into the pillowcase. A giant, furry, grinning, orange stuffed bear is seen, and Willie's hand hesitates between this bear and a green one behind it, finally taking the orange one after briefly leaving with the green. Willie turns around holding the stuffed bear to find Marcus and Lois standing there, with Lois presenting a grotesque picture: she has a dolly filled with hats, ties, sunglasses, a toaster, wallets, a set of kitchen shears, and a leg massager."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Gin detaches the cables, then kicks up to Gin. Behind Jesse, in Men's Wear, is Lois, wearing a smile of pruney approval, and, seeing that he's looking, she carefully slides a table of sweaters a few inches over, which makes a loud CRUNCH, but it's too serene on the floor for anyone to notice. Dissatisfied with her placement of the table, Lois skips out the door. Willie closes an ampule of Amyl Nitrate and exhales loudly, and Marcus smiles. Jesse heads for the alarm panel near the doorway and taps the key labeled DISARM, triggering an LED readout labeled DISARMING to count up from 30 seconds. Marcus departs from the vent above the surveillance room, reaches in his pocket, pulls out the remote control Lois bought, and aims it up into the room, causing the huge bank of VCRs to power up. Marcus arrives at the base of an ascending duct as Willie gazes at the safe and continues to gaze, biting his lips. Meanwhile, Marcus vanishes into a stockroom with a cart to end his shopping spree, starting in Men's Accessories, losing the cashmere scarf, while Willie removes a stethoscope from the safe, tapping with one foot and listening distantly. Marcus moves to Casual Wear, ducking to try to push a stole onto a mannequin. Willie applies and then pushes a drill into the safe, eases a chisel into the seam of the safe door, and stands atop the safe, tickling a sledgehammer at the lock. Marcus keeps crouching at the mannequin, taps at its knees with a broomstick, and, having swept it down, drags on its stole. Willie uses a plasma cutter on the safe, leaves to tickle it with the sledgehammer, whispering with each swing, and then kneels at the front of the safe, stethoscope to its surface, giving gentle pats with two fingers. Through the stethoscope, hollow WHACKS are heard followed by an unnaturally quiet and distant SQUEEEEEEEAK, and Willie reacts knowingly. After a pondering moment, he sits, and one can see the safe door begins squeaking closed as Marcus exits the room. Willie looks at Marcus, who stops adding stacks of cash and unloading them from the Santa sack. A small, smooth, frowning, purple stuffed elephant is seen, and Willie's hand commits between this elephant and a pink one in front of it, finally leaving the pink one after briefly staying with the purple. Willie turns around dropping the stuffed elephant to find Marcus and Lois standing there, with Lois presenting a pristine picture: she has a shopping cart emptied of shoes, scarves, jewels, a salad spinner, purses, a block of Ginsu knives, and an abdomen exerciser."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Hector attaches the headphones, then leans down to Hector. Behind Sam, in Kid's Toys, is Doris, wearing a scowl of crabby dissatisfaction, and, seeing that he's not looking, she inexplicably nudges a shelf of backpacks a few feet over, which makes a loud SQUEEEEEEEAK, but it's too hectic on the escalator for anyone to notice. Satisfied with her placement of the shelf, Doris heads out the window. Steven cracks open a vial of Peppermint Extract and inhales deeply, and Neil grimaces. Sam heads for the sprinklers near the window and punches the key labeled JUMP, triggering an LED readout labeled LEAPING to count down from 30 seconds. Neil arrives at the hatch above the observation deck, reaches in his backpack, pulls out the joystick Doris bought, and aims it down into the room, causing the huge bank of speakers to power down. Neil arrives at the crest of a descending ladder as Steven stares at the chest and continues to stare, licking his lips. Meanwhile, Neil emerges from an attic with a trolley to begin his shopping spree, starting in Men's Accessories, finding the silk tie, while Steven applies a magnifying glass to the chest, tapping with one finger and listening intently. Neil moves to Sports Gear, jumping to try to pull a helmet off a dummy. Steven applies and then pulls back a screwdriver from the chest, batters a hammer into the seam of the chest door, and is atop the chest, swinging a mallet at the lock. Neil keeps leaping at the dummy, swings at its feet with a golf club, and, having chopped it down, drags off its helmet. Steven uses a blowtorch on the chest, returns to batter it with the mallet, roaring with each swing, and then hunches at the back of the chest, magnifying glass to its surface, giving exploratory taps with two fingers. Through the magnifying glass, hollow THUNKS are heard followed by an unnaturally loud and present CREEEEEEEEAK, and Steven reacts quizzically. After a considering moment, he rises, and one can see the chest door finishes creaking open as Neil enters the space. Steven looks at Neil, who starts removing piles of coins and loading them into the wizard hat. A big, fuzzy, grinning, blue stuffed gorilla is seen, and Steven's hand hesitates between this gorilla and a green one behind it, finally taking the blue one after briefly leaving with the green. Steven turns around holding the stuffed gorilla to find Neil and Doris standing there, with Doris presenting a grotesque picture: she has a trolley filled with hats, ties, bracelets, a soup mixer, wallets, a bundle of katanas, and a thigh exerciser."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Sally disconnects the cables, then sits up to Sally. In front of Robert, in Women's Wear, is Clark, wearing a grin of youthful approval, and, seeing that she's not hearing, he mysteriously pulls a chair of dresses a few feet away, which creates a soft THUD, but it's too serene in the air for anyone to realize. Content with his dislocation of the chair, Clark walks into the hall. Lisa seals shut a bottle of perfume and exhales quietly, and Erica laughs. Robert moves toward the light switch near the staircase and presses the button labeled OFF, prompting a neon display labeled SHUTTING DOWN to flash for 20 seconds. Erica descends to the hatch beneath the control room, reaches into her bag, pulls out the walkie-talkie Clark borrowed, and directs it up into the ceiling, causing the small set of cameras to shut off. Erica descends to the base of a rising ramp as Lisa examines the fridge and continues to observe, clicking her fingers. Meanwhile, Erica disappears into a storeroom with a basket to end her browsing journey, beginning in Men's Accessories, selecting the leather gloves, while Lisa attaches a thermometer to the fridge, pressing with one finger and watching attentively. Erica moves to Sportswear, ducking to try to grab a racket off a shelf. Lisa applies and then refixes a wrench to the fridge, digs a spoon into the hinge of the fridge door, and is beneath the fridge, pulling a crowbar at the latch. Erica keeps skipping at the shelf, bats at its legs with a driftwood stick, and, having toppled it down, carries off its racket. Lisa uses a blowtorch on the fridge, returns to hit it with the crowbar, laughing with each strike, and then curls up at the side of the fridge, thermometer to its surface, providing gentle strokes with two fingers. Through the thermometer, soft TAPS are heard followed by an unusually silent and distant SIGH, and Lisa reacts dubiously. After a reflective pause, she stands, and one can see the fridge door begins sighing closed as Erica leaves the space. Lisa turns to Erica, who starts adding stacks of gifts and placing them into the Easter basket. A small, slick, frowning, blue ceramic turtle is seen, and Lisa's hand wavers between this turtle and a green one beside it, finally holding the blue one after momentarily departing with the green. Lisa spins back holding the ceramic turtle to find Erica and Clark waiting there, with Clark offering a delightful scene: he has a shopping bag filled with hats, gloves, trinkets, a cheese grater, wallets, a set of kitchen shears, and an ankle strengthener."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Gin disconnects the wires, then stretches up to Gin. Behind Jesse, in Women's Shoes, is Lois, wearing a smirk of salty amusement, and, noticing that he's not paying attention, she inexplicably slides a rack of coats a few inches backward, which makes a loud SQUAWK, but it's too hectic in the store for anyone to notice. Pleased with her movement of the rack, Lois sneaks through the window. Willie pops open a vial of Peppermint Extract and sniffs lightly, and Marcus sneezes. Jesse heads for the light switch near the entrance and taps the button labeled OFF, causing a neon sign labeled SHUTTING DOWN to blink from 30 seconds. Marcus arrives at the opening above the security office, reaches in his bag, pulls out the joystick Lois bought, and points it into the room, causing the giant array of monitors to go blank. Marcus reaches the edge of a climbing ladder as Willie stares at the painting and continues to stare, rubbing his chin. Meanwhile, Marcus emerges from a closet with a basket to begin his shopping spree, starting in Men's Accessories, grabbing the silk tie, while Willie attaches a magnifying glass to the painting, tapping with one finger and examining closely. Marcus moves to Casual Wear, tiptoeing to try to snag a hat from a mannequin. Willie applies and then pulls back a magnet from the painting, chisels a pry bar into the edge of the frame, and is atop the painting, pounding a crowbar at the border. Marcus keeps reaching for the mannequin, kicks at its stand with a tennis racket, and, having toppled it over, yanks off its hat. Willie uses a soldering iron on the painting, goes back to strike it with the crowbar, yelling with each hit, and then leans at the back of the painting, magnifying glass to its surface, giving gentle taps with two fingers. Through the magnifying glass, faint CLUNKS are heard followed by an unnaturally loud and nearby SCREEEEEECH, and Willie reacts thoughtfully. After a pondering moment, he stands up, and one can see the painting frame finishes screeching open as Marcus enters the area. Willie glances at Marcus, who starts pulling out rolls of fabric and stuffing them into the Easter basket. A large, fuzzy, grinning, yellow stuffed giraffe is seen, and Willie's hand wavers between this giraffe and an orange one beside it, finally selecting the yellow one after briefly leaving with the orange. Willie turns around holding the stuffed giraffe to find Marcus and Lois standing there, with Lois presenting a bizarre picture: she has a shopping cart filled with hats, ties, trinkets, a toaster, handbags, a stack of dessert plates, and a shoulder massager."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Birch detaches the balloons, then lounges upward to Birch. In front of Oliver, in Children's Books, is Carol, sporting a grin of bubbly approval, and, noticing that he is staring, she inexplicably shoves a rack of hats several inches away, which emits a loud ZOOOOOOOOM, but it's too noisy in the air for anyone to hear. Pleased with her shift of the rack, Carol exits through the window. Henry pops open a vial of Lavender Extract and exhales sharply, and Nathaniel smirks. Oliver strolls toward the light switch beside the window and taps the button labeled ON, prompting a digital display labeled ACTIVATING to tick down from 45 seconds. Nathaniel reaches the hatch beneath the projection booth, digs into his coat, retrieves the joystick Birch found, and points it up into the booth, causing the massive array of televisions to shut off. Nathaniel arrives at the edge of an ascending tunnel as Henry gazes at the locker and continues to gaze, nibbling his fingernails. Meanwhile, Nathaniel appears from a pantry with a wheelbarrow to start his buying spree, beginning in Men's Apparel, discovering the woolen hat, while Henry attaches a headset to the locker, drumming with one finger and listening carefully. Nathaniel moves to Activewear, leaping to try to grab a jacket off a dummy. Henry pushes and then retracts a drill from the locker, hammers a screwdriver into the hinge of the locker door, and is atop the locker, swinging a crowbar at the handle. Nathaniel keeps jumping at the dummy, smashes at its ankles with a hockey stick, and, having toppled it, hauls off its jacket. Henry uses a laser cutter on the locker, returns to pummel it with the crowbar, bellowing with each hit, and then crouches at the rear of the locker, headset to its side, giving cautious taps with three knuckles. Through the headset, hollow CLUNKS are detected followed by an unnaturally loud and present GROOOOOOAN, and Henry reacts puzzled. After a pondering pause, he stands, and one can see the locker door finishes groaning open as Nathaniel walks into the chamber. Henry glances at Nathaniel, who begins gathering piles of books and stashing them into the reindeer bag. A giant, fluffy, grinning, yellow stuffed giraffe is seen, and Henry's fingers hesitate between this giraffe and an orange one next to it, finally taking the yellow one after briefly leaving with the orange. Henry pivots holding the stuffed giraffe to find Nathaniel and Carol standing there, with Carol offering a bizarre sight: she has a wheelbarrow filled with boots, hats, bracelets, a fruit blender, handbags, a set of carving knives, and a leg exerciser."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Gin connects the cables while Jesse triggers the alarm panel to start a 30-second countdown. Lois mischievously nudges a table in Men's Wear, causing a loud squeak, but exits unnoticed. Willie inhales Amyl Nitrate as Marcus powers down the surveillance VCRs with a remote. As Willie focuses on a safe with various tools, Marcus embarks on a shopping spree, targeting accessories and evening wear. Willie finally opens the safe after persistent efforts and Marcus begins filling a Santa sack with cash. A decision over a pink or purple stuffed elephant briefly halts Willie. With the pink elephant chosen, Willie turns to find Marcus and Lois—Lois holding a cart packed with extravagant items, creating a comical scene."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "she has a shopping cart filled with shoes scarves jewels a salad spinner purses a block of Ginsu knives and an abdomen exerciser Willie turns around holding the stuffed elephant to find Marcus and Lois standing there with Lois presenting a grotesque picture  A big fuzzy smiling pink stuffed elephant is seen and Willie's hand hesitates between this elephant and a purple one behind it finally taking the pink one after briefly leaving with the purple  Willie looks at Marcus who starts removing stacks of cash and loading them into the Santa sack  the safe door finishes creaking open as Marcus enters the room  After a considering moment he rises and one can see  Through the stethoscope hollow THUNKS are heard followed by an unnaturally loud and present CREEEEEEEEAK and Willie reacts quizzically  Willie uses a plasma welder on the safe returns to batter it with the sledgehammer roaring with each swing and then hunches at the back of the safe stethoscope to its surface giving exploratory taps with two knuckles  Marcus keeps leaping at the mannequin swings at its knees with a golf club and having chopped it down drags off its stole  Willie applies and then pulls back a drill from the safe batters a chisel into the seam of the safe door and is atop the safe swinging a sledgehammer at the lock  Marcus moves to Evening Wear jumping to try to pull a stole off a mannequin  Meanwhile Marcus emerges from a stockroom with a cart to begin his shopping spree starting in Ladies' Accessories finding the cashmere scarf while Willie applies a stethoscope to the safe tapping with one hand and listening intently  Marcus arrives at the precipice of a descending duct as Willie stares at the safe and continues to stare licking his lips  Marcus arrives at the vent above the surveillance room reaches in his pocket pulls out the remote control Lois bought and aims it down into the room causing the huge bank of VCRs to power down  Jesse heads for the alarm panel near the doorway and punches the key labeled ARM triggering an LED readout labeled ARMING to count down from 30 seconds  Willie cracks open an ampule of Amyl Nitrate and inhales deeply and Marcus grimaces  Satisfied with her placement of the table Lois heads out the door  Behind Jesse in Men's Wear is Lois wearing a frown of pruney disapproval and seeing that he's not looking she inexplicably nudges a table of sweaters a few feet over which makes a loud SQUEEEEEEEAK but it's too chaotic on the floor for anyone to notice  Gin attaches the cables then leans down to Gin "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Willie uses a plasma welder on the safe returns to batter it with the sledgehammer roaring with each swing and then hunches at the back of the safe stethoscope to its surface giving exploratory taps with two knuckles  the safe door finishes creaking open as Marcus enters the room  Marcus keeps leaping at the mannequin swings at its knees with a golf club and having chopped it down drags off its stole  Marcus moves to Evening Wear jumping to try to pull a stole off a mannequin  Willie looks at Marcus who starts removing stacks of cash and loading them into the Santa sack  Behind Jesse in Men's Wear is Lois wearing a frown of pruney disapproval and seeing that he's not looking she inexplicably nudges a table of sweaters a few feet over which makes a loud SQUEEEEEEEAK but it's too chaotic on the floor for anyone to notice  Through the stethoscope hollow THUNKS are heard followed by an unnaturally loud and present CREEEEEEEEAK and Willie reacts quizzically  Marcus arrives at the vent above the surveillance room reaches in his pocket pulls out the remote control Lois bought and aims it down into the room causing the huge bank of VCRs to power down  A big fuzzy smiling pink stuffed elephant is seen and Willie's hand hesitates between this elephant and a purple one behind it finally taking the pink one after briefly leaving with the purple  Satisfied with her placement of the table Lois heads out the door  she has a shopping cart filled with shoes scarves jewels a salad spinner purses a block of Ginsu knives and an abdomen exerciser Jesse heads for the alarm panel near the doorway and punches the key labeled ARM triggering an LED readout labeled ARMING to count down from 30 seconds  Willie applies and then pulls back a drill from the safe batters a chisel into the seam of the safe door and is atop the safe swinging a sledgehammer at the lock  Meanwhile Marcus emerges from a stockroom with a cart to begin his shopping spree starting in Ladies' Accessories finding the cashmere scarf while Willie applies a stethoscope to the safe tapping with one hand and listening intently  Willie cracks open an ampule of Amyl Nitrate and inhales deeply and Marcus grimaces  After a considering moment he rises and one can see  Marcus arrives at the precipice of a descending duct as Willie stares at the safe and continues to stare licking his lips  Willie turns around holding the stuffed elephant to find Marcus and Lois standing there with Lois presenting a grotesque picture  Gin attaches the cables then leans down to Gin "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Marcus keeps leaping at the mannequin swings at its knees with a golf club and having chopped it down drags off its stole  Willie uses a plasma welder on the safe returns to batter it with the sledgehammer roaring with each swing and then hunches at the back of the safe stethoscope to its surface giving exploratory taps with two knuckles  Through the stethoscope hollow THUNKS are heard followed by an unnaturally loud and present CREEEEEEEEAK and Willie reacts quizzically  After a considering moment he rises and one can see  the safe door finishes creaking open as Marcus enters the room  Willie looks at Marcus who starts removing stacks of cash and loading them into the Santa sack  A big fuzzy smiling pink stuffed elephant is seen and Willie's hand hesitates between this elephant and a purple one behind it finally taking the pink one after briefly leaving with the purple  Willie turns around holding the stuffed elephant to find Marcus and Lois standing there with Lois presenting a grotesque picture  she has a shopping cart filled with shoes scarves jewels a salad spinner purses a block of Ginsu knives and an abdomen exerciser Gin attaches the cables then leans down to Gin  Behind Jesse in Men's Wear is Lois wearing a frown of pruney disapproval and seeing that he's not looking she inexplicably nudges a table of sweaters a few feet over which makes a loud SQUEEEEEEEAK but it's too chaotic on the floor for anyone to notice  Satisfied with her placement of the table Lois heads out the door  Willie cracks open an ampule of Amyl Nitrate and inhales deeply and Marcus grimaces  Jesse heads for the alarm panel near the doorway and punches the key labeled ARM triggering an LED readout labeled ARMING to count down from 30 seconds  Marcus arrives at the vent above the surveillance room reaches in his pocket pulls out the remote control Lois bought and aims it down into the room causing the huge bank of VCRs to power down  Marcus arrives at the precipice of a descending duct as Willie stares at the safe and continues to stare licking his lips  Meanwhile Marcus emerges from a stockroom with a cart to begin his shopping spree starting in Ladies' Accessories finding the cashmere scarf while Willie applies a stethoscope to the safe tapping with one hand and listening intently  Marcus moves to Evening Wear jumping to try to pull a stole off a mannequin  Willie applies and then pulls back a drill from the safe batters a chisel into the seam of the safe door and is atop the safe swinging a sledgehammer at the lock "
        }
      ]
    }
  ]
}