{
  "ground_truth": "Military trucks, tents, and soldiers are stationed while helicopters buzz in the distant sky. Joe moves over to Alice, who looks out at the train crash, haunted by the sight. As Joe stops reloading his gun and stares at the crash, Martin and Preston join them. Joe uses a camera to zoom in and pan from one car to another at the crash site, with Alice watching him intently. The kids, sitting at a table near the window across from the car lot, talk excitedly but quietly as a waitress delivers more food. Cary smiles at Alice, leaving an impact on Joe and the others. The massive train wreck stretches for a mile, with hundreds of military personnel working quickly to clean up the scene. A truck passes by Jack and Nelec, who walk together amid the debris, with Jack looking at Nelec with skepticism. Jack is with Sheriff Pruitt, who is distracted and picks up reports from his desk on his way out. As Pruitt walks off, Jack watches him go, feeling unsettled. Nearby, fingers tap restlessly on a counter next to a Walkman. The scene shifts to Breen, 23, listening to Blondie in a station store, alone, until Sheriff Pruitt, 60, enters and tosses a candy bar to him. Breen removes his headphones and exits the store. Elsewhere, Charles and Cary plan explosions together, while Alice looks at them knowingly and performs her best zombie impression, amusing Joe. Alice leans toward Joe, pretending to bite his neck, causing him to feel a shiver he's never experienced before. Afterward, she pulls back, smiling. Near the gas pumps, Jack, Edie, and Mr. Blakely appear, moving past small shattered pieces of red and blue plastic. Jack kneels by the Smith and Wesson Model 19, examines the broken plastic, and makes a call on his walkie. Meanwhile, Angry Izzy, 65, opens a new car hood, revealing a messy engine with pieces ripped away, as Jack follows him.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Military lorries, pavilions, and troopers are deployed while choppers drone in the far sky. Joe shifts over to Alice, who gazes out at the railway smash, troubled by the scene. As Joe halts reloading his firearm and gazes at the smash, Martin and Preston join them. Joe employs a camera to zoom in and pan from one carriage to another at the smash site, with Alice observing him intently. The youngsters, seated at a table near the window opposite the automobile lot, converse excitedly but softly as a waitress brings more food. Cary grins at Alice, leaving an impact on Joe and the others. The colossal railway wreck extends for a mile, with hundreds of military staff working swiftly to tidy up the scene. A lorry drives by Jack and Nelec, who walk together amid the wreckage, with Jack gazing at Nelec with doubt. Jack is with Sheriff Pruitt, who is distracted and collects reports from his desk on his way out. As Pruitt walks off, Jack observes him go, feeling uneasy. Nearby, fingers tap restlessly on a counter beside a Walkman. The scene shifts to Breen, 23, listening to Blondie in a depot shop, alone, until Sheriff Pruitt, 60, enters and tosses a candy bar to him. Breen removes his headphones and exits the shop. Elsewhere, Charles and Cary devise detonations together, while Alice gazes at them knowingly and performs her best ghoul impression, amusing Joe. Alice inclines toward Joe, pretending to bite his neck, causing him to feel a tremor he's never experienced before. Afterward, she withdraws, smiling. Near the petrol pumps, Jack, Edie, and Mr. Blakely appear, moving past small shattered fragments of red and blue plastic. Jack crouches by the Smith and Wesson Model 19, inspects the broken plastic, and makes a call on his walkie. Meanwhile, Irate Izzy, 65, opens a new automobile hood, revealing a messy motor with pieces torn away, as Jack follows him."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Military trucks, tents, and soldiers station while helicopters are buzzed in the distant sky. Alice is moved over to by Joe, who looks out at the train crash, haunted by the sight. As the crash is stared at by Joe, who stops reloading his gun, Martin and Preston join them. A camera is used by Joe to zoom in and pan from one car to another at the crash site, while he is watched intently by Alice. The kids, sitting at a table near the window across from the car lot, are talking excitedly but quietly as more food is delivered by a waitress. Alice smiles at Cary, impacting Joe and the others. The massive train wreck stretches for a mile, and hundreds of military personnel quickly work to clean up the scene. A truck is passed by Jack and Nelec, who walk together amid the debris, while Nelec is looked at with skepticism by Jack. Sheriff Pruitt is with Jack, who is distracted and picks up reports from his desk on his way out. As Pruitt is walked off by himself, he is watched go by Jack, feeling unsettled. Nearby, fingers tap restlessly on a counter next to a Walkman. The scene shifts to Breen, 23, who listens to Blondie in a station store, alone, until a candy bar is tossed to him by Sheriff Pruitt, 60, who enters. Breen removes his headphones and exits the store. Elsewhere, explosions are planned together by Charles and Cary, while a knowing look is given to them by Alice, who performs her best zombie impression to amuse Joe. Alice leans toward Joe, pretending to bite his neck, and he feels a shiver he's never experienced before. Afterward, a smile is pulled back by her. Near the gas pumps, Jack, Edie, and Mr. Blakely appear, moving past small shattered pieces of red and blue plastic. By the Smith and Wesson Model 19, Jack kneels, examines the broken plastic, and a call is made by him on his walkie. Meanwhile, a new car hood is opened by Angry Izzy, 65, revealing a messy engine with pieces ripped away, following him by Jack."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Military trucks, tents, and soldiers are stationed while helicopters buzz above. Joe moves to Alice, who is haunted by the train crash sight. As Joe finishes reloading his gun and stares at the wreck, Martin and Preston join. Joe uses a camera to zoom in, with Alice watching intently. The kids sit near a window, excitedly talking as a waitress serves more food. Cary smiles at Alice, impacting Joe and the others. The massive train wreck stretches a mile, with military personnel cleaning up swiftly. Jack and Nelec walk among the debris, Jack skeptically eyeing Nelec. Jack is with Sheriff Pruitt, who picks up reports distractedly. As Pruitt leaves, Jack watches, feeling unsettled. Nearby, fingers tap restlessly next to a Walkman. The scene shifts to Breen, 23, listening to Blondie alone until Sheriff Pruitt, 60, enters and tosses a candy bar. Breen removes headphones and exits. Elsewhere, Charles and Cary plan explosions, while Alice, performing a zombie impression, amuses Joe. Alice leans toward Joe, pretending to bite his neck, making him shiver uniquely. She pulls back, smiling. By the gas pumps, Jack, Edie, and Mr. Blakely move past plastic shards. Jack kneels by a Smith and Wesson Model 19, examines the broken plastic, and uses his walkie. Meanwhile, Angry Izzy, 65, opens a car hood with a messy engine as Jack follows."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Military trucks, tents, and soldiers are stationed with helicopters buzzing in the sky. Joe approaches Alice, haunted by the train crash. Joe stops reloading, stares at the crash, and uses a camera to zoom in, while Alice watches intently. The kids, quietly excited at a nearby table, are served more food. Cary smiles at Alice, impacting Joe and others. The train wreck spans a mile, with military personnel cleaning up quickly. Jack walks with Nelec amid debris, looking skeptical. Sheriff Pruitt picks up reports and leaves, unsettling Jack. Nearby, fingers tap restlessly next to a Walkman. Breen, 23, listens to Blondie in a store until Sheriff Pruitt, 60, enters, tosses a candy bar, and Breen exits. Charles and Cary plan explosions, and Alice amuses Joe with a zombie impression, pretending to bite his neck, causing a new shiver. She pulls back, smiling. By the gas pumps, Jack, Edie, and Mr. Blakely pass shattered plastic. Jack examines a Smith and Wesson Model 19, calls on his walkie. Angry Izzy, 65, opens a car hood, revealing the messy engine, as Jack follows."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Military trucks, expansive tents, and numerous soldiers are strategically positioned while helicopters buzz persistently in the distant sky. Joe shifts his attention to Alice, who is intently looking out at the harrowing sight of the train crash, clearly haunted and distressed by the view. As Joe pauses from reloading his gun, he stares deeply at the crash site until Martin and Preston come over to join them. Joe utilizes a camera to meticulously zoom in and methodically pan from one wrecked car to another, all at the crash site, as Alice watches him with a focused, intense expression. Meanwhile, the group of kids, situated at a table positioned near the window across from the car lot, converse with a mix of excitement and hushed tones as a waitress kindly delivers more food to them. As Cary smiles warmly at Alice, the gesture leaves a significant impact on Joe and the others around them. The enormous train wreck stretches expansively for a full mile, with hundreds of military personnel working with a sense of urgency to thoroughly clean up the chaotic scene. A truck passes by both Jack and Nelec, who are walking side by side amid the scattered debris, as Jack glances skeptically at Nelec. Jack is accompanying Sheriff Pruitt, who appears distracted and absentmindedly picks up reports from his desk on his way out. As Pruitt walks off into the distance, Jack watches him leave, feeling a growing sense of unease. Nearby, restless fingers tap impatiently on a counter adjacent to a Walkman. The scene shifts to Breen, a 23-year-old, who is leisurely listening to Blondie in a station store, all alone, until Sheriff Pruitt, aged 60, enters the scene and casually tosses a candy bar to him. Breen promptly removes his headphones and proceeds to exit the store. In another part of town, Charles and Cary are engrossed in planning explosions together, while Alice observes them knowingly and suddenly performs her best impression of a zombie, much to the amusement of Joe. Alice leans in closer to Joe, pretending to bite his neck playfully, causing him to feel an unprecedented shiver down his spine. Afterward, she pulls back with a bright smile. Near the gas pumps, Jack, Edie, and Mr. Blakely appear, making their way past small, shattered fragments of red and blue plastic. Jack kneels down by the Smith and Wesson Model 19, carefully examines the broken plastic pieces, and makes a call using his walkie. Meanwhile, Angry Izzy, a 65-year-old, opens the hood of a new car, revealing a messy, disorganized engine with parts seemingly ripped away, as Jack follows him closely."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Military trucks, expansive tents, and numerous soldiers can be seen strategically positioned throughout the area, while helicopters buzz persistently in the distant sky overhead. Joe, finding a brief moment to himself, shifts his attention to Alice. She stands lost in thought, her gaze fixed intently on the harrowing sight of the train crash. The view clearly haunts and distresses her. Taking a pause from the task of reloading his gun, Joe stares deeply at the crash site until Martin and Preston come over to join them, breaking his concentration. Joe uses a camera to meticulously zoom in and methodically pan across the crash site, focusing from one wrecked car to another, all while Alice watches him with a focused, intense expression on her face. Meanwhile, in another part of the scene, a group of kids is situated at a table positioned near the window, across from the car lot. They converse with a mix of excitement and hushed tones as a waitress kindly delivers more food to them, adding to their animated discussions. When Cary smiles warmly at Alice, his gesture leaves a significant impact on Joe and those around them. The enormous train wreck stretches expansively for a full mile, and hundreds of military personnel work with a sense of urgency to thoroughly clean up the chaotic scene. Amid the scattered debris, a truck passes by both Jack and Nelec, who are walking side by side. As Jack glances skeptically at Nelec, he is accompanying Sheriff Pruitt, who appears distracted. Sheriff Pruitt absentmindedly picks up reports from his desk on his way out. As Pruitt walks off into the distance, Jack watches him leave, feeling a growing, unsettling sense of unease. Nearby, restless fingers tap impatiently on a counter located adjacent to a Walkman, adding to the tension. The scene then shifts to Breen, a 23-year-old, who is leisurely listening to Blondie on his headphones in a station store, all alone in his solitude, until Sheriff Pruitt, aged 60, enters the scene and casually tosses a candy bar to him. In response, Breen promptly removes his headphones and proceeds to exit the store. Elsewhere in town, Charles and Cary are engrossed in planning explosions together, immersed in their creative process, while Alice observes them knowingly. Suddenly, she performs her best impression of a zombie, much to Joe's amusement. Leaning in closer to him, she pretends to bite his neck playfully, causing him to feel an unprecedented shiver running down his spine before she pulls back with a bright smile. Near the gas pumps, Jack, Edie, and Mr. Blakely appear, making their way past small, shattered fragments of red and blue plastic scattered on the ground. Jack kneels down by the Smith and Wesson Model 19, carefully examining the broken plastic pieces as he makes a call using his walkie. Meanwhile, Angry Izzy, a 65-year-old with an intense demeanor, opens the hood of a new car, revealing a messy, disorganized engine with parts seemingly ripped away, as Jack follows him closely."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "The scene opens with the military presence firmly established as large trucks and tents are strategically stationed, and soldiers maintain alert positions while helicopters create a constant, distant buzz in the sky. Joe makes his way over to Alice, who stands gazing out at the scene of a train crash, clearly troubled and haunted by the sight that lies before her eyes. As Joe momentarily pauses his task of reloading his gun, his attention shifts, and he becomes transfixed by the crash, lost in thought. Martin and Preston then come over to join Joe and Alice, their presence adding weight to the moment. Observing the wreckage, Joe decides to capture a closer view; he skillfully operates a camera, adjusting the zoom and smoothly panning it from one derailed car to another at the crash site, while Alice focuses intently on his actions, her gaze unwavering. Nearby, a group of kids sit together at a table next to a window, which offers them a view across from the car lot. Their conversation is a flurry of excitement, yet they maintain a hushed tone as they engage animatedly, and a waitress approaches to deliver additional food to their table. Cary, one of the kids, beams a smile at Alice, a gesture that leaves a notable impact on Joe and the others, subtly altering the mood. Surrounding the substantial train wreck, which extends over a mile, there is a hive of activity as hundreds of military personnel work with urgency to clean up the chaotic scene. Amid the scattered debris, a truck drives past Jack and Nelec, who walk side by side, and as they navigate the clutter, Jack directs a skeptical glance in Nelec's direction. Jack accompanies Sheriff Pruitt, whose mind is visibly preoccupied as he hurriedly gathers reports from his desk before making his way out. Pruitt's departure leaves Jack standing there, watching him leave with an uneasy feeling lingering. In a different part of the scene, fingers tap impatiently on a counter, next to a Walkman, creating a rhythmic pattern. The focus shifts to Breen, who, at 23, stands alone in a station store, immersed in the music of Blondie through his headphones, until the moment Sheriff Pruitt, age 60, enters and casually tosses a candy bar to him, punctuating the silence. Breen responds by removing his headphones and subsequently exits the store. Elsewhere, Charles and Cary are deep in discussion, enthusiastically planning explosions together, their creative energy palpable. Alice observes their interaction with a knowing look, and then she shifts into character, performing her best rendition of a zombie, much to Joe's amusement. Playfully, Alice leans towards Joe, feigning a bite at his neck, and he experiences an unfamiliar shiver, a sensation new and strange to him. Pulling back, Alice smiles knowingly, adding a layer of warmth to the playful encounter. Transitioning to another part of the setting, near the gas pumps, Jack, Edie, and Mr. Blakely make their appearance, moving with purpose past scattered fragments of shattered red and blue plastic. Jack crouches down by a Smith and Wesson Model 19, meticulously examines the broken pieces of plastic, and promptly uses his walkie to make a call. Simultaneously, not far off, Angry Izzy, at 65, approaches a new car, lifting the hood to reveal an engine in disarray, with parts chaotically torn away, while Jack follows closely, intent on understanding the situation at hand."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Military trucks, tents, and soldiers are stationed while helicopters buzz in the sky, with Joe and Alice observing the train crash. Joe uses a camera to survey the crash site as Martin and Preston join them, and Alice watches him intently. Nearby, kids sit at a table near the window, quietly excited as a waitress delivers more food, and Cary's smile at Alice impacts Joe and the others. The extensive train wreck has military personnel swiftly working on the cleanup, and Jack walks amid the debris with Nelec, feeling skeptical. Together with Sheriff Pruitt, who is distractedly picking up reports, Jack feels unsettled watching Pruitt leave. Nearby, Breen listens to Blondie in a store until Sheriff Pruitt enters and tosses him a candy bar, prompting Breen to leave. Elsewhere, Charles and Cary plan explosions as Alice performs a zombie impression, amusing Joe. Alice's playful bite on Joe's neck sends a new shiver through him before she pulls back, smiling. At the gas pumps, Jack, Edie, and Mr. Blakely move past shattered plastic; Jack examines the debris and makes a call on his walkie. Meanwhile, Angry Izzy inspects a car hood, revealing a messy engine, and Jack follows him."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Military trucks, tents, and soldiers are stationed while helicopters buzz in the distant sky, reminiscent of a scene from a high-alert military response such as those during significant national emergencies. Joe moves over to Alice, who looks out at the train crash, haunted by the sight, a catastrophic derailment involving hazardous materials that has drawn federal attention. As Joe stops reloading his gun and stares at the crash, Martin and Preston join them. Joe, an aspiring filmmaker with a knack for detail, uses a camera to zoom in and pan from one car to another at the crash site, with Alice watching him intently, concerned about what they might uncover. The kids, sitting at a table near the window across from the car lot, talk excitedly but quietly as a waitress, wearing a name tag that says \"Molly's Diner,\" delivers more food, showcasing the town's only 24-hour eatery. Cary smiles at Alice, leaving an impact on Joe and the others, a moment that subtly shifts group dynamics. The massive train wreck stretches for a mile, with hundreds of military personnel working quickly to clean up the scene, indicating the scale of the environmental hazard posed by the crash. A truck passes by Jack and Nelec, who walk together amid the debris, with Jack looking at Nelec with skepticism, suspecting an undisclosed agenda. Jack is with Sheriff Pruitt, who is distracted and picks up reports from his desk, a station cluttered with urgent notices, on his way out. As Pruitt walks off, Jack watches him go, feeling unsettled as the weight of the situation sits heavily on his shoulders. Nearby, fingers tap restlessly on a counter next to a Walkman, a popular portable cassette player in the late 20th century. The scene shifts to Breen, 23, listening to Blondie, whose hit songs defined a generation, in a station store, alone, until Sheriff Pruitt, 60, enters and tosses a candy bar to him, a gesture of camaraderie in tense times. Breen removes his headphones and exits the store. Elsewhere, Charles and Cary plan explosions together, likely for their amateur filmmaking project, while Alice looks at them knowingly and performs her best zombie impression, tapping into the era's fascination with horror movies, amusing Joe. Alice leans toward Joe, pretending to bite his neck, causing him to feel a shiver he's never experienced before, a moment of unexpected vulnerability. Afterward, she pulls back, smiling, her expression a mix of mischievousness and warmth. Near the gas pumps, Jack, Edie, and Mr. Blakely appear, moving past small shattered pieces of red and blue plastic, remnants of the crash's chaos. Jack kneels by the Smith and Wesson Model 19, a reliable revolver known for its use by law enforcement, examines the broken plastic, and makes a call on his walkie, coordinating with others on the scene. Meanwhile, Angry Izzy, 65, opens a new car hood, revealing a messy engine with pieces ripped away, as Jack follows him, both puzzled and frustrated by the extent of the damage."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "The massive train wreck stretches for a mile with hundreds of military personnel working quickly to clean up the scene Jack Edie and Mr Blakely appear moving past small shattered pieces of red and blue plastic Military trucks tents and soldiers are stationed while helicopters buzz in the distant sky Afterward she pulls back smiling Near the gas pumps A truck passes by Jack and Nelec who walk together amid the debris with Jack looking at Nelec with skepticism Joe moves over to Alice who looks out at the train crash haunted by the sight Meanwhile Angry Izzy 65 opens a new car hood revealing a messy engine with pieces ripped away as Jack follows him As Joe stops reloading his gun and stares at the crash Martin and Preston join them Nearby fingers tap restlessly on a counter next to a Walkman As Joe stops reloading his gun and stares at the crash Martin and Preston join them Joe uses a camera to zoom in and pan from one car to another at the crash site with Alice watching him intently The kids sitting at a table near the window across from the car lot talk excitedly but quietly as a waitress delivers more food Cary smiles at Alice leaving an impact on Joe and the others The massive train wreck stretches for a mile with hundreds of military personnel working quickly to clean up the scene A truck passes by Jack and Nelec who walk together amid the debris with Jack looking at Nelec with skepticism Jack is with Sheriff Pruitt who is distracted and picks up reports from his desk on his way out Joe moves over to Alice who looks out at the train crash haunted by the sight As Pruitt walks off Jack watches him go feeling unsettled Nearby fingers tap restlessly on a counter next to a Walkman As Pruitt walks off Jack watches him go feeling unsettled Military trucks tents and soldiers are stationed while helicopters buzz in the distant sky The scene shifts to Breen 23 listening to Blondie in a station store alone until Sheriff Pruitt 60 enters and tosses a candy bar to him Breen removes his headphones and exits the store Elsewhere Charles and Cary plan explosions together while Alice looks at them knowingly and performs her best zombie impression amusing Joe Alice leans toward Joe pretending to bite his neck causing him to feel a shiver he is never experienced before Afterward she pulls back smiling Near the gas pumps Joe uses a camera to zoom in and pan from one car to another at the crash site with Alice watching him intently Jack Edie and Mr Blakely appear moving past small shattered pieces of red and blue plastic Jack kneels by the Smith and Wesson Model 19 examines the broken plastic and makes a call on his walkie Meanwhile Angry Izzy 65 opens a new car hood revealing a messy engine with pieces ripped away as Jack follows him"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Military trucks tents and soldiers are stationed while helicopters buzz in the distant sky. Joe moves over to Alice who looks out at the train crash haunted by the sight. As Joe stops reloading his gun and stares at the crash Martin and Preston join them. Joe uses a camera to zoom in and pan from one car to another at the crash site with Alice watching him intently. The kids sitting at a table near the window across from the car lot talk excitedly but quietly. as a waitress delivers more food. Cary smiles at Alice leaving an impact on Joe and the others. The massive train wreck stretches for a mile with hundreds of military personnel working quickly to clean up the scene. A truck passes by Jack and Nelec who walk together amid the debris with Jack looking at Nelec with skepticism. Jack is with Sheriff Pruitt who is distracted and picks up reports from his desk on his way out. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. As Pruitt walks off Jack watches him go feeling unsettled. Nearby fingers tap restlessly on a counter next to a Walkman. The scene shifts to Breen 23 listening to Blondie in a station store alone until Sheriff Pruitt 60 enters and tosses a candy bar to him. Breen removes his headphones and exits the store. Elsewhere Charles and Cary plan explosions together while Alice looks at them knowingly and performs her best zombie impression amusing Joe. Alice leans toward Joe pretending to bite his neck causing him to feel a shiver he is never experienced before. Afterward she pulls back smiling Near the gas pumps. Jack Edie and Mr Blakely appear moving past small shattered pieces of red and blue plastic. Jack kneels by the Smith and Wesson. Model 19 examines the broken plastic and makes a call on his walkie. Meanwhile Angry Izzy 65 opens a new car hood revealing a messy engine with pieces ripped away as Jack follows him."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Military trucks tents and soldiers are stationed while helicopters buzz in the distant sky. Joe moves over to Alice who looks out at the train crash haunted by the sight. As Joe stops reloading his gun and stares at the crash Martin and Preston join them. Joe uses a camera to zoom in and pan from one car to another at the crash site with Alice watching him intently. The kids sitting at a table near the window across from the car lot talk excitedly but quietly. as a waitress delivers more food. Cary smiles at Alice leaving an impact on Joe and the others. The massive train wreck stretches for a mile with hundreds of military personnel working quickly to clean up the scene. A truck passes by Jack and Nelec who walk together amid the debris with Jack looking at Nelec with skepticism. Jack is with Sheriff Pruitt who is distracted and picks up reports from his desk on his way out. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. As Pruitt walks off Jack watches him go feeling unsettled. Nearby fingers tap restlessly on a counter next to a Walkman. The scene shifts to Breen 23 listening to Blondie in a station store alone until Sheriff Pruitt 60 enters and tosses a candy bar to him. Breen removes his headphones and exits the store. Elsewhere Charles and Cary plan explosions together while Alice looks at them knowingly and performs her best zombie impression amusing Joe. Alice leans toward Joe pretending to bite his neck causing him to feel a shiver he is never experienced before. Afterward she pulls back smiling Near the gas pumps. Jack Edie and Mr Blakely appear moving past small shattered pieces of red and blue plastic. Jack kneels by the Smith and Wesson. Model 19 examines the broken plastic and makes a call on his walkie. Meanwhile Angry Izzy 65 opens a new car hood revealing a messy engine with pieces ripped away as Jack follows him."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Military trucks tents and soldiers are stationed while helicopters buzz in the distant sky. Joe moves over to Alice who looks out at the train crash haunted by the sight. As Joe stops reloading his gun and stares at the crash Martin and Preston join them. Joe uses a camera to zoom in and pan from one car to another at the crash site with Alice watching him intently. The kids sitting at a table near the window across from the car lot talk excitedly but quietly. Alice leans toward Joe pretending to bite his neck causing him to feel a shiver he is never experienced before. Afterward she pulls back smiling Near the gas pumps. Jack Edie and Mr Blakely appear moving past small shattered pieces of red and blue plastic. Jack kneels by the Smith and Wesson. Model 19 examines the broken plastic and makes a call on his walkie. Meanwhile Angry Izzy 65 opens a new car hood revealing a messy engine with pieces ripped away as Jack follows him."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Military trucks tents and soldiers are stationed while helicopters buzz in the distant sky. Joe moves over to Alice who looks out at the train crash haunted by the sight. Jack kneels by the Smith and Wesson. Model 19 examines the broken plastic and makes a call on his walkie. Meanwhile Angry Izzy 65 opens a new car hood revealing a messy engine with pieces ripped away as Jack follows him."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Military trucks, tents, and kangaroos are stationed while dolphins buzz in the distant sky. A rabbit moves over to a squirrel, who looks out at the train crash, haunted by the sight. As the rabbit stops reloading his gun and stares at the crash, a giraffe and a penguin join them. The rabbit uses a camera to zoom in and pan from one car to another at the crash site, with the squirrel watching him intently. The flamingos, sitting at a table near the window across from the car lot, talk excitedly but quietly as a waitress delivers more food. A turtle smiles at the squirrel, leaving an impact on the rabbit and the others. The massive train wreck stretches for a mile, with hundreds of dandelions working quickly to clean up the scene. A truck passes by a zebra and a kangaroo, who walk together amid the debris, with the zebra looking at the kangaroo with skepticism. The zebra is with a pirate, who is distracted and picks up reports from his desk on his way out. As the pirate walks off, the zebra watches him go, feeling unsettled. Nearby, fingers tap restlessly on a counter next to a Walkman. The scene shifts to a unicorn, 23, listening to Blondie in a station store, alone, until the pirate, 60, enters and tosses a candy bar to the unicorn. The unicorn removes headphones and exits the store. Elsewhere, a lion and a flamingo plan explosions together, while the squirrel looks at them knowingly and performs her best zombie impression, amusing the rabbit. The squirrel leans toward the rabbit, pretending to bite his neck, causing him to feel a shiver he's never experienced before. Afterward, she pulls back, smiling. Near the gas pumps, a zebra, a dolphin, and a unicorn appear, moving past small shattered pieces of red and blue plastic. The zebra kneels by the Smith and Wesson Model 19, examines the broken plastic, and makes a call on his walkie. Meanwhile, Angry Ivan, 65, opens a new car hood, revealing a messy engine with pieces ripped away, as the zebra follows him."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Military vans, yurts, and marines are stationed while blimps buzz in the distant sky. Joe moves over to Alice, who looks out at the barge crash, haunted by the sight. As Joe stops reloading his crossbow and stares at the crash, Martin and Preston join them. Joe uses a telescope to zoom in and pan from one yacht to another at the crash site, with Alice watching him intently. The kids, sitting at a bench near the door across from the bicycle shop, talk excitedly but quietly as a waiter delivers more drinks. Cary smiles at Alice, leaving an impact on Joe and the others. The massive barge wreck stretches for a mile, with hundreds of naval personnel working quickly to clean up the scene. A jeep passes by Jack and Nelec, who walk together amid the rubble, with Jack looking at Nelec with skepticism. Jack is with Officer Pruitt, who is distracted and picks up blueprints from his desk on his way out. As Pruitt walks off, Jack watches him go, feeling unsettled. Nearby, fingers tap restlessly on a bench next to a boombox. The scene shifts to Breen, 23, listening to Bowie in a newsstand, alone, until Officer Pruitt, 60, enters and tosses a sandwich to him. Breen removes his earbuds and exits the newsstand. Elsewhere, Charles and Cary plan fireworks together, while Alice looks at them knowingly and performs her best ghost impression, amusing Joe. Alice leans toward Joe, pretending to bite his arm, causing him to feel a shiver he's never experienced before. Afterward, she pulls back, smiling. Near the bicycle racks, Jack, Edie, and Mr. Blakely appear, moving past small shattered pieces of yellow and green glass. Jack kneels by the Colt Python, examines the broken glass, and makes a call on his pager. Meanwhile, Angry Izzy, 65, opens a new motorcycle hood, revealing a messy engine with pieces ripped away, as Jack follows him."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Military trucks, tents, and soldiers are parked while helicopters circle in the distant sky. Joe strolls over to Alice, who examines the train crash, captivated by the sight. As Joe stops assembling his gun and gazes at the crash, Martin and Preston approach them. Joe holds a camera to zoom in and glide from one car to another at the crash site, with Alice observing him intently. The kids, resting at a table near the window across from the car lot, whisper excitedly as a waitress hands out more food. Cary winks at Alice, leaving an impression on Joe and the others. The massive train wreck sprawls for a mile, with hundreds of military personnel maneuvering quickly to tidy up the scene. A truck rolls by Jack and Nelec, who stroll together amid the debris, with Jack glancing at Nelec with curiosity. Jack is with Sheriff Pruitt, who is preoccupied and flips through reports from his desk on his way out. As Pruitt heads off, Jack observes him leave, feeling uneasy. Nearby, fingers drum absentmindedly on a counter next to a Walkman. The scene shifts to Breen, 23, enjoying Blondie in a station store, alone, until Sheriff Pruitt, 60, strides in and tosses a candy bar to him. Breen takes off his headphones and strolls out of the store. Elsewhere, Charles and Cary discuss fireworks together, while Alice glances at them knowingly and performs her best ghost impression, entertaining Joe. Alice leans toward Joe, mimicking a bite on his neck, causing him to feel a thrill he's never known before. Afterward, she withdraws, grinning. Near the gas pumps, Jack, Edie, and Mr. Blakely appear, stepping over small shattered pieces of red and blue plastic. Jack crouches by the Smith and Wesson Model 19, inspects the broken plastic, and makes a call on his walkie. Meanwhile, Angry Izzy, 65, peers under a new car hood, revealing a messy engine with components torn away, as Jack trails him."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Fireworks, pillows, and giraffes are stationed while bicycles buzz in the distant ocean. Sam moves over to Lily, who looks out at the ship explosion, haunted by the sight. As Sam stops reloading his paintbrush and stares at the explosion, Oliver and Taylor join them. Sam uses a telescope to zoom in and pan from one pencil to another at the explosion site, with Lily watching him intently. The spoons, sitting at a ladder near the mirror across from the backpack pile, talk excitedly but quietly as a dancer delivers more balloons. Kevin smiles at Lily, leaving an impact on Sam and the others. The massive shipwreck stretches for a mile, with hundreds of yoga instructors working quickly to clean up the scene. A bicycle passes by Max and Harper, who walk together amid the confetti, with Max looking at Harper with skepticism. Max is with Chef Gordon, who is distracted and picks up guitars from his bucket on his way out. As Gordon walks off, Max watches him go, feeling unsettled. Nearby, toes tap restlessly on a keyboard next to a Game Boy. The scene shifts to Drew, 23, listening to The Beatles in a garden store, alone, until Chef Gordon, 60, enters and tosses a rubber duck to him. Drew removes his earmuffs and exits the store. Elsewhere, Alex and Kevin plan fireworks together, while Lily looks at them knowingly and performs her best ghost impression, amusing Sam. Lily leans toward Sam, pretending to bite his knee, causing him to feel a shiver he's never experienced before. Afterward, she pulls back, smiling. Near the bookcases, Max, Nora, and Mrs. Jenkins appear, moving past small shattered pieces of yellow and green glass. Max kneels by the LEGO set, examines the broken glass, and makes a call on his megaphone. Meanwhile, Grouchy Fred, 65, opens a new bicycle seat, revealing a messy carburetor with pieces ripped away, as Max follows him."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Clowns, bicycles, and chefs are parked while drones glide in the distant sky. Sam dances over to Lisa, who gazes out at the boat parade, mesmerized by the view. As Sam starts tuning his violin and gapes at the parade, Tony and Max approach them. Sam uses a telescope to focus in and scan from one yacht to another at the parade route, with Lisa analyzing him intently. The dogs, lounging at a booth near the window across from the parking lot, whisper animatedly but softly as a baker places more cookies. Charlie winks at Lisa, leaving an impression on Sam and the others. The giant ship floats for a mile, with hundreds of divers working energetically to explore the area. A bicycle glides past Frank and Oliver, who stroll together along the promenade, with Frank observing Oliver with curiosity. Frank is with Principal Mason, who is distracted and grabs notes from his clipboard on his way in. As Mason strolls in, Frank observes him enter, feeling uneasy. Nearby, paws tap impatiently on a table next to a radio. The scene shifts to Avery, 35, humming to ABBA in a music store, alone, until Principal Mason, 45, enters and slides a cupcake to him. Avery puts down his headphones and leaves the store. Elsewhere, Harvey and Charlie orchestrate fireworks together, while Lisa gazes at them knowingly and performs her best robot dance, entertaining Sam. Lisa leans toward Sam, pretending to tickle his arm, causing him to feel a sensation he's never felt before. Afterward, she steps back, grinning. Near the soda machines, Frank, Betty, and Mr. Everett appear, walking past small scattered pieces of green and yellow paper. Frank crouches by the vintage record player, inspects the torn paper, and makes a call on his phone. Meanwhile, Curious Ted, 40, unveils a new scooter seat, revealing a tangled mess of wires hidden underneath, as Frank trails him."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Military bicycles, igloos, and chefs are assembled while kites flutter in the distant sky. Joe shifts over to Alice, who peers out at the boat collision, haunted by the sight. As Joe stops adjusting his camera and gazes at the collision, Martin and Preston join them. Joe uses a phone to focus and glide from one bicycle to another at the crash scene, with Alice observing him attentively. The kids, lounging at a bench near the doorway across from the bicycle lot, whisper animatedly as a librarian hands over more books. Cary grins at Alice, leaving an impression on Joe and the others. The extensive boat wreck stretches for a mile, with hundreds of chefs working hastily to rearrange the scene. A bicycle rolls past Jack and Nelec, who stroll together amid the clutter, with Jack regarding Nelec with skepticism. Jack is with Sheriff Pruitt, who is distracted and collects letters from his desk on his way out. As Pruitt strides away, Jack observes him depart, feeling unsettled. Nearby, fingers tap restlessly on a table next to a typewriter. The scene shifts to Breen, 23, listening to Abba in a bakery, alone, until Sheriff Pruitt, 60, enters and tosses a comic book to him. Breen removes his earbuds and leaves the bakery. Elsewhere, Charles and Cary devise fireworks together, while Alice looks at them knowingly and performs her best vampire impression, amusing Joe. Alice leans toward Joe, pretending to nibble his ear, causing him to feel a chill he's never experienced before. Afterward, she pulls back, grinning. Near the telephone booths, Jack, Edie, and Mr. Blakely appear, moving past small shattered pieces of yellow and green glass. Jack crouches by the violin, examines the broken glass, and makes a call on his radio. Meanwhile, Grumpy Izzy, 65, opens a new suitcase, revealing a disordered collection of clothes with pieces torn away, as Jack follows him."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Pirate ships, cottages, and parrots are anchored while dragons glide in the distant forest. Tim drifts over to Lucy, who peers out at the spaceship explosion, intrigued by the panorama. As Tim pauses untangling his kite and gapes at the explosion, Sam and Jamie accompany them. Tim handles a telescope to focus in and glide from one spaceship to another at the explosion site, with Lucy observing him keenly. The puppies, lounging on a sofa near the curtain opposite the garden, murmur eagerly but softly as a chef presents more pastries. Theo grins at Lucy, leaving an impression on Tim and the others. The colossal spaceship ruin stretches for a league, with throngs of circus performers laboring swiftly to sweep up the area. A carriage moves past Tom and Gina, who stroll together amid the fragments, with Tom glancing at Gina with doubt. Tom is with Professor Yates, who is preoccupied and collects scrolls from his mantle on his way out. As Yates wanders off, Tom observes him leave, feeling anxious. Nearby, feathers drum restlessly on a book beside a phonograph. The scene transitions to Quinn, 23, enjoying Mozart in a library, alone, until Professor Yates, 60, enters and flings a novel to him. Quinn detaches his earbuds and leaves the library. Somewhere else, Max and Theo devise fireworks together, while Lucy glances at them knowingly and showcases her finest pirate imitation, entertaining Tim. Lucy leans toward Tim, pretending to nibble his ear, causing him to feel an excitement he's never known before. Afterward, she withdraws, grinning. Near the beehives, Tom, Lila, and Mr. Jones appear, drifting past tiny shattered pieces of green and yellow glass. Tom crouches by the Gibson and Fender Model 27, inspects the shattered glass, and sends a message on his pager. Meanwhile, Happy Alex, 65, opens a new plane fuselage, revealing a chaotic cockpit with panels torn off, as Tom trails him."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Military trucks, tents, and soldiers surround the train crash site while helicopters hover above. Joe, along with Alice, Martin, and Preston, observes the wreck through a camera. The kids discuss the scene quietly at a nearby table, and Cary's smile affects Joe and others. The crash stretches a mile, with the military working swiftly. Jack and Nelec walk through the debris, with Jack feeling skeptical. Sheriff Pruitt, distracted, picks up reports and leaves, unsettling Jack. Breen listens to music in a store until Pruitt enters, tossing him a candy bar. Charles and Cary plan explosions as Alice amuses Joe with a zombie impression. Nearby, Jack, Edie, and Mr. Blakely survey shattered plastic pieces, with Jack making a call. Angry Izzy reveals a car engine in disarray, and Jack follows him."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Meanwhile Angry Izzy 65 opens a new car hood revealing a messy engine with pieces ripped away as Jack follows him Model 19 examines the broken plastic and makes a call on his walkie Jack kneels by the Smith and Wesson Jack Edie and Mr Blakely appear moving past small shattered pieces of red and blue plastic Afterward she pulls back smiling Near the gas pumps Alice leans toward Joe pretending to bite his neck causing him to feel a shiver he is never experienced before Elsewhere Charles and Cary plan explosions together while Alice looks at them knowingly and performs her best zombie impression amusing Joe Breen removes his headphones and exits the store The scene shifts to Breen 23 listening to Blondie in a station store alone until Sheriff Pruitt 60 enters and tosses a candy bar to him Nearby fingers tap restlessly on a counter next to a Walkman As Pruitt walks off Jack watches him go feeling unsettled Jack is with Sheriff Pruitt who is distracted and picks up reports from his desk on his way out A truck passes by Jack and Nelec who walk together amid the debris with Jack looking at Nelec with skepticism The massive train wreck stretches for a mile with hundreds of military personnel working quickly to clean up the scene Cary smiles at Alice leaving an impact on Joe and the others as a waitress delivers more food The kids sitting at a table near the window across from the car lot talk excitedly but quietly Joe uses a camera to zoom in and pan from one car to another at the crash site with Alice watching him intently As Joe stops reloading his gun and stares at the crash Martin and Preston join them Joe moves over to Alice who looks out at the train crash haunted by the sight Military trucks tents and soldiers are stationed while helicopters buzz in the distant sky"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Model 19 examines the broken plastic and makes a call on his walkie as a waitress delivers more food Elsewhere Charles and Cary plan explosions together while Alice looks at them knowingly and performs her best zombie impression amusing Joe The kids sitting at a table near the window across from the car lot talk excitedly but quietly Jack is with Sheriff Pruitt who is distracted and picks up reports from his desk on his way out Breen removes his headphones and exits the store Alice leans toward Joe pretending to bite his neck causing him to feel a shiver he is never experienced before Jack kneels by the Smith and Wesson Cary smiles at Alice leaving an impact on Joe and the others The scene shifts to Breen 23 listening to Blondie in a station store alone until Sheriff Pruitt 60 enters and tosses a candy bar to him Jack Edie and Mr Blakely appear moving past small shattered pieces of red and blue plastic As Pruitt walks off Jack watches him go feeling unsettled Joe moves over to Alice who looks out at the train crash haunted by the sight Nearby fingers tap restlessly on a counter next to a Walkman As Joe stops reloading his gun and stares at the crash Martin and Preston join them Afterward she pulls back smiling Near the gas pumps The massive train wreck stretches for a mile with hundreds of military personnel working quickly to clean up the scene A truck passes by Jack and Nelec who walk together amid the debris with Jack looking at Nelec with skepticism Military trucks tents and soldiers are stationed while helicopters buzz in the distant sky Joe uses a camera to zoom in and pan from one car to another at the crash site with Alice watching him intently Meanwhile Angry Izzy 65 opens a new car hood revealing a messy engine with pieces ripped away as Jack follows him"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Nearby fingers tap restlessly on a counter next to a Walkman The scene shifts to Breen 23 listening to Blondie in a station store alone until Sheriff Pruitt 60 enters and tosses a candy bar to him Breen removes his headphones and exits the store Elsewhere Charles and Cary plan explosions together while Alice looks at them knowingly and performs her best zombie impression amusing Joe Alice leans toward Joe pretending to bite his neck causing him to feel a shiver he is never experienced before Afterward she pulls back smiling Near the gas pumps Jack Edie and Mr Blakely appear moving past small shattered pieces of red and blue plastic Jack kneels by the Smith and Wesson Model 19 examines the broken plastic and makes a call on his walkie Meanwhile Angry Izzy 65 opens a new car hood revealing a messy engine with pieces ripped away as Jack follows him Military trucks tents and soldiers are stationed while helicopters buzz in the distant sky Joe moves over to Alice who looks out at the train crash haunted by the sight As Joe stops reloading his gun and stares at the crash Martin and Preston join them Joe uses a camera to zoom in and pan from one car to another at the crash site with Alice watching him intently The kids sitting at a table near the window across from the car lot talk excitedly but quietly as a waitress delivers more food Cary smiles at Alice leaving an impact on Joe and the others The massive train wreck stretches for a mile with hundreds of military personnel working quickly to clean up the scene A truck passes by Jack and Nelec who walk together amid the debris with Jack looking at Nelec with skepticism Jack is with Sheriff Pruitt who is distracted and picks up reports from his desk on his way out As Pruitt walks off Jack watches him go feeling unsettled"
        }
      ]
    }
  ]
}