{
  "ground_truth": "A little band of drummers and flute players suddenly begins to play as the crowd starts to jump up to see, and the flower petals begin to float in the sky. Gandhi and the procession of marchers and ashramites stride down the dusty road toward them, accompanied by a newsreel truck and crew riding along about two-thirds of the way back, followed by a car of cameramen and reporters at the end. Gandhi looks at Walker, walking a few paces behind him at the side of the procession, wiping sweat from his face. Gandhi smiles, turns back, shakes his head, and grins as he passes by the policemen and into the cheers of the crowd. As the procession trails into the village, several villagers with knapsacks or bundles strung over their shoulders run around the police and join the end of the procession. Gandhi stands in the center of the wildly cheering crowd as the camera pulls back and back, and the shot becomes black and white while we hear the music of Movietone News. With that, we see the Movietone Music tag, and as the film fades, the lights go up on a couple of civil servants moving about to raise the window shades while Lord Irwin stares at the blank screen set up in his office, surrounded by the general, the brigadier, the senior police officer, Irwin's ADC, and the principal secretary. The two men who ran the projector quietly dismantle it. Finally, Irwin turns to the senior police officer, who fidgets but answers the implied questions, as Irwin sighs and nods. For the first time, Irwin is truly angry, and his face falls. Meanwhile, men, women, and children are making little paper packets of salt from piles heaped along long tables. A group of policemen barge into the room, knocking tables, salt, and paper in every direction with their lathis, and seize some of the volunteers for arrest. In the chaos, an old man calmly picks up a piece of paper from the floor, a handful of salt, and folds another packet. Nehru is on the back of a big open truck that is stationary in the street, loaded with boxes containing salt packets, and he and eight or nine others are selling them to the people who flock about the truck. The sound of horses is heard, and Nehru lifts his head as mounted Indian police come down either side of the street, a wave of foot police running forward down the center. Some of the people run, while others deliberately stand fast as the mounted police converge on the truck. Nehru is grabbed and hurled so that he half falls, half leaps to the street, and one of the men with him is knocked along the ground by a policeman.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "A small troupe of percussionists and flute musicians abruptly starts to perform as the throng begins to leap up to view, and the blossom petals commence to drift in the sky. Gandhi and the parade of demonstrators and ashram residents march down the arid path toward them, escorted by a newsreel vehicle and crew riding along approximately two-thirds of the way back, trailed by an automobile of photographers and journalists at the rear. Gandhi gazes at Walker, strolling a few strides behind him at the flank of the procession, wiping perspiration from his visage. Gandhi beams, turns back, shakes his head, and grins as he passes by the constables and into the acclaim of the crowd. As the parade trails into the hamlet, several villagers with backpacks or bundles slung over their shoulders dash around the police and join the rear of the procession. Gandhi stands in the core of the wildly cheering crowd as the camera pulls back and back, and the shot transforms into monochrome while we hear the music of Movietone News. With that, we see the Movietone Music tag, and as the film fades, the lights rise on a pair of civil servants moving about to raise the window shades while Lord Irwin gazes at the blank screen set up in his office, surrounded by the general, the brigadier, the senior police officer, Irwin's aide-de-camp, and the principal secretary. The two men who operated the projector silently disassemble it. Finally, Irwin turns to the senior police officer, who fidgets but responds to the implied inquiries, as Irwin sighs and nods. For the first time, Irwin is truly irate, and his face falls. Meanwhile, men, women, and children are making small paper packets of salt from heaps piled along lengthy tables. A squad of policemen barges into the room, toppling tables, salt, and paper in every direction with their lathis, and seize some of the volunteers for arrest. In the turmoil, an elderly man calmly picks up a piece of paper from the floor, a handful of salt, and folds another packet. Nehru is on the rear of a large open truck that is stationary in the street, loaded with boxes containing salt packets, and he and eight or nine others are vending them to the people who gather about the truck. The sound of hooves is heard, and Nehru raises his head as mounted Indian police come down each side of the street, a wave of foot police sprinting forward down the center. Some of the people flee, while others intentionally stand firm as the mounted police converge on the truck. Nehru is seized and thrown so that he half falls, half leaps to the street, and one of the men with him is knocked along the ground by a constable."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "A little band of drummers and flute players is suddenly begun to be played by as the crowd is started to jump up to see, and the flower petals are begun to be floated in the sky by them. Gandhi and the procession of marchers and ashramites are striding down the dusty road toward them, and they are accompanied by a newsreel truck and crew that rides along about two-thirds of the way back, following a car of cameramen and reporters at the end. Walker is looked at by Gandhi, as he walks a few paces behind him at the side of the procession, and sweat is wiped from his face by Walker. Gandhi is smiled by him, and he turns back, shakes his head, and grins as the policemen are passed by him and the cheers of the crowd are entered. As the procession is trailed into the village, several villagers with knapsacks or bundles strung over their shoulders are running around the police and the end of the procession is joined by them. Gandhi is standing in the center of the wildly cheering crowd as the camera is pulled back and back, and the shot is turned into black and white while the music of Movietone News is heard. With that, the Movietone Music tag is seen by us, and as the film fades, the lights are raised up by a couple of civil servants moving about to raise the window shades while Lord Irwin stares at the blank screen set up in his office, surrounding by the general, the brigadier, the senior police officer, Irwin's ADC, and the principal secretary. The projector is quietly dismantled by the two men who ran it. Finally, the senior police officer is turned to by Irwin, who fidgets but answers the implied questions, and Irwin sighs and nods. For the first time, true anger is shown by Irwin, and his face falls. Meanwhile, little paper packets of salt are being made by men, women, and children from piles heaped along long tables. A group of policemen barge into the room, knocking tables, salt, and paper in every direction with their lathis, and they seize some of the volunteers for arrest. In the chaos, a piece of paper from the floor is calmly picked up by an old man, a handful of salt, and another packet is folded by him. Nehru is standing on the back of a big open truck that is stationary in the street, loaded with boxes containing salt packets, and the truck is used by him and eight or nine others to sell them to the people who flock about. The sound of horses is heard by him, and Nehru lifts his head as mounted Indian police come down either side of the street, a wave of foot police running forward down the center. Some of the people run, while others deliberately stand fast as the mounted police converge on the truck. Nehru grabs and hurls himself so that he half falls, half leaps to the street, and a policeman knocks one of the men with him along the ground."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "A small band of drummers and flutists begins to play as the crowd jumps to see flower petals floating in the sky. Gandhi and a procession of marchers and ashramites stride down the dusty road, accompanied by a newsreel truck and crew, with a car of cameramen and reporters following. Gandhi glances at Walker, wipes sweat from his face, smiles, and shakes his head, greeting the cheering crowd. As the procession enters the village, villagers with knapsacks join in. Gandhi stands amid cheering people as the camera pulls back in black and white to Movietone News music. The film fades, and lights reveal civil servants raising window shades while Lord Irwin, with military and police officials, watches. The projector is dismantled quietly. Irwin questions the senior police officer and, for the first time, appears truly angry. Meanwhile, people make small salt packets when policemen storm in, scattering tables, salt, and paper, and arrest volunteers. Amid chaos, an old man calmly makes another salt packet. Nehru, on a stationary open truck loaded with salt boxes, sells them to people. As mounted police approach, some flee while others stand firm. Nehru is seized and thrown to the street, and another man is knocked down by a policeman."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Drummers and flute players begin to play as the crowd jumps to see flower petals floating. Gandhi and his marchers walk down the road, with a newsreel truck following two-thirds back and a car with cameramen at the end. Gandhi smiles and shakes his head at Walker, then passes policemen, greeted by the crowd's cheers. Villagers join the procession as it enters the village. Gandhi stands in a cheering crowd as the scene turns black and white with Movietone News music. The Movietone Music tag appears as the film fades. Lights come up on civil servants raising window shades while Lord Irwin watches in his office, surrounded by officials. Two men dismantle the projector, and Irwin turns to a fidgeting senior police officer, sighing angrily. Men, women, and children make paper salt packets at long tables until police knock everything over and arrest volunteers. Amid the chaos, an old man calmly makes another packet. Nehru, on a stationary truck loaded with salt packets, sells them as police on horses and foot approach. People run or stand firm as mounted police converge on the truck. Nehru is grabbed and falls to the street, and one companion is knocked over by a policeman."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "A small, lively band of drummers and flute players, filled with enthusiasm, suddenly begins to play their vibrant tunes as the gathered crowd eagerly jumps up to catch a glimpse of the events unfolding, and beautiful flower petals gently begin to float and drift through the sky. Gandhi and the orderly procession of marchers and ashramites stride purposefully down the dusty road towards them, all the while being accompanied by a newsreel truck and its dedicated crew, who are strategically positioned about two-thirds of the way back, followed closely by a car packed with attentive cameramen and reporters bringing up the rear. Gandhi turns his attention towards Walker, who is walking a few paces behind him, slightly to the side of the procession, and takes a moment to wipe the sweat from his face. With a calm demeanor, Gandhi smiles softly, turns back around, shakes his head gently, and grins as he gracefully passes by the policemen, immersing himself into the welcoming cheers of the crowd. As the procession gradually trails into the village, several curious villagers carrying knapsacks or bundles slung over their shoulders find ways to run around the police, eager to join the tail end of the procession. Gandhi stands proudly in the center of the wildly cheering crowd, as the camera slowly pulls back and back, and the visual transforms into black and white while the nostalgic music of Movietone News fills the air. In that moment, we witness the Movietone Music tag, and as the film gradually fades, the lights are brought up on a couple of civil servants who move about to raise the window shades, while Lord Irwin intently stares at the blank screen set up in his office, surrounded by the general, the brigadier, the senior police officer, Irwin's ADC, and the principal secretary. Meanwhile, the two men responsible for running the projector quietly dismantle it, making it clear that everything has come to an end. At last, Irwin turns his attention to the senior police officer, who fidgets slightly but manages to answer the implied questions, as Irwin heaves a heavy sigh and nods. For the very first time, Irwin appears truly angry, with his face visibly falling. Meanwhile, men, women, and children are busily engaged in creating small paper packets, which they fill from piles of salt heaped along long tables. A group of policemen burst aggressively into the room, wreaking havoc as they knock tables, salt, and paper in every possible direction with their lathis, and proceed to seize some of the volunteers for arrest. Amidst the ensuing chaos, an old man calmly picks up a piece of paper from the floor, gathers a handful of salt, and folds another packet with steady hands. Nehru is seen standing on the back of a large, open truck that remains stationary in the street, loaded with boxes containing numerous salt packets, as he and eight or nine others enthusiastically sell them to the throngs of people who gather around the truck. The sound of horses galloping is soon heard, prompting Nehru to lift his head as mounted Indian police advance down either side of the street, followed by a wave of foot police rushing forward down the center. Some individuals panic and run, while others make a deliberate choice to stand their ground as the mounted police converge on the truck. Nehru is swiftly grabbed and forcefully hurled in such a way that he half falls, half leaps to the street, and one of the men accompanying him is knocked along the ground by a forceful blow from a policeman."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "A small, lively band consisting of enthusiastic drummers and flute players suddenly begins to play their vibrant, energetic tunes. This newfound energy fills the air as the gathered crowd quickly jumps up, eager to catch a glimpse of the unfolding events before them. At the same time, beautiful flower petals gently start to float and drift through the bright sky. Amidst this lively scene, Gandhi and the orderly procession of marchers and ashramites stride purposefully down the dusty road heading towards them. They are accompanied by a dedicated newsreel truck and its crew, strategically positioned about two-thirds of the way back in the procession. Following closely behind is a car packed with attentive cameramen and reporters, bringing up the rear of the formation. Gandhi momentarily diverts his attention towards Walker, who is walking a few paces behind him, slightly to the side of the bustling procession. During this brief pause, Gandhi takes a moment to wipe the sweat from his face with a calm demeanor. He then smiles softly, turns back around, shakes his head gently, and grins as he gracefully passes by the policemen, fully immersing himself in the welcoming cheers of the enthusiastic crowd. As the procession continues to trail gradually into the village, several curious villagers with knapsacks or bundles slung over their shoulders eagerly find ways to run around the police, hoping to join the tail end of the procession. Gandhi stands confidently and proudly at the center of the wildly cheering crowd while the camera slowly pulls back and back, the visuals transforming into black and white, accompanied by the nostalgic music of Movietone News filling the air. In that evocative moment, we witness the Movietone Music tag. As the film gradually fades out, the lights are brought up on a couple of civil servants who move about to raise the window shades, while Lord Irwin intently stares at the now blank screen set up in his office. He is surrounded by the general, the brigadier, the senior police officer, Irwin's attentive ADC, and the principal secretary. Meanwhile, the two men responsible for running the projector quietly dismantle it, making it undeniably clear that everything has come to an end. At last, Irwin turns his attention to the senior police officer, who fidgets slightly under the pressure but manages to answer the implied questions, as Irwin heaves a heavy, contemplative sigh and nods. For the very first time, Irwin's face visibly shows true anger, his expression falling noticeably. Meanwhile, men, women, and children are busily engaged in the intricate task of creating small paper packets, which they fill from piles of salt heaped along long tables. Suddenly, a group of aggressive policemen burst into the room, wreaking havoc as they knock over tables, scattering salt and paper in every possible direction with their lathis, proceeding to seize and arrest some of the volunteers. Amidst the ensuing chaos, an old man calmly picks up a piece of paper from the floor, gathers a handful of salt, and with steady hands, folds another packet. Nehru is then seen standing on the back of a large, open truck, which remains stationary in the street. This truck is loaded with boxes containing numerous salt packets, and Nehru, along with eight or nine others, enthusiastically sells them to the throngs of people gathering around the vehicle. Soon, the sound of galloping horses is heard, prompting Nehru to lift his head as mounted Indian police advance down either side of the street. They are followed by a wave of foot police rushing forward down the center. Some individuals panic and flee, while others make a deliberate choice to stand their ground as the mounted police converge on the truck. Nehru is swiftly grabbed and forcefully hurled in such a manner that he half falls, half leaps to the street, all while one of the men accompanying him is knocked along the ground by a forceful blow from a policeman."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "As a little band of drummers strikes up a rhythm alongside the gentle melodies of flute players, the music abruptly swells through the air, causing the assembled crowd to leap up with excitement, their eyes straining to catch sight of the spectacle unfolding before them. In the sky above, an enchanting shower of flower petals begins its descent, dancing gracefully on the breeze. Down the dusty road, Gandhi leads a dignified procession of marchers and ashramites, their steps measured and purposeful. A newsreel truck hums along, nearly two-thirds of the way back in the line, its crew diligently capturing the moment, followed closely by a car teeming with eager cameramen and reporters, diligently documenting the historic march. As they proceed, Gandhi turns slightly, catching a glimpse of Walker, a few paces behind, perspiration glistening on his brow, and in a rare moment of levity, Gandhi offers Walker a reassuring smile, turns his head back to the front, shakes his head slightly, and allows a wide grin to spread across his face as they pass the watchful eyes of policemen, their presence dwarfed by the jubilant cheers of the welcoming crowd. The procession continues on its course, trailing into a village where the atmosphere is electric with excitement. A number of villagers, burdened with knapsacks or bundles slung over their shoulders, dart around the police cordon and seamlessly blend into the back of the procession, eager to join the cause. Gandhi, a beacon amidst the wildly cheering mass, stands firm as the camera slowly pulls away, the vibrant scene transitioning to a black-and-white frame, while the melodious strains of Movietone News underscore the moment. In a sudden shift, the Movietone Music tag appears, the scene dissolving as lights gradually illuminate a room where a couple of civil servants methodically move about, raising the window shades to let in the light. Lord Irwin, seated in his office, is surrounded by a cadre of authority figures—the general, the brigadier, the senior police officer, his aide-de-camp, and the principal secretary—all fixated on the now-blank screen. Meanwhile, the two men who managed the projector silently begin to dismantle the equipment. Irwin, visibly nettled, turns his attention to the senior police officer, who shifts uncomfortably and responds to Irwin's unspoken questions. Irwin exhales deeply, acknowledges the answers with a nod, yet for the first time, his demeanor fractures, revealing a flash of genuine anger as his composure falters. Concurrently, in another locale, men, women, and children diligently fashion small paper packets of salt, heaping piles laid out on long tables serving as their resource. Their labor is interrupted when a phalanx of policemen bursts into the room, their lathis swinging with abandon, upending tables, and scattering salt and paper in chaotic disarray as they seize several volunteers for arrest. Amidst the turmoil, an elderly man maintains a serene calm, stooping to retrieve a piece of scattered paper, scooping up a handful of salt, and folding yet another packet with care. Not far away, Nehru perches on the back of a large open truck, parked statically on a bustling street. This vehicle is laden with boxes brimming with salt packets, and amid this scene, Nehru, accompanied by eight or nine others, energetically sells these packets to the thronging masses that gather around the truck with eager energy. The clip-clop of horses' hooves suddenly punctuates the air, prompting Nehru to lift his gaze as mounted Indian police materialize on either side of the street, a coordinated wave of foot police surging forward down the center. Some among the crowd scatter in haste, while others stand their ground defiantly as the mounted police converge inexorably upon the truck. Amidst the ensuing commotion, Nehru is grabbed forcefully, his body jolting as he half falls, half leaps onto the street below, while one of his comrades finds himself knocked to the ground by a relentless policeman."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "A little band of drummers and flute players begins to play as the crowd eagerly strains to catch a glimpse, enjoying the spectacle of flower petals floating in the sky. Gandhi and his procession of marchers and ashramites advance along the dusty road, accompanied by a newsreel truck and crew, followed by a car filled with cameramen and reporters. Gandhi acknowledges Walker with a smile and a nod, wipes sweat from his face, and enters the cheering crowd past the policemen. As they reach the village, several villagers join the procession, carrying their belongings. Gandhi stands at the center of the ecstatic crowd as the camera withdraws, transitioning the scene to black and white against the backdrop of Movietone News music. This leads to the Movietone Music tag, and as the film fades, lights rise on civil servants raising window shades while Lord Irwin, surrounded by his advisors, stares blankly at the screen in his office. The projector operators quietly dismantle the equipment, and Irwin turns to the senior police officer, who hesitantly responds to his unspoken questions. Irwin, visibly upset, absorbs the information. Meanwhile, men, women, and children create little paper packets of salt from piles on long tables. Policemen burst in, disrupting the scene and arresting volunteers, as an old man calmly continues folding a salt packet. In the street, Nehru stands on a stationary open truck loaded with salt packets, selling them with his companions to eager crowds. The sound of horses heralds the approach of mounted Indian police, who advance down the street, flanked by foot police. Some people flee while others stand firm as the mounted police reach the truck. Nehru is forcefully removed, landing on the street, while one of his colleagues is knocked to the ground by a policeman."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "A little band of drummers and flute players, reminiscent of traditional Indian music ensembles known for their rhythmic and melodic harmonies, suddenly begins to play as the crowd starts to jump up to see, and the flower petals begin to float in the sky, a traditional gesture of welcome and celebration. Gandhi and the procession of marchers and ashramites, individuals who live in spiritual communities called ashrams, stride down the dusty road toward them, accompanied by a newsreel truck and crew, which was a common method for creating news documentaries in the early 20th century, riding along about two-thirds of the way back, followed by a car of cameramen and reporters at the end. Gandhi, known globally for his philosophy of nonviolent resistance, looks at Walker, who is walking a few paces behind him at the side of the procession, wiping sweat from his face. Gandhi smiles, turns back, shakes his head, and grins as he passes by the policemen, who are stationed to maintain order but often serve oppressive colonial interests, and into the cheers of the crowd. As the procession trails into the village, several villagers with knapsacks or bundles strung over their shoulders, indicative of their participation in the Salt March, a key event in India's independence movement, run around the police and join the end of the procession. Gandhi stands in the center of the wildly cheering crowd as the camera pulls back and back, and the shot becomes black and white while we hear the music of Movietone News, a prominent newsreel series of the era that brought international events to theater audiences. With that, we see the Movietone Music tag, and as the film fades, the lights go up on a couple of civil servants moving about to raise the window shades while Lord Irwin, the British Viceroy of India during this tumultuous period, stares at the blank screen set up in his office, surrounded by the general, the brigadier, the senior police officer, Irwin's ADC, and the principal secretary. The two men who ran the projector, part of the staff responsible for briefing the Viceroy, quietly dismantle it. Finally, Irwin turns to the senior police officer, who fidgets but answers the implied questions, as Irwin sighs and nods. For the first time, Irwin is truly angry, and his face falls, reflecting the growing frustration of the British administration with the Indian independence movement. Meanwhile, men, women, and children are making little paper packets of salt from piles heaped along long tables, symbolizing defiance against the British salt tax. A group of policemen barge into the room, their lathis, or long wooden sticks used by colonial police forces, knocking tables, salt, and paper in every direction, and seize some of the volunteers for arrest. In the chaos, an old man, embodying the spirit of peaceful protest, calmly picks up a piece of paper from the floor, a handful of salt, and folds another packet. Nehru, a prominent leader in the Indian National Congress and future Prime Minister of India, is on the back of a big open truck that is stationary in the street, loaded with boxes containing salt packets, and he and eight or nine others are selling them to the people who flock about the truck. The sound of horses is heard, and Nehru lifts his head as mounted Indian police, often employed to suppress mass gatherings, come down either side of the street, a wave of foot police running forward down the center. Some of the people run, while others deliberately stand fast as the mounted police converge on the truck, a testament to their resolve in the face of oppression. Nehru is grabbed and hurled so that he half falls, half leaps to the street, and one of the men with him is knocked along the ground by a policeman, illustrating the violent responses often faced by peaceful protestors."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Nehru is grabbed and hurled so that he half falls half leaps to the street and one of the men with him is knocked along the ground by a policeman A little band of drummers and flute players suddenly begins to play as the crowd starts to jump up to see and the flower petals begin to float in the sky at the end With that we see the Movietone Music tag and as the film fades the lights go up on a couple of civil servants moving about to raise the window shades while Lord Irwin stares at the blank screen set up in his office surrounded by the general the brigadier the senior police officer Irwin's ADC and the principal secretary Gandhi and the procession of marchers and ashramites stride down the dusty road toward them accompanied by a newsreel truck and crew riding along about twothirds of the way back followed by a car of cameramen and reporters Gandhi looks at Walker walking a few paces behind him at the side of the procession wiping sweat from his face Meanwhile men women and children are making little paper packets of salt from piles heaped along long tables Gandhi and the procession of marchers and ashramites stride down the dusty road toward them accompanied by a newsreel truck and crew riding along about twothirds of the way back followed by a car of cameramen and reporters at the end Gandhi looks at Walker walking a few paces behind him at the side of the procession wiping sweat from his face Gandhi smiles turns back shakes his head and grins as he passes by the policemen and into the cheers of the crowd As the procession trails into the village several villagers with knapsacks or bundles strung over their shoulders run around the police and join the end of the procession Gandhi stands in the center of the wildly cheering crowd as the camera pulls back and back and the shot becomes black and white while we hear the music of Movietone News With that we see the Movietone Music tag and as the film fades the lights go up on a couple of civil servants moving about to raise the window shades while Lord Irwin stares at the blank screen set up in his office surrounded by the general the brigadier the senior police officer Irwin's ADC and the principal secretary The two men who ran the projector quietly dismantle it Finally Irwin turns to the senior police officer who fidgets but answers the implied questions as Irwin sighs and nods For the first time Irwin is truly angry and his face falls For the first time Irwin is truly angry and his face falls Meanwhile men women and children are making little paper packets of salt from piles heaped along long tables a wave of foot police running forward down the center The two men who ran the projector quietly dismantle it A group of policemen barge into the room knocking tables salt and paper in every direction with their lathis and seize some of the volunteers for arrest In the chaos an old man calmly picks up a piece of paper from the floor a handful of salt and folds another packet Nehru is on the back of a big open truck that is stationary in the street loaded with boxes containing salt packets and he and eight or nine others are selling them to the people who flock about the truck The sound of horses is heard and Nehru lifts his head as mounted Indian police come down either side of the street a wave of foot police running forward down the center A little band of drummers and flute players suddenly begins to play as the crowd starts to jump up to see and the flower petals begin to float in the sky Some of the people run while others deliberately stand fast as the mounted police converge on the truck Nehru is grabbed and hurled so that he half falls half leaps to the street and one of the men with him is knocked along the ground by a policeman"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "A little band of drummers and flute players suddenly begins to play as the crowd starts to jump up to see and the flower petals begin to float in the sky. Gandhi and the procession of marchers and ashramites stride down the dusty road toward them accompanied by a newsreel truck and crew riding along about twothirds of the way back followed by a car of cameramen and reporters. at the end. Gandhi looks at Walker walking a few paces behind him at the side of the procession wiping sweat from his face. Gandhi smiles turns back shakes his head and grins as he passes by the policemen and into the cheers of the crowd. As the procession trails into the village several villagers with knapsacks or bundles strung over their shoulders run around the police and join the end of the procession. Gandhi stands in the center of the wildly cheering crowd as the camera pulls back and back and the shot becomes black and white while we hear the music of Movietone News. With that we see the Movietone Music tag and as the film fades the lights go up on a couple of civil servants moving about to raise the window shades while Lord Irwin stares at the blank screen set up in his office surrounded by the general the brigadier the senior police officer Irwin's ADC and the principal secretary. The two men who ran the projector quietly dismantle it. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. Finally Irwin turns to the senior police officer who fidgets but answers the implied questions as Irwin sighs and nods. For the first time Irwin is truly angry and his face falls. Meanwhile men women and children are making little paper packets of salt from piles heaped along long tables. A group of policemen barge into the room knocking tables salt and paper in every direction with their lathis and seize some of the volunteers for arrest. In the chaos an old man calmly picks up a piece of paper from the floor a handful of salt and folds another packet. Nehru is on the back of a big open truck that is stationary in the street loaded with boxes containing salt packets and he and eight or nine others are selling them to the people who flock about the truck. The sound of horses is heard and Nehru lifts his head as mounted Indian police come down either side of the street. a wave of foot police running forward down the center. Some of the people run while others deliberately stand fast as the mounted police converge on the truck. Nehru is grabbed and hurled so that he half falls half leaps to the street and one of the men with him is knocked along the ground by a policeman."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "A little band of drummers and flute players suddenly begins to play as the crowd starts to jump up to see and the flower petals begin to float in the sky. Gandhi and the procession of marchers and ashramites stride down the dusty road toward them accompanied by a newsreel truck and crew riding along about twothirds of the way back followed by a car of cameramen and reporters. at the end. Gandhi looks at Walker walking a few paces behind him at the side of the procession wiping sweat from his face. Gandhi smiles turns back shakes his head and grins as he passes by the policemen and into the cheers of the crowd. As the procession trails into the village several villagers with knapsacks or bundles strung over their shoulders run around the police and join the end of the procession. Gandhi stands in the center of the wildly cheering crowd as the camera pulls back and back and the shot becomes black and white while we hear the music of Movietone News. With that we see the Movietone Music tag and as the film fades the lights go up on a couple of civil servants moving about to raise the window shades while Lord Irwin stares at the blank screen set up in his office surrounded by the general the brigadier the senior police officer Irwin's ADC and the principal secretary. The two men who ran the projector quietly dismantle it. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. Finally Irwin turns to the senior police officer who fidgets but answers the implied questions as Irwin sighs and nods. For the first time Irwin is truly angry and his face falls. Meanwhile men women and children are making little paper packets of salt from piles heaped along long tables. A group of policemen barge into the room knocking tables salt and paper in every direction with their lathis and seize some of the volunteers for arrest. In the chaos an old man calmly picks up a piece of paper from the floor a handful of salt and folds another packet. Nehru is on the back of a big open truck that is stationary in the street loaded with boxes containing salt packets and he and eight or nine others are selling them to the people who flock about the truck. The sound of horses is heard and Nehru lifts his head as mounted Indian police come down either side of the street. a wave of foot police running forward down the center. Some of the people run while others deliberately stand fast as the mounted police converge on the truck. Nehru is grabbed and hurled so that he half falls half leaps to the street and one of the men with him is knocked along the ground by a policeman."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "A little band of drummers and flute players suddenly begins to play as the crowd starts to jump up to see and the flower petals begin to float in the sky. Gandhi and the procession of marchers and ashramites stride down the dusty road toward them accompanied by a newsreel truck and crew riding along about twothirds of the way back followed by a car of cameramen and reporters. at the end. Gandhi looks at Walker walking a few paces behind him at the side of the procession wiping sweat from his face. Gandhi smiles turns back shakes his head and grins as he passes by the policemen and into the cheers of the crowd. Nehru is on the back of a big open truck that is stationary in the street loaded with boxes containing salt packets and he and eight or nine others are selling them to the people who flock about the truck. The sound of horses is heard and Nehru lifts his head as mounted Indian police come down either side of the street. a wave of foot police running forward down the center. Some of the people run while others deliberately stand fast as the mounted police converge on the truck. Nehru is grabbed and hurled so that he half falls half leaps to the street and one of the men with him is knocked along the ground by a policeman."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "A little band of drummers and flute players suddenly begins to play as the crowd starts to jump up to see and the flower petals begin to float in the sky. Gandhi and the procession of marchers and ashramites stride down the dusty road toward them accompanied by a newsreel truck and crew riding along about twothirds of the way back followed by a car of cameramen and reporters. Some of the people run while others deliberately stand fast as the mounted police converge on the truck. Nehru is grabbed and hurled so that he half falls half leaps to the street and one of the men with him is knocked along the ground by a policeman."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "A little group of penguins and violin players suddenly begins to play as the crowd starts to jump up to see, and the flower petals begin to float in the sky. A giraffe and the parade of jugglers and acrobats stride down the dusty road toward them, accompanied by a spaceship and crew riding along about two-thirds of the way back, followed by a train of archaeologists and writers at the end. The giraffe looks at a squirrel, walking a few paces behind it at the side of the parade, wiping sweat from its face. The giraffe smiles, turns back, shakes its head, and grins as it passes by the firefighters and into the cheers of the crowd. As the parade trails into the village, several astronauts with knapsacks or bundles strung over their shoulders run around the firefighters and join the end of the parade. The giraffe stands in the center of the wildly cheering crowd as the camera pulls back and back, and the shot becomes black and white while we hear the music of Movietone News. With that, we see the Movietone Music tag, and as the film fades, the lights go up on a couple of bakers moving about to raise the window shades while a dolphin stares at the blank screen set up in its office, surrounded by the musician, the magician, the senior librarian, the dolphin's ADC, and the principal gardener. The two raccoons who ran the projector quietly dismantle it. Finally, the dolphin turns to the senior librarian, who fidgets but answers the implied questions, as the dolphin sighs and nods. For the first time, the dolphin is truly angry, and its face falls. Meanwhile, robots, lizards, and owls are making little paper packets of salt from piles heaped along long tables. A band of bakers barge into the room, knocking tables, salt, and paper in every direction with their lathis, and seize some of the mascots for arrest. In the chaos, a young woman calmly picks up a piece of paper from the floor, a handful of salt, and folds another packet. A chimpanzee is on the back of a big open elephant that is stationary in the street, loaded with boxes containing salt packets, and the chimpanzee and eight or nine others are selling them to the dolphins who flock about the elephant. The sound of bagpipes is heard, and the chimpanzee lifts its head as mounted Swiss guards come down either side of the street, a wave of foot bakers running forward down the center. Some of the dolphins run, while others deliberately stand fast as the mounted guards converge on the elephant. The chimpanzee is grabbed and hurled so that it half falls, half leaps to the street, and one of the raccoons with it is knocked along the ground by a baker."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "A little band of banjo players and trumpet players suddenly begins to play as the crowd starts to jump up to see, and the confetti begins to float in the sky. Gandhi and the procession of marchers and ashramites stride down the grassy path toward them, accompanied by a market cart and crew riding along about two-thirds of the way back, followed by a wagon of photographers and journalists at the end. Gandhi looks at Walker, walking a few paces behind him at the side of the procession, wiping sweat from his forehead. Gandhi smiles, turns back, shakes his head, and grins as he passes by the firefighters and into the cheers of the crowd. As the procession trails into the hamlet, several villagers with satchels or sacks strung over their shoulders run around the firefighters and join the end of the procession. Gandhi stands in the center of the wildly cheering crowd as the camera pulls back and back, and the shot becomes sepia-toned while we hear the music of Phonograph News. With that, we see the Phonograph Music tag, and as the film fades, the lights go up on a couple of officials moving about to lower the blinds while Lord Irwin stares at the blank canvas set up in his study, surrounded by the admiral, the captain, the senior firefighter, Irwin's aide, and the chief secretary. The two men who ran the phonograph quietly dismantle it. Finally, Irwin turns to the senior firefighter, who fidgets but answers the implied questions as Irwin sighs and nods. For the first time, Irwin is truly angry, and his face falls. Meanwhile, men, women, and children are making little paper packets of spices from piles heaped along long tables. A group of firefighters barge into the room, knocking tables, spices, and paper in every direction with their batons, and seize some of the volunteers for arrest. In the chaos, an old man calmly picks up a piece of paper from the floor, a handful of spices, and folds another packet. Nehru is on the back of a big open carriage that is stationary in the lane, loaded with crates containing spice packets, and he and eight or nine others are selling them to the people who flock about the carriage. The sound of bulls is heard, and Nehru lifts his head as mounted Indian guards come down either side of the lane, a wave of foot guards running forward down the center. Some of the people run, while others deliberately stand fast as the mounted guards converge on the carriage. Nehru is grabbed and hurled so that he half falls, half leaps to the lane, and one of the men with him is knocked along the ground by a guard."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "A little band of drummers and flute players suddenly starts to dance as the crowd begins to whisper to see, and the flower petals start to drift in the sky. Gandhi and the procession of marchers and ashramites hop down the dusty road toward them, accompanied by a newsreel truck and crew floating about two-thirds of the way back, followed by a car of cameramen and reporters at the end. Gandhi glances at Walker, sauntering a few paces behind him at the side of the procession, rubbing sweat from his face. Gandhi chuckles, turns back, nods his head, and waves as he skips by the policemen and into the quiet of the crowd. As the procession skips into the village, several villagers with knapsacks or bundles strung over their shoulders tumble around the police and cling to the end of the procession. Gandhi hovers in the center of the silently staring crowd as the camera zooms back and back, and the shot becomes black and white while we hear the music of Movietone News. With that, we see the Movietone Music tag, and as the film fades, the lights turn up on a couple of civil servants strolling about to drop the window shades while Lord Irwin peers at the blank screen set up in his office, surrounded by the general, the brigadier, the senior police officer, Irwin's ADC, and the principal secretary. The two men who operated the projector quietly assemble it. Finally, Irwin turns to the senior police officer, who shifts but answers the implied questions, as Irwin chuckles and nods. For the first time, Irwin is truly excited, and his face brightens. Meanwhile, men, women, and children are arranging little paper packets of salt from piles placed along long tables. A group of policemen charge into the room, flipping tables, salt, and paper in every direction with their lathis, and grab some of the volunteers for applause. In the calm, an old man slowly examines a piece of paper from the floor, a handful of salt, and twists another packet. Nehru is on the back of a big open truck that is parked in the street, filled with boxes containing salt packets, and he and eight or nine others are distributing them to the people who gather about the truck. The sound of horses is heard, and Nehru bows his head as mounted Indian police trot down either side of the street, a wave of foot police strolling forward down the center. Some of the people drift, while others knowingly sit fast as the mounted police approach the truck. Nehru is pushed and tumbled so that he half falls, half jumps to the street, and one of the men with him is slid along the ground by a policeman."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "A little school of architects and tuba players suddenly begins to play as the parade starts to dive up to see, and the feather pillows begin to float in the ocean. Einstein and the line of bakers and librarians stride down the paved lane toward them, accompanied by a circus trolley and crew riding along about two-thirds of the way back, followed by a tent of magicians and gardeners at the end. Einstein looks at Butler, swimming a few strokes behind him at the side of the line, wiping chalk from his face. Einstein smiles, turns back, shakes his head, and grins as he passes by the golfers and into the whistles of the parade. As the line trails into the stadium, several athletes with surfboards or kites strung over their shoulders run around the golfers and join the end of the line. Einstein stands in the center of the loudly applauding parade as the megaphone pulls back and back, and the shot becomes sepia while we hear the melody of Radio Broadcast. With that, we see the Radio Signal logo, and as the image fades, the curtains go up on a couple of zookeepers moving about to raise the curtain rods while Mayor Phillips stares at the blank canvas set up in his courtyard, surrounded by the lieutenant, the colonel, the soaring engineer, Phillip's assistant, and the main librarian. The two women who ran the microphone quietly dismantle it. Finally, Phillips turns to the soaring engineer, who fidgets but answers the implied riddles, as Phillips sighs and nods. For the first time, Phillips is truly puzzled, and his hand rests. Meanwhile, dogs, cats, and birds are making little wooden crates of marbles from piles heaped along long desks. A group of scientists barge into the room, knocking desks, marbles, and wood in every direction with their rulers, and seize some of the engineers for detention. In the shuffle, a young woman calmly picks up a piece of wood from the floor, a handful of marbles, and folds another crate. Tesla is on the back of a big open tank that is stationary in the avenue, loaded with baskets containing marble crates, and he and eight or nine others are distributing them to the tourists who crowd about the tank. The sound of bicycles is heard, and Tesla lifts his head as winged Italian athletes come down either side of the avenue, a wave of foot athletes running forward down the center. Some of the tourists run, while others deliberately stand firm as the winged athletes converge on the tank. Tesla is grabbed and dropped so that he half floats, half skips to the avenue, and one of the kids with him is knocked along the ground by a scientist."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "A small ensemble of pianists and bagpipe players abruptly starts to dance as the audience begins to duck down to hide, and the dust clouds begin to hover in the air. Churchill and the troop of dancers and villagers hop up the grassy path away from them, trailed by a fire engine and team hovering along about two-thirds of the way back, followed by a bicycle of photographers and journalists at the front. Churchill glances at Parker, jumping a few steps ahead of him at the head of the troop, dabbing rain from his neck. Churchill frowns, turns forward, nods his head, and chuckles as he slips past the gardeners and into the whispers of the audience. As the troop twirls out of the forest, several tourists with umbrellas or baskets slung under their arms crawl over the wall and leave the front of the troop. Churchill sits in the middle of the quietly sobbing audience as the camera zooms in and in, and the shot changes to sepia while we hear the silence of Movietone News. With that, we see the Movietone Music logo, and as the film cuts, the lights dim on a pair of artists strolling around to lower the door handles while King George peers at the whiteboard set up in his parlor, surrounded by the captain, the major, the junior fireman, George's secretary, and the legal advisor. The pair who managed the slideshow discreetly assemble it. Finally, George turns to the junior fireman, who straightens but listens to the silent demands, as George groans and shakes. For the first time, George is truly amused, and his expression lifts. Meanwhile, boys, girls, and elders are crafting small wooden sculptures of pepper from piles stacked along narrow shelves. A group of seafarers charge into the hall, flipping chairs, pepper, and carvings in every direction with their swords, and capture several of the workers for inspection. Amid the mayhem, a young woman quietly picks up a fragment of wood from the floor, a sprinkle of pepper, and carves another sculpture. Lenin is on the back of a giant closed wagon that is floating on the lake, stacked with crates containing pepper sculptures, and he and three or four others are gifting them to the citizens who swim around the wagon. The echo of drums is heard, and Lenin lowers his gaze as marching Russian sailors row across either side of the lake, a stream of marching sailors swimming backward across the shore. Some of the citizens hide, while others consciously step aside as the marching sailors float toward the wagon. Lenin is yanked and tumbled so that he half rolls, half glides into the lake, and one of the women with him is swept along the ground by a sailor."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "A little group of painters and trumpet players suddenly begins to sculpt as the audience starts to dance up to hear, and the confetti begin to swim in the air. Gandhi and the parade of singers and villagers jog down the grassy path toward them, accompanied by a food delivery bike and chef riding along about two-thirds of the way back, followed by a boat of tourists and storytellers at the end. Gandhi looks at Walker, skipping a few steps behind him at the edge of the parade, drying tears from his face. Gandhi laughs, spins around, shakes his leg, and winks as he passes by the salespeople and into the applause of the audience. As the parade zigzags into the town, several townspeople with baskets or bags tied over their elbows bounce around the salespeople and join the front of the parade. Gandhi stands in the heart of the wildly applauding audience as the stage pushes back and back, and the scene becomes sepia while we hear the melody of Movietone News. With that, we see the Movietone Music label, and as the show fades, the lights turn up on a couple of train conductors gliding about to lower the curtain while Lord Irwin glances at the empty canvas set up in his library, surrounded by the colonel, the lieutenant, the principal detective, Irwin's assistant, and the chief librarian. The two women who operated the spotlight quietly assemble it. Finally, Irwin turns to the principal detective, who twitches but replies to the unstated queries, as Irwin grumbles and shrugs. For the first time, Irwin is truly puzzled, and his brow furrows. Meanwhile, men, women, and children are creating little cloth sacks of pepper from heaps stacked along short stools. A group of firefighters burst into the space, flipping stools, pepper, and cloth in every direction with their hoses, and capture some of the artists for questioning. In the commotion, an old woman calmly picks up a scrap of cloth from the ground, a handful of pepper, and wraps another sack. Nehru is on the back of a big open carriage that is paused in the lane, loaded with crates containing pepper sacks, and he and eight or nine others are trading them to the people who gather around the carriage. The sound of elephants is heard, and Nehru raises his gaze as mounted Indian soldiers come down either side of the lane, a stream of wolf police running forward down the middle. Some of the people skip, while others purposefully stand firm as the mounted soldiers close in on the carriage. Nehru is pulled and tossed so that he half climbs, half tumbles to the lane, and one of the women with him is shoved along the pavement by a soldier."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "A tiny troupe of jugglers and harmonica enthusiasts suddenly decides to dance as the mob begins to sit down to listen, and the confetti begins to drift through the ocean. Einstein and the gathering of cyclers and hikers gallop up the grassy slope towards them, shadowed by an ice cream cart and vendors sliding nearby three-quarters of the way forward, trailed by a wagon of bakers and chefs at the start. Einstein gazes at Johnson, skipping several steps ahead of him at the edge of the gathering, waving a fan at his feet. Einstein chuckles, turns around, nods his head, and giggles as he glides past the firemen and into the roars of the mob. As the gathering slips into the forest, numerous travelers with luggage or baskets hung around their waists dance beside the firefighters and attach themselves to the start of the gathering. Einstein twirls in the middle of the wildly laughing mob as the telescope zooms forward and forward, and the image turns purple and blue while we hear the sounds of Quicksand Tunes. With that, we notice the Quicksand Tunes label, and as the picture vanishes, the candles dim on a pair of chefs scurrying around to lower the curtain shades while Duke Wellington glares at the empty canvas set up in his garden, encircled by the gardener, the architect, the junior firefighter, Wellington's butler, and the school principal. The two women who fixed the slide quietly assemble it. Eventually, Wellington turns to the junior firefighter, who doodles but responds to the suggested riddles, as Wellington groans and shakes his head. For the first occasion, Wellington is genuinely ecstatic, and his expression brightens. Meanwhile, pirates, ghosts, and elves are crafting tiny wooden spoons of sugar from mounds stacked across short counters. A squad of gardeners burst into the stadium, toppling counters, sugar, and wood in every direction with their hoses, and nab some of the players for dancing. In the frenzy, a young woman peacefully picks up a ribbon from the ceiling, a basket of sugar, and ties another spoon. Tesla is on the roof of a small closed carriage that is zooming in the park, loaded with jars containing sugar spoons, and she and two or three others are distributing them to the animals that parade around the carriage. The noise of planes is detected, and Tesla lowers her gaze as flying Russian firefighters glide over either side of the park, a surge of paw firefighters crawling backwards along the edges. Some of the animals crawl, while others accidentally stroll away as the flying firefighters hover over the carriage. Tesla is snatched and lifted so that she half climbs, half jumps into the park, and one of the women with her is carried across the air by a firefighter."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "A band of drummers and flute players plays as Gandhi and his procession move down a dusty road, accompanied by a newsreel truck and cameramen. Gandhi smiles at Walker and continues past cheering crowds. As they enter a village, locals join the procession. The scene shifts as the film, set to Movietone Music, fades and Lord Irwin stares at a blank screen, surrounded by civil servants. Irwin questions the senior police officer, expressing anger. Meanwhile, men, women, and children pack salt into paper packets. Policemen burst in, disrupt the scene, and arrest some volunteers. Amidst the chaos, an old man continues making salt packets. Nehru stands on a truck selling salt packets. As mounted Indian police approach, Nehru is thrown to the ground, and chaos ensues as police converge on the truck."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Nehru is grabbed and hurled so that he half falls half leaps to the street and one of the men with him is knocked along the ground by a policeman Some of the people run while others deliberately stand fast as the mounted police converge on the truck a wave of foot police running forward down the center The sound of horses is heard and Nehru lifts his head as mounted Indian police come down either side of the street Nehru is on the back of a big open truck that is stationary in the street loaded with boxes containing salt packets and he and eight or nine others are selling them to the people who flock about the truck In the chaos an old man calmly picks up a piece of paper from the floor a handful of salt and folds another packet A group of policemen barge into the room knocking tables salt and paper in every direction with their lathis and seize some of the volunteers for arrest Meanwhile men women and children are making little paper packets of salt from piles heaped along long tables For the first time Irwin is truly angry and his face falls Finally Irwin turns to the senior police officer who fidgets but answers the implied questions as Irwin sighs and nods The two men who ran the projector quietly dismantle it With that we see the Movietone Music tag and as the film fades the lights go up on a couple of civil servants moving about to raise the window shades while Lord Irwin stares at the blank screen set up in his office surrounded by the general the brigadier the senior police officer Irwin's ADC and the principal secretary Gandhi stands in the center of the wildly cheering crowd as the camera pulls back and back and the shot becomes black and white while we hear the music of Movietone News As the procession trails into the village several villagers with knapsacks or bundles strung over their shoulders run around the police and join the end of the procession Gandhi smiles turns back shakes his head and grins as he passes by the policemen and into the cheers of the crowd Gandhi looks at Walker walking a few paces behind him at the side of the procession wiping sweat from his face at the end Gandhi and the procession of marchers and ashramites stride down the dusty road toward them accompanied by a newsreel truck and crew riding along about twothirds of the way back followed by a car of cameramen and reporters A little band of drummers and flute players suddenly begins to play as the crowd starts to jump up to see and the flower petals begin to float in the sky"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Nehru is on the back of a big open truck that is stationary in the street loaded with boxes containing salt packets and he and eight or nine others are selling them to the people who flock about the truck In the chaos an old man calmly picks up a piece of paper from the floor a handful of salt and folds another packet Gandhi smiles turns back shakes his head and grins as he passes by the policemen and into the cheers of the crowd Finally Irwin turns to the senior police officer who fidgets but answers the implied questions as Irwin sighs and nods As the procession trails into the village several villagers with knapsacks or bundles strung over their shoulders run around the police and join the end of the procession The sound of horses is heard and Nehru lifts his head as mounted Indian police come down either side of the street Some of the people run while others deliberately stand fast as the mounted police converge on the truck Gandhi stands in the center of the wildly cheering crowd as the camera pulls back and back and the shot becomes black and white while we hear the music of Movietone News A group of policemen barge into the room knocking tables salt and paper in every direction with their lathis and seize some of the volunteers for arrest a wave of foot police running forward down the center For the first time Irwin is truly angry and his face falls Gandhi and the procession of marchers and ashramites stride down the dusty road toward them accompanied by a newsreel truck and crew riding along about twothirds of the way back followed by a car of cameramen and reporters Meanwhile men women and children are making little paper packets of salt from piles heaped along long tables at the end Nehru is grabbed and hurled so that he half falls half leaps to the street and one of the men with him is knocked along the ground by a policeman With that we see the Movietone Music tag and as the film fades the lights go up on a couple of civil servants moving about to raise the window shades while Lord Irwin stares at the blank screen set up in his office surrounded by the general the brigadier the senior police officer Irwin's ADC and the principal secretary The two men who ran the projector quietly dismantle it A little band of drummers and flute players suddenly begins to play as the crowd starts to jump up to see and the flower petals begin to float in the sky Gandhi looks at Walker walking a few paces behind him at the side of the procession wiping sweat from his face"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "For the first time Irwin is truly angry and his face falls Meanwhile men women and children are making little paper packets of salt from piles heaped along long tables A group of policemen barge into the room knocking tables salt and paper in every direction with their lathis and seize some of the volunteers for arrest In the chaos an old man calmly picks up a piece of paper from the floor a handful of salt and folds another packet Nehru is on the back of a big open truck that is stationary in the street loaded with boxes containing salt packets and he and eight or nine others are selling them to the people who flock about the truck The sound of horses is heard and Nehru lifts his head as mounted Indian police come down either side of the street a wave of foot police running forward down the center Some of the people run while others deliberately stand fast as the mounted police converge on the truck Nehru is grabbed and hurled so that he half falls half leaps to the street and one of the men with him is knocked along the ground by a policeman A little band of drummers and flute players suddenly begins to play as the crowd starts to jump up to see and the flower petals begin to float in the sky Gandhi and the procession of marchers and ashramites stride down the dusty road toward them accompanied by a newsreel truck and crew riding along about twothirds of the way back followed by a car of cameramen and reporters at the end Gandhi looks at Walker walking a few paces behind him at the side of the procession wiping sweat from his face Gandhi smiles turns back shakes his head and grins as he passes by the policemen and into the cheers of the crowd As the procession trails into the village several villagers with knapsacks or bundles strung over their shoulders run around the police and join the end of the procession Gandhi stands in the center of the wildly cheering crowd as the camera pulls back and back and the shot becomes black and white while we hear the music of Movietone News With that we see the Movietone Music tag and as the film fades the lights go up on a couple of civil servants moving about to raise the window shades while Lord Irwin stares at the blank screen set up in his office surrounded by the general the brigadier the senior police officer Irwin's ADC and the principal secretary The two men who ran the projector quietly dismantle it Finally Irwin turns to the senior police officer who fidgets but answers the implied questions as Irwin sighs and nods"
        }
      ]
    }
  ]
}