{
  "ground_truth": "He holds her gaze as angrily as she holds his. As she starts to rise, he grabs her arm, but she pulls free. She says it derisively and it stings, but Gandhi is aware of Walker and he fights to hold his temper. Ba settles back defiantly. For a moment Gandhi stares at her, and she back at him, resentfully. He suddenly reaches down and grabs her arm, pulling her roughly to her feet. It is hushed but violent as he pulls her toward the rear door, opening it to push her out as she struggles against him. Gandhi stares at her breathlessly, his temper subsiding into a dazed remorse. He sinks numbly to a stool, sitting, holding his head in his hands. Ba studies him for a moment -- and she sighs, her temper and breathing subsiding too. She moves and kneels before him. A moment, then she soothes the top of his head -- like the mother-wife she is. Gandhi looks up at her, blankly, abjectly. And Gandhi grins weakly. Ba catches it and sends it back, warmer, less complicated by doubts. Gandhi sighs, putting his arms around her and she leans into him so that their heads are touching. Ba nods. Gandhi holds her back so that he can look at her. She looks at him evenly -- no smile, but the warmth still in her eyes. The theater is packed. The front rows near the stage are held by rich Muslim merchants, the back of the stalls with small traders, peddlers, artisans -- Muslim, Hindu, Parsee, Sikh. The gallery is bulging with indentured laborers -- largely Hindu. The mood is restless, belligerent. Gandhi moves forward and he holds up his hand for silence. Seated on the stage are Khan, Singh, three more leaders of the Indian community. Charlie Andrews and Herman Kallenbach sit at the very end of the line of chairs. Gandhi looks around the audience and we see the packed house from his point of view, ending with two plainclothes European policemen conspicuous in seats at the end of the front row. A uniformed policeman stands near them. A buzz, then applause -- loud and defiant. When it subsides, Gandhi looks down at the plainclothes policemen, fixing his gaze on them. And again the audience bursts into applause. The policemen just sit like stone -- confident, sure, immune to rhetoric. In the gallery, a rhythmic pounding signals the anger and protest and is taken up around the hall. The police stare imperturbably. Khan leans towards Singh, nodding to Gandhi. Singh smiles at the understatement. Gandhi holds up his hand, silencing the hall. Now a violent response -- a large, powerful merchant rises in the third row.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "He maintains her stare as fiercely as she maintains his. As she begins to ascend, he seizes her limb, but she wrenches free. She utters it scornfully and it bites, but Gandhi is conscious of Walker and he struggles to control his anger. Ba reclines back rebelliously. For a moment Gandhi gazes at her, and she back at him, bitterly. He suddenly reaches down and seizes her limb, hauling her roughly to her feet. It is quiet but forceful as he drags her toward the back exit, opening it to shove her out as she contends against him. Gandhi gazes at her breathlessly, his anger diminishing into a stunned regret. He collapses numbly onto a stool, sitting, grasping his head in his hands. Ba observes him for a moment -- and she exhales, her anger and breathing diminishing too. She moves and kneels before him. A moment, then she caresses the top of his head -- like the mother-wife she is. Gandhi glances up at her, blankly, abjectly. And Gandhi smiles faintly. Ba perceives it and returns it, warmer, less entangled by uncertainties. Gandhi exhales, placing his arms around her and she leans into him so that their heads are touching. Ba nods. Gandhi holds her back so that he can gaze at her. She gazes at him steadily -- no smile, but the warmth still in her eyes. The theater is crowded. The front rows near the stage are occupied by wealthy Muslim traders, the back of the seats with small merchants, vendors, craftsmen -- Muslim, Hindu, Parsee, Sikh. The gallery is overflowing with bound laborers -- predominantly Hindu. The atmosphere is uneasy, aggressive. Gandhi advances and he raises his hand for quiet. Seated on the stage are Khan, Singh, three more leaders of the Indian society. Charlie Andrews and Herman Kallenbach sit at the very end of the row of chairs. Gandhi glances around the spectators and we see the crowded venue from his perspective, concluding with two plainclothes European officers noticeable in seats at the end of the front row. A uniformed officer stands near them. A murmur, then applause -- loud and defiant. When it diminishes, Gandhi glances down at the plainclothes officers, fixing his stare on them. And again the spectators erupt into applause. The officers just sit like stone -- confident, assured, immune to eloquence. In the gallery, a rhythmic thumping indicates the fury and objection and is picked up around the auditorium. The officers stare unflinchingly. Khan inclines towards Singh, nodding to Gandhi. Singh grins at the understatement. Gandhi raises his hand, quieting the auditorium. Now a violent reaction -- a large, formidable trader stands in the third row."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Her gaze is held by him as angrily as his is held by her. As she starts to rise, her arm is grabbed by him, but she pulls free. It is said derisively by her and it stings, but Walker is noticed by Gandhi, and he fights to hold his temper. Ba settles back defiantly. For a moment, she is stared at by Gandhi, and he is stared at by her, resentfully. Her arm is suddenly reached down for and grabbed by him, pulling her roughly to her feet. It is hushed but violent as she is pulled toward the rear door by him, which is opened by him to push her out as she struggles against him. She is stared at breathlessly by Gandhi, his temper subsiding into dazed remorse. A stool is sunk onto numbly by him, sitting, holding his head in his hands. For a moment Gandhi is studied by Ba -- and she sighs, her temper and breathing subsiding too. She moves and kneels before him. A moment, then the top of his head is soothed by her -- like the mother-wife she is. At her, Gandhi looks up blankly, abjectly. And a weak grin is given by Gandhi. It is caught by Ba and sent back, warmer, less complicated by doubts. A sigh is given by Gandhi, putting his arms around her, and she leans into him so that their heads are touching. A nod is given by Ba. She is held back by Gandhi so that he can look at her. At him, she looks evenly -- no smile, but the warmth still in her eyes. The theater is packed. The front rows near the stage hold rich Muslim merchants, the back of the stalls hold small traders, peddlers, artisans -- Muslim, Hindu, Parsee, Sikh. The gallery bulges with indentured laborers -- largely Hindu. The mood is restless, belligerent. Forward Gandhi moves, and his hand is held up for silence by him. On the stage are seated Khan, Singh, and three more leaders of the Indian community. At the very end of the line of chairs sit Charlie Andrews and Herman Kallenbach. The audience is looked around by Gandhi, and we see the packed house from his point of view, ending with two plainclothes European policemen, who are conspicuous in seats at the end of the front row. Near them stands a uniformed policeman. A buzz, then applause is heard -- loud and defiant. When it subsides, Gandhi looks down at the plainclothes policemen, fixing his gaze on them. And again the audience bursts into applause. Like stone, the policemen just sit -- confident, sure, immune to rhetoric. In the gallery, the anger and protest are signaled by a rhythmic pounding and it is taken up around the hall. The police stare imperturbably. Towards Singh leans Khan, nodding to Gandhi. At the understatement, Singh smiles. Up his hand is held by Gandhi, silencing the hall. Now a violent response occurs -- in the third row, a large, powerful merchant rises."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "He holds her gaze as angrily as she holds his. When she rises, he grabs her arm, but she pulls free. Her derisive words sting, but Gandhi, aware of Walker, fights to control his temper. Ba settles back defiantly. Gandhi and Ba stare at each other resentfully. He suddenly grabs her arm, pulling her roughly to her feet. It's a hushed but violent struggle as he pushes her out the rear door. Gandhi's temper subsides into remorse as he sinks to a stool, holding his head. Ba studies him, sighs, and kneels before him, soothing his head like a mother-wife. Gandhi looks up blankly, then grins weakly. Ba returns the smile warmly. Gandhi sighs, embraces her, and they touch heads. Ba nods, and Gandhi holds her back to look at her. She meets his gaze evenly, warmth in her eyes. The theater is packed. Rich Muslim merchants sit in the front rows, small traders, peddlers, artisans—Muslim, Hindu, Parsee, Sikh—fill the back stalls. The gallery is full of largely Hindu indentured laborers. The mood is restless and belligerent. Gandhi moves forward, raising his hand for silence. On stage are Khan, Singh, and three other Indian community leaders. Charlie Andrews and Herman Kallenbach sit at the end of the line. Gandhi surveys the audience, ending with two plainclothes European policemen in the front row. A uniformed policeman stands nearby. A buzz, then loud, defiant applause. Gandhi fixes his gaze on the plainclothes policemen, prompting more applause. The policemen sit confidently, immune to rhetoric. In the gallery, rhythmic pounding signals anger and protest, spreading through the hall. The police remain imperturbable. Khan nods to Gandhi, and Singh smiles at the understatement. Gandhi raises his hand, silencing the hall. A large, powerful merchant rises in the third row, responding violently."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "He meets her angry gaze. As she rises, he grabs her arm, but she pulls away. Her derisive remark stings, but Gandhi, aware of Walker, restrains his temper. Ba settles defiantly. They stare at each other. He suddenly grabs her arm, pulls her up roughly, and drags her toward the rear door. She struggles as he pushes her out. Gandhi, breathless, sits with his head in his hands, remorseful. Ba watches, then kneels before him, soothing his head like a mother-wife. He looks at her, abject, and grins weakly. She returns it, warmer, then leans into his embrace. He holds her back to look at her; she meets his gaze warmly. The packed theater holds rich Muslims in front, traders and artisans in the stalls, Hindu laborers in the gallery. The mood is restless. Gandhi steps forward, raising his hand for silence. Onstage sit Khan, Singh, other Indian leaders, Andrews, and Kallenbach. Gandhi surveys the hall, ending on two plainclothes European officers in front row seats, with a uniformed officer nearby. Applause erupts. Gandhi locks eyes with the officers, prompting more applause. They remain unmoved. A rhythmic pounding of protest rises. Police stay stone-faced. Khan nods to Singh, who smiles. Gandhi raises his hand again. A large merchant in row three rises violently."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "He holds her gaze with as much anger and intensity as she holds his. As she begins to rise from her seat, he reaches out and grabs her arm, but she manages to pull free from his grasp. She speaks with a derisive tone, and her words sting, but Gandhi is acutely aware of Walker's presence and struggles to maintain his composure. Ba settles back into her seat with a defiant air. For a brief moment, Gandhi stares at her, and she returns his gaze with equal resentment. Suddenly, he reaches down and seizes her arm, pulling her roughly to her feet. The action is quiet yet violent as he drags her toward the rear door, opening it to push her out while she struggles against him. Gandhi stares at her breathlessly, his anger gradually subsiding into a state of dazed remorse. He sinks numbly onto a stool, sitting there with his head cradled in his hands. Ba observes him for a moment, and then she sighs, her own temper and breathing calming down as well. She moves closer and kneels before him. After a moment, she gently soothes the top of his head, like the nurturing mother-wife she is. Gandhi looks up at her with a blank, abject expression. Then, Gandhi manages a weak grin. Ba notices it and returns it, her smile warmer and less complicated by doubts. Gandhi sighs, wrapping his arms around her, and she leans into him so that their heads touch. Ba nods in understanding. Gandhi holds her back slightly so that he can look at her. She gazes at him evenly—there is no smile, but the warmth remains in her eyes. The theater is packed to capacity. The front rows near the stage are occupied by wealthy Muslim merchants, while the back of the stalls is filled with small traders, peddlers, and artisans—Muslim, Hindu, Parsee, Sikh. The gallery is overflowing with indentured laborers, predominantly Hindu. The mood in the room is restless and belligerent. Gandhi steps forward and raises his hand to call for silence. Seated on the stage are Khan, Singh, and three more leaders of the Indian community. Charlie Andrews and Herman Kallenbach sit at the very end of the line of chairs. Gandhi surveys the audience, and we see the packed house from his perspective, ending with two plainclothes European policemen conspicuous in seats at the end of the front row. A uniformed policeman stands nearby. A buzz fills the air, followed by applause—loud and defiant. When it subsides, Gandhi looks down at the plainclothes policemen, fixing his gaze on them. Once again, the audience erupts into applause. The policemen remain seated like statues—confident, assured, and immune to rhetoric. In the gallery, a rhythmic pounding begins, signaling anger and protest, and it is taken up throughout the hall. The police stare back imperturbably. Khan leans towards Singh, nodding in Gandhi's direction. Singh smiles at the understatement. Gandhi raises his hand once more, silencing the hall. Now, a violent response emerges—a large, powerful merchant rises in the third row."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "He holds her gaze unwaveringly, his eyes filled with as much intense anger and fiery intensity as she projects back at him. As she begins the process of rising from her seat, with determination evident in her every move, he reaches out with a sudden motion and grabs hold of her arm. However, she skillfully manages to pull herself free from his grasping hold. Her voice carries a derisive tone, her words cutting and stinging, yet Gandhi remains acutely aware of Walker's presence, struggling internally to maintain his composure amidst the tension. Ba, embodying defiance, settles back into her seat with an air that is both resolute and challenging. For a brief, fraught moment, Gandhi stares at her intently, and she returns his gaze with an equal measure of resentment. Then, with sudden determination, he reaches down unexpectedly and seizes her arm once again, this time pulling her with some force to her feet. The action, though carried out in silence, is undeniably violent as he drags her toward the rear door, opening it in haste to forcefully push her out while she resists against him. Gandhi looks at her breathlessly, the anger that consumed him gradually giving way to a state of dazed, remorseful reflection. He sinks numbly onto a nearby stool, sitting there with his head cradled wearily in his hands. Ba watches him quietly for a moment, and then she releases a sigh, her own temper cooling and her breath calming. She moves closer to him, kneeling gently before him. After a thoughtful pause, she soothes the top of his head with gentle strokes, embodying the nurturing motherly-wife role she naturally assumes. Gandhi glances up at her, his face a canvas of blank and abject expression. Slowly, a weak grin forms on Gandhi’s face. Ba notices his attempt at a smile and responds with one of her own—a smile that is warmer, uncomplicated by doubt, and filled with understanding. Gandhi sighs deeply, wrapping his arms around her, and she leans into him tenderly so that their heads gently touch. Ba nods in understanding and silent communication. Gandhi holds her back slightly so that he can look more directly into her eyes. She gazes back at him evenly—there is no smile on her lips, but the warmth and affection linger in her eyes. The theater around them is packed to full capacity with eager anticipation. The seats in the front rows near the stage are occupied by wealthy Muslim merchants, while the stalls at the back are filled with an assortment of small traders, peddlers, and artisans—comprising Muslims, Hindus, Parsees, and Sikhs. Meanwhile, the gallery is overflowing with indentured laborers, predominantly Hindu in origin. The mood in the room is restless, charged, and belligerent. Gandhi steps forward with purpose and raises his hand, commanding silence. Seated prominently on the stage are Khan, Singh, and three additional leaders of the Indian community. At the far end of the line of chairs, Charlie Andrews and Herman Kallenbach sit quietly. Gandhi surveys the audience thoughtfully, and we see the packed house from his perspective. This view ends with two plainclothes European policemen who are conspicuously seated at the end of the front row. Nearby, a uniformed policeman stands watchfully. A buzz fills the air in the theater, followed by loud, defiant applause. As the applause slowly subsides, Gandhi looks down pointedly at the plainclothes policemen, fixing his intense gaze on them. The audience once again erupts into applause, filling the space with their fervor. The policemen remain seated like statues—exuding confidence, assuredness, and an air of immunity to rhetoric. From the gallery above, a rhythmic pounding arises, signaling a wave of anger and protest, and it reverberates throughout the hall. The police continue to stare back imperturbably, unflinching in their demeanor. Khan leans towards Singh, nodding subtly in Gandhi's direction. Singh smiles, acknowledging the understated gesture. Gandhi raises his hand once more, imposing silence over the hall. Suddenly, a violent response emerges—a large, powerful merchant rises defiantly in the third row."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "He locks eyes with her, his gaze filled with anger, matching the intensity of hers. As she begins to stand, he swiftly reaches out and seizes her arm, but she quickly jerks it free from his grasp. She speaks with a tone dripping with derision, and though her words sting, Gandhi remains conscious of Walker's presence and struggles to maintain his composure. Ba defiantly settles back into her seat, and for a brief moment, they exchange a resentful stare. Suddenly, Gandhi lunges forward, grabbing her arm once more and yanking her forcefully to her feet. The atmosphere is tense and charged as he drags her toward the rear door, opening it with the intent to push her out while she resists him. As he stares at her, his breath comes in short gasps, and his anger gradually fades into a state of dazed remorse. He sinks down onto a stool, sitting with a heavy heart, and buries his head in his hands. Ba observes him for a moment, her own anger and breathing gradually calming. She moves closer and kneels before him, pausing before gently soothing the top of his head with her hand, embodying the nurturing role of a mother-wife. Gandhi lifts his head to look at her, his expression blank and abject, before a weak grin slowly spreads across his face. Ba catches his smile and returns it, her warmth untainted by doubt. Gandhi exhales deeply, wrapping his arms around her, and she leans into him, their heads touching in a moment of shared solace. Ba nods in understanding as Gandhi gently holds her back to gaze into her eyes. She meets his gaze evenly, her eyes still warm despite the absence of a smile. The theater is filled to capacity, with the front rows occupied by affluent Muslim merchants and the back of the stalls by small traders, peddlers, and artisans of various faiths, including Muslim, Hindu, Parsee, and Sikh. The gallery is overflowing with indentured laborers, predominantly Hindu, and the atmosphere is charged with restlessness and belligerence. Gandhi steps forward and raises his hand to call for silence. Seated on the stage are Khan, Singh, and three other leaders of the Indian community, with Charlie Andrews and Herman Kallenbach positioned at the far end of the line of chairs. Gandhi surveys the audience, taking in the packed house from his vantage point, and his gaze lands on two plainclothes European policemen conspicuously seated at the end of the front row, with a uniformed policeman standing nearby. A murmur runs through the crowd, followed by loud and defiant applause. As the applause dies down, Gandhi fixes his gaze on the plainclothes policemen, prompting another wave of applause from the audience. The policemen remain unmoved, exuding confidence and an air of immunity to the rhetoric. In the gallery, a rhythmic pounding begins, signaling the collective anger and protest, and it spreads throughout the hall. The police maintain their impassive demeanor. Khan leans towards Singh, nodding in Gandhi's direction, and Singh responds with a smile at the subtlety of the gesture. Gandhi raises his hand once more, bringing the hall to silence, but a large, powerful merchant in the third row rises, ready to respond with violence."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Gandhi and Ba exchange intense, resentful gazes. As Ba begins to rise, Gandhi grabs her arm, but she pulls away, speaking derisively. Gandhi, aware of Walker, struggles to control his temper as Ba defiantly settles back. After a tense moment, Gandhi abruptly pulls Ba to her feet and forcefully ushers her toward the rear door, pushing her out despite her resistance. Overcome with remorse, Gandhi sinks onto a stool, holding his head in his hands. Ba observes him, her own anger subsiding, and kneels before him, soothingly touching his head. Gandhi looks up at her, abjectly, and manages a weak grin, which Ba returns warmly. They embrace, their heads touching, and Ba nods as Gandhi holds her back to look at her, seeing warmth in her eyes despite the absence of a smile.\n\nIn a packed theater, the audience is restless and belligerent, with rich Muslim merchants in the front rows and a diverse mix of small traders, peddlers, artisans, and indentured laborers filling the rest. Gandhi steps forward, signaling for silence, as Khan, Singh, and other leaders sit on stage alongside Charlie Andrews and Herman Kallenbach. Gandhi surveys the audience, noting two plainclothes European policemen conspicuously seated in the front row, with a uniformed officer nearby. The audience buzzes with defiant applause, which subsides as Gandhi fixes his gaze on the policemen, prompting another burst of applause. The policemen remain unmoved, confident and immune to the rhetoric. A rhythmic pounding of protest begins in the gallery and spreads through the hall, but the police remain imperturbable. Khan nods to Gandhi, and Singh smiles at the understatement. Gandhi raises his hand to quiet the hall, but a large, powerful merchant rises in the third row, signaling a violent response."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "He holds her gaze as angrily as she holds his, a standoff reminiscent of a chess game where neither side is willing to lose ground. As she starts to rise, he grabs her arm, but she pulls free using the self-assured strength common among the determined women of their community. She says it derisively and it stings, but Gandhi, seasoned in the art of patience from his years of leading non-violent protests against British rule, is aware of Walker and he fights to hold his temper. Ba settles back defiantly, embodying the spirit of resilience that Indian women often displayed during the struggle for independence. For a moment Gandhi stares at her, and she back at him, resentfully, reflecting the complex emotions that run deep in their partnership. He suddenly reaches down and grabs her arm, pulling her roughly to her feet, mimicking the tensions that were not uncommon in the personal lives of many historical figures involved in intense social movements. It is hushed but violent as he pulls her toward the rear door, opening it to push her out as she struggles against him. Gandhi stares at her breathlessly, his temper subsiding into a dazed remorse, much like the emotional exhaustion that follows after a heated debate. He sinks numbly to a stool, sitting, holding his head in his hands, a posture that conveys his internal conflict as a leader and a husband. Ba studies him for a moment -- and she sighs, her temper and breathing subsiding too, as though accepting the ebbs and flows of their shared journey. She moves and kneels before him, displaying an act of forgiveness that often accompanies deep understanding in long-term relationships. A moment, then she soothes the top of his head -- like the mother-wife she is, evoking the image of Kasturba Gandhi, who was known for her supportive role in Gandhi's life. Gandhi looks up at her, blankly, abjectly. And Gandhi grins weakly, a rare moment of vulnerability showing the human side of the man who would become an iconic leader. Ba catches it and sends it back, warmer, less complicated by doubts, revealing her unwavering support. Gandhi sighs, putting his arms around her and she leans into him so that their heads are touching, an embrace symbolizing unity amidst their struggles. Ba nods. Gandhi holds her back so that he can look at her, perhaps drawing strength from her presence as he often did during tumultuous times. She looks at him evenly -- no smile, but the warmth still in her eyes, an assurance that they are in this together. The theater is packed, resembling the diverse gatherings Gandhi often spoke to during his campaigns for equality. The front rows near the stage are held by rich Muslim merchants, highlighting the socio-economic diversity; the back of the stalls with small traders, peddlers, artisans -- Muslim, Hindu, Parsee, Sikh, reflecting the multicultural fabric of Indian society. The gallery is bulging with indentured laborers -- largely Hindu, who were often the backbone of support for Gandhi's movements. The mood is restless, belligerent, reminiscent of the public's growing impatience with colonial repression. Gandhi moves forward and he holds up his hand for silence, a gesture that had become iconic in his mass gatherings. Seated on the stage are Khan, Singh, three more leaders of the Indian community, key figures in the collective leadership of the independence movement. Charlie Andrews and Herman Kallenbach, known allies of Gandhi, sit at the very end of the line of chairs. Gandhi looks around the audience and we see the packed house from his point of view, ending with two plainclothes European policemen conspicuous in seats at the end of the front row, a reminder of the persistent surveillance by colonial authorities. A uniformed policeman stands near them. A buzz, then applause -- loud and defiant, as was common in meetings where Gandhi spoke against injustice. When it subsides, Gandhi looks down at the plainclothes policemen, fixing his gaze on them with the calm resolve he was famous for. And again the audience bursts into applause, echoing their support for the cause of freedom. The policemen just sit like stone -- confident, sure, immune to rhetoric, their presence an embodiment of the challenges posed by the colonial regime. In the gallery, a rhythmic pounding signals the anger and protest and is taken up around the hall, symbolizing the collective unrest among the people. The police stare imperturbably, their stoicism contrasting with the crowd's fervor. Khan leans towards Singh, nodding to Gandhi, acknowledging his leadership. Singh smiles at the understatement, recognizing the subtle power in Gandhi's quiet authority. Gandhi holds up his hand, silencing the hall, as he often did with his powerful yet peaceful presence. Now a violent response -- a large, powerful merchant rises in the third row, representing the influential voices in the community pushing back against colonial policies."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "He holds her gaze as angrily as she holds his  As she starts to rise he grabs her arm but she pulls free  She says it derisively and it stings but Gandhi is aware of Walker and he fights to hold his temper  Ba settles back defiantly  For a moment Gandhi stares at her and she back at him resentfully  He suddenly reaches down and grabs her arm pulling her roughly to her feet  It is hushed but violent as he pulls her toward the rear door opening it to push her out as she struggles against him  The theater is packed  The front rows near the stage are held by rich Muslim merchants  the back of the stalls with small traders peddlers artisans   Muslim Hindu Parsee Sikh  The gallery is bulging with indentured laborers  largely Hindu  The mood is restless belligerent  Gandhi moves forward and he holds up his hand for silence  Seated on the stage are Khan Singh  three more leaders of the Indian community  Charlie Andrews and Herman Kallenbach sit at the very end of the line of chairs  Gandhi looks around the audience and we see the packed house from his point of view ending with two plainclothes  European policemen conspicuous in seats at the end of the front row  A uniformed policeman stands near them  A buzz then applause  loud and defiant  When it subsides Gandhi looks down at the plainclothes policemen fixing his gaze on them  And again the audience bursts into applause  The policemen just sit like stone  confident sure immune to rhetoric  In the gallery a rhythmic pounding signals the anger and protest and is taken up around the hall  The police stare imperturbably  Khan leans towards Singh nodding to Gandhi  Singh smiles at the understatement  Gandhi holds up his hand silencing the hall  Gandhi stares at her breathlessly his temper subsiding into a dazed remorse  He sinks numbly to a stool sitting holding his head in his hands  Ba studies him for a moment  and she sighs her temper and breathing subsiding too  She moves and kneels before him  A moment then she soothes the top of his head  like the motherwife she is  Gandhi looks up at her blankly abjectly  And Gandhi grins weakly  Ba catches it and sends it back  warmer less complicated by doubts  Gandhi sighs putting his arms around her and she leans into him so that their heads are touching  Ba nods  Gandhi holds her back so that he can look at her  She looks at him evenly  no smile but the warmth still in her eyes  The theater is packed  The front rows near the stage are held by rich Muslim merchants  the back of the stalls with small traders peddlers artisans   Muslim Hindu Parsee Sikh  The gallery is bulging with indentured laborers  largely Hindu  The mood is restless belligerent  Gandhi moves forward and he holds up his hand for silence  Seated on the stage are Khan Singh  three more leaders of the Indian community  Charlie Andrews and Herman Kallenbach sit at the very end of the line of chairs  Gandhi looks around the audience and we see the packed house from his point of view ending with two plainclothes  European policemen conspicuous in seats at the end of the front row  A uniformed policeman stands near them  A buzz then applause  loud and defiant  When it subsides Gandhi looks down at the plainclothes policemen fixing his gaze on them  And again the audience bursts into applause  The policemen just sit like stone  confident sure immune to rhetoric  In the gallery a rhythmic pounding signals the anger and protest and is taken up around the hall  The police stare imperturbably  Khan leans towards Singh nodding to Gandhi  Singh smiles at the understatement  Gandhi holds up his hand silencing the hall  Now a violent response   a large powerful merchant rises in the third row"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "He holds her gaze as angrily as she holds his. As she starts to rise he grabs her arm but she pulls free. She says it derisively and it stings but Gandhi is aware of Walker and he fights to hold his temper. Ba settles back defiantly. For a moment Gandhi stares at her and she back at him resentfully. He suddenly reaches down and grabs her arm pulling her roughly to her feet. It is hushed but violent as he pulls her toward the rear door opening it to push her out as she struggles against him. Gandhi stares at her breathlessly his temper subsiding into a dazed remorse. He sinks numbly to a stool sitting holding his head in his hands. Ba studies him for a moment  and she sighs her temper and breathing subsiding too. She moves and kneels before him. A moment then she soothes the top of his head  like the motherwife she is. Gandhi looks up at her blankly abjectly. And Gandhi grins weakly. Ba catches it and sends it back. warmer less complicated by doubts. Gandhi sighs putting his arms around her and she leans into him so that their heads are touching. Ba nods. Gandhi holds her back so that he can look at her. She looks at him evenly  no smile but the warmth still in her eyes. The theater is packed. The front rows near the stage are held by rich Muslim merchants. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. the back of the stalls with small traders peddlers artisans. Muslim Hindu Parsee Sikh. The gallery is bulging with indentured laborers  largely Hindu. The mood is restless belligerent. Gandhi moves forward and he holds up his hand for silence. Seated on the stage are Khan Singh. three more leaders of the Indian community. Charlie Andrews and Herman Kallenbach sit at the very end of the line of chairs. Gandhi looks around the audience and we see the packed house from his point of view ending with two plainclothes. European policemen conspicuous in seats at the end of the front row. A uniformed policeman stands near them. A buzz then applause  loud and defiant. When it subsides Gandhi looks down at the plainclothes policemen fixing his gaze on them. And again the audience bursts into applause. The policemen just sit like stone  confident sure immune to rhetoric. In the gallery a rhythmic pounding signals the anger and protest and is taken up around the hall. The police stare imperturbably. Khan leans towards Singh nodding to Gandhi. Singh smiles at the understatement. Gandhi holds up his hand silencing the hall. Now a violent response. a large powerful merchant rises in the third row."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "He holds her gaze as angrily as she holds his. As she starts to rise he grabs her arm but she pulls free. She says it derisively and it stings but Gandhi is aware of Walker and he fights to hold his temper. Ba settles back defiantly. For a moment Gandhi stares at her and she back at him resentfully. He suddenly reaches down and grabs her arm pulling her roughly to her feet. It is hushed but violent as he pulls her toward the rear door opening it to push her out as she struggles against him. Gandhi stares at her breathlessly his temper subsiding into a dazed remorse. He sinks numbly to a stool sitting holding his head in his hands. Ba studies him for a moment  and she sighs her temper and breathing subsiding too. She moves and kneels before him. A moment then she soothes the top of his head  like the motherwife she is. Gandhi looks up at her blankly abjectly. And Gandhi grins weakly. Ba catches it and sends it back. warmer less complicated by doubts. Gandhi sighs putting his arms around her and she leans into him so that their heads are touching. Ba nods. Gandhi holds her back so that he can look at her. She looks at him evenly  no smile but the warmth still in her eyes. The theater is packed. The front rows near the stage are held by rich Muslim merchants. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. the back of the stalls with small traders peddlers artisans. Muslim Hindu Parsee Sikh. The gallery is bulging with indentured laborers  largely Hindu. The mood is restless belligerent. Gandhi moves forward and he holds up his hand for silence. Seated on the stage are Khan Singh. three more leaders of the Indian community. Charlie Andrews and Herman Kallenbach sit at the very end of the line of chairs. Gandhi looks around the audience and we see the packed house from his point of view ending with two plainclothes. European policemen conspicuous in seats at the end of the front row. A uniformed policeman stands near them. A buzz then applause  loud and defiant. When it subsides Gandhi looks down at the plainclothes policemen fixing his gaze on them. And again the audience bursts into applause. The policemen just sit like stone  confident sure immune to rhetoric. In the gallery a rhythmic pounding signals the anger and protest and is taken up around the hall. The police stare imperturbably. Khan leans towards Singh nodding to Gandhi. Singh smiles at the understatement. Gandhi holds up his hand silencing the hall. Now a violent response. a large powerful merchant rises in the third row."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "He holds her gaze as angrily as she holds his. As she starts to rise he grabs her arm but she pulls free. She says it derisively and it stings but Gandhi is aware of Walker and he fights to hold his temper. Ba settles back defiantly. For a moment Gandhi stares at her and she back at him resentfully. He suddenly reaches down and grabs her arm pulling her roughly to her feet. It is hushed but violent as he pulls her toward the rear door opening it to push her out as she struggles against him. Gandhi stares at her breathlessly his temper subsiding into a dazed remorse. He sinks numbly to a stool sitting holding his head in his hands. Ba studies him for a moment  and she sighs her temper and breathing subsiding too. She moves and kneels before him. A buzz then applause  loud and defiant. When it subsides Gandhi looks down at the plainclothes policemen fixing his gaze on them. And again the audience bursts into applause. The policemen just sit like stone  confident sure immune to rhetoric. In the gallery a rhythmic pounding signals the anger and protest and is taken up around the hall. The police stare imperturbably. Khan leans towards Singh nodding to Gandhi. Singh smiles at the understatement. Gandhi holds up his hand silencing the hall. Now a violent response. a large powerful merchant rises in the third row."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "He holds her gaze as angrily as she holds his. As she starts to rise he grabs her arm but she pulls free. She says it derisively and it stings but Gandhi is aware of Walker and he fights to hold his temper. Ba settles back defiantly. For a moment Gandhi stares at her and she back at him resentfully. Singh smiles at the understatement. Gandhi holds up his hand silencing the hall. Now a violent response. a large powerful merchant rises in the third row."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The cat holds her gaze as angrily as she holds his. As she starts to rise, the dog grabs her arm, but she pulls free. She says it derisively and it stings, but the rabbit is aware of the hamster and the rabbit fights to hold his temper. The bird settles back defiantly. For a moment the rabbit stares at her, and she back at him, resentfully. The rabbit suddenly reaches down and grabs her arm, pulling her roughly to her feet. It is hushed but violent as the rabbit pulls her toward the rear door, opening it to push her out as she struggles against him. The rabbit stares at her breathlessly, his temper subsiding into a dazed remorse. The rabbit sinks numbly to a stool, sitting, holding his head in his hands. The bird studies him for a moment -- and she sighs, her temper and breathing subsiding too. She moves and kneels before him. A moment, then she soothes the top of his head -- like the mother-wife she is. The rabbit looks up at her, blankly, abjectly. And the rabbit grins weakly. The bird catches it and sends it back, warmer, less complicated by doubts. The rabbit sighs, putting his arms around her and she leans into him so that their heads are touching. The bird nods. The rabbit holds her back so that he can look at her. She looks at him evenly -- no smile, but the warmth still in her eyes. The theater is packed. The front rows near the stage are held by rich elephant merchants, the back of the stalls with small traders, peddlers, artisans -- elephant, giraffe, zebra, buffalo. The gallery is bulging with indentured laborers -- largely zebra. The mood is restless, belligerent. The rabbit moves forward and he holds up his hand for silence. Seated on the stage are the fox, the lion, three more leaders of the animal community. The panda and the gorilla sit at the very end of the line of chairs. The rabbit looks around the audience and we see the packed house from his point of view, ending with two plainclothes European policemen conspicuous in seats at the end of the front row. A uniformed policeman stands near them. A buzz, then applause -- loud and defiant. When it subsides, the rabbit looks down at the plainclothes policemen, fixing his gaze on them. And again the audience bursts into applause. The policemen just sit like stone -- confident, sure, immune to rhetoric. In the gallery, a rhythmic pounding signals the anger and protest and is taken up around the hall. The police stare imperturbably. The fox leans towards the lion, nodding to the rabbit. The lion smiles at the understatement. The rabbit holds up his hand, silencing the hall. Now a violent response -- a large, powerful walrus rises in the third row."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "He holds her gaze as angrily as she holds his. As she starts to rise, he grabs her umbrella, but she pulls free. She says it derisively and it stings, but Gandhi is aware of Walker and he fights to hold his temper. Ba settles back defiantly. For a moment Gandhi stares at her, and she back at him, resentfully. He suddenly reaches down and grabs her scarf, pulling her roughly to her feet. It is hushed but violent as he pulls her toward the garden gate, opening it to push her out as she struggles against him. Gandhi stares at her breathlessly, his temper subsiding into a dazed remorse. He sinks numbly to a hammock, sitting, holding his head in his hands. Ba studies him for a moment -- and she sighs, her temper and breathing subsiding too. She moves and kneels before him. A moment, then she soothes the top of his head -- like the mother-wife she is. Gandhi looks up at her, blankly, abjectly. And Gandhi grins weakly. Ba catches it and sends it back, warmer, less complicated by doubts. Gandhi sighs, putting his arms around her and she leans into him so that their heads are touching. Ba nods. Gandhi holds her back so that he can look at her. She looks at him evenly -- no smile, but the warmth still in her eyes. The auditorium is packed. The front rows near the platform are held by wealthy Jewish bankers, the back of the stalls with small grocers, vendors, craftsmen -- Jewish, Buddhist, Christian, Jain. The balcony is bulging with itinerant workers -- largely Buddhist. The mood is restless, belligerent. Gandhi moves forward and he holds up his hand for silence. Seated on the platform are Khan, Singh, three more leaders of the Indian community. Charlie Andrews and Herman Kallenbach sit at the very end of the line of desks. Gandhi looks around the audience and we see the packed house from his point of view, ending with two plainclothes American detectives conspicuous in seats at the end of the front row. A uniformed detective stands near them. A buzz, then applause -- loud and defiant. When it subsides, Gandhi looks down at the plainclothes detectives, fixing his gaze on them. And again the audience bursts into applause. The detectives just sit like stone -- confident, sure, immune to rhetoric. In the balcony, a rhythmic stamping signals the anger and protest and is taken up around the hall. The officers stare imperturbably. Khan leans towards Singh, nodding to Gandhi. Singh smiles at the understatement. Gandhi holds up his hand, silencing the hall. Now a violent response -- a large, powerful banker rises in the third row."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "He ignores her gaze as coldly as she ignores his. As she begins to laugh, he pats her arm, but she waves it off. She hums it playfully and it amuses, but Gandhi is unaware of Walker and he struggles to find his composure. Ba stands up cheerfully. For a moment Gandhi frowns at her, and she frowns at him, lovingly. He suddenly bends down and pats her shoulder, nudging her gently to her feet. It is whispered but intense as he nudges her toward the rear door, closing it to invite her out as she hesitates against him. Gandhi glances at her briefly, his annoyance transforming into a calm acceptance. He drifts softly to a stool, lounging, cradling his head in his hands. Ba glances at him for a moment -- and she smiles, her annoyance and pacing slowing too. She leans and squats before him. A moment, then she pats the top of his head -- like the nurturing wife she is. Gandhi peers up at her, calmly, softly. And Gandhi chuckles faintly. Ba notices it and reflects it back, brighter, more assured by trust. Gandhi yawns, wrapping his arms around her and she snuggles into him so that their foreheads are touching. Ba blinks. Gandhi releases her back so that he can observe her. She observes him steadily -- no grin, but the care still in her eyes. The theater is bustling. The front rows near the stage are filled by eager Muslim merchants, the back of the stalls with small traders, peddlers, artisans -- Muslim, Hindu, Parsee, Sikh. The gallery is bursting with energetic laborers -- largely Hindu. The mood is lively, spirited. Gandhi steps backward and he clasps his hands for quiet. Seated on the stage are Khan, Singh, three more leaders of the Indian community. Charlie Andrews and Herman Kallenbach sit at the very edge of the line of chairs. Gandhi glances around the audience and we see the brimming house from his point of view, ending with two plainclothes European policemen inconspicuous in seats at the end of the front row. A uniformed policeman leans near them. A murmur, then cheers -- soft and subtle. When it quiets, Gandhi gazes at the plainclothes policemen, averting his gaze from them. And again the audience erupts into cheers. The policemen just rest like statues -- poised, sure, indifferent to noise. In the gallery, a harmonious clapping signals the excitement and anticipation and is taken up around the hall. The police blink impassively. Khan turns towards Singh, nodding to Gandhi. Singh nods at the understatement. Gandhi waves his hand, energizing the hall. Now a subtle reaction -- a small, timid merchant stands in the third row."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "The cloud holds the notebook's gaze as angrily as the notebook holds the cloud's. As the notebook starts to rise, the cloud grabs the notebook's leaf, but the notebook pulls free. The notebook says it derisively and it stings, but the bicycle is aware of the envelope and it fights to hold its temper. The telephone settles back defiantly. For a moment the bicycle stares at the notebook, and the notebook back at the bicycle, resentfully. The bicycle suddenly reaches down and grabs the notebook's leaf, pulling it roughly to its feet. It is hushed but violent as the bicycle pulls the notebook toward the rear door, opening it to push the notebook out as it struggles against the bicycle. The bicycle stares at the notebook breathlessly, its temper subsiding into a dazed remorse. The bicycle sinks numbly to a spoon, sitting, holding its head in its hands. The telephone studies the bicycle for a moment -- and the telephone sighs, its temper and breathing subsiding too. The telephone moves and kneels before the bicycle. A moment, then the telephone soothes the top of the bicycle's head -- like the feather-blanket it is. The bicycle looks up at the telephone, blankly, abjectly. And the bicycle grins weakly. The telephone catches it and sends it back, warmer, less complicated by doubts. The bicycle sighs, putting its arms around the telephone and the telephone leans into the bicycle so that their heads are touching. The telephone nods. The bicycle holds the telephone back so that it can look at the telephone. The telephone looks at the bicycle evenly -- no smile, but the warmth still in the telephone's eyes. The library is packed. The front rows near the fountain are held by rich giraffe sandwiches, the back of the barns with small cucumbers, sailboats, marbles -- giraffe, owl, iguana, elephant. The attic is bulging with indentured teddy bears -- largely owl. The mood is restless, belligerent. The bicycle moves forward and it holds up its hand for silence. Seated on the fountain are drum, snorkel, three more leaders of the notebook community. Flashlight and Hamburger sit at the very end of the line of recliners. The bicycle looks around the audience and we see the packed house from its point of view, ending with two plainclothes European roller skates conspicuous in recliners at the end of the front row. A uniformed roller skate stands near them. A buzz, then applause -- loud and defiant. When it subsides, the bicycle looks down at the plainclothes roller skates, fixing its gaze on them. And again the audience bursts into applause. The roller skates just sit like stone -- confident, sure, immune to rhetoric. In the attic, a rhythmic pounding signals the anger and protest and is taken up around the hall. The roller skates stare imperturbably. The drum leans towards the snorkel, nodding to the bicycle. The snorkel smiles at the understatement. The bicycle holds up its hand, silencing the hall. Now a violent response -- a large, powerful sandwich rises in the third row."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "She averts his gaze as cheerfully as he averts hers. As he prepares to sit, she releases his hand, but he pushes forward. He whispers it kindly and it comforts, but Einstein is oblivious of Tesla and he attempts to maintain his enthusiasm. Lee kneels down compliantly. For a moment Einstein glances at him, and he back at her, eagerly. She suddenly stands up and releases his hand, lifting him gently to his feet. It is quiet but loving as she guides him toward the front door, opening it to let him out as he moves with her. Einstein smiles at him joyfully, his excitement growing into a calm satisfaction. She rises lightly to a seat, standing, holding her heart in her hands. Lee observes her for a moment -- and he chuckles, his excitement and laughter growing too. He shifts and sits beside her. A moment, then he pats the top of her shoulder -- like the father-son he is. Einstein glances down at him, warmly, kindly. And Einstein laughs heartily. Lee absorbs it and returns it, stronger, more energized by joy. Einstein chuckles, putting his feet around her and he leans beside her so that their sides are touching. Lee laughs. Einstein pushes him away so that she can laugh at him. He laughs at her expectantly -- no frown, but the humor still in his eyes. The circus is empty. The seats near the rink are filled by wealthy Buddhist monks, the back of the house with farmers, carpenters, clerks -- Buddhist, Christian, Jew, Taoist. The stage is sparse with drifting tourists -- largely Christian. The air is calm, peaceful. Einstein strolls backward and she lowers her gaze for laughter. Standing on the rink are Connery, Khan, two fewer supporters of the American collective. Isaac Newton and Alan Turing stand at the opposite end of the row of benches. Einstein glances beyond the ring and we see the sparse grounds from her view, settling with four armored Japanese soldiers surrounded in rows at the center of the back row. An unarmed soldier watches beyond them. A chatter, then laughter -- soft and cheerful. When it echoes, Einstein focuses away from the armored soldiers, lowering her gaze from them. And again the grounds erupt into laughter. The soldiers just stand like clay -- timid, unsure, receptive to persuasion. In the stage, a graceful swaying signals the joy and celebration and is quieted down throughout the grounds. The monks listen carefully. Connery stands away from Khan, nodding away from Einstein. Khan cries at the sentiment. Einstein lowers her gaze, quieting the grounds. Now a peaceful response -- a small, gentle artist sits in the fifth row."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "He diverts her attention as cheerfully as she diverts his. As she begins to sit, he nudges her leg, but she twists away. She whispers it humorously and it tickles, but Gandhi is conscious of Walker and he struggles to calm his excitement. Ba perches back confidently. For a moment Gandhi peers at her, and she at him, cheerfully. He abruptly bends down and taps her shoulder, tugging her gently to her feet. It is quiet but energetic as he guides her toward the side entrance, closing it to usher her in as she dances beside him. Gandhi gazes at her blissfully, his excitement settling into a sleepy relief. He collapses dreamily onto a bench, lounging, cradling his face in his palms. Ba examines him for an instant -- and she chuckles, her excitement and pulse slowing too. She shifts and crouches beside him. A pause, then she brushes the top of his hair -- like the caring partner she is. Gandhi glances up at her, slowly, respectfully. And Gandhi chuckles softly. Ba catches it and returns it, brighter, uncomplicated by hesitation. Gandhi breathes deeply, wrapping his arms around her and she cuddles into him so that their heads are close. Ba acknowledges. Gandhi holds her away so he can gaze at her. She gazes at him steadily -- no grin, but the kindness still in her eyes. The stadium is bustling. The front rows near the platform are occupied by wealthy Muslim traders, the back of the aisles with small shopkeepers, hawkers, craftspeople -- Muslim, Hindu, Parsee, Sikh. The balcony is overflowing with bonded workers -- mainly Hindu. The atmosphere is fidgety, aggressive. Gandhi proceeds forward and he raises his hand for attention. Seated on the platform are Khan, Singh, three other leaders of the Indian community. Charlie Andrews and Herman Kallenbach are positioned at the very edge of the array of chairs. Gandhi surveys the spectators and we perceive the crowded venue from his viewpoint, concluding with two undercover European officers noticeable in seats at the end of the front line. A uniformed officer stands nearby. A murmur, then cheers -- loud and proud. When it quiets down, Gandhi glances at the undercover officers, fixing his attention on them. And again the crowd erupts into cheers. The officers just sit like statues -- assured, calm, indifferent to oration. In the balcony, a rhythmic clapping signals the fervor and dissent and is echoed around the arena. The officers observe steadily. Khan inclines towards Singh, gesturing to Gandhi. Singh grins at the implication. Gandhi raises his hand, quieting the arena. Now a forceful reaction -- a towering, influential trader stands in the third row."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "The cat avoids the cow as gently as the cow avoids hers. As the cow begins to sit, the cat tugs the cow's tail, but the cow shakes loose. The cow shouts it softly and it tickles, but Napoleon is oblivious of Shelley and he dances to temper his laughter. Mo reclines back cheerfully. For a while Napoleon blinks at the cow, and the cow blinks back at him, suspiciously. He suddenly hops up and nudges the cow's hoof, lifting the cow lightly to her knees. It is murmured but gentle as he leads the cow toward the window, sliding it to guide the cow out as the cow tiptoes along with him. Napoleon glances at the cow curiously, his laughter drifting into a serene joy. He drops lazily to a hammock, lounging, patting his chin in his fist. Mo watches him for a moment -- and the cow giggles, her laughter and yawning fading too. The cow rises and tiptoes beside him. A pause, then the cow pats the tip of his chin -- like the sister-cousin she is. Napoleon peers up at her, sleepily, quietly. And Napoleon beams shyly. Mo captures it and mirrors it back, brighter, less tangled by questions. Napoleon yawns, wrapping his legs around the cow and she bends into him so that their noses are touching. Mo shakes her head. Napoleon releases her neck so that he can glance at her. She gazes at him calmly -- no grin, but the glow still in her fur. The auditorium is empty. The rear benches near the exits are filled by tall Buddhist monks, the front of the aisles with quiet scholars, scribes, weavers -- Buddhist, Jain, Zoroastrian, Taoist. The stage is crumbling with retired generals -- mainly Jain. The air is peaceful, reflective. Napoleon strolls backward and he drops down his foot for quiet. Sleeping on the steps are Ali, Patel, three fewer strangers of the German population. Amy Johnson and Sigmund Freud crouch at the very corner of the stack of tables. Napoleon peers around the plaza and we see the barren field from his line of sight, starting with two uniformed Asian gardeners inconspicuous in chairs at the heart of the rear bench. An armored gardener hides near them. A murmur, then silence -- soft and gentle. When it rises, Napoleon glances up at the armored gardeners, altering his stare on them. And once more the plaza dissolves into silence. The gardeners simply lean like fog -- puzzled, unsure, distant from storytelling. In the stage, a silent swaying echoes the calm and harmony and is dropped out beyond the field. The gardeners glance curiously. Ali recoils away from Patel, staring towards Napoleon. Patel grins at the exaggeration. Napoleon drops down his foot, averting the field. Yet a gentle whisper -- a dozen, tiny priest sits in the first bench."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Gandhi and Ba share a tense confrontation. Gandhi's initial anger leads to a rough encounter, but it soon gives way to remorse. Ba kneels before him, soothing him like a mother, and their tension dissipates as they share a weak smile and embrace. In a packed theater with a diverse and restless audience, Gandhi seeks silence. Among the leaders on stage are Khan, Singh, Charlie Andrews, and Herman Kallenbach. The audience includes various traders and laborers, with two plainclothes European policemen prominently seated. The audience's defiance is palpable, with applause and rhythmic pounding signaling protest. Gandhi's raised hand quells the noise, just as a powerful merchant rises in protest."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "a large powerful merchant rises in the third row Now a violent response   Gandhi holds up his hand silencing the hall  Singh smiles at the understatement  Khan leans towards Singh nodding to Gandhi  The police stare imperturbably  In the gallery a rhythmic pounding signals the anger and protest and is taken up around the hall  The policemen just sit like stone  confident sure immune to rhetoric  And again the audience bursts into applause  When it subsides Gandhi looks down at the plainclothes policemen fixing his gaze on them  A buzz then applause  loud and defiant  A uniformed policeman stands near them  European policemen conspicuous in seats at the end of the front row  Gandhi looks around the audience and we see the packed house from his point of view ending with two plainclothes  Charlie Andrews and Herman Kallenbach sit at the very end of the line of chairs  three more leaders of the Indian community  Seated on the stage are Khan Singh  Gandhi moves forward and he holds up his hand for silence  The mood is restless belligerent  The gallery is bulging with indentured laborers  largely Hindu  Muslim Hindu Parsee Sikh  the back of the stalls with small traders peddlers artisans   The front rows near the stage are held by rich Muslim merchants  The theater is packed  She looks at him evenly  no smile but the warmth still in her eyes  Gandhi holds her back so that he can look at her  Ba nods  Gandhi sighs putting his arms around her and she leans into him so that their heads are touching  warmer less complicated by doubts  Ba catches it and sends it back  And Gandhi grins weakly  Gandhi looks up at her blankly abjectly  A moment then she soothes the top of his head  like the motherwife she is  She moves and kneels before him  Ba studies him for a moment  and she sighs her temper and breathing subsiding too  He sinks numbly to a stool sitting holding his head in his hands  Gandhi stares at her breathlessly his temper subsiding into a dazed remorse  It is hushed but violent as he pulls her toward the rear door opening it to push her out as she struggles against him  He suddenly reaches down and grabs her arm pulling her roughly to her feet  For a moment Gandhi stares at her and she back at him resentfully  Ba settles back defiantly  She says it derisively and it stings but Gandhi is aware of Walker and he fights to hold his temper  As she starts to rise he grabs her arm but she pulls free  He holds her gaze as angrily as she holds his "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "And Gandhi grins weakly  Ba catches it and sends it back  A buzz then applause  loud and defiant  The front rows near the stage are held by rich Muslim merchants  He holds her gaze as angrily as she holds his  warmer less complicated by doubts  He sinks numbly to a stool sitting holding his head in his hands  Khan leans towards Singh nodding to Gandhi  three more leaders of the Indian community  Gandhi looks around the audience and we see the packed house from his point of view ending with two plainclothes  The mood is restless belligerent  A uniformed policeman stands near them  She moves and kneels before him  Ba nods  For a moment Gandhi stares at her and she back at him resentfully  Gandhi looks up at her blankly abjectly  Ba settles back defiantly  The policemen just sit like stone  confident sure immune to rhetoric  Muslim Hindu Parsee Sikh  Ba studies him for a moment  and she sighs her temper and breathing subsiding too  And again the audience bursts into applause  As she starts to rise he grabs her arm but she pulls free  In the gallery a rhythmic pounding signals the anger and protest and is taken up around the hall  Singh smiles at the understatement  Now a violent response   European policemen conspicuous in seats at the end of the front row  A moment then she soothes the top of his head  like the motherwife she is  Seated on the stage are Khan Singh  She looks at him evenly  no smile but the warmth still in her eyes  The theater is packed  Gandhi moves forward and he holds up his hand for silence  Gandhi holds her back so that he can look at her  He suddenly reaches down and grabs her arm pulling her roughly to her feet  a large powerful merchant rises in the third row Gandhi stares at her breathlessly his temper subsiding into a dazed remorse  When it subsides Gandhi looks down at the plainclothes policemen fixing his gaze on them  Charlie Andrews and Herman Kallenbach sit at the very end of the line of chairs  She says it derisively and it stings but Gandhi is aware of Walker and he fights to hold his temper  Gandhi sighs putting his arms around her and she leans into him so that their heads are touching  The police stare imperturbably  Gandhi holds up his hand silencing the hall  the back of the stalls with small traders peddlers artisans   It is hushed but violent as he pulls her toward the rear door opening it to push her out as she struggles against him  The gallery is bulging with indentured laborers  largely Hindu "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "the back of the stalls with small traders peddlers artisans   Muslim Hindu Parsee Sikh  The gallery is bulging with indentured laborers  largely Hindu  The mood is restless belligerent  Gandhi moves forward and he holds up his hand for silence  Seated on the stage are Khan Singh  three more leaders of the Indian community  Charlie Andrews and Herman Kallenbach sit at the very end of the line of chairs  Gandhi looks around the audience and we see the packed house from his point of view ending with two plainclothes  European policemen conspicuous in seats at the end of the front row  A uniformed policeman stands near them  A buzz then applause  loud and defiant  When it subsides Gandhi looks down at the plainclothes policemen fixing his gaze on them  And again the audience bursts into applause  The policemen just sit like stone  confident sure immune to rhetoric  In the gallery a rhythmic pounding signals the anger and protest and is taken up around the hall  The police stare imperturbably  Khan leans towards Singh nodding to Gandhi  Singh smiles at the understatement  Gandhi holds up his hand silencing the hall  Now a violent response   a large powerful merchant rises in the third row He holds her gaze as angrily as she holds his  As she starts to rise he grabs her arm but she pulls free  She says it derisively and it stings but Gandhi is aware of Walker and he fights to hold his temper  Ba settles back defiantly  For a moment Gandhi stares at her and she back at him resentfully  He suddenly reaches down and grabs her arm pulling her roughly to her feet  It is hushed but violent as he pulls her toward the rear door opening it to push her out as she struggles against him  Gandhi stares at her breathlessly his temper subsiding into a dazed remorse  He sinks numbly to a stool sitting holding his head in his hands  Ba studies him for a moment  and she sighs her temper and breathing subsiding too  She moves and kneels before him  A moment then she soothes the top of his head  like the motherwife she is  Gandhi looks up at her blankly abjectly  And Gandhi grins weakly  Ba catches it and sends it back  warmer less complicated by doubts  Gandhi sighs putting his arms around her and she leans into him so that their heads are touching  Ba nods  Gandhi holds her back so that he can look at her  She looks at him evenly  no smile but the warmth still in her eyes  The theater is packed  The front rows near the stage are held by rich Muslim merchants "
        }
      ]
    }
  ]
}