{
  "ground_truth": "As Karen finds herself listening, despite herself, meanwhile, the guy's hot, runs the three hundred up to half a million. Chili starts to speak, but Harry cuts him off, then turns back to Chili. Chili looks at Karen, and she's staring at Chili again, patient. Karen looks at the two of them sitting there; Harry turns to him, and they both look at her. She just looks at him, turns, and walks out, as Chili watches her go. Harry nods, thinks a moment, then Chili looks at him. We tilt up this time to reveal a little kid, listening to a Walkman, as Harry looks at him. Harry points across the street to the Cafe Med where we see a red Ferrari convertible parked out the front, and we see Martin Weir and a woman with jet-black hair sitting at a table. They watch Martin and the girl a moment, and Harry pulls out, starts driving again. There are some of Karen, Harry with a much younger, blonde Karen. Chili stands looking over some of the old photographs as Harry goes through the mess on the desk. Harry hands a script to Chili, who examines the cover, the first time he's ever held a movie script and opens it to the middle. Chili looks out the window as we see a long black stretch limo pull up to the curb down on the street. Chili tosses the script on the desk, moves between a pair of fat red leather chairs, as Harry moves away from the window and is tugging the string to lower the blinds behind the desk. Ronnie singing, and the door opens as the Bear opens the door for Bo Catlett and Ronnie. Chili sits behind the desk, watching the two of them come into the office, as Catlett comes first. Ronnie sits down in the chair and hooks one leg over the arm, swings it up and down, his motor running on some chemical, while Harry waves them right into the two cracked red leather chairs facing the desk. Sitting down, he nods to Chili, who ignores him, Harry already forgetting his instructions. Chili can't believe it, he too stares at Chili, and Chili shakes his head, he can't believe he's hearing this. The limo guys nod to Chili and Chili nods back, trying to catch Harry's eye. Ronnie looks over, so does Bo Catlett for that matter. Catlett looks at Chili again, now it's between them. The guy studies Chili, thinks about whether or not to make a move, when Harry steps in, reaches over the desk, and picks up a script. Chili looks at Harry, wonders if there's a way to shut him up without punching him in the mouth.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "As Karen discovers herself attending, in spite of herself, meanwhile, the guy is attractive, increases the three hundred up to half a million. Chili begins to talk, but Harry interrupts him, then turns back to Chili. Chili glances at Karen, and she's gazing at Chili again, patient. Karen observes the two of them seated there; Harry turns to him, and they both glance at her. She just glances at him, turns, and walks out, as Chili observes her leave. Harry nods, considers for a moment, then Chili glances at him. We tilt up this time to disclose a small kid, attending to a Walkman, as Harry glances at him. Harry gestures across the avenue to the Cafe Med where we observe a crimson Ferrari convertible stationed out the front, and we observe Martin Weir and a woman with jet-black hair seated at a table. They observe Martin and the girl a moment, and Harry drives out, starts moving again. There are some of Karen, Harry with a much younger, blonde Karen. Chili stands observing over some of the old pictures as Harry goes through the clutter on the desk. Harry hands a script to Chili, who inspects the cover, the first time he's ever held a movie script and opens it to the middle. Chili glances out the window as we observe a long black stretch limo pull up to the curb down on the avenue. Chili tosses the script on the desk, moves between a pair of fat red leather chairs, as Harry moves away from the window and is pulling the string to lower the blinds behind the desk. Ronnie singing, and the door opens as the Bear opens the door for Bo Catlett and Ronnie. Chili sits behind the desk, observing the two of them enter the office, as Catlett arrives first. Ronnie sits in the chair and hooks one leg over the arm, swings it up and down, his motor running on some chemical, while Harry waves them right into the two cracked red leather chairs facing the desk. Seated, he nods to Chili, who disregards him, Harry already forgetting his instructions. Chili can't believe it, he too stares at Chili, and Chili shakes his head, he can't believe he's hearing this. The limo guys nod to Chili and Chili nods back, attempting to catch Harry's eye. Ronnie glances over, so does Bo Catlett for that matter. Catlett glances at Chili again, now it's between them. The guy examines Chili, considers whether or not to make a move, when Harry intervenes, reaches over the desk, and picks up a script. Chili glances at Harry, wonders if there's a way to quiet him without punching him in the mouth."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "As Karen finds herself listening, despite herself, meanwhile, the guy's hot, the three hundred is run up to half a million by him. Chili starts to speak, but he is cut off by Harry, who then turns back to Chili. Chili is looked at by Karen, and Chili is stared at patiently by her again. Karen looks at the two of them sitting there; Harry turns to him, and she is looked at by both of them. She just looks at him, turns, and walks out, as she is watched by Chili. Harry nods, thinks a moment, then Harry is looked at by Chili. This time, a little kid is revealed by us tilting up, listening to a Walkman, as he is looked at by Harry. Harry points across the street to the Cafe Med where a red Ferrari convertible is parked out the front, and Martin Weir and a woman with jet-black hair are seen sitting at a table by us. They watch Martin and the girl a moment, and Harry pulls out, and driving is started again by him. There are some of Karen, and Harry is shown with a much younger, blonde Karen. Chili stands looking over some of the old photographs as the mess on the desk is gone through by Harry. A script is handed to Chili by Harry, who examines the cover, and for the first time, a movie script is held by him and opened to the middle. The window is looked out by Chili as a long black stretch limo is seen pulling up to the curb down on the street. The script is tossed on the desk by Chili, and he moves between a pair of fat red leather chairs, as the window is moved away from by Harry and the string to lower the blinds behind the desk is tugged by him. Ronnie is singing, and the door opens as the door is opened by the Bear for Bo Catlett and Ronnie. The desk is sat behind by Chili, watching the two of them come into the office, as coming first is Catlett. Ronnie sits down in the chair and hooks one leg over the arm, swings it up and down, his motor running on some chemical, while right into the two cracked red leather chairs facing the desk they are waved by Harry. Sitting down, he nods to Chili, who is ignored by Chili, and already his instructions are forgotten by Harry. Chili can't believe it, and he too is stared at by Chili, and Chili shakes his head, he can't believe this is being heard by him. The limo guys nod to Chili, and Harry's eye is tried to be caught by Chili nodding back. Ronnie looks over, so does Bo Catlett for that matter. Catlett looks at Chili again, now it's between them. Chili is studied by the guy, who thinks about whether or not to make a move, when Harry steps in, reaches over the desk, and a script is picked up by him. Chili looks at Harry and wonders if there's a way to shut him up without punching him in the mouth."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "As Karen listens, despite herself, the guy's hot, running the three hundred up to half a million. Chili starts to speak, but Harry interrupts, then turns back to Chili. Karen stares at Chili, patient. She looks at them, Harry turns, and they both look at her. She turns and walks out, as Chili watches. Harry nods, thinks, then Chili looks at him. We tilt up to reveal a kid with a Walkman, as Harry looks at him. Harry points to Cafe Med, where a red Ferrari is parked, and Martin Weir sits with a woman with jet-black hair. They watch Martin and the woman, and Harry drives again. There are photos of Karen, Harry with a younger, blonde Karen. Chili looks over the photos as Harry sorts the desk mess. Harry hands Chili a script, the first he's ever held, and he opens it. Chili looks out the window as a black limo pulls up. Chili tosses the script, moves between red leather chairs, as Harry lowers the blinds. Ronnie sings, and the Bear opens the door for Bo Catlett and Ronnie. Chili sits behind the desk, watching them enter, Catlett first. Ronnie sits, hooks a leg over the chair arm, swinging it, while Harry waves them to the chairs. Sitting, he nods to Chili, who ignores him, Harry forgetting his instructions. Chili can't believe it, stares at Chili, and shakes his head. The limo guys nod to Chili, and he nods back, trying to catch Harry's eye. Ronnie and Bo Catlett look over. Catlett studies Chili, considering a move, when Harry steps in, picks up a script. Chili looks at Harry, wondering how to silence him without punching him."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Karen listens as the guy's hot, runs three hundred to half a million. Chili starts speaking, but Harry interrupts, turning back to Chili. Karen stares at Chili, patient. She looks at them, then walks out as Chili watches. Harry nods, Chili looks at him. We reveal a kid with a Walkman, Harry points to Cafe Med with a red Ferrari and Martin Weir with a woman. Harry drives again. Karen is younger, blonde. Chili examines old photos as Harry sorts the desk. Harry gives a script to Chili, his first movie script. A limo arrives, Chili tosses the script, moves between chairs, Harry lowers blinds. Ronnie sings, Bear opens the door for Bo Catlett and Ronnie. Chili watches them enter, Catlett first. Ronnie sits, swings leg, Harry waves them to chairs. Chili ignores a nod, can't believe what's happening. Limo guys and Chili nod. Catlett looks at Chili, it's between them. The guy considers a move, Harry steps in, picks up a script. Chili wonders how to silence Harry without violence."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "As Karen finds herself listening, despite her initial reluctance, she can't help but be drawn into the unfolding scene. Meanwhile, the guy, who is undeniably attractive, manages to increase the three hundred to an impressive half a million. Just as Chili begins to speak, Harry abruptly interrupts him, then turns his attention back to Chili. Chili, in turn, glances at Karen, noticing that she is once again staring at him with a patient expression. Karen observes the two of them sitting there; Harry shifts his gaze to him, and they both direct their attention toward her. She simply looks at him, then turns and walks out, while Chili watches her departure intently. Harry nods thoughtfully, pauses for a moment, and then Chili looks at him. We tilt upward this time to reveal a young child, engrossed in listening to a Walkman, as Harry directs his gaze toward him. Harry gestures across the street to the Cafe Med, where we notice a striking red Ferrari convertible parked prominently out front, and we see Martin Weir accompanied by a woman with striking jet-black hair seated at a table. They take a moment to observe Martin and the woman, and then Harry resumes driving. There are some photographs of Karen, Harry with a much younger, blonde version of Karen. Chili stands, examining some of the old photographs while Harry rummages through the clutter on the desk. Harry hands a script to Chili, who carefully examines the cover, realizing it's the first time he's ever held a movie script, and he opens it to the middle. Chili glances out the window as we see a long, sleek black stretch limo pulling up to the curb down on the street. Chili casually tosses the script onto the desk, moving between a pair of plush, fat red leather chairs, as Harry steps away from the window and begins tugging the string to lower the blinds behind the desk. Ronnie is singing, and the door swings open as the Bear opens it for Bo Catlett and Ronnie. Chili sits behind the desk, observing the two of them as they enter the office, with Catlett leading the way. Ronnie settles into a chair, hooking one leg over the arm and swinging it up and down, his energy fueled by some chemical, while Harry waves them into the two cracked red leather chairs facing the desk. As they sit down, he nods to Chili, who pointedly ignores him, with Harry already forgetting his previous instructions. Chili is incredulous, staring at Chili, and Chili shakes his head, unable to believe what he's hearing. The limo guys nod to Chili, and Chili nods back, attempting to catch Harry's eye. Ronnie glances over, as does Bo Catlett, for that matter. Catlett looks at Chili once more, and now it's a silent exchange between them. The guy studies Chili, contemplating whether or not to make a move, when Harry intervenes, reaching over the desk to pick up a script. Chili looks at Harry, wondering if there's a way to silence him without resorting to punching him in the mouth."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Despite her initial reluctance and hesitation, Karen finds herself listening with increasing interest, unable to resist being drawn into the unfolding scene playing out before her. At the same time, the undeniably attractive guy manages, quite impressively, to elevate the three hundred to a remarkable and noteworthy half a million. Just as Chili is about to speak, Harry suddenly interrupts him, and then, without missing a beat, redirects his focus back toward Chili. In response, Chili briefly glances over at Karen, noticing that she is once again focused on him with a patient and attentive expression on her face. Karen takes in the sight of the two of them sitting there; Harry shifts his gaze toward Chili, and both of them, in unison, turn their attention to her. She simply meets his gaze, then turns and gracefully walks out, while Chili observes her departure with an intense focus. Harry nods thoughtfully, taking a brief pause before Chili casts a glance in his direction. The scene tilts upward this time, revealing a young child who is completely engrossed in listening to a Walkman, as Harry directs his gaze toward him. Harry gestures across the street toward the Cafe Med, where we notice a striking red Ferrari convertible prominently parked out front, and we witness Martin Weir accompanied by a woman with striking, jet-black hair sitting at a table. They take a moment to observe Martin and the woman, and then Harry resumes driving. There are several photographs displayed, depicting Karen and Harry with a much younger, blonde version of Karen. Chili stands, examining some of these old photographs, while Harry rummages through the clutter strewn across the desk. Harry hands a script over to Chili, who examines the cover carefully, realizing it's the first time he's ever held a movie script, and he opens it to the middle. Chili glances out the window as we see a long, sleek black stretch limo pulling up to the curb down on the street. Casually, Chili tosses the script onto the desk, moving between a pair of plush, fat red leather chairs, as Harry steps away from the window and begins to tug the string, lowering the blinds behind the desk. Ronnie is singing as the door swings open, with the Bear holding it for Bo Catlett and Ronnie. Chili sits behind the desk, watching the two of them as they enter the office, with Catlett leading the way. Ronnie settles into a chair, hooking one leg over the arm and swinging it up and down, his energy clearly fueled by some chemical, while Harry waves them into the two cracked red leather chairs facing the desk. As they settle in, he nods to Chili, who pointedly ignores him, and Harry seems to have already forgotten his earlier instructions. Chili is left incredulous, staring at Chili, and he shakes his head, unable to comprehend what he is hearing. The limo guys nod to Chili, and Chili nods back, attempting to catch Harry's attention. Ronnie glances over, as does Bo Catlett, for that matter. Catlett gives Chili another look, and now a silent exchange passes between them. The guy studies Chili, contemplating his next move, when Harry intervenes, reaching across the desk to pick up a script. Chili looks at Harry, wondering if there's a way to silence him without resorting to punching him in the mouth."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "As Karen finds herself listening, despite her initial reluctance, she becomes aware of the guy's presence, who is notably attractive, and observes as he skillfully increases the amount from three hundred to half a million. Just as Chili begins to speak, Harry abruptly interrupts him, redirecting his attention back to Chili. Chili, in turn, glances at Karen, noticing that she is once again staring at him with a patient expression. Karen takes a moment to observe the two of them sitting there; Harry then turns his attention to Chili, and together they both direct their gaze towards her. She simply looks at him, then decisively turns and walks out, while Chili watches her departure intently. Harry gives a nod, contemplating for a moment, and then Chili shifts his gaze to him. The scene transitions as we tilt up to reveal a little kid engrossed in listening to a Walkman, capturing Harry's attention. Harry gestures across the street towards the Cafe Med, where a striking red Ferrari convertible is parked prominently out front, and they notice Martin Weir seated at a table with a woman who has jet-black hair. They take a moment to observe Martin and the woman, and then Harry resumes driving. The narrative shifts to include some scenes of Karen and Harry with a much younger, blonde version of Karen. Chili stands, thoughtfully examining some of the old photographs while Harry rummages through the clutter on the desk. Harry then hands a script to Chili, who carefully examines the cover, realizing it's the first time he's ever held a movie script, and curiously opens it to the middle. As Chili looks out the window, he sees a long black stretch limo pulling up to the curb on the street below. He casually tosses the script onto the desk and maneuvers between a pair of plush red leather chairs, while Harry moves away from the window, tugging the string to lower the blinds behind the desk. Meanwhile, Ronnie is singing, and the door opens as the Bear ushers Bo Catlett and Ronnie into the room. Chili takes a seat behind the desk, observing the two of them as they enter the office, with Catlett leading the way. Ronnie settles into a chair, casually hooking one leg over the arm and swinging it up and down, clearly energized by some chemical influence, while Harry gestures for them to sit in the two cracked red leather chairs facing the desk. Once seated, he nods to Chili, who pointedly ignores him, as Harry seems to have already forgotten his instructions. Chili is incredulous, staring at Harry in disbelief, and shakes his head, unable to comprehend what he's hearing. The limo guys acknowledge Chili with a nod, and Chili reciprocates, attempting to catch Harry's eye. Ronnie glances over, as does Bo Catlett, who seems to be assessing the situation. Catlett looks at Chili again, and the tension between them becomes palpable. The guy scrutinizes Chili, contemplating whether or not to take action, when Harry intervenes, reaching over the desk to pick up a script. Chili looks at Harry, contemplating if there's a way to silence him without resorting to physical confrontation."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "As Karen listens, despite herself, the guy's hot, increasing the three hundred to half a million. Chili starts to speak, but Harry interrupts and turns back to Chili. Karen observes them both, then turns and walks out as Chili watches. Harry nods, contemplates, and Chili looks at him. They notice a kid with a Walkman as Harry points to a red Ferrari parked at Cafe Med, where Martin Weir and a woman sit. After watching them briefly, Harry resumes driving. Karen, Harry, and a younger Karen appear in old photographs that Chili examines while Harry sorts through the desk clutter. Harry hands Chili a script, which he inspects for the first time, then glances out the window at a limo pulling up. Chili discards the script, moves between leather chairs, and Harry lowers the blinds. As Ronnie sings, the Bear opens the door for Bo Catlett and Ronnie. Chili sits behind the desk, observing their entrance, with Catlett leading. Ronnie sits, swinging his leg, while Harry directs them to the chairs. Sitting, he nods to Chili, who ignores him, as Harry forgets his instructions. Chili is incredulous, shaking his head at what he's hearing. The limo guys nod to Chili, who nods back, trying to catch Harry's eye. Ronnie and Bo Catlett both look at Chili, and Catlett studies him, contemplating a move, when Harry intervenes, picking up a script. Chili looks at Harry, pondering how to silence him without resorting to violence."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "As Karen finds herself listening, despite herself, to the unfolding situation, meanwhile, the guy's hot—an expression often used to describe someone gaining rapid popularity or success in entertainment circles—runs the three hundred up to half a million. Chili starts to speak, but Harry, a seasoned film producer known for his abrupt demeanor, cuts him off, then turns back to Chili. Chili looks at Karen, and she's staring at Chili again, patient like a veteran actress considering her next line. Karen looks at the two of them sitting there; Harry turns to him, and they both look at her. She just looks at him, turns, and walks out, as Chili watches her go. Harry, known for his quick decisions, nods, thinks a moment, then Chili looks at him. We tilt up this time to reveal a little kid, listening to a Walkman, a popular portable cassette player in the 1980s and 1990s, as Harry looks at him. Harry points across the street to the Cafe Med, a well-known Hollywood hangout for celebrities, where we see a red Ferrari convertible parked out the front, and we see Martin Weir, a famous actor known for his distinctive style, and a woman with jet-black hair sitting at a table. They watch Martin and the girl a moment, and Harry pulls out, starts driving again. There are some of Karen, Harry with a much younger, blonde Karen, back in her early acting days. Chili stands looking over some of the old photographs as Harry goes through the mess on the desk, filled with scripts and film paraphernalia. Harry hands a script to Chili, who examines the cover, the first time he's ever held a movie script, a momentous occasion for someone looking to break into filmmaking, and opens it to the middle. Chili looks out the window as we see a long black stretch limo, a symbol of luxury and success, pull up to the curb down on the street. Chili tosses the script on the desk, moves between a pair of fat red leather chairs, as Harry moves away from the window and is tugging the string to lower the blinds behind the desk, a gesture to maintain privacy. Ronnie singing, and the door opens as the Bear opens the door for Bo Catlett and Ronnie, two familiar figures in the underworld scene. Chili sits behind the desk, watching the two of them come into the office, as Catlett, a small-time gangster attempting to make it big, comes first. Ronnie sits down in the chair and hooks one leg over the arm, swings it up and down, his motor running on some chemical, indicative of the rampant drug use in Hollywood's gritty underside, while Harry waves them right into the two cracked red leather chairs facing the desk. Sitting down, he nods to Chili, who ignores him, Harry already forgetting his instructions. Chili can't believe it, he too stares at Chili, and Chili shakes his head, he can't believe he's hearing this. The limo guys, typically imposing figures tasked with security, nod to Chili and Chili nods back, trying to catch Harry's eye, the latter known for his political maneuvering in the film industry. Ronnie looks over, so does Bo Catlett for that matter, the tension palpable in the room. Catlett looks at Chili again, now it's between them. The guy studies Chili, thinks about whether or not to make a move, when Harry steps in, reaches over the desk, and picks up a script, an object of much debate and importance in their current dealings. Chili looks at Harry, wonders if there's a way to shut him up without punching him in the mouth, the tension of the Hollywood high-stakes business taking its toll."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "As Karen finds herself listening despite herself meanwhile the guy's hot runs the three hundred up to half a million  patient  Karen looks at the two of them sitting there  Harry turns to him and they both look at her  She just looks at him turns and walks out as Chili watches her go  Harry nods thinks a moment  then Chili looks at him  We tilt up this time to reveal a little kid listening to a Walkman as Harry looks at him  Harry points across the street to the Cafe Med where we see a red Ferrari convertible parked out the front and we see Martin Weir and a woman with jetblack hair sitting at a table  They watch Martin and the girl a moment and Harry pulls out starts driving again  There are some of Karen Harry with a much younger blonde Karen  Chili stands looking over some of the old photographs as Harry goes through the mess on the desk  Harry hands a script to Chili who examines the cover the first time he's ever held a movie script and opens it to the middle  Chili looks out the window as we see a long black stretch limo pull up to the curb down on the street  Chili tosses the script on the desk moves between a pair of fat red leather chairs as Harry moves away from the window and is tugging the string to lower the blinds behind the desk  Ronnie singing and the door opens as the Bear opens the door for Bo Catlett and Ronnie  Chili sits behind the desk watching the two of them come into the office as Catlett comes first  Ronnie sits down in the chair and hooks one leg over the arm swings it up and down his motor running on some chemical while Harry waves them right into the two cracked red leather chairs facing the desk  Chili starts to speak but Harry cuts him off then turns back to Chili  Chili looks at Karen and she's staring at Chili again  patient  Karen looks at the two of them sitting there  Harry turns to him and they both look at her  She just looks at him turns and walks out as Chili watches her go  Harry nods thinks a moment  then Chili looks at him  We tilt up this time to reveal a little kid listening to a Walkman as Harry looks at him  Harry points across the street to the Cafe Med where we see a red Ferrari convertible parked out the front and we see Martin Weir and a woman with jetblack hair sitting at a table  They watch Martin and the girl a moment and Harry pulls out starts driving again  There are some of Karen Harry with a much younger blonde Karen  Chili stands looking over some of the old photographs as Harry goes through the mess on the desk  Harry hands a script to Chili who examines the cover the first time he's ever held a movie script and opens it to the middle  Chili looks out the window as we see a long black stretch limo pull up to the curb down on the street  Chili tosses the script on the desk moves between a pair of fat red leather chairs as Harry moves away from the window and is tugging the string to lower the blinds behind the desk  Ronnie singing and the door opens as the Bear opens the door for Bo Catlett and Ronnie  Chili sits behind the desk watching the two of them come into the office as Catlett comes first  Ronnie sits down in the chair and hooks one leg over the arm swings it up and down his motor running on some chemical while Harry waves them right into the two cracked red leather chairs facing the desk  Sitting down he nods to Chili who ignores him  Harry already forgetting his instructions  Chili can't believe it  he too stares at Chili and Chili shakes his head he can't believe he's hearing this  The limo guys nod to Chili and Chili nods back trying to catch Harry's eye  Ronnie looks over  so does Bo Catlett for that matter  Catlett looks at Chili again  now it's between them  The guy studies  Chili thinks about whether or not to make a move when Harry steps in reaches over the desk and picks up a script  Chili looks at  Harry wonders if there's a way to shut him up without punching him in the mouth"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "As Karen finds herself listening despite herself meanwhile the guy's hot runs the three hundred up to half a million. Chili starts to speak but Harry cuts him off then turns back to Chili. Chili looks at Karen and she is staring at Chili again. patient. Karen looks at the two of them sitting there. Harry turns to him and they both look at her. She just looks at him turns and walks out as Chili watches her go. Harry nods thinks a moment. then Chili looks at him. We tilt up this time to reveal a little kid listening to a Walkman as Harry looks at him. Harry points across the street to the Cafe Med where we see a red Ferrari convertible parked out the front and we see Martin Weir and a woman with jetblack hair sitting at a table. They watch Martin and the girl a moment and Harry pulls out starts driving again. There are some of Karen Harry with a much younger blonde Karen. Chili stands looking over some of the old photographs as Harry goes through the mess on the desk. Harry hands a script to Chili who examines the cover the first time he is ever held a movie script and opens it to the middle. Chili looks out the window as we see a long black stretch limo pull up to the curb down on the street. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. Chili tosses the script on the desk moves between a pair of fat red leather chairs as Harry moves away from the window and is tugging the string to lower the blinds behind the desk. Ronnie singing and the door opens as the Bear opens the door for Bo Catlett and Ronnie. Chili sits behind the desk watching the two of them come into the office as Catlett comes first. Ronnie sits down in the chair and hooks one leg over the arm swings it up and down his motor running on some chemical while Harry waves them right into the two cracked red leather chairs facing the desk. Sitting down he nods to Chili who ignores him. Harry already forgetting his instructions. Chili cannot believe it. he too stares at Chili and Chili shakes his head. he cannot believe he is hearing this. The limo guys nod to Chili and Chili nods back trying to catch Harry's eye. Ronnie looks over. so does Bo Catlett for that matter. Catlett looks at Chili again. now it is between them. The guy studies. Chili thinks about whether or not to make a move when Harry steps in reaches over the desk and picks up a script. Chili looks at Harry wonders if there is a way to shut him up without punching him in the mouth."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "As Karen finds herself listening despite herself meanwhile the guy's hot runs the three hundred up to half a million. Chili starts to speak but Harry cuts him off then turns back to Chili. Chili looks at Karen and she is staring at Chili again. patient. Karen looks at the two of them sitting there. Harry turns to him and they both look at her. She just looks at him turns and walks out as Chili watches her go. Harry nods thinks a moment. then Chili looks at him. We tilt up this time to reveal a little kid listening to a Walkman as Harry looks at him. Harry points across the street to the Cafe Med where we see a red Ferrari convertible parked out the front and we see Martin Weir and a woman with jetblack hair sitting at a table. They watch Martin and the girl a moment and Harry pulls out starts driving again. There are some of Karen Harry with a much younger blonde Karen. Chili stands looking over some of the old photographs as Harry goes through the mess on the desk. Harry hands a script to Chili who examines the cover the first time he is ever held a movie script and opens it to the middle. Chili looks out the window as we see a long black stretch limo pull up to the curb down on the street. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. Chili tosses the script on the desk moves between a pair of fat red leather chairs as Harry moves away from the window and is tugging the string to lower the blinds behind the desk. Ronnie singing and the door opens as the Bear opens the door for Bo Catlett and Ronnie. Chili sits behind the desk watching the two of them come into the office as Catlett comes first. Ronnie sits down in the chair and hooks one leg over the arm swings it up and down his motor running on some chemical while Harry waves them right into the two cracked red leather chairs facing the desk. Sitting down he nods to Chili who ignores him. Harry already forgetting his instructions. Chili cannot believe it. he too stares at Chili and Chili shakes his head. he cannot believe he is hearing this. The limo guys nod to Chili and Chili nods back trying to catch Harry's eye. Ronnie looks over. so does Bo Catlett for that matter. Catlett looks at Chili again. now it is between them. The guy studies. Chili thinks about whether or not to make a move when Harry steps in reaches over the desk and picks up a script. Chili looks at Harry wonders if there is a way to shut him up without punching him in the mouth."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "As Karen finds herself listening despite herself meanwhile the guy's hot runs the three hundred up to half a million. Chili starts to speak but Harry cuts him off then turns back to Chili. Chili looks at Karen and she is staring at Chili again. patient. Karen looks at the two of them sitting there. Harry turns to him and they both look at her. She just looks at him turns and walks out as Chili watches her go. Harry nods thinks a moment. he cannot believe he is hearing this. The limo guys nod to Chili and Chili nods back trying to catch Harry's eye. Ronnie looks over. so does Bo Catlett for that matter. Catlett looks at Chili again. now it is between them. The guy studies. Chili thinks about whether or not to make a move when Harry steps in reaches over the desk and picks up a script. Chili looks at Harry wonders if there is a way to shut him up without punching him in the mouth."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "As Karen finds herself listening despite herself meanwhile the guy's hot runs the three hundred up to half a million. Chili starts to speak but Harry cuts him off then turns back to Chili. Chili looks at Karen and she is staring at Chili again. now it is between them. The guy studies. Chili thinks about whether or not to make a move when Harry steps in reaches over the desk and picks up a script. Chili looks at Harry wonders if there is a way to shut him up without punching him in the mouth."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "As the penguin finds herself listening, despite herself, meanwhile, the toaster's hot, runs the three hundred up to half a million. The turtle starts to speak, but the giraffe cuts him off, then turns back to the turtle. The turtle looks at the penguin, and she's staring at the turtle again, patient. The penguin looks at the two of them sitting there; the giraffe turns to him, and they both look at her. She just looks at him, turns, and walks out, as the turtle watches her go. The giraffe nods, thinks a moment, then the turtle looks at him. We tilt up this time to reveal a little dog, listening to a Walkman, as the giraffe looks at him. The giraffe points across the street to the Cafe Med where we see a red Ferrari convertible parked out the front, and we see a parrot and a woman with jet-black hair sitting at a table. They watch the parrot and the girl a moment, and the giraffe pulls out, starts driving again. There are some of the penguin, the giraffe with a much younger, blonde penguin. The turtle stands looking over some of the old photographs as the giraffe goes through the mess on the desk. The giraffe hands a script to the turtle, who examines the cover, the first time he's ever held a movie script and opens it to the middle. The turtle looks out the window as we see a long black stretch limo pull up to the curb down on the street. The turtle tosses the script on the desk, moves between a pair of fat red leather chairs, as the giraffe moves away from the window and is tugging the string to lower the blinds behind the desk. The lion singing, and the door opens as the fish opens the door for the elephant and the lion. The turtle sits behind the desk, watching the two of them come into the office, as the elephant comes first. The lion sits down in the chair and hooks one leg over the arm, swings it up and down, his motor running on some chemical, while the giraffe waves them right into the two cracked red leather chairs facing the desk. Sitting down, he nods to the turtle, who ignores him, the giraffe already forgetting his instructions. The turtle can't believe it, he too stares at the turtle, and the turtle shakes his head, he can't believe he's hearing this. The limo guys nod to the turtle and the turtle nods back, trying to catch the giraffe's eye. The lion looks over, so does the elephant for that matter. The elephant looks at the turtle again, now it's between them. The toaster studies the turtle, thinks about whether or not to make a move, when the giraffe steps in, reaches over the desk, and picks up a script. The turtle looks at the giraffe, wonders if there's a way to shut him up without punching him in the mouth."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "As Karen finds herself listening, despite herself, meanwhile, the guy's hot, runs the three hundred up to half a million. Chili starts to speak, but Harry cuts him off, then turns back to Chili. Chili looks at Karen, and she's staring at Chili again, patient. Karen looks at the two of them sitting there; Harry turns to him, and they both look at her. She just looks at him, turns, and walks out, as Chili watches her go. Harry nods, thinks a moment, then Chili looks at him. We tilt up this time to reveal a little kid, listening to a cassette player, as Harry looks at him. Harry points across the street to the Art Gallery where we see a blue Lamborghini parked out the front, and we see Martin Weir and a woman with golden hair sitting at a table. They watch Martin and the girl a moment, and Harry pulls out, starts driving again. There are some of Karen, Harry with a much younger, brunette Karen. Chili stands looking over some of the old paintings as Harry goes through the clutter on the shelf. Harry hands a manuscript to Chili, who examines the cover, the first time he's ever held a book manuscript and opens it to the middle. Chili looks out the window as we see a long white stretch bus pull up to the curb down on the street. Chili tosses the manuscript on the shelf, moves between a pair of blue velvet couches, as Harry moves away from the window and is tugging the rope to lower the shades behind the shelf. Ronnie singing, and the door opens as the Bear opens the door for Bo Catlett and Ronnie. Chili sits behind the shelf, watching the two of them come into the study, as Catlett comes first. Ronnie sits down in the couch and hooks one leg over the arm, swings it up and down, his motor running on some drink, while Harry waves them right into the two cracked blue velvet couches facing the shelf. Sitting down, he nods to Chili, who ignores him, Harry already forgetting his instructions. Chili can't believe it, he too stares at Chili, and Chili shakes his head, he can't believe he's hearing this. The bus guys nod to Chili and Chili nods back, trying to catch Harry's eye. Ronnie looks over, so does Bo Catlett for that matter. Catlett looks at Chili again, now it's between them. The guy studies Chili, thinks about whether or not to make a move, when Harry steps in, reaches over the shelf, and picks up a manuscript. Chili looks at Harry, wonders if there's a way to shut him up without punching him in the nose."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "As Karen finds herself humming, despite herself, meanwhile, the guy's hot, runs the three hundred up to half a million. Chili starts to laugh, but Harry interrupts him, then turns back to Chili. Chili glances at Karen, and she's staring at Chili again, patient. Karen observes the two of them sitting there; Harry gestures to him, and they both gaze at her. She just glances at him, turns, and skips out, as Chili observes her departure. Harry winks, ponders a moment, then Chili glances at him. We pan up this time to reveal a little kid, dancing to a Walkman, as Harry glances at him. Harry gestures across the street to the Cafe Med where we see a red Ferrari convertible parked out the front, and we see Martin Weir and a woman with jet-black hair sitting at a table. They observe Martin and the girl a moment, and Harry pulls out, begins strolling again. There are some of Karen, Harry with a much younger, blonde Karen. Chili stands flipping through some of the old photographs as Harry sorts through the mess on the desk. Harry passes a script to Chili, who scrutinizes the cover, the first time he's ever grasped a movie script and flips it to the middle. Chili peers out the window as we see a long black stretch limo glide up to the curb down on the street. Chili drops the script on the desk, maneuvers between a pair of fat red leather chairs, as Harry drifts away from the window and is pulling the string to raise the blinds behind the desk. Ronnie humming, and the door swings as the Bear swings the door for Bo Catlett and Ronnie. Chili sits behind the desk, observing the two of them enter the office, as Catlett comes first. Ronnie settles into the chair and dangles one leg over the arm, swings it up and down, his motor racing on some chemical, while Harry beckons them right into the two cracked red leather chairs facing the desk. Sitting down, he nods to Chili, who brushes him off, Harry already disregarding his instructions. Chili can't believe it, he too fixes his gaze on Chili, and Chili shakes his head, he can't believe he's witnessing this. The limo guys nod to Chili and Chili nods back, attempting to catch Harry's eye. Ronnie glances over, so does Bo Catlett for that matter. Catlett glances at Chili again, now it's between them. The guy contemplates Chili, ponders whether or not to make a gesture, when Harry intervenes, leans over the desk, and snatches a script. Chili glances at Harry, wonders if there's a way to quiet him without kicking him in the shin."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "As the telephone finds itself listening, despite itself, meanwhile, the cat's cold, runs the five hundred up to a full moon. A shoe starts to speak, but a tree cuts it off, then turns back to a shoe. A shoe looks at the telephone, and it's staring at a shoe again, gentle. A telephone looks at the two of them sitting there; a tree turns to it, and they both look at a telephone. It just looks at it, turns, and walks out, as a shoe watches it go. A tree nods, thinks a moment, then a shoe looks at it. We tilt up this time to reveal a large plant, listening to a saxophone, as a tree looks at it. A tree points across the street to the Library Med where we see a blue violin parked out the front, and we see Tracy Weir and a dog with snow-white fur sitting at a table. They watch Tracy and the dog a moment, and a tree pulls out, starts driving again. There are some of a telephone, a tree with a much older, brunette telephone. A shoe stands looking over some of the old paintings as a tree goes through the box on the shelf. A tree hands a letter to a shoe, who examines the stamp, the first time it's ever held a music letter and opens it to the middle. A shoe looks out the window as we see a long white stretch bicycle pull up to the curb down on the street. A shoe tosses the letter on the shelf, moves between a pair of thin blue paper airplanes, as a tree moves away from the window and is tugging the string to lower the shades behind the shelf. Morgan singing, and the wall opens as the Lion opens the wall for Ze Bear and Morgan. A shoe sits behind the shelf, watching the two of them come into the kitchen, as Bear comes first. Morgan sits down in the paper airplane and hooks one leg over the wing, swings it up and down, its engine running on some battery, while a tree waves them right into the two torn blue paper airplanes facing the shelf. Sitting down, it nods to a shoe, who ignores it, a tree already forgetting its instructions. A shoe can't believe it, it too stares at a shoe, and a shoe shakes its head, it can't believe it's hearing this. The bicycle ghosts nod to a shoe and a shoe nods back, trying to catch a tree's eye. Morgan looks over, so does Ze Bear for that matter. Bear looks at a shoe again, now it's between them. The cat studies a shoe, thinks about whether or not to make a move, when a tree steps in, reaches over the shelf, and picks up a letter. A shoe looks at a tree, wonders if there's a way to shut it up without punching it in the nose."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "As Sandra finds herself watching, despite herself, meanwhile, the woman’s boiling, paddles the canoe up to half a million. Peppers begins to dance, but Larry interrupts him, then strolls back to Peppers. Peppers glances at Sandra, and she's glaring at Peppers again, calm. Sandra glances at the two of them sitting there; Larry rotates to her, and they both gaze at him. She simply gazes at her, spins, and marches out, as Peppers observes her depart. Larry nods, ponders a bit, then Peppers glances at her. We pan up this time to reveal a small dog, chewing on a bone, as Larry gazes at her. Larry gestures across the avenue to the Cafe Med where we see a blue Lamborghini roadster stationed out the front, and we see Marcus Young and a man with platinum-blond hair sitting at a table. They observe Marcus and the man a moment, and Larry pulls away, starts navigating again. There are some of Sandra, Larry with a much older, brunette Sandra. Peppers stands examining some of the antique paintings as Larry sorts through the clutter on the bookshelf. Larry hands an envelope to Peppers, who inspects the seal, the first time he's ever held a legal document and rips it open to the center. Peppers glances out the balcony as we see a short white stretch limo pull up to the sidewalk down on the avenue. Peppers hurls the envelope on the bookshelf, maneuvers between a pair of slim blue fabric sofas, as Larry moves away from the balcony and is pulling the rope to raise the curtains behind the bookshelf. Ronnie laughing, and the window opens as the Cub opens the window for Co Catlett and Ronnie. Peppers sits in front of the bookshelf, observing the two of them enter the lounge, as Catlett arrives first. Ronnie sits on the sofa and hooks one foot over the edge, swings it side to side, his mind racing on some idea, while Larry beckons them right into the two smooth blue fabric sofas facing the bookshelf. Settling down, he greets Peppers, who dismisses him, Larry already misplacing his directions. Peppers can't fathom it, he too glares at Peppers, and Peppers shakes his head, he can't fathom he's witnessing this. The limo drivers greet Peppers and Peppers greets back, trying to catch Larry’s attention. Ronnie stares over, so does Co Catlett for that matter. Catlett stares at Peppers again, now it's amongst them. The woman examines Peppers, considers whether or not to initiate a gesture, when Larry intervenes, reaches over the bookshelf, and picks up an envelope. Peppers glances at Larry, puzzles if there's a method to silence him without shoving him in the shoulder."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "As Karen finds herself humming, against her will, meanwhile, the guy's cold, dances the three hundred down to half a dozen. Chili starts to hum, but Harry interrupts him, then spins back to Chili. Chili glances at Karen, and she's peering at Chili again, composed. Karen observes the two of them lounging there; Harry swivels to him, and they both glance at her. She just gazes at him, spins, and strolls out, as Chili observes her leave. Harry shrugs, imagines a while, then Chili glances at him. We pan down this time to reveal a little kid, wearing a cap, as Harry glances at him. Harry gestures across the avenue to the Bakery Aroma where we see a blue Mustang coupe parked out the front, and we see Martin Weir and a woman with golden hair perched at a bench. They gaze at Martin and the girl a moment, and Harry kicks out, starts strolling again. There are some of Karen, Harry with a slightly older, brunette Karen. Chili stands peeking over some of the old newspapers as Harry rummages through the clutter on the shelf. Harry gives a notebook to Chili, who inspects the title, the first time he's ever held a songbook and flips it to the first page. Chili gazes into the hallway as we see a short white food truck roll up to the sidewalk down in the alley. Chili flips the notebook on the shelf, glides between a pair of slim blue plastic stools, as Harry steps away from the hallway and is pulling the rope to raise the curtains behind the shelf. Ronnie laughing, and the gate slides open as the Bear slides the gate for Bo Catlett and Ronnie. Chili leans against the shelf, observing the two of them enter the room, as Catlett proceeds first. Ronnie flops down in the stool and swings one arm over the back, taps it up and down, his mind racing on some melody, while Harry escorts them right into the two clean blue plastic stools facing the shelf. Perching down, he salutes Chili, who overlooks him, Harry already dismissing his reminders. Chili can't grasp it, he too watches Chili, and Chili shakes his hand, he can't grasp he's seeing this. The food truck guys salute Chili and Chili salutes back, attempting to catch Harry's attention. Ronnie glances over, so does Bo Catlett for that matter. Catlett glances at Chili again, now it's within them. The guy examines Chili, ponders whether or not to take a step, when Harry leans in, reaches over the shelf, and picks up a notebook. Chili glances at Harry, wonders if there's a method to hush him up without kicking him in the leg."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "While Zelda buries herself in reading, despite herself, meanwhile, the cat's cool, climbs the mountain up to a fortress. Pepper begins to dance, but Floyd interrupts him, then skips back to Pepper. Pepper glances at Zelda, and she's gazing at Pepper again, relaxed. Zelda observes the duo lounging there; Floyd shifts to her, and they both glance at him. She just peers at her, rotates, and strolls out, as Pepper views her departure. Floyd shrugs, ponders a while, then Pepper glances at her. We pan up this time to reveal a small rabbit, humming to a boombox, as Floyd observes it. Floyd gestures across the pathway to the Bistro Zen where we see a blue Mustang coupe parked at the entryway, and we see Marcus Weaver and a man with snowy-white hair leaning at a counter. They regard Marcus and the boy briefly, and Floyd slides out, begins flying again. There are a few of Zelda, Floyd with a much older, brunette Zelda. Pepper lounges examining a few of the new paintings as Floyd flips through the chaos on the couch. Floyd tosses a map to Pepper, who inspects the back, the last time he's ever seen a comic book and unfolds it to the edge. Pepper gazes out the vent as we see a short green hatchback roll up to the sidewalk down in the alley. Pepper flips the map on the couch, slides between a trio of narrow blue velvet sofas, as Floyd slides away from the vent and is yanking the chain to raise the shades beside the couch. Willie humming, and the window slides as the Wolf slides the window for Jo Barley and Willie. Pepper stands in front of the couch, observing the pair of them step into the studio, as Barley steps first. Willie perches on the stool and slings one foot over the bar, twirls it side to side, his battery charging on some drink, while Floyd waves them right onto the three faded blue velvet sofas nearing the couch. Standing up, he winks at Pepper, who overlooks her, Floyd already dropping his queries. Pepper can't believe it, he additionally gawks at Pepper, and Pepper shakes her head, she can't fathom she's feeling this. The hatchback girls nod to Pepper and Pepper nods back, attempting to steal Floyd's glance. Willie glances over, so does Jo Barley for that occurrence. Barley stares at Pepper again, now it's beside them. The woman reviews Pepper, ponders over whether or not to take a plunge, when Floyd hops out, stretches over the couch, and draws up a map. Pepper gazes at Floyd, wonders if there's a means to cease her without tapping her on the nose."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Karen finds herself listening to a heated exchange between Chili and Harry. Despite their tense conversation, Karen remains patient, observing both men before leaving. Meanwhile, Harry notices a red Ferrari parked at the Cafe Med with Martin Weir and a woman. He resumes driving, reflecting on past memories with a younger Karen. Chili examines a movie script for the first time, distracted by a limo arriving outside. As Harry lowers the blinds, Ronnie and Bo Catlett enter, their presence creating tension. Ronnie's erratic movements and Harry's disregard for instructions frustrate Chili. A silent exchange occurs between Chili and Catlett, interrupted when Harry picks up a script, leaving Chili contemplating how to silence him without resorting to violence."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Harry wonders if there's a way to shut him up without punching him in the mouth Chili looks at  Chili thinks about whether or not to make a move when Harry steps in reaches over the desk and picks up a script  The guy studies  now it's between them  Catlett looks at Chili again  so does Bo Catlett for that matter  Ronnie looks over  The limo guys nod to Chili and Chili nods back trying to catch Harry's eye  he too stares at Chili and Chili shakes his head he can't believe he's hearing this  Chili can't believe it  Harry already forgetting his instructions  Sitting down he nods to Chili who ignores him  Ronnie sits down in the chair and hooks one leg over the arm swings it up and down his motor running on some chemical while Harry waves them right into the two cracked red leather chairs facing the desk  Chili sits behind the desk watching the two of them come into the office as Catlett comes first  Ronnie singing and the door opens as the Bear opens the door for Bo Catlett and Ronnie  Chili tosses the script on the desk moves between a pair of fat red leather chairs as Harry moves away from the window and is tugging the string to lower the blinds behind the desk  Chili looks out the window as we see a long black stretch limo pull up to the curb down on the street  Harry hands a script to Chili who examines the cover the first time he's ever held a movie script and opens it to the middle  Chili stands looking over some of the old photographs as Harry goes through the mess on the desk  There are some of Karen Harry with a much younger blonde Karen  They watch Martin and the girl a moment and Harry pulls out starts driving again  Harry points across the street to the Cafe Med where we see a red Ferrari convertible parked out the front and we see Martin Weir and a woman with jetblack hair sitting at a table  We tilt up this time to reveal a little kid listening to a Walkman as Harry looks at him  then Chili looks at him  Harry nods thinks a moment  She just looks at him turns and walks out as Chili watches her go  Harry turns to him and they both look at her  Karen looks at the two of them sitting there  patient  Chili looks at Karen and she's staring at Chili again  Chili starts to speak but Harry cuts him off then turns back to Chili  As Karen finds herself listening despite herself meanwhile the guy's hot runs the three hundred up to half a million "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Chili looks out the window as we see a long black stretch limo pull up to the curb down on the street  Chili stands looking over some of the old photographs as Harry goes through the mess on the desk  Chili thinks about whether or not to make a move when Harry steps in reaches over the desk and picks up a script  so does Bo Catlett for that matter  Harry nods thinks a moment  Chili can't believe it  As Karen finds herself listening despite herself meanwhile the guy's hot runs the three hundred up to half a million  Chili sits behind the desk watching the two of them come into the office as Catlett comes first  Chili tosses the script on the desk moves between a pair of fat red leather chairs as Harry moves away from the window and is tugging the string to lower the blinds behind the desk  Harry turns to him and they both look at her  Chili looks at  now it's between them  Karen looks at the two of them sitting there  Sitting down he nods to Chili who ignores him  Harry already forgetting his instructions  Ronnie looks over  The guy studies  Harry wonders if there's a way to shut him up without punching him in the mouth Harry hands a script to Chili who examines the cover the first time he's ever held a movie script and opens it to the middle  Chili starts to speak but Harry cuts him off then turns back to Chili  then Chili looks at him  Ronnie sits down in the chair and hooks one leg over the arm swings it up and down his motor running on some chemical while Harry waves them right into the two cracked red leather chairs facing the desk  he too stares at Chili and Chili shakes his head he can't believe he's hearing this  They watch Martin and the girl a moment and Harry pulls out starts driving again  Catlett looks at Chili again  There are some of Karen Harry with a much younger blonde Karen  Chili looks at Karen and she's staring at Chili again  patient  Harry points across the street to the Cafe Med where we see a red Ferrari convertible parked out the front and we see Martin Weir and a woman with jetblack hair sitting at a table  The limo guys nod to Chili and Chili nods back trying to catch Harry's eye  She just looks at him turns and walks out as Chili watches her go  We tilt up this time to reveal a little kid listening to a Walkman as Harry looks at him  Ronnie singing and the door opens as the Bear opens the door for Bo Catlett and Ronnie "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Ronnie singing and the door opens as the Bear opens the door for Bo Catlett and Ronnie  Chili sits behind the desk watching the two of them come into the office as Catlett comes first  Ronnie sits down in the chair and hooks one leg over the arm swings it up and down his motor running on some chemical while Harry waves them right into the two cracked red leather chairs facing the desk  Sitting down he nods to Chili who ignores him  Harry already forgetting his instructions  Chili can't believe it  he too stares at Chili and Chili shakes his head he can't believe he's hearing this  The limo guys nod to Chili and Chili nods back trying to catch Harry's eye  Ronnie looks over  so does Bo Catlett for that matter  Catlett looks at Chili again  now it's between them  The guy studies  Chili thinks about whether or not to make a move when Harry steps in reaches over the desk and picks up a script  Chili looks at  Harry wonders if there's a way to shut him up without punching him in the mouth As Karen finds herself listening despite herself meanwhile the guy's hot runs the three hundred up to half a million  Chili starts to speak but Harry cuts him off then turns back to Chili  Chili looks at Karen and she's staring at Chili again  patient  Karen looks at the two of them sitting there  Harry turns to him and they both look at her  She just looks at him turns and walks out as Chili watches her go  Harry nods thinks a moment  then Chili looks at him  We tilt up this time to reveal a little kid listening to a Walkman as Harry looks at him  Harry points across the street to the Cafe Med where we see a red Ferrari convertible parked out the front and we see Martin Weir and a woman with jetblack hair sitting at a table  They watch Martin and the girl a moment and Harry pulls out starts driving again  There are some of Karen Harry with a much younger blonde Karen  Chili stands looking over some of the old photographs as Harry goes through the mess on the desk  Harry hands a script to Chili who examines the cover the first time he's ever held a movie script and opens it to the middle  Chili looks out the window as we see a long black stretch limo pull up to the curb down on the street  Chili tosses the script on the desk moves between a pair of fat red leather chairs as Harry moves away from the window and is tugging the string to lower the blinds behind the desk "
        }
      ]
    }
  ]
}