{
  "ground_truth": "The camera moves in on Laurie as a teacher drones away at the front of the room, and then it moves to a close-up of her. Laurie barely listens to the teacher as she doodles in her notebook and lets her gaze move to a window where she stares dreamily outside. From the window, she can see the street and a station wagon parked along the sidewalk, with the shape of a man standing behind it. Laurie turns away from the window and begins to doodle again before springing around from the window. She sneaks a glance back to the window, but the shape and the station wagon are gone. She turns back from the window to her notebook. Meanwhile, other boys form a circle around Tommy and taunt him. A car is parked in front of a small, closed-down gas station/diner by the side of the highway. The camera slowly tracks over to a phone booth where Loomis is inside on the telephone. Annie comes out of the side doors of the high school and calls after Laurie and Lynda, and the girls stop and wait for her. Laurie suddenly stops and looks back toward the school, then glances down the street where the station wagon slowly moves up toward them, with the shape not visible behind the windshield. Laurie stares at the station wagon as it moves past, looking directly at the shape inside, catching a quick glimpse of a strange pale face staring back. The shape is close to the camera, out of focus, staring at Laurie, then tromps on the accelerator, whizzing past them. Out the window, the three girls are seen on the sidewalk and up the street, the wagon suddenly stops, sitting there waiting. For a moment, the station wagon just sits there, then it takes off down the street and disappears around a corner. The girls start walking again and eventually stop in front of Lynda's house, a modest suburban home on a quiet, tree-lined street. Lynda strolls up to her house while Annie and Laurie start down the street. Up the sidewalk is a series of bushes lining the street, and the camera moves in to a close shot of Laurie's face as she stares ahead along the sidewalk where, partially hidden in the shadows of a bush, is the shape of a man watching them, barely visible and almost blending in with the dark foliage. The shape is gone, revealing just bushes. Annie walks right over to the bushes and kicks them hard while Laurie stands on the sidewalk several feet from the bushes, then slowly walks over and stares at the bush.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "The camera shifts in on Laurie as a mentor drones away at the front of the room, and then it shifts to a close-up of her. Laurie scarcely listens to the mentor as she scribbles in her notebook and lets her gaze drift to a window where she stares dreamily outside. From the window, she can see the road and a station wagon stationed along the sidewalk, with the silhouette of a man standing behind it. Laurie turns away from the window and starts to scribble again before pivoting around from the window. She sneaks a glance back to the window, but the silhouette and the station wagon are gone. She turns back from the window to her notebook. Meanwhile, other boys form a circle around Tommy and mock him. A vehicle is stationed in front of a small, closed-down gas station/diner by the side of the roadway. The camera slowly pans over to a telephone booth where Loomis is inside on the phone. Annie emerges out of the side doors of the high school and calls after Laurie and Lynda, and the girls halt and wait for her. Laurie suddenly halts and looks back toward the school, then glances down the road where the station wagon slowly advances up toward them, with the silhouette not visible behind the windshield. Laurie stares at the station wagon as it advances past, looking directly at the silhouette inside, catching a quick glimpse of a strange pale face gazing back. The silhouette is close to the camera, out of focus, staring at Laurie, then stomps on the accelerator, zipping past them. Out the window, the three girls are seen on the sidewalk and up the road, the wagon suddenly halts, sitting there waiting. For a moment, the station wagon just sits there, then it speeds off down the road and vanishes around a corner. The girls start walking again and eventually halt in front of Lynda's abode, a modest suburban residence on a quiet, tree-lined road. Lynda strolls up to her home while Annie and Laurie start down the road. Up the sidewalk is a series of shrubs lining the road, and the camera shifts in to a close shot of Laurie's face as she stares forward along the sidewalk where, partially obscured in the shadows of a shrub, is the silhouette of a man observing them, scarcely visible and almost blending in with the dark foliage. The silhouette is gone, revealing just shrubs. Annie strides right over to the shrubs and kicks them hard while Laurie stands on the sidewalk several feet from the shrubs, then slowly walks over and stares at the shrub."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The camera is moved in on Laurie as a teacher is droned away at the front of the room, and then it is moved to a close-up of her. The teacher is barely listened to by Laurie as doodles are drawn by her in her notebook and her gaze is let move to a window where a dreamy stare is directed outside by her. From the window, the street can be seen by her and along the sidewalk, a station wagon is parked with the shape of a man standing behind it. The window is turned away from by Laurie and she begins to doodle again before she springs around from the window. A glance is sneaked back to the window by her, but the shape and the station wagon have gone. Her notebook is turned back to by her from the window. Meanwhile, a circle is formed by other boys around Tommy, and they taunt him. Someone has parked a car in front of a small, closed-down gas station/diner by the side of the highway. The camera is slowly tracked over to a phone booth where Loomis is inside on the telephone. Annie comes out of the side doors of the high school and calls after Laurie and Lynda, and they stop and wait for her. Laurie is suddenly stopped and she looks back toward the school, then she glances down the street where the station wagon is slowly moved up toward them, with the shape not visible behind the windshield. Laurie stares at the station wagon as it is moved past, looking directly at the shape inside, catching a quick glimpse of a strange pale face that stares back. The shape, close to the camera, out of focus, stares at Laurie, then the accelerator is tromped on, and it whizzes past them. Out the window, the three girls on the sidewalk and up the street are seen by the audience, the wagon suddenly is stopped, sitting there waiting. For a moment, the station wagon just sits there, then it is taken off down the street and disappears around a corner. The girls start walking again and eventually stop in front of Lynda's house, a modest suburban home on a quiet, tree-lined street. Lynda strolls up to her house while Annie and Laurie are started down the street. Up the sidewalk is a series of bushes lining the street, and Laurie’s face is moved in to a close shot by the camera as ahead along the sidewalk is stared at by her where, partially hidden in the shadows of a bush, the shape of a man watches them, barely visible and almost blending in with the dark foliage. The shape is gone, revealing just bushes. The bushes are walked right over to and kicked hard by Annie while Laurie stands on the sidewalk several feet from the bushes, then she slowly walks over and stares at the bush."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "The camera focuses on Laurie as a teacher drones on, and she doodles in her notebook, gazing dreamily out the window. She sees a street with a station wagon and a man behind it. Laurie looks away, then glances back to find them gone. Meanwhile, boys taunt Tommy. A car is parked by a closed gas station/diner, and Loomis is in a phone booth. Annie calls Laurie and Lynda outside the high school, and they wait for her. Laurie notices the station wagon approaching, glimpsing a pale face inside. The shape accelerates past them, then stops and waits before disappearing around a corner. The girls walk to Lynda's house, a modest suburban home. Laurie notices a man partially hidden in the bushes, blending with the shadows. The shape vanishes, leaving only bushes. Annie kicks the bushes while Laurie approaches and stares at them."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "The camera focuses on Laurie as a teacher drones on. Laurie doodles and gazes dreamily out the window, seeing a street and a station wagon with a man behind it. She looks away, then back, but the man and wagon are gone. Meanwhile, boys taunt Tommy. A car is parked by a closed gas station/diner. Loomis is in a phone booth. Annie calls Laurie and Lynda, who stop for her. Laurie notices the station wagon moving toward them, glimpsing a pale face inside. The wagon speeds past, then stops, waiting before disappearing. The girls walk to Lynda's house, a suburban home. Laurie sees a man partially hidden in bushes, but he vanishes. Annie kicks the bushes while Laurie watches."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "The camera gradually zooms in on Laurie, who is seated in a classroom where a teacher is monotonously lecturing at the front of the room. The focus then shifts to a close-up of Laurie herself. She is only half-listening to the teacher's droning voice as she idly doodles in her notebook. Her attention drifts, and she lets her gaze wander toward a window, where she stares dreamily outside. Through the window, she has a clear view of the street, where a station wagon is parked along the sidewalk. Behind the vehicle, the silhouette of a man is faintly visible. Laurie diverts her attention from the window and resumes her doodling, only to suddenly turn back toward the window. She sneaks another glance, but the silhouette and the station wagon have vanished. She shifts her focus back to her notebook. Meanwhile, in another part of the room, a group of boys forms a circle around Tommy, taunting him. Elsewhere, a car is parked in front of a small, closed-down gas station and diner situated by the side of the highway. The camera slowly pans over to a phone booth, where Loomis is inside, engaged in a telephone conversation. Annie emerges from the side doors of the high school and calls out to Laurie and Lynda, prompting the girls to stop and wait for her. Laurie suddenly halts and looks back toward the school, then glances down the street, where the station wagon is slowly approaching them. The silhouette is not visible behind the windshield. Laurie fixes her gaze on the station wagon as it passes by, catching a fleeting glimpse of a strange, pale face staring back at her. The silhouette is close to the camera, out of focus, intently watching Laurie, then suddenly accelerates, speeding past them. Through the window, the three girls are seen standing on the sidewalk and further up the street. The station wagon comes to an abrupt stop, sitting there as if waiting. For a brief moment, the vehicle remains stationary, then it takes off down the street, disappearing around a corner. The girls resume walking and eventually come to a stop in front of Lynda's house, a modest suburban home nestled on a quiet, tree-lined street. Lynda casually strolls up to her house while Annie and Laurie continue down the street. Along the sidewalk, a series of bushes line the street, and the camera moves in for a close-up shot of Laurie's face as she stares intently ahead along the sidewalk. There, partially obscured in the shadows of a bush, is the silhouette of a man watching them, barely visible and almost blending in with the dark foliage. The silhouette vanishes, leaving only the bushes in view. Annie walks right over to the bushes and gives them a hard kick, while Laurie stands on the sidewalk several feet away, then slowly approaches and stares at the bush."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "The video opens with a slow, deliberate zoom-in on Laurie, who is seated in a classroom. The setting is an ordinary classroom where a teacher is positioned at the front, delivering a lecture in a monotonous tone. Gradually, the camera shifts its focus to a close-up shot, centering on Laurie herself. She is only half-engaged with the teacher's droning, uninspired voice, her mind wandering as she idly doodles in her notebook. Her attention begins to drift further, and she lets her gaze wander toward a window. She stares dreamily outside, where she has a perfectly clear view of the street beyond. There, she sees a station wagon, parked neatly along the sidewalk. Just behind the vehicle, the faint silhouette of a man is barely discernible. Laurie momentarily pulls her attention away from the window, redirecting it back to her doodling in the notebook. Suddenly, something compels her to turn back toward the window. She sneaks another glance outside, but the silhouette and the station wagon have mysteriously vanished. She refocuses her gaze back down at her notebook. Meanwhile, elsewhere within the classroom, a group of boys forms a tight circle around Tommy, teasing and taunting him in an unruly manner. In another part of town, a car is parked in front of an old, small gas station and diner, which sit quietly closed by the side of the highway. The camera smoothly transitions its view, panning slowly over to a nearby phone booth. Loomis is inside the booth, absorbed in an intense telephone conversation. Annie emerges energetically from the side doors of the high school, immediately calling out to Laurie and Lynda, prompting the two girls to halt and wait patiently for her. Suddenly, Laurie stops in her tracks and looks back toward the school building, her eyes then darting down the street. There, she spots the station wagon slowly approaching them. The silhouette is not perceivable behind the vehicle's windshield. Laurie fixes her gaze on the station wagon as it glides past them, catching just a fleeting glimpse of a peculiar, pale face staring back at her. The silhouette is close to the camera, but out of focus, intently watching Laurie, and then, without warning, the vehicle accelerates swiftly, speeding past them. Through the window, the three girls are seen standing on the sidewalk, with another view further up the street. The station wagon comes to a sudden, abrupt stop, sitting there momentarily as if it is waiting for something. For a brief, tense moment, the vehicle remains motionlessly stationary before it takes off down the street, disappearing swiftly around a corner. The girls resume their walk along the sidewalk and eventually come to a stop in front of Lynda's house. The home is a modest, typical suburban one nestled peacefully on a quiet, tree-lined street. Lynda casually strolls up to her front door while Annie and Laurie continue down the street together. Along the sidewalk, a series of bushes line the path, and the camera closes in for a detailed close-up shot of Laurie's face. Her gaze is fixed intently ahead along the sidewalk. There, partially shrouded in the shadows of a bush, the silhouette of a man watches them. He is almost imperceptible, nearly blending into the dark foliage. The silhouette disappears, leaving only the bushes in view. Annie boldly walks over to the bushes and delivers a hard, firm kick, while Laurie remains on the sidewalk several feet away. She then slowly approaches, continuing to stare at the bush with a mixture of curiosity and apprehension."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "The camera smoothly glides in on Laurie as the teacher's monotonous voice fills the room, capturing her in a close-up shot. Laurie, barely paying attention to the teacher's lecture, idly doodles in her notebook, her pen moving aimlessly across the page. Her gaze drifts away from the teacher and settles on a window, where she stares dreamily outside, her mind wandering. Through the window, she observes the street below and notices a station wagon parked along the sidewalk, with the silhouette of a man standing behind it. Laurie shifts her focus away from the window, returning to her doodling, her pen resuming its aimless journey across the paper. Suddenly, she spins around from the window, curiosity piqued, and sneaks another glance back, only to find that both the silhouette and the station wagon have vanished. She turns her attention back to her notebook, resuming her doodling. Meanwhile, a group of boys forms a circle around Tommy, taunting him with jeers and laughter. Elsewhere, a car is parked in front of a small, closed-down gas station and diner by the side of the highway. The camera slowly pans over to a phone booth, where Loomis is inside, engaged in a telephone conversation. Annie emerges from the side doors of the high school, calling out to Laurie and Lynda, prompting the girls to stop and wait for her. Laurie suddenly halts, casting a glance back toward the school, then shifts her gaze down the street, where she notices the station wagon slowly approaching them, the silhouette behind the windshield obscured from view. Laurie fixes her eyes on the station wagon as it glides past, catching a fleeting glimpse of a strange, pale face staring back at her. The silhouette, now close to the camera and out of focus, stares intently at Laurie before pressing down on the accelerator, causing the vehicle to speed past them. Through the window, the three girls are visible on the sidewalk, and further up the street, the station wagon comes to an abrupt stop, idling there momentarily. After a brief pause, the station wagon accelerates down the street, disappearing around a corner. The girls resume their walk, eventually stopping in front of Lynda's house, a modest suburban home nestled on a quiet, tree-lined street. Lynda casually strolls up to her house while Annie and Laurie continue down the street. As they walk, the sidewalk is lined with a series of bushes, and the camera zooms in on Laurie's face as she stares intently ahead along the sidewalk. There, partially obscured by the shadows of a bush, is the silhouette of a man watching them, barely discernible and almost blending in with the dark foliage. In an instant, the silhouette vanishes, leaving only the bushes in view. Annie strides over to the bushes and delivers a hard kick, while Laurie stands on the sidewalk several feet away, then slowly approaches and gazes at the bush, her curiosity piqued."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "The camera focuses on Laurie as she doodles in her notebook, barely listening to the teacher, and gazes dreamily out the window at a street scene with a station wagon and a man standing behind it. She returns to her doodling, glances back to find the scene gone, and resumes her notebook. Meanwhile, boys taunt Tommy in a circle. A car is parked by a closed gas station/diner, and the camera tracks to Loomis in a phone booth. Annie calls out to Laurie and Lynda as they leave school, and they wait for her. Laurie pauses, noticing a station wagon approaching with an obscured figure inside. She catches a glimpse of a pale face as it speeds past, then stops and waits before disappearing around a corner. The girls continue to Lynda's house, where Lynda heads inside, and Annie and Laurie walk on. Laurie notices a man partially hidden in the shadows of a bush, but he vanishes, leaving only the bushes. Annie kicks the bushes while Laurie approaches and stares at them."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "The camera moves in on Laurie, a high school student in the small town of Haddonfield, Illinois, as a teacher drones away at the front of the room, a sound often associated with the monotony of a late afternoon class, and then it moves to a close-up of her. Laurie barely listens to the teacher as she doodles in her notebook, a habit common among students during long lectures, and lets her gaze move to a window where she stares dreamily outside. From the window, she can see Main Street, a typical suburban road lined with maple trees, and a station wagon parked along the sidewalk, with the shape of a man, a mysterious figure that seems out of place, standing behind it. Laurie turns away from the window and begins to doodle again, her mind drifting into her own world, before springing around from the window. She sneaks a glance back to the window, but the shape and the station wagon are gone, like a fleeting apparition. She turns back from the window to her notebook. Meanwhile, other boys form a circle around Tommy, a younger boy known for his imaginative stories, and taunt him. A car is parked in front of a small, closed-down gas station/diner, a relic from the 1950s now abandoned, by the side of the highway. The camera slowly tracks over to a phone booth, a rare sight still standing, where Loomis, a dedicated psychiatrist intent on protecting the town, is inside on the telephone. Annie comes out of the side doors of the high school, a classic mid-century building, and calls after Laurie and Lynda, and the girls stop and wait for her. Laurie suddenly stops and looks back toward the school, then glances down the street where the station wagon, now a symbol of growing unease, slowly moves up toward them, with the shape not visible behind the windshield. Laurie stares at the station wagon as it moves past, looking directly at the shape inside, catching a quick glimpse of a strange pale face, unsettling and ghostly, staring back. The shape is close to the camera, out of focus, staring at Laurie, then tromps on the accelerator, whizzing past them. Out the window, the three girls are seen on the sidewalk and up the street, the wagon suddenly stops, sitting there waiting, like a predator stalking its prey. For a moment, the station wagon just sits there, then it takes off down the street and disappears around a corner. The girls start walking again and eventually stop in front of Lynda's house, a modest suburban home known for its classic 1960s architecture, on a quiet, tree-lined street that looks idyllic yet eerily quiet. Lynda strolls up to her house while Annie and Laurie start down the street. Up the sidewalk is a series of bushes lining the street, and the camera moves in to a close shot of Laurie's face as she stares ahead along the sidewalk where, partially hidden in the shadows of a bush, is the shape of a man watching them, barely visible and almost blending in with the dark foliage. The shape is gone, revealing just bushes. Annie walks right over to the bushes and kicks them hard, as if to challenge a phantom, while Laurie stands on the sidewalk several feet from the bushes, then slowly walks over and stares at the bush, as though confronting her own fears."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "The camera moves in on Laurie as a teacher drones away at the front of the room and then it moves to a closeup of her  Laurie barely listens to the teacher as she doodles in her notebook and lets her gaze move to a window where she stares dreamily outside  From the window she can see the street and a station wagon parked along the sidewalk with the shape of a man standing behind it  Laurie suddenly stops and looks back toward the school then glances down the street where the station wagon slowly moves up toward them with the shape not visible behind the windshield  Laurie stares at the station wagon as it moves past looking directly at the shape inside catching a quick glimpse of a strange pale face staring back  The shape is close to the camera out of focus staring at Laurie then tromps on the accelerator whizzing past them  Out the window the three girls are seen on the sidewalk and up the street  the wagon suddenly stops sitting there waiting  For a moment the station wagon just sits there then it takes off down the street and disappears around a corner  The girls start walking again and eventually stop in front of Lynda's house a modest suburban home on a quiet treelined street  Lynda strolls up to her house while Annie and Laurie start down the street  Up the sidewalk is a series of bushes lining the street and the camera moves in to a close shot of Laurie's face as she stares ahead along the sidewalk where partially hidden in the shadows of a bush is the shape of a man watching them barely visible and almost blending in with the dark foliage  The shape is gone revealing just bushes  Annie walks right over to the bushes and kicks them hard while Laurie stands on the sidewalk several feet from the bushes then slowly walks over and stares at the bush Laurie turns away from the window and begins to doodle again before springing around from the window  She sneaks a glance back to the window but the shape and the station wagon are gone  She turns back from the window to her notebook  Meanwhile other boys form a circle around Tommy and taunt him  A car is parked in front of a small closeddown gas stationdiner by the side of the highway  The camera slowly tracks over to a phone booth where Loomis is inside on the telephone  Annie comes out of the side doors of the high school and calls after Laurie and Lynda and the girls stop and wait for her  Laurie suddenly stops and looks back toward the school then glances down the street where the station wagon slowly moves up toward them with the shape not visible behind the windshield  Laurie stares at the station wagon as it moves past looking directly at the shape inside catching a quick glimpse of a strange pale face staring back  The shape is close to the camera out of focus staring at Laurie then tromps on the accelerator whizzing past them  Out the window the three girls are seen on the sidewalk and up the street  the wagon suddenly stops sitting there waiting  For a moment the station wagon just sits there then it takes off down the street and disappears around a corner  The girls start walking again and eventually stop in front of Lynda's house a modest suburban home on a quiet treelined street  Lynda strolls up to her house while Annie and Laurie start down the street  Up the sidewalk is a series of bushes lining the street and the camera moves in to a close shot of Laurie's face as she stares ahead along the sidewalk where partially hidden in the shadows of a bush is the shape of a man watching them barely visible and almost blending in with the dark foliage  The shape is gone revealing just bushes  Annie walks right over to the bushes and kicks them hard while Laurie stands on the sidewalk several feet from the bushes then slowly walks over and stares at the bush"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "The camera moves in on Laurie as a teacher drones away at the front of the room and then it moves to a closeup of her. Laurie barely listens to the teacher as she doodles in her notebook and let us her gaze move to a window where she stares dreamily outside. From the window she can see the street and a station wagon parked along the sidewalk with the shape of a man standing behind it. Laurie turns away from the window and begins to doodle again before springing around from the window. She sneaks a glance back to the window but the shape and the station wagon are gone. She turns back from the window to her notebook. Meanwhile other boys form a circle around Tommy and taunt him. A car is parked in front of a small closeddown gas stationdiner by the side of the highway. The camera slowly tracks over to a phone booth where Loomis is inside on the telephone. Annie comes out of the side doors of the high school and calls after Laurie and Lynda and the girls stop and wait for her. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Laurie suddenly stops and looks back toward the school then glances down the street where the station wagon slowly moves up toward them with the shape not visible behind the windshield. Laurie stares at the station wagon as it moves past looking directly at the shape inside catching a quick glimpse of a strange pale face staring back. The shape is close to the camera out of focus staring at Laurie then tromps on the accelerator whizzing past them. Out the window the three girls are seen on the sidewalk and up the street. the wagon suddenly stops sitting there waiting. For a moment the station wagon just sits there then it takes off down the street and disappears around a corner. The girls start walking again and eventually stop in front of Lynda's house a modest suburban home on a quiet treelined street. Lynda strolls up to her house while Annie and Laurie start down the street. Up the sidewalk is a series of bushes lining the street and the camera moves in to a close shot of Laurie's face as she stares ahead along the sidewalk where partially hidden in the shadows of a bush is the shape of a man watching them barely visible and almost blending in with the dark foliage. The shape is gone revealing just bushes. Annie walks right over to the bushes and kicks them hard while Laurie stands on the sidewalk several feet from the bushes then slowly walks over and stares at the bush."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "The camera moves in on Laurie as a teacher drones away at the front of the room and then it moves to a closeup of her. Laurie barely listens to the teacher as she doodles in her notebook and let us her gaze move to a window where she stares dreamily outside. From the window she can see the street and a station wagon parked along the sidewalk with the shape of a man standing behind it. Laurie turns away from the window and begins to doodle again before springing around from the window. She sneaks a glance back to the window but the shape and the station wagon are gone. She turns back from the window to her notebook. Meanwhile other boys form a circle around Tommy and taunt him. A car is parked in front of a small closeddown gas stationdiner by the side of the highway. The camera slowly tracks over to a phone booth where Loomis is inside on the telephone. Annie comes out of the side doors of the high school and calls after Laurie and Lynda and the girls stop and wait for her. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. Laurie suddenly stops and looks back toward the school then glances down the street where the station wagon slowly moves up toward them with the shape not visible behind the windshield. Laurie stares at the station wagon as it moves past looking directly at the shape inside catching a quick glimpse of a strange pale face staring back. The shape is close to the camera out of focus staring at Laurie then tromps on the accelerator whizzing past them. Out the window the three girls are seen on the sidewalk and up the street. the wagon suddenly stops sitting there waiting. For a moment the station wagon just sits there then it takes off down the street and disappears around a corner. The girls start walking again and eventually stop in front of Lynda's house a modest suburban home on a quiet treelined street. Lynda strolls up to her house while Annie and Laurie start down the street. Up the sidewalk is a series of bushes lining the street and the camera moves in to a close shot of Laurie's face as she stares ahead along the sidewalk where partially hidden in the shadows of a bush is the shape of a man watching them barely visible and almost blending in with the dark foliage. The shape is gone revealing just bushes. Annie walks right over to the bushes and kicks them hard while Laurie stands on the sidewalk several feet from the bushes then slowly walks over and stares at the bush."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "The camera moves in on Laurie as a teacher drones away at the front of the room and then it moves to a closeup of her. Laurie barely listens to the teacher as she doodles in her notebook and let us her gaze move to a window where she stares dreamily outside. From the window she can see the street and a station wagon parked along the sidewalk with the shape of a man standing behind it. Laurie turns away from the window and begins to doodle again before springing around from the window. She sneaks a glance back to the window but the shape and the station wagon are gone. For a moment the station wagon just sits there then it takes off down the street and disappears around a corner. The girls start walking again and eventually stop in front of Lynda's house a modest suburban home on a quiet treelined street. Lynda strolls up to her house while Annie and Laurie start down the street. Up the sidewalk is a series of bushes lining the street and the camera moves in to a close shot of Laurie's face as she stares ahead along the sidewalk where partially hidden in the shadows of a bush is the shape of a man watching them barely visible and almost blending in with the dark foliage. The shape is gone revealing just bushes. Annie walks right over to the bushes and kicks them hard while Laurie stands on the sidewalk several feet from the bushes then slowly walks over and stares at the bush."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "The camera moves in on Laurie as a teacher drones away at the front of the room and then it moves to a closeup of her. Laurie barely listens to the teacher as she doodles in her notebook and let us her gaze move to a window where she stares dreamily outside. Up the sidewalk is a series of bushes lining the street and the camera moves in to a close shot of Laurie's face as she stares ahead along the sidewalk where partially hidden in the shadows of a bush is the shape of a man watching them barely visible and almost blending in with the dark foliage. The shape is gone revealing just bushes. Annie walks right over to the bushes and kicks them hard while Laurie stands on the sidewalk several feet from the bushes then slowly walks over and stares at the bush."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The camera moves in on a squirrel as a gorilla drones away at the front of the room, and then it moves to a close-up of the squirrel. The squirrel barely listens to the gorilla as it doodles in its notebook and lets its gaze move to a window where it stares dreamily outside. From the window, it can see the street and a station wagon parked along the sidewalk, with the shape of an owl standing behind it. The squirrel turns away from the window and begins to doodle again before springing around from the window. It sneaks a glance back to the window, but the shape and the station wagon are gone. The squirrel turns back from the window to its notebook. Meanwhile, other raccoons form a circle around a chipmunk and taunt it. A car is parked in front of a small, closed-down gas station/diner by the side of the highway. The camera slowly tracks over to a phone booth where a panda is inside on the telephone. A rabbit comes out of the side doors of the high school and calls after the squirrel and a fox, and the animals stop and wait for the rabbit. The squirrel suddenly stops and looks back toward the school, then glances down the street where the station wagon slowly moves up toward them, with the shape not visible behind the windshield. The squirrel stares at the station wagon as it moves past, looking directly at the shape inside, catching a quick glimpse of a strange pale face staring back. The shape is close to the camera, out of focus, staring at the squirrel, then tromps on the accelerator, whizzing past them. Out the window, the three animals are seen on the sidewalk and up the street, the wagon suddenly stops, sitting there waiting. For a moment, the station wagon just sits there, then it takes off down the street and disappears around a corner. The animals start walking again and eventually stop in front of the fox's house, a modest suburban home on a quiet, tree-lined street. The fox strolls up to its house while the rabbit and the squirrel start down the street. Up the sidewalk is a series of bushes lining the street, and the camera moves in to a close shot of the squirrel's face as it stares ahead along the sidewalk where, partially hidden in the shadows of a bush, is the shape of a rabbit watching them, barely visible and almost blending in with the dark foliage. The shape is gone, revealing just bushes. The rabbit walks right over to the bushes and kicks them hard while the squirrel stands on the sidewalk several feet from the bushes, then slowly walks over and stares at the bush."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "The camera moves in on Laurie as a professor drones away at the front of the amphitheater, and then it moves to a close-up of her. Laurie barely listens to the professor as she sketches in her sketchbook and lets her gaze move to a porthole where she stares dreamily outside. From the porthole, she can see the path and a bicycle parked along the trail, with the outline of a man standing behind it. Laurie turns away from the porthole and begins to sketch again before springing around from the porthole. She sneaks a glance back to the porthole, but the outline and the bicycle are gone. She turns back from the porthole to her sketchbook. Meanwhile, other boys form a circle around Tommy and mimic him. A scooter is parked in front of a small, closed-down bakery/diner by the side of the avenue. The camera slowly tracks over to a kiosk where Loomis is inside on the walkie-talkie. Annie comes out of the side doors of the university and calls after Laurie and Lynda, and the girls stop and wait for her. Laurie suddenly stops and looks back toward the university, then glances down the path where the bicycle slowly moves up toward them, with the outline not visible behind the visor. Laurie stares at the bicycle as it moves past, looking directly at the outline inside, catching a quick glimpse of a strange pale face staring back. The outline is close to the camera, out of focus, staring at Laurie, then tromps on the petals, whizzing past them. Out the porthole, the three girls are seen on the path and up the trail, the bicycle suddenly stops, sitting there waiting. For a moment, the bicycle just sits there, then it takes off down the path and disappears around a bend. The girls start walking again and eventually stop in front of Lynda's cabin, a modest cottage on a quiet, fern-lined trail. Lynda strolls up to her cabin while Annie and Laurie start down the path. Up the trail is a series of cacti lining the path, and the camera moves in to a close shot of Laurie's face as she stares ahead along the path where, partially hidden in the shadows of a cactus, is the outline of a man watching them, barely visible and almost blending in with the dark foliage. The outline is gone, revealing just cacti. Annie walks right over to the cacti and kicks them hard while Laurie stands on the path several feet from the cacti, then slowly walks over and stares at the cactus."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "The camera pans toward Laurie as a teacher quietly reads at the front of the room, and then it zooms to a close-up of her. Laurie barely pays attention to the teacher as she sketches in her notebook and lets her gaze drift to a window where she glances dreamily outside. From the window, she can see the street and a station wagon parked along the sidewalk, with the outline of a man standing behind it. Laurie turns away from the window and begins to sketch again before twirling around from the window. She sneaks a peek back to the window, but the outline and the station wagon are gone. She turns back from the window to her notebook. Meanwhile, other boys assemble a circle around Tommy and tease him. A car is resting in front of a small, closed-down gas station/diner by the side of the highway. The camera gradually pans over to a phone booth where Loomis is inside on the telephone. Annie emerges from the side doors of the high school and shouts after Laurie and Lynda, and the girls pause and wait for her. Laurie suddenly halts and looks back toward the school, then glances down the street where the station wagon glides up toward them, with the shape not visible behind the windshield. Laurie peers at the station wagon as it glides past, looking directly at the shape inside, catching a quick glimpse of a strange pale face gazing back. The shape is close to the camera, out of focus, observing Laurie, then presses on the accelerator, zooming past them. Out the window, the three girls are seen on the sidewalk and up the street, the wagon suddenly halts, resting there waiting. For a moment, the station wagon just rests there, then it speeds off down the street and vanishes around a corner. The girls begin strolling again and eventually pause in front of Lynda's house, a modest suburban home on a quiet, tree-lined street. Lynda wanders up to her house while Annie and Laurie start down the street. Up the sidewalk is a series of bushes lining the street, and the camera zooms in to a close-up of Laurie's face as she gazes ahead along the sidewalk where, partially hidden in the shadows of a bush, is the outline of a man observing them, barely visible and almost blending in with the dark foliage. The outline is gone, revealing just bushes. Annie strides right over to the bushes and taps them gently while Laurie stands on the sidewalk several feet from the bushes, then slowly strolls over and gazes at the bush."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "The broom moves in on a suitcase as a dolphin hums away at the top of the mountain, and then it moves to a close-up of it. The suitcase barely listens to the dolphin as it sketches in its backpack and lets its gaze move to a plow where it stares dreamily outside. From the plow, it can see the mailbox and a bicycle parked along the shoelace, with the shape of a clock standing behind it. The suitcase turns away from the plow and begins to sketch again before springing around from the plow. It sneaks a glance back to the plow, but the shape and the bicycle are gone. It turns back from the plow to its backpack. Meanwhile, other pillows form a circle around a cactus and taunt it. A hat is parked in front of a small, closed-down fire hydrant/clock by the side of the pillow. The broom slowly tracks over to a guitar case where a sandwich is inside on the xylophone. A scarf comes out of the side doors of the roller coaster and calls after a suitcase and a microphone, and the candles stop and wait for it. The suitcase suddenly stops and looks back toward the roller coaster, then glances down the mailbox where the bicycle slowly moves up toward them, with the shape not visible behind the telescope. The suitcase stares at the bicycle as it moves past, looking directly at the shape inside, catching a quick glimpse of a strange pale face staring back. The shape is close to the broom, out of focus, staring at the suitcase, then tromps on the accelerator, whizzing past them. Out the plow, the three candles are seen on the shoelace and up the mailbox, the bicycle suddenly stops, sitting there waiting. For a moment, the bicycle just sits there, then it takes off down the mailbox and disappears around a corner. The candles start walking again and eventually stop in front of a microphone's house, a modest suburban home on a quiet, tree-lined shoelace. The microphone strolls up to its house while a scarf and a suitcase start down the mailbox. Up the shoelace is a series of clouds lining the mailbox, and the broom moves in to a close shot of the suitcase's face as it stares ahead along the shoelace where, partially hidden in the shadows of a cloud, is the shape of a clock watching them, barely visible and almost blending in with the dark foliage. The shape is gone, revealing just clouds. A scarf walks right over to the clouds and kicks them hard while the suitcase stands on the shoelace several feet from the clouds, then slowly walks over and stares at the cloud."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "The microphone zooms in on Carl as a librarian chatters away at the head of the room, and then it zooms to a close-up of him. Carl scarcely heeds the librarian as he scribbles in his notebook and lets his gaze drift to a window where he gawks dreamily outside. From the window, he can see the street and a sedan parked along the sidewalk, with the outline of a woman standing beside it. Carl turns away from the window and begins to scribble again before leaping away from the window. He sneaks a peek back to the window, but the outline and the sedan are gone. He turns back from the window to his notebook. Meanwhile, other girls gather around Timmy and mock him. A bus is parked in front of a small, closed-down repair shop/diner by the side of the highway. The microphone slowly pans over to a newsstand where Martin is inside on the telephone. Nancy comes out of the side doors of the middle school and beckons after Carl and Linda, and the boys halt and wait for her. Carl abruptly halts and glances back toward the school, then peers down the street where the sedan slowly rolls up toward them, with the outline not visible through the windshield. Carl stares at the sedan as it rolls past, observing directly at the outline inside, catching a fleeting glimpse of an unfamiliar pale face staring back. The outline is near the microphone, out of focus, observing Carl, then stamps on the accelerator, zipping past them. Out the window, the three boys are observed on the sidewalk and up the street, the sedan suddenly halts, sitting there awaiting. For a moment, the sedan just sits there, then it zooms off down the street and vanishes around a bend. The boys commence walking again and eventually halt in front of Linda's home, a humble suburban abode on a tranquil, tree-lined street. Linda ambles up to his home while Nancy and Carl begin down the street. Up the sidewalk is a series of trees lining the street, and the microphone zooms in to a close shot of Carl's face as he gawks ahead along the sidewalk where, partially concealed in the shadows of a tree, is the outline of a woman watching them, scarcely visible and almost blending in with the dark foliage. The outline is gone, revealing just trees. Nancy strides right up to the trees and kicks them hard while Carl stands on the sidewalk several feet from the trees, then leisurely strides over and gawks at the tree."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "The camera drifts in on Laurie as a librarian meanders at the back of the hall, and then it transitions to a close-up of her. Laurie hardly pays attention to the librarian as she sketches in her journal and lets her eyes wander to a painting where she gazes dreamily inside. From the painting, she can see the park and a bicycle parked along the trail, with the outline of a dog sitting beside it. Laurie turns away from the painting and begins to sketch again before leaping around from the painting. She sneaks a peek back to the painting, but the outline and the bicycle have vanished. She turns back from the painting to her journal. Meanwhile, other boys gather a cluster around Tommy and mock him. A wagon is parked in front of a small, abandoned bakery by the side of the avenue. The camera gradually pans over to a mailbox where Loomis is inside writing a letter. Annie emerges out of the back doors of the gym and calls after Laurie and Lynda, and the girls halt and wait for her. Laurie abruptly stops and glances back toward the gym, then peers down the avenue where the bicycle slowly rolls up toward them, with the outline not visible behind the handlebars. Laurie gazes at the bicycle as it rolls past, looking directly at the outline inside, catching a fleeting glimpse of a peculiar pale mask staring back. The outline is close to the camera, unfocused, gazing at Laurie, then stomps on the pedals, zipping past them. Out the doorway, the three girls are seen on the trail and up the avenue, the bicycle suddenly halts, resting there waiting. For a moment, the bicycle just rests there, then it zooms off down the avenue and vanishes around a bend. The girls resume walking and eventually pause in front of Lynda's house, a cozy suburban home on a calm, tree-filled avenue. Lynda ambles up to her house while Annie and Laurie continue down the avenue. Up the trail is a line of flowers bordering the avenue, and the camera slides in to a close shot of Laurie's face as she glares ahead along the trail where, partially shrouded in the shade of a flower, is the outline of a dog observing them, barely detectable and almost blending in with the dim greenery. The outline is gone, revealing just flowers. Annie strides right over to the flowers and stomps them hard while Laurie stands on the trail several steps from the flowers, then gradually walks over and glares at the flower."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "The blender glides in on Charlie as a librarian hums loudly at the back of the garage, and then it glides to a close-up of him. Charlie barely notices the librarian as he scribbles on his clipboard and lets his attention drift to a mural where he stares lazily inside. Through the mural, he can glimpse the ocean and a bicycle resting beside the boardwalk, with the silhouette of a giraffe crouching near it. Charlie swivels away from the mural and starts to scribble again before bouncing around from the mural. He peeks a glance back to the mural, but the silhouette and the bicycle are vanished. He swivels back from the mural to his clipboard. Meanwhile, other cats form a triangle around Benny and tease him. A scooter is resting in front of a large, bustling bakery/boutique by the edge of the swamp. The blender slowly pans over to a smartwatch where Harper is outside on the megaphone. Chris emerges from the back corners of the college and calls before Charlie and Lucy, and the kids pause and listen for him. Charlie abruptly pauses and looks forward toward the college, then observes up the ocean where the bicycle briskly glides up beside them, with the silhouette not apparent behind the tarp. Charlie gazes at the bicycle as it glides past, glancing directly at the silhouette inside, catching a fleeting glimpse of a bizarre dark mask gazing outward. The silhouette is close to the blender, out of focus, gazing at Charlie, then leaps on the brake, zooming past them. Out the mural, the three kids are observed on the boardwalk and down the ocean, the bicycle abruptly pauses, resting there expecting. For a second, the bicycle just rests there, then it zooms up the ocean and vanishes around a tree. The kids begin strolling again and eventually halt in front of Lucy's apartment, a towering urban flat on a bustling, car-lined road. Lucy skips up to her apartment while Chris and Charlie begin up the ocean. Beside the boardwalk is a cluster of rocks edging the ocean, and the blender glides in to a close view of Charlie's head as he gazes forward down the boardwalk where, partially obscured in the glimmers of a stone, is the silhouette of a giraffe watching them, barely apparent and almost mesh with the bright sculptures. The silhouette is vanished, revealing just rocks. Chris skips right over to the rocks and punches them softly while Charlie waits on the boardwalk several inches from the rocks, then swiftly skips over and gazes at the stone."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "The camera focuses on Laurie, who, disinterested in her teacher, doodles in her notebook and gazes out a window. She spots a station wagon with a man's shape behind it but looks back to see both gone. Meanwhile, Tommy is taunted by boys. Loomis is seen talking in a phone booth by a closed diner. Annie calls to Laurie and Lynda outside the high school, and they leave together. Laurie notices a station wagon approaching with an unseen figure inside; she glimpses a pale face before it speeds past. The wagon pauses, then disappears around a corner. The girls continue, stopping at Lynda's home; Laurie and Annie proceed. Laurie notices a man-shaped figure in the shadows of bushes, which disappears, leaving just foliage. Annie kicks the bushes, while Laurie cautiously approaches."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Annie walks right over to the bushes and kicks them hard while Laurie stands on the sidewalk several feet from the bushes then slowly walks over and stares at the bush The shape is gone revealing just bushes  Up the sidewalk is a series of bushes lining the street and the camera moves in to a close shot of Laurie's face as she stares ahead along the sidewalk where partially hidden in the shadows of a bush is the shape of a man watching them barely visible and almost blending in with the dark foliage  Lynda strolls up to her house while Annie and Laurie start down the street  The girls start walking again and eventually stop in front of Lynda's house a modest suburban home on a quiet treelined street  For a moment the station wagon just sits there then it takes off down the street and disappears around a corner  the wagon suddenly stops sitting there waiting  Out the window the three girls are seen on the sidewalk and up the street  The shape is close to the camera out of focus staring at Laurie then tromps on the accelerator whizzing past them  Laurie stares at the station wagon as it moves past looking directly at the shape inside catching a quick glimpse of a strange pale face staring back  Laurie suddenly stops and looks back toward the school then glances down the street where the station wagon slowly moves up toward them with the shape not visible behind the windshield  Annie comes out of the side doors of the high school and calls after Laurie and Lynda and the girls stop and wait for her  The camera slowly tracks over to a phone booth where Loomis is inside on the telephone  A car is parked in front of a small closeddown gas stationdiner by the side of the highway  Meanwhile other boys form a circle around Tommy and taunt him  She turns back from the window to her notebook  She sneaks a glance back to the window but the shape and the station wagon are gone  Laurie turns away from the window and begins to doodle again before springing around from the window  From the window she can see the street and a station wagon parked along the sidewalk with the shape of a man standing behind it  Laurie barely listens to the teacher as she doodles in her notebook and lets her gaze move to a window where she stares dreamily outside  The camera moves in on Laurie as a teacher drones away at the front of the room and then it moves to a closeup of her "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "The girls start walking again and eventually stop in front of Lynda's house a modest suburban home on a quiet treelined street  The camera slowly tracks over to a phone booth where Loomis is inside on the telephone  Laurie turns away from the window and begins to doodle again before springing around from the window  Laurie stares at the station wagon as it moves past looking directly at the shape inside catching a quick glimpse of a strange pale face staring back  Laurie suddenly stops and looks back toward the school then glances down the street where the station wagon slowly moves up toward them with the shape not visible behind the windshield  For a moment the station wagon just sits there then it takes off down the street and disappears around a corner  Laurie barely listens to the teacher as she doodles in her notebook and lets her gaze move to a window where she stares dreamily outside  Up the sidewalk is a series of bushes lining the street and the camera moves in to a close shot of Laurie's face as she stares ahead along the sidewalk where partially hidden in the shadows of a bush is the shape of a man watching them barely visible and almost blending in with the dark foliage  She turns back from the window to her notebook  The shape is gone revealing just bushes  From the window she can see the street and a station wagon parked along the sidewalk with the shape of a man standing behind it  The camera moves in on Laurie as a teacher drones away at the front of the room and then it moves to a closeup of her  The shape is close to the camera out of focus staring at Laurie then tromps on the accelerator whizzing past them  She sneaks a glance back to the window but the shape and the station wagon are gone  Annie comes out of the side doors of the high school and calls after Laurie and Lynda and the girls stop and wait for her  the wagon suddenly stops sitting there waiting  A car is parked in front of a small closeddown gas stationdiner by the side of the highway  Out the window the three girls are seen on the sidewalk and up the street  Annie walks right over to the bushes and kicks them hard while Laurie stands on the sidewalk several feet from the bushes then slowly walks over and stares at the bush Meanwhile other boys form a circle around Tommy and taunt him  Lynda strolls up to her house while Annie and Laurie start down the street "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Laurie stares at the station wagon as it moves past looking directly at the shape inside catching a quick glimpse of a strange pale face staring back  The shape is close to the camera out of focus staring at Laurie then tromps on the accelerator whizzing past them  Out the window the three girls are seen on the sidewalk and up the street  the wagon suddenly stops sitting there waiting  For a moment the station wagon just sits there then it takes off down the street and disappears around a corner  The girls start walking again and eventually stop in front of Lynda's house a modest suburban home on a quiet treelined street  Lynda strolls up to her house while Annie and Laurie start down the street  Up the sidewalk is a series of bushes lining the street and the camera moves in to a close shot of Laurie's face as she stares ahead along the sidewalk where partially hidden in the shadows of a bush is the shape of a man watching them barely visible and almost blending in with the dark foliage  The shape is gone revealing just bushes  Annie walks right over to the bushes and kicks them hard while Laurie stands on the sidewalk several feet from the bushes then slowly walks over and stares at the bush The camera moves in on Laurie as a teacher drones away at the front of the room and then it moves to a closeup of her  Laurie barely listens to the teacher as she doodles in her notebook and lets her gaze move to a window where she stares dreamily outside  From the window she can see the street and a station wagon parked along the sidewalk with the shape of a man standing behind it  Laurie turns away from the window and begins to doodle again before springing around from the window  She sneaks a glance back to the window but the shape and the station wagon are gone  She turns back from the window to her notebook  Meanwhile other boys form a circle around Tommy and taunt him  A car is parked in front of a small closeddown gas stationdiner by the side of the highway  The camera slowly tracks over to a phone booth where Loomis is inside on the telephone  Annie comes out of the side doors of the high school and calls after Laurie and Lynda and the girls stop and wait for her  Laurie suddenly stops and looks back toward the school then glances down the street where the station wagon slowly moves up toward them with the shape not visible behind the windshield "
        }
      ]
    }
  ]
}