{
  "ground_truth": "The four men sit about listening to a big box radio as Wash is whittling, Everett dips his comb into a pomade jar and carefully works on his hair, Pete is digging around with a toothpick, and Delmar dreamily waves one hand in time to the music. Everett clears his throat and screws the lid back on the pomade. They are sleeping in a hayloft, with Everett wearing a hairnet over his painstakingly arranged hair, when a spotlight plays over the hayloft ceiling and a voice booms, rousing the three men. From high, we see a foreshortened lawman holding a bullhorn surrounded by armed deputies, with a tin-starred sheriff watching impassively through mirrored sunglasses, a bloodhound drooling at his side. Pete screams down from the hayport as RAT-A-TAT-A-TAT- Everett pulls Pete down when a tommy gun spits lead into the hayloft. Enraged, Pete grabs a flaming faggot and hurls it down at the deputized congregation, but it lands harmlessly in some scattered straw. The drum of one starts spinning, flames lick up the outside of the van as - chinka-chinka-chinka - bullet holes walk across the body. Yelling men scurry away as the vehicle rocks and chatters under the force of the many tommy guns now firing inside, with tires popping, hissing, and settling, doors popping open, and glass shattering. Pete, Everett, and Delmar pile in, the doors slam shut, and the boy grinds into gear with wood blocks strapped to his feet to reach the accelerator, brake, and clutch, sitting on a Sears Roebuck catalogue to give him a view over the dash. The car speeds for the far wall, sheeted in flame, and bursts through. The little Hogwallop boy walks away in long shot down the middle of the empty road, his walk unsteady with the wood blocks still strapped to his feet. He turns to face us and hollers, as Pete enters in the foreground and throws a dirt clod at the boy, which lands shy as Pete yells. We pan Pete over to the shoulder where the car is stopped, its hood propped open, with Everett and Delmar looking at the engine. Everett pushes a small tin across the counter, stunned, and then picks up the tin. On a wooded hillside, they sit at a twig fire, roasting a small creature on a spit, and Everett stalks into frame, plopping disgustedly down by the fire, grimly shaking his head as he scrapes the last of it onto his comb and starts combing his hair. Everett fishes a gold watch from his pocket and tosses it to Pete, who looks at the watch, puzzled, pops the front, and reads the inscription.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "The four males perch around hearing to a large crate wireless as Wash is carving, Everett dips his brush into a pomade container and meticulously works on his mane, Pete is foraging around with a toothpick, and Delmar dreamily waves one hand in rhythm to the melody. Everett clears his throat and screws the lid back on the pomade. They are slumbering in a hayloft, with Everett wearing a hairnet over his painstakingly arranged mane, when a spotlight plays over the hayloft ceiling and a voice booms, waking the three males. From high, we see a foreshortened lawman holding a bullhorn encircled by armed deputies, with a tin-starred sheriff observing impassively through mirrored sunglasses, a bloodhound drooling at his side. Pete shrieks down from the hayport as RAT-A-TAT-A-TAT- Everett pulls Pete down when a tommy gun spits lead into the hayloft. Enraged, Pete seizes a flaming brand and hurls it down at the deputized gathering, but it lands harmlessly in some scattered straw. The cylinder of one begins spinning, flames lick up the exterior of the van as - chinka-chinka-chinka - bullet holes walk across the body. Shouting males scurry away as the vehicle rocks and chatters under the force of the many tommy guns now firing inside, with tires popping, hissing, and settling, doors popping open, and glass shattering. Pete, Everett, and Delmar pile in, the doors slam shut, and the youth grinds into gear with wood blocks strapped to his feet to reach the accelerator, brake, and clutch, sitting on a Sears Roebuck catalogue to give him a view over the dash. The automobile speeds for the far wall, sheeted in flame, and bursts through. The little Hogwallop youth strides away in long shot down the middle of the vacant road, his walk unsteady with the wood blocks still strapped to his feet. He turns to face us and hollers, as Pete enters in the foreground and throws a dirt clod at the youth, which lands shy as Pete yells. We pan Pete over to the shoulder where the automobile is halted, its hood propped open, with Everett and Delmar gazing at the motor. Everett pushes a small tin across the counter, stunned, and then picks up the tin. On a forested hillside, they perch at a twig fire, roasting a small creature on a spit, and Everett stalks into frame, plopping disgustedly down by the fire, grimly shaking his head as he scrapes the last of it onto his brush and starts brushing his mane. Everett fishes a gold timepiece from his pocket and tosses it to Pete, who gazes at the timepiece, puzzled, pops the front, and reads the inscription."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The four men are sat about listening to a big box radio as a piece of wood is whittled by Wash, a pomade jar is dipped into by Everett who carefully works on his hair, a toothpick is being dug around with by Pete, and one hand is dreamily waved by Delmar in time to the music. A throat is cleared by Everett and the lid is screwed back on the pomade. They sleep in a hayloft, with a hairnet worn by Everett over his painstakingly arranged hair, when the hayloft ceiling is played over by a spotlight and a voice booms, rousing the three men. From high, we see that a foreshortened lawman holds a bullhorn surrounded by armed deputies, with a tin-starred sheriff watching impassively through mirrored sunglasses, a bloodhound drooling at his side. Down from the hayport, Pete screams as RAT-A-TAT-A-TAT- Pete is pulled down by Everett when a tommy gun spits lead into the hayloft. Enraged, a flaming faggot is grabbed by Pete and hurled down at the deputized congregation, but it lands harmlessly in some scattered straw. One starts spinning the drum, flames are licked up the outside of the van as - chinka-chinka-chinka - bullet holes walk across the body. Men scurry away yelling as the vehicle is rocked and chattered under the force of the many tommy guns now firing inside, with tires popping, hissing, and settling, doors popping open, and glass shattering. Pete, Everett, and Delmar pile in, the doors are slammed shut, and the boy grinds into gear with wood blocks strapped to his feet to reach the accelerator, brake, and clutch, seated on a Sears Roebuck catalogue to give him a view over the dash. The far wall is sped toward by the car, sheeted in flame, and it bursts through. The little Hogwallop boy is walked away in long shot down the middle of the empty road, his walk unsteady with the wood blocks still strapped to his feet. He turns to face us and a holler is given as Pete enters in the foreground and throws a dirt clod at the boy, which lands shy as a yell is given by Pete. We pan Pete over to the shoulder where the stopped car has its hood propped open, with Everett and Delmar looking at the engine. A small tin is pushed across the counter by Everett, stunned, and then he picks up the tin. On a wooded hillside, they are sat at a twig fire, roasting a small creature on a spit, and Everett stalks into frame, plopping disgustedly down by the fire, grimly shaking his head as it is scraped onto his comb for the last of it and his hair is started to be combed. From his pocket, a gold watch is fished by Everett and tossed to Pete, who looks at the watch, puzzled, pops the front, and reads the inscription."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "The four men listen to a big box radio: Wash whittles, Everett applies pomade to his hair, Pete uses a toothpick, and Delmar waves to the music. Everett clears his throat and closes the pomade jar. They sleep in a hayloft, Everett wearing a hairnet, when a spotlight and booming voice wake them. A lawman with a bullhorn, surrounded by armed deputies and a sheriff with a bloodhound, is seen from above. Pete screams as a tommy gun fires into the hayloft. Enraged, Pete throws a flaming stick, but it lands harmlessly. Flames engulf a van as bullets hit it. Men scatter as the vehicle rocks under gunfire, with tires popping and glass shattering. Pete, Everett, and Delmar jump in, doors slam, and the boy drives using wood blocks to reach the pedals, sitting on a Sears Roebuck catalog. The car speeds through a flaming wall. The Hogwallop boy walks unsteadily with wood blocks on his feet, turns, and hollers. Pete throws a dirt clod, missing the boy, then joins Everett and Delmar by the stopped car with its hood open. Everett pushes a tin across the counter, then picks it up. On a wooded hillside, they roast a small creature over a fire. Everett sits by the fire, shakes his head, and combs his hair. He tosses a gold watch to Pete, who reads the inscription, puzzled."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "The four men listen to a radio: Wash whittles, Everett styles his hair, Pete uses a toothpick, and Delmar waves to the music. Everett clears his throat, closes the pomade, and they sleep in a hayloft. A spotlight and voice wake them, revealing a lawman with deputies and a sheriff. Pete screams as a tommy gun fires, and Everett pulls him down. Pete throws a flaming stick, but it misses. Flames engulf a van as bullets hit it. The men jump in, and a boy drives using wood blocks and a catalog. The car bursts through a wall. The boy walks unsteadily, turns, and yells as Pete throws a dirt clod. The car stops, and Everett and Delmar check the engine. Everett pushes a tin, then picks it up. On a hillside, they roast a creature, and Everett combs his hair. He tosses a gold watch to Pete, who reads the inscription, puzzled."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "The four men are seated comfortably, each engaged in their own activities, while they listen intently to the sounds emanating from a large, vintage box radio. Wash is absorbed in the art of whittling, skillfully carving away at a piece of wood. Meanwhile, Everett is meticulously dipping his comb into a jar of pomade, carefully applying the product to his hair with great attention to detail. Pete, on the other hand, is occupied with the task of cleaning his teeth, using a toothpick to dig around. Delmar, lost in the music, dreamily waves one hand in rhythm with the tunes. Everett, after clearing his throat, screws the lid back onto the pomade jar with a sense of finality. \n\nLater, the men find themselves sleeping in a hayloft. Everett, ever concerned with his appearance, wears a hairnet to protect his meticulously styled hair. Suddenly, a spotlight sweeps across the ceiling of the hayloft, accompanied by a booming voice that jolts the three men awake. From a high vantage point, we observe a lawman, foreshortened by perspective, holding a bullhorn. He is surrounded by deputies armed to the teeth, while a sheriff, adorned with a tin star, watches the proceedings impassively through mirrored sunglasses, a drooling bloodhound loyally at his side. Pete, in a panic, screams down from the hayport just as the RAT-A-TAT-A-TAT of a tommy gun erupts, sending bullets tearing into the hayloft. Everett, quick to react, pulls Pete down to safety. \n\nIn a fit of rage, Pete grabs a flaming faggot and hurls it down at the gathered deputies, but it lands harmlessly in some scattered straw. The drum of one of the tommy guns starts spinning, and flames begin to lick up the outside of the van as the chinka-chinka-chinka of bullet holes walking across the vehicle's body fills the air. Yelling men scatter in all directions as the vehicle rocks and chatters under the relentless barrage of tommy gun fire. Tires pop, hiss, and settle, while doors fly open and glass shatters. Pete, Everett, and Delmar quickly pile into the vehicle, slamming the doors shut behind them. The young boy, with wood blocks strapped to his feet to reach the pedals, grinds the car into gear, sitting on a Sears Roebuck catalogue to see over the dashboard. The car speeds toward the far wall, now sheeted in flame, and bursts through it with a dramatic crash.\n\nIn a long shot, the little Hogwallop boy walks away down the middle of the empty road, his gait unsteady due to the wood blocks still strapped to his feet. He turns to face us and hollers, just as Pete enters the foreground and throws a dirt clod at the boy, which falls short as Pete yells. We pan over to Pete, who moves to the shoulder of the road where the car has come to a stop, its hood propped open. Everett and Delmar are peering at the engine, trying to diagnose the problem. Everett, looking stunned, pushes a small tin across the counter, then picks it up again. On a wooded hillside, the men sit around a small twig fire, roasting a small creature on a spit. Everett stalks into the frame, plopping down by the fire with a look of disgust, shaking his head grimly as he scrapes the last of the creature onto his comb and begins to comb his hair once more. Everett retrieves a gold watch from his pocket and tosses it to Pete, who examines the watch with a puzzled expression, pops open the front, and reads the inscription inside."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "The four men find themselves comfortably settled into their surroundings, each thoroughly absorbed in their individual pastimes, all the while paying close attention to the rich, resonant sounds emanating from a large, vintage box radio that sits nearby. Wash is deeply engrossed in the intricate art of whittling, deftly and skillfully carving away at a piece of wood in his hands. At the same time, Everett is meticulously involved in the careful act of dipping his comb into a jar of pomade, applying the slick product to his hair with an attentive eye for detail. Pete, on the contrary, is preoccupied with the slightly less refined task of cleaning his teeth, using a toothpick to dig around with focused intent. Meanwhile, Delmar, having lost himself entirely in the enchanting music, dreamily waves one hand, allowing it to sway in perfect rhythm with the upbeat tunes. Then, with a sense of satisfaction, Everett clears his throat, screws the lid back onto the jar of pomade, and does so with an air of finality.\n\nAs time passes, these men eventually find solace in the peaceful setting of a hayloft where they drift into a deep sleep. Everett, always concerned with maintaining the flawless condition of his appearance, goes so far as to wear a hairnet to protect his carefully styled hair even in slumber. Without warning, a powerful spotlight slices across the ceiling of the hayloft, accompanied by an ominously booming voice, which abruptly awakens the three men from their peaceful sleep. Observing from a high vantage point, one can see a lawman, whose appearance is distorted by the perspective, holding a bullhorn authoritatively. He is flanked by a group of deputies who are heavily armed, while a stern sheriff, displaying a tin star, looks on impassively through mirrored sunglasses. Beside him, a drooling bloodhound stands vigilantly. In a fit of panic, Pete lets out a scream from the hayport just as the RAT-A-TAT-A-TAT of a tommy gun fills the air, tearing viciously into the hayloft. In a swift, protective move, Everett pulls Pete down to safety.\n\nOverwhelmed with rage, Pete grabs a flaming faggot and hurls it down toward the gathered deputies, but it lands harmlessly amidst some scattered straw. One of the tommy guns’ drums begins to spin, and flames hungrily climb up the outside of the van, while the chinka-chinka-chinka sound of bullet holes tearing across the vehicle's body reverberates through the chaos. The yelling men scatter in all directions, trying to evade the relentless barrage of tommy gun fire as the vehicle rocks and chatters under the onslaught. Tires pop and hiss before settling, while doors fly open and glass shatters in a cacophony of destruction. Wasting no time, Pete, Everett, and Delmar quickly pile into the vehicle, slamming the doors shut behind them with urgency. The young boy, having strapped wood blocks to his feet to reach the pedals, grinds the vehicle into gear while sitting on a Sears Roebuck catalog to see over the dashboard. With a dramatic burst of speed, the car charges toward the flaming far wall and crashes through it with an explosive impact.\n\nIn a sweeping long shot, the little Hogwallop boy is seen walking away down the middle of the empty road. His gait is noticeably unsteady due to the wood blocks still strapped to his feet. Turning to face us, he hollers just as Pete enters the foreground, hurling a dirt clod at the boy. The clod falls short as Pete yells in frustration. We pan over to Pete, observing as he moves toward the shoulder of the road where the car has come to an abrupt stop, its hood propped open in mechanical defeat. Everett and Delmar are peering intently at the engine inside, trying to diagnose the problem causing their delay. Everett, visibly stunned by the turn of events, pushes a small tin across the counter and then promptly picks it up again. On a quiet, wooded hillside, the men sit gathered around a modest twig fire, roasting a small creature on a spit over the flickering flames. Everett enters the frame, plopping down beside the fire, his face marked by disgust, shaking his head grimly as he scrapes the last of the creature onto his comb and, with determination, begins to comb his hair once more. Reaching into his pocket, Everett retrieves a gold watch and casually tosses it to Pete, who examines the watch with a puzzled expression, popping open the front to read the inscription delicately inscribed inside."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "The four men are gathered around, intently listening to the crackling sounds emanating from a big box radio. Wash is focused on his whittling, carefully carving away at a piece of wood with precise, deliberate movements. Meanwhile, Everett dips his comb into a pomade jar, ensuring it is thoroughly coated before he meticulously works the pomade through his hair, smoothing and arranging each strand with care. Pete, on the other hand, is occupied with a toothpick, maneuvering it around his mouth as he picks at his teeth. Delmar, lost in the rhythm, dreamily waves one hand in time to the music, his fingers moving gently through the air. As the music plays on, Everett clears his throat, signaling a shift in focus, and screws the lid back onto the pomade jar with a decisive twist. Later, they find themselves sleeping in a hayloft, with Everett's hair carefully protected by a hairnet, preserving his earlier efforts. Suddenly, a spotlight sweeps across the hayloft ceiling, accompanied by a booming voice that jolts the three men awake. From a high vantage point, a foreshortened lawman is visible, holding a bullhorn and surrounded by armed deputies, while a tin-starred sheriff stands by, observing impassively through mirrored sunglasses, a drooling bloodhound at his side. Pete, startled, screams down from the hayport just as the RAT-A-TAT-A-TAT of a tommy gun erupts, spitting lead into the hayloft. In a swift motion, Everett pulls Pete down to safety. Enraged by the attack, Pete grabs a flaming faggot and hurls it down at the deputies, but it lands harmlessly in some scattered straw. The drum of one of the tommy guns starts spinning, and flames begin to lick up the outside of the van as bullet holes, marked by the sound of chinka-chinka-chinka, walk across its body. Yelling men scurry away as the vehicle rocks and chatters under the relentless force of the many tommy guns now firing inside, with tires popping, hissing, and settling, doors popping open, and glass shattering. In the chaos, Pete, Everett, and Delmar quickly pile into the vehicle, slamming the doors shut behind them. The boy, with wood blocks strapped to his feet to reach the accelerator, brake, and clutch, grinds the car into gear, sitting on a Sears Roebuck catalogue to see over the dash. The car speeds toward the far wall, engulfed in flames, and bursts through it. In a long shot, the little Hogwallop boy walks away down the middle of the empty road, his steps unsteady due to the wood blocks still strapped to his feet. He turns to face us and hollers, just as Pete enters the foreground and throws a dirt clod at the boy, which lands short as Pete yells. We follow Pete as he moves over to the shoulder where the car is stopped, its hood propped open, with Everett and Delmar peering at the engine. Everett, appearing stunned, pushes a small tin across the counter, then picks it up again. On a wooded hillside, they sit around a twig fire, roasting a small creature on a spit. Everett stalks into the frame, plopping down by the fire with a look of disgust, shaking his head grimly as he scrapes the last of the creature onto his comb and begins combing his hair. He then fishes a gold watch from his pocket and tosses it to Pete, who catches it, looks at the watch with a puzzled expression, pops the front open, and reads the inscription inside."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "The four men sit together listening to a big box radio. Wash is whittling, Everett styles his hair with pomade, Pete uses a toothpick, and Delmar waves his hand to the music. As Everett finishes with the pomade, they sleep in a hayloft, Everett's hair protected by a hairnet. A spotlight suddenly illuminates the ceiling, waking them to the sound of a booming voice. Below, a lawman with a bullhorn is surrounded by armed deputies, while a sheriff with mirrored sunglasses stands by a drooling bloodhound. Pete screams as gunfire erupts, and Everett pulls him down. Enraged, Pete throws a flaming stick at the deputies, but it lands harmlessly. Chaos ensues as bullets riddle a van, causing men to scatter. Pete, Everett, and Delmar quickly jump into the vehicle, and a boy, using wood blocks to reach the pedals, drives them through a flaming wall. The boy walks unsteadily down the road, still wearing the blocks, and turns to shout as Pete throws a dirt clod that falls short. We follow Pete to the car, where Everett and Delmar examine the engine. Everett, stunned, pushes a small tin across the counter, then picks it up. Later, on a wooded hillside, they roast a small creature over a fire. Everett sits down, frustrated, and combs his hair with the last of the pomade. He tosses a gold watch to Pete, who opens it and reads the inscription, puzzled."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "The four men sit about listening to a big box radio, a common source of entertainment in the 1930s when radios were often the centerpiece of family gatherings, as Wash is whittling, demonstrating a traditional craft that involves carving wood into intricate shapes. Everett dips his comb into a pomade jar, a popular hair styling product of the time made from wax and oil, and carefully works on his hair, Pete is digging around with a toothpick, a common practice after meals when dental hygiene was less advanced, and Delmar dreamily waves one hand in time to the music, perhaps a piece from the popular genre of swing or jazz. Everett clears his throat and screws the lid back on the pomade. They are sleeping in a hayloft, a common makeshift sleeping place for drifters and travelers during the Great Depression, with Everett wearing a hairnet over his painstakingly arranged hair, when a spotlight plays over the hayloft ceiling and a voice booms, rousing the three men. From high, we see a foreshortened lawman holding a bullhorn surrounded by armed deputies, with a tin-starred sheriff watching impassively through mirrored sunglasses, an accessory often used by law enforcement to project authority, a bloodhound drooling at his side, a breed known for its keen sense of smell, often used in tracking fugitives. Pete screams down from the hayport as RAT-A-TAT-A-TAT- Everett pulls Pete down when a tommy gun, a famous submachine gun of the era known for its use by both gangsters and law enforcement, spits lead into the hayloft. Enraged, Pete grabs a flaming faggot and hurls it down at the deputized congregation, but it lands harmlessly in some scattered straw. The drum of one starts spinning, flames lick up the outside of the van as - chinka-chinka-chinka - bullet holes walk across the body. Yelling men scurry away as the vehicle rocks and chatters under the force of the many tommy guns now firing inside, with tires popping, hissing, and settling, doors popping open, and glass shattering. Pete, Everett, and Delmar pile in, the doors slam shut, and the boy, likely too young to drive but accustomed to necessity, grinds into gear with wood blocks strapped to his feet to reach the accelerator, brake, and clutch, sitting on a Sears Roebuck catalogue, a mail-order publication that was a staple in American homes, to give him a view over the dash. The car speeds for the far wall, sheeted in flame, and bursts through. The little Hogwallop boy walks away in long shot down the middle of the empty road, his walk unsteady with the wood blocks still strapped to his feet. He turns to face us and hollers, as Pete enters in the foreground and throws a dirt clod at the boy, which lands shy as Pete yells. We pan Pete over to the shoulder where the car is stopped, its hood propped open, with Everett and Delmar looking at the engine, likely an old model prone to frequent mechanical issues. Everett pushes a small tin across the counter, stunned, and then picks up the tin. On a wooded hillside, they sit at a twig fire, roasting a small creature on a spit, an act of survival during hard times, and Everett stalks into frame, plopping disgustedly down by the fire, grimly shaking his head as he scrapes the last of it onto his comb and starts combing his hair. Everett fishes a gold watch from his pocket and tosses it to Pete, who looks at the watch, puzzled, pops the front, and reads the inscription, possibly revealing a sentimental or significant message."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "The four men sit about listening to a big box radio as Wash is whittling  Everett dips his comb into a pomade jar and carefully works on his hair  Pete is digging around with a toothpick and Delmar dreamily waves one hand in time to the music  flames lick up the outside of the van as  chinkachinkachinka  bullet holes walk across the body  Yelling men scurry away as the vehicle rocks and chatters under the force of the many tommy guns now firing inside with tires popping hissing and settling doors popping open and glass shattering Pete  Everett and Delmar pile in the doors slam shut and the boy grinds into gear with wood blocks strapped to his feet to reach the accelerator brake and clutch sitting on a Sears Roebuck catalogue to give him a view over the dash  The car speeds for the far wall sheeted in flame and bursts through  The little Hogwallop boy walks away in long shot down the middle of the empty road his walk unsteady with the wood blocks still strapped to his feet  He turns to face us and hollers as Pete enters in the foreground and throws a dirt clod at the boy which lands shy as Pete yells  We pan Pete over to the shoulder where the car is stopped its hood propped open with Everett and Delmar looking at the engine  Everett pushes a small tin across the counter stunned and then picks up the tin  On a wooded hillside they sit at a twig fire roasting a small creature on a spit and Everett stalks into frame plopping disgustedly down by the fire grimly shaking his head as he scrapes the last of it onto his comb and starts combing his hair  Everett fishes a gold watch from his pocket and tosses it to Pete who looks at the watch puzzled pops the front and reads the inscription Everett clears his throat and screws the lid back on the pomade  They are sleeping in a hayloft with Everett wearing a hairnet over his painstakingly arranged hair when a spotlight plays over the hayloft ceiling and a voice booms rousing the three men  From high we see a foreshortened lawman holding a bullhorn surrounded by armed deputies with a tinstarred sheriff watching impassively through mirrored sunglasses a bloodhound drooling at his side  Pete screams down from the hayport as RATATATATAT  Everett pulls Pete down when a tommy gun spits lead into the hayloft  Enraged Pete grabs a flaming faggot and hurls it down at the deputized congregation but it lands harmlessly in some scattered straw  The drum of one starts spinning  flames lick up the outside of the van as  chinkachinkachinka  bullet holes walk across the body  Yelling men scurry away as the vehicle rocks and chatters under the force of the many tommy guns now firing inside with tires popping hissing and settling doors popping open and glass shattering Pete  Everett and Delmar pile in the doors slam shut and the boy grinds into gear with wood blocks strapped to his feet to reach the accelerator brake and clutch sitting on a Sears Roebuck catalogue to give him a view over the dash  The car speeds for the far wall sheeted in flame and bursts through  The little Hogwallop boy walks away in long shot down the middle of the empty road his walk unsteady with the wood blocks still strapped to his feet  He turns to face us and hollers as Pete enters in the foreground and throws a dirt clod at the boy which lands shy as Pete yells  We pan Pete over to the shoulder where the car is stopped its hood propped open with Everett and Delmar looking at the engine  Everett pushes a small tin across the counter stunned and then picks up the tin  On a wooded hillside they sit at a twig fire roasting a small creature on a spit and Everett stalks into frame plopping disgustedly down by the fire grimly shaking his head as he scrapes the last of it onto his comb and starts combing his hair  Everett fishes a gold watch from his pocket and tosses it to Pete who looks at the watch puzzled pops the front and reads the inscription"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "The four men sit about listening to a big box radio as Wash is whittling. Everett dips his comb into a pomade jar and carefully works on his hair. Pete is digging around with a toothpick and Delmar dreamily waves one hand in time to the music. Everett clears his throat and screws the lid back on the pomade. They are sleeping in a hayloft with Everett wearing a hairnet over his painstakingly arranged hair when a spotlight plays over the hayloft ceiling and a voice booms rousing the three men. From high we see a foreshortened lawman holding a bullhorn surrounded by armed deputies with a tinstarred sheriff watching impassively through mirrored sunglasses a bloodhound drooling at his side. Pete screams down from the hayport as RATATATATAT. Everett pulls Pete down when a tommy gun spits lead into the hayloft. Enraged Pete grabs a flaming faggot and hurls it down at the deputized congregation but it lands harmlessly in some scattered straw. The drum of one starts spinning. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. flames lick up the outside of the van as  chinkachinkachinka  bullet holes walk across the body. Yelling men scurry away as the vehicle rocks and chatters under the force of the many tommy guns now firing inside with tires popping hissing and settling doors popping open and glass shattering Pete. Everett and Delmar pile in the doors slam shut and the boy grinds into gear with wood blocks strapped to his feet to reach the accelerator brake and clutch sitting on a Sears Roebuck catalogue to give him a view over the dash. The car speeds for the far wall sheeted in flame and bursts through. The little Hogwallop boy walks away in long shot down the middle of the empty road his walk unsteady with the wood blocks still strapped to his feet. He turns to face us and hollers as Pete enters in the foreground and throws a dirt clod at the boy which lands shy as Pete yells. We pan Pete over to the shoulder where the car is stopped its hood propped open with Everett and Delmar looking at the engine. Everett pushes a small tin across the counter stunned and then picks up the tin. On a wooded hillside they sit at a twig fire roasting a small creature on a spit and Everett stalks into frame plopping disgustedly down by the fire grimly shaking his head as he scrapes the last of it onto his comb and starts combing his hair. Everett fishes a gold watch from his pocket and tosses it to Pete who looks at the watch puzzled pops the front and reads the inscription."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "The four men sit about listening to a big box radio as Wash is whittling. Everett dips his comb into a pomade jar and carefully works on his hair. Pete is digging around with a toothpick and Delmar dreamily waves one hand in time to the music. Everett clears his throat and screws the lid back on the pomade. They are sleeping in a hayloft with Everett wearing a hairnet over his painstakingly arranged hair when a spotlight plays over the hayloft ceiling and a voice booms rousing the three men. From high we see a foreshortened lawman holding a bullhorn surrounded by armed deputies with a tinstarred sheriff watching impassively through mirrored sunglasses a bloodhound drooling at his side. Pete screams down from the hayport as RATATATATAT. Everett pulls Pete down when a tommy gun spits lead into the hayloft. Enraged Pete grabs a flaming faggot and hurls it down at the deputized congregation but it lands harmlessly in some scattered straw. The drum of one starts spinning. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. flames lick up the outside of the van as  chinkachinkachinka  bullet holes walk across the body. Yelling men scurry away as the vehicle rocks and chatters under the force of the many tommy guns now firing inside with tires popping hissing and settling doors popping open and glass shattering Pete. Everett and Delmar pile in the doors slam shut and the boy grinds into gear with wood blocks strapped to his feet to reach the accelerator brake and clutch sitting on a Sears Roebuck catalogue to give him a view over the dash. The car speeds for the far wall sheeted in flame and bursts through. The little Hogwallop boy walks away in long shot down the middle of the empty road his walk unsteady with the wood blocks still strapped to his feet. He turns to face us and hollers as Pete enters in the foreground and throws a dirt clod at the boy which lands shy as Pete yells. We pan Pete over to the shoulder where the car is stopped its hood propped open with Everett and Delmar looking at the engine. Everett pushes a small tin across the counter stunned and then picks up the tin. On a wooded hillside they sit at a twig fire roasting a small creature on a spit and Everett stalks into frame plopping disgustedly down by the fire grimly shaking his head as he scrapes the last of it onto his comb and starts combing his hair. Everett fishes a gold watch from his pocket and tosses it to Pete who looks at the watch puzzled pops the front and reads the inscription."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "The four men sit about listening to a big box radio as Wash is whittling. Everett dips his comb into a pomade jar and carefully works on his hair. Pete is digging around with a toothpick and Delmar dreamily waves one hand in time to the music. Everett clears his throat and screws the lid back on the pomade. They are sleeping in a hayloft with Everett wearing a hairnet over his painstakingly arranged hair when a spotlight plays over the hayloft ceiling and a voice booms rousing the three men. He turns to face us and hollers as Pete enters in the foreground and throws a dirt clod at the boy which lands shy as Pete yells. We pan Pete over to the shoulder where the car is stopped its hood propped open with Everett and Delmar looking at the engine. Everett pushes a small tin across the counter stunned and then picks up the tin. On a wooded hillside they sit at a twig fire roasting a small creature on a spit and Everett stalks into frame plopping disgustedly down by the fire grimly shaking his head as he scrapes the last of it onto his comb and starts combing his hair. Everett fishes a gold watch from his pocket and tosses it to Pete who looks at the watch puzzled pops the front and reads the inscription."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "The four men sit about listening to a big box radio as Wash is whittling. Everett dips his comb into a pomade jar and carefully works on his hair. On a wooded hillside they sit at a twig fire roasting a small creature on a spit and Everett stalks into frame plopping disgustedly down by the fire grimly shaking his head as he scrapes the last of it onto his comb and starts combing his hair. Everett fishes a gold watch from his pocket and tosses it to Pete who looks at the watch puzzled pops the front and reads the inscription."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The four squirrels sit about listening to a big box radio as the rabbit is whittling, the elephant dips his comb into a pomade jar and carefully works on his hair, the giraffe is digging around with a toothpick, and the penguin dreamily waves one hand in time to the music. The elephant clears his throat and screws the lid back on the pomade. They are sleeping in a hayloft, with the elephant wearing a hairnet over his painstakingly arranged hair, when a spotlight plays over the hayloft ceiling and a voice booms, rousing the three kangaroos. From high, we see a foreshortened turtle holding a bullhorn surrounded by armed mice, with a tin-starred koala watching impassively through mirrored sunglasses, a bloodhound drooling at his side. The giraffe screams down from the hayport as RAT-A-TAT-A-TAT- the elephant pulls the giraffe down when a tommy gun spits lead into the hayloft. Enraged, the giraffe grabs a flaming faggot and hurls it down at the deputized congregation, but it lands harmlessly in some scattered straw. The drum of one starts spinning, flames lick up the outside of the van as - chinka-chinka-chinka - bullet holes walk across the body. Yelling pigeons scurry away as the vehicle rocks and chatters under the force of the many tommy guns now firing inside, with tires popping, hissing, and settling, doors popping open, and glass shattering. The giraffe, the elephant, and the penguin pile in, the doors slam shut, and the puppy grinds into gear with wood blocks strapped to his feet to reach the accelerator, brake, and clutch, sitting on a Sears Roebuck catalogue to give him a view over the dash. The car speeds for the far wall, sheeted in flame, and bursts through. The little Hogwallop kitten walks away in long shot down the middle of the empty road, his walk unsteady with the wood blocks still strapped to his feet. He turns to face us and hollers, as the giraffe enters in the foreground and throws a dirt clod at the kitten, which lands shy as the giraffe yells. We pan the giraffe over to the shoulder where the car is stopped, its hood propped open, with the elephant and the penguin looking at the engine. The elephant pushes a small tin across the counter, stunned, and then picks up the tin. On a wooded hillside, they sit at a twig fire, roasting a small creature on a spit, and the elephant stalks into frame, plopping disgustedly down by the fire, grimly shaking his head as he scrapes the last of it onto his comb and starts combing his hair. The elephant fishes a gold watch from his pocket and tosses it to the giraffe, who looks at the watch, puzzled, pops the front, and reads the inscription."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "The four men sit about listening to a gramophone as Wash is knitting, Everett dips his comb into a candle jar and carefully works on his hair, Pete is poking around with a fork, and Delmar dreamily waves one hand in time to the music. Everett clears his throat and closes the lid on the candle. They are sleeping in a treehouse, with Everett wearing a shower cap over his painstakingly arranged hair, when a flashlight beams over the treehouse ceiling and a voice booms, rousing the three men. From high, we see a foreshortened lawman holding a megaphone surrounded by armed deputies, with a sheriff wearing a plastic badge watching impassively through mirrored glasses, a dachshund drooling at his side. Pete screams down from the treeport as RAT-A-TAT-A-TAT- Everett pulls Pete down when a paintball gun splatters the treehouse. Enraged, Pete grabs a flaming marshmallow and hurls it down at the deputized congregation, but it lands harmlessly in some scattered leaves. The drum of one starts spinning, flames lick up the outside of the truck as - chinka-chinka-chinka - paintballs splatter across the body. Yelling men scurry away as the vehicle rocks and chatters under the force of the many paintball guns now firing inside, with tires popping, hissing, and settling, doors popping open, and glass shattering. Pete, Everett, and Delmar pile in, the doors slam shut, and the boy grinds into gear with phone books strapped to his feet to reach the accelerator, brake, and clutch, sitting on a stack of magazines to give him a view over the dash. The bus speeds for the far fence, covered in flame, and bursts through. The little Hogwallop boy walks away in long shot down the middle of the empty road, his walk unsteady with the phone books still strapped to his feet. He turns to face us and hollers, as Pete enters in the foreground and throws a stone at the boy, which lands shy as Pete yells. We pan Pete over to the shoulder where the bus is stopped, its hood propped open, with Everett and Delmar looking at the engine. Everett pushes a small pouch across the counter, stunned, and then picks up the pouch. On a grassy hillside, they sit at a twig fire, roasting a small vegetable on a spit, and Everett stalks into frame, plopping disgustedly down by the fire, grimly shaking his head as he scrapes the last of it onto his comb and starts combing his hair. Everett fishes a silver compass from his pocket and tosses it to Pete, who looks at the compass, puzzled, pops it open, and reads the inscription."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "The four men lounge around eyeing a big box radio as Wash is doodling, Everett flicks his comb into a pomade jar and casually spins it in the air, Pete is twiddling around with a toothpick, and Delmar dreamily spins one hand in rhythm with the music. Everett coughs loudly and tosses the lid away from the pomade. They are lounging in a hayloft, with Everett sporting a hairnet over his meticulously arranged hair, when a flashlight dances over the hayloft ceiling and a voice echoes, startling the three men. From high, we see a distorted lawman clutching a bullhorn surrounded by armed deputies, with a tin-starred sheriff observing indifferently through mirrored sunglasses, a bloodhound dozing at his side. Pete cackles down from the hayport as RAT-A-TAT-A-TAT- Everett hoists Pete down when a tommy gun tosses lead into the hayloft. Furious, Pete snatches a flaming faggot and tosses it down at the deputized congregation, but it lands softly in some scattered straw. The drum of one stops spinning, flames slither up the outside of the van as - chinka-chinka-chinka - bullet holes dance across the body. Shouting men tumble away as the vehicle sways and chatters under the force of the many tommy guns now singing inside, with tires popping, whispering, and ascending, doors popping ajar, and glass sparkling. Pete, Everett, and Delmar tumble in, the doors snap shut, and the boy hums into gear with wood blocks tied to his feet to reach the accelerator, brake, and clutch, lounging on a Sears Roebuck catalogue to give him a glance over the dash. The car drifts for the distant wall, cloaked in flame, and slips through. The little Hogwallop boy meanders away in long shot down the center of the empty road, his walk wobbly with the wood blocks still tied to his feet. He rotates to face us and mutters, as Pete steps into the foreground and hurls a dirt clod at the boy, which lands short as Pete grumbles. We glide Pete over to the shoulder where the car is paused, its hood lifted open, with Everett and Delmar inspecting the engine. Everett slides a small tin across the counter, puzzled, and then snatches up the tin. On a wooded hillside, they lounge at a twig fire, roasting a small creature on a spit, and Everett strides into frame, plopping cheerfully beside the fire, grimly chuckling as he smears the last of it onto his comb and begins styling his hair. Everett extracts a gold watch from his pocket and flips it to Pete, who glances at the watch, amused, flips the front, and giggles at the inscription."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "The four envelopes sit about listening to a large chair radio as a pencil is whittling, a suitcase dips its comb into a necklace jar and carefully works on its hair, a shoe is digging around with a toothpick, and a scarf dreamily waves one hand in time to the music. A suitcase clears its throat and screws the lid back on the necklace. They are sleeping in a car, with a suitcase wearing a hairnet over its painstakingly arranged hair, when a flashlight plays over the car ceiling and a balloon booms, rousing the three envelopes. From high, we see a foreshortened tree holding a trumpet surrounded by armed bicycles, with a tin-starred sofa watching impassively through mirrored sunglasses, a squirrel drooling at its side. A shoe screams down from the computer as RAT-A-TAT-A-TAT- a suitcase pulls a shoe down when a hammer spits lead into the car. Enraged, a shoe grabs a flaming spatula and hurls it down at the deputized congregation, but it lands harmlessly in some scattered paper. The drum of one starts spinning, flames lick up the outside of the refrigerator as - chinka-chinka-chinka - bullet holes walk across the body. Yelling socks scurry away as the chair rocks and chatters under the force of the many hammers now firing inside, with doors popping, hissing, and settling, doors popping open, and glass shattering. A shoe, a suitcase, and a scarf pile in, the doors slam shut, and the mountain grinds into gear with wood blocks strapped to its feet to reach the accelerator, brake, and clutch, sitting on a museum catalogue to give it a view over the dash. The chair speeds for the far wall, sheeted in flame, and bursts through. The little plant boy walks away in long shot down the middle of the empty phone, its walk unsteady with the wood blocks still strapped to its feet. It turns to face us and hollers, as a shoe enters in the foreground and throws a dirt clod at the boy, which lands shy as a shoe yells. We pan a shoe over to the laptop where the chair is stopped, its hood propped open, with a suitcase and a scarf looking at the engine. A suitcase pushes a small tin across the counter, stunned, and then picks up the tin. On a wooded hillside, they sit at a twig fire, roasting a small balloon on a spit, and a suitcase stalks into frame, plopping disgustedly down by the fire, grimly shaking its head as it scrapes the last of it onto its comb and starts combing its hair. A suitcase fishes a gold book from its pocket and tosses it to a shoe, who looks at the book, puzzled, pops the front, and reads the inscription."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "The four squirrels hover about observing a large wooden radio as Lily is doodling, Marvin dips his spoon into a jam jar and meticulously polishes his spectacles, Greg is bouncing around with a toothbrush, and Nigel dreamily shakes one foot in time to the rhythm. Marvin hums quietly and replaces the lid on the jam. They are lounging in a hammock, with Marvin wearing earmuffs over his diligently polished spectacles, when a searchlight dances over the hammock's canopy and a sound echoes, waking the three squirrels. From above, we see a foreshortened drummer holding a megaphone surrounded by dancing assistants, with a badge-wearing conductor watching silently through mirrored goggles, a poodle drooling by his side. Greg whispers down from the treetop as RAT-A-TAT-A-TAT - Marvin pulls Greg sideways when a slingshot hurls pebbles into the hammock. Infuriated, Greg seizes a floating leaf and flings it down at the attending ensemble, but it lands softly on a patch of grass. The cymbal starts spinning, water rises up the sides of the fountain as - chinka-chinka-chinka - raindrops splash across the surface. Singing birds flutter away as the carousel spins and hums under the influence of the many slingshots now rocketing through, with balloons popping, whistling, and settling, doors swinging open, and screens cracking. Greg, Marvin, and Nigel scramble in, the doors latch tightly, and the child maneuvers the gears with little steps strapped to her shoes to reach the pedals, sitting on a magazine to give her a view above the wheel. The cart veers towards the distant gate, wreathed in mist, and breaks through. The tiny Finch kid skips away in long shot down the center of the deserted path, her gait wobbly with the little steps still strapped to her shoes. She spins to face us and shouts, as Greg enters in the foreground and tosses a pebble at the kid, which lands short as Greg shouts. We tilt Greg over to the side where the cart is halted, its trunk elevated, with Marvin and Nigel inspecting the chassis. Marvin slides a tiny box across the counter, surprised, and then picks up the box. On a grassy slope, they rest at a stone circle, heating a tiny morsel on a skewer, and Marvin storms into view, plopping wearily down by the circle, solemnly nodding as he mixes the last of it onto his spoon and starts polishing his spectacles. Marvin retrieves a silver locket from his pouch and hands it to Greg, who examines the locket, baffled, clicks the front, and deciphers the engraving."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "The four men lounge around absorbing tunes from a large crate phonograph as Wash is painting, Everett dips his spoon into a jelly jar and gently smooths it on his brow, Pete is poking around with a straw, and Delmar dreamily flutters one foot in sync with the rhythm. Everett hums softly and snaps the lid back on the jelly. They are resting in a treehouse, with Everett wearing earmuffs over his carefully arranged brow, when a lantern flickers over the treehouse ceiling and a whistle echoes, waking the three men. From high, we see a foreshortened marshal holding a megaphone surrounded by uniformed deputies, with a tin-badged sheriff observing nonchalantly through tinted goggles, a beagle panting at his side. Pete shouts down from the treetop as RAT-A-TAT-A-TAT- Everett drags Pete back when a water gun sprays mist into the treehouse. Infuriated, Pete grabs a smoky torch and lobs it down at the deputized gathering, but it lands safely in some scattered leaves. The drum of one starts twirling, sparks flicker up the outside of the cart as - chinka-chinka-chinka - pebble marks trace across the surface. Screaming men dart away as the buggy sways and rattles under the force of the many water guns now dousing it inside, with balloons popping, fizzling, and deflating, doors flapping, and panes tinkling. Pete, Everett, and Delmar clamber in, the doors bang shut, and the boy rolls into motion with cardboard boxes strapped to his feet to reach the throttle, brake, and clutch, sitting on a phone book to give him a view over the dash. The buggy hurtles toward the far fence, draped in smoke, and crashes through. The little Hogwallop boy strolls away in long shot down the middle of the bare path, his gait wobbly with the cardboard boxes still strapped to his feet. He turns to face us and bellows, as Pete enters in the foreground and flings a rock at the boy, which falls short as Pete shouts. We track Pete over to the verge where the buggy is halted, its hood raised, with Everett and Delmar peering at the motor. Everett slides a small pouch across the counter, bewildered, and then lifts the pouch. On a leafy hillside, they sit at a twig blaze, grilling a tiny critter on a skewer, and Everett prowls into view, plopping wearily down by the blaze, solemnly shaking his head as he scrapes the last of it onto his spoon and starts smoothing his brow. Everett retrieves a silver compass from his pocket and tosses it to Pete, who examines the compass, baffled, flips the lid, and examines the inscription."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "The group of robots hover around absorbing melodies from a neon jukebox as Gizmo is knitting, Baxter dunks his spoon into a butter dish and meticulously sculpts on his sculpture, Jasper is tinkering around with a screwdriver, and Dexter dreamily flutters one tentacle in sync to the sounds. Baxter yawns and fastens the cap back on the butter. They are hibernating in a treehouse, with Baxter wearing a kerchief over his elaborately styled sculpture, when a beacon dances over the treehouse roof and an echo bellows, stirring the trio of robots. From afar, we glimpse a foreshortened zookeeper clutching a megaphone surrounded by vigilant guards, with a badge-toting ranger observing impassively through tinted spectacles, a basset hound drooling at her side. Jasper screeches down from the trapdoor as POW-POW-POW-Baxter drags Jasper down when a slingshot shoots pebbles into the treehouse. Infuriated, Jasper snatches a blazing torch and flings it down at the deputized throng, but it lands harmlessly in some scattered leaves. The turntable of one begins spinning, embers lap up the exterior of the wagon as - clack-clack-clack - pebble marks march across the surface. Shouting women dart away as the contraption sways and chatters under the influence of the various slingshots now pelting inside, with balloons popping, hissing, and deflating, doors clicking open, and mirrors cracking. Jasper, Baxter, and Dexter clamber in, the doors slam shut, and the kitten shifts into motion with foam paddles strapped to its paws to reach the throttle, brake, and clutch, perched on a furniture catalogue to provide it a perspective over the dash. The hovercraft zooms for the towering hedge, cloaked in sparks, and bursts through. The tiny Whiskerwhirl dog trots away in wide shot down the center of the vacant thoroughfare, its trot shaky with the foam paddles still fastened to its paws. It pivots to gaze at us and barks, as Jasper enters in the forefront and flings a snowball at the kitten, which lands short as Jasper shouts. We pan Jasper over to the curb where the hovercraft is stationed, its bonnet held ajar, with Baxter and Dexter inspecting the machinery. Baxter nudges a small silver token across the counter, bewildered, and then snatches up the token. On a forested slope, they perch by a matchstick blaze, roasting a tiny object on a skewer, and Baxter marches into view, slumping disgruntledly beside the blaze, solemnly shaking his head as he sprinkles the remainder of the token onto his spoon and resumes sculpting his sculpture. Baxter extracts a brass compass from his satchel and flips it to Jasper, who observes the compass, perplexed, opens the face, and deciphers the engraving."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Four men, Wash, Everett, Pete, and Delmar, relax while listening to the radio in a hayloft. Everett, meticulous about his appearance, uses pomade on his hair while Pete uses a toothpick. Their peace is shattered when a lawman and deputies surround them, firing tommy guns. In the chaos, Pete hurls a flaming stick at the deputies, igniting a van. The men escape in a car driven by a young boy using wood blocks to reach the pedals. The boy walks away unsteadily with blocks still on his feet as Pete throws a dirt clod, missing him. Later, the car stops, and Everett examines the engine with Delmar. As they rest by a fire, roasting a small creature, Everett combs his hair again, revealing his vanity. He tosses a gold watch to Pete, who examines it curiously, highlighting their camaraderie amidst adversity."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Everett fishes a gold watch from his pocket and tosses it to Pete who looks at the watch puzzled pops the front and reads the inscription On a wooded hillside they sit at a twig fire roasting a small creature on a spit and Everett stalks into frame plopping disgustedly down by the fire grimly shaking his head as he scrapes the last of it onto his comb and starts combing his hair  Everett pushes a small tin across the counter stunned and then picks up the tin  We pan Pete over to the shoulder where the car is stopped its hood propped open with Everett and Delmar looking at the engine  He turns to face us and hollers as Pete enters in the foreground and throws a dirt clod at the boy which lands shy as Pete yells  The little Hogwallop boy walks away in long shot down the middle of the empty road his walk unsteady with the wood blocks still strapped to his feet  The car speeds for the far wall sheeted in flame and bursts through  Everett and Delmar pile in the doors slam shut and the boy grinds into gear with wood blocks strapped to his feet to reach the accelerator brake and clutch sitting on a Sears Roebuck catalogue to give him a view over the dash  Yelling men scurry away as the vehicle rocks and chatters under the force of the many tommy guns now firing inside with tires popping hissing and settling doors popping open and glass shattering Pete  flames lick up the outside of the van as  chinkachinkachinka  bullet holes walk across the body  The drum of one starts spinning  Enraged Pete grabs a flaming faggot and hurls it down at the deputized congregation but it lands harmlessly in some scattered straw  Everett pulls Pete down when a tommy gun spits lead into the hayloft  Pete screams down from the hayport as RATATATATAT  From high we see a foreshortened lawman holding a bullhorn surrounded by armed deputies with a tinstarred sheriff watching impassively through mirrored sunglasses a bloodhound drooling at his side  They are sleeping in a hayloft with Everett wearing a hairnet over his painstakingly arranged hair when a spotlight plays over the hayloft ceiling and a voice booms rousing the three men  Everett clears his throat and screws the lid back on the pomade  Pete is digging around with a toothpick and Delmar dreamily waves one hand in time to the music  Everett dips his comb into a pomade jar and carefully works on his hair  The four men sit about listening to a big box radio as Wash is whittling "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "The little Hogwallop boy walks away in long shot down the middle of the empty road his walk unsteady with the wood blocks still strapped to his feet  Enraged Pete grabs a flaming faggot and hurls it down at the deputized congregation but it lands harmlessly in some scattered straw  Everett clears his throat and screws the lid back on the pomade  Yelling men scurry away as the vehicle rocks and chatters under the force of the many tommy guns now firing inside with tires popping hissing and settling doors popping open and glass shattering Pete  flames lick up the outside of the van as  chinkachinkachinka  bullet holes walk across the body  We pan Pete over to the shoulder where the car is stopped its hood propped open with Everett and Delmar looking at the engine  Everett dips his comb into a pomade jar and carefully works on his hair  Everett and Delmar pile in the doors slam shut and the boy grinds into gear with wood blocks strapped to his feet to reach the accelerator brake and clutch sitting on a Sears Roebuck catalogue to give him a view over the dash  From high we see a foreshortened lawman holding a bullhorn surrounded by armed deputies with a tinstarred sheriff watching impassively through mirrored sunglasses a bloodhound drooling at his side  On a wooded hillside they sit at a twig fire roasting a small creature on a spit and Everett stalks into frame plopping disgustedly down by the fire grimly shaking his head as he scrapes the last of it onto his comb and starts combing his hair  Pete is digging around with a toothpick and Delmar dreamily waves one hand in time to the music  Everett fishes a gold watch from his pocket and tosses it to Pete who looks at the watch puzzled pops the front and reads the inscription They are sleeping in a hayloft with Everett wearing a hairnet over his painstakingly arranged hair when a spotlight plays over the hayloft ceiling and a voice booms rousing the three men  The drum of one starts spinning  He turns to face us and hollers as Pete enters in the foreground and throws a dirt clod at the boy which lands shy as Pete yells  Everett pulls Pete down when a tommy gun spits lead into the hayloft  The car speeds for the far wall sheeted in flame and bursts through  Pete screams down from the hayport as RATATATATAT  Everett pushes a small tin across the counter stunned and then picks up the tin  The four men sit about listening to a big box radio as Wash is whittling "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "flames lick up the outside of the van as  chinkachinkachinka  bullet holes walk across the body  Yelling men scurry away as the vehicle rocks and chatters under the force of the many tommy guns now firing inside with tires popping hissing and settling doors popping open and glass shattering Pete  Everett and Delmar pile in the doors slam shut and the boy grinds into gear with wood blocks strapped to his feet to reach the accelerator brake and clutch sitting on a Sears Roebuck catalogue to give him a view over the dash  The car speeds for the far wall sheeted in flame and bursts through  The little Hogwallop boy walks away in long shot down the middle of the empty road his walk unsteady with the wood blocks still strapped to his feet  He turns to face us and hollers as Pete enters in the foreground and throws a dirt clod at the boy which lands shy as Pete yells  We pan Pete over to the shoulder where the car is stopped its hood propped open with Everett and Delmar looking at the engine  Everett pushes a small tin across the counter stunned and then picks up the tin  On a wooded hillside they sit at a twig fire roasting a small creature on a spit and Everett stalks into frame plopping disgustedly down by the fire grimly shaking his head as he scrapes the last of it onto his comb and starts combing his hair  Everett fishes a gold watch from his pocket and tosses it to Pete who looks at the watch puzzled pops the front and reads the inscription The four men sit about listening to a big box radio as Wash is whittling  Everett dips his comb into a pomade jar and carefully works on his hair  Pete is digging around with a toothpick and Delmar dreamily waves one hand in time to the music  Everett clears his throat and screws the lid back on the pomade  They are sleeping in a hayloft with Everett wearing a hairnet over his painstakingly arranged hair when a spotlight plays over the hayloft ceiling and a voice booms rousing the three men  From high we see a foreshortened lawman holding a bullhorn surrounded by armed deputies with a tinstarred sheriff watching impassively through mirrored sunglasses a bloodhound drooling at his side  Pete screams down from the hayport as RATATATATAT  Everett pulls Pete down when a tommy gun spits lead into the hayloft  Enraged Pete grabs a flaming faggot and hurls it down at the deputized congregation but it lands harmlessly in some scattered straw  The drum of one starts spinning "
        }
      ]
    }
  ]
}