{
  "ground_truth": "He climbs in. The car belches and pops and toodles off down the road. Delmar staggers to his feet and stumbles over to the carcass of the frog, weeping. His arms, stretched high over his head, are tied to a tree limb. His interrogator wields a bullwhip. Another lash, another scream. A third man walks into the torchlight, a hound drooling at his heels. He is Cooley, the sheriff with mirrored sunglasses whom we remember from previous barn confrontations. The two men acknowledge by backing away from Pete and then the accelerating pitter-patter of arriving rain. Cooley looks up. He looks back down at Pete. He shrugs, looks off. Looking up, into black: a rope is tossed up - it recedes out of the torchlight into black night - and then drops back down into the light, a noose bouncing at its end. The two henchmen fit the noose over Pete's neck. Delmar doggedly shakes his head. We distantly hear picks ringing and male chanting. Hollow-eyed, Everett tries to convince himself as much as Delmar. His voice trails away as he looks out at the road. They are passing a line of chained men in prison stripes and duck-billed caps wielding pickaxes and shovels at the side of the road. As he stares at the line of men Everett tries to pick up his thread. The prisoners look like phantoms in the heat and dust. Everett is haunted. The last man in line swings his pick and, as he grows smaller, looks up. Everett stares. Lone and lorn, he returns Everett's slack-jawed stare until heat ripples and the truck's dusty wake dissolve him away. Everett blinks. Everett shakes his head as if to clear it. The truck rattles on. On a bunting-covered stage, a pencil-necked man with round rimless glasses addresses a crowd of rustics. The pencil-neck is identified on posters as 'Homer Stokes, Friend of the Little Man', and, in life as in the pictures, he shakes a broom over his head. A midget in overalls stands next to him. The midget waves his little midget broom in time with Stoke's waves. He beams amid cheers and then, as three girls in gingham frocks run out to join him. The oldest girl is about ten. Everett stomps toward the stage, fighting his way through the crowd. Puzzled, Delmar follows. A man in a straw boater joins them. Everett sniffs and, catching a scent, squints. With this he takes a wild swing which Waldrip easily eludes. Waldrip adapts a Marquess of Queensbury stance and prances about, delivering stinging punches to the nose of a stunned and outclassed Everett. Its glass doors swing open and Everett is hurled out and bellyflops into the dust of the street.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "He ascends in. The vehicle exhales and pops and toodles off down the road. Delmar staggers to his feet and stumbles over to the carcass of the frog, weeping. His arms, stretched high over his head, are tied to a tree limb. His interrogator wields a bullwhip. Another lash, another scream. A third man walks into the torchlight, a hound drooling at his heels. He is Cooley, the sheriff with mirrored sunglasses whom we remember from previous barn confrontations. The two men acknowledge by backing away from Pete and then the accelerating pitter-patter of arriving rain. Cooley looks up. He looks back down at Pete. He shrugs, looks off. Looking up, into black: a rope is tossed up - it recedes out of the torchlight into black night - and then drops back down into the light, a noose bouncing at its end. The two henchmen fit the noose over Pete's neck. Delmar doggedly shakes his head. We distantly hear picks ringing and male chanting. Hollow-eyed, Everett tries to convince himself as much as Delmar. His voice trails away as he looks out at the road. They are passing a line of chained men in prison stripes and duck-billed caps wielding pickaxes and shovels at the side of the road. As he stares at the line of men Everett tries to pick up his thread. The prisoners look like phantoms in the heat and dust. Everett is haunted. The last man in line swings his pick and, as he grows smaller, looks up. Everett stares. Lone and lorn, he returns Everett's slack-jawed stare until heat ripples and the truck's dusty wake dissolve him away. Everett blinks. Everett shakes his head as if to clear it. The truck rattles on. On a bunting-covered stage, a pencil-necked man with round rimless glasses addresses a crowd of rustics. The pencil-neck is identified on posters as 'Homer Stokes, Friend of the Little Man', and, in life as in the pictures, he shakes a broom over his head. A midget in overalls stands next to him. The midget waves his little midget broom in time with Stoke's waves. He beams amid cheers and then, as three girls in gingham frocks run out to join him. The oldest girl is about ten. Everett stomps toward the stage, fighting his way through the crowd. Puzzled, Delmar follows. A man in a straw boater joins them. Everett sniffs and, catching a scent, squints. With this he takes a wild swing which Waldrip easily eludes. Waldrip adapts a Marquess of Queensbury stance and prances about, delivering stinging punches to the nose of a stunned and outclassed Everett. Its glass doors swing open and Everett is hurled out and bellyflops into the dust of the street."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "He climbs in. The car is belched and popped and toodled off down the road by it. Delmar is staggered to his feet and he stumbles over to the carcass of the frog, weeping. His arms, which are tied to a tree limb, are stretched high over his head. A bullwhip is wielded by his interrogator. Another scream accompanies another lash. A third man walks into the torchlight, with a hound drooling at his heels. Cooley, the sheriff with mirrored sunglasses remembered from previous barn confrontations, is he. They acknowledge each other by backing away from Pete and then the accelerating pitter-patter of arriving rain. Up looks Cooley. Pete is looked back down at by him. Off looks he, after he shrugs. Looking up, into black: a rope is tossed up and recedes out of the torchlight into black night, then it is dropped back down into the light, a noose bouncing at its end. Over Pete's neck, the noose is fitted by the two henchmen. Delmar's head is doggedly shaken by him. Picks ringing and male chanting are distantly heard by us. Everett, hollow-eyed, tries to convince Delmar as much as himself. As he looks out at the road, his voice trails away. A line of chained men in prison stripes and duck-billed caps wielding pickaxes and shovels at the side of the road are being passed by them. The line of men is stared at by Everett as he tries to pick up his thread. Like phantoms in the heat and dust, the prisoners look. Everett is haunted. The last man in line swings his pick and looks up as he grows smaller. Everett stares. Lone and lorn, Everett is returned the slack-jawed stare by him until he is dissolved away by heat ripples and the truck's dusty wake. Everett blinks. His head is shaken by Everett as if to clear it. The truck is rattled on by it. On a bunting-covered stage, a pencil-necked man with round rimless glasses addresses a crowd of rustics. On posters, as 'Homer Stokes, Friend of the Little Man', the pencil-neck is identified, and, as in the pictures, he shakes a broom over his head in life. A midget in overalls stands next to him. His little midget broom is waved in time with Stoke's waves by the midget. Amid cheers, he beams and then, as three girls in gingham frocks run out to join him. The oldest girl is about ten. Toward the stage stomps Everett, fighting his way through the crowd. Delmar is puzzled and follows him. A man in a straw boater joins them. Everett sniffs and, catching a scent, squints. With this, a wild swing is taken by him which is easily eluded by Waldrip. Waldrip adapts a Marquess of Queensbury stance and prances about, delivering stinging punches to a stunned and outclassed Everett's nose. Its glass doors are swung open and Everett is hurled out and he bellyflops into the dust of the street."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "He climbs in. The car belches, pops, and toodles down the road. Delmar staggers to his feet, stumbling to the frog's carcass, weeping. His arms are tied to a tree limb, and his interrogator wields a bullwhip. Another lash, another scream. A third man enters the torchlight with a drooling hound. It's Cooley, the sheriff with mirrored sunglasses from previous barn confrontations. The two men acknowledge each other, backing away from Pete as rain begins. Cooley looks up, then back at Pete, shrugs, and looks away. A rope is tossed up, receding into the night, then drops back with a noose. The henchmen fit it over Pete's neck. Delmar shakes his head. Distantly, picks ring and men chant. Hollow-eyed, Everett tries to convince himself and Delmar. His voice trails as he looks at the road, passing chained men in prison stripes wielding pickaxes and shovels. The prisoners appear phantom-like in the heat and dust. Everett is haunted. The last man in line swings his pick, looks up, and returns Everett's stare until heat ripples and the truck's dusty wake dissolve him. Everett blinks, shakes his head to clear it. The truck rattles on. On a bunting-covered stage, a pencil-necked man with round glasses addresses a rustic crowd. Identified on posters as 'Homer Stokes, Friend of the Little Man,' he shakes a broom over his head. A midget in overalls stands next to him, waving a small broom in time with Stokes. He beams amid cheers as three girls in gingham frocks join him. The oldest is about ten. Everett stomps toward the stage, fighting through the crowd. Puzzled, Delmar follows. A man in a straw boater joins them. Everett sniffs, catching a scent, and squints. He takes a wild swing, which Waldrip easily eludes. Waldrip adopts a Marquess of Queensbury stance, prancing and delivering stinging punches to Everett's nose. The glass doors swing open, and Everett is hurled out, bellyflopping into the street dust."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "He climbs in. The car belches, pops, and toodles down the road. Delmar staggers to the frog's carcass, weeping. His arms are tied to a tree limb. His interrogator wields a bullwhip. Another lash, another scream. A third man, Cooley, the sheriff with mirrored sunglasses, enters with a hound. The men back away from Pete as rain arrives. Cooley looks up, then at Pete, and shrugs. A rope is tossed up, recedes into the night, and drops back with a noose. The henchmen fit it over Pete's neck. Delmar shakes his head. Picks ring and men chant. Everett, hollow-eyed, tries to convince Delmar. He looks at the road, passing chained men in prison stripes with pickaxes. The prisoners look like phantoms. The last man swings his pick, looks up, and dissolves in the truck's dusty wake. Everett blinks and shakes his head. The truck rattles on. On a stage, a pencil-necked man with glasses, Homer Stokes, addresses a crowd, shaking a broom. A midget in overalls waves a broom in time. Three girls in gingham frocks join him. Everett stomps toward the stage, Delmar follows. A man in a straw boater joins them. Everett sniffs, swings wildly, but Waldrip eludes him and delivers stinging punches. Everett is hurled out, bellyflopping into the street dust."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "He climbs into the vehicle. The car, with a cacophony of belches and pops, toodles off down the road, leaving a trail of noise in its wake. Meanwhile, Delmar, struggling to regain his balance, staggers to his feet and stumbles over to the lifeless carcass of the frog, tears streaming down his face. His arms, stretched high above his head, are securely tied to a tree limb, rendering him helpless. His interrogator, a menacing figure, wields a bullwhip with a practiced hand. With each lash, another scream pierces the air. A third man, shrouded in the flickering torchlight, walks into view, a hound drooling at his heels. This man is Cooley, the sheriff with mirrored sunglasses, a familiar face from previous barn confrontations. The two men acknowledge each other by backing away from Pete, and then the accelerating pitter-patter of arriving rain fills the air. Cooley looks up at the sky, then back down at Pete. He shrugs nonchalantly and looks off into the distance. As he gazes upward into the inky blackness, a rope is tossed up, disappearing momentarily into the darkness before dropping back down into the light, a noose bouncing ominously at its end. The two henchmen methodically fit the noose over Pete's neck. Delmar, with a determined expression, doggedly shakes his head. In the distance, the sound of picks ringing and male chanting can be heard faintly. Hollow-eyed, Everett tries to convince himself as much as Delmar, his voice trailing away as he looks out at the road. They are passing a line of chained men, clad in prison stripes and duck-billed caps, wielding pickaxes and shovels at the side of the road. As Everett stares at the line of men, he tries to pick up his thread of thought. The prisoners appear like phantoms, ghostly figures in the oppressive heat and swirling dust. Everett is haunted by the sight. The last man in line swings his pick and, as he grows smaller in the distance, looks up. Everett stares back, transfixed. Lone and lorn, the man returns Everett's slack-jawed stare until the heat ripples and the truck's dusty wake dissolve him away into nothingness. Everett blinks, trying to clear his mind. He shakes his head as if to dispel the haunting images. The truck rattles on, continuing its journey. On a bunting-covered stage, a pencil-necked man with round rimless glasses addresses a crowd of rustics. This pencil-neck is identified on posters as 'Homer Stokes, Friend of the Little Man', and, in life as in the pictures, he energetically shakes a broom over his head. A midget in overalls stands next to him, waving his little midget broom in time with Stokes's enthusiastic waves. He beams amid the cheers of the crowd, and then, as if on cue, three girls in gingham frocks run out to join him. The oldest girl appears to be about ten years old. Everett, with determination, stomps toward the stage, fighting his way through the throng of people. Puzzled, Delmar follows closely behind. A man in a straw boater joins them, adding to the commotion. Everett sniffs the air and, catching a familiar scent, squints with suspicion. With this, he takes a wild swing, which Waldrip easily eludes with practiced agility. Waldrip, adopting a Marquess of Queensbury stance, prances about, delivering stinging punches to the nose of a stunned and clearly outclassed Everett. The glass doors swing open, and Everett is unceremoniously hurled out, bellyflopping into the dust of the street, a cloud of dirt rising around him."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "He gingerly climbs into the vehicle, settling into the seat with care. The old car, an unreliable machine known for its cacophony of belches and pops, toodles off down the narrow, winding road, leaving behind a trail of noise and echoes in its wake. Meanwhile, Delmar, struggling to regain his footing, staggers slowly to his feet. He then stumbles over to where the lifeless carcass of the frog lies, tears streaming unchecked down his face. His arms, extended high above his head, are securely tied to a sturdy tree limb, rendering him helpless and immobilized. His interrogator, a menacing and intimidating figure, wields a bullwhip with a practiced and ruthless hand. With each crack of the whip, another scream brutally pierces the thick, suffocating air. A third man, shrouded in the flickering, shifting torchlight, emerges into view, a hound drooling menacingly at his heels. This man is Cooley, the sheriff with mirrored sunglasses, a familiar face from previous intense barn confrontations. The two men acknowledge one another by backing warily away from Pete, and then the accelerating pitter-patter of arriving rain begins to fill the air, growing louder. Cooley looks up at the ominous sky, then back down at Pete. He nonchalantly shrugs and looks contemplatively off into the distance. As he gazes upward into the inky, impenetrable blackness, a rope is tossed briskly up, disappearing momentarily into the darkness before dropping back down into the light, a sinister noose bouncing ominously at its end. The two henchmen methodically fit the noose over Pete's neck with unsettling precision. Delmar, with a determined and resolute expression, doggedly shakes his head in disbelief. In the distance, the faint sound of picks ringing and male chanting can be heard, drifting softly on the wind. Hollow-eyed and weary, Everett tries to convince himself as much as Delmar, his voice trailing away into the silence as he looks distraughtly out at the road. They are passing a line of chained men, clad in bleak prison stripes and wearing duck-billed caps, wielding pickaxes and shovels by the side of the dusty road. As Everett stares at the line of men, he struggles to pick up his thread of thought, feeling a sense of despair. The prisoners appear like spectral phantoms, ghostly figures moving in the oppressive heat and swirling, choking dust. Everett is haunted by the sight of them. The last man in line swings his pick and, as he gradually grows smaller in the distance, looks up. Everett stares back, utterly transfixed. Lone and lorn, the man returns Everett's slack-jawed stare until, at last, the heat waves and the truck's dusty wake dissolve him away into nothingness. Everett blinks several times, trying desperately to clear his mind. He shakes his head vigorously as if to dispel the haunting, vivid images. The truck rattles noisily on, continuing its journey down the road. On a bunting-covered stage, a pencil-necked man with round rimless glasses addresses a crowd of eager rustics. This pencil-neck is identified on colorful posters as 'Homer Stokes, Friend of the Little Man,' and, in life as in the pictures, he energetically waves a broom above his head. A midget in overalls stands next to him, enthusiastically waving his little midget broom in perfect time with Stokes's enthusiastic, rhythmic gestures. He beams broadly amid the loud cheers of the jubilant crowd, and then, as if perfectly on cue, three girls in blue gingham frocks run energetically out to join him. The oldest girl appears to be around ten years old. Everett, filled with determination, stomps purposefully toward the stage, fighting his way through the dense throng of people. Puzzled by Everett's urgency, Delmar follows closely behind him, unsure of what to expect. A man wearing a straw boater joins them, adding to the growing commotion. Everett, sniffing the air instinctively and catching a familiar scent, squints suspiciously with narrowed eyes. With this sense of suspicion, he takes a wild swing, which Waldrip easily and gracefully eludes with practiced agility. Waldrip, adopting a Marquess of Queensbury stance, begins to prance about, delivering stinging punches to the nose of a stunned and clearly outclassed Everett. The glass doors swing open with force, and Everett is unceremoniously hurled out, bellyflopping with a thud into the dust of the street, a cloud of dirt rising around him in the aftermath."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "He climbs into the car, settling into the seat as the vehicle emits a series of belches and pops, then begins to toodle off down the road. Meanwhile, Delmar, struggling to regain his balance, staggers to his feet and stumbles over to the lifeless carcass of the frog, tears streaming down his face. His arms, stretched high above his head, are securely tied to a tree limb, rendering him helpless. His interrogator, standing nearby, wields a bullwhip with menacing intent. With each crack of the whip, another scream pierces the air. A third man, accompanied by a drooling hound at his heels, steps into the flickering torchlight. This man is Cooley, the sheriff with mirrored sunglasses, a familiar figure from previous barn confrontations. The two men acknowledge each other by backing away from Pete, just as the accelerating pitter-patter of rain begins to fall. Cooley glances upward, then back down at Pete, before shrugging and looking off into the distance. As he looks up into the blackness of the night, a rope is tossed upward, disappearing momentarily into the darkness before dropping back down into the light, a noose bouncing ominously at its end. The two henchmen methodically fit the noose over Pete's neck. Delmar, filled with determination, shakes his head in defiance. In the distance, the sound of picks ringing and male chanting can be heard faintly. Hollow-eyed, Everett attempts to convince himself as much as Delmar, his voice trailing off as he gazes out at the road. They pass a line of chained men in prison stripes and duck-billed caps, wielding pickaxes and shovels at the roadside. As Everett stares at the line of men, he tries to regain his train of thought. The prisoners appear ghostly in the heat and dust, haunting Everett's thoughts. The last man in line swings his pick and, as he gradually becomes smaller in the distance, looks up, locking eyes with Everett. Everett stares back, slack-jawed, as the lone and lorn prisoner returns his gaze until the heat ripples and the truck's dusty wake dissolve him from view. Everett blinks, shaking his head as if to clear his mind, while the truck continues to rattle on. On a bunting-covered stage, a pencil-necked man with round rimless glasses addresses a crowd of rustics. Identified on posters as 'Homer Stokes, Friend of the Little Man,' he energetically shakes a broom over his head. A midget in overalls stands beside him, waving a small broom in time with Stokes' movements, beaming amid the cheers. Three girls in gingham frocks run out to join him, the oldest being about ten years old. Everett stomps toward the stage, determinedly pushing his way through the crowd, with a puzzled Delmar following closely behind. A man in a straw boater joins them, and Everett, catching a scent, sniffs and squints. With a sudden burst of energy, he takes a wild swing, which Waldrip easily dodges. Waldrip adopts a Marquess of Queensbury stance, prancing about and delivering stinging punches to the nose of a stunned and outclassed Everett. The glass doors swing open, and Everett is unceremoniously hurled out, landing with a belly flop into the dust of the street."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "He climbs into the car, which sputters and drives away. Delmar, distraught, staggers to the frog's carcass, weeping. Meanwhile, Pete is tied to a tree limb, enduring lashes from his interrogator's bullwhip. Cooley, the sheriff with mirrored sunglasses, enters with a hound at his heels. Acknowledging each other, the men back away from Pete as rain begins to fall. Cooley glances up, then down at Pete, and shrugs before looking away. A rope is tossed into the darkness and returns with a noose, which the henchmen place around Pete's neck. Delmar shakes his head in despair. In the distance, picks ring and men chant. Everett, hollow-eyed, tries to reassure Delmar while watching a line of chained prisoners in stripes and caps working by the roadside. The prisoners appear ghostly in the heat and dust, haunting Everett. The last prisoner, shrinking in the distance, returns Everett's stare until he vanishes in the truck's dusty wake. Everett blinks and shakes his head to clear his thoughts as the truck continues. On a stage, a man identified as 'Homer Stokes, Friend of the Little Man,' waves a broom over his head, accompanied by a midget in overalls who mirrors his actions. Amid cheers, three girls in gingham frocks join them, the oldest about ten. Everett pushes through the crowd toward the stage, with Delmar following in confusion. A man in a straw boater joins them. Everett, catching a scent, squints and takes a wild swing at Waldrip, who easily dodges and counters with stinging punches. Everett is eventually thrown out of the building, landing in the street dust."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "He climbs in to a rusty old car, a relic of the past, sputtering and emitting loud pops as it toodles off down the potholed road. Delmar staggers to his feet, his unsteady gait revealing his distress, and stumbles over to the carcass of the frog, a symbol of lost hope, weeping. His arms, stretched high over his head in a painful suspension, are tied to a tree limb, reminiscent of frontier justice. His interrogator, a hulking figure dressed in worn leather, wields a bullwhip, an intimidating weapon that cracks through the night air. Another lash, another scream echoing through the woods. A third man, a looming presence, walks into the torchlight, a hound slavering at his heels. He is Cooley, the sheriff known for his mirrored sunglasses which reflect the fear of those he confronts, whom we remember from previous barn confrontations. The two men acknowledge a decision by backing away from Pete, and then the accelerating pitter-patter of arriving rain heralds a coming storm. Cooley looks up, the rain spotting his lenses. He looks back down at Pete, calculating. He shrugs, looks off into the distance. Looking up, into the blackness of the night sky: a rope is tossed up - it recedes out of the torchlight into the ink-black night - and then drops back down into the light, a noose bouncing ominously at its end. The two henchmen, their faces shadowed and grim, fit the noose over Pete's neck. Delmar doggedly shakes his head, refusing to give in to despair. We distantly hear picks ringing and male chanting, a haunting echo of the chain gang labor often seen in the South. Hollow-eyed, Everett tries to convince himself as much as Delmar, his voice a mere whisper of assurance. His voice trails away as he looks out at the road, lost in his thoughts. They are passing a line of chained men in prison stripes and duck-billed caps, reminiscent of 1930s convict attire, wielding pickaxes and shovels at the side of the road. As he stares at the line of men, Everett tries to pick up his thread of hope. The prisoners, appearing ghostly in the sweltering heat and swirling dust, look like phantoms in this desolate landscape. Everett is haunted by their plight. The last man in line swings his pick and, as he grows smaller, looks up with a distant, knowing gaze. Everett stares, as if recognizing a shared hardship. Lone and lorn, he returns Everett's slack-jawed stare until heat ripples and the truck's dusty wake dissolve him away, a mirage of despair. Everett blinks, trying to shake off the vision. Everett shakes his head as if to clear it, dismissing the haunting sight. The truck rattles on, its engine a low grumble. On a bunting-covered stage in the heart of a small town fair, a pencil-necked man with round rimless glasses, reminiscent of old political figures, addresses a crowd of rustics gathered for entertainment. The pencil-neck is identified on posters plastered around the venue as 'Homer Stokes, Friend of the Little Man', and, in life as in the pictures, he shakes a broom over his head, symbolizing a sweeping change. A midget in overalls, a figure often seen as a curiosity in the past, stands next to him. The midget waves his little midget broom in time with Stoke's waves, a choreographed display of unity. He beams amid cheers and then, as three girls in gingham frocks reminiscent of rural innocence, run out to join him. The oldest girl is about ten, full of youthful enthusiasm. Everett stomps toward the stage, determination in his stride, fighting his way through the crowd. Puzzled, Delmar follows, ever loyal. A man in a straw boater, a fashion choice from the early 20th century, joins them. Everett sniffs and, catching a suspicious scent, squints in sudden clarity. With this he takes a wild swing, an act of sudden aggression, which Waldrip, a man with a slick veneer, easily eludes. Waldrip adapts a Marquess of Queensbury stance, a style of boxing known for its elegance, and prances about, delivering stinging punches to the nose of a stunned and outclassed Everett. Its glass doors swing open, and Everett is hurled out with force, bellyflopping into the dust of the street as onlookers gasp at his fall."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "He climbs in  The car belches and pops and toodles off down the road  Delmar staggers to his feet and stumbles over to the carcass of the frog weeping  His arms stretched high over his head are tied to a tree limb  His interrogator wields a bullwhip  Another lash another scream  A third man walks into the torchlight a hound drooling at his heels  As he stares at the line of men Everett tries to pick up his thread  The prisoners look like phantoms in the heat and dust  Everett is haunted  The last man in line swings his pick and as he grows smaller looks up  Everett stares  Lone and lorn  he returns Everett's slackjawed stare until heat ripples and the truck's dusty wake dissolve him away  Everett blinks  Everett shakes his head as if to clear it  The truck rattles on  On a buntingcovered stage a pencilnecked man with round rimless glasses addresses a crowd of rustics  The pencilneck is identified on posters as 'Homer Stokes Friend of the Little Man' and in life as in the pictures he shakes a broom over his head  A midget in overalls stands next to him  The midget waves his little midget broom in time with Stoke's waves  He beams amid cheers and then as three girls in gingham frocks run out to join him  The oldest girl is about ten  Everett stomps toward the stage fighting his way through the crowd  Puzzled Delmar follows  A man in a straw boater joins them  Everett sniffs and catching a scent squints  With this he takes a wild swing which Waldrip easily eludes  Waldrip adapts a Marquess of Queensbury stance and prances about delivering stinging punches to the nose of a stunned and outclassed Everett  He is Cooley the sheriff with mirrored sunglasses whom we remember from previous barn confrontations  The two men acknowledge by backing away from Pete and then the accelerating pitterpatter of arriving rain  Cooley looks up  He looks back down at Pete  He shrugs looks off  Looking up into black a rope is tossed up   it recedes out of the torchlight into black night  and then drops back down into the light a noose bouncing at its end  The two henchmen fit the noose over Pete's neck  Delmar doggedly shakes his head  We distantly hear picks ringing and male chanting  Holloweyed Everett tries to convince himself as much as Delmar  His voice trails away as he looks out at the road  They are passing a line of chained men in prison stripes and duckbilled caps wielding pickaxes and shovels at the side of the road  As he stares at the line of men Everett tries to pick up his thread  The prisoners look like phantoms in the heat and dust  Everett is haunted  The last man in line swings his pick and as he grows smaller looks up  Everett stares  Lone and lorn  he returns Everett's slackjawed stare until heat ripples and the truck's dusty wake dissolve him away  Everett blinks  Everett shakes his head as if to clear it  The truck rattles on  On a buntingcovered stage a pencilnecked man with round rimless glasses addresses a crowd of rustics  The pencilneck is identified on posters as 'Homer Stokes Friend of the Little Man' and in life as in the pictures he shakes a broom over his head  A midget in overalls stands next to him  The midget waves his little midget broom in time with Stoke's waves  He beams amid cheers and then as three girls in gingham frocks run out to join him  The oldest girl is about ten  Everett stomps toward the stage fighting his way through the crowd  Puzzled Delmar follows  A man in a straw boater joins them  Everett sniffs and catching a scent squints  With this he takes a wild swing which Waldrip easily eludes  Waldrip adapts a Marquess of Queensbury stance and prances about delivering stinging punches to the nose of a stunned and outclassed Everett  Its glass doors swing open and Everett is hurled out and bellyflops into the dust of the street"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "He climbs in. The car belches and pops and toodles off down the road. Delmar staggers to his feet and stumbles over to the carcass of the frog weeping. His arms stretched high over his head are tied to a tree limb. His interrogator wields a bullwhip. Another lash another scream. A third man walks into the torchlight a hound drooling at his heels. He is Cooley the sheriff with mirrored sunglasses whom we remember from previous barn confrontations. The two men acknowledge by backing away from Pete and then the accelerating pitterpatter of arriving rain. Cooley looks up. He looks back down at Pete. He shrugs looks off. Looking up into black a rope is tossed up. it recedes out of the torchlight into black night  and then drops back down into the light a noose bouncing at its end. The two henchmen fit the noose over Pete's neck. Delmar doggedly shakes his head. We distantly hear picks ringing and male chanting. Holloweyed Everett tries to convince himself as much as Delmar. His voice trails away as he looks out at the road. They are passing a line of chained men in prison stripes and duckbilled caps wielding pickaxes and shovels at the side of the road. As he stares at the line of men Everett tries to pick up his thread. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. The prisoners look like phantoms in the heat and dust. Everett is haunted. The last man in line swings his pick and as he grows smaller looks up. Everett stares. Lone and lorn. he returns Everett's slackjawed stare until heat ripples and the truck's dusty wake dissolve him away. Everett blinks. Everett shakes his head as if to clear it. The truck rattles on. On a buntingcovered stage a pencilnecked man with round rimless glasses addresses a crowd of rustics. The pencilneck is identified on posters as 'Homer Stokes Friend of the Little Man' and in life as in the pictures he shakes a broom over his head. A midget in overalls stands next to him. The midget waves his little midget broom in time with Stoke's waves. He beams amid cheers and then as three girls in gingham frocks run out to join him. The oldest girl is about ten. Everett stomps toward the stage fighting his way through the crowd. Puzzled Delmar follows. A man in a straw boater joins them. Everett sniffs and catching a scent squints. With this he takes a wild swing which Waldrip easily eludes. Waldrip adapts a Marquess of Queensbury stance and prances about delivering stinging punches to the nose of a stunned and outclassed Everett. Its glass doors swing open and Everett is hurled out and bellyflops into the dust of the street."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "He climbs in. The car belches and pops and toodles off down the road. Delmar staggers to his feet and stumbles over to the carcass of the frog weeping. His arms stretched high over his head are tied to a tree limb. His interrogator wields a bullwhip. Another lash another scream. A third man walks into the torchlight a hound drooling at his heels. He is Cooley the sheriff with mirrored sunglasses whom we remember from previous barn confrontations. The two men acknowledge by backing away from Pete and then the accelerating pitterpatter of arriving rain. Cooley looks up. He looks back down at Pete. He shrugs looks off. Looking up into black a rope is tossed up. it recedes out of the torchlight into black night  and then drops back down into the light a noose bouncing at its end. The two henchmen fit the noose over Pete's neck. Delmar doggedly shakes his head. We distantly hear picks ringing and male chanting. Holloweyed Everett tries to convince himself as much as Delmar. His voice trails away as he looks out at the road. They are passing a line of chained men in prison stripes and duckbilled caps wielding pickaxes and shovels at the side of the road. As he stares at the line of men Everett tries to pick up his thread. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. The prisoners look like phantoms in the heat and dust. Everett is haunted. The last man in line swings his pick and as he grows smaller looks up. Everett stares. Lone and lorn. he returns Everett's slackjawed stare until heat ripples and the truck's dusty wake dissolve him away. Everett blinks. Everett shakes his head as if to clear it. The truck rattles on. On a buntingcovered stage a pencilnecked man with round rimless glasses addresses a crowd of rustics. The pencilneck is identified on posters as 'Homer Stokes Friend of the Little Man' and in life as in the pictures he shakes a broom over his head. A midget in overalls stands next to him. The midget waves his little midget broom in time with Stoke's waves. He beams amid cheers and then as three girls in gingham frocks run out to join him. The oldest girl is about ten. Everett stomps toward the stage fighting his way through the crowd. Puzzled Delmar follows. A man in a straw boater joins them. Everett sniffs and catching a scent squints. With this he takes a wild swing which Waldrip easily eludes. Waldrip adapts a Marquess of Queensbury stance and prances about delivering stinging punches to the nose of a stunned and outclassed Everett. Its glass doors swing open and Everett is hurled out and bellyflops into the dust of the street."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "He climbs in. The car belches and pops and toodles off down the road. Delmar staggers to his feet and stumbles over to the carcass of the frog weeping. His arms stretched high over his head are tied to a tree limb. His interrogator wields a bullwhip. Another lash another scream. A third man walks into the torchlight a hound drooling at his heels. He is Cooley the sheriff with mirrored sunglasses whom we remember from previous barn confrontations. The two men acknowledge by backing away from Pete and then the accelerating pitterpatter of arriving rain. Cooley looks up. He looks back down at Pete. A midget in overalls stands next to him. The midget waves his little midget broom in time with Stoke's waves. He beams amid cheers and then as three girls in gingham frocks run out to join him. The oldest girl is about ten. Everett stomps toward the stage fighting his way through the crowd. Puzzled Delmar follows. A man in a straw boater joins them. Everett sniffs and catching a scent squints. With this he takes a wild swing which Waldrip easily eludes. Waldrip adapts a Marquess of Queensbury stance and prances about delivering stinging punches to the nose of a stunned and outclassed Everett. Its glass doors swing open and Everett is hurled out and bellyflops into the dust of the street."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "He climbs in. The car belches and pops and toodles off down the road. Delmar staggers to his feet and stumbles over to the carcass of the frog weeping. His arms stretched high over his head are tied to a tree limb. A man in a straw boater joins them. Everett sniffs and catching a scent squints. With this he takes a wild swing which Waldrip easily eludes. Waldrip adapts a Marquess of Queensbury stance and prances about delivering stinging punches to the nose of a stunned and outclassed Everett. Its glass doors swing open and Everett is hurled out and bellyflops into the dust of the street."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "She climbs in. The bicycle belches and pops and toodles off down the road. The squirrel staggers to its feet and stumbles over to the carcass of the frog, weeping. Its arms, stretched high over its head, are tied to a tree limb. Her interrogator wields a bullwhip. Another lash, another scream. A fourth horse walks into the torchlight, a chicken drooling at its heels. She is Lila, the scientist with mirrored sunglasses whom we remember from previous barn confrontations. The two giraffes acknowledge by backing away from the goat and then the accelerating pitter-patter of arriving rain. Lila looks up. She looks back down at the goat. She shrugs, looks off. Looking up, into black: a rope is tossed up - it recedes out of the torchlight into black night - and then drops back down into the light, a noose bouncing at its end. The two dolphins fit the noose over the goat's neck. The squirrel doggedly shakes its head. We distantly hear crows ringing and male chanting. Hollow-eyed, Margaret tries to convince herself as much as the squirrel. Her voice trails away as she looks out at the road. They are passing a line of chained women in prison stripes and duck-billed caps wielding pickaxes and shovels at the side of the road. As she stares at the line of women, Margaret tries to pick up her thread. The prisoners look like phantoms in the heat and dust. Margaret is haunted. The last owl in line swings its pick and, as it grows smaller, looks up. Margaret stares. Lone and lorn, it returns Margaret's slack-jawed stare until heat ripples and the cart's dusty wake dissolve it away. Margaret blinks. Margaret shakes her head as if to clear it. The cart rattles on. On a bunting-covered stage, an elephant with round rimless glasses addresses a crowd of rustics. The elephant is identified on posters as 'Homer Stokes, Friend of the Little Man', and, in life as in the pictures, it shakes a broom over its head. A penguin in overalls stands next to it. The penguin waves its little penguin broom in time with Stokes's waves. It beams amid cheers and then, as three cats in gingham frocks run out to join it. The oldest cat is about ten. Margaret stomps toward the stage, fighting her way through the crowd. Puzzled, the squirrel follows. A dragon in a straw boater joins them. Margaret sniffs and, catching a scent, squints. With this she takes a wild swing which Waldrip easily eludes. Waldrip adapts a Marquess of Queensbury stance and prances about, delivering stinging punches to the nose of a stunned and outclassed Margaret. Its glass doors swing open and Margaret is hurled out and bellyflops into the dust of the street."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "He climbs in. The boat belches and pops and toodles off down the river. Delmar staggers to his feet and stumbles over to the carcass of the lizard, weeping. His arms, stretched high over his head, are tied to a fence post. His interrogator wields a riding crop. Another lash, another scream. A third man walks into the lantern light, a cat drooling at his heels. He is Cooley, the sheriff with mirrored binoculars whom we remember from previous shed confrontations. The two men acknowledge by backing away from Pete and then the accelerating patter of approaching hail. Cooley looks up. He looks back down at Pete. He shrugs, looks off. Looking up, into black: a vine is tossed up - it recedes out of the lantern light into black sky - and then drops back down into the light, a loop bouncing at its end. The two henchmen fit the loop over Pete's neck. Delmar doggedly shakes his head. We distantly hear hammers ringing and male chanting. Hollow-eyed, Everett tries to convince himself as much as Delmar. His voice trails away as he looks out at the river. They are passing a line of chained men in garden aprons and top hats wielding hoes and rakes at the edge of the river. As he stares at the line of men Everett tries to pick up his thread. The prisoners look like phantoms in the fog and mist. Everett is haunted. The last man in line swings his hoe and, as he grows smaller, looks up. Everett stares. Lone and lorn, he returns Everett's slack-jawed stare until mist ripples and the train's misty wake dissolve him away. Everett blinks. Everett shakes his head as if to clear it. The train rattles on. On a banner-covered balcony, a pencil-necked man with round rimless goggles addresses a crowd of townsfolk. The pencil-neck is identified on banners as 'Homer Stokes, Companion of the Little Person', and, in life as in the pictures, he shakes a rake over his head. A jester in pajamas stands next to him. The jester waves his little jester rake in time with Stoke's waves. He beams amid cheers and then, as three boys in corduroy shorts run out to join him. The oldest boy is about ten. Everett stomps toward the balcony, fighting his way through the crowd. Puzzled, Delmar follows. A man in a bonnet joins them. Everett sniffs and, catching a scent, squints. With this he takes a wild swing which Waldrip easily eludes. Waldrip adapts a Marquess of Queensbury stance and prances about, delivering stinging punches to the chin of a stunned and outclassed Everett. Its wooden doors swing open and Everett is hurled out and bellyflops into the mud of the dock."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "He settles in. The car hiccups and crackles and drifts off down the road. Delmar wobbles to his feet and meanders over to the carcass of the frog, laughing. His arms, lowered down by his sides, are glued to a tree limb. His interrogator wields a bouquet. Another sniff, another giggle. A third man dances into the torchlight, a hound prancing at his heels. He is Cooley, the sheriff with mirrored sunglasses whom we remember from previous barn celebrations. The two men acknowledge by shuffling away from Pete and then the accelerating drizzle of departing rain. Cooley gazes up. He glances back down at Pete. He sighs, looks aside. Gazing up, into black: a rope is flung upward - it expands out of the torchlight into black night - and then dangles back down into the light, a knot bouncing at its end. The two henchmen place the knot over Pete's neck. Delmar eagerly nods his head. We distantly hear drums clattering and female humming. Bright-eyed, Everett tries to amuse himself as much as Delmar. His voice trails away as he gazes out at the road. They are witnessing a line of dancing men in prison stripes and duck-billed caps wielding instruments and brushes at the side of the road. As he observes the line of men Everett tries to catch his rhythm. The men resemble specters in the mist and shadows. Everett is intrigued. The last man in line swings his brush and, as he grows larger, glances up. Everett watches. Lone and lorn, he returns Everett's wide-eyed stare until heat waves and the truck's smoky wake blend him away. Everett blinks. Everett tilts his head as if to reset it. The truck purrs on. On a ribbon-decked stage, a pencil-necked man with round rimless glasses entertains a crowd of rustics. The pencil-neck is identified on posters as 'Homer Stokes, Enemy of the Tall Man', and, in life as in the pictures, he waves a fan over his head. A midget in overalls dances next to him. The midget twirls his little midget fan in time with Stoke's waves. He glows amid cheers and then, as three girls in gingham frocks waltz out to join him. The oldest girl is about ten. Everett strides toward the stage, weaving his way through the crowd. Curious, Delmar watches. A man in a straw boater skips over to them. Everett sniffs and, catching a scent, frowns. With this he takes a gentle swing which Waldrip easily dodges. Waldrip adopts a defensive stance and skips about, delivering light taps to the shoulder of a curious and confused Everett. Its glass doors swing open and Everett is ushered out and faceplants into the dust of the street."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "The teacup descends in. The bicycle hiccups and crackles and trundles off down the sidewalk. Gertrude staggers to her feet and stumbles over to the skeleton of the parrot, sobbing. Her legs, stretched high over her shoulder, are tied to a lamppost branch. Her interrogator wields a feather duster. Another tickle, another giggle. A third cupcake strolls into the moonlight, a cat purring at its toes. It is Willoughby, the gardener with mirrored binoculars whom we recall from previous attic discussions. The two bananas acknowledge by backing away from Martha and then the accelerating drip-drop of arriving hail. Willoughby glances up. He glances back down at Martha. He shrugs, peers off. Glancing up, into gray: a vine is tossed up - it recedes out of the moonlight into gray midnight - and then drops back down into the light, a pretzel bouncing at its end. The two vagrants fit the pretzel over Martha’s wrist. Gertrude unflinchingly shakes her knee. We distantly hear drums tolling and female chanting. Hollow-eyed, Jasper tries to convince himself as much as Gertrude. His whisper trails away as he gazes out at the garden. They are passing a troupe of chained geese in sailor stripes and wide-brimmed hats wielding hammers and rakes at the edge of the garden. As he gapes at the troupe of geese Jasper attempts to reclaim his yarn. The sailors look like wraiths in the mist and pollen. Jasper is spooked. The final goose in line swings its hammer and, as it grows smaller, glances up. Jasper gapes. Solitary and forlorn, it returns Jasper’s slack-jawed gape until mist swirls and the bicycle’s misty wake erases it away. Jasper squints. Jasper shakes his shoulder as if to clear it. The bicycle clatters on. On a fabric-draped float, a square-jawed lady with triangular wire spectacles addresses a gathering of scholars. The square-jaw is identified on billboards as 'Dulcimer Brooks, Companion of the Little Goose', and, in life as in the images, she shakes a feather over her knee. A giant in pajamas stands next to her. The giant waves his gigantic feather in tune with Brooks’s waves. He grins amid applause and then, as three dogs in lace bonnets trot out to join him. The eldest dog is about twelve. Jasper marches toward the float, battling his way through the scholars. Baffled, Gertrude follows. A beetle in a paper cap joins them. Jasper sniffs and, catching an aroma, blinks. With this he takes a wild jab which Pickles easily dodges. Pickles adopts a Frisian Bull stance and romps about, delivering playful nudges to the nose of a flustered and bemused Jasper. Its wooden lids swing open and Jasper is flung out and faceplants into the pollen of the garden."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "He slithers in. The bicycle chatters and hops and breezes off down the street. Jasper totters to his knees and bumbles over to the skeleton of the turtle, giggling. His legs, bent awkwardly over his back, are tied to a chair leg. His questioner grips a plunger. Another poke, another gasp. A fifth woman hops into the lamplight, a pigeon fluttering at her toes. She is Hadley, the teacher with mirrored goggles whom we recall from previous garage encounters. The two women bow by scuttling away from Tim and then the intensifying drizzle of incoming snow. Hadley squints up. She glances back down at Tim. She sighs, gazes away. Gazing up, into shadow: a chain is flung up - it vanishes out of the lamplight into shadowy night - and then plummets back down into the light, a hook wobbling at its tip. The three drivers place the hook over Tim's ankle. Jasper eagerly shakes his feet. We faintly catch hammers echoing and female humming. Foggy-eyed, Mavis tries to assure herself as much as Jasper. Her words drift away as she glances out at the path. They are passing a line of shackled women in prison dresses and feathered hats clutching rakes and spades at the edge of the path. As she watches the line of women, Mavis tries to pick up her narrative. The captives resemble shadows in the warmth and haze. Mavis is disturbed. The first woman in line thrusts her rake and, as she shrinks, peers up. Mavis gapes. Solitary and forlorn, she mimics Mavis's gape-mouthed stare until warmth waves and the car's sandy trail blur her away. Mavis blinks. Mavis shakes her body as if to awaken it. The car jangles onward. On a flag-draped podium, a lanky teenager with square thick glasses speaks to a gathering of townsfolk. The lanky teen is labeled on banners as 'Sam Roper, Ally of the Little Gal', and, in reality as in the images, he swings a mop around his waist. A giant in jeans stands beside him. The giant flutters his massive giant mop in rhythm with Roper's waves. He grins amid shouts and then, as five boys in denim overalls rush out to join him. The youngest boy is about eight. Mavis tramples toward the podium, elbowing her way through the gathering. Confused, Jasper follows. A lad in a straw fedora joins them. Mavis inhales and, detecting a fragrance, frowns. With this, she takes a daring lunge which Tinsley effortlessly dodges. Tinsley settles into a Karate stance and skips around, delivering glancing shoves to the ear of a baffled and mismatched Mavis. Its wooden gates swing wide and Mavis is tossed out and lands face-first into the sand of the yard."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "He crawls in. The truck grumbles and fizzles and drifts off down the alley. Delmar wobbles to his knees and wanders over to the statue of the squirrel, giggling. His legs, stretched out in front of him, are tied to a branch. His interrogator swings a lasso. Another loop, another cheer. A third man strides into the lantern light, a ferret sniffling at his feet. He is Cooley, the marshal with tinted goggles whom we remember from previous shed encounters. The two men recognize by inching away from Pete and then the quickening patter-patter of approaching hail. Cooley glances up. He peeks back down at Pete. He sighs, gazes off. Gazing up, into darkness: a chain is flung up - it vanishes out of the lantern light into dark sky - and then falls back down into the light, a loop bobbing at its end. The two henchmen slip the loop over Pete's shoulders. Delmar stubbornly nods his head. We faintly hear trowels clinking and female singing. Bleary-eyed, Everett tries to reassure himself as much as Delmar. His voice fades away as he gazes out at the alley. They are passing a line of shackled women in prisoner stripes and straw hats wielding hoes and rakes at the edge of the alley. As he gapes at the line of women Everett tries to regain his rhythm. The prisoners look like specters in the fog and mud. Everett is troubled. The last woman in line swings her hoe and, as she grows fainter, gazes up. Everett gawks. Sole and forlorn, she returns Everett's vacant gaze until fog curls and the truck's muddy trail dissolves her away. Everett winces. Everett rubs his forehead as if to clear it. The truck clinks on. On a flag-draped platform, a stout man with square horn-rimmed glasses addresses a gathering of city folk. The stout man is identified on banners as 'Homer Stokes, Advocate of the Common Folk', and, in person as in the images, he waves a spade over his body. A giant in suspenders stands beside him. The giant salutes his enormous giant spade in tune with Stoke's salutes. He grins amid applause and then, as three boys in denim pants dash out to join him. The tallest boy is about twelve. Everett trudges toward the platform, jostling his path through the assembly. Confused, Delmar trails. A woman in a sunhat joins them. Everett inhales and, detecting a whiff, squints. With this he makes a haphazard jab which Waldrip easily dodges. Waldrip adopts a Karate Kid pose and skips around, delivering sharp smacks to the elbow of a surprised and mismatched Everett. Its wooden gates swing closed and Everett is tossed out and backflips into the mud of the street."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "The rabbit leaps in. The tractor coughs and sputters and meanders off up the lane. Baxter sways to his paws and crawls over to the skeleton of the pigeon, wailing. His legs, lifted high over his shoulders, are fastened to a bush branch. His tormentor brandishes a lasso. Another swing, another howl. A fourth rabbit hops into the moonlight, a cat slobbering at its paws. He is Carter, the mayor with shiny monocles whom we recall from earlier shed encounters. The three animals nod by creeping away from Jerry and then the quickening tinkle-tinkle of incoming hail. Carter glances upward. He peers back at Jerry. He sighs, gazes away. Gazing upward, into white: a chain is flung up - it shrinks out of the moonlight into white dusk - and then returns back down into the glow, a knot bobbing at its tip. The three guards slip the knot over Jerry's ear. Baxter persistently wobbles his ears. We faintly hear drums pounding and female yelling. Bleary-eyed, Lawrence attempts to encourage himself as much as Baxter. His eyes drift away as he surveys the lane. They are moving past a row of tethered owls in striped pajamas and long-brimmed hats holding mallets and rakes at the edge of the lane. As he peers at the row of owls Lawrence struggles to resume his discourse. The convicts resemble shadows in the warmth and grime. Lawrence is troubled. The leading owl in the row swings its mallet and, as it becomes tinier, glances upward. Lawrence gapes. Solo and forlorn, it maintains Lawrence's wide-eyed gawk until haze shimmers and the wagon's muddy trail erases it away. Lawrence squints. Lawrence wobbles his ears as if to reset it. The wagon clatters on. On a floral-draped platform, a string-beaned bird with square frameless goggles addresses a flock of peasants. The string-bean is listed on billboards as 'Barney Jones, Ally of the Giant Creature', and, in reality as in the portraits, he waves a feather over his legs. A miniature in jeans stands beside him. The miniature flaps its tiny miniature feather in rhythm with Jones's flaps. He grins among shouts and then, as five boys in denim pants dash out to join him. The eldest boy is about twelve. Lawrence charges at the platform, pushing his path through the flock. Confounded, Baxter tags along. A bird in a woven bonnet joins them. Lawrence inhales and, catching an odor, gasps. With that he unleashes a frantic swipe which Dominic effortlessly dodges. Dominic assumes a Regal of Wimbledon posture and flits around, delivering sharp jabs to the eyebrow of a baffled and outplayed Lawrence. Its wooden flaps swing wide and Lawrence is tossed out and bellyflops into the grime of the avenue."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "The car departs with a series of noisy sounds, leaving Delmar to mourn a crushed frog. Tied to a tree, Pete is whipped by an interrogator, and Sheriff Cooley, recognized from earlier confrontations, approaches with his dog. A noose is placed around Pete's neck as rain begins. Everett, hollow-eyed, watches chained prisoners in stripes working by the road. He's transfixed by a phantom-like figure staring back until it vanishes in the dust. On stage, Homer Stokes, known as 'Friend of the Little Man,' rallies a crowd, shaking a broom with a midget beside him. Everett fights through the crowd to confront Stokes but is easily outmaneuvered, ultimately thrown out onto the street."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Its glass doors swing open and Everett is hurled out and bellyflops into the dust of the street Waldrip adapts a Marquess of Queensbury stance and prances about delivering stinging punches to the nose of a stunned and outclassed Everett  With this he takes a wild swing which Waldrip easily eludes  Everett sniffs and catching a scent squints  A man in a straw boater joins them  Puzzled Delmar follows  Everett stomps toward the stage fighting his way through the crowd  The oldest girl is about ten  He beams amid cheers and then as three girls in gingham frocks run out to join him  The midget waves his little midget broom in time with Stoke's waves  A midget in overalls stands next to him  The pencilneck is identified on posters as 'Homer Stokes Friend of the Little Man' and in life as in the pictures he shakes a broom over his head  On a buntingcovered stage a pencilnecked man with round rimless glasses addresses a crowd of rustics  The truck rattles on  Everett shakes his head as if to clear it  Everett blinks  he returns Everett's slackjawed stare until heat ripples and the truck's dusty wake dissolve him away  Lone and lorn  Everett stares  The last man in line swings his pick and as he grows smaller looks up  Everett is haunted  The prisoners look like phantoms in the heat and dust  As he stares at the line of men Everett tries to pick up his thread  They are passing a line of chained men in prison stripes and duckbilled caps wielding pickaxes and shovels at the side of the road  His voice trails away as he looks out at the road  Holloweyed Everett tries to convince himself as much as Delmar  We distantly hear picks ringing and male chanting  Delmar doggedly shakes his head  The two henchmen fit the noose over Pete's neck  it recedes out of the torchlight into black night  and then drops back down into the light a noose bouncing at its end  Looking up into black a rope is tossed up   He shrugs looks off  He looks back down at Pete  Cooley looks up  The two men acknowledge by backing away from Pete and then the accelerating pitterpatter of arriving rain  He is Cooley the sheriff with mirrored sunglasses whom we remember from previous barn confrontations  A third man walks into the torchlight a hound drooling at his heels  Another lash another scream  His interrogator wields a bullwhip  His arms stretched high over his head are tied to a tree limb  Delmar staggers to his feet and stumbles over to the carcass of the frog weeping  The car belches and pops and toodles off down the road  He climbs in "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Puzzled Delmar follows  He climbs in  Everett sniffs and catching a scent squints  On a buntingcovered stage a pencilnecked man with round rimless glasses addresses a crowd of rustics  it recedes out of the torchlight into black night  and then drops back down into the light a noose bouncing at its end  Lone and lorn  The pencilneck is identified on posters as 'Homer Stokes Friend of the Little Man' and in life as in the pictures he shakes a broom over his head  They are passing a line of chained men in prison stripes and duckbilled caps wielding pickaxes and shovels at the side of the road  Everett shakes his head as if to clear it  he returns Everett's slackjawed stare until heat ripples and the truck's dusty wake dissolve him away  His interrogator wields a bullwhip  He looks back down at Pete  As he stares at the line of men Everett tries to pick up his thread  Holloweyed Everett tries to convince himself as much as Delmar  Delmar doggedly shakes his head  The midget waves his little midget broom in time with Stoke's waves  He shrugs looks off  The two henchmen fit the noose over Pete's neck  The two men acknowledge by backing away from Pete and then the accelerating pitterpatter of arriving rain  Looking up into black a rope is tossed up   His arms stretched high over his head are tied to a tree limb  Everett stomps toward the stage fighting his way through the crowd  Everett blinks  Cooley looks up  The oldest girl is about ten  The prisoners look like phantoms in the heat and dust  The car belches and pops and toodles off down the road  With this he takes a wild swing which Waldrip easily eludes  Waldrip adapts a Marquess of Queensbury stance and prances about delivering stinging punches to the nose of a stunned and outclassed Everett  A third man walks into the torchlight a hound drooling at his heels  A midget in overalls stands next to him  The last man in line swings his pick and as he grows smaller looks up  His voice trails away as he looks out at the road  Another lash another scream  Everett stares  He is Cooley the sheriff with mirrored sunglasses whom we remember from previous barn confrontations  He beams amid cheers and then as three girls in gingham frocks run out to join him  The truck rattles on  Delmar staggers to his feet and stumbles over to the carcass of the frog weeping  We distantly hear picks ringing and male chanting  A man in a straw boater joins them  Its glass doors swing open and Everett is hurled out and bellyflops into the dust of the street Everett is haunted "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Everett is haunted  The last man in line swings his pick and as he grows smaller looks up  Everett stares  Lone and lorn  he returns Everett's slackjawed stare until heat ripples and the truck's dusty wake dissolve him away  Everett blinks  Everett shakes his head as if to clear it  The truck rattles on  On a buntingcovered stage a pencilnecked man with round rimless glasses addresses a crowd of rustics  The pencilneck is identified on posters as 'Homer Stokes Friend of the Little Man' and in life as in the pictures he shakes a broom over his head  A midget in overalls stands next to him  The midget waves his little midget broom in time with Stoke's waves  He beams amid cheers and then as three girls in gingham frocks run out to join him  The oldest girl is about ten  Everett stomps toward the stage fighting his way through the crowd  Puzzled Delmar follows  A man in a straw boater joins them  Everett sniffs and catching a scent squints  With this he takes a wild swing which Waldrip easily eludes  Waldrip adapts a Marquess of Queensbury stance and prances about delivering stinging punches to the nose of a stunned and outclassed Everett  Its glass doors swing open and Everett is hurled out and bellyflops into the dust of the street He climbs in  The car belches and pops and toodles off down the road  Delmar staggers to his feet and stumbles over to the carcass of the frog weeping  His arms stretched high over his head are tied to a tree limb  His interrogator wields a bullwhip  Another lash another scream  A third man walks into the torchlight a hound drooling at his heels  He is Cooley the sheriff with mirrored sunglasses whom we remember from previous barn confrontations  The two men acknowledge by backing away from Pete and then the accelerating pitterpatter of arriving rain  Cooley looks up  He looks back down at Pete  He shrugs looks off  Looking up into black a rope is tossed up   it recedes out of the torchlight into black night  and then drops back down into the light a noose bouncing at its end  The two henchmen fit the noose over Pete's neck  Delmar doggedly shakes his head  We distantly hear picks ringing and male chanting  Holloweyed Everett tries to convince himself as much as Delmar  His voice trails away as he looks out at the road  They are passing a line of chained men in prison stripes and duckbilled caps wielding pickaxes and shovels at the side of the road  As he stares at the line of men Everett tries to pick up his thread  The prisoners look like phantoms in the heat and dust "
        }
      ]
    }
  ]
}