{
  "ground_truth": "Three young Poles carry long objects wrapped in newspaper. One man checks his watch, kneels, and places the package he's carrying to his shoulder, revealing the barrel of a machine gun as it begins firing. His two companions do the same, targeting the Schutzpolizei building, hitting the sentry who falls in front of his box. Suddenly, gunfire echoes throughout the city. Pedestrians scatter, except for an old man with a walking stick, who manages to enter a building. Rifle and machine-gun fire erupt from the Schutzpolizei building, and the three young Poles maneuver to a corner opposite it, tossing grenades inside. A battle ensues as the Germans retaliate from the hospital, with grenades and machine-gun fire exchanged. Szpilman watches from his window, noticing smoke rising as a Panzerfaust rocket emerges from a lower window in a neighboring building. It fires, hitting the hospital as the city becomes engulfed in flames. The firing wanes, with sporadic shots and isolated explosions. Szpilman lies on his bed, staring at the ceiling, with the Schutzpolizei building reduced to ashes. A horse-drawn cab rounds the corner, clattering down the street before vanishing from view. Beneath him, a man and woman walk with their hands up, followed by a German soldier with a rifle. As they begin to flee, the woman is shot and collapses awkwardly on the street. Szpilman watches in shock as he hears voices, shouts, and footsteps outside his door. He listens intently, hearing footsteps descend stairs amidst shouts. A German Captain appears, studying Szpilman briefly, nods, and instructs him to follow. Szpilman picks up a tin and follows the Captain through a damaged double door into a room with a broken table that used to be a dining room.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Three youthful Poles transport long items wrapped in newspaper. One man checks his watch, kneels, and places the parcel he's transporting to his shoulder, revealing the barrel of a submachine gun as it starts firing. His two companions do the same, aiming at the Schutzpolizei structure, hitting the sentry who falls in front of his box. Suddenly, gunfire resonates throughout the city. Pedestrians disperse, except for an elderly man with a walking cane, who manages to enter a structure. Rifle and machine-gun fire burst from the Schutzpolizei structure, and the three youthful Poles maneuver to a corner opposite it, tossing grenades inside. A battle ensues as the Germans counterattack from the hospital, with grenades and machine-gun fire exchanged. Szpilman watches from his window, noticing smoke rising as a Panzerfaust missile emerges from a lower window in a neighboring structure. It fires, hitting the hospital as the city becomes engulfed in flames. The firing decreases, with sporadic shots and isolated explosions. Szpilman lies on his bed, staring at the ceiling, with the Schutzpolizei structure reduced to ashes. A horse-drawn carriage rounds the corner, clattering down the street before vanishing from view. Beneath him, a man and woman walk with their hands up, followed by a German soldier with a rifle. As they begin to flee, the woman is shot and collapses awkwardly on the street. Szpilman watches in shock as he hears voices, shouts, and footsteps outside his door. He listens intently, hearing footsteps descend stairs amidst shouts. A German Captain appears, studying Szpilman briefly, nods, and instructs him to follow. Szpilman picks up a tin and follows the Captain through a damaged double door into a chamber with a broken table that used to be a dining room."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Long objects wrapped in newspaper are carried by three young Poles. His watch is checked by one man, who kneels and places the package he is carrying to his shoulder, and the barrel of a machine gun is revealed as it begins firing. The same is done by his two companions, targeting the Schutzpolizei building and hitting the sentry who falls in front of his box. Suddenly, the city is filled with echoing gunfire. Pedestrians scatter, except for an old man with a walking stick, who manages to enter a building. From the Schutzpolizei building, rifle and machine-gun fire erupt, and to a corner opposite it, the three young Poles maneuver, tossing grenades inside. A battle ensues as the hospital is retaliated against by the Germans, with grenades and machine-gun fire exchanged. From his window, Szpilman watches, noticing smoke rise as a Panzerfaust rocket emerges from a lower window in a neighboring building. It hits the hospital as the city is engulfed in flames after being fired. The firing wanes, with sporadic shots and isolated explosions. On his bed lies Szpilman, staring at the ceiling, with the Schutzpolizei building reduced to ashes. The corner is rounded by a horse-drawn cab, clattering down the street before vanishing from view. Beneath him, a man and woman walk with their hands up, followed by a German soldier with a rifle. As they begin to flee, a shot is fired at the woman, and she collapses awkwardly on the street. In shock, Szpilman watches as voices, shouts, and footsteps are heard outside his door. He listens intently, hearing stairs being descended by footsteps amidst shouts. Appearing is a German Captain, who briefly studies Szpilman, nods, and instructs him to follow. A tin is picked up by Szpilman, who follows the Captain through a damaged double door into a room where a broken table, which used to be a dining room, remains."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Three young Poles carry long objects wrapped in newspaper. One checks his watch, kneels, and reveals a machine gun barrel, firing it. His companions follow, targeting the Schutzpolizei building and hitting the sentry who collapses. Gunfire echoes, scattering pedestrians, except an old man with a stick who enters a building. Schutzpolizei returns fire; the Poles retreat to a corner, tossing grenades inside. A battle ensues, Germans retaliate from the hospital, exchanging grenades and fire. Szpilman watches smoke and a Panzerfaust rocket hit the hospital, setting the city ablaze. Sporadic shots and explosions persist. Szpilman lies on his bed, the Schutzpolizei building in ashes. A horse-drawn cab clatters down the street, vanishing. Below, a couple with hands up follows a German soldier. As they flee, the woman is shot and collapses. Szpilman hears voices and shouts, then footsteps descending stairs. A German Captain appears, nods, and tells him to follow. Szpilman picks up a tin, following the Captain through a damaged door into a room with a broken table once a dining room."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Three young Poles carry long, newspaper-wrapped items. One checks his watch, kneels, and shoulders a machine gun, opening fire. His companions follow, targeting the Schutzpolizei building and hitting a sentry. Gunfire echoes; pedestrians scatter, except an old man with a walking stick. Rifle and machine-gun fire erupt from Schutzpolizei; the Poles throw grenades inside. Germans retaliate from the hospital. Szpilman observes from his window, seeing smoke as a Panzerfaust rockets into the hospital, setting the city aflame. Sporadic shots and explosions continue. Szpilman lies on his bed, a horse-drawn cab vanishes around a corner. Below, a couple flees; the woman is shot. Szpilman listens to shouts and footsteps. A German Captain nods at him to follow through a damaged door into a ruined dining room."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Three young men from Poland can be seen carrying long objects, carefully wrapped up in layers of newspaper. As they move purposefully, one of the men takes a moment to glance at his watch. Without hesitation, he kneels down and skillfully positions the package he's been carrying against his shoulder. Suddenly, the package reveals itself to be a machine gun, and it begins its relentless firing. Meanwhile, his two companions swiftly mimic his actions, directing their fire towards the Schutzpolizei building. Their aim is true as they strike down the sentry, who crumples to the ground in front of his guard box. Almost instantaneously, the sharp sound of gunfire reverberates throughout the city, causing chaos. Pedestrians scatter in a frenzy, seeking safety wherever they can, except for one old man, who, despite the chaos, manages to find refuge within a nearby building with the aid of his walking stick. \n\nThe Schutzpolizei building erupts with a fierce barrage of rifle and machine-gun fire, as the three young Poles nimbly maneuver to a safer spot, finding cover at a corner opposite the hostile building. From there, they audaciously toss grenades through the windows. A fierce battle erupts as the German forces retaliate from the nearby hospital, creating an intense crossfire of grenades and machine-gun bursts. From his vantage point, Szpilman witnesses the unfolding chaos through his window; smoke begins to ascend ominously as a Panzerfaust rocket is fired from a lower window in an adjacent building. The rocket finds its mark, striking the hospital, and soon the entire cityscape is engulfed in flames. \n\nThe intensity of the firing gradually diminishes, leaving behind sporadic gunshots and isolated explosions that punctuate the air. Szpilman finds himself lying on his bed, his gaze fixed on the ceiling, while the Schutzpolizei building smolders, reduced to mere ashes. Outside, a horse-drawn cab makes its way around the corner, its wheels clattering down the cobblestone street before disappearing from his view. Directly beneath him, a man and a woman walk with their hands held high, trailed by a German soldier who keeps a watchful eye, his rifle ready. As they attempt to flee, the woman is tragically shot, collapsing with a jarring thud onto the street. \n\nSzpilman watches in utter shock, his senses heightened by the sound of voices, urgent shouts, and hurried footsteps just outside his door. He listens intently, discerning the sounds of footsteps descending the staircase amidst the clamor of shouts. Suddenly, a German Captain enters, pausing to study Szpilman briefly. With a nod, the Captain signals for Szpilman to follow him. Szpilman, without wasting a moment, picks up a tin and trails the Captain, moving through a damaged double door into a room that once served as a dining room, now marked by a broken table lying in disarray."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Three young men, hailing from Poland, are clearly visible as they carry elongated items, meticulously wrapped in multiple layers of newspaper for added discretion and protection. As they stride with evident purpose and determination, one of the men momentarily pauses to glance down at his wrist, checking the time on his watch. Without any delay or sign of hesitation, he kneels down with practiced ease and carefully positions the package he has been shouldering. With deft movements, the package suddenly reveals its true nature—a machine gun—and immediately, it unleashes its relentless volley of gunfire. In perfect synchrony, his two companions quickly emulate his actions, directing their lethal firepower toward the imposing Schutzpolizei building. Their aim is precise and deadly, striking down the sentry who collapses to the ground in front of his guard post. Almost immediately, the sharp and penetrating sound of gunfire echoes throughout the city, creating an atmosphere of chaos and panic. Pedestrians, thrown into a state of alarm, disperse frantically in search of safety wherever possible, with the exception of one old man. Despite the unfolding chaos, he manages to find refuge inside a nearby building, aided by his trusty walking stick.\n\nThe Schutzpolizei building suddenly comes alive with a fierce and unyielding barrage of rifle and machine-gun fire, as the three young Polish men skillfully maneuver to a more secure location, finding cover at a strategically positioned corner directly opposite the hostile building. From this vantage point, they audaciously hurl grenades through the windows. A brutal exchange ensues when German forces, positioned in the nearby hospital, retaliate with intensity, creating an intense crossfire of grenades and machine-gun bursts. Observing the unfolding turmoil through his window is Szpilman, who witnesses the rising smoke as a Panzerfaust rocket is fired from a lower window in a nearby building. The rocket finds its target with precision, striking the hospital, and soon, the entire cityscape is engulfed in roaring flames.\n\nThe intensity and ferocity of the firing gradually subside, leaving behind only sporadic gunshots and isolated explosions that disrupt the tense air. Szpilman finds himself lying on his bed, his unblinking gaze fixed on the ceiling above, while the Schutzpolizei building smolders, reduced to little more than smoldering ashes. Outside, a horse-drawn cab slowly makes its way around the corner, its wheels clattering noisily on the cobblestone street, before vanishing from Szpilman's view. Directly beneath him, a man and a woman walk with their hands raised high in surrender, pursued by a vigilant German soldier who keeps a watchful gaze, his rifle poised for action. As they endeavor to escape, tragedy strikes—the woman is mercilessly shot, collapsing with a horrendous and jarring thud onto the unforgiving street.\n\nSzpilman watches in absolute shock and disbelief, his senses acutely heightened by the mingling sounds of urgent voices, frantic shouts, and the hurried pounding of footsteps just outside his door. He listens intently, discerning the distinctive sounds of footsteps descending the staircase amidst the clamor of raised voices. Suddenly, a German Captain bursts in, pausing momentarily to scrutinize Szpilman with a penetrating gaze. With a curt nod, the Captain motions for Szpilman to follow him. Szpilman, wasting no time, hurriedly grabs a tin and follows closely behind the Captain, moving swiftly through a damaged double door into a room that once served as an elegant dining room, now marked by a broken table lying in complete disarray."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Three young Poles move with determined precision, each clutching long objects carefully wrapped in layers of newspaper to conceal their contents. As they walk with purpose through the streets, one of the men pauses, pulling back his sleeve to glance at his watch, ensuring they are right on schedule. He then lowers himself onto one knee, bringing his package down in a smooth motion to rest it securely on his shoulder. With a deliberate motion, he unwraps part of the package, revealing the unmistakable barrel of a machine gun. Without hesitation, the gun springs to life, emitting a rapid succession of gunfire. His companions, mirroring his actions, swiftly follow suit. They each kneel, unwrap their packages, and align the exposed barrels towards the Schutzpolizei building, releasing a barrage of bullets. Their aim is true, striking the sentry, who collapses unceremoniously in front of his post. As the sound of gunfire reverberates through the city, its intensity causes pedestrians to scatter in fear, desperately seeking cover. Among them, an old man with a walking stick moves with surprising agility, managing to find refuge inside a nearby building. The Schutzpolizei building erupts with retaliatory rifle and machine-gun fire, forcing the three young Poles to regroup. They skillfully maneuver to a corner directly across from their target, where they prepare and hurl grenades through the windows. A fierce battle rages as the Germans, entrenched within the hospital, respond with their own bursts of grenades and machine-gun fire. Szpilman, observing from his window with a mix of horror and fascination, sees ominous plumes of smoke climbing skyward as a Panzerfaust rocket surges from a lower window of a neighboring building. It streaks across the air with a fiery trail, striking the hospital, which soon contributes to the thick, choking haze of flames engulfing the city. As the chaos unfolds, the initial thunderous exchange of gunfire subsides, giving way to sporadic shots and distant explosions echoing in the smoldering aftermath. Szpilman, lying on his bed, stares blankly at the ceiling, his mind absorbing the grim reality that the Schutzpolizei building has been reduced to a charred skeleton. In the eerie quiet, a horse-drawn cab rattles down the street, its wheels clattering against the pavement before it disappears, swallowed by the cityscape. Below, a man and a woman walk cautiously with their hands raised, a silent surrender as they are escorted by a German soldier brandishing a rifle. As the pair makes a desperate bid for escape, the soldier fires, and the woman crumples to the ground, her body landing awkwardly on the street. Szpilman watches, his shock paralyzing him, as voices, shouts, and hurried footsteps invade the air outside his door. He strains his ears to follow the sound of footsteps rapidly descending the stairs amidst the chaos of shouted orders. A German Captain suddenly materializes, taking a moment to assess Szpilman with a penetrating gaze. With a nod, the Captain tersely instructs Szpilman to accompany him. Szpilman grabs a tin, his heart pounding, and trails the Captain through the shattered remnants of a double door, leading him into a room that, despite its current state of disarray, once served as a dining room, with a table now reduced to splintered pieces."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Three young Poles carry long objects wrapped in newspaper. One checks his watch, kneels, and positions a package on his shoulder, revealing and firing a machine gun. His companions follow suit, targeting the Schutzpolizei building and hitting the sentry. Pedestrians scatter as gunfire echoes through the city, save for an old man who manages to enter a building. The three Poles maneuver to a corner opposite the building and toss grenades inside while under fire from the Schutzpolizei and the nearby hospital. Szpilman watches from his window as a Panzerfaust rocket hits the hospital and flames engulf the city. As the firing subsides to sporadic shots and explosions, Szpilman lies on his bed, staring at the ceiling as the Schutzpolizei building smolders. A horse-drawn cab clatters down the street and disappears. Below, a man and woman, hands raised, are pursued by a German soldier. When they try to flee, the woman is shot and collapses on the street. Szpilman watches in shock, hearing voices and footsteps outside his door. A German Captain appears, nods at Szpilman, and instructs him to follow. Szpilman picks up a tin and follows the Captain into a damaged dining room."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Three young Poles, members of a local resistance group fighting against the Nazi occupation, carry long objects wrapped in newspaper. One man checks his watch, kneels, and places the package he's carrying to his shoulder, revealing the barrel of a machine gun, a weapon often used by resistance fighters for its firepower, as it begins firing. His two companions do the same, targeting the Schutzpolizei building, a bastion of Nazi police forces, hitting the sentry who falls in front of his box. Suddenly, gunfire echoes throughout the city, a city that has seen numerous uprisings against its oppressors. Pedestrians scatter, except for an old man with a walking stick, a common sight in the streets lined with historical buildings, who manages to enter a building. Rifle and machine-gun fire erupt from the Schutzpolizei building, and the three young Poles maneuver to a corner opposite it, tossing grenades, a favored tactic in urban guerilla warfare, inside. A battle ensues as the Germans retaliate from the hospital, an unfortunate target now caught in the crossfire, with grenades and machine-gun fire exchanged. Szpilman, a renowned pianist forced into hiding due to the war, watches from his window, noticing smoke rising as a Panzerfaust rocket, a German anti-tank weapon, emerges from a lower window in a neighboring building. It fires, hitting the hospital as the city becomes engulfed in flames reminiscent of past battles. The firing wanes, with sporadic shots and isolated explosions. Szpilman lies on his bed, a symbol of his interrupted life, staring at the ceiling, with the Schutzpolizei building reduced to ashes, a victory momentarily gained. A horse-drawn cab, a rare but still-used mode of transport amidst the ruined infrastructure, rounds the corner, clattering down the street before vanishing from view. Beneath him, a man and woman walk with their hands up, a sign of surrender or compliance often ignored in the chaos, followed by a German soldier with a rifle. As they begin to flee, the woman is shot and collapses awkwardly on the street, a tragic yet frequent event in these turbulent times. Szpilman watches in shock as he hears voices, shouts, and footsteps outside his door, each sound a potential threat or hope for release. He listens intently, hearing footsteps descend stairs amidst shouts. A German Captain, part of the occupying forces' hierarchy, appears, studying Szpilman briefly, nods, and instructs him to follow. Szpilman picks up a tin, possibly containing precious food or personal valuables, and follows the Captain through a damaged double door into a room with a broken table that used to be a dining room, once a place of warmth now shattered by war."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Szpilman picks up a tin and follows the Captain through a damaged double door into a room with a broken table that used to be a dining room Three young Poles carry long objects wrapped in newspaper His two companions do the same targeting the Schutzpolizei building hitting the sentry who falls in front of his box Szpilman watches from his window noticing smoke rising as a Panzerfaust rocket emerges from a lower window in a neighboring building One man checks his watch kneels and places the package he is carrying to his shoulder revealing the barrel of a machine gun as it begins firing Suddenly gunfire echoes throughout the city A horsedrawn cab rounds the corner clattering down the street before vanishing from view One man checks his watch kneels and places the package he is carrying to his shoulder revealing the barrel of a machine gun as it begins firing His two companions do the same targeting the Schutzpolizei building hitting the sentry who falls in front of his box Suddenly gunfire echoes throughout the city Pedestrians scatter except for an old man with a walking stick who manages to enter a building Rifle and machinegun fire erupt from the Schutzpolizei building and the three young Poles maneuver to a corner opposite it tossing grenades inside A battle ensues as the Germans retaliate from the hospital with grenades and machinegun fire exchanged Szpilman watches from his window noticing smoke rising as a Panzerfaust rocket emerges from a lower window in a neighboring building It fires hitting the hospital as the city becomes engulfed in flames The firing wanes with sporadic shots and isolated explosions Szpilman lies on his bed staring at the ceiling with the Schutzpolizei building reduced to ashes Szpilman lies on his bed staring at the ceiling with the Schutzpolizei building reduced to ashes A horsedrawn cab rounds the corner clattering down the street before vanishing from view A German Captain appears studying It fires hitting the hospital as the city becomes engulfed in flames Beneath him a man and woman walk with their hands up followed by a German soldier with a rifle As they begin to flee the woman is shot and collapses awkwardly on the street Szpilman watches in shock as he hears voices shouts and footsteps outside his door He listens intently hearing footsteps descend stairs amidst shouts A German Captain appears studying Three young Poles carry long objects wrapped in newspaper Szpilman briefly nods and instructs him to follow Szpilman picks up a tin and follows the Captain through a damaged double door into a room with a broken table that used to be a dining room"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Three young Poles carry long objects wrapped in newspaper. One man checks his watch kneels and places the package he is carrying to his shoulder revealing the barrel of a machine gun as it begins firing. His two companions do the same targeting the Schutzpolizei building hitting the sentry who falls in front of his box. Suddenly gunfire echoes throughout the city. Pedestrians scatter except for an old man with a walking stick who manages to enter a building. Rifle and machinegun fire erupt from the Schutzpolizei building and the three young Poles maneuver to a corner opposite it tossing grenades inside. A battle ensues as the Germans retaliate from the hospital with grenades and machinegun fire exchanged. Szpilman watches from his window noticing smoke rising as a Panzerfaust rocket emerges from a lower window in a neighboring building. It fires hitting the hospital as the city becomes engulfed in flames. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. The firing wanes with sporadic shots and isolated explosions. Szpilman lies on his bed staring at the ceiling with the Schutzpolizei building reduced to ashes. A horsedrawn cab rounds the corner clattering down the street before vanishing from view. Beneath him a man and woman walk with their hands up followed by a German soldier with a rifle. As they begin to flee the woman is shot and collapses awkwardly on the street. Szpilman watches in shock as he hears voices shouts and footsteps outside his door. He listens intently hearing footsteps descend stairs amidst shouts. A German Captain appears studying. Szpilman briefly nods and instructs him to follow. Szpilman picks up a tin and follows the Captain through a damaged double door into a room with a broken table that used to be a dining room."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Three young Poles carry long objects wrapped in newspaper. One man checks his watch kneels and places the package he is carrying to his shoulder revealing the barrel of a machine gun as it begins firing. His two companions do the same targeting the Schutzpolizei building hitting the sentry who falls in front of his box. Suddenly gunfire echoes throughout the city. Pedestrians scatter except for an old man with a walking stick who manages to enter a building. Rifle and machinegun fire erupt from the Schutzpolizei building and the three young Poles maneuver to a corner opposite it tossing grenades inside. A battle ensues as the Germans retaliate from the hospital with grenades and machinegun fire exchanged. Szpilman watches from his window noticing smoke rising as a Panzerfaust rocket emerges from a lower window in a neighboring building. It fires hitting the hospital as the city becomes engulfed in flames. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. The firing wanes with sporadic shots and isolated explosions. Szpilman lies on his bed staring at the ceiling with the Schutzpolizei building reduced to ashes. A horsedrawn cab rounds the corner clattering down the street before vanishing from view. Beneath him a man and woman walk with their hands up followed by a German soldier with a rifle. As they begin to flee the woman is shot and collapses awkwardly on the street. Szpilman watches in shock as he hears voices shouts and footsteps outside his door. He listens intently hearing footsteps descend stairs amidst shouts. A German Captain appears studying. Szpilman briefly nods and instructs him to follow. Szpilman picks up a tin and follows the Captain through a damaged double door into a room with a broken table that used to be a dining room."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Three young Poles carry long objects wrapped in newspaper. One man checks his watch kneels and places the package he is carrying to his shoulder revealing the barrel of a machine gun as it begins firing. His two companions do the same targeting the Schutzpolizei building hitting the sentry who falls in front of his box. Suddenly gunfire echoes throughout the city. Pedestrians scatter except for an old man with a walking stick who manages to enter a building. Szpilman watches in shock as he hears voices shouts and footsteps outside his door. He listens intently hearing footsteps descend stairs amidst shouts. A German Captain appears studying. Szpilman briefly nods and instructs him to follow. Szpilman picks up a tin and follows the Captain through a damaged double door into a room with a broken table that used to be a dining room."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Three young Poles carry long objects wrapped in newspaper. One man checks his watch kneels and places the package he is carrying to his shoulder revealing the barrel of a machine gun as it begins firing. Szpilman briefly nods and instructs him to follow. Szpilman picks up a tin and follows the Captain through a damaged double door into a room with a broken table that used to be a dining room."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Three young penguins carry long objects wrapped in newspaper. A rabbit checks his watch, kneels, and places the package he's carrying to his shoulder, revealing the barrel of a machine gun as it begins firing. His two companions do the same, targeting the Schutzpolizei building, hitting the sentry who falls in front of his box. Suddenly, gunfire echoes throughout the city. Pedestrians scatter, except for a squirrel with a walking stick, who manages to enter a building. Rifle and machine-gun fire erupt from the Schutzpolizei building, and the three young penguins maneuver to a corner opposite it, tossing grenades inside. A battle ensues as the dolphins retaliate from the hospital, with grenades and machine-gun fire exchanged. A giraffe watches from his window, noticing smoke rising as a Panzerfaust rocket emerges from a lower window in a neighboring building. It fires, hitting the hospital as the city becomes engulfed in flames. The firing wanes, with sporadic shots and isolated explosions. The giraffe lies on his bed, staring at the ceiling, with the Schutzpolizei building reduced to ashes. A horse-drawn cab rounds the corner, clattering down the street before vanishing from view. Beneath him, a cat and a mouse walk with their hands up, followed by a bear soldier with a rifle. As they begin to flee, the mouse is shot and collapses awkwardly on the street. The giraffe watches in shock as he hears voices, shouts, and footsteps outside his door. He listens intently, hearing footsteps descend stairs amidst shouts. A tiger Captain appears, studying the giraffe briefly, nods, and instructs him to follow. The giraffe picks up a tin and follows the Captain through a damaged double door into a room with a broken table that used to be a dining room."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Three young Poles carry long objects wrapped in fabric. One man checks his phone, kneels, and places the bundle he's carrying to his shoulder, revealing the barrel of a cannon as it begins firing. His two companions do the same, targeting the town hall, hitting the sentry who falls in front of his crate. Suddenly, gunfire echoes throughout the village. Pedestrians scatter, except for an old man with a cane, who manages to enter a shop. Slingshot and cannon fire erupt from the town hall, and the three young Poles maneuver to a corner opposite it, tossing firecrackers inside. A battle ensues as the Germans retaliate from the library, with firecrackers and cannon fire exchanged. Szpilman watches from his window, noticing smoke rising as a catapult stone emerges from a lower window in a neighboring building. It fires, hitting the library as the village becomes engulfed in flames. The firing wanes, with sporadic shots and isolated explosions. Szpilman lies on his bed, staring at the ceiling, with the town hall reduced to ashes. A bicycle rounds the corner, clattering down the street before vanishing from view. Beneath him, a man and woman walk with their hands up, followed by a German soldier with a slingshot. As they begin to flee, the woman is shot and collapses awkwardly on the sidewalk. Szpilman watches in shock as he hears voices, shouts, and footsteps outside his window. He listens intently, hearing footsteps descend stairs amidst shouts. A German General appears, studying Szpilman briefly, nods, and instructs him to follow. Szpilman picks up a book and follows the General through a damaged curtain into a room with a broken chair that used to be a living room."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Three young Poles lift long objects wrapped in newspaper. One man glances at his watch, sits down, and balances the package he's carrying on his shoulder, revealing the barrel of a machine gun as it begins whirring. His two companions mimic him, aiming at the Schutzpolizei building, missing the sentry who stumbles in front of his box. Suddenly, sirens wail throughout the city. Pedestrians freeze, except for an old man with a walking stick, who manages to lean against a building. Rifle and machine-gun fire erupt from the Schutzpolizei building, and the three young Poles drift to a corner opposite it, rolling grenades inside. A commotion follows as the Germans respond from the hospital, with grenades and machine-gun noise exchanged. Szpilman observes from his window, noticing smoke rising as a Panzerfaust rocket descends from a lower window in a neighboring building. It launches, grazing the hospital as the city becomes overwhelmed in smoke. The noise dwindles, with sporadic thuds and distant explosions. Szpilman reclines on his bed, gazing at the ceiling, with the Schutzpolizei building transformed into debris. A horse-drawn cab turns the corner, rattling down the street before disappearing from view. Beneath him, a man and woman walk with their hands up, accompanied by a German soldier with a rifle. As they begin to dart away, the woman is struck and topples awkwardly on the street. Szpilman watches in disbelief as he hears murmurs, laughs, and footsteps outside his door. He listens closely, hearing footsteps climb stairs amidst cheers. A German Captain materializes, examining Szpilman briefly, nods, and signals him to join. Szpilman grabs a tin and trails the Captain through a battered double door into a room with a broken table that used to be a dining room."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Three young lanterns carry long shoelaces wrapped in calendar pages. One mailbox checks its chimney, kneels, and places the violin it's carrying to its shoulder, revealing the staple of an umbrella as it begins firing. Its two apples do the same, targeting the lighthouse, hitting the squirrel who falls in front of its teapot. Suddenly, popcorn echoes throughout the galaxy. Lollipops scatter, except for an old carpet with a skateboard, who manages to enter a suitcase. Tuba and saxophone music erupt from the lighthouse, and the three young lanterns maneuver to a corner opposite it, tossing pineapples inside. A battle ensues as the marshmallows retaliate from the hot air balloon, with pineapples and saxophone music exchanged. A watermelon watches from its faucet, noticing glitter rising as a pencil rocket emerges from a lower trumpet in a neighboring bookshelf. It fires, hitting the hot air balloon as the galaxy becomes engulfed in sprinkles. The music wanes, with sporadic notes and isolated bangs. The watermelon lies on its rug, staring at the chandelier, with the lighthouse reduced to sand. A balloon-drawn sled rounds the corner, clattering down the staircase before vanishing from view. Beneath it, a lamp and blanket walk with their hinges up, followed by a cupcake soldier with a clarinet. As they begin to flee, the blanket is shot and collapses awkwardly on the staircase. The watermelon watches in shock as it hears galaxies, whispers, and snowflakes outside its door. It listens intently, hearing snowflakes descend ladders amidst whispers. A cupcake Captain appears, studying the watermelon briefly, nods, and instructs it to follow. The watermelon picks up a spoon and follows the Captain through a damaged double curtain into a room with a broken sofa that used to be a kitchen."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Three young dolphins hoist long objects wrapped in newspaper. One dolphin glances at his watch, crouches, and balances the package he's hoisting on his shoulder, unveiling the end of a trumpet as it starts playing. His two companions mimic his action, directing the sound toward the Schutzpolizei building, startling the sentry who drops in front of his box. Suddenly, music reverberates throughout the city. Cats scatter, except for an old owl with a walking stick, who manages to enter a building. Flute and trumpet notes burst from the Schutzpolizei building, and the three young dolphins glide to a corner opposite it, tossing flowers inside. A concert ensues as the Germans respond from the hospital, with flowers and trumpet notes exchanged. Szpilman observes from his window, noticing music rising as a Panzerfaust rocket emerges from a lower window in a neighboring building. It sounds off, targeting the hospital as the city becomes engulfed in melody. The music fades, with sporadic notes and isolated melodies. Szpilman lies on his bed, staring at the ceiling, with the Schutzpolizei building reduced to silence. A horse-drawn cab rounds the corner, clattering down the street before vanishing from view. Beneath him, a lion and pelican stroll with their wings up, followed by a German conductor with a baton. As they begin to dance, the pelican is startled and stumbles awkwardly on the street. Szpilman watches in astonishment as he hears melodies, harmonies, and footsteps outside his door. He listens intently, hearing footsteps descend stairs amidst harmonies. A German Maestro appears, studying Szpilman briefly, nods, and instructs him to follow. Szpilman picks up a drum and follows the Maestro through a damaged double door into a room with a broken piano that used to be a dining room."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Three young Poles carry short items wrapped in cloth. One man glances at his phone, squats, and balances the item he's holding on his knee, revealing the handle of a shovel as it begins digging. His two companions mimic him, aiming at the bakery, striking the lamppost which tips over onto its base. Suddenly, barking echoes throughout the park. Cyclists dawdle, except for an old man with a cane, who manages to exit a café. Whistles and trumpet sounds erupt from the bakery, and the three young Poles tiptoe to a tree opposite it, tossing paper planes inside. A commotion unfolds as the bakers respond from the library, with paper planes and trumpet sounds exchanged. Szpilman observes from his balcony, noticing steam rising as a kite emerges from a lower window in a nearby residence. It flies, gliding into the library as the park becomes chaotic with leaves. The noise diminishes, with intermittent yells and random honks. Szpilman reclines on his couch, gazing at the ceiling, with the bakery reduced to rubble. A horse-drawn wagon navigates the park, jangling down the path before disappearing from view. Beneath him, a man and woman stroll with their umbrellas open, followed by a German soldier with a baton. As they start to twirl, the woman is tapped and collapses awkwardly on the path. Szpilman observes in disbelief as he hears whispers, murmurs, and footsteps beyond his door. He listens carefully, detecting footsteps descending stairs amidst murmurs. A German Captain enters, glancing at Szpilman briefly, nods, and instructs him to proceed. Szpilman grabs a jar and trails the Captain through a shattered revolving door into a chamber with a splintered chair that used to be a living room."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Three small rabbits transport short items encased in bubble wrap. One rabbit glances at its compass, crouches, and slides the bundle it's moving to its paw, uncovering the tip of a paintbrush as it begins sketching. Its two friends do similarly, aiming at the pet shop, striking the scarecrow who tumbles beside its barrel. Abruptly, laughter resonates throughout the village. Bicyclists converge, except for a young girl with a kite, who manages to hop into a carriage. Feather and splashy-water sounds burst from the pet shop, and the three small rabbits twist to a tree opposite it, flipping paddles inside. A circus unfolds as the clowns respond from the bakery, with paddles and splashes exchanged. Rufus observes from his porch, spotting steam rising as a bubble floats out from a lower branch in a nearby tree. It drifts, touching the bakery as the village becomes filled with confetti. The laughter fades, with trickle sounds and scattered giggles. Rufus reclines on his hammock, gazing at the sky, with the pet shop turned to dust. A goat-driven cart rounds the tree, jingling through the avenue before disappearing from sight. Beneath him, a child and dog stroll with their paws out, followed by a pilot with a telescope. As they start to sprint, the dog is winked at and crumples awkwardly on the path. Rufus observes in awe as he hears melodies, murmurs, and dances outside his hut. He listens closely, hearing dances ascend vines amidst murmurs. A French Artist appears, examining Rufus briefly, smiles, and gestures him to join. Rufus picks up a jar and accompanies the Artist through a cracked archway into a grove with a shattered fountain that used to be a tea garden."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Three young Poles carry long objects wrapped in newspaper. One checks his watch, kneels, and reveals a machine gun, firing on the Schutzpolizei building. His companions do the same, targeting the sentry. Gunfire echoes as pedestrians scatter; an old man with a cane escapes into a building. The Schutzpolizei retaliates with rifle and machine-gun fire, while grenades are exchanged. Szpilman observes from his window, seeing smoke as a Panzerfaust rocket hits the hospital, engulfing the city in flames. Firing diminishes to sporadic shots. Szpilman lies staring at the ceiling as the Schutzpolizei building burns. A horse-drawn cab clatters away, and a German soldier shoots a woman fleeing. Szpilman listens to voices and footsteps outside until a German Captain enters, nods at Szpilman, and instructs him to follow. Szpilman grabs a tin and trails the Captain through a damaged door into a room with a broken table, previously a dining room."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Szpilman picks up a tin and follows the Captain through a damaged double door into a room with a broken table that used to be a dining room Szpilman briefly nods and instructs him to follow A German Captain appears studying He listens intently hearing footsteps descend stairs amidst shouts Szpilman watches in shock as he hears voices shouts and footsteps outside his door As they begin to flee the woman is shot and collapses awkwardly on the street Beneath him a man and woman walk with their hands up followed by a German soldier with a rifle A horsedrawn cab rounds the corner clattering down the street before vanishing from view Szpilman lies on his bed staring at the ceiling with the Schutzpolizei building reduced to ashes The firing wanes with sporadic shots and isolated explosions It fires hitting the hospital as the city becomes engulfed in flames Szpilman watches from his window noticing smoke rising as a Panzerfaust rocket emerges from a lower window in a neighboring building A battle ensues as the Germans retaliate from the hospital with grenades and machinegun fire exchanged Rifle and machinegun fire erupt from the Schutzpolizei building and the three young Poles maneuver to a corner opposite it tossing grenades inside Pedestrians scatter except for an old man with a walking stick who manages to enter a building Suddenly gunfire echoes throughout the city His two companions do the same targeting the Schutzpolizei building hitting the sentry who falls in front of his box One man checks his watch kneels and places the package he is carrying to his shoulder revealing the barrel of a machine gun as it begins firing Three young Poles carry long objects wrapped in newspaper"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Szpilman watches in shock as he hears voices shouts and footsteps outside his door As they begin to flee the woman is shot and collapses awkwardly on the street Pedestrians scatter except for an old man with a walking stick who manages to enter a building The firing wanes with sporadic shots and isolated explosions Rifle and machinegun fire erupt from the Schutzpolizei building and the three young Poles maneuver to a corner opposite it tossing grenades inside He listens intently hearing footsteps descend stairs amidst shouts Szpilman briefly nods and instructs him to follow A battle ensues as the Germans retaliate from the hospital with grenades and machinegun fire exchanged Beneath him a man and woman walk with their hands up followed by a German soldier with a rifle A German Captain appears studying Szpilman lies on his bed staring at the ceiling with the Schutzpolizei building reduced to ashes One man checks his watch kneels and places the package he is carrying to his shoulder revealing the barrel of a machine gun as it begins firing A horsedrawn cab rounds the corner clattering down the street before vanishing from view His two companions do the same targeting the Schutzpolizei building hitting the sentry who falls in front of his box Szpilman picks up a tin and follows the Captain through a damaged double door into a room with a broken table that used to be a dining room Szpilman watches from his window noticing smoke rising as a Panzerfaust rocket emerges from a lower window in a neighboring building It fires hitting the hospital as the city becomes engulfed in flames Three young Poles carry long objects wrapped in newspaper Suddenly gunfire echoes throughout the city"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Szpilman lies on his bed staring at the ceiling with the Schutzpolizei building reduced to ashes A horsedrawn cab rounds the corner clattering down the street before vanishing from view Beneath him a man and woman walk with their hands up followed by a German soldier with a rifle As they begin to flee the woman is shot and collapses awkwardly on the street Szpilman watches in shock as he hears voices shouts and footsteps outside his door He listens intently hearing footsteps descend stairs amidst shouts A German Captain appears studying Szpilman briefly nods and instructs him to follow Szpilman picks up a tin and follows the Captain through a damaged double door into a room with a broken table that used to be a dining room Three young Poles carry long objects wrapped in newspaper One man checks his watch kneels and places the package he is carrying to his shoulder revealing the barrel of a machine gun as it begins firing His two companions do the same targeting the Schutzpolizei building hitting the sentry who falls in front of his box Suddenly gunfire echoes throughout the city Pedestrians scatter except for an old man with a walking stick who manages to enter a building Rifle and machinegun fire erupt from the Schutzpolizei building and the three young Poles maneuver to a corner opposite it tossing grenades inside A battle ensues as the Germans retaliate from the hospital with grenades and machinegun fire exchanged Szpilman watches from his window noticing smoke rising as a Panzerfaust rocket emerges from a lower window in a neighboring building It fires hitting the hospital as the city becomes engulfed in flames The firing wanes with sporadic shots and isolated explosions"
        }
      ]
    }
  ]
}