{
  "ground_truth": "Jeff is seated by the window in his wheelchair, looking out tensely. The camera moves in until his profile is in big close-up. From Jeff's viewpoint, all the windows and the salesman's apartment are dark. Suddenly, a match flares, and we see the salesman light a cigar, the flame briefly illuminating his face. The camera now faces Jeff as he talks in a low voice while keeping his eyes on the salesman's apartment; Lisa also speaks quietly. Behind Lisa, Sixth Avenue can be seen while she is on the phone. Jeff continues watching the salesman's apartment, puts the receiver down, and resumes his vigil. As the match dies out, only the glow of the cigar is visible. Jeff talks on the telephone, his eyes still on the neighborhood, as the camera pulls back slightly and Stella emerges from the kitchen with a breakfast tray. She squeezes past Jeff and places the tray on a window seat in front of him, with a touch of urgency in his voice as Stella peers cautiously toward Thorwald's apartment. She then retrieves the table, sets it across Jeff's lap, and places the breakfast tray on it, observing Thorwald's apartment once more. Jeff moves back slightly to avoid tangling the phone cable with the food and dishes and hangs up. The breakfast consists of eggs, bacon, toast, and coffee. Stella moves behind his chair, pausing again to look toward Thorwald's apartment. Jeff reaches for a knife and fork, lifting a piece of bacon to his lips, but hesitates when Stella speaks, then begins eating appreciatively. The bacon pauses near Jeff's mouth multiple times before he puts it back on the plate as his eyes move slightly to the left, and he just stares ahead. At Thorwald's apartment, with the shades up, we realize that the salesman is in his living room, lying out of sight on the sofa, as smoke from a newly lit cigar ascends to the ceiling. Meanwhile, the rope-tied trunk remains in the bedroom.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Jeff is positioned by the window in his wheelchair, peering out tensely. The camera progresses forward until his silhouette is in large close-up. From Jeff's perspective, all the windows and the salesman's flat are dark. Abruptly, a match ignites, and we observe the salesman ignite a cigar, the flame briefly illuminating his visage. The camera now confronts Jeff as he speaks in a muted voice while keeping his gaze on the salesman's flat; Lisa also converses softly. Behind Lisa, Sixth Avenue is visible while she is on the phone. Jeff continues observing the salesman's flat, sets the handset down, and resumes his watch. As the match expires, only the glow of the cigar is apparent. Jeff speaks on the telephone, his gaze still on the vicinity, as the camera withdraws slightly and Stella appears from the kitchen with a breakfast tray. She squeezes past Jeff and places the tray on a windowsill in front of him, with a trace of urgency in his voice as Stella peers cautiously toward Thorwald's flat. She then retrieves the table, sets it across Jeff's lap, and positions the breakfast tray on it, observing Thorwald's flat once more. Jeff moves back slightly to avoid entangling the phone cord with the meal and dishes and hangs up. The breakfast comprises eggs, bacon, toast, and coffee. Stella moves behind his chair, pausing again to glance toward Thorwald's flat. Jeff reaches for a knife and fork, lifting a slice of bacon to his lips, but hesitates when Stella speaks, then starts eating appreciatively. The bacon pauses near Jeff's mouth multiple times before he places it back on the plate as his gaze shifts slightly to the left, and he just stares ahead. At Thorwald's flat, with the shades up, we realize that the salesman is in his living room, reclining out of sight on the sofa, as smoke from a newly lit cigar ascends to the ceiling. Meanwhile, the rope-bound trunk remains in the bedroom."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Seated by the window in his wheelchair, Jeff is looked at tensely by himself. The camera is moved in until a big close-up of his profile is achieved. From the viewpoint of Jeff, all the windows and the salesman's apartment are seen as dark. Suddenly, a match is flared, and a cigar is lit by the salesman, his face being briefly illuminated by the flame. Jeff is now faced by the camera as he talks in a low voice while keeping his eyes on the salesman's apartment; Lisa quietly speaks too. Sixth Avenue is seen behind Lisa while she talks on the phone. The salesman's apartment is watched by Jeff, and the receiver is put down by him as he resumes his vigil. As the match dies out, the glow of the cigar is the only thing seen. The telephone is talked on by Jeff, his eyes still fixed on the neighborhood, as the camera is pulled back slightly, and Stella emerges from the kitchen with a breakfast tray. She squeezes past Jeff and the tray is placed by her on a window seat in front of him, with his voice touched with urgency as Stella peers cautiously toward Thorwald's apartment. The table is retrieved by her, set across Jeff's lap, and the breakfast tray is placed on it, observing Thorwald's apartment once more. Slightly moving back to avoid tangling the phone cable with the food and dishes, Jeff hangs up. Eggs, bacon, toast, and coffee are the components of the breakfast. Stella moves behind his chair, pausing again to look toward Thorwald's apartment. A knife and fork are reached for by Jeff, and a piece of bacon is lifted to his lips, but hesitation occurs when Stella speaks, then eating appreciatively begins. Near Jeff's mouth, the bacon is paused multiple times before it is put back on the plate as his eyes move slightly to the left, and just ahead is stared at by him. In Thorwald's apartment, with the shades up, it is realized that the salesman lies out of sight on the sofa in his living room, as smoke from a newly lit cigar ascends to the ceiling. Meanwhile, a rope-tied trunk remains in the bedroom."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Jeff sits tensely in his wheelchair by the window, watching. The camera zooms in on his profile. From his viewpoint, all windows and the salesman's apartment are dark. Suddenly, a match flares, revealing the salesman lighting a cigar. Jeff and Lisa talk softly while Jeff keeps his eyes on the apartment. Sixth Avenue is visible as Lisa uses the phone. Jeff puts down the phone and continues his watch. The match dies, leaving only the cigar's glow. As Jeff watches the neighborhood, the camera pulls back, showing Stella emerging with a breakfast tray. She squeezes past Jeff, setting the tray on the window seat, and peers at Thorwald's apartment. Stella sets the table across Jeff's lap with breakfast—eggs, bacon, toast, and coffee. She pauses to look at Thorwald's apartment again. Jeff avoids tangling the phone cable with the dishes and hangs up. He hesitates to eat as Stella speaks but then begins eating appreciatively, pausing as he notices something. Thorwald's shades are up, revealing the salesman lying out of sight on the sofa, with cigar smoke rising. The rope-tied trunk remains in the bedroom."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Jeff, in a wheelchair by the window, looks out tensely. A close-up shows his profile. From Jeff's viewpoint, the windows and the salesman's apartment are dark. A match flares, revealing the salesman lighting a cigar. Jeff speaks quietly, watching the apartment, while Lisa talks on the phone with Sixth Avenue visible behind her. As the match dies, only the cigar's glow remains. Jeff uses the phone, eyes fixed on the neighborhood. The camera pulls back as Stella enters with a breakfast tray, placing it urgently on a window seat. She sets it on Jeff's lap, observing Thorwald's apartment. Jeff avoids the phone cable, hangs up, and starts eating eggs, bacon, toast, and coffee. Stella pauses, peering toward Thorwald's apartment. Jeff reaches for bacon, hesitates when Stella speaks, then eats. The bacon pauses near his mouth as he stares ahead. Thorwald’s shades are up, smoke from a new cigar ascends, and the rope-tied trunk is still in the bedroom."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Jeff is seated by the window in his wheelchair, gazing intently outside with a tense expression on his face. The camera slowly moves in closer, drawing our attention until his profile fills the screen in a dramatic big close-up. From Jeff's perspective, all the windows in the surrounding area and the salesman's apartment are shrouded in darkness. Suddenly, a match is struck, its flame suddenly flaring up, revealing just enough for us to see the salesman as he lights a cigar, the brief flicker of the flame casting his face into clarity for a moment. The camera now shifts its focus to face Jeff directly as he speaks in a low, almost hushed voice, maintaining his vigilant gaze on the salesman's apartment across the way. Lisa, standing nearby, also speaks softly. Behind Lisa, the bustling activity of Sixth Avenue is visible, an energetic backdrop to the quiet tension as she converses on the telephone. Throughout, Jeff does not divert his gaze from the salesman's apartment, eventually setting the receiver aside and resuming his watchful vigil. As the match's light fades, only the faint, enduring glow of the cigar remains visible in the dimness. Jeff continues his telephone conversation, eyes remaining fixed on the neighborhood outside, as the camera pulls back slightly to reveal Stella, who emerges from the kitchen, carrying a breakfast tray. She navigates her way past Jeff with careful precision and places the tray on the window seat in front of him, while an undercurrent of urgency colors Jeff’s voice as Stella peers cautiously toward Thorwald's apartment. Stella then retrieves a table, setting it across Jeff’s lap before positioning the breakfast tray on it, once more casting a watchful eye toward Thorwald's apartment. Jeff slightly adjusts his position to prevent the phone cable from becoming entangled with the food and dishes, and subsequently hangs up the phone. The breakfast spread consists of eggs, bacon, toast, and a steaming cup of coffee. Stella moves to stand behind his chair, pausing yet again to look toward Thorwald's apartment. Jeff, ready to commence his meal, reaches for his knife and fork, lifting a piece of bacon to his lips, but momentarily hesitates when Stella speaks, then resumes eating with appreciable enjoyment. The piece of bacon pauses near his mouth several times before he reluctantly places it back on the plate as his eyes shift slightly to the left, and he becomes fixated ahead. At Thorwald's apartment, with the shades now drawn up, we come to understand that the salesman is situated in his living room, reclining out of sight on the sofa, while spirals of smoke from a newly lit cigar rise languidly toward the ceiling. Meanwhile, the rope-tied trunk remains conspicuously in the bedroom, its presence a silent witness to the unfolding scene."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Jeff, comfortably seated by the window in his wheelchair, was gazing out with an intense, focused expression etched onto his face. As the camera began its gradual advance, moving steadily closer, it directed our attention to him until eventually, his entire profile filled the screen in a dramatic and engaging big close-up. From Jeff's point of view, all the windows in the nearby vicinity and the apartment belonging to the salesman were enveloped in an opaque darkness. In an unexpected moment, a match was struck, causing its flame to flare up instantaneously, providing just enough illumination for us to catch sight of the salesman as he lit a cigar, the fleeting flicker of the flame briefly highlighting his face with clarity. The camera then shifted in its focus, turning to capture Jeff directly as he began to speak in a low, almost hushed tone, maintaining his vigilant watch over the salesman's apartment across the way. Lisa, who was standing nearby, also spoke in a soft voice. Behind Lisa, the constant, bustling activity of Sixth Avenue served as an energetic yet contrasting backdrop to the quiet tension in the room as she continued her telephone conversation. Throughout, Jeff's gaze did not waver from the salesman's apartment; after a moment, he carefully set the phone receiver aside and resumed his watchful vigil. As the match's light eventually waned, only the faint and enduring glow of the cigar remained visible amidst the dimness. Jeff continued with his telephone conversation, his eyes steadfastly fixed on the neighborhood outside, while the camera pulled back just slightly to reveal Stella, emerging gracefully from the kitchen, carrying a breakfast tray with practiced ease. She moved past Jeff with careful precision, placing the tray down on the window seat in front of him, an undercurrent of urgency coloring Jeff’s voice as Stella cast a cautious glance toward Thorwald's apartment. Stella then retrieved a small table and thoughtfully set it across Jeff’s lap before positioning the breakfast tray on it once more, her gaze inevitably drawn toward Thorwald's apartment. Jeff made a slight adjustment to his position to ensure that the phone cable would not become entangled with the food and dishes, and with that done, he hung up the phone. The enticing breakfast spread was made up of delicious eggs, crispy bacon, warm toast, and a steaming cup of aromatic coffee. Stella moved to stand behind his chair, pausing once again to peer toward Thorwald's apartment with concern. Jeff, now ready to begin his meal, reached for his knife and fork, lifting a piece of bacon to his lips, yet he hesitated momentarily when Stella spoke, before resuming his meal with a clear sense of enjoyment. The piece of bacon paused near his mouth several times before he reluctantly placed it back on the plate as his eyes shifted slightly to the left, becoming fixated on a point in the distance. In Thorwald's apartment, where the shades had now been drawn up, it became evident that the salesman was situated in his living room, reclining out of sight on the sofa, while languid spirals of smoke from a newly lit cigar rose gently toward the ceiling. Meanwhile, in the bedroom, the conspicuously rope-tied trunk remained, standing as a silent witness to the unfolding scene."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Jeff is seated by the window in his wheelchair, his posture tense as he gazes intently out of the window, a sense of anticipation etched on his face. The camera subtly moves closer, gradually narrowing in until his profile dominates the frame in an intimate big close-up. From Jeff's perspective, all the windows of the salesman's apartment are shrouded in darkness, creating an air of mystery. Suddenly, a tiny spark appears as a match flares to life, and in its brief illumination, we catch a glimpse of the salesman lighting a cigar, the flame briefly casting light on his features before the darkness reclaims them. The camera then shifts focus to capture Jeff's face as he speaks in a hushed tone, his gaze never wavering from the salesman's apartment. Beside him, Lisa responds quietly, contributing to the muted exchange. Behind Lisa, the bustling activity of Sixth Avenue is visible through the window as she holds the phone receiver to her ear, engaging in a low-voiced conversation. Jeff, unwavering in his watchfulness over the salesman's apartment, eventually places the receiver down, resuming his vigil with renewed focus. As the match burns out, leaving only the faint glow of the cigar in view, Jeff picks up the phone again, maintaining his prompt commentary while keeping a watchful eye on the neighborhood. The scene gently shifts as the camera pulls back slightly, capturing Stella's entrance from the kitchen as she carries a breakfast tray with her. With a careful squeeze past Jeff, she sets the tray onto the window seat before him, urgency laced in her voice as she casts a cautious glance toward Thorwald's apartment. She quickly retrieves a small table, positioning it across Jeff's lap before placing the breakfast tray atop it, her eyes darting back toward Thorwald's apartment. Jeff subtly adjusts his position, shifting backward to ensure the phone cable doesn't entangle with the food and dishes as he hangs up the phone. The breakfast array before Jeff is a simple yet inviting assortment of eggs, bacon, toast, and coffee. Stella moves behind his chair, hesitating momentarily to peer toward Thorwald's apartment once more. As Jeff reaches for a knife and fork, he carefully lifts a piece of bacon to his lips, only to pause mid-motion as Stella speaks, prompting him to listen before he begins to eat with an appreciative demeanor. The bacon hovers near his mouth several times, each time stopping short before being returned to the plate as his gaze subtly shifts to the left, ultimately fixing straight ahead in focused contemplation. At this point, with the shades of Thorwald's apartment drawn up, the realization dawns that the salesman is positioned in his living room, though out of sight as he reclines on the sofa, while tendrils of smoke from his freshly lit cigar curl languidly toward the ceiling. Meanwhile, the scene maintains its air of intrigue as the rope-tied trunk remains conspicuously in the bedroom, adding an element of suspense to the unfolding events."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Jeff sits tensely by the window in his wheelchair, watching the dark windows of the salesman's apartment. The camera zooms in on his profile until a match flares, briefly illuminating the salesman's face as he lights a cigar. Jeff and Lisa speak quietly, with Lisa on the phone and Sixth Avenue visible behind her. Jeff, staying vigilant, puts the phone down as the cigar's glow persists. As he continues his observation, Stella enters from the kitchen with a breakfast tray, maneuvering around Jeff to place it on a window seat. She then sets up a table across his lap, placing the tray with urgency as she glances toward Thorwald's apartment. Jeff adjusts, avoiding the phone cable while Stella checks Thorwald's apartment again. The breakfast includes eggs, bacon, toast, and coffee. Jeff starts to eat but hesitates as Stella speaks, finally eating with appreciation. His gaze shifts slightly as he pauses midway with a piece of bacon before noticing the salesman lying out of sight on the sofa with smoke rising from a cigar in Thorwald's apartment, where a rope-tied trunk remains in the bedroom."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Jeff is seated by the window in his wheelchair, a result of a recent accident that has temporarily limited his mobility, looking out tensely. The camera moves in until his profile is in big close-up. From Jeff's viewpoint, all the windows and the salesman's apartment, located in a bustling New York City neighborhood known for its lively atmosphere, are dark. Suddenly, a match flares, and we see the salesman light a cigar, a brand typically enjoyed by aficionados for its rich aroma, the flame briefly illuminating his face. The camera now faces Jeff as he talks in a low voice while keeping his eyes on the salesman's apartment; Lisa, who is Jeff’s girlfriend and a fashion consultant known in the city's elite circles, also speaks quietly. Behind Lisa, the well-known shopping and cultural hub, Sixth Avenue, can be seen while she is on the phone. Jeff continues watching the salesman's apartment, puts the receiver down, and resumes his vigil. As the match dies out, only the glow of the cigar is visible. Jeff talks on the telephone, his eyes still on the neighborhood, as the camera pulls back slightly and Stella, his attentive home nurse who has a keen interest in amateur sleuthing, emerges from the kitchen with a breakfast tray. She squeezes past Jeff and places the tray on a window seat in front of him, with a touch of urgency in his voice as Stella peers cautiously toward Thorwald's apartment. Lars Thorwald, the salesman, has been the subject of Jeff's growing suspicions. She then retrieves the table, sets it across Jeff's lap, and places the breakfast tray on it, observing Thorwald's apartment once more. Jeff moves back slightly to avoid tangling the phone cable with the food and dishes and hangs up. The breakfast consists of eggs, bacon, toast, and coffee, a typical American breakfast that provides energy for the day ahead. Stella moves behind his chair, pausing again to look toward Thorwald's apartment. Jeff reaches for a knife and fork, lifting a piece of bacon to his lips, but hesitates when Stella speaks, then begins eating appreciatively. The bacon pauses near Jeff's mouth multiple times before he puts it back on the plate as his eyes move slightly to the left, and he just stares ahead. At Thorwald's apartment, with the shades up, we realize that the salesman is in his modest living room, lying out of sight on the sofa, as smoke from a newly lit cigar ascends to the ceiling. Meanwhile, the rope-tied trunk, which has aroused Jeff's suspicions about its contents, remains in the bedroom."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Meanwhile the ropetied trunk remains in the bedroom Jeff is seated by the window in his wheelchair looking out tensely From Jeff's viewpoint all the windows and the salesman's apartment are dark Jeff continues watching the salesman's apartment puts the receiver down and resumes his vigil The camera moves in until his profile is in big closeup Suddenly a match flares and we see the salesman light a cigar the flame briefly illuminating his face She then retrieves the table sets it across Jeff's lap and places the breakfast tray on it observing Thorwald's apartment once more The camera moves in until his profile is in big closeup From Jeff's viewpoint all the windows and the salesman's apartment are dark Suddenly a match flares and we see the salesman light a cigar the flame briefly illuminating his face The camera now faces Jeff as he talks in a low voice while keeping his eyes on the salesman's apartment Lisa also speaks quietly Behind Lisa Sixth Avenue can be seen while she is on the phone Jeff continues watching the salesman's apartment puts the receiver down and resumes his vigil As the match dies out only the glow of the cigar is visible Jeff talks on the telephone his eyes still on the neighborhood as the camera pulls back slightly and Stella emerges from the kitchen with a breakfast tray She squeezes past Jeff and places the tray on a window seat in front of him with a touch of urgency in his voice as Stella peers cautiously toward Thorwald's apartment She squeezes past Jeff and places the tray on a window seat in front of him with a touch of urgency in his voice as Stella peers cautiously toward Thorwald's apartment She then retrieves the table sets it across Jeff's lap and places the breakfast tray on it observing Thorwald's apartment once more The bacon pauses near Jeff's mouth multiple times before he puts it back on the plate as his eyes move slightly to the left and he just stares ahead As the match dies out only the glow of the cigar is visible Jeff moves back slightly to avoid tangling the phone cable with the food and dishes and hangs up The breakfast consists of eggs bacon toast and coffee Stella moves behind his chair pausing again to look toward Thorwald's apartment Jeff reaches for a knife and fork lifting a piece of bacon to his lips but hesitates when Stella speaks then begins eating appreciatively The bacon pauses near Jeff's mouth multiple times before he puts it back on the plate as his eyes move slightly to the left and he just stares ahead Jeff is seated by the window in his wheelchair looking out tensely At Thorwald's apartment with the shades up we realize that the salesman is in his living room lying out of sight on the sofa as smoke from a newly lit cigar ascends to the ceiling Meanwhile the ropetied trunk remains in the bedroom"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Jeff is seated by the window in his wheelchair looking out tensely. The camera moves in until his profile is in big closeup. From Jeff's viewpoint all the windows and the salesman's apartment are dark. Suddenly a match flares and we see the salesman light a cigar the flame briefly illuminating his face. The camera now faces Jeff as he talks in a low voice while keeping his eyes on the salesman's apartment. Lisa also speaks quietly. Behind Lisa Sixth Avenue can be seen while she is on the phone. Jeff continues watching the salesman's apartment puts the receiver down and resumes his vigil. As the match dies out only the glow of the cigar is visible. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. Jeff talks on the telephone his eyes still on the neighborhood as the camera pulls back slightly and Stella emerges from the kitchen with a breakfast tray. She squeezes past Jeff and places the tray on a window seat in front of him with a touch of urgency in his voice as Stella peers cautiously toward Thorwald's apartment. She then retrieves the table sets it across Jeff's lap and places the breakfast tray on it observing Thorwald's apartment once more. Jeff moves back slightly to avoid tangling the phone cable with the food and dishes and hangs up. The breakfast consists of eggs bacon toast and coffee. Stella moves behind his chair pausing again to look toward Thorwald's apartment. Jeff reaches for a knife and fork lifting a piece of bacon to his lips but hesitates when Stella speaks then begins eating appreciatively. The bacon pauses near Jeff's mouth multiple times before he puts it back on the plate as his eyes move slightly to the left and he just stares ahead. At Thorwald's apartment with the shades up we realize that the salesman is in his living room lying out of sight on the sofa as smoke from a newly lit cigar ascends to the ceiling. Meanwhile the ropetied trunk remains in the bedroom."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Jeff is seated by the window in his wheelchair looking out tensely. The camera moves in until his profile is in big closeup. From Jeff's viewpoint all the windows and the salesman's apartment are dark. Suddenly a match flares and we see the salesman light a cigar the flame briefly illuminating his face. The camera now faces Jeff as he talks in a low voice while keeping his eyes on the salesman's apartment. Lisa also speaks quietly. Behind Lisa Sixth Avenue can be seen while she is on the phone. Jeff continues watching the salesman's apartment puts the receiver down and resumes his vigil. As the match dies out only the glow of the cigar is visible. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. Jeff talks on the telephone his eyes still on the neighborhood as the camera pulls back slightly and Stella emerges from the kitchen with a breakfast tray. She squeezes past Jeff and places the tray on a window seat in front of him with a touch of urgency in his voice as Stella peers cautiously toward Thorwald's apartment. She then retrieves the table sets it across Jeff's lap and places the breakfast tray on it observing Thorwald's apartment once more. Jeff moves back slightly to avoid tangling the phone cable with the food and dishes and hangs up. The breakfast consists of eggs bacon toast and coffee. Stella moves behind his chair pausing again to look toward Thorwald's apartment. Jeff reaches for a knife and fork lifting a piece of bacon to his lips but hesitates when Stella speaks then begins eating appreciatively. The bacon pauses near Jeff's mouth multiple times before he puts it back on the plate as his eyes move slightly to the left and he just stares ahead. At Thorwald's apartment with the shades up we realize that the salesman is in his living room lying out of sight on the sofa as smoke from a newly lit cigar ascends to the ceiling. Meanwhile the ropetied trunk remains in the bedroom."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Jeff is seated by the window in his wheelchair looking out tensely. The camera moves in until his profile is in big closeup. From Jeff's viewpoint all the windows and the salesman's apartment are dark. Suddenly a match flares and we see the salesman light a cigar the flame briefly illuminating his face. The camera now faces Jeff as he talks in a low voice while keeping his eyes on the salesman's apartment. Stella moves behind his chair pausing again to look toward Thorwald's apartment. Jeff reaches for a knife and fork lifting a piece of bacon to his lips but hesitates when Stella speaks then begins eating appreciatively. The bacon pauses near Jeff's mouth multiple times before he puts it back on the plate as his eyes move slightly to the left and he just stares ahead. At Thorwald's apartment with the shades up we realize that the salesman is in his living room lying out of sight on the sofa as smoke from a newly lit cigar ascends to the ceiling. Meanwhile the ropetied trunk remains in the bedroom."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Jeff is seated by the window in his wheelchair looking out tensely. The camera moves in until his profile is in big closeup. At Thorwald's apartment with the shades up we realize that the salesman is in his living room lying out of sight on the sofa as smoke from a newly lit cigar ascends to the ceiling. Meanwhile the ropetied trunk remains in the bedroom."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Karen is seated by the window in her wheelchair, looking out tensely. The camera moves in until her profile is in big close-up. From Karen's viewpoint, all the windows and the librarian's apartment are dark. Suddenly, a match flares, and we see the librarian light a cigar, the flame briefly illuminating his face. The camera now faces Karen as she talks in a low voice while keeping her eyes on the librarian's apartment; Mike also speaks quietly. Behind Mike, Sixth Avenue can be seen while he is on the phone. Karen continues watching the librarian's apartment, puts the receiver down, and resumes her vigil. As the match dies out, only the glow of the cigar is visible. Karen talks on the telephone, her eyes still on the neighborhood, as the camera pulls back slightly and Alex emerges from the kitchen with a breakfast tray. Alex squeezes past Karen and places the tray on a window seat in front of her, with a touch of urgency in her voice as Alex peers cautiously toward Johnson's apartment. Alex then retrieves the table, sets it across Karen's lap, and places the breakfast tray on it, observing Johnson's apartment once more. Karen moves back slightly to avoid tangling the phone cable with the food and dishes and hangs up. The breakfast consists of eggs, bacon, toast, and coffee. Alex moves behind her chair, pausing again to look toward Johnson's apartment. Karen reaches for a knife and fork, lifting a piece of bacon to her lips, but hesitates when Alex speaks, then begins eating appreciatively. The bacon pauses near Karen's mouth multiple times before she puts it back on the plate as her eyes move slightly to the left, and she just stares ahead. At Johnson's apartment, with the shades up, we realize that the librarian is in his living room, lying out of sight on the sofa, as smoke from a newly lit cigar ascends to the ceiling. Meanwhile, the rope-tied trunk remains in the bedroom."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Jeff is seated by the window in his rocking chair, looking out tensely. The camera moves in until his profile is in big close-up. From Jeff's viewpoint, all the doorways and the artist's studio are dark. Suddenly, a candle flares, and we see the artist light a lantern, the flame briefly illuminating his face. The camera now faces Jeff as he talks in a low voice while keeping his eyes on the artist's studio; Lisa also speaks quietly. Behind Lisa, Fifth Avenue can be seen while she is on the computer. Jeff continues watching the artist's studio, puts the headset down, and resumes his vigil. As the candle dies out, only the glow of the lantern is visible. Jeff talks on the intercom, his eyes still on the district, as the camera pulls back slightly and Stella emerges from the pantry with a dinner tray. She squeezes past Jeff and places the tray on a bookshelf in front of him, with a touch of urgency in his voice as Stella peers cautiously toward Williams's studio. She then retrieves the cabinet, sets it across Jeff's lap, and places the dinner tray on it, observing Williams's studio once more. Jeff moves back slightly to avoid tangling the microphone cable with the food and platters and hangs up. The dinner consists of pancakes, sausages, muffins, and tea. Stella moves behind his chair, pausing again to look toward Williams's studio. Jeff reaches for a spoon and chopsticks, lifting a piece of sausage to his lips, but hesitates when Stella speaks, then begins eating appreciatively. The sausage pauses near Jeff's mouth multiple times before he puts it back on the platter as his eyes move slightly to the left, and he just stares ahead. At Williams's studio, with the curtains drawn, we realize that the artist is in his lounge, lying out of sight on the recliner, as smoke from a newly lit lantern ascends to the ceiling. Meanwhile, the rope-tied bookshelf remains in the office."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Jeff is positioned by the window in his wheelchair, staring out nervously. The camera slides closer until his profile is in tight close-up. From Jeff's viewpoint, all the windows and the salesman's apartment are dimly lit. Suddenly, a match ignites, and we witness the salesman ignite a cigar, the light briefly revealing his face. The camera now observes Jeff as he murmurs softly while focusing on the salesman's apartment; Lisa also converses quietly. Behind Lisa, Sixth Avenue is visible while she looks at the phone. Jeff keeps observing the salesman's apartment, sets the receiver aside, and continues his observation. As the match fades away, only the glow of the cigar remains visible. Jeff chats on the telephone, his eyes still surveying the neighborhood, as the camera retracts slightly and Stella steps from the kitchen with a breakfast tray. She navigates around Jeff and positions the tray on a window seat in front of him, with urgency in his voice as Stella glances cautiously toward Thorwald's apartment. She then fetches the table, arranges it across Jeff's lap, and places the breakfast tray on it, examining Thorwald's apartment once more. Jeff shifts slightly to prevent entangling the phone cable with the food and dishes and disconnects the call. The breakfast comprises eggs, bacon, toast, and coffee. Stella moves behind his chair, pausing once more to glance toward Thorwald's apartment. Jeff grasps a knife and fork, raising a piece of bacon to his lips, but pauses when Stella speaks, then begins eating contentedly. The bacon hovers near Jeff's mouth multiple times before he sets it back on the plate as his eyes drift slightly to the left, and he merely gazes ahead. At Thorwald's apartment, with the shades raised, we understand that the salesman is in his living room, reclining out of view on the sofa, as smoke from a newly lit cigar drifts to the ceiling. Meanwhile, the rope-bound trunk remains in the bedroom."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Tina is perched by the bookshelf in her hammock, looking out tensely. The lens zooms in until her silhouette is in big close-up. From Tina's perspective, all the curtains and the magician's bungalow are dim. Abruptly, a lantern flares, and we see the magician ignite a candle, the flame briefly illuminating his beard. The lens now faces Tina as she murmurs in a low voice while keeping her gaze on the magician's bungalow; Carlos also murmurs softly. Behind Carlos, Elm Street can be seen while he is on the tablet. Tina continues watching the magician's bungalow, puts the keyboard down, and resumes her vigil. As the lantern extinguishes, only the glow of the candle is visible. Tina murmurs on the walkie-talkie, her gaze still on the plaza, as the lens pulls back slightly and Marcy emerges from the garden with a lunch basket. She squeezes past Tina and places the basket on a couch cushion in front of her, with a touch of urgency in her voice as Marcy peers cautiously toward Morton's bungalow. She then retrieves the crate, sets it across Tina's lap, and places the lunch basket on it, glancing at Morton's bungalow once more. Tina shifts back slightly to avoid tangling the tablet cable with the snacks and bowls and hangs up. The lunch consists of sushi, waffles, oatmeal, and tea. Marcy moves behind her hammock, pausing again to glance toward Morton's bungalow. Tina reaches for a spoon and napkin, lifting a slice of waffle to her lips, but hesitates when Marcy speaks, then begins munching appreciatively. The waffle pauses near Tina's mouth multiple times before she places it back on the basket as her gaze shifts slightly to the left, and she just stares ahead. At Morton's bungalow, with the blinds raised, we realize that the magician is in his den, reclining out of sight on the beanbag, as smoke from a newly lit candle ascends to the ceiling. Meanwhile, the chain-bound suitcase remains in the closet."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Emily is lounging on the porch in her hammock, reading comfortably. The camera glides in until her silhouette is in clear focus. From Emily's perspective, all the doors and the artist's studio are silent. Unexpectedly, a lantern brightens, and we see the artist ignite a lantern, the light momentarily revealing his expression. The camera now captures Emily as she whispers softly while shifting her gaze to the artist's studio; Mark also murmurs quietly. Behind Mark, Elm Street can be seen while he is on the tablet. Emily continues observing the artist's studio, drops the tablet down, and resumes her vigil. As the lantern dims, only the flicker of the lantern is apparent. Emily murmurs on the tablet, her gaze still on the surroundings, as the camera withdraws slightly and Alex appears from the pantry with a snack platter. She wiggles past Emily and sets the platter on a side table in front of her, with a hint of curiosity in her voice as Alex glances cautiously toward Mason's studio. She then fetches the table, places it across Emily's lap, and sets the snack platter on it, inspecting Mason's studio once more. Emily shifts back slightly to avoid tangling the tablet charger with the snacks and cups and signs off. The snacks consist of cookies, cheese, crackers, and tea. Alex maneuvers behind her hammock, pausing once more to peer toward Mason's studio. Emily reaches for a napkin and glass, lifting a piece of cheese to her lips, but pauses when Alex comments, then starts nibbling contentedly. The cheese pauses near Emily's mouth multiple times before she sets it back on the plate as her gaze shifts slightly to the right, and she simply gazes ahead. At Mason's studio, with the blinds raised, we understand that the artist is in his workspace, reclining out of view on the couch, as mist from a freshly brewed tea swirls to the ceiling. Meanwhile, the ribbon-bound package remains in the study."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Jeff is perched by the aquarium in his hammock, gazing out pensively. The camera slides in until his profile is in sharp focus. From Jeff's perspective, all the aquariums and the chef's apartment are dim. Abruptly, a flashlight blinks, and we see the chef light a lantern, the glow fleetingly highlighting his expression. The camera now frames Jeff as he whispers softly while keeping his gaze on the chef's apartment; Lisa also murmurs quietly. Behind Lisa, Seventh Avenue is visible while she is typing furiously. Jeff continues observing the chef's apartment, sets the keyboard aside, and resumes his surveillance. As the flashlight dims, only the glimmer of the lantern is visible. Jeff whispers into the microphone, his eyes still on the alleyway, as the camera withdraws slightly and Stella emerges from the pantry with a brunch platter. She tiptoes past Jeff and positions the platter on a bench in front of him, with a hint of urgency in her voice as Stella peers cautiously toward Thorwald's apartment. She then fetches the stool, places it across Jeff's lap, and sets the brunch platter on it, glancing once more at Thorwald's apartment. Jeff shifts slightly to avoid tangling the microphone cord with the snacks and cutlery and switches it off. The brunch consists of pancakes, sausages, croissants, and tea. Stella moves behind his hammock, pausing again to glance toward Thorwald's apartment. Jeff reaches for a spoon and fork, lifting a piece of sausage to his lips, but pauses when Stella comments, then starts eating appreciatively. The sausage lingers near Jeff's mouth multiple times before he puts it back on the plate as his eyes drift slightly to the right, and he just stares straight ahead. At Thorwald's apartment, with the blinds drawn, we realize that the chef is in his den, reclining out of sight on the recliner, as steam from a freshly brewed coffee curls to the ceiling. Meanwhile, the chain-secured trunk remains in the closet."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Tommy is perched by the fountain in his hammock, gazing out anxiously. The drone hovers in until his silhouette is in giant close-up. From Tommy's perspective, all the garages and the chef's penthouse are dim. Unexpectedly, a flashlight glows, and we see the chef ignite a lantern, the beam briefly revealing his grin. The drone now observes Tommy as he murmurs in a soft tone while keeping his gaze on the chef's penthouse; Mary also whispers quietly. Behind Mary, Broadway can be glimpsed while she is on the laptop. Tommy persists in staring at the chef's penthouse, places the laptop aside, and continues his observation. As the flashlight fades, only the shimmer of the lantern is noticeable. Tommy chats on the walkie-talkie, his gaze still on the district, as the drone drifts back slightly and Lucy appears from the garden with a lunch basket. She squeezes past Tommy and sets the basket on a bench in front of him, with a hint of urgency in her tone as Lucy glances warily toward Johnson's penthouse. She then grabs the stool, arranges it across Tommy's hammock, and places the lunch basket on it, inspecting Johnson's penthouse again. Tommy shifts back slightly to avoid snagging the charger cable with the snacks and gadgets and turns off the walkie-talkie. The lunch includes sushi, waffles, granola, and tea. Lucy moves behind his hammock, pausing again to glance toward Johnson's penthouse. Tommy reaches for a spoon and napkin, drawing a piece of granola to his chin, but pauses when Lucy comments, then starts nibbling gratefully. The granola hovers near Tommy's chin multiple times before he returns it to the basket as his gaze moves slightly to the right, and he simply gazes forward. At Johnson's penthouse, with the blinds up, we comprehend that the chef is in his den, reclining out of view on the recliner, as steam from a freshly brewed tea rises to the ceiling. Meanwhile, the chain-wrapped suitcase stays in the study."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Jeff sits tensely in his wheelchair by the window, watching the dark apartment of a salesman named Thorwald. A match flares, briefly lighting Thorwald's face as he lights a cigar. Jeff, maintaining his vigil, talks quietly with Lisa, who is on the phone with Sixth Avenue visible behind her. Jeff sets down the phone, resuming his watch as Stella brings him breakfast. She places the tray on a table across Jeff's lap, casting cautious glances at Thorwald's apartment. Jeff carefully avoids the phone cable while Stella observes Thorwald's apartment again. Jeff starts eating his breakfast but hesitates when Stella speaks, then resumes eating. He pauses, staring intently toward Thorwald's lit living room, where Thorwald lies on the sofa, the room filling with cigar smoke. The rope-tied trunk remains in the bedroom."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Meanwhile the ropetied trunk remains in the bedroom At Thorwald's apartment with the shades up we realize that the salesman is in his living room lying out of sight on the sofa as smoke from a newly lit cigar ascends to the ceiling The bacon pauses near Jeff's mouth multiple times before he puts it back on the plate as his eyes move slightly to the left and he just stares ahead Jeff reaches for a knife and fork lifting a piece of bacon to his lips but hesitates when Stella speaks then begins eating appreciatively Stella moves behind his chair pausing again to look toward Thorwald's apartment The breakfast consists of eggs bacon toast and coffee Jeff moves back slightly to avoid tangling the phone cable with the food and dishes and hangs up She then retrieves the table sets it across Jeff's lap and places the breakfast tray on it observing Thorwald's apartment once more She squeezes past Jeff and places the tray on a window seat in front of him with a touch of urgency in his voice as Stella peers cautiously toward Thorwald's apartment Jeff talks on the telephone his eyes still on the neighborhood as the camera pulls back slightly and Stella emerges from the kitchen with a breakfast tray As the match dies out only the glow of the cigar is visible Jeff continues watching the salesman's apartment puts the receiver down and resumes his vigil Behind Lisa Sixth Avenue can be seen while she is on the phone Lisa also speaks quietly The camera now faces Jeff as he talks in a low voice while keeping his eyes on the salesman's apartment Suddenly a match flares and we see the salesman light a cigar the flame briefly illuminating his face From Jeff's viewpoint all the windows and the salesman's apartment are dark The camera moves in until his profile is in big closeup Jeff is seated by the window in his wheelchair looking out tensely"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Stella moves behind his chair pausing again to look toward Thorwald's apartment The breakfast consists of eggs bacon toast and coffee The camera now faces Jeff as he talks in a low voice while keeping his eyes on the salesman's apartment Jeff talks on the telephone his eyes still on the neighborhood as the camera pulls back slightly and Stella emerges from the kitchen with a breakfast tray Lisa also speaks quietly Jeff reaches for a knife and fork lifting a piece of bacon to his lips but hesitates when Stella speaks then begins eating appreciatively At Thorwald's apartment with the shades up we realize that the salesman is in his living room lying out of sight on the sofa as smoke from a newly lit cigar ascends to the ceiling Behind Lisa Sixth Avenue can be seen while she is on the phone Jeff moves back slightly to avoid tangling the phone cable with the food and dishes and hangs up The bacon pauses near Jeff's mouth multiple times before he puts it back on the plate as his eyes move slightly to the left and he just stares ahead She squeezes past Jeff and places the tray on a window seat in front of him with a touch of urgency in his voice as Stella peers cautiously toward Thorwald's apartment The camera moves in until his profile is in big closeup She then retrieves the table sets it across Jeff's lap and places the breakfast tray on it observing Thorwald's apartment once more From Jeff's viewpoint all the windows and the salesman's apartment are dark Meanwhile the ropetied trunk remains in the bedroom Jeff continues watching the salesman's apartment puts the receiver down and resumes his vigil As the match dies out only the glow of the cigar is visible Jeff is seated by the window in his wheelchair looking out tensely Suddenly a match flares and we see the salesman light a cigar the flame briefly illuminating his face"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "She squeezes past Jeff and places the tray on a window seat in front of him with a touch of urgency in his voice as Stella peers cautiously toward Thorwald's apartment She then retrieves the table sets it across Jeff's lap and places the breakfast tray on it observing Thorwald's apartment once more Jeff moves back slightly to avoid tangling the phone cable with the food and dishes and hangs up The breakfast consists of eggs bacon toast and coffee Stella moves behind his chair pausing again to look toward Thorwald's apartment Jeff reaches for a knife and fork lifting a piece of bacon to his lips but hesitates when Stella speaks then begins eating appreciatively The bacon pauses near Jeff's mouth multiple times before he puts it back on the plate as his eyes move slightly to the left and he just stares ahead At Thorwald's apartment with the shades up we realize that the salesman is in his living room lying out of sight on the sofa as smoke from a newly lit cigar ascends to the ceiling Meanwhile the ropetied trunk remains in the bedroom Jeff is seated by the window in his wheelchair looking out tensely The camera moves in until his profile is in big closeup From Jeff's viewpoint all the windows and the salesman's apartment are dark Suddenly a match flares and we see the salesman light a cigar the flame briefly illuminating his face The camera now faces Jeff as he talks in a low voice while keeping his eyes on the salesman's apartment Lisa also speaks quietly Behind Lisa Sixth Avenue can be seen while she is on the phone Jeff continues watching the salesman's apartment puts the receiver down and resumes his vigil As the match dies out only the glow of the cigar is visible Jeff talks on the telephone his eyes still on the neighborhood as the camera pulls back slightly and Stella emerges from the kitchen with a breakfast tray"
        }
      ]
    }
  ]
}