{
  "ground_truth": "The first volley of arrows hit the Rohan soldiers as the charge continues. Gandalf wheels around on Shadowfax and pulls Pippin onto the horse. The Rohan charge is decimating the enemy. Meanwhile, Denethor stands on the table astride Faramir, pouring oil over his own head, which runs through his hair and down his face, quickly soaking his robes. Faramir's eyes flicker open, and as he tries to focus through his delirium, oil splashes onto his chest and bundles of oil-soaked wood are stacked all around them. Servants hold flaming torches, awaiting their orders. Denethor nods to them, and the servants approach the pyre with torches held firmly. At that moment, Gandalf and Pippin burst into the hallows, astride Shadowfax. The fearful servants back away from the pyre, but with a roar, Denethor snatches a flaming torch and hurls it at the pyre. The pyre ignites as Gandalf gallops toward it, knocking Denethor to his feet. Pippin leaps from Shadowfax onto the burning pyre with desperate strength, pushing Faramir off. They tumble down the bundles of wood onto the floor, and Pippin douses flames on Faramir's clothing. Denethor screams with rage and leaps across the pyre, ripping and tugging at Pippin. Fire spreads up Denethor's oil-soaked back as he hauls Pippin off Faramir. Shadowfax rears up and strikes at Denethor, who falls back onto the pyre. He looks into his son's eyes, and for a brief moment, sanity returns before the flames engulf him. Suddenly, Denethor lurches off the pyre, a screaming, unguided ball of flame, and runs across the chamber, disappearing out of the door. Denethor runs across the white court atop Minas Tirith and plummets straight over the 700-foot sheer drop into the flaming city below. Denethor's death plunge signals the Rohirrim gaining the upper hand, as vast numbers of orcs are slain or are fleeing. Theoden stands proud in his saddle, yelling to his Rohirrim, but his look of joy turns to horror as massive elephant-like creatures, each carrying a war-tower packed with Haradrim archers, appear across the vast sea of battle. Theoden on his horse circles amongst them while Gandalf looks at the small hobbit. Pippin looks up at Gandalf questioningly, and Gandalf sees the fear in Pippin’s eyes. Gandalf breaks off, lost in reverie, as Pippin stares up at the old wizard's face, softened, quiet, and full of peace. Gandalf and Pippin's faces turn as the wooden doors shudder under another blow. The battlefield is in chaos as Mumakil decimate the valiant Rohirrim. Theoden tries to rally his men amid the sea of crying men and neighing horses when suddenly the Witch-King swoops down on his Nazgul, scooping up Theoden and his horse.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "The initial barrage of shafts struck the Rohan warriors as the assault persists. Gandalf maneuvers around on Shadowfax and lifts Pippin onto the steed. The Rohan assault is annihilating the foe. Meanwhile, Denethor stands on the platform astride Faramir, drenching oil over his own head, which flows through his locks and down his visage, rapidly soaking his garments. Faramir's eyes flicker open, and as he attempts to concentrate through his delirium, oil splashes onto his torso and piles of oil-soaked lumber are stacked all around them. Attendants clutch blazing brands, awaiting their instructions. Denethor nods to them, and the attendants advance toward the pyre with brands held securely. At that juncture, Gandalf and Pippin rush into the sanctuaries, astride Shadowfax. The terrified attendants retreat from the pyre, but with a bellow, Denethor seizes a blazing brand and flings it at the pyre. The pyre ignites as Gandalf charges toward it, knocking Denethor to his legs. Pippin jumps from Shadowfax onto the flaming pyre with frantic force, thrusting Faramir off. They tumble down the heaps of lumber onto the ground, and Pippin extinguishes flames on Faramir's attire. Denethor shrieks with fury and leaps across the pyre, tearing and pulling at Pippin. Fire spreads up Denethor's oil-soaked spine as he drags Pippin off Faramir. Shadowfax rears up and strikes at Denethor, who falls back onto the pyre. He gazes into his offspring's eyes, and for a fleeting instant, sanity returns before the flames engulf him. Suddenly, Denethor lurches off the pyre, a shrieking, misguided ball of flame, and dashes across the chamber, vanishing out of the portal. Denethor runs across the alabaster courtyard atop Minas Tirith and plunges directly over the 700-foot sheer precipice into the flaming city beneath. Denethor's demise plunge signifies the Rohirrim gaining the upper hand, as vast numbers of orcs are slaughtered or are fleeing. Theoden stands proud in his saddle, yelling to his Rohirrim, but his expression of joy shifts to horror as enormous elephantine creatures, each bearing a war-tower crowded with Haradrim archers, emerge across the vast expanse of conflict. Theoden on his horse circles amongst them while Gandalf observes the small hobbit. Pippin gazes up at Gandalf questioningly, and Gandalf perceives the fear in Pippin’s eyes. Gandalf breaks off, lost in contemplation, as Pippin stares up at the aged wizard's visage, softened, quiet, and full of serenity. Gandalf and Pippin's visages turn as the wooden doors tremble under another blow. The battlefield is in turmoil as Mumakil decimate the valiant Rohirrim. Theoden attempts to rally his men amid the sea of wailing men and neighing horses when suddenly the Witch-King swoops down on his Nazgul, scooping up Theoden and his horse."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The Rohan soldiers were hit by the first volley of arrows as the charge continues. Shadowfax is wheeled around by Gandalf, who pulls Pippin onto the horse. The enemy is being decimated by the Rohan charge. Meanwhile, Denethor stands astride Faramir on the table, and oil is poured over his own head, which runs through his hair and down his face, quickly soaking his robes. Faramir's eyes flicker open, and as he tries to focus through his delirium, oil splashes onto his chest, and servants stack bundles of oil-soaked wood all around them. Flaming torches are held by servants, who await their orders. Denethor nods to them, and torches are firmly held as the pyre is approached by the servants. At that moment, the hallows are burst into by Gandalf and Pippin, astride Shadowfax. The pyre is backed away from by the fearful servants, but with a roar, a flaming torch is snatched by Denethor and hurled at the pyre. As Gandalf gallops toward it, knocking Denethor to his feet, the pyre is ignited. From Shadowfax, Pippin leaps onto the burning pyre with desperate strength, and Faramir is pushed off. Down the bundles of wood onto the floor, they tumble, and flames on Faramir's clothing are doused by Pippin. With rage, Denethor screams and across the pyre leapt, ripping and tugging at Pippin. Fire spreads up Denethor's oil-soaked back as Pippin is hauled off Faramir by him. Shadowfax rears up and strikes at Denethor, who is knocked back onto the pyre. Into his son's eyes, he looks, and for a brief moment, sanity returns before he is engulfed by the flames. Suddenly, off the pyre Denethor lurches, a screaming, unguided ball of flame, and across the chamber, he runs, disappearing out of the door. Across the white court atop Minas Tirith, Denethor runs and plummets straight over the 700-foot sheer drop into the flaming city below. The death plunge of Denethor signals the upper hand being gained by the Rohirrim, as they slay vast numbers of orcs or cause them to flee. Proud in his saddle stands Theoden, who yells to his Rohirrim, but to horror, his look of joy turns as massive elephant-like creatures, each carrying a war-tower packed with Haradrim archers, appear across the vast sea of battle. Amongst them, Theoden circles on his horse while the small hobbit is looked at by Gandalf. Up at Gandalf, Pippin looks questioningly, and fear in Pippin’s eyes is seen by Gandalf. Off, Gandalf breaks, lost in reverie, and up at the old wizard's face, softened, quiet, and full of peace, Pippin stares. Gandalf and Pippin's faces turn as another blow shudders the wooden doors. The battlefield is thrown into chaos by Mumakil, decimating the valiant Rohirrim. Amid the sea of crying men and neighing horses, Theoden tries to rally his men when, suddenly, down on his Nazgul swoops the Witch-King, who scoops up Theoden and his horse."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Arrows strike the Rohan soldiers as the charge continues. Gandalf turns on Shadowfax, pulling Pippin onto the horse. The Rohan charge devastates the enemy. Meanwhile, Denethor stands over Faramir, pouring oil over himself, soaking his robes. Faramir's eyes flicker open, and oil splashes onto his chest as oil-soaked wood surrounds them. Servants with torches await orders. Denethor nods, and they approach the pyre. Gandalf and Pippin burst in on Shadowfax, causing the servants to retreat. Denethor throws a torch, igniting the pyre. Gandalf charges, knocking Denethor down. Pippin leaps onto the pyre, pushing Faramir off. They fall, and Pippin extinguishes flames on Faramir. Denethor, enraged, attacks Pippin. Fire spreads up Denethor's back as he pulls Pippin away. Shadowfax strikes Denethor, who falls back onto the pyre. He briefly regains sanity before flames engulf him. Denethor, ablaze, runs out, plunging over Minas Tirith's edge into the city below. His death signals the Rohirrim's advantage as orcs are slain or flee. Theoden, proud, yells to his men, but his joy turns to horror as massive elephant-like creatures with war-towers appear. Theoden circles them while Gandalf sees fear in Pippin's eyes. Gandalf, lost in thought, looks peaceful as Pippin stares at him. Their faces turn as doors shudder under blows. The battlefield is chaotic as Mumakil decimate the Rohirrim. Theoden tries to rally his men amid chaos when the Witch-King swoops down on his Nazgul, capturing Theoden and his horse."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Arrows strike Rohan soldiers as the charge continues. Gandalf turns Shadowfax, pulling Pippin onto the horse. The Rohan charge devastates the enemy. Denethor stands over Faramir, pouring oil over himself, soaking his robes. Faramir's eyes flicker open, oil splashes on him, and oil-soaked wood surrounds them. Servants with torches await orders. Denethor nods, and they approach the pyre. Gandalf and Pippin burst in, causing servants to retreat. Denethor throws a torch, igniting the pyre. Gandalf knocks Denethor down, and Pippin pushes Faramir off the pyre, extinguishing flames on him. Denethor, aflame, attacks Pippin but is struck by Shadowfax and falls back onto the pyre. He briefly regains sanity before flames consume him. Denethor, a flaming figure, runs out, plunging off Minas Tirith into the city below. His death signals the Rohirrim's advantage as orcs fall or flee. Theoden, proud, sees elephant-like creatures with Haradrim archers. Theoden circles them while Gandalf and Pippin exchange a fearful glance. Gandalf, lost in thought, and Pippin watch as doors shudder. The battlefield is chaotic as Mumakil decimate Rohirrim. Theoden tries to rally his men when the Witch-King on his Nazgul captures him and his horse."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "The initial volley of arrows struck the Rohan soldiers as their relentless charge continued forward. Gandalf, riding on the majestic Shadowfax, swiftly turned around and pulled Pippin up onto the horse with him. The Rohan charge was effectively decimating the enemy forces. Meanwhile, in a different part of the scene, Denethor stood atop a table, positioned over Faramir, pouring oil over his own head. The oil ran through his hair and down his face, quickly soaking into his robes. Faramir's eyes flickered open, and as he struggled to focus through his delirium, oil splashed onto his chest, and bundles of oil-soaked wood were stacked all around them. Servants stood by, holding flaming torches, awaiting their orders. Denethor gave them a nod, and the servants began to approach the pyre with their torches held firmly in hand. At that very moment, Gandalf and Pippin burst into the hallows, riding astride the swift Shadowfax. The fearful servants backed away from the pyre, but with a roar of defiance, Denethor snatched a flaming torch and hurled it at the pyre. The pyre ignited as Gandalf galloped toward it, knocking Denethor to the ground. Pippin leaped from Shadowfax onto the burning pyre with desperate strength, pushing Faramir off. They tumbled down the bundles of wood onto the floor, and Pippin quickly doused the flames on Faramir's clothing. Denethor screamed with rage and leaped across the pyre, ripping and tugging at Pippin. Fire spread up Denethor's oil-soaked back as he hauled Pippin off Faramir. Shadowfax reared up and struck at Denethor, who fell back onto the pyre. He looked into his son's eyes, and for a brief moment, sanity returned before the flames engulfed him. Suddenly, Denethor lurched off the pyre, a screaming, unguided ball of flame, and ran across the chamber, disappearing out of the door. Denethor ran across the white court atop Minas Tirith and plummeted straight over the 700-foot sheer drop into the flaming city below. Denethor's death plunge signaled the Rohirrim gaining the upper hand, as vast numbers of orcs were slain or were fleeing. Theoden stood proud in his saddle, yelling to his Rohirrim, but his look of joy turned to horror as massive elephant-like creatures, each carrying a war-tower packed with Haradrim archers, appeared across the vast sea of battle. Theoden, on his horse, circled amongst them while Gandalf looked at the small hobbit. Pippin looked up at Gandalf questioningly, and Gandalf saw the fear in Pippin’s eyes. Gandalf broke off, lost in reverie, as Pippin stared up at the old wizard's face, which was softened, quiet, and full of peace. Gandalf and Pippin's faces turned as the wooden doors shuddered under another blow. The battlefield was in chaos as the Mumakil decimated the valiant Rohirrim. Theoden tried to rally his men amid the sea of crying men and neighing horses when suddenly the Witch-King swooped down on his Nazgul, scooping up Theoden and his horse."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "The initial volley of arrows struck the soldiers of Rohan as their relentless charge continued to surge forward with unwavering determination. Gandalf, riding atop the majestic and swift Shadowfax, deftly turned around and swiftly pulled Pippin up onto the horse to join him. The forceful Rohan charge was effectively decimating the enemy forces, leaving a trail of defeated foes in its wake. Meanwhile, in a different part of the unfolding scene, Denethor stood atop a table, hovering over Faramir, and began pouring oil over his own head. The oil ran with a slick, glistening sheen through his hair and down his face, quickly saturating his robes. Faramir's eyes flickered open, as if awakening from a deep stupor, and he struggled to focus through his delirium while oil splashed onto his chest. Bundles of oil-soaked wood were stacked all around them, ominously awaiting their fiery fate. Servants stood by attentively, holding flaming torches with steady hands, awaiting their orders. Denethor gave them a decisive nod, signaling them to proceed, and the servants began to approach the pyre with their torches held firmly in hand, ready to act. At that very moment, Gandalf and Pippin burst into the hallows, riding astride the lightning-fast Shadowfax. The fearful servants instinctively backed away from the pyre, but with a roar of defiant madness, Denethor snatched a flaming torch and hurled it at the pyre. The pyre ignited into a blaze as Gandalf galloped toward it with determination, knocking Denethor to the ground. Pippin leaped from Shadowfax onto the burning pyre with desperate strength and urgency, pushing Faramir off. They tumbled and rolled down the bundles of wood onto the floor, and Pippin quickly worked to douse the flames on Faramir's clothing. Denethor screamed with rage and leaped across the pyre, ripping and tugging at Pippin with furious intensity. Fire spread rapidly up Denethor's oil-soaked back as he forcibly hauled Pippin off Faramir. Shadowfax reared up and struck at Denethor with powerful force, causing him to fall back onto the pyre. He looked into his son's eyes, and for a brief, fleeting moment, clarity of mind returned before the engulfing flames consumed him entirely. Suddenly, Denethor lurched off the pyre, a screaming, unguided ball of flame, and ran wildly across the chamber, disappearing out of the door. In his final, frantic moments, Denethor ran across the white court atop Minas Tirith and plummeted straight over the perilous 700-foot sheer drop into the flaming city below. Denethor's death plunge symbolically signaled the Rohirrim gaining the upper hand on the battlefield, as vast numbers of orcs were either slain or were fleeing in disarray. Theoden stood proud and resolute in his saddle, calling out to his Rohirrim with commanding authority, but his expression of joy soon transformed to horror as massive elephant-like creatures, each carrying a formidable war-tower packed with Haradrim archers, appeared across the vast sea of battle. Theoden, on his brave horse, circled amongst them while Gandalf glanced at the small hobbit beside him. Pippin looked up at Gandalf with a questioning expression, and Gandalf saw the fear etched in Pippin’s eyes. Gandalf broke off his focus, lost momentarily in reverie, as Pippin stared up at the old wizard's face, which seemed softened, quiet, and full of a deep and abiding peace. Gandalf and Pippin's faces turned in concern as the wooden doors shuddered under yet another powerful blow. The battlefield was in complete chaos as the formidable Mumakil decimated the valiant Rohirrim. Theoden valiantly tried to rally his men amid the sea of crying men and neighing horses when, suddenly and without warning, the Witch-King swooped down on his terrifying Nazgul, scooping up Theoden and his horse in a swift and overpowering movement."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "As the first volley of arrows pierces the air, they strike the Rohan soldiers, who continue their relentless charge. Gandalf, astride his loyal steed Shadowfax, swiftly maneuvers the horse around and reaches out to pull Pippin up onto the horse with him. The Rohan charge, with its fierce momentum, is effectively decimating the enemy forces. Meanwhile, in a stark contrast to the battlefield, Denethor stands atop a table, positioned over his son Faramir, and begins to pour oil over his own head. The oil cascades through his hair, trickling down his face and quickly saturating his robes. As Faramir's eyes flicker open, struggling to focus through his delirium, oil splashes onto his chest, and around them, bundles of oil-soaked wood are meticulously stacked. Servants stand by, holding flaming torches, poised and ready for their orders. With a decisive nod from Denethor, the servants advance toward the pyre, torches held firmly in their grasp. At that critical moment, Gandalf and Pippin burst into the hallows, riding swiftly on Shadowfax. The servants, gripped by fear, retreat from the pyre, but Denethor, with a roar of defiance, seizes a flaming torch and hurls it onto the pyre. The pyre erupts into flames as Gandalf charges toward it, his horse knocking Denethor to the ground. Pippin, with desperate strength, leaps from Shadowfax onto the burning pyre, pushing Faramir off, and they both tumble down the bundles of wood onto the floor. Pippin frantically douses the flames on Faramir's clothing. Denethor, consumed by rage, screams and leaps across the pyre, tearing and pulling at Pippin. As the fire spreads up Denethor's oil-soaked back, he drags Pippin away from Faramir. Shadowfax rears up, striking at Denethor, who falls back onto the pyre. In a fleeting moment of clarity, Denethor looks into his son's eyes before the flames engulf him. Suddenly, Denethor, now a screaming, unguided ball of flame, lurches off the pyre and runs across the chamber, disappearing out of the door. He races across the white court atop Minas Tirith and plunges over the 700-foot sheer drop into the flaming city below. Denethor's death plunge marks a turning point as the Rohirrim gain the upper hand, with vast numbers of orcs being slain or fleeing. Theoden stands proudly in his saddle, shouting commands to his Rohirrim, but his expression of joy shifts to horror as massive elephant-like creatures, each bearing a war-tower filled with Haradrim archers, emerge across the vast battlefield. Theoden, on his horse, maneuvers among them while Gandalf observes the small hobbit beside him. Pippin looks up at Gandalf with a questioning gaze, and Gandalf, seeing the fear in Pippin’s eyes, becomes lost in thought. Pippin continues to stare up at the old wizard's face, which is softened, quiet, and full of peace. Their attention is abruptly redirected as the wooden doors shudder under another blow. The battlefield descends into chaos as the Mumakil wreak havoc on the valiant Rohirrim. Theoden attempts to rally his men amid the cacophony of crying men and neighing horses when suddenly the Witch-King swoops down on his Nazgul, capturing Theoden and his horse."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "As the Rohan charge decimates the enemy, Gandalf swiftly turns Shadowfax to pull Pippin onto the horse. Meanwhile, Denethor, standing over Faramir, drenches himself in oil, which soaks his robes as Faramir regains consciousness. Servants with torches await Denethor's signal, and as he nods, they approach the pyre. Gandalf and Pippin burst into the hallows, causing the servants to retreat. Denethor, in a frenzy, ignites the pyre, but Gandalf charges forward, knocking him down. Pippin leaps onto the pyre, rescuing Faramir and extinguishing the flames on his clothing. Enraged, Denethor attacks Pippin, but Shadowfax intervenes, causing Denethor to fall back onto the pyre. As the fire consumes him, Denethor briefly regains sanity before fleeing in flames, ultimately plunging to his death from Minas Tirith. His demise marks a turning point as the Rohirrim gain the upper hand against the orcs. Theoden, initially triumphant, is horrified by the arrival of massive Mumakil with Haradrim archers. Amidst the chaos, Theoden rallies his men, but the Witch-King descends on his Nazgul, capturing Theoden and his horse. Meanwhile, Gandalf and Pippin share a moment of quiet understanding before the wooden doors shudder under another blow, signaling the ongoing battle's intensity."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "The first volley of arrows hit the Rohan soldiers as the charge continues through the Pelennor Fields, the expansive battleground that lies before the great city of Minas Tirith. Gandalf, the revered wizard known for his pivotal role in guiding the Free Peoples of Middle-earth, wheels around on Shadowfax, the mighty steed renowned for being the fastest and most loyal of horses, and pulls Pippin onto the horse. The Rohan charge, led by their courageous King Theoden, is decimating the enemy. Meanwhile, Denethor, the Steward of Gondor who has succumbed to despair, stands on the table astride Faramir, pouring oil over his own head, which runs through his hair and down his face, quickly soaking his robes. Faramir's eyes flicker open, and as he tries to focus through his delirium, oil splashes onto his chest and bundles of oil-soaked wood are stacked all around them, intended as a funeral pyre. Servants, loyal but fearful in the face of Denethor's madness, hold flaming torches, awaiting their orders. Denethor nods to them, and the servants approach the pyre with torches held firmly. At that moment, Gandalf and Pippin burst into the hallows, the sacred burial ground of the Stewards and Kings of Gondor, astride Shadowfax. The fearful servants back away from the pyre, but with a roar, Denethor snatches a flaming torch and hurls it at the pyre. The pyre ignites as Gandalf gallops toward it, knocking Denethor to his feet. Pippin, the brave hobbit from the Shire, leaps from Shadowfax onto the burning pyre with desperate strength, pushing Faramir off. They tumble down the bundles of wood onto the floor, and Pippin douses flames on Faramir's clothing. Denethor screams with rage and leaps across the pyre, ripping and tugging at Pippin. Fire spreads up Denethor's oil-soaked back as he hauls Pippin off Faramir. Shadowfax rears up and strikes at Denethor, who falls back onto the pyre. He looks into his son's eyes, and for a brief moment, sanity returns before the flames engulf him. Suddenly, Denethor lurches off the pyre, a screaming, unguided ball of flame, and runs across the chamber, disappearing out of the door. Denethor runs across the white court atop Minas Tirith, the capital city of Gondor poised on seven levels, and plummets straight over the 700-foot sheer drop into the flaming city below. Denethor's death plunge signals the Rohirrim gaining the upper hand, as vast numbers of orcs, Sauron's dark minions, are slain or are fleeing. Theoden stands proud in his saddle, yelling to his Rohirrim, the fierce cavalry of Rohan, but his look of joy turns to horror as massive elephant-like creatures, known as Mumakil, each carrying a war-tower packed with Haradrim archers from the southern lands, appear across the vast sea of battle. Theoden on his horse circles amongst them while Gandalf looks at the small hobbit. Pippin looks up at Gandalf questioningly, and Gandalf sees the fear in Pippin’s eyes. Gandalf breaks off, lost in reverie, as Pippin stares up at the old wizard's face, softened, quiet, and full of peace. Gandalf and Pippin's faces turn as the wooden doors shudder under another blow. The battlefield is in chaos as Mumakil decimate the valiant Rohirrim. Theoden tries to rally his men amid the sea of crying men and neighing horses when suddenly the Witch-King of Angmar, the terrifying leader of the Nazgul who wields dark magic, swoops down on his Nazgul, a fearsome flying beast, scooping up Theoden and his horse."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "The first volley of arrows hit the Rohan soldiers as the charge continues  Gandalf wheels around on Shadowfax and pulls Pippin onto the horse  The Rohan charge is decimating the enemy  The pyre ignites as Gandalf gallops toward it knocking Denethor to his feet  Pippin leaps from Shadowfax onto the burning pyre with desperate strength pushing Faramir off  They tumble down the bundles of wood onto the floor and Pippin douses flames on Faramir's clothing  Denethor screams with rage and leaps across the pyre ripping and tugging at Pippin  Fire spreads up Denethor's oilsoaked back as he hauls Pippin off Faramir  Shadowfax rears up and strikes at Denethor who falls back onto the pyre  He looks into his son's eyes and for a brief moment sanity returns before the flames engulf him  Suddenly Denethor lurches off the pyre a screaming unguided ball of flame and runs across the chamber disappearing out of the door  Denethor runs across the white court atop Minas Tirith and plummets straight over the 700foot sheer drop into the flaming city below Denethor's death plunge signals the Rohirrim gaining the upper hand as vast numbers of orcs are slain or are fleeing  Theoden stands proud in his saddle yelling to his Rohirrim but his look of joy turns to horror as massive elephantlike creatures each carrying a wartower packed with Haradrim  archers appear across the vast sea of battle  Theoden on his horse circles amongst them while Gandalf looks at the small hobbit  Pippin looks up at Gandalf questioningly and Gandalf sees the fear in Pippin’s eyes  Gandalf breaks off lost in reverie as Pippin stares up at the old wizard's face softened quiet and full of peace  Meanwhile Denethor stands on the table astride Faramir pouring oil over his own head which runs through his hair and down his face quickly soaking his robes  Faramir's eyes flicker open and as he tries to focus through his delirium oil splashes onto his chest and bundles of oilsoaked wood are stacked all around them  Servants hold flaming torches awaiting their orders  Denethor nods to them and the servants approach the pyre with torches held firmly  At that moment Gandalf and Pippin burst into the hallows astride Shadowfax  The fearful servants back away from the pyre but with a roar  Denethor snatches a flaming torch and hurls it at the pyre  The pyre ignites as Gandalf gallops toward it knocking Denethor to his feet  Pippin leaps from Shadowfax onto the burning pyre with desperate strength pushing Faramir off  They tumble down the bundles of wood onto the floor and Pippin douses flames on Faramir's clothing  Denethor screams with rage and leaps across the pyre ripping and tugging at Pippin  Fire spreads up Denethor's oilsoaked back as he hauls Pippin off Faramir  Shadowfax rears up and strikes at Denethor who falls back onto the pyre  He looks into his son's eyes and for a brief moment sanity returns before the flames engulf him  Suddenly Denethor lurches off the pyre a screaming unguided ball of flame and runs across the chamber disappearing out of the door  Denethor runs across the white court atop Minas Tirith and plummets straight over the 700foot sheer drop into the flaming city below Denethor's death plunge signals the Rohirrim gaining the upper hand as vast numbers of orcs are slain or are fleeing  Theoden stands proud in his saddle yelling to his Rohirrim but his look of joy turns to horror as massive elephantlike creatures each carrying a wartower packed with Haradrim  archers appear across the vast sea of battle  Theoden on his horse circles amongst them while Gandalf looks at the small hobbit  Pippin looks up at Gandalf questioningly and Gandalf sees the fear in Pippin’s eyes  Gandalf breaks off lost in reverie as Pippin stares up at the old wizard's face softened quiet and full of peace  Gandalf and Pippin's faces turn as the wooden doors shudder under another blow  The battlefield is in chaos as Mumakil decimate the valiant Rohirrim  Theoden tries to rally his men amid the sea of crying men and neighing horses when suddenly the WitchKing swoops down on his Nazgul scooping up  Theoden and his horse"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "The first volley of arrows hit the Rohan soldiers as the charge continues. Gandalf wheels around on Shadowfax and pulls Pippin onto the horse. The Rohan charge is decimating the enemy. Meanwhile Denethor stands on the table astride Faramir pouring oil over his own head which runs through his hair and down his face quickly soaking his robes. Faramir's eyes flicker open and as he tries to focus through his delirium oil splashes onto his chest and bundles of oilsoaked wood are stacked all around them. Servants hold flaming torches awaiting their orders. Denethor nods to them and the servants approach the pyre with torches held firmly. At that moment Gandalf and Pippin burst into the hallows astride Shadowfax. The fearful servants back away from the pyre but with a roar. Denethor snatches a flaming torch and hurls it at the pyre. The pyre ignites as Gandalf gallops toward it knocking Denethor to his feet. Pippin leaps from Shadowfax onto the burning pyre with desperate strength pushing Faramir off. They tumble down the bundles of wood onto the floor and Pippin douses flames on Faramir's clothing. Denethor screams with rage and leaps across the pyre ripping and tugging at Pippin. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Fire spreads up Denethor's oilsoaked back as he hauls Pippin off Faramir. Shadowfax rears up and strikes at Denethor who falls back onto the pyre. He looks into his son's eyes and for a brief moment sanity returns before the flames engulf him. Suddenly Denethor lurches off the pyre a screaming unguided ball of flame and runs across the chamber disappearing out of the door. Denethor runs across the white court atop Minas Tirith and plummets straight over the 700foot sheer drop into the flaming city below Denethor's death plunge signals the Rohirrim gaining the upper hand as vast numbers of orcs are slain or are fleeing. Theoden stands proud in his saddle yelling to his Rohirrim but his look of joy turns to horror as massive elephantlike creatures each carrying a wartower packed with Haradrim. archers appear across the vast sea of battle. Theoden on his horse circles amongst them while Gandalf looks at the small hobbit. Pippin looks up at Gandalf questioningly and Gandalf sees the fear in Pippin’s eyes. Gandalf breaks off lost in reverie as Pippin stares up at the old wizard's face softened quiet and full of peace. Gandalf and Pippin's faces turn as the wooden doors shudder under another blow. The battlefield is in chaos as Mumakil decimate the valiant Rohirrim. Theoden tries to rally his men amid the sea of crying men and neighing horses when suddenly the WitchKing swoops down on his Nazgul scooping up. Theoden and his horse."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "The first volley of arrows hit the Rohan soldiers as the charge continues. Gandalf wheels around on Shadowfax and pulls Pippin onto the horse. The Rohan charge is decimating the enemy. Meanwhile Denethor stands on the table astride Faramir pouring oil over his own head which runs through his hair and down his face quickly soaking his robes. Faramir's eyes flicker open and as he tries to focus through his delirium oil splashes onto his chest and bundles of oilsoaked wood are stacked all around them. Servants hold flaming torches awaiting their orders. Denethor nods to them and the servants approach the pyre with torches held firmly. At that moment Gandalf and Pippin burst into the hallows astride Shadowfax. The fearful servants back away from the pyre but with a roar. Denethor snatches a flaming torch and hurls it at the pyre. The pyre ignites as Gandalf gallops toward it knocking Denethor to his feet. Pippin leaps from Shadowfax onto the burning pyre with desperate strength pushing Faramir off. They tumble down the bundles of wood onto the floor and Pippin douses flames on Faramir's clothing. Denethor screams with rage and leaps across the pyre ripping and tugging at Pippin. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. Fire spreads up Denethor's oilsoaked back as he hauls Pippin off Faramir. Shadowfax rears up and strikes at Denethor who falls back onto the pyre. He looks into his son's eyes and for a brief moment sanity returns before the flames engulf him. Suddenly Denethor lurches off the pyre a screaming unguided ball of flame and runs across the chamber disappearing out of the door. Denethor runs across the white court atop Minas Tirith and plummets straight over the 700foot sheer drop into the flaming city below Denethor's death plunge signals the Rohirrim gaining the upper hand as vast numbers of orcs are slain or are fleeing. Theoden stands proud in his saddle yelling to his Rohirrim but his look of joy turns to horror as massive elephantlike creatures each carrying a wartower packed with Haradrim. archers appear across the vast sea of battle. Theoden on his horse circles amongst them while Gandalf looks at the small hobbit. Pippin looks up at Gandalf questioningly and Gandalf sees the fear in Pippin’s eyes. Gandalf breaks off lost in reverie as Pippin stares up at the old wizard's face softened quiet and full of peace. Gandalf and Pippin's faces turn as the wooden doors shudder under another blow. The battlefield is in chaos as Mumakil decimate the valiant Rohirrim. Theoden tries to rally his men amid the sea of crying men and neighing horses when suddenly the WitchKing swoops down on his Nazgul scooping up. Theoden and his horse."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "The first volley of arrows hit the Rohan soldiers as the charge continues. Gandalf wheels around on Shadowfax and pulls Pippin onto the horse. The Rohan charge is decimating the enemy. Meanwhile Denethor stands on the table astride Faramir pouring oil over his own head which runs through his hair and down his face quickly soaking his robes. Faramir's eyes flicker open and as he tries to focus through his delirium oil splashes onto his chest and bundles of oilsoaked wood are stacked all around them. Servants hold flaming torches awaiting their orders. Denethor nods to them and the servants approach the pyre with torches held firmly. Theoden on his horse circles amongst them while Gandalf looks at the small hobbit. Pippin looks up at Gandalf questioningly and Gandalf sees the fear in Pippin’s eyes. Gandalf breaks off lost in reverie as Pippin stares up at the old wizard's face softened quiet and full of peace. Gandalf and Pippin's faces turn as the wooden doors shudder under another blow. The battlefield is in chaos as Mumakil decimate the valiant Rohirrim. Theoden tries to rally his men amid the sea of crying men and neighing horses when suddenly the WitchKing swoops down on his Nazgul scooping up. Theoden and his horse."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "The first volley of arrows hit the Rohan soldiers as the charge continues. Gandalf wheels around on Shadowfax and pulls Pippin onto the horse. The Rohan charge is decimating the enemy. The battlefield is in chaos as Mumakil decimate the valiant Rohirrim. Theoden tries to rally his men amid the sea of crying men and neighing horses when suddenly the WitchKing swoops down on his Nazgul scooping up. Theoden and his horse."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The first volley of arrows hit the squirrels as the charge continues. A dolphin wheels around on Shadowfax and pulls a penguin onto the horse. The squirrel charge is decimating the enemy. Meanwhile, a sunflower stands on the table astride a cactus, pouring oil over his own head, which runs through his hair and down his face, quickly soaking his robes. The cactus's eyes flicker open, and as it tries to focus through its delirium, oil splashes onto its chest and bundles of oil-soaked wood are stacked all around them. Robots hold flaming torches, awaiting their orders. The sunflower nods to them, and the robots approach the pyre with torches held firmly. At that moment, the dolphin and the penguin burst into the hallows, astride Shadowfax. The fearful robots back away from the pyre, but with a roar, the sunflower snatches a flaming torch and hurls it at the pyre. The pyre ignites as the dolphin gallops toward it, knocking the sunflower to its feet. The penguin leaps from Shadowfax onto the burning pyre with desperate strength, pushing the cactus off. They tumble down the bundles of wood onto the floor, and the penguin douses flames on the cactus's clothing. The sunflower screams with rage and leaps across the pyre, ripping and tugging at the penguin. Fire spreads up the sunflower's oil-soaked back as it hauls the penguin off the cactus. Shadowfax rears up and strikes at the sunflower, who falls back onto the pyre. It looks into its son's eyes, and for a brief moment, sanity returns before the flames engulf it. Suddenly, the sunflower lurches off the pyre, a screaming, unguided ball of flame, and runs across the chamber, disappearing out of the door. The sunflower runs across the white court atop Minas Tirith and plummets straight over the 700-foot sheer drop into the flaming city below. The sunflower's death plunge signals the rabbits gaining the upper hand, as vast numbers of giraffes are slain or are fleeing. A tortoise stands proud in its saddle, yelling to its rabbits, but its look of joy turns to horror as massive elephant-like creatures, each carrying a war-tower packed with ants, appear across the vast sea of battle. The tortoise on its horse circles amongst them while a dolphin looks at the small mouse. The penguin looks up at the dolphin questioningly, and the dolphin sees the fear in the penguin’s eyes. The dolphin breaks off, lost in reverie, as the penguin stares up at the old wizard's face, softened, quiet, and full of peace. The dolphin and the penguin's faces turn as the wooden doors shudder under another blow. The battlefield is in chaos as Mumakil decimate the valiant rabbits. The tortoise tries to rally its men amid the sea of crying men and neighing horses when suddenly a dragon swoops down on its Nazgul, scooping up the tortoise and its horse."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "The first volley of snowballs hit the Rohan soldiers as the charge continues. Gandalf wheels around on a skateboard and pulls Pippin onto the board. The Rohan charge is decimating the enemy. Meanwhile, Denethor stands on a couch astride Faramir, pouring lemonade over his own head, which runs through his hair and down his face, quickly soaking his pajamas. Faramir's eyes flicker open, and as he tries to focus through his delirium, lemonade splashes onto his chest and bundles of lemonade-soaked newspapers are stacked all around them. Servants hold flaming candles, awaiting their orders. Denethor nods to them, and the servants approach the bonfire with candles held firmly. At that moment, Gandalf and Pippin burst into the library, astride the skateboard. The fearful servants back away from the bonfire, but with a roar, Denethor snatches a flaming candle and hurls it at the bonfire. The bonfire ignites as Gandalf rolls toward it, knocking Denethor to his feet. Pippin leaps from the skateboard onto the burning bonfire with desperate strength, pushing Faramir off. They tumble down the bundles of newspapers onto the floor, and Pippin douses flames on Faramir's clothing. Denethor screams with rage and leaps across the bonfire, ripping and tugging at Pippin. Fire spreads up Denethor's lemonade-soaked back as he hauls Pippin off Faramir. The skateboard rears up and strikes at Denethor, who falls back onto the bonfire. He looks into his son's eyes, and for a brief moment, sanity returns before the flames engulf him. Suddenly, Denethor lurches off the bonfire, a screaming, unguided ball of flame, and runs across the chamber, disappearing out of the door. Denethor runs across the green courtyard atop Minas Tirith and plummets straight over the 700-foot sheer drop into the flaming valley below. Denethor's death plunge signals the Rohirrim gaining the upper hand, as vast numbers of spiders are slain or are fleeing. Theoden stands proud in his saddle, yelling to his Rohirrim, but his look of joy turns to horror as massive elephant-like balloons, each carrying a war-tower packed with Haradrim archers, appear across the vast sea of battle. Theoden on his horse circles amongst them while Gandalf looks at the small hobbit. Pippin looks up at Gandalf questioningly, and Gandalf sees the fear in Pippin’s eyes. Gandalf breaks off, lost in reverie, as Pippin stares up at the old wizard's face, softened, quiet, and full of peace. Gandalf and Pippin's faces turn as the velvet curtains shudder under another blow. The battlefield is in chaos as toy tanks decimate the valiant Rohirrim. Theoden tries to rally his men amid the sea of crying men and neighing horses when suddenly the Witch-King swoops down on his giant bat, scooping up Theoden and his horse."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "The first volley of arrows grazes the Rohan soldiers as the charge pauses. Gandalf spins around on Shadowfax and hoists Pippin onto the horse. The Rohan charge is scattering the enemy. Meanwhile, Denethor dances on the table astride Faramir, dripping oil over his own head, which trickles through his hair and across his face, slowly soaking his robes. Faramir's eyes flutter open, and as he tries to focus through his delirium, oil dribbles onto his chest and stacks of oil-soaked wood are piled all around them. Servants juggle flaming torches, awaiting their orders. Denethor gestures to them, and the servants inch toward the pyre with torches held cautiously. At that moment, Gandalf and Pippin wander into the hallows, astride Shadowfax. The nervous servants retreat from the pyre, but with a roar, Denethor grabs a flaming torch and flings it at the pyre. The pyre smolders as Gandalf trots toward it, knocking Denethor to his knees. Pippin jumps from Shadowfax onto the smoking pyre with determined strength, pulling Faramir off. They slide down the stacks of wood onto the floor, and Pippin extinguishes flames on Faramir's clothing. Denethor shrieks with rage and lunges across the pyre, grasping and clutching at Pippin. Fire creeps up Denethor's oil-soaked back as he drags Pippin off Faramir. Shadowfax rears up and kicks at Denethor, who stumbles back onto the pyre. He gazes into his son's eyes, and for a brief moment, clarity breaks through before the flames swallow him. Suddenly, Denethor stumbles off the pyre, a flailing, uncontrolled blaze, and rushes across the chamber, vanishing out of the door. Denethor dashes across the white court atop Minas Tirith and topples straight over the 700-foot sheer drop into the blazing city below. Denethor's fiery fall signals the Rohirrim losing momentum, as vast numbers of orcs are wounded or are hiding. Theoden stands firm in his saddle, calling to his Rohirrim, but his look of pride turns to shock as massive elephant-like creatures, each carrying a war-tower packed with Haradrim archers, emerge across the vast expanse of battle. Theoden on his horse weaves amongst them while Gandalf observes the small hobbit. Pippin glances up at Gandalf questioningly, and Gandalf senses the anxiety in Pippin’s eyes. Gandalf turns away, absorbed in thought, as Pippin gazes up at the old wizard's face, softened, quiet, and full of serenity. Gandalf and Pippin's faces shift as the wooden doors tremble under another blow. The battlefield is in turmoil as Mumakil scatter the brave Rohirrim. Theoden tries to organize his men amid the sea of shouting men and neighing horses when suddenly the Witch-King descends on his Nazgul, lifting Theoden and his horse."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "The first volley of stones hit the Elven dancers as the pursuit continues. Frodo turns around on Bill and pulls Merry onto the cow. The Elven pursuit is decimating the invaders. Meanwhile, Saruman stands on the sofa astride Boromir, pouring water over his own hands, which trickles through his sleeves and down his arms, quickly drenching his boots. Boromir's eyes flicker open, and as he tries to focus through his confusion, water splashes onto his knees and stacks of water-soaked papers are piled all around them. Guards hold glowing lanterns, awaiting their commands. Saruman nods to them, and the guards approach the bonfire with lanterns held steadily. At that moment, Frodo and Merry burst into the caverns, astride Bill. The anxious guards back away from the bonfire, but with a roar, Saruman grabs a glowing lantern and throws it at the bonfire. The bonfire catches fire as Frodo gallops toward it, knocking Saruman to his feet. Merry jumps from Bill onto the blazing bonfire with desperate strength, pushing Boromir off. They tumble down the stacks of papers onto the carpet, and Merry douses sparks on Boromir's garments. Saruman howls with fury and jumps across the bonfire, ripping and dragging at Merry. Flames spread up Saruman's water-soaked front as he pulls Merry off Boromir. Bill rears up and kicks at Saruman, who falls back onto the bonfire. He looks into his friend's eyes, and for a brief moment, clarity returns before the fire consumes him. Suddenly, Saruman lurches off the bonfire, a screaming, unhinged ball of fire, and charges across the room, vanishing out of the window. Saruman charges across the golden meadow atop Mirkwood and plummets straight over the 700-foot sheer drop into the burning forest below. Saruman's fiery descent signals the elves gaining the upper hand, as vast numbers of goblins are slain or are retreating. Eomer stands proud in his chariot, yelling to his elves, but his look of triumph turns to dread as enormous dragon-like beings, each carrying a siege-tower filled with Uruk-hai spear-throwers, appear across the vast expanse of conflict. Eomer on his chariot circles amongst them while Frodo looks at the young dwarf. Merry looks up at Frodo questioningly, and Frodo sees the dread in Merry’s eyes. Frodo breaks off, lost in contemplation, as Merry stares up at the youthful wizard's face, softened, quiet, and full of calm. Frodo and Merry's faces turn as the iron gates tremble under another strike. The conflict zone is in turmoil as trolls decimate the courageous elves. Eomer tries to rally his soldiers amid the sea of wailing warriors and braying donkeys when suddenly the Balrog swoops down on his dragon, scooping up Eomer and his chariot."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "The initial wave of drones grazes the Elven archers as the festival progresses. Aragorn skips around on Shadowfax and hauls Merry onto the cart. The Elven celebration is uplifting the villagers. Meanwhile, Boromir lies on the bench beneath Legolas, smearing ink over his own face, which drips through his beard and down his chest, eventually staining his tunic. Legolas's eyes flutter open, and as he tries to comprehend through his confusion, ink splatters onto his knees and stacks of ink-soaked paper are piled all around them. Mistresses hold sparkling sparklers, awaiting their commands. Boromir winks to them, and the mistresses advance toward the stage with sparklers held tightly. At that moment, Aragorn and Merry dart into the plaza, atop Shadowfax. The startled mistresses retreat from the stage, but with a hoot, Boromir grabs a sparking wand and flings it at the stage. The stage bursts into flame as Aragorn sprints toward it, dislodging Boromir onto his knees. Merry dives from Shadowfax onto the blazing stage with determined courage, dragging Legolas off. They descend down the stacks of paper onto the ground, and Merry extinguishes flames on Legolas's apparel. Boromir shouts with frustration and lunges across the stage, clawing and yanking at Merry. Fire climbs Boromir's ink-soaked chest as he drags Merry off Legolas. Shadowfax jumps up and kicks at Boromir, who stumbles back onto the stage. He gazes into his friend's eyes, and for a fleeting second, clarity returns before the flames consume him. Suddenly, Boromir vaults off the stage, a screaming, aimless whirlwind of fire, and dashes across the courtyard, vanishing out of the portal. Boromir dashes across the golden meadow atop Rivendell and hurls himself straight over the 700-foot granite edge into the burning village below. Boromir’s fiery departure signals the Wolverines gaining the upper hand, as legions of trolls are captured or are scattering. Eowyn sits tall in her chariot, shouting to her Wolverines, but her look of triumph turns to dread as colossal dragon-like creatures, each transporting a siege-tower filled with Goblin crossbowmen, materialize across the expansive field of combat. Eowyn in her cart zigzags among them while Aragorn observes the tiny elf. Merry gazes up at Aragorn inquisitively, and Aragorn recognizes the concern in Merry's expression. Aragorn pauses, lost in thought, as Merry peers up at the young ranger's visage, calm, tranquil, and serene. Aragorn and Merry's visages rotate as the iron gates tremble under another strike. The combat zone is in disarray as Dragons dismantle the brave Wolverines. Eowyn attempts to gather her troops amid the ocean of shouting soldiers and rearing steeds when abruptly the Dark Lord descends on his Winged Beast, grabbing Eowyn and her chariot."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "The first cascade of stones struck the Rohan sorcerers as the procession advances. Gandalf pivots on Shadowfax and hoists Pippin onto the elephant. The Rohan procession is overwhelming the sea. Meanwhile, Denethor dances on the carpet beside Faramir, sprinkling water over his own feet, which streams through his beard and down his neck, swiftly drenched in his garments. Faramir's ears twitch open, and as he attempts to concentrate through his stupor, water dribbles onto his back and clusters of waterlogged leaves are piled all around them. Servants hold glowing lanterns, anticipating their whispers. Denethor waves to them, and the servants drift toward the stack with lanterns gripped gently. At that instant, Gandalf and Pippin race into the glades, astride Shadowfax. The frightened servants withdraw from the stack, but with a roar, Denethor grabs a glowing lantern and flings it at the stack. The stack combusts as Gandalf canters toward it, toppling Denethor to his knees. Pippin jumps from Shadowfax onto the blazing stack with determined energy, shoving Faramir off. They cascade down the clusters of leaves onto the carpet, and Pippin smothers embers on Faramir's cloak. Denethor shrieks with fury and leaps over the stack, clawing and grappling at Pippin. Fire climbs up Denethor's water-drenched arms as he drags Pippin off Faramir. Shadowfax rises up and lashes at Denethor, who tumbles back onto the stack. He gazes into his son's ears, and for a fleeting moment, clarity returns before the fire devours him. Abruptly, Denethor tumbles off the stack, a howling, erratic ball of embers, and scampers across the meadow, vanishing out of the gate. Denethor scampers across the black lawn atop Minas Tirith and plummets directly over the 700-foot steep leap into the roaring city below. Denethor's demise plunge signals the Rohirrim gaining the edge, as immense packs of orcs are captured or are escaping. Theoden stands triumphant in his chariot, calling to his Rohirrim, but his expression of triumph turns to dread as enormous giraffe-like creatures, each carrying a watchtower crammed with Haradrim alchemists, emerge across the immense expanse of skirmish. Theoden on his chariot swirls amongst them while Gandalf glances at the tiny hobbit. Pippin gazes up at Gandalf inquisitively, and Gandalf perceives the dread in Pippin’s expression. Gandalf drifts off, lost in contemplation, as Pippin gazes up at the old wizard's visage, softened, serene, and filled with tranquility. Gandalf and Pippin's expressions shift as the iron gates vibrate under another hit. The battlefield is in turmoil as Oliphaunts overwhelm the brave Rohirrim. Theoden endeavours to gather his men amid the expanse of wailing men and neighing chariots when abruptly the Witch-King descends on his Drago, seizing Theoden and his chariot."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "The initial barrage of pumpkins struck the marshmallow farmers as the parade stumbles. Eugene dances around on Marigold and scoops Clara onto the dolphin. The marshmallow parade is overwhelming the circus. Meanwhile, Douglas stands on the sofa astride Gerald, spilling ink over his own shoulders, which dribbles through his beard and down his neck, quickly drenching his pajamas. Gerald's hands flutter open, and as he attempts to concentrate through his stupor, ink dribbles onto his sneakers and heaps of ink-saturated paper are piled all around them. Butler bots wield glowing candles, poised for their tasks. Douglas winks at them, and the butler bots edge closer to the grill with candles clutched firmly. At that instant, Eugene and Clara burst into the meadows, perched on Marigold. The cautious butler bots retreat from the grill, but with a cackle, Douglas grabs a glowing candle and flings it at the grill. The grill erupts as Eugene sprints toward it, bowling Douglas to his knees. Clara vaults from Marigold onto the flaming grill with frantic energy, shoving Gerald aside. They roll down the heaps of paper onto the tiles, and Clara pats down flames on Gerald's socks. Douglas howls with fury and bounds over the grill, wrenching and tugging at Clara. Flame climbs up Douglas's ink-sodden sleeves as he drags Clara off Gerald. Marigold rears up and tramples Douglas, who stumbles back onto the grill. He gazes into his cousin's glasses, and for a fleeting instant, clarity surfaces before the flames consume him. Abruptly, Douglas staggers off the grill, a shrieking, aimless inferno, and sprints across the meadow, vanishing out of the portal. Douglas dashes across the crimson lawn atop Orange Haven and plunges straight over the 700-meter vertical chasm into the flaming garden below. Douglas's fiery descent signals the acrobats seizing the upper foot, as vast herds of flamingos are captured or are fleeing. Theresa stands dignified in her buggy, hollering to her acrobats, but her expression of delight shifts to shock as massive giraffe-like robots, each hauling a sky-tower teeming with sentinel squirrels, arise across the broad ocean of garden. Theresa on her llama prances amongst them while Eugene glances at the tiny goblin. Clara looks up at Eugene questioningly, and Eugene notices the dread in Clara’s gaze. Eugene drifts away, lost in thought, as Clara peers up at the old pirate's visage, softened, serene, and full of dreams. Eugene and Clara's brows furrow as the brittle gates tremble under another thump. The garden is in turmoil as kites devastate the valiant acrobats. Theresa attempts to rally her crew amid the expanse of wailing monkeys and baying llamas when suddenly the Wind Spirit descends on her Cyclone, sweeping up Theresa and her llama."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "The first arrows hit the Rohan soldiers as their charge continues. Gandalf, on Shadowfax, pulls Pippin onto the horse. Denethor stands over Faramir, pouring oil over himself, preparing for a fiery end. As Denethor ignites the pyre, Gandalf and Pippin arrive just in time. Pippin leaps onto the pyre, saving Faramir, while Denethor, consumed by flames, runs wildly and falls from the city walls. His death signals a turn in battle against the orcs. Theoden leads the Rohirrim when massive Mumakil appear, packed with archers, causing chaos. As Theoden fights back, the Witch-King swoops down on his Nazgul and captures him, leaving the battle in turmoil."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Theoden and his horse Theoden tries to rally his men amid the sea of crying men and neighing horses when suddenly the WitchKing swoops down on his Nazgul scooping up  The battlefield is in chaos as Mumakil decimate the valiant Rohirrim  Gandalf and Pippin's faces turn as the wooden doors shudder under another blow  Gandalf breaks off lost in reverie as Pippin stares up at the old wizard's face softened quiet and full of peace  Pippin looks up at Gandalf questioningly and Gandalf sees the fear in Pippin’s eyes  Theoden on his horse circles amongst them while Gandalf looks at the small hobbit  archers appear across the vast sea of battle  Theoden stands proud in his saddle yelling to his Rohirrim but his look of joy turns to horror as massive elephantlike creatures each carrying a wartower packed with Haradrim  Denethor runs across the white court atop Minas Tirith and plummets straight over the 700foot sheer drop into the flaming city below Denethor's death plunge signals the Rohirrim gaining the upper hand as vast numbers of orcs are slain or are fleeing  Suddenly Denethor lurches off the pyre a screaming unguided ball of flame and runs across the chamber disappearing out of the door  He looks into his son's eyes and for a brief moment sanity returns before the flames engulf him  Shadowfax rears up and strikes at Denethor who falls back onto the pyre  Fire spreads up Denethor's oilsoaked back as he hauls Pippin off Faramir  Denethor screams with rage and leaps across the pyre ripping and tugging at Pippin  They tumble down the bundles of wood onto the floor and Pippin douses flames on Faramir's clothing  Pippin leaps from Shadowfax onto the burning pyre with desperate strength pushing Faramir off  The pyre ignites as Gandalf gallops toward it knocking Denethor to his feet  Denethor snatches a flaming torch and hurls it at the pyre  The fearful servants back away from the pyre but with a roar  At that moment Gandalf and Pippin burst into the hallows astride Shadowfax  Denethor nods to them and the servants approach the pyre with torches held firmly  Servants hold flaming torches awaiting their orders  Faramir's eyes flicker open and as he tries to focus through his delirium oil splashes onto his chest and bundles of oilsoaked wood are stacked all around them  Meanwhile Denethor stands on the table astride Faramir pouring oil over his own head which runs through his hair and down his face quickly soaking his robes  The Rohan charge is decimating the enemy  Gandalf wheels around on Shadowfax and pulls Pippin onto the horse  The first volley of arrows hit the Rohan soldiers as the charge continues "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Pippin looks up at Gandalf questioningly and Gandalf sees the fear in Pippin’s eyes  Denethor snatches a flaming torch and hurls it at the pyre  At that moment Gandalf and Pippin burst into the hallows astride Shadowfax  Denethor runs across the white court atop Minas Tirith and plummets straight over the 700foot sheer drop into the flaming city below Denethor's death plunge signals the Rohirrim gaining the upper hand as vast numbers of orcs are slain or are fleeing  Theoden on his horse circles amongst them while Gandalf looks at the small hobbit  The first volley of arrows hit the Rohan soldiers as the charge continues  The battlefield is in chaos as Mumakil decimate the valiant Rohirrim  archers appear across the vast sea of battle  Servants hold flaming torches awaiting their orders  Theoden and his horse Shadowfax rears up and strikes at Denethor who falls back onto the pyre  Denethor screams with rage and leaps across the pyre ripping and tugging at Pippin  Theoden tries to rally his men amid the sea of crying men and neighing horses when suddenly the WitchKing swoops down on his Nazgul scooping up  He looks into his son's eyes and for a brief moment sanity returns before the flames engulf him  Suddenly Denethor lurches off the pyre a screaming unguided ball of flame and runs across the chamber disappearing out of the door  Fire spreads up Denethor's oilsoaked back as he hauls Pippin off Faramir  Gandalf wheels around on Shadowfax and pulls Pippin onto the horse  The fearful servants back away from the pyre but with a roar  Theoden stands proud in his saddle yelling to his Rohirrim but his look of joy turns to horror as massive elephantlike creatures each carrying a wartower packed with Haradrim  Pippin leaps from Shadowfax onto the burning pyre with desperate strength pushing Faramir off  Gandalf breaks off lost in reverie as Pippin stares up at the old wizard's face softened quiet and full of peace  They tumble down the bundles of wood onto the floor and Pippin douses flames on Faramir's clothing  The Rohan charge is decimating the enemy  Meanwhile Denethor stands on the table astride Faramir pouring oil over his own head which runs through his hair and down his face quickly soaking his robes  The pyre ignites as Gandalf gallops toward it knocking Denethor to his feet  Gandalf and Pippin's faces turn as the wooden doors shudder under another blow  Denethor nods to them and the servants approach the pyre with torches held firmly  Faramir's eyes flicker open and as he tries to focus through his delirium oil splashes onto his chest and bundles of oilsoaked wood are stacked all around them "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Fire spreads up Denethor's oilsoaked back as he hauls Pippin off Faramir  Shadowfax rears up and strikes at Denethor who falls back onto the pyre  He looks into his son's eyes and for a brief moment sanity returns before the flames engulf him  Suddenly Denethor lurches off the pyre a screaming unguided ball of flame and runs across the chamber disappearing out of the door  Denethor runs across the white court atop Minas Tirith and plummets straight over the 700foot sheer drop into the flaming city below Denethor's death plunge signals the Rohirrim gaining the upper hand as vast numbers of orcs are slain or are fleeing  Theoden stands proud in his saddle yelling to his Rohirrim but his look of joy turns to horror as massive elephantlike creatures each carrying a wartower packed with Haradrim  archers appear across the vast sea of battle  Theoden on his horse circles amongst them while Gandalf looks at the small hobbit  Pippin looks up at Gandalf questioningly and Gandalf sees the fear in Pippin’s eyes  Gandalf breaks off lost in reverie as Pippin stares up at the old wizard's face softened quiet and full of peace  Gandalf and Pippin's faces turn as the wooden doors shudder under another blow  The battlefield is in chaos as Mumakil decimate the valiant Rohirrim  Theoden tries to rally his men amid the sea of crying men and neighing horses when suddenly the WitchKing swoops down on his Nazgul scooping up  Theoden and his horse The first volley of arrows hit the Rohan soldiers as the charge continues  Gandalf wheels around on Shadowfax and pulls Pippin onto the horse  The Rohan charge is decimating the enemy  Meanwhile Denethor stands on the table astride Faramir pouring oil over his own head which runs through his hair and down his face quickly soaking his robes  Faramir's eyes flicker open and as he tries to focus through his delirium oil splashes onto his chest and bundles of oilsoaked wood are stacked all around them  Servants hold flaming torches awaiting their orders  Denethor nods to them and the servants approach the pyre with torches held firmly  At that moment Gandalf and Pippin burst into the hallows astride Shadowfax  The fearful servants back away from the pyre but with a roar  Denethor snatches a flaming torch and hurls it at the pyre  The pyre ignites as Gandalf gallops toward it knocking Denethor to his feet  Pippin leaps from Shadowfax onto the burning pyre with desperate strength pushing Faramir off  They tumble down the bundles of wood onto the floor and Pippin douses flames on Faramir's clothing  Denethor screams with rage and leaps across the pyre ripping and tugging at Pippin "
        }
      ]
    }
  ]
}