{
  "ground_truth": "Sam begins to play it very softly and then prepares to move the piano away. For a long moment, he just looks at her. Meanwhile, Renault and Laszlo approach the table from the bar, and as Rick sees Ilsa, he stops short, appearing shocked. Sam stops playing. Two close-ups reveal Ilsa and Rick seeing each other, and Rick sits down as he and Ilsa look at each other. Laszlo signals the waiter, and Rick takes the check. Renault leaves, and Ilsa smiles as they join Renault at the curb. Sam now realizes Rick is in a very grim mood, and Sam sits down at the piano, starting to play softly, improvising. Suddenly, Rick pounds the table and buries his head in his arms before raising his head, trying to regain control, holding his head in his hands. Rick just stares ahead as orchestra music slowly joins Sam's playing. Later, Ilsa fixes flowers at the window while Rick opens champagne. Rick drives a small, open car slowly along the boulevard with the background scenery changing to a country road as she snuggles close to him and puts her head on his shoulder; he puts his arm around Ilsa. On an excursion boat on the Seine, Rick and Ilsa stand at the rail, seemingly transported by each other as Ilsa laughs. They see the Arc de Triomphe from a distance, and she walks over and joins him. They drink inside a swank Paris cafe, and Rick and Ilsa dance, appearing to be very much in love as the music plays. Ilsa flips a coin, then tosses it over to Rick, and they kiss passionately. During the backdrop of the rubble of a burned-out, demolished building, German troops cross a river as tanks roll down the road toward Paris and German war planes fly overhead. A man sells newspapers to people crowded around him, and there is much excitement. Rick and Ilsa sit at a table, buy a newspaper, and begin to read it while nearby, a group of frightened French people cluster around a loudspeaker on a wagon. At the bar, Rick gets glasses and a bottle of champagne, walks over to Ilsa and Sam at the piano, and pours the champagne. Ilsa seems unnerved, evidently having something on her mind, while Rick's manner is wry, but not the bitter wryness seen in Casablanca. Sam looks at his glass, and Rick and Ilsa look at each other, then hurry to the window. She smiles faintly and looks at him tenderly. Rick takes her in his arms and kisses her hungrily, and while locked in an embrace, they hear the dull boom of cannons, to which Ilsa reacts worriedly. Ilsa looks at Rick, and he chuckles, then chuckles again.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Sure, here's the transformed text with synonyms:\n\nSam starts to perform it very gently and then prepares to shift the piano away. For a lengthy instant, he just gazes at her. Meanwhile, Renault and Laszlo advance toward the table from the bar, and as Rick notices Ilsa, he pauses abruptly, seeming stunned. Sam ceases playing. Two close-ups disclose Ilsa and Rick observing each other, and Rick sits down as he and Ilsa gaze at each other. Laszlo gestures to the waiter, and Rick receives the bill. Renault departs, and Ilsa grins as they join Renault at the sidewalk. Sam now comprehends Rick is in a very bleak mood, and Sam sits down at the piano, beginning to perform gently, ad-libbing. Suddenly, Rick strikes the table and buries his face in his arms before raising his face, attempting to regain control, holding his face in his hands. Rick just stares forward as orchestra music slowly joins Sam's performance. Later, Ilsa arranges flowers at the window while Rick uncorks champagne. Rick pilots a small, open vehicle slowly along the avenue with the background panorama changing to a rural road as she cuddles close to him and places her head on his shoulder; he wraps his arm around Ilsa. On an outing vessel on the Seine, Rick and Ilsa stand at the rail, seemingly enraptured by each other as Ilsa chuckles. They glimpse the Arc de Triomphe from a distance, and she walks over and joins him. They drink inside a chic Paris café, and Rick and Ilsa sway, seeming to be very much enamored as the music plays. Ilsa flips a coin, then tosses it over to Rick, and they kiss ardently. Against the backdrop of the debris of a charred, razed structure, German forces cross a river as tanks roll down the road toward Paris and German warplanes fly overhead. A man sells newspapers to people crowded around him, and there is much fervor. Rick and Ilsa sit at a table, purchase a newspaper, and start to read it while nearby, a group of terrified French citizens cluster around a loudspeaker on a cart. At the bar, Rick retrieves glasses and a bottle of champagne, walks over to Ilsa and Sam at the piano, and pours the champagne. Ilsa seems unsettled, evidently having something on her mind, while Rick's manner is dry, but not the bitter dryness seen in Casablanca. Sam glances at his glass, and Rick and Ilsa gaze at each other, then rush to the window. She smiles faintly and gazes at him tenderly. Rick takes her in his arms and kisses her fervently, and while locked in a clinch, they hear the muted boom of cannons, to which Ilsa reacts anxiously. Ilsa gazes at Rick, and he laughs, then laughs again."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Sam begins to play it very softly, and then the piano is prepared to be moved away by him. For a long moment, she is just looked at by him. Meanwhile, the table is approached by Renault and Laszlo from the bar, and as Ilsa is seen by Rick, he stops short, appearing shocked. The playing is stopped by Sam. Two close-ups reveal Ilsa and Rick seeing each other, and Rick sits down as they look at each other. The waiter is signaled by Laszlo, and the check is taken by Rick. Renault leaves, and Ilsa smiles as Renault is joined by them at the curb. Sam now realizes Rick is in a very grim mood, and the piano is sat down at by Sam, with soft improvisation starting to be played. Suddenly, the table is pounded by Rick, and his head is buried in his arms by him before his head is raised, trying to regain control, and his head is held in his hands by him. Rick just stares ahead as Sam's playing joins with the orchestra music slowly. Later, flowers are fixed at the window by Ilsa while champagne is opened by Rick. A small, open car is driven slowly along the boulevard by Rick with the background scenery changing to a country road as she snuggles close to him and puts her head on his shoulder; Ilsa is put his arm around by him. On an excursion boat on the Seine, the rail is stood at by Rick and Ilsa, seemingly transported by each other as Ilsa laughs. The Arc de Triomphe is seen from a distance by them, and he is joined by her as she walks over. Inside a swank Paris cafe, drinks are consumed, and Rick and Ilsa dance, appearing to be very much in love as the music plays. A coin is flipped by Ilsa, then it is tossed over to Rick, and they kiss passionately. During the backdrop of the rubble of a burned-out, demolished building, a river is crossed by German troops as tanks roll down the road toward Paris and German war planes fly overhead. Newspapers are sold by a man to people crowded around him, and there is much excitement. Rick and Ilsa sit at a table, and a newspaper is bought by them and read while nearby, a group of frightened French people cluster around a loudspeaker on a wagon. At the bar, glasses and a bottle of champagne are gotten by Rick, who walks over to Ilsa and Sam at the piano and pours the champagne. Ilsa seems unnerved, evidently having something on her mind, while Rick's manner is wry, but it is not the bitter wryness seen in Casablanca. His glass is looked at by Sam, and Rick and Ilsa look at each other, then the window is hurried to by them. She smiles faintly and him is looked at tenderly by her. Ilsa is taken by Rick in his arms and kissed hungrily, and while they are locked in an embrace, the dull boom of cannons is heard, to which Ilsa reacts worriedly. Rick is looked at by Ilsa, and he chuckles, then he chuckles again."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Sam begins playing softly, preparing to move the piano. He looks at her for a moment. Meanwhile, Renault and Laszlo arrive, and Rick, shocked at seeing Ilsa, pauses. Sam stops playing. Close-ups show Ilsa and Rick meeting eyes; Rick sits, exchanging glances with Ilsa. Laszlo signals the waiter, and Rick collects the check. Renault departs, and Ilsa smiles as they join him at the curb. Realizing Rick is grim, Sam sits at the piano, softly improvising. Suddenly, Rick pounds the table, burying his head in his arms, then raises it, trying to regain composure, staring ahead as orchestra music joins Sam's playing. Later, Ilsa arranges flowers as Rick opens champagne. He drives slowly with changing scenery, and Ilsa snuggles up, head on his shoulder; he embraces her. On the Seine, Rick and Ilsa stand at the rail, captivated by each other, as Ilsa laughs. They view the Arc de Triomphe, and she joins him. In a Paris cafe, they drink and dance, in love as music plays. Ilsa flips a coin, tosses it to Rick, and they kiss passionately. Amid the rubble of a demolition, German troops and tanks approach Paris, with planes overhead. A man sells newspapers amid excited crowds. Rick and Ilsa, at a table, buy a paper and read as frightened French people gather around a loudspeaker. Rick pours champagne for Ilsa and Sam at the piano. Ilsa is uneasy, and Rick's demeanor is wry but not bitter. They exchange looks and hurry to the window. She smiles faintly, tenderly gazing at Rick. He takes her in his arms, kissing her deeply; they hear cannons' boom, which worries Ilsa. She looks at Rick, and he chuckles twice."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Sam starts playing softly, preparing to move the piano. He pauses, looking at her. Renault and Laszlo approach from the bar. Seeing Ilsa, Rick pauses, shocked. Sam stops. Close-ups show Ilsa and Rick seeing each other. Rick sits, meeting Ilsa's gaze. Laszlo signals the waiter, and Rick takes the check. Ilsa smiles, joining Renault at the curb. Sam notices Rick's grim mood, sits at the piano, and starts improvising softly. Rick suddenly pounds the table, buries his head, then regains composure, staring as orchestra music accompanies Sam. Later, Ilsa arranges flowers as Rick opens champagne. Rick drives slowly, Ilsa snuggles close. On a Seine excursion boat, they seem entranced, Ilsa laughs. They view the Arc de Triomphe, drink in a Paris cafe, dance lovingly. Ilsa tosses a coin to Rick, they kiss passionately. Amid ruins, German troops and tanks approach Paris. A man sells newspapers to excited crowds. Rick and Ilsa read a paper while frightened French gather by a loudspeaker. At the bar, Rick brings champagne to Ilsa and Sam, pouring it. Ilsa seems troubled, Rick is wry but not bitter like in Casablanca. Sam looks at his glass; Rick and Ilsa share a tender glance, hurry to the window. Ilsa smiles faintly, looks tenderly at Rick. He embraces and kisses her, they hear cannons, she reacts worriedly. Ilsa looks at Rick, and he chuckles twice."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Sam begins to play the piano very softly, his fingers gently gliding over the keys, and then he carefully prepares to move the piano away. For what feels like a long, drawn-out moment, he simply gazes at her with a thoughtful expression. Meanwhile, Renault and Laszlo make their way toward the table from the bustling bar area, and as Rick catches sight of Ilsa, he halts suddenly, an expression of shock and disbelief spreading across his face. Sam, too, ceases his playing abruptly. Two close-up shots reveal Ilsa and Rick locking eyes, a deep connection evident between them, and Rick, appearing somewhat overwhelmed, takes a seat. As he and Ilsa continue to exchange meaningful glances, Laszlo signals the waiter over, and Rick reaches out to take care of the check. Renault departs from the scene, and Ilsa, with a soft smile on her face, joins Renault at the curb. Sam, now fully aware of Rick’s somber and grim demeanor, settles down at the piano once more and begins to play softly, his notes weaving a gentle improvisation. Suddenly, with a burst of emotion, Rick pounds the table, and then he buries his head in his arms before raising it again, striving to regain his composure as he holds his head in his hands. Rick, with a distant look in his eyes, just stares ahead while the gentle strains of orchestra music gradually blend with Sam’s playing. Later on, Ilsa is seen arranging flowers meticulously at the window, while Rick skillfully opens a bottle of champagne. Rick is then driving a small, open car at a leisurely pace along the boulevard, with the changing scenery in the background transitioning to a peaceful country road. Ilsa snuggles close to him, resting her head affectionately on his shoulder, and he lovingly wraps his arm around her. On an excursion boat gliding along the Seine, Rick and Ilsa stand side by side at the rail, seemingly lost in each other’s presence, as Ilsa laughs with delight. They catch sight of the Arc de Triomphe from afar, and she walks over to join him. Inside a glamorous Parisian cafe, they sip their drinks, and as romantic music fills the air, Rick and Ilsa dance together, appearing deeply in love. Ilsa playfully flips a coin, then tosses it over to Rick, and they share a passionate kiss. Amidst the backdrop of the rubble from a burned-out, demolished building, German troops are seen crossing a river as tanks roll ominously down the road toward Paris and warplanes roar overhead. A man is busy selling newspapers to a crowd of eager people gathered around him, full of excitement. Rick and Ilsa sit side by side at a table, purchasing a newspaper, and begin to read it, while nearby, a group of frightened French citizens huddle around a loudspeaker mounted on a wagon. At the bar, Rick collects some glasses and a bottle of champagne, walking over to join Ilsa and Sam at the piano, where he proceeds to pour the champagne. Ilsa appears slightly unnerved, her expression hinting that something weighs on her mind, whereas Rick’s demeanor is marked by a wryness that lacks the bitter edge seen in Casablanca. Sam glances down at his glass thoughtfully, and Rick and Ilsa exchange looks before quickly moving towards the window. She offers him a faint smile, looking at him with tender affection. Rick pulls her into his arms and kisses her with intense hunger. As they remain locked in a passionate embrace, the distant, dull boom of cannons reverberates through the air, prompting Ilsa to react with concern. She looks at Rick, who responds with a chuckle, then chuckles once more."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Sam begins to play the piano very softly, his fingers gently and gracefully gliding over the keys, producing a tender melody. He then carefully and thoughtfully prepares himself to move the piano away. For what seems like a long, drawn-out moment that stretches time, he simply gazes at her with a thoughtful expression, his eyes filled with contemplation. Meanwhile, Renault and Laszlo make their way toward the table from the bustling, lively bar area, weaving through the energetic crowd, and as Rick catches sight of Ilsa, he abruptly halts, an expression of shock and disbelief quickly spreading across his face. Sam, too, ceases his playing suddenly. Two close-up shots reveal Ilsa and Rick locking eyes, a deep and meaningful connection evident between them, and Rick, appearing somewhat overwhelmed by emotion, takes a seat. As he and Ilsa continue to exchange meaningful, lingering glances, Laszlo signals the attentive waiter over, and Rick reaches out to take care of the check. Renault departs from the scene, and Ilsa, with a soft, gentle smile on her face, joins Renault at the curb outside. Sam, now fully aware of Rick’s somber and grim demeanor, settles down at the piano once more and begins to play softly again, his notes weaving a gentle, soothing improvisation. Suddenly, with a burst of pent-up emotion, Rick pounds the table, and then he buries his head in his arms before raising it again, striving to regain his composure as he holds his head in his hands. Rick, with a distant, faraway look in his eyes, just stares ahead while the gentle strains of orchestra music gradually blend with Sam’s playing. Later on, Ilsa is seen meticulously arranging flowers at the window, while Rick skillfully opens a bottle of champagne. Rick is then driving a small, open car at a leisurely and relaxed pace along the boulevard, with the changing scenery in the background transitioning seamlessly to a peaceful country road. Ilsa snuggles close to him, resting her head affectionately on his shoulder, and he lovingly wraps his arm around her, drawing her in closer. On an excursion boat gliding smoothly along the Seine, Rick and Ilsa stand side by side at the rail, seemingly lost in each other’s presence, as Ilsa laughs with delight and joy. They catch sight of the majestic Arc de Triomphe from afar, and she walks over to join him. Inside a glamorous, bustling Parisian cafe, they sip their drinks, and as romantic, enchanting music fills the air, Rick and Ilsa dance together, appearing deeply, hopelessly in love. Ilsa playfully flips a coin, then tosses it over to Rick, and they share a passionate, lingering kiss. Amidst the backdrop of the rubble from a burned-out, demolished building, German troops are seen crossing a river as tanks roll ominously down the road toward Paris and warplanes roar overhead, filling the sky with menace. A man is busy selling newspapers to a crowd of eager, excited people gathered around him, full of excitement and anticipation. Rick and Ilsa sit side by side at a table, purchasing a newspaper, and begin to read it together, while nearby, a group of frightened French citizens huddle around a loudspeaker mounted on a wagon. At the bar, Rick collects some glasses and a bottle of champagne, walking over to join Ilsa and Sam at the piano, where he proceeds to pour the sparkling champagne. Ilsa appears slightly unnerved, her expression hinting that something weighs heavily on her mind, whereas Rick’s demeanor is marked by a wryness that lacks the bitter edge seen in Casablanca. Sam glances down at his glass thoughtfully, and Rick and Ilsa exchange looks before quickly moving towards the window. She offers him a faint, tender smile, looking at him with tender affection. Rick pulls her into his arms and kisses her with intense, passionate hunger. As they remain locked in a passionate embrace, the distant, dull boom of cannons reverberates ominously through the air, prompting Ilsa to react with growing concern. She looks at Rick, who responds with a chuckle, then chuckles once more, as if trying to dispel the tension."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Sam begins his delicate performance, gently tapping the piano keys to produce a soft melody, and then pauses as he prepares to shift the piano away from where it stands. He pauses and lets his gaze linger on her, absorbing the moment. Meanwhile, Renault and Laszlo make their way slowly from the bar towards the table, causing a subtle stir in the room. As Rick catches sight of Ilsa, he halts abruptly, his expression turning to one of shock, a clear sign of his surprise and emotion. Sam ceases playing at this pivotal moment, allowing silence to fill the space. Two close-up shots capture the intense exchange between Ilsa and Rick as they lock eyes, each moment imbued with significance. Rick, grounding himself, settles into a chair, maintaining eye contact with Ilsa, reflecting a myriad of emotions. Concurrently, Laszlo gestures to beckon the waiter, and Rick extends his hand to take the check, signaling a transactional end to the previous interaction. Renault takes his leave, creating an opening for Ilsa, who graces them with a warm smile as they join Renault at the edge of the curb. Sensing the change in Rick's demeanor, Sam reassumes his position at the piano, gently pressing the keys again to craft a soft, improvised melody that fills the room with a calming presence. Abruptly, Rick's hand strikes the table, a physical manifestation of his internal struggle, then he collapses forward, his head enveloped by his arms in a posture of defeat. Gradually, he lifts his head, endeavoring to regain his composure by cradling his head in his hands, fighting to reclaim a semblance of control over his emotions. He stares blankly ahead, lost in a world of thought, as the orchestra's music subtly merges with Sam's piano, crafting a rich tapestry of sound that heightens the scene's emotional depth. In a later moment, Ilsa attentively arranges flowers near the window, a domestic act that contrasts with the tension earlier, while Rick uncorks a bottle of champagne, signaling celebration. As Rick maneuvers a small, open car down the boulevard, the cityscape transitions to a serene country road; Ilsa nestles close, laying her head on his shoulder, seeking comfort, while he envelops her with his arm, securing a shared sense of safety. On an excursion boat traversing the Seine, Rick and Ilsa stand side by side at the rail, lost in each other's presence as Ilsa's laughter echoes lightly in the air. They share a distant view of the Arc de Triomphe, a majestic symbol of Paris, and with quiet steps, she moves closer to join him, reinforcing their connection. Seated within the luxurious setting of a Parisian cafe, they drink and share a dance, their movements and expressions revealing the depth of their affection as the soothing music surrounds them. Ilsa, in a moment of whimsy, flicks a coin into the air, sending it towards Rick, and they seal the gesture with a passionate kiss, affirming their love amidst their surroundings. During this backdrop, the ominous presence of German troops becomes apparent; soldiers cross a river, tanks command the roads leading to Paris, and planes loom overhead, casting shadows that suggest impending conflict. A man actively distributes newspapers to eagerly assembled crowds, capturing the rising tide of excitement and dread. Seated at a table, Rick and Ilsa procure a newspaper and begin to read, absorbing the news while nearby, a cluster of anxious French citizens gathers around a loudspeaker mounted on a wagon, their faces etched with concern. At the bar, Rick pours two glasses of champagne, walking over to join Ilsa and Sam where Sam continues to play. As champagne fills the glasses, Ilsa appears unsettled, her heart clearly carrying a burden, while Rick presents a facade of wry humor, though it lacks the bitterness seen later in Casablanca. Sam studies his glass thoughtfully, while Rick and Ilsa exchange a meaningful glance that urges them to move swiftly to the window. She graces him with a faint, tender smile, offering silent reassurance. In a moment suffused with yearning, Rick wraps Ilsa in his arms, drawing her into a fervent kiss. The embrace is interrupted by the dull, distant sound of cannons, which causes Ilsa to pull back with a worried look. She gazes at Rick, who responds with a chuckle to ease the tension, and then, finding humor in the situation, he chuckles once more."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Sam begins playing softly before preparing to move the piano, momentarily pausing to look at her. Meanwhile, Renault and Laszlo approach from the bar, and Rick, upon seeing Ilsa, stops abruptly, looking shocked as Sam ceases playing. Close-ups reveal the exchanged glances between Ilsa and Rick, who then sits down. Laszlo signals the waiter and Rick takes the check. Renault departs, and Ilsa smiles as they join Renault at the curb. Recognizing Rick's grim mood, Sam sits at the piano, playing softly and improvising. Abruptly, Rick pounds the table, buries his head in his arms, then raises his head, attempting to regain composure while holding his head in his hands. As orchestra music joins Sam's playing, Rick stares ahead. Later, Ilsa arranges flowers by the window while Rick opens champagne. Driving slowly along the boulevard, they transition to a country road; Ilsa snuggles close, resting her head on Rick's shoulder as he wraps an arm around her. On a Seine excursion boat, they stand at the rail, entranced by each other as Ilsa laughs. Viewing the Arc de Triomphe from afar, Ilsa joins Rick, and they drink in a Paris cafe, dancing lovingly to the music. Ilsa flips a coin to Rick, and they share a passionate kiss. Amidst the backdrop of a ravaged building, German troops cross a river with tanks approaching Paris and war planes overhead. A man sells newspapers to an excited crowd; Rick and Ilsa buy a paper and read it as nearby, anxious French gather around a wagon loudspeaker. At the bar, Rick takes glasses and champagne, joins Ilsa and Sam at the piano, and pours drinks. Ilsa appears troubled, with Rick's demeanor wry yet softer than in Casablanca. Sam looks at his glass, and Rick and Ilsa exchange glances before rushing to the window. Ilsa smiles faintly, gazing at him tenderly. Rick embraces and kisses her deeply, and as they hear cannon booms, Ilsa reacts with worry, looking at Rick, who chuckles twice."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Sam, who is a skilled pianist with years of experience, begins to play it very softly and then prepares to move the piano away. For a long moment, he just looks at her, conveying a deep unspoken understanding. Meanwhile, Renault and Laszlo, two well-known figures in the local resistance movement, approach the table from the bar, and as Rick sees Ilsa, he stops short, appearing shocked. Sam stops playing. Two close-ups reveal Ilsa and Rick seeing each other, and Rick sits down as he and Ilsa look at each other, their history together creating a palpable tension. Laszlo signals the waiter, who is known for his discretion, and Rick takes the check. Renault leaves, and Ilsa smiles as they join Renault at the curb, the busy Parisian street bustling around them. Sam now realizes Rick is in a very grim mood, reminiscent of past troubles, and Sam sits down at the piano, starting to play softly, improvising a tune filled with melancholy. Suddenly, Rick pounds the table, a rare display of emotion for him, and buries his head in his arms before raising his head, trying to regain control, holding his head in his hands. Rick just stares ahead as orchestra music, which is often used to underscore pivotal moments in their lives, slowly joins Sam's playing. \n\nLater, Ilsa fixes flowers at the window of their small Paris apartment while Rick opens champagne, a ritual they have shared many times. Rick drives a small, open car slowly along the boulevard, basking in the picturesque views of Paris, with the background scenery changing to a country road as she snuggles close to him and puts her head on his shoulder; he puts his arm around Ilsa, offering her comfort and protection. On an excursion boat on the Seine, one of Paris's most iconic rivers, Rick and Ilsa stand at the rail, seemingly transported by each other as Ilsa laughs. They see the Arc de Triomphe from a distance, a symbol of French resilience, and she walks over and joins him. They drink inside a swank Paris cafe, known for its vibrant evening atmosphere, and Rick and Ilsa dance, appearing to be very much in love as the music plays. Ilsa flips a coin, a playful gesture with a history of bringing them luck, then tosses it over to Rick, and they kiss passionately. \n\nDuring the backdrop of the rubble of a burned-out, demolished building, German troops, part of the advancing forces in World War II, cross a river as tanks roll down the road toward Paris and German war planes fly overhead. A man sells newspapers to people crowded around him, and there is much excitement, signaling the tension and anticipation of an impending invasion. Rick and Ilsa sit at a table, buy a newspaper, and begin to read it while nearby, a group of frightened French people cluster around a loudspeaker on a wagon, hearing the latest announcements about the war. At the bar, Rick gets glasses and a bottle of champagne, an act of attempting to maintain normalcy amidst chaos, walks over to Ilsa and Sam at the piano, and pours the champagne. Ilsa seems unnerved, evidently having something on her mind, possibly the uncertainty of their future, while Rick's manner is wry, but not the bitter wryness seen in Casablanca, a reflection of the time when circumstances had driven a wedge between them. Sam looks at his glass, and Rick and Ilsa look at each other, then hurry to the window, drawn by the sounds outside. She smiles faintly and looks at him tenderly. Rick takes her in his arms and kisses her hungrily, and while locked in an embrace, they hear the dull boom of cannons, a reminder of the war's encroachment, to which Ilsa reacts worriedly. Ilsa looks at Rick, and he chuckles, then chuckles again, trying to reassure her in the face of uncertainty."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Meanwhile Renault and Laszlo approach the table from the bar and as Rick sees Ilsa he stops short appearing shocked Sam begins to play it very softly and then prepares to move the piano away Suddenly Rick pounds the table and buries his head in his arms before raising his head trying to regain control holding his head in his hands For a long moment he just looks at her At the bar Rick gets glasses and a bottle of champagne walks over to Ilsa and Sam at the piano and pours the champagne Meanwhile Renault and Laszlo approach the table from the bar and as Rick sees Ilsa he stops short appearing shocked Sam stops playing Two closeups reveal Ilsa and Rick seeing each other and Rick sits down as he and Ilsa look at each other Sam stops playing Sam begins to play it very softly and then prepares to move the piano away On an excursion boat on the Seine Rick and Ilsa stand at the rail seemingly transported by each other as Ilsa laughs Laszlo signals the waiter and Rick takes the check Renault leaves and Ilsa smiles as they join Renault at the curb Sam now realizes Rick is in a very grim mood and Sam sits down at the piano starting to play softly improvising Sam now realizes Rick is in a very grim mood and Sam sits down at the piano starting to play softly improvising Suddenly Rick pounds the table and buries his head in his arms before raising his head trying to regain control holding his head in his hands Two closeups reveal Ilsa and Rick seeing each other and Rick sits down as he and Ilsa look at each other Rick just stares ahead as orchestra music slowly joins Sam's playing Later Ilsa fixes flowers at the window while Rick opens champagne During the backdrop of the rubble of a burnedout demolished building German troops cross a river as tanks roll down the road toward Paris and German war planes fly overhead Rick drives a small open car slowly along the boulevard with the background scenery changing to a country road as she snuggles close to him and puts her head on his shoulder They see the Arc de Triomphe from a distance and she walks over and joins him he puts his arm around Ilsa Sam looks at his glass and Rick and Ilsa look at each other then hurry to the window On an excursion boat on the Seine Rick and Ilsa stand at the rail seemingly transported by each other as Ilsa laughs They see the Arc de Triomphe from a distance and she walks over and joins him They drink inside a swank Paris cafe and Rick and Ilsa dance appearing to be very much in love as the music plays Ilsa flips a coin then tosses it over to Rick and they kiss passionately She smiles faintly and looks at him tenderly During the backdrop of the rubble of a burnedout demolished building German troops cross a river as tanks roll down the road toward Paris and German war planes fly overhead A man sells newspapers to people crowded around him and there is much excitement Rick and Ilsa sit at a table buy a newspaper and begin to read it while nearby a group of frightened French people cluster around a loudspeaker on a wagon Ilsa seems unnerved evidently having something on her mind Rick takes her in his arms and kisses her hungrily and while locked in an embrace they hear the dull boom of cannons to which Ilsa reacts worriedly At the bar Rick gets glasses and a bottle of champagne walks over to Ilsa and Sam at the piano and pours the champagne Ilsa seems unnerved evidently having something on her mind while Rick's manner is wry but not the bitter wryness seen in Casablanca Sam looks at his glass and Rick and Ilsa look at each other then hurry to the window She smiles faintly and looks at him tenderly Rick takes her in his arms and kisses her hungrily and while locked in an embrace they hear the dull boom of cannons to which Ilsa reacts worriedly Ilsa looks at Rick and he chuckles then chuckles again"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Sam begins to play it very softly and then prepares to move the piano away. For a long moment he just looks at her. Meanwhile Renault and Laszlo approach the table from the bar and as Rick sees Ilsa he stops short appearing shocked. Sam stops playing. Two closeups reveal Ilsa and Rick seeing each other and Rick sits down as he and Ilsa look at each other. Laszlo signals the waiter and Rick takes the check. Renault leaves and Ilsa smiles as they join Renault at the curb. Sam now realizes Rick is in a very grim mood and Sam sits down at the piano starting to play softly improvising. Suddenly Rick pounds the table and buries his head in his arms before raising his head trying to regain control holding his head in his hands. Rick just stares ahead as orchestra music slowly joins Sam's playing. Later Ilsa fixes flowers at the window while Rick opens champagne. Rick drives a small open car slowly along the boulevard with the background scenery changing to a country road as she snuggles close to him and puts her head on his shoulder. he puts his arm around Ilsa. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On an excursion boat on the Seine Rick and Ilsa stand at the rail seemingly transported by each other as Ilsa laughs. They see the Arc de Triomphe from a distance and she walks over and joins him. They drink inside a swank Paris cafe and Rick and Ilsa dance appearing to be very much in love as the music plays. Ilsa flips a coin then tosses it over to Rick and they kiss passionately. During the backdrop of the rubble of a burnedout demolished building German troops cross a river as tanks roll down the road toward Paris and German war planes fly overhead. A man sells newspapers to people crowded around him and there is much excitement. Rick and Ilsa sit at a table buy a newspaper and begin to read it while nearby a group of frightened French people cluster around a loudspeaker on a wagon. At the bar Rick gets glasses and a bottle of champagne walks over to Ilsa and Sam at the piano and pours the champagne. Ilsa seems unnerved evidently having something on her mind. while Rick's manner is wry but not the bitter wryness seen in Casablanca. Sam looks at his glass and Rick and Ilsa look at each other then hurry to the window. She smiles faintly and looks at him tenderly. Rick takes her in his arms and kisses her hungrily and while locked in an embrace they hear the dull boom of cannons to which Ilsa reacts worriedly. Ilsa looks at Rick and he chuckles then chuckles again."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Sam begins to play it very softly and then prepares to move the piano away. For a long moment he just looks at her. Meanwhile Renault and Laszlo approach the table from the bar and as Rick sees Ilsa he stops short appearing shocked. Sam stops playing. Two closeups reveal Ilsa and Rick seeing each other and Rick sits down as he and Ilsa look at each other. Laszlo signals the waiter and Rick takes the check. Renault leaves and Ilsa smiles as they join Renault at the curb. Sam now realizes Rick is in a very grim mood and Sam sits down at the piano starting to play softly improvising. Suddenly Rick pounds the table and buries his head in his arms before raising his head trying to regain control holding his head in his hands. Rick just stares ahead as orchestra music slowly joins Sam's playing. Later Ilsa fixes flowers at the window while Rick opens champagne. Rick drives a small open car slowly along the boulevard with the background scenery changing to a country road as she snuggles close to him and puts her head on his shoulder. he puts his arm around Ilsa. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On an excursion boat on the Seine Rick and Ilsa stand at the rail seemingly transported by each other as Ilsa laughs. They see the Arc de Triomphe from a distance and she walks over and joins him. They drink inside a swank Paris cafe and Rick and Ilsa dance appearing to be very much in love as the music plays. Ilsa flips a coin then tosses it over to Rick and they kiss passionately. During the backdrop of the rubble of a burnedout demolished building German troops cross a river as tanks roll down the road toward Paris and German war planes fly overhead. A man sells newspapers to people crowded around him and there is much excitement. Rick and Ilsa sit at a table buy a newspaper and begin to read it while nearby a group of frightened French people cluster around a loudspeaker on a wagon. At the bar Rick gets glasses and a bottle of champagne walks over to Ilsa and Sam at the piano and pours the champagne. Ilsa seems unnerved evidently having something on her mind. while Rick's manner is wry but not the bitter wryness seen in Casablanca. Sam looks at his glass and Rick and Ilsa look at each other then hurry to the window. She smiles faintly and looks at him tenderly. Rick takes her in his arms and kisses her hungrily and while locked in an embrace they hear the dull boom of cannons to which Ilsa reacts worriedly. Ilsa looks at Rick and he chuckles then chuckles again."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Sam begins to play it very softly and then prepares to move the piano away. For a long moment he just looks at her. Meanwhile Renault and Laszlo approach the table from the bar and as Rick sees Ilsa he stops short appearing shocked. Sam stops playing. Two closeups reveal Ilsa and Rick seeing each other and Rick sits down as he and Ilsa look at each other. Laszlo signals the waiter and Rick takes the check. Renault leaves and Ilsa smiles as they join Renault at the curb. At the bar Rick gets glasses and a bottle of champagne walks over to Ilsa and Sam at the piano and pours the champagne. Ilsa seems unnerved evidently having something on her mind. while Rick's manner is wry but not the bitter wryness seen in Casablanca. Sam looks at his glass and Rick and Ilsa look at each other then hurry to the window. She smiles faintly and looks at him tenderly. Rick takes her in his arms and kisses her hungrily and while locked in an embrace they hear the dull boom of cannons to which Ilsa reacts worriedly. Ilsa looks at Rick and he chuckles then chuckles again."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Sam begins to play it very softly and then prepares to move the piano away. For a long moment he just looks at her. Meanwhile Renault and Laszlo approach the table from the bar and as Rick sees Ilsa he stops short appearing shocked. She smiles faintly and looks at him tenderly. Rick takes her in his arms and kisses her hungrily and while locked in an embrace they hear the dull boom of cannons to which Ilsa reacts worriedly. Ilsa looks at Rick and he chuckles then chuckles again."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "A penguin begins to play it very softly and then prepares to move the piano away. For a long moment, the penguin just looks at a lamp. Meanwhile, a seagull and a turtle approach the table from the bar, and as a flower sees a cloud, it stops short, appearing shocked. The penguin stops playing. Two close-ups reveal the cloud and the flower seeing each other, and the flower sits down as it and the cloud look at each other. The turtle signals the waiter, and the flower takes the check. The seagull leaves, and the cloud smiles as they join the seagull at the curb. The penguin now realizes the flower is in a very grim mood, and the penguin sits down at the piano, starting to play softly, improvising. Suddenly, the flower pounds the table and buries its head in its arms before raising its head, trying to regain control, holding its head in its hands. The flower just stares ahead as orchestra music slowly joins the penguin's playing. Later, the cloud fixes flowers at the window while the flower opens champagne. The flower drives a small, open car slowly along the boulevard with the background scenery changing to a country road as a stone snuggles close to it and puts its head on the flower's shoulder; it puts its arm around the cloud. On an excursion boat on the Seine, the flower and the cloud stand at the rail, seemingly transported by each other as the cloud laughs. They see the Arc de Triomphe from a distance, and a stone walks over and joins it. They drink inside a swank Paris cafe, and the flower and the cloud dance, appearing to be very much in love as the music plays. The cloud flips a coin, then tosses it over to the flower, and they kiss passionately. During the backdrop of the rubble of a burned-out, demolished building, German troops cross a river as tanks roll down the road toward Paris and German war planes fly overhead. A squirrel sells newspapers to chairs crowded around it, and there is much excitement. The flower and the cloud sit at a table, buy a newspaper, and begin to read it while nearby, a group of frightened French spoons cluster around a loudspeaker on a wagon. At the bar, the flower gets glasses and a bottle of champagne, walks over to the cloud and the penguin at the piano, and pours the champagne. The cloud seems unnerved, evidently having something on its mind, while the flower's manner is wry, but not the bitter wryness seen in Casablanca. The penguin looks at its glass, and the flower and the cloud look at each other, then hurry to the window. A spoon smiles faintly and looks at it tenderly. The flower takes it in its arms and kisses it hungrily, and while locked in an embrace, they hear the dull boom of cannons, to which the cloud reacts worriedly. The cloud looks at the flower, and it chuckles, then chuckles again."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Sam begins to play it very softly and then prepares to move the harp away. For a long moment, he just looks at her. Meanwhile, Renault and Laszlo approach the bench from the deli, and as Rick sees Ilsa, he stops short, appearing shocked. Sam stops playing. Two close-ups reveal Ilsa and Rick seeing each other, and Rick sits down as he and Ilsa look at each other. Laszlo signals the busboy, and Rick takes the receipt. Renault leaves, and Ilsa smiles as they join Renault at the dock. Sam now realizes Rick is in a very grim mood, and Sam sits down at the harp, starting to play softly, improvising. Suddenly, Rick pounds the podium and buries his head in his arms before raising his head, trying to regain control, holding his head in his hands. Rick just stares ahead as symphony music slowly joins Sam's playing. Later, Ilsa fixes candles at the window while Rick opens cider. Rick drives a small, open carriage slowly along the promenade with the background scenery changing to a forest path as she snuggles close to him and puts her head on his shoulder; he puts his arm around Ilsa. On an excursion bus on the Rhine, Rick and Ilsa stand at the aisle, seemingly transported by each other as Ilsa laughs. They see the Eiffel Tower from a distance, and she walks over and joins him. They drink inside a swank Rome bistro, and Rick and Ilsa dance, appearing to be very much in love as the music plays. Ilsa flips a marble, then tosses it over to Rick, and they kiss passionately. During the backdrop of the debris of a dilapidated, crumbled bridge, German troops cross a field as tanks roll down the trail toward Munich and German war balloons fly overhead. A man sells photographs to people crowded around him, and there is much excitement. Rick and Ilsa sit at a blanket, buy a photograph, and begin to look at it while nearby, a group of frightened French people cluster around a megaphone on a cart. At the stall, Rick gets goblets and a bottle of cider, walks over to Ilsa and Sam at the harp, and pours the cider. Ilsa seems unnerved, evidently having something on her mind, while Rick's manner is wry, but not the bitter wryness seen in Berlin. Sam looks at his goblet, and Rick and Ilsa look at each other, then hurry to the door. She smiles faintly and looks at him tenderly. Rick takes her in his arms and kisses her hungrily, and while locked in an embrace, they hear the dull boom of fireworks, to which Ilsa reacts worriedly. Ilsa looks at Rick, and he chuckles, then chuckles again."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Sam begins to adjust it very delicately and then decides to shift the piano away. For a long moment, he just glances at her. Meanwhile, Renault and Laszlo stroll toward the table from the bar, and as Rick notices Ilsa, he halts abruptly, appearing surprised. Sam ceases playing. Two close-ups display Ilsa and Rick acknowledging each other, and Rick settles down as he and Ilsa observe each other. Laszlo gestures to the waiter, and Rick grabs the check. Renault departs, and Ilsa grins as they accompany Renault at the curb. Sam now perceives Rick is in a very somber mood, and Sam reclines at the piano, beginning to play softly, experimenting. Suddenly, Rick slams the table and rests his head in his arms before lifting his head, trying to maintain composure, holding his head in his hands. Rick just gazes ahead as orchestra music slowly blends with Sam's playing. Later, Ilsa adjusts flowers at the window while Rick closes champagne. Rick maneuvers a small, open car gently along the boulevard with the background scenery changing to a country road as she cuddles close to him and rests her head on his shoulder; he wraps his arm around Ilsa. On an excursion boat on the Seine, Rick and Ilsa lean at the rail, seemingly captivated by each other as Ilsa giggles. They spot the Arc de Triomphe from a distance, and she strolls over and joins him. They sip inside a swank Paris cafe, and Rick and Ilsa sway, appearing to be very much in love as the music resonates. Ilsa spins a coin, then flicks it over to Rick, and they embrace passionately. During the backdrop of the rubble of a burned-out, demolished building, German troops wade across a river as tanks trundle down the road toward Paris and German fighter planes soar overhead. A man distributes newspapers to people gathered around him, and there is much thrill. Rick and Ilsa perch at a table, grab a newspaper, and start to skim it while nearby, a cluster of frightened French people gathers around a loudspeaker on a wagon. At the bar, Rick fetches glasses and a bottle of champagne, strides over to Ilsa and Sam at the piano, and fills the champagne. Ilsa seems unsettled, clearly having something on her mind, while Rick's demeanor is dry, but not the harsh dryness seen in Casablanca. Sam studies his glass, and Rick and Ilsa lock eyes, then dash to the window. She smirks faintly and gazes at him fondly. Rick holds her in his arms and kisses her fiercely, and while ensconced in an embrace, they hear the distant boom of cannons, to which Ilsa reacts anxiously. Ilsa glances at Rick, and he snickers, then snickers again."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Leo begins to whisper it very quietly and then prepares to shift the hammock away. For a long moment, the kite just gazes at the toaster. Meanwhile, the helmet and the violin approach the sofa from the cereal box, and as the microphone sees the dictionary, it halts abruptly, appearing startled. Leo stops whispering. Two close-ups reveal the dictionary and the microphone seeing each other, and the microphone sits down as it and the dictionary look at each other. The violin signals the breadstick, and the microphone takes the feather. The helmet leaves, and the dictionary grins as they join the helmet at the shoelace. Leo now realizes the microphone is in a very gloomy mood, and Leo sits down at the hammock, starting to whisper quietly, improvising. Suddenly, the microphone pounds the sofa and buries its head in its elbows before raising its head, trying to regain composure, holding its head in its hands. The microphone just stares forward as flute music slowly joins Leo's whispering. Later, the dictionary arranges scarves at the curtain while the microphone opens lemonade. The microphone drives a small, open scooter slowly along the avenue with the background scenery changing to a forest path as the toaster snuggles close to it and rests its head on its elbow; the microphone puts its hand around the dictionary. On an adventure yacht on the Nile, the microphone and the dictionary stand at the railing, seemingly captivated by each other as the dictionary giggles. They see the Eiffel Tower from afar, and the toaster walks over and joins it. They sip inside a chic Rome bakery, and the microphone and the dictionary waltz, appearing to be very much in love as the music plays. The dictionary flips a button, then tosses it over to the microphone, and they embrace passionately. During the landscape of the debris of a burned-out, demolished market, German ships cross a lake as buses roll down the avenue toward Berlin and German blimps fly overhead. A lamp sells postcards to kites crowded around it, and there is much enthusiasm. The microphone and the dictionary sit at a desk, buy a postcard, and begin to examine it while nearby, a group of anxious Spanish pillows cluster around a megaphone on a bicycle. At the cereal box, the microphone gets cups and a jug of lemonade, walks over to the dictionary and Leo at the hammock, and fills the lemonade. The dictionary seems apprehensive, evidently having something on its mind, while the microphone's demeanor is amused, but not the bitter amusement seen in Cairo. Leo looks at its cup, and the microphone and the dictionary look at each other, then hurry to the curtain. The toaster smiles faintly and gazes at it tenderly. The microphone takes the toaster in its arms and kisses it hungrily, and while locked in an embrace, they hear the dull boom of drums, to which the dictionary reacts anxiously. The dictionary looks at the microphone, and it chuckles, then chuckles again."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Tina starts to sing it very quietly and then decides to slide the violin away. For a brief moment, she just gazes at him. Meanwhile, the conductor and the cellist drift toward the podium from the wings, and as Paul notices Julia, he freezes, appearing bewildered. Tina stops singing. Two close-ups reveal Julia and Paul noticing each other, and Paul sinks down as he and Julia gaze at each other. The cellist beckons the assistant, and Paul passes the envelope. The conductor exits, and Julia grins as they accompany the conductor to the sidewalk. Tina now perceives Paul is in a very somber mood, and Tina reclines at the violin, beginning to hum quietly, creating. Suddenly, Paul slams the podium and hides his face in his palms before lifting his face, attempting to gather himself, clasping his face in his hands. Paul just gazes forward as symphonic melodies gradually accompany Tina's humming. Later, Julia arranges books at the window while Paul uncorks cider. Paul pedals a small, vintage bicycle leisurely along the avenue with the scenery shifting to a rural path as he leans toward her and rests his head on her shoulder; she wraps her arm around Paul. On a sightseeing tram along the Thames, Paul and Julia lean on the railing, seemingly enchanted by each other as Paul laughs. They glimpse the Eiffel Tower from afar, and he steps over and joins her. They sip espresso inside a chic Rome bistro, and Paul and Julia twirl, appearing to be deeply connected as the orchestra plays. Julia rolls a die, then flicks it over to Paul, and they embrace passionately. Against the setting of the remnants of a bombed-out, crumbled structure, Italian soldiers wade through a canal as vehicles rumble down the street toward Berlin and Italian helicopters hover overhead. A woman hands out magazines to crowds gathered around her, and there is much buzz. Paul and Julia rest at a stool, purchase a magazine, and start to peruse it while close by, a throng of anxious Italian citizens gather around a loudhailer on a wagon. At the cafe, Paul fetches mugs and a carton of cider, strolls over to Julia and Tina at the violin, and serves the cider. Julia seems rattled, apparently preoccupied, while Paul's demeanor is amused, but not the sharp amusement displayed in Vienna. Tina studies her mug, and Paul and Julia gaze at each other, then rush to the door. She grins softly and gazes at him warmly. Paul takes her in his arms and embraces her fervently, and while held in a clutch, they hear the distant rumble of drums, to which Julia responds tensely. Julia gazes at Paul, and he snickers, then snickers again."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Sam begins to sketch it very softly and then prepares to lift the easel away. For a long moment, he just glances at her. Meanwhile, Renault and Laszlo stroll toward the counter from the buffet, and as Rick spots Ilsa, he freezes, appearing startled. Sam stops sketching. Two close-ups reveal Ilsa and Rick spotting each other, and Rick reclines as he and Ilsa glance at each other. Laszlo gestures to the attendant, and Rick accepts the menu. Renault departs, and Ilsa grins as they congregate with Renault at the sidewalk. Sam now senses Rick is in a very tense mood, and Sam reclines at the easel, starting to sketch lightly, doodling. Suddenly, Rick strikes the counter and hides his face in his sleeves before lifting his head, trying to regain composure, holding his head in his hands. Rick just gazes ahead as violin music slowly accompanies Sam's sketching. Later, Ilsa arranges books at the shelf while Rick uncorks cider. Rick pedals a small, open bicycle slowly along the avenue with the background scenery shifting to a woodland path as she leans close to him and rests her head on his shoulder; he drapes his arm around Ilsa. On a ferry on the Seine, Rick and Ilsa lean on the rail, seemingly captivated by each other as Ilsa chuckles. They spot the Eiffel Tower from afar, and she wanders over and joins him. They sip inside a chic Paris bistro, and Rick and Ilsa sway, appearing to be very much in love as the music plays. Ilsa spins a token, then tosses it over to Rick, and they embrace passionately. During the backdrop of the remnants of a burned-out, demolished structure, German troops march through a meadow as tanks trundle down the lane toward Paris and German war planes hover overhead. A man hawks periodicals to people gathered around him, and there is much excitement. Rick and Ilsa perch at a booth, purchase a periodical, and start to peruse it while nearby, a group of anxious French citizens huddle around a loudspeaker on a cart. At the buffet, Rick grabs mugs and a bottle of cider, strolls over to Ilsa and Sam at the easel, and pours the cider. Ilsa seems uneasy, evidently preoccupied with something, while Rick's demeanor is ironic, but not the harsh irony seen in Casablanca. Sam peers at his mug, and Rick and Ilsa glance at each other, then rush to the alcove. She smiles faintly and gazes at him fondly. Rick enfolds her in his arms and kisses her eagerly, and while locked in an embrace, they hear the distant boom of fireworks, to which Ilsa reacts anxiously. Ilsa gazes at Rick, and he giggles, then giggles again."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Timothy begins to juggle it very loudly and then prepares to launch the violin upwards. For a brief instant, he just stares at her. Meanwhile, Emerson and Dorian march to the couch from the bakery, and as Alex notices Maria, he jumps backward, appearing confused. Timothy halts juggling. Two close-ups reveal Maria and Alex spotting each other, and Alex kneels down as he and Maria gaze at each other. Dorian signals the chef, and Alex pockets the receipt. Emerson departs, and Maria giggles as they join Emerson at the bridge. Timothy now understands Alex is in a very cheerful mood, and Timothy lies down on the violin, beginning to juggle loudly, mimicking sounds. Instantly, Alex taps the couch and covers his head with his hands before lifting his head, attempting to stay calm, holding his head under his arms. Alex just glances forward as accordion music gradually compliments Timothy's juggling. Soon after, Maria arranges lambs at the fountain while Alex unseals cider. Alex sails a large, closed boat quickly down the river with the foreground shifting to a desert path as she leans away from him and places her hand on his knee; he rests his elbow beside Maria. On a freight train on the Volga, Alex and Maria lean on the rails, seemingly captivated by each other as Maria chuckles. They spot the Statue of Liberty from up close, and she walks over and greets him. They sip outside a shabby Berlin diner, and Alex and Maria leap, appearing to be very much at odds as the silence lingers. Maria rolls a die, then tosses it over to Alex, and they argue softly. Against the backdrop of the bricks of a reconstituted, pristine structure, Italian artists ford a stream as wagons saunter down the path toward Cairo and Italian kites glide underneath. A toddler sings carols to animals lounging around her, and there is much tranquility. Alex and Maria stand under a tree, purchase an apple, and begin to peel it while nearby, a pack of curious Japanese children cluster around a television on a bicycle. At the inn, Alex grabs placemats and a jug of cider, strolls over to Maria and Timothy on the violin, and spills the cider. Maria seems elated, obviously having nothing on her mind, while Alex's demeanor is cheerful, but not the sarcastic cheerfulness seen in Barcelona. Timothy looks at his plate, and Alex and Maria glance at each other, then rush to the fountain. She scoffs slightly and stares at him sadly. Alex pushes her away and laughs shyly, and while caught in a glare, they hear the soft hum of bees, to which Maria reacts curiously. Maria observes Alex, and he sighs, then sighs once more."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Sam plays the piano softly and then pauses, observing the tense atmosphere. Renault and Laszlo approach Rick, who is shocked to see Ilsa. As they exchange glances, Sam senses Rick's grim mood and starts playing again. Rick, struggling to regain composure, pounds the table as music gradually swells. Later, Rick and Ilsa share tender moments, driving through the countryside and standing on a boat, clearly in love. They enjoy each other's company in a Paris cafe, dance, and kiss passionately. Amidst the backdrop of a German invasion, Rick and Ilsa sit together, reading newspapers with growing concern. Rick fetches champagne, and despite a wry demeanor, his interaction with Ilsa is tender. Ilsa appears troubled, but they share a heartfelt embrace, reacting to distant cannon fire with mixed emotions."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Ilsa looks at Rick and he chuckles then chuckles again Rick takes her in his arms and kisses her hungrily and while locked in an embrace they hear the dull boom of cannons to which Ilsa reacts worriedly She smiles faintly and looks at him tenderly Sam looks at his glass and Rick and Ilsa look at each other then hurry to the window while Rick's manner is wry but not the bitter wryness seen in Casablanca Ilsa seems unnerved evidently having something on her mind At the bar Rick gets glasses and a bottle of champagne walks over to Ilsa and Sam at the piano and pours the champagne Rick and Ilsa sit at a table buy a newspaper and begin to read it while nearby a group of frightened French people cluster around a loudspeaker on a wagon A man sells newspapers to people crowded around him and there is much excitement During the backdrop of the rubble of a burnedout demolished building German troops cross a river as tanks roll down the road toward Paris and German war planes fly overhead Ilsa flips a coin then tosses it over to Rick and they kiss passionately They drink inside a swank Paris cafe and Rick and Ilsa dance appearing to be very much in love as the music plays They see the Arc de Triomphe from a distance and she walks over and joins him On an excursion boat on the Seine Rick and Ilsa stand at the rail seemingly transported by each other as Ilsa laughs he puts his arm around Ilsa Rick drives a small open car slowly along the boulevard with the background scenery changing to a country road as she snuggles close to him and puts her head on his shoulder Later Ilsa fixes flowers at the window while Rick opens champagne Rick just stares ahead as orchestra music slowly joins Sam's playing Suddenly Rick pounds the table and buries his head in his arms before raising his head trying to regain control holding his head in his hands Sam now realizes Rick is in a very grim mood and Sam sits down at the piano starting to play softly improvising Renault leaves and Ilsa smiles as they join Renault at the curb Laszlo signals the waiter and Rick takes the check Two closeups reveal Ilsa and Rick seeing each other and Rick sits down as he and Ilsa look at each other Sam stops playing Meanwhile Renault and Laszlo approach the table from the bar and as Rick sees Ilsa he stops short appearing shocked For a long moment he just looks at her Sam begins to play it very softly and then prepares to move the piano away"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Ilsa flips a coin then tosses it over to Rick and they kiss passionately he puts his arm around Ilsa Rick just stares ahead as orchestra music slowly joins Sam's playing Ilsa looks at Rick and he chuckles then chuckles again Rick and Ilsa sit at a table buy a newspaper and begin to read it while nearby a group of frightened French people cluster around a loudspeaker on a wagon Renault leaves and Ilsa smiles as they join Renault at the curb Laszlo signals the waiter and Rick takes the check Later Ilsa fixes flowers at the window while Rick opens champagne They drink inside a swank Paris cafe and Rick and Ilsa dance appearing to be very much in love as the music plays while Rick's manner is wry but not the bitter wryness seen in Casablanca Rick drives a small open car slowly along the boulevard with the background scenery changing to a country road as she snuggles close to him and puts her head on his shoulder A man sells newspapers to people crowded around him and there is much excitement For a long moment he just looks at her They see the Arc de Triomphe from a distance and she walks over and joins him She smiles faintly and looks at him tenderly On an excursion boat on the Seine Rick and Ilsa stand at the rail seemingly transported by each other as Ilsa laughs Meanwhile Renault and Laszlo approach the table from the bar and as Rick sees Ilsa he stops short appearing shocked During the backdrop of the rubble of a burnedout demolished building German troops cross a river as tanks roll down the road toward Paris and German war planes fly overhead Rick takes her in his arms and kisses her hungrily and while locked in an embrace they hear the dull boom of cannons to which Ilsa reacts worriedly Two closeups reveal Ilsa and Rick seeing each other and Rick sits down as he and Ilsa look at each other Ilsa seems unnerved evidently having something on her mind Sam now realizes Rick is in a very grim mood and Sam sits down at the piano starting to play softly improvising Suddenly Rick pounds the table and buries his head in his arms before raising his head trying to regain control holding his head in his hands Sam looks at his glass and Rick and Ilsa look at each other then hurry to the window Sam begins to play it very softly and then prepares to move the piano away Sam stops playing At the bar Rick gets glasses and a bottle of champagne walks over to Ilsa and Sam at the piano and pours the champagne"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "They see the Arc de Triomphe from a distance and she walks over and joins him They drink inside a swank Paris cafe and Rick and Ilsa dance appearing to be very much in love as the music plays Ilsa flips a coin then tosses it over to Rick and they kiss passionately During the backdrop of the rubble of a burnedout demolished building German troops cross a river as tanks roll down the road toward Paris and German war planes fly overhead A man sells newspapers to people crowded around him and there is much excitement Rick and Ilsa sit at a table buy a newspaper and begin to read it while nearby a group of frightened French people cluster around a loudspeaker on a wagon At the bar Rick gets glasses and a bottle of champagne walks over to Ilsa and Sam at the piano and pours the champagne Ilsa seems unnerved evidently having something on her mind while Rick's manner is wry but not the bitter wryness seen in Casablanca Sam looks at his glass and Rick and Ilsa look at each other then hurry to the window She smiles faintly and looks at him tenderly Rick takes her in his arms and kisses her hungrily and while locked in an embrace they hear the dull boom of cannons to which Ilsa reacts worriedly Ilsa looks at Rick and he chuckles then chuckles again Sam begins to play it very softly and then prepares to move the piano away For a long moment he just looks at her Meanwhile Renault and Laszlo approach the table from the bar and as Rick sees Ilsa he stops short appearing shocked Sam stops playing Two closeups reveal Ilsa and Rick seeing each other and Rick sits down as he and Ilsa look at each other Laszlo signals the waiter and Rick takes the check Renault leaves and Ilsa smiles as they join Renault at the curb Sam now realizes Rick is in a very grim mood and Sam sits down at the piano starting to play softly improvising Suddenly Rick pounds the table and buries his head in his arms before raising his head trying to regain control holding his head in his hands Rick just stares ahead as orchestra music slowly joins Sam's playing Later Ilsa fixes flowers at the window while Rick opens champagne Rick drives a small open car slowly along the boulevard with the background scenery changing to a country road as she snuggles close to him and puts her head on his shoulder he puts his arm around Ilsa On an excursion boat on the Seine Rick and Ilsa stand at the rail seemingly transported by each other as Ilsa laughs"
        }
      ]
    }
  ]
}