{
  "ground_truth": "Mr. Soggybottom pulls a revolver out of his clown suit and loads a silver bullet just as Edward finally succeeds in throwing the beast off and rolls to his feet. The hell hound squares back on its haunches, growling and ready for another leap. Mr. Soggybottom sheds a clown tear and aims the revolver at the dog, but at the last moment, Edward moves just as Mr. Soggybottom fires, and the bullet catches Edward in the shoulder, knocking him down. The carnies gasp as the dog, licking its chops, approaches the helpless Edward, who feels the ground around him, looking for some kind of weapon. He finds only a small stick and waves it at the dog, ready to strike it. Like magic, the dog's whole demeanor changes, and it bounces excitedly, ready to play fetch. Seeing an opportunity, Edward throws the stick as far as he can, and the dog bounds after it, returning a beat later with the flaming stick, which it drops at Edward's feet, its tail whipping back and forth. Edward throws the stick again, and the dog takes off in a new direction. Exhausted from playing fetch all night, Edward throws the stick into the woods, and the still-spry dog goes after it. It's gone for a long time, long enough that Edward becomes concerned, so he follows it into the woods, finding Amos Calloway standing up behind a bush, buck naked and hairy, with the stick in his mouth. Amos takes the stick out as Edward approaches, and Edward tosses him his jacket to cover his privates, then Edward walks away and starts running, as he has to get there as soon as possible. Meanwhile, Amos sits down and scratches his ear with his foot. The scene descends on the main quad, finding Edward Bloom dunking his head in the fountain, then changing out of his grubby shirt into a new one, just out of the package. It's the mid-1960s, but by the conservative dress of the passing students, it could be any era. Edward stands with a bouquet of daffodils in front of a half-open door, through which we can see the edge of a young woman, talking in hushed tones with another girl we can't see. Finally, a decision is reached, and the door opens to reveal the woman of Edward's dreams, Sandra Kay Templeton, who is effortlessly beautiful, pure, and simple as sunlight. He can't believe he's finally reached her and half-laughs, nervous, which makes her laugh, not sure what's going on. Sandra is overwhelmed and all she can finally think of to say is put her hand on the door frame, where we see a diamond on her left ring finger. Watching Sandra, Edward's heart falls 20 floors, but he tries to suppress the reaction and put on a brave front.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Mr. Soggybottom extracts a handgun out of his jester attire and charges a metallic projectile just as Edward ultimately triumphs in hurling the creature off and spins to his feet. The infernal canine crouches back on its hindquarters, snarling and prepared for another jump. Mr. Soggybottom sheds a jester tear and targets the handgun at the canine, but at the final instant, Edward shifts just as Mr. Soggybottom discharges, and the projectile strikes Edward in the shoulder, toppling him down. The showfolk inhale sharply as the canine, licking its jaws, advances toward the defenseless Edward, who feels the earth around him, seeking some sort of armament. He finds only a small branch and waves it at the canine, prepared to hit it. Like sorcery, the canine's entire behavior transforms, and it jumps eagerly, prepared to engage in fetch. Seeing a chance, Edward hurls the branch as far as he can, and the canine leaps after it, returning a heartbeat later with the blazing branch, which it drops at Edward's feet, its tail wagging back and forth. Edward hurls the branch once more, and the canine races off in a different direction. Weary from engaging in fetch all night, Edward hurls the branch into the forest, and the still-energetic canine pursues it. It's absent for a lengthy duration, ample enough that Edward becomes worried, so he pursues it into the forest, discovering Amos Calloway standing erect behind a shrub, stark unclothed and hairy, with the branch in his mouth. Amos extracts the branch as Edward nears, and Edward flings him his coat to cover his privates, then Edward strides away and begins sprinting, as he must arrive there as soon as feasible. Meanwhile, Amos sits down and scratches his ear with his foot. The panorama descends on the main plaza, discovering Edward Bloom immersing his head in the fountain, then changing out of his unclean shirt into a fresh one, just out of the packaging. It's the mid-1960s, but by the traditional attire of the passing scholars, it could be any period. Edward stands with a cluster of jonquils in front of a semi-open entryway, through which we can observe the edge of a youthful woman, conversing in muted tones with another girl we can't observe. Ultimately, a conclusion is reached, and the entryway opens to disclose the woman of Edward's aspirations, Sandra Kay Templeton, who is effortlessly lovely, pure, and simple as daylight. He can't believe he's finally reached her and half-laughs, uneasy, which causes her to laugh, uncertain what's occurring. Sandra is overwhelmed and all she can ultimately think of to say is put her hand on the entryway frame, where we see a gem on her left ring finger. Observing Sandra, Edward's heart plummets 20 floors, but he endeavors to suppress the reaction and put on a courageous front."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Mr. Soggybottom pulls a revolver out of his clown suit and loads a silver bullet just as the beast is finally thrown off by Edward, and he rolls to his feet. The hell hound is squared back on its haunches, growling and ready for another leap. A clown tear is shed by Mr. Soggybottom and the revolver is aimed at the dog by him, but just as Mr. Soggybottom fires, Edward moves, and he is caught in the shoulder by the bullet, knocking him down. The carnies gasp as the dog, licking its chops, approaches the helpless Edward, who feels the ground around him, looking for some kind of weapon. A small stick is found by him, and it is waved at the dog, ready to strike it. Like magic, the dog's whole demeanor changes, and it bounces excitedly, ready to play fetch. Seeing an opportunity, the stick is thrown as far as possible by Edward, and the dog bounds after it, returning a beat later with the flaming stick, which is dropped at Edward's feet, its tail whipping back and forth. The stick is thrown again by Edward, and the dog takes off in a new direction. Exhausted from playing fetch all night, the stick is thrown into the woods by Edward, and the still-spry dog goes after it. It's gone for a long time, long enough that concern grows in Edward, so the woods are followed into by him, and Amos Calloway is found standing up behind a bush, buck naked and hairy, with the stick in his mouth. The stick is taken out by Amos as Edward approaches, and Edward tosses him his jacket to cover his privates, then he walks away and starts running, as he has to get there as soon as possible. Meanwhile, Amos sits down and scratches his ear with his foot. The scene descends on the main quad, and Edward Bloom is found dunking his head in the fountain, then changing out of his grubby shirt into a new one, just out of the package. It's the mid-1960s, but the conservative dress of the passing students makes it look as if it could be any era. Edward stands with a bouquet of daffodils in front of a half-open door, through which the edge of a young woman is seen, talking in hushed tones with another girl who can't be seen. Finally, a decision is reached, and the door opens to reveal the woman of Edward's dreams, Sandra Kay Templeton, who is effortlessly beautiful, pure, and simple as sunlight. He can't believe he's finally reached her and half-laughs, nervous, which causes her to laugh, not sure what's going on. Sandra becomes overwhelmed and all she can finally think of to say is put her hand on the door frame, where a diamond is seen on her left ring finger. Watching Sandra, Edward's heart falls 20 floors, but the reaction is suppressed by him, and a brave front is put on."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Mr. Soggybottom draws a revolver from his clown suit, loading a silver bullet just as Edward throws off the beast and stands. The hellhound crouches, growling, ready to leap. Mr. Soggybottom sheds a tear, aims, but Edward moves as he fires, hitting Edward’s shoulder. The carnies gasp as the dog approaches helpless Edward, who finds a stick and waves it. The dog's demeanor shifts, eager to play fetch. Seeing a chance, Edward throws the stick, and the dog returns with it, tail wagging. Exhausted from fetch, Edward tosses the stick into the woods, and the lively dog chases it. Concerned by its absence, Edward follows and discovers Amos Calloway, naked, with the stick in his mouth. Edward tosses his jacket to Amos, then runs off. The scene shifts to Edward Bloom dunking his head in a fountain, changing shirts. Despite being the mid-1960s, the conservative student dress could fit any era. Edward stands with daffodils before a half-open door, glimpsing a young woman. The door reveals Sandra Kay Templeton, effortlessly beautiful. Nervous, Edward laughs, making Sandra laugh too, uncertain. Sandra touches the door frame, showing a diamond ring. Edward’s heart sinks but he masks it bravely."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Mr. Soggybottom draws a revolver, loading a silver bullet, as Edward throws off the beast and stands. The hellhound, ready to leap, faces him. Mr. Soggybottom tears up, aims, but hits Edward's shoulder instead. The crowd gasps as the dog nears Edward, who finds a stick, waves it, and the dog's demeanor changes to playful. Edward throws the stick, and the dog returns it, tail wagging. After repeated throws, the dog fetches it into the woods. Edward follows and discovers Amos Calloway, naked, with the stick. Edward tosses him a jacket and leaves, soon seen dunking his head in a fountain before changing shirts. In front of a half-open door, he stands with daffodils. The door opens to Sandra Kay Templeton, effortlessly beautiful. Edward half-laughs nervously, making Sandra laugh. She places her hand on the door frame, revealing a diamond ring. Edward's heart sinks, but he tries to remain composed."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Mr. Soggybottom, with a grave expression that belies his clownish appearance, carefully pulls a revolver out from the colorful depths of his clown suit. He meticulously loads it with a single silver bullet in the moments after Edward, with great effort, finally manages to throw off the attacking beast and rolls agilely to his feet. Meanwhile, the fearsome hell hound, undeterred and menacing, crouches back on its powerful haunches, growling ominously, poised and ready to spring forward with another aggressive leap. As if shedding a tear from his clown persona, Mr. Soggybottom aims the revolver intently at the beast. However, in a twist of fate, Edward inadvertently moves just as Mr. Soggybottom pulls the trigger, and the bullet, intended for the hound, instead strikes Edward's shoulder with force, sending him crashing to the ground. \n\nGasps echo among the carnies as the dog, now licking its chops hungrily, advances towards the vulnerable Edward. Desperately, Edward feels around on the ground, searching frantically for anything he might use as a weapon. His fingers finally close around nothing more useful than a small stick, which he brandishes valiantly at the hound, preparing to defend himself. Miraculously, the canine's demeanor shifts entirely; it bounces with sudden excitement, eager to play a game of fetch. Seeing this change as a lifeline, Edward seizes the opportunity and throws the stick as far as his strength allows. The dog eagerly chases after it and, to Edward's amazement, returns almost immediately with the stick, now flaming, dropping it expectantly at Edward’s feet, its tail wagging joyously. \n\nWith renewed energy, Edward hurls the stick again, sending the dog darting off in yet another direction. But the game, stretching on through the night, exhausts him. Finally, in an effort to end the exhausting cycle, Edward flings the stick deep into the woods. The tireless dog bounds after it, disappearing from view for an unsettlingly long stretch of time. Edward, growing increasingly concerned, ventures into the woods to find it. There, in a bizarre turn of events, he encounters Amos Calloway emerging from behind a bush, utterly naked and covered in hair, the stick held comically in his mouth. As Edward approaches, Amos removes the stick, and Edward, maintaining composure, tosses him his own coat to preserve Amos’s dignity. Then, without further ado, Edward leaves, breaking into a run, driven by a sense of urgency to reach his destination promptly. In the interim, Amos nonchalantly sits down, scratching his ear with his foot in a dog-like manner.\n\nThe narrative shifts to a peaceful scene descending onto the main quad, where Edward Bloom is found plunging his head into the cool fountain water, in an effort to refresh himself before changing out of his dirty, worn shirt into a crisp, recently unpackaged new one. Although it is the mid-1960s, the conservative attire of the students passing by suggests a timeless ambiance. Standing with a bouquet of vibrant daffodils in his hands, Edward positions himself before a partially open door. Through the door, one can glimpse the silhouette of a young woman engaged in a whispered conversation with a girl who remains out of sight. Eventually, a decision seems to be reached, and the door opens to reveal the radiant Sandra Kay Templeton, the epitome of graceful beauty and as effortless in her charm as sunlight itself. Edward, almost unable to believe he is finally face to face with the woman of his dreams, chuckles nervously, prompting Sandra to laugh as well, unsure of the unfolding situation. Overwhelmed, Sandra can only rest her hand on the door frame, inadvertently showcasing the diamond ring adorning her left finger. Witnessing this, Edward's heart plummets as if it had fallen from a great height, yet he bravely attempts to suppress his emotions and maintain a composed exterior."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Mr. Soggybottom, whose grave expression starkly contrasts with his otherwise clownish appearance, methodically and with great care, extracts a revolver from the colorful, chaotic depths of his clown suit. He meticulously loads it with a single, shimmering silver bullet in the brief moments that follow Edward's valiant struggle to finally throw off the attacking beast before rolling agilely to his feet once more. Meanwhile, the fearsome hell hound, undeterred and menacing, crouches menacingly on its powerful haunches, emitting a low, ominous growl, poised and ready to make yet another aggressive leap forward. Shedding, as if metaphorically, a tear from his clown persona, Mr. Soggybottom aims the revolver with determined focus at the beast. In a twist of fate, however, Edward inadvertently shifts just as Mr. Soggybottom pulls the trigger, causing the bullet, meant for the hound, to instead strike Edward's shoulder with such force that it sends him crashing heavily to the ground.\n\nStartled gasps echo through the crowd of carnies as the dog, now licking its chops with a hungry anticipation, advances menacingly towards the vulnerable Edward. Desperate and with urgency, Edward feels around on the ground, searching frantically for anything that might serve as a weapon. His fingers finally close around nothing more useful than a small, humble stick, which he brandishes valiantly at the hound, preparing to defend himself. In a miraculous turn of events, the canine’s demeanor shifts entirely; with sudden excitement, it bounces eagerly, overcome with the desire to play a game of fetch. Recognizing this unexpected change as a lifeline, Edward seizes the opportunity and throws the stick as far as his remaining strength allows. The dog eagerly chases after it, and to Edward's amazement, returns almost immediately with the stick, now flaming, dropping it expectantly at Edward’s feet, its tail wagging joyously with enthusiasm.\n\nWith renewed energy and determination, Edward once again hurls the stick, sending the dog darting off in yet another direction with equal enthusiasm. Yet, the game, stretching on persistently through the night, gradually exhausts him. Finally, in an earnest effort to end the exhausting cycle, Edward flings the stick deep into the woods. The tireless dog eagerly bounds after it, disappearing from view for an unsettling and prolonged stretch of time. Growing increasingly concerned, Edward ventures cautiously into the woods to find it. There, he encounters a bizarre turn of events as Amos Calloway emerges unexpectedly from behind a bush, utterly naked and covered in hair, with the stick held comically between his teeth. As Edward approaches, Amos removes the stick, and Edward, maintaining his composure, tosses him his own coat in a gesture aimed at preserving Amos’s dignity. Then, without further ado, Edward leaves, breaking into a run, driven by an urgent sense of purpose to reach his destination promptly. Meanwhile, in the interim, Amos, seemingly unfazed, sits down nonchalantly, scratching his ear with his foot in a manner reminiscent of a dog.\n\nThe narrative shifts to a serene scene descending onto the main quad, where Edward Bloom finds himself plunging his head into the cool, refreshing water of the fountain, striving to refresh himself before changing out of his dirty, worn shirt into a crisp, recently unpackaged new one. Although it is the mid-1960s, the conservative attire of the students passing by suggests a timeless ambiance. With a bouquet of vibrant daffodils in his hands, Edward positions himself expectantly before a partially open door. Through the door, one can glimpse the silhouette of a young woman engaged in a whispered conversation with a girl who remains out of sight. Eventually, a decision seems to be reached, and the door opens to reveal the radiant Sandra Kay Templeton, who embodies the epitome of graceful beauty and is as effortless in her charm as sunlight itself. Almost unable to believe he is finally face to face with the woman of his dreams, Edward chuckles nervously, prompting Sandra to join in his laughter, both uncertain of the unfolding situation. Overwhelmed by the moment, Sandra can only rest her hand on the door frame, inadvertently showcasing the diamond ring that adorns her left finger. Witnessing this, Edward's heart metaphorically plummets as if it had fallen from a great height, yet he bravely attempts to suppress his surging emotions and maintain a composed and dignified exterior."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Mr. Soggybottom reaches into the folds of his colorful clown suit, feeling around until he grasps the familiar shape of a revolver and carefully pulls it out. With focused intent, he selects a shiny silver bullet and methodically loads it into the chamber, each movement deliberate and precise. Meanwhile, Edward is grappling with the hell hound, struggling fiercely until he ultimately manages to hurl the beast away from him with all his strength. As the momentum carries him, he rolls over onto the ground before pushing himself up onto his feet, ready for whatever comes next. The hell hound, undeterred, positions itself firmly back on its haunches, muscles tensed and growls rumbling deep in its throat, signaling its readiness to pounce once more. Observing the scene with both resolve and a touch of sorrow, Mr. Soggybottom sheds a single clown tear, then steadies the revolver in his hand and takes aim at the menacing dog. Just when he is about to fire, Edward, unknowingly in the line of fire, shifts his position at the precise wrong moment. Mr. Soggybottom pulls the trigger, and the bullet speeds through the air, striking Edward in the shoulder with forceful impact, sending him sprawling to the ground. The gathered carnies inhale sharply, a collective gasp filling the air, as the hell hound, now emboldened, licks its chops and approaches the fallen Edward, its eyes locked onto him. Desperate and searching for anything to defend himself, Edward's hands scramble over the ground, feeling for a weapon of any kind, yet he finds only a small stick. Undeterred, he grasps the stick tightly, waving it defensively at the advancing dog, prepared to fight back. Miraculously, the dog's aggressive posture transforms instantly; its eyes light up with playful excitement, and it begins to bounce around, eager for a game of fetch. Seizing this unexpected chance, Edward throws the stick with all his might, watching as the dog dashes off after it, its energy seemingly boundless. The dog quickly returns, proudly dropping the now flaming stick at Edward's feet, its tail wagging exuberantly. Encouraged by this turn of events, Edward hurls the stick again in a different direction, and the dog once more takes off in pursuit. After playing fetch repeatedly throughout the night, Edward finally, worn out, flings the stick into the woods. The dog, still brimming with vitality, eagerly chases it into the trees. Time passes, and as the minutes stretch on, Edward's concern grows at the dog's prolonged absence, prompting him to venture cautiously into the woods to investigate. There, he discovers Amos Calloway, unexpectedly revealed, standing upright behind a bush, completely naked and covered in hair, with the stick firmly clenched in his mouth. As Edward draws closer, Amos removes the stick, and understanding the situation, Edward discreetly tosses his jacket to Amos, providing some modesty by covering his exposed areas. Without lingering, Edward turns away, gradually quickening his pace until he breaks into a run, driven by an urgent need to reach his destination quickly. Meanwhile, Amos, left behind, settles into a sitting position and amusingly scratches his ear with his foot. The scene transitions to the main quad, where Edward Bloom finds himself bending over the fountain, vigorously submerging his head in the cool water, cleansing both grime and tension from his face. Emerging refreshed, he changes out of his soiled shirt, replacing it with a crisp, new one straight from its packaging. Though it's unmistakably the mid-1960s, the conservative attire of the students passing by evokes a sense of timelessness. With anticipation and nerves, Edward stands poised, a vibrant bouquet of daffodils clasped in his hand, in front of a partially open door. Through the gap, he catches a glimpse of a young woman inside, engaged in quiet conversation with another unseen girl. After a moment of indecision, the conversation reaches a conclusion, and the door swings open to unveil Sandra Kay Templeton, the woman Edward has long dreamt of. Her effortless beauty and purity strike him as deeply as sunlight, momentarily rendering him speechless. Overcome with disbelief and nervous excitement at finally standing before her, he lets out a half-laugh, which in turn prompts Sandra to laugh softly, caught off guard by the unexpected moment. Taken aback and overwhelmed, Sandra's first instinct is to place her hand on the door frame, inadvertently revealing a glistening diamond on her left ring finger. Witnessing this, Edward feels his heart plummet as if dropped from a great height, yet he struggles inwardly to conceal his disappointment, mustering what composure he can to maintain a brave facade."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Mr. Soggybottom swiftly draws a revolver from his clown suit, loads it with a silver bullet, and aims at the intimidating hellhound as Edward manages to roll to his feet after throwing the beast off. Just as Mr. Soggybottom fires, Edward inadvertently moves into the bullet's path and is struck in the shoulder, drawing gasps from onlookers. As the dog advances on the fallen Edward, he searches for a weapon and finds only a stick. Waving it prompts a playful reaction from the dog, so Edward seizes the chance to play fetch, distracting the beast. After several throws, he hurls the stick deep into the woods, and when the dog doesn't return, Edward follows, only to discover Amos Calloway, naked and holding the stick in his mouth. Edward offers Amos his jacket for modesty before hastily departing.\n\nThe scene shifts to the main quad, where Edward, now exhausted, refreshes himself at a fountain and changes into a new shirt. It's the mid-1960s, but the setting feels timeless due to the conservatively dressed students. Edward stands with a bouquet of daffodils before a door, behind which Sandra Kay Templeton, the woman of his dreams, converses in hushed tones. When the door finally opens, revealing Sandra's effortless beauty, Edward is overcome with nervous laughter, matched by her own uncertain giggle. However, as she places her hand on the door frame, revealing a diamond ring, Edward's heart sinks, though he endeavors to maintain a brave demeanor."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Mr. Soggybottom, known among the carnival folk for his peculiar mix of humor and hidden courage, pulls a revolver out of his clown suit and loads a silver bullet, a legendary weapon often believed to be the only way to kill supernatural creatures, just as Edward finally succeeds in throwing the beast off and rolls to his feet. The hell hound, a mythical creature often associated with the underworld, squares back on its haunches, growling and ready for another leap. Mr. Soggybottom sheds a clown tear, a theatrical act that hints at his conflicted emotions, and aims the revolver at the dog, but at the last moment, Edward moves just as Mr. Soggybottom fires, and the bullet catches Edward in the shoulder, knocking him down. The carnies, a tight-knit group of circus performers who gossip incessantly, gasp as the dog, licking its chops, approaches the helpless Edward, who feels the ground around him, looking for some kind of weapon. He finds only a small stick, reminiscent of the tales where simple objects become tools of survival, and waves it at the dog, ready to strike it. Like magic, the dog's whole demeanor changes, and it bounces excitedly, ready to play fetch, a timeless game that has charmed canines throughout history. Seeing an opportunity, Edward throws the stick as far as he can, and the dog bounds after it, returning a beat later with the flaming stick, which it drops at Edward's feet, its tail whipping back and forth with the joyous enthusiasm of a creature rediscovering its playful nature. Edward throws the stick again, and the dog takes off in a new direction. Exhausted from playing fetch all night, Edward throws the stick into the woods, and the still-spry dog goes after it. It's gone for a long time, long enough that Edward becomes concerned, so he follows it into the woods, finding Amos Calloway, a local eccentric rumored to have wild transformations under the full moon, standing up behind a bush, buck naked and hairy, with the stick in his mouth. Amos takes the stick out as Edward approaches, and Edward tosses him his jacket to cover his privates, then Edward walks away and starts running, as he has to get there as soon as possible, driven by an urgency that only he understands. Meanwhile, Amos, with the peculiar behavior that has fueled many town legends, sits down and scratches his ear with his foot. The scene descends on the main quad, a central meeting place at the university known for its vibrant student life, finding Edward Bloom dunking his head in the fountain, then changing out of his grubby shirt into a new one, just out of the package. It's the mid-1960s, a time of significant cultural and social change in America, but by the conservative dress of the passing students, it could be any era. Edward stands with a bouquet of daffodils, flowers symbolizing new beginnings and cherished friendships, in front of a half-open door, through which we can see the edge of a young woman, talking in hushed tones with another girl we can't see. Finally, a decision is reached, and the door opens to reveal the woman of Edward's dreams, Sandra Kay Templeton, who is effortlessly beautiful, pure, and simple as sunlight, evoking the aesthetic ideals of the time. He can't believe he's finally reached her and half-laughs, nervous, which makes her laugh, not sure what's going on. Sandra is overwhelmed and all she can finally think of to say is put her hand on the door frame, where we see a diamond on her left ring finger, the traditional symbol of engagement, revealing that she is promised to another. Watching Sandra, Edward's heart falls 20 floors, a metaphor for the emotional plunge he experiences, but he tries to suppress the reaction and put on a brave front, a common practice in the face of unrequited love."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Finally a decision is reached and the door opens to reveal the woman of Edward's dreams Sandra Kay Templeton who is effortlessly beautiful pure and simple as sunlight Mr Soggybottom pulls a revolver out of his clown suit and loads a silver bullet just as Edward finally succeeds in throwing the beast off and rolls to his feet Mr Soggybottom sheds a clown tear and aims the revolver at the dog but at the last moment Edward moves just as Mr Soggybottom fires and the bullet catches Edward in the shoulder knocking him down Edward throws the stick again and the dog takes off in a new direction The hell hound squares back on its haunches growling and ready for another leap The carnies gasp as the dog licking its chops approaches the helpless Edward who feels the ground around him looking for some kind of weapon then Edward walks away and starts running as he has to get there as soon as possible The hell hound squares back on its haunches growling and ready for another leap Mr Soggybottom sheds a clown tear and aims the revolver at the dog but at the last moment Edward moves just as Mr Soggybottom fires and the bullet catches Edward in the shoulder knocking him down The carnies gasp as the dog licking its chops approaches the helpless Edward who feels the ground around him looking for some kind of weapon He finds only a small stick and waves it at the dog ready to strike it Like magic the dog's whole demeanor changes and it bounces excitedly ready to play fetch Seeing an opportunity Edward throws the stick as far as he can and the dog bounds after it returning a beat later with the flaming stick which it drops at Edward's feet its tail whipping back and forth Edward throws the stick again and the dog takes off in a new direction Exhausted from playing fetch all night Edward throws the stick into the woods and the stillspry dog goes after it It is gone for a long time long enough that Edward becomes concerned so he follows it into the woods finding Amos Calloway standing up behind a bush buck naked and hairy with the stick in his mouth Amos takes the stick out as Edward approaches and Edward tosses him his jacket to cover his privates Amos takes the stick out as Edward approaches and Edward tosses him his jacket to cover his privates then Edward walks away and starts running as he has to get there as soon as possible He cannot believe he is finally reached her and halflaughs nervous which makes her laugh not sure what is going on Exhausted from playing fetch all night Edward throws the stick into the woods and the stillspry dog goes after it Meanwhile Amos sits down and scratches his ear with his foot The scene descends on the main quad finding Edward Bloom dunking his head in the fountain then changing out of his grubby shirt into a new one just out of the package It is the mid1960s but by the conservative dress of the passing students it could be any era Edward stands with a bouquet of daffodils in front of a halfopen door through which we can see the edge of a young woman talking in hushed tones with another girl we cannot see Finally a decision is reached and the door opens to reveal the woman of Edward's dreams Sandra Kay Templeton who is effortlessly beautiful pure and simple as sunlight Mr Soggybottom pulls a revolver out of his clown suit and loads a silver bullet just as Edward finally succeeds in throwing the beast off and rolls to his feet He cannot believe he is finally reached her and halflaughs nervous which makes her laugh not sure what is going on Sandra is overwhelmed and all she can finally think of to say is put her hand on the door frame where we see a diamond on her left ring finger Watching Sandra Edward's heart falls 20 floors but he tries to suppress the reaction and put on a brave front"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Mr Soggybottom pulls a revolver out of his clown suit and loads a silver bullet just as Edward finally succeeds in throwing the beast off and rolls to his feet. The hell hound squares back on its haunches growling and ready for another leap. Mr Soggybottom sheds a clown tear and aims the revolver at the dog but at the last moment Edward moves just as Mr Soggybottom fires and the bullet catches Edward in the shoulder knocking him down. The carnies gasp as the dog licking its chops approaches the helpless Edward who feels the ground around him looking for some kind of weapon. He finds only a small stick and waves it at the dog ready to strike it. Like magic the dog's whole demeanor changes and it bounces excitedly ready to play fetch. Seeing an opportunity Edward throws the stick as far as he can and the dog bounds after it returning a beat later with the flaming stick which it drops at Edward's feet its tail whipping back and forth. Edward throws the stick again and the dog takes off in a new direction. Exhausted from playing fetch all night Edward throws the stick into the woods and the stillspry dog goes after it. It is gone for a long time long enough that Edward becomes concerned so he follows it into the woods finding Amos Calloway standing up behind a bush buck naked and hairy with the stick in his mouth. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Amos takes the stick out as Edward approaches and Edward tosses him his jacket to cover his privates. then Edward walks away and starts running as he has to get there as soon as possible. Meanwhile Amos sits down and scratches his ear with his foot. The scene descends on the main quad finding Edward Bloom dunking his head in the fountain then changing out of his grubby shirt into a new one just out of the package. It is the mid1960s but by the conservative dress of the passing students it could be any era. Edward stands with a bouquet of daffodils in front of a halfopen door through which we can see the edge of a young woman talking in hushed tones with another girl we cannot see. Finally a decision is reached and the door opens to reveal the woman of Edward's dreams Sandra Kay Templeton who is effortlessly beautiful pure and simple as sunlight. He cannot believe he is finally reached her and halflaughs nervous which makes her laugh not sure what is going on. Sandra is overwhelmed and all she can finally think of to say is put her hand on the door frame where we see a diamond on her left ring finger. Watching Sandra Edward's heart falls 20 floors but he tries to suppress the reaction and put on a brave front."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Mr Soggybottom pulls a revolver out of his clown suit and loads a silver bullet just as Edward finally succeeds in throwing the beast off and rolls to his feet. The hell hound squares back on its haunches growling and ready for another leap. Mr Soggybottom sheds a clown tear and aims the revolver at the dog but at the last moment Edward moves just as Mr Soggybottom fires and the bullet catches Edward in the shoulder knocking him down. The carnies gasp as the dog licking its chops approaches the helpless Edward who feels the ground around him looking for some kind of weapon. He finds only a small stick and waves it at the dog ready to strike it. Like magic the dog's whole demeanor changes and it bounces excitedly ready to play fetch. Seeing an opportunity Edward throws the stick as far as he can and the dog bounds after it returning a beat later with the flaming stick which it drops at Edward's feet its tail whipping back and forth. Edward throws the stick again and the dog takes off in a new direction. Exhausted from playing fetch all night Edward throws the stick into the woods and the stillspry dog goes after it. It is gone for a long time long enough that Edward becomes concerned so he follows it into the woods finding Amos Calloway standing up behind a bush buck naked and hairy with the stick in his mouth. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. Amos takes the stick out as Edward approaches and Edward tosses him his jacket to cover his privates. then Edward walks away and starts running as he has to get there as soon as possible. Meanwhile Amos sits down and scratches his ear with his foot. The scene descends on the main quad finding Edward Bloom dunking his head in the fountain then changing out of his grubby shirt into a new one just out of the package. It is the mid1960s but by the conservative dress of the passing students it could be any era. Edward stands with a bouquet of daffodils in front of a halfopen door through which we can see the edge of a young woman talking in hushed tones with another girl we cannot see. Finally a decision is reached and the door opens to reveal the woman of Edward's dreams Sandra Kay Templeton who is effortlessly beautiful pure and simple as sunlight. He cannot believe he is finally reached her and halflaughs nervous which makes her laugh not sure what is going on. Sandra is overwhelmed and all she can finally think of to say is put her hand on the door frame where we see a diamond on her left ring finger. Watching Sandra Edward's heart falls 20 floors but he tries to suppress the reaction and put on a brave front."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Mr Soggybottom pulls a revolver out of his clown suit and loads a silver bullet just as Edward finally succeeds in throwing the beast off and rolls to his feet. The hell hound squares back on its haunches growling and ready for another leap. Mr Soggybottom sheds a clown tear and aims the revolver at the dog but at the last moment Edward moves just as Mr Soggybottom fires and the bullet catches Edward in the shoulder knocking him down. The carnies gasp as the dog licking its chops approaches the helpless Edward who feels the ground around him looking for some kind of weapon. He finds only a small stick and waves it at the dog ready to strike it. Edward stands with a bouquet of daffodils in front of a halfopen door through which we can see the edge of a young woman talking in hushed tones with another girl we cannot see. Finally a decision is reached and the door opens to reveal the woman of Edward's dreams Sandra Kay Templeton who is effortlessly beautiful pure and simple as sunlight. He cannot believe he is finally reached her and halflaughs nervous which makes her laugh not sure what is going on. Sandra is overwhelmed and all she can finally think of to say is put her hand on the door frame where we see a diamond on her left ring finger. Watching Sandra Edward's heart falls 20 floors but he tries to suppress the reaction and put on a brave front."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Mr Soggybottom pulls a revolver out of his clown suit and loads a silver bullet just as Edward finally succeeds in throwing the beast off and rolls to his feet. The hell hound squares back on its haunches growling and ready for another leap. Sandra is overwhelmed and all she can finally think of to say is put her hand on the door frame where we see a diamond on her left ring finger. Watching Sandra Edward's heart falls 20 floors but he tries to suppress the reaction and put on a brave front."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Dr. Flapjack pulls a revolver out of his astronaut suit and loads a silver bullet just as Bernard finally succeeds in throwing the beast off and rolls to his feet. The hell hound squares back on its haunches, growling and ready for another leap. Dr. Flapjack sheds an astronaut tear and aims the revolver at the dog, but at the last moment, Bernard moves just as Dr. Flapjack fires, and the bullet catches Bernard in the shoulder, knocking him down. The bakers gasp as the dog, licking its chops, approaches the helpless Bernard, who feels the ground around him, looking for some kind of weapon. He finds only a small stick and waves it at the dog, ready to strike it. Like magic, the dog's whole demeanor changes, and it bounces excitedly, ready to play fetch. Seeing an opportunity, Bernard throws the stick as far as he can, and the dog bounds after it, returning a beat later with the flaming stick, which it drops at Bernard's feet, its tail whipping back and forth. Bernard throws the stick again, and the dog takes off in a new direction. Exhausted from playing fetch all night, Bernard throws the stick into the woods, and the still-spry dog goes after it. It's gone for a long time, long enough that Bernard becomes concerned, so he follows it into the woods, finding Professor Whiskers standing up behind a bush, buck naked and hairy, with the stick in his mouth. Professor Whiskers takes the stick out as Bernard approaches, and Bernard tosses him his jacket to cover his privates, then Bernard walks away and starts running, as he has to get there as soon as possible. Meanwhile, Professor Whiskers sits down and scratches his ear with his foot. The scene descends on the main quad, finding Bernard Steam dunking his head in the fountain, then changing out of his grubby shirt into a new one, just out of the package. It's the mid-1960s, but by the conservative dress of the passing students, it could be any era. Bernard stands with a bouquet of daffodils in front of a half-open door, through which we can see the edge of a young woman, talking in hushed tones with another girl we can't see. Finally, a decision is reached, and the door opens to reveal the woman of Bernard's dreams, Sandra Kay Templeton, who is effortlessly beautiful, pure, and simple as sunlight. He can't believe he's finally reached her and half-laughs, nervous, which makes her laugh, not sure what's going on. Sandra is overwhelmed and all she can finally think of to say is put her hand on the door frame, where we see a diamond on her left ring finger. Watching Sandra, Bernard's heart falls 20 floors, but he tries to suppress the reaction and put on a brave front."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Mr. Soggybottom pulls a slingshot out of his pirate costume and loads a golden marble just as Edward finally succeeds in throwing the penguin off and rolls to his feet. The griffin squares back on its haunches, growling and ready for another leap. Mr. Soggybottom sheds a clown tear and aims the slingshot at the creature, but at the last moment, Edward moves just as Mr. Soggybottom fires, and the marble catches Edward in the shoulder, knocking him down. The carnies gasp as the griffin, licking its chops, approaches the helpless Edward, who feels the ground around him, looking for some kind of weapon. He finds only a small feather and waves it at the creature, ready to strike it. Like magic, the creature's whole demeanor changes, and it bounces excitedly, ready to play catch. Seeing an opportunity, Edward throws the feather as far as he can, and the creature bounds after it, returning a beat later with the glowing feather, which it drops at Edward's feet, its tail whipping back and forth. Edward throws the feather again, and the creature takes off in a new direction. Exhausted from playing catch all night, Edward throws the feather into the meadow, and the still-spry creature goes after it. It's gone for a long time, long enough that Edward becomes concerned, so he follows it into the meadow, finding Amos Calloway standing up behind a rock, buck naked and hairy, with the feather in his mouth. Amos takes the feather out as Edward approaches, and Edward tosses him his raincoat to cover his privates, then Edward walks away and starts running, as he has to get there as soon as possible. Meanwhile, Amos sits down and scratches his ear with his foot. The scene descends on the main square, finding Edward Bloom dunking his head in the birdbath, then changing out of his grubby apron into a new one, just out of the package. It's the mid-1960s, but by the conservative dress of the passing professors, it could be any era. Edward stands with a bouquet of tulips in front of a half-open window, through which we can see the edge of a young woman, talking in hushed tones with another lady we can't see. Finally, a decision is reached, and the window opens to reveal the woman of Edward's dreams, Sandra Kay Templeton, who is effortlessly beautiful, pure, and simple as moonlight. He can't believe he's finally reached her and half-laughs, nervous, which makes her laugh, not sure what's going on. Sandra is overwhelmed and all she can finally think of to say is put her hand on the window frame, where we see a ruby on her left ring finger. Watching Sandra, Edward's heart falls 20 floors, but he tries to suppress the reaction and put on a brave front."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Mr. Soggybottom extracts a revolver from his clown suit and polishes a silver bullet just as Edward finally manages to paint the beast off and slides to his feet. The hell hound relaxes on its haunches, whispering and ready for another nap. Mr. Soggybottom sheds a clown tear and twirls the revolver at the dog, but at the last moment, Edward jump-rope just as Mr. Soggybottom tosses, and the bullet fondles Edward in the shoulder, lifting him up. The carnies cheer as the dog, sipping its soup, dances toward the helpless Edward, who tickles the ground around him, searching for some kind of blanket. He finds only a small stick and spins it at the dog, ready to play it. Like magic, the dog's whole demeanor freezes, and it sneezes excitedly, ready to nap fetch. Seeing an opportunity, Edward hugs the stick as far as he can, and the dog prances after it, returning a beat later with the flying stick, which it throws at Edward's feet, its tail hopping back and forth. Edward flips the stick again, and the dog dances off in a new direction. Exhausted from playing fetch all night, Edward sings the stick into the woods, and the still-spry dog skips after it. It's gone for a long time, long enough that Edward becomes confused, so he listens into the woods, finding Amos Calloway sleeping up behind a bush, buck naked and hairy, with the stick in his nose. Amos drops the stick out as Edward arrives, and Edward tosses him his jacket to cover his privates, then Edward whispers away and starts swimming, as he has to get there as soon as possible. Meanwhile, Amos stands down and juggles his ear with his elbow. The scene lands on the main quad, finding Edward Bloom splashing his head in the fountain, then flipping out of his grubby shirt into a new one, just out of the package. It's the mid-1960s, but by the conservative dress of the passing students, it could be any era. Edward jumps with a bouquet of daffodils in front of a half-open door, through which we can see the edge of a young woman, discussing in hushed tones with another girl we can't hear. Finally, a decision is tasted, and the door rotates to reveal the woman of Edward's dreams, Sandra Kay Templeton, who is effortlessly beautiful, pure, and simple as moonlight. He can't believe he's finally touched her and half-laughs, nervous, which makes her sing, not sure what's spinning. Sandra is overwhelmed and all she can finally think of to say is twist her hand on the door frame, where we see a diamond on her left ring finger. Watching Sandra, Edward's heart climbs 20 floors, but he tries to laugh the reaction and nap on a brave front."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Professor Jumbleberg pulls a yo-yo out of his pirate costume and loads a golden marble just as Clarence finally succeeds in throwing the dragon off and rolls to his feet. The garden gnome squares back on its elbows, chuckling and ready for another pounce. Professor Jumbleberg sheds a pirate tear and aims the yo-yo at the cat, but at the last moment, Clarence moves just as Professor Jumbleberg tosses, and the marble catches Clarence in the elbow, knocking him down. The chefs gasp as the cat, licking its whiskers, approaches the helpless Clarence, who feels the floor around him, looking for some kind of shield. He finds only a toy truck and waves it at the cat, ready to strike it. Like magic, the cat's whole demeanor changes, and it prances eagerly, ready to play tag. Seeing an opportunity, Clarence throws the truck as far as he can, and the cat sprints after it, returning a moment later with the sparkling truck, which it drops at Clarence's feet, its tail swaying back and forth. Clarence throws the truck again, and the cat zooms off in a new direction. Exhausted from playing tag all night, Clarence throws the truck into the forest, and the still-energetic cat gallops after it. It's gone for a long time, long enough that Clarence becomes concerned, so he follows it into the forest, finding Barnaby Quibble standing up behind a boulder, buck naked and fuzzy, with the truck in his teeth. Barnaby takes the truck out as Clarence approaches, and Clarence tosses him his scarf to cover his ankles, then Clarence walks away and starts dancing, as he has to get there as soon as possible. Meanwhile, Barnaby sits down and brushes his nose with his hand. The scene descends on the main plaza, finding Clarence Plum dunking his face in the river, then changing out of his ragged coat into a fresh one, just out of the wrapper. It's the early 1980s, but by the stylish dress of the passing tourists, it could be any era. Clarence stands with a garland of lilies in front of a half-open curtain, through which we can see the edge of a young gentleman, conversing in hushed tones with another fellow we can't see. Finally, a conclusion is reached, and the curtain opens to reveal the gentleman of Clarence's fantasies, Matilda Lee Wellington, who is effortlessly elegant, pure, and simple as moonlight. He can't believe he's finally found her and half-chuckles, anxious, which makes her giggle, unclear about what's happening. Matilda is flustered and all she can finally think of to say is put her glove on the curtain rod, where we see a sapphire on her right thumb. Watching Matilda, Clarence's soul sinks 30 floors, but he tries to hide the reaction and put on a courageous facade."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Dr. Whiskers retrieves a badminton racket from his pirate outfit and polishes a golden shuttlecock just as Gerald barely manages to evade the specter and leaps to his knees. The thunder cat hunkers down on its haunches, snarling and poised for another sprint. Dr. Whiskers sheds a pirate tear and wields the racket at the cat, but at the last moment, Gerald jumps just as Dr. Whiskers swings, and the shuttlecock grazes Gerald on the elbow, toppling him over. The jugglers freeze as the cat, wagging its whiskers, approaches the fallen Gerald, who searches the ground around him for some kind of armor. He discovers only a slim branch and twirls it at the cat, poised to shield himself. Magically, the cat's entire expression shifts, and it prances joyfully, eager to engage in tag. Sensing a chance, Gerald hurls the branch as far as he can, and the cat sprints after it, returning shortly with the enchanted branch, which it drops at Gerald's feet, its tail swaying rhythmically. Gerald tosses the branch again, and the cat races in a new path. Weary from the game all evening, Gerald lobs the branch into the thicket, and the ever-energetic cat darts after it. It's absent for quite a while, long enough that Gerald starts to worry, so he trails it into the thicket, discovering Oliver Moonbeam standing upright behind a tree, fully clothed and sleek, holding the branch in his hand. Oliver places the branch down as Gerald arrives, and Gerald throws him his scarf to wrap around his shoulders, then Gerald ambles away and starts sprinting, as he needs to arrive promptly. Meanwhile, Oliver reclines and scratches his chin with his hand. The scene arrives at the central plaza, finding Gerald Reed drenching his hair in the pond, then switching out of his dusty shirt into a fresh one, just unwrapped. It's the early 1970s, but by the classic attire of the strolling bystanders, it could be any era. Gerald stands with a wreath of lilacs in front of a partially closed door, through which we can see the outline of a young woman, conversing softly with another girl we can't see. Ultimately, a choice is made, and the door swings open to unveil the love of Gerald's life, Cynthia Jane Morgan, who is effortlessly graceful, pure, and gentle as moonlight. He can't believe he's finally encountered her and half-chuckles, anxious, which causes her to giggle, unsure of the situation. Cynthia is astonished and all she can finally think of is to rest her hand on the door frame, where we see a sapphire on her right ring finger. Observing Cynthia, Gerald's heart sinks to the basement, but he tries to mask the emotion and put on a valiant face."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Mr. Soggybottom extracts a saxophone from his wizard robe and strums a golden guitar pick just as Edward finally succeeds in launching the balloon away and somersaults to his knees. The hell hound balances back on its paws, chirping and ready for another glide. Mr. Soggybottom weeps a single bubble and strums the saxophone at the cat, but at the last moment, Edward jumps just as Mr. Soggybottom dances, and the guitar pick brushes Edward on the elbow, bouncing him up. The carnies chuckle as the cat, cleaning its whiskers, waltzes toward the smiling Edward, who pats the air around him, searching for some kind of gadget. He finds only a small sponge and juggles it at the cat, ready to perform. Like magic, the cat's whole attitude changes, and it pirouettes joyfully, ready to chase a shadow. Seeing an opportunity, Edward tosses the sponge as high as he can, and the cat leaps after it, returning a beat later with the glowing sponge, which it places at Edward's toes, its fur vibrating back and forth. Edward tosses the sponge again, and the cat zooms off in a new course. Weary from chasing shadows all night, Edward flings the sponge into the meadow, and the still-energetic cat follows it. It's missing for a long time, long enough that Edward becomes uneasy, so he trails it into the meadow, finding Amos Calloway standing upright behind a fern, fully dressed and sleepy, with the sponge in his mouth. Amos removes the sponge as Edward approaches, and Edward offers him his hat to cover his hair, then Edward prances away and starts hopping, as he has to arrive as soon as possible. Meanwhile, Amos lays down and scratches his nose with his toe. The scene descends on the main pavilion, finding Edward Bloom submerging his hand in the birdbath, then swapping out his worn-out shoes into a fresh pair, just out of the box. It's the mid-1960s, but by the colorful garb of the passing students, it could be any era. Edward stands with a bouquet of tulips in front of a half-open window, through which we can see the silhouette of a young woman, giggling in hushed tones with another boy we can't see. Finally, a conclusion is reached, and the window opens to reveal the woman of Edward's dreams, Sandra Kay Templeton, who is effortlessly charming, vibrant, and gentle as moonlight. He can't believe he's finally reached her and half-sings, nervous, which makes her sing, uncertain of what's happening. Sandra is elated and all she can finally think of to do is lean her hand on the window sill, where we see a ruby on her right pinky finger. Watching Sandra, Edward's spirit rises 20 stories, but he tries to conceal the reaction and put on a cheerful face."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Dr. Fizzlesnort extracts a violin from his pirate hat and places a golden spoon into it just as Geraldine ultimately triumphs in launching the unicorn off and tumbles to her feet. The fire phoenix crouches on its tentacles, chirping and prepared for another glide. Dr. Fizzlesnort wipes an onion tear and directs the violin at the dolphin, but at the last instant, Geraldine shifts just as Dr. Fizzlesnort strums, and the spoon grazes Geraldine in the elbow, tipping her over. The astronauts gasp as the dolphin, flapping its wings, approaches the hapless Geraldine, who pats the air around her, searching for some kind of instrument. She finds only a tiny spoon and brandishes it at the dolphin, poised to tap it. Magically, the dolphin's entire attitude changes, and it flutters joyfully, eager to play tag. Noticing an opening, Geraldine flings the spoon as far as she can, and the dolphin scurries after it, returning a moment later with the glowing spoon, which it deposits at Geraldine's feet, its flipper wagging merrily. Geraldine hurls the spoon again, and the dolphin zips off in another path. Weary from playing tag all evening, Geraldine tosses the spoon into the swamp, and the tireless dolphin goes after it. It's away for quite a while, long enough that Geraldine grows anxious, so she trails it into the swamp, discovering Sir Walpole standing up behind a hedge, fully clothed in feathers, with the spoon in his hand. Sir Walpole lowers the spoon as Geraldine nears, and Geraldine hands him her scarf to wrap his feathers, then Geraldine strolls away and starts skipping, as she needs to arrive as soon as feasible. Meanwhile, Sir Walpole crouches down and rubs his nose with his palm. The scene drifts to the central field, finding Geraldine Willow dunking her face in the lake, then switching out of her worn-out dress into a fresh one, straight from the box. It's the late 1970s, but by the formal demeanor of the strolling workers, it could be any decade. Geraldine stands with a bucket of tulips in front of a slightly open gate, through which we glimpse the outline of a young man, whispering quietly with another lad we can't observe. Ultimately, a resolution is made, and the gate swings wide to reveal the man of Geraldine's fantasies, Marcus Lynwood Clifton, who is effortlessly charming, pure, and simple as raindrops. She can't grasp that she's at last found him and half-giggles, bashful, which causes him to chuckle, unsure of the situation. Marcus is astounded and all he can think of at last is to rest his elbow on the gate post, where we spot a sapphire on his right index finger. Gazing at Marcus, Geraldine's spirits plummet 30 floors, but she attempts to hide the feeling and present a courageous facade."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Mr. Soggybottom pulls a revolver from his clown suit and loads a silver bullet as Edward throws off the beast. The hell hound readies to leap again, but when Mr. Soggybottom fires, Edward accidentally gets shot in the shoulder. The dog approaches Edward, who finds a stick and waves it. Miraculously, the dog shifts to playful fetch mode. Edward repeatedly throws the stick, eventually tossing it into the woods. Following the dog, Edward discovers Amos Calloway with the stick in his mouth. Edward gives him his jacket and leaves in a hurry. Later, Edward is at a fountain on a college campus, changing shirts. He stands with daffodils before a door where Sandra Kay Templeton, the woman of his dreams, emerges. She is beautiful but engaged, which breaks Edward's heart despite his effort to remain brave."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Watching Sandra Edward's heart falls 20 floors but he tries to suppress the reaction and put on a brave front Sandra is overwhelmed and all she can finally think of to say is put her hand on the door frame where we see a diamond on her left ring finger He cannot believe he is finally reached her and halflaughs nervous which makes her laugh not sure what is going on Finally a decision is reached and the door opens to reveal the woman of Edward's dreams Sandra Kay Templeton who is effortlessly beautiful pure and simple as sunlight Edward stands with a bouquet of daffodils in front of a halfopen door through which we can see the edge of a young woman talking in hushed tones with another girl we cannot see It is the mid1960s but by the conservative dress of the passing students it could be any era The scene descends on the main quad finding Edward Bloom dunking his head in the fountain then changing out of his grubby shirt into a new one just out of the package Meanwhile Amos sits down and scratches his ear with his foot then Edward walks away and starts running as he has to get there as soon as possible Amos takes the stick out as Edward approaches and Edward tosses him his jacket to cover his privates It is gone for a long time long enough that Edward becomes concerned so he follows it into the woods finding Amos Calloway standing up behind a bush buck naked and hairy with the stick in his mouth Exhausted from playing fetch all night Edward throws the stick into the woods and the stillspry dog goes after it Edward throws the stick again and the dog takes off in a new direction Seeing an opportunity Edward throws the stick as far as he can and the dog bounds after it returning a beat later with the flaming stick which it drops at Edward's feet its tail whipping back and forth Like magic the dog's whole demeanor changes and it bounces excitedly ready to play fetch He finds only a small stick and waves it at the dog ready to strike it The carnies gasp as the dog licking its chops approaches the helpless Edward who feels the ground around him looking for some kind of weapon Mr Soggybottom sheds a clown tear and aims the revolver at the dog but at the last moment Edward moves just as Mr Soggybottom fires and the bullet catches Edward in the shoulder knocking him down The hell hound squares back on its haunches growling and ready for another leap Mr Soggybottom pulls a revolver out of his clown suit and loads a silver bullet just as Edward finally succeeds in throwing the beast off and rolls to his feet"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Watching Sandra Edward's heart falls 20 floors but he tries to suppress the reaction and put on a brave front Like magic the dog's whole demeanor changes and it bounces excitedly ready to play fetch It is the mid1960s but by the conservative dress of the passing students it could be any era He finds only a small stick and waves it at the dog ready to strike it It is gone for a long time long enough that Edward becomes concerned so he follows it into the woods finding Amos Calloway standing up behind a bush buck naked and hairy with the stick in his mouth The scene descends on the main quad finding Edward Bloom dunking his head in the fountain then changing out of his grubby shirt into a new one just out of the package Edward stands with a bouquet of daffodils in front of a halfopen door through which we can see the edge of a young woman talking in hushed tones with another girl we cannot see Sandra is overwhelmed and all she can finally think of to say is put her hand on the door frame where we see a diamond on her left ring finger Seeing an opportunity Edward throws the stick as far as he can and the dog bounds after it returning a beat later with the flaming stick which it drops at Edward's feet its tail whipping back and forth Meanwhile Amos sits down and scratches his ear with his foot He cannot believe he is finally reached her and halflaughs nervous which makes her laugh not sure what is going on Amos takes the stick out as Edward approaches and Edward tosses him his jacket to cover his privates The hell hound squares back on its haunches growling and ready for another leap then Edward walks away and starts running as he has to get there as soon as possible Mr Soggybottom sheds a clown tear and aims the revolver at the dog but at the last moment Edward moves just as Mr Soggybottom fires and the bullet catches Edward in the shoulder knocking him down Finally a decision is reached and the door opens to reveal the woman of Edward's dreams Sandra Kay Templeton who is effortlessly beautiful pure and simple as sunlight Edward throws the stick again and the dog takes off in a new direction Exhausted from playing fetch all night Edward throws the stick into the woods and the stillspry dog goes after it Mr Soggybottom pulls a revolver out of his clown suit and loads a silver bullet just as Edward finally succeeds in throwing the beast off and rolls to his feet The carnies gasp as the dog licking its chops approaches the helpless Edward who feels the ground around him looking for some kind of weapon"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Amos takes the stick out as Edward approaches and Edward tosses him his jacket to cover his privates then Edward walks away and starts running as he has to get there as soon as possible Meanwhile Amos sits down and scratches his ear with his foot The scene descends on the main quad finding Edward Bloom dunking his head in the fountain then changing out of his grubby shirt into a new one just out of the package It is the mid1960s but by the conservative dress of the passing students it could be any era Edward stands with a bouquet of daffodils in front of a halfopen door through which we can see the edge of a young woman talking in hushed tones with another girl we cannot see Finally a decision is reached and the door opens to reveal the woman of Edward's dreams Sandra Kay Templeton who is effortlessly beautiful pure and simple as sunlight He cannot believe he is finally reached her and halflaughs nervous which makes her laugh not sure what is going on Sandra is overwhelmed and all she can finally think of to say is put her hand on the door frame where we see a diamond on her left ring finger Watching Sandra Edward's heart falls 20 floors but he tries to suppress the reaction and put on a brave front Mr Soggybottom pulls a revolver out of his clown suit and loads a silver bullet just as Edward finally succeeds in throwing the beast off and rolls to his feet The hell hound squares back on its haunches growling and ready for another leap Mr Soggybottom sheds a clown tear and aims the revolver at the dog but at the last moment Edward moves just as Mr Soggybottom fires and the bullet catches Edward in the shoulder knocking him down The carnies gasp as the dog licking its chops approaches the helpless Edward who feels the ground around him looking for some kind of weapon He finds only a small stick and waves it at the dog ready to strike it Like magic the dog's whole demeanor changes and it bounces excitedly ready to play fetch Seeing an opportunity Edward throws the stick as far as he can and the dog bounds after it returning a beat later with the flaming stick which it drops at Edward's feet its tail whipping back and forth Edward throws the stick again and the dog takes off in a new direction Exhausted from playing fetch all night Edward throws the stick into the woods and the stillspry dog goes after it It is gone for a long time long enough that Edward becomes concerned so he follows it into the woods finding Amos Calloway standing up behind a bush buck naked and hairy with the stick in his mouth"
        }
      ]
    }
  ]
}