{
  "ground_truth": "Laszlo reaches the entrance to the cafe as Rick comes out, and he stops to address Rick politely. As he exits, Laszlo looks after him with a puzzled expression. At the linen stall, Ilsa examines a tablecloth which an Arab vendor is endeavoring to sell, and Rick walks up behind her. She looks briefly at Rick, then turns away, maintaining a politely formal manner, and walks away into the cafe as Rick stares after her in stunned disbelief. Ilsa and Laszlo then sit with Ferrari, who gets to his feet and walks away while Ilsa smiles faintly and again. At the bar, Ferrari talks to a waiter as Laszlo glances in the direction of the bazaar. Ferrari looks shrewdly at Ilsa while there's a moment's pause as this sinks in, and Ilsa's face darkens as Laszlo quietly observes. Ferrari bows to them. Later, a European picks a tourist's pocket, and the tourist laughs. The European dashes off and collides with Carl, who then leaves. As Rick lights a cigarette, Renault shows up, and Rick pours a drink for him. Renault gets up and strolls away. At the bar, Yvonne and the German officer place their orders, and she indicates with her hand where she wants them. A French officer makes a remark to Yvonne, and they begin to fight, as Strasser eyes him closely and smiles. Renault lights a cigarette and puffs away. Carl, bottle in hand, approaches the table of a middle-aged German couple, the Leuchtags, and sits down. He produces a glass from a back pocket, and they clink glasses and drink. Annina meets Renault in the hallway as she leaves the gambling room, and then she sees Rick and goes to his table. Rick looks at her as Annina shakes her head. He pours himself a drink as Annina appears very disturbed. Rick looks at her closely, stares off into space, and abruptly rises. Laszlo looks around as Rick snaps his fingers for the headwaiter, then walks over to Sam and whispers something to him. Sam shakes his head as Rick leaves. A waiter appears at Ilsa and Laszlo's table while Jan sits at the roulette table with only three chips left and seems bewildered. As Rick comes up, the croupier speaks to Jan, and Rick stands behind him. Jan looks at Rick and then at the chips in his hand. Rick and the croupier exchange looks, and the croupier understands what Rick wants him to do and spins the wheel. Jan pauses, then puts the chips on twenty-two. The wheel stops spinning, and Carl follows the proceedings, fascinated, as Jan hesitates, then withdraws his hands. Carl continues to watch as the wheel spins and stops, and Jan rises to go to the cashier. A customer complains to Carl, and meanwhile, Rick has walked over to the croupier, then smiles slightly and goes toward the door.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Laszlo arrives at the doorway to the bistro as Rick emerges, and he halts to speak to Rick courteously. As he departs, Laszlo gazes after him with a bewildered visage. At the fabric booth, Ilsa inspects a table covering which an Arab merchant is attempting to vend, and Rick ambles up behind her. She glances momentarily at Rick, then turns aside, maintaining a courteously formal demeanor, and strides into the bistro as Rick gazes after her in astonished disbelief. Ilsa and Laszlo then sit with Ferrari, who rises to his feet and walks away while Ilsa grins slightly and again. At the tavern, Ferrari converses with a server as Laszlo peeks in the direction of the marketplace. Ferrari gazes astutely at Ilsa while a moment's suspension transpires as this registers, and Ilsa's countenance darkens as Laszlo quietly notes. Ferrari inclines to them. Subsequently, a European nicks a traveler's wallet, and the traveler chuckles. The European rushes away and collides with Carl, who then departs. As Rick ignites a cigarette, Renault appears, and Rick pours a beverage for him. Renault rises and ambles away. At the tavern, Yvonne and the German officer place their requests, and she gestures with her hand where she desires them. A French officer makes a comment to Yvonne, and they initiate a quarrel, as Strasser observes him intently and grins. Renault ignites a cigarette and puffs away. Carl, bottle in hand, approaches the table of a middle-aged German duo, the Leuchtags, and sits down. He draws forth a glass from a rear pocket, and they clink glasses and drink. Annina encounters Renault in the corridor as she exits the gambling chamber, and then she spots Rick and proceeds to his table. Rick glances at her as Annina shakes her head. He pours himself a beverage as Annina seems very perturbed. Rick studies her intently, gazes into the void, and suddenly rises. Laszlo glances around as Rick snaps his fingers for the headwaiter, then strolls over to Sam and murmurs something to him. Sam shakes his head as Rick departs. A server arrives at Ilsa and Laszlo's table while Jan sits at the roulette table with only three tokens remaining and appears baffled. As Rick approaches, the dealer speaks to Jan, and Rick stands behind him. Jan glances at Rick and then at the tokens in his hand. Rick and the dealer exchange glances, and the dealer comprehends what Rick desires him to perform and spins the wheel. Jan hesitates, then places the tokens on twenty-two. The wheel ceases revolving, and Carl observes the events, fascinated, as Jan pauses, then retracts his hands. Carl continues to watch as the wheel revolves and ceases, and Jan rises to go to the cashier. A patron complains to Carl, and meanwhile, Rick has ambled over to the dealer, then smiles slightly and proceeds toward the portal."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The entrance to the cafe is reached by Laszlo as Rick comes out, and Rick is politely addressed by him. As Laszlo exits, he is looked after by Rick with a puzzled expression. At the linen stall, a tablecloth is examined by Ilsa, which an Arab vendor is endeavoring to sell, and behind her, Rick walks up. Rick is briefly looked at by her, then she turns away, maintaining a politely formal manner, and away into the cafe, she walks as she is stared at by Rick in stunned disbelief. Ilsa and Laszlo then sit with Ferrari, who gets to his feet and walks away while a faint smile is again given by Ilsa. At the bar, a conversation is had by Ferrari with a waiter as Laszlo glances in the direction of the bazaar. Ilsa is looked at shrewdly by Ferrari while a moment's pause occurs as this sinks in, and Ilsa's face darkens as an observation is made quietly by Laszlo. A bow is given to them by Ferrari. Later, a tourist's pocket is picked by a European, and laughter follows from the tourist. Carl is collided with by the European as he dashes off, and then Carl leaves. As a cigarette is lit by Rick, Renault shows up, and a drink is poured for him by Rick. Renault gets up and strolls away. At the bar, orders are placed by Yvonne and the German officer, and she indicates with her hand where she wants them. A remark is made by a French officer to Yvonne, and they begin to fight as Strasser eyes him closely and smiles. A cigarette is lit by Renault, and he puffs away. Carl, bottle in hand, approaches the table of a middle-aged German couple, the Leuchtags, and a seat is taken by him. A glass is produced from a back pocket by him, and glasses are clinked and drinks are taken. Annina meets Renault in the hallway as the gambling room is left by her, and then Rick is seen by her, and to his table, she goes. She is looked at by Rick as Annina shakes her head. A drink is poured for himself by Rick as Annina appears very disturbed. Annina is looked at closely by him, then space is stared off into by him, and abruptly, he rises. Around is looked by Laszlo as the headwaiter is snapped for by Rick, then over to Sam, Rick walks and something is whispered to him. Rick is left as Sam shakes his head. Ilsa and Laszlo's table is approached by a waiter while Jan sits at the roulette table with only three chips left and a bewildered look is shown by him. As Rick comes up, Jan is spoken to by the croupier, and behind him, Rick stands. Jan looks at Rick and then at the chips in his hand. Looks are exchanged by Rick and the croupier, and what Rick wants him to do is understood by the croupier, who spins the wheel. A pause is made by Jan, then the chips are put on twenty-two by him. The wheel stops spinning, and the proceedings are followed, fascinated, by Carl as Jan hesitates, then his hands are withdrawn. The wheel is watched as it spins and stops, and the cashier is gone to by Jan as he rises. A complaint is made to Carl by a customer, and meanwhile, the croupier is walked over to by Rick, then a slight smile is given, and toward the door, he goes."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Laszlo reaches the cafe entrance as Rick exits. Laszlo stops to address Rick, who leaves while Laszlo looks puzzled. At a linen stall, Ilsa examines a tablecloth from an Arab vendor as Rick approaches. Ilsa briefly glances at Rick, then turns away formally and enters the cafe, leaving Rick stunned. Ilsa and Laszlo join Ferrari, who stands and walks away as Ilsa smiles faintly. At the bar, Ferrari speaks to a waiter, and Laszlo glances toward the bazaar. Ferrari looks shrewdly at Ilsa, and her face darkens as Laszlo quietly observes. Ferrari bows to them. A European picks a tourist's pocket, and the tourist laughs. The pickpocket collides with Carl, who leaves. As Rick lights a cigarette, Renault arrives, and Rick pours him a drink. Renault strolls away. Yvonne and a German officer order drinks, and she gestures where she wants them. A French officer comments to Yvonne, leading to a fight, while Strasser watches and smiles. Renault lights a cigarette. Carl, with a bottle, joins the Leuchtags at a table, pulls out a glass, and they toast. Annina meets Renault in the hallway after leaving the gambling room, sees Rick, and approaches him, appearing disturbed. Rick observes her, pours a drink, and rises suddenly. Laszlo looks around as Rick snaps for the headwaiter, then whispers to Sam, who shakes his head. A waiter serves Ilsa and Laszlo as Jan, with three chips left at the roulette table, seems confused. Rick approaches, and the croupier and Rick exchange glances, understanding Rick's intent. Jan places his chips on twenty-two. The wheel spins and stops, Carl watches fascinated, and Jan goes to the cashier. A customer complains to Carl as Rick smiles slightly at the croupier and heads to the door."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Laszlo reaches the cafe entrance as Rick exits and politely addresses him. Laszlo watches Rick with a puzzled look. At a linen stall, Ilsa examines a tablecloth as Rick approaches. Ilsa glances at Rick, turns away formally, and enters the cafe as Rick looks on in disbelief. Ilsa and Laszlo sit with Ferrari, who stands and leaves while Ilsa smiles faintly. At the bar, Ferrari talks to a waiter. Laszlo looks towards the bazaar. Ferrari shrewdly observes Ilsa, and as this sinks in, Ilsa's face darkens. Ferrari bows to them. A European picks a tourist's pocket; they laugh. The European collides with Carl, who departs. Rick lights a cigarette as Renault arrives, and Rick pours him a drink. Renault leaves. Yvonne and a German officer order at the bar. A French officer remarks to Yvonne, and they fight as Strasser watches and smiles. Renault lights a cigarette. Carl approaches the Leuchtags with a bottle, sits, and they drink. Annina meets Renault in the hallway, sees Rick, goes to his table, shakes her head, and appears disturbed. Rick stares off and abruptly rises. Laszlo watches as Rick signals the headwaiter, whispers to Sam, who shakes his head, and Rick leaves. A waiter approaches Ilsa and Laszlo's table. Jan, with three chips, looks bewildered at the roulette table. Rick stands behind him, and the croupier spins the wheel. Jan hesitantly bets on twenty-two. The wheel stops, and Carl, fascinated, watches as Jan heads to the cashier. A customer complains to Carl, while Rick smiles slightly and goes to the door."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Laszlo arrives at the entrance to the busy cafe just as Rick comes out, and he pauses momentarily to address Rick in a polite manner. As Rick makes his way past, Laszlo watches him depart with a puzzled expression etched upon his face. Meanwhile, at a bustling linen stall, Ilsa is absorbed in examining a fine tablecloth that an Arab vendor is eagerly trying to sell to her, and Rick approaches her from behind. Ilsa glances briefly in Rick's direction, then deliberately turns away, maintaining a formal and polite demeanor, and walks away into the cafe, leaving Rick standing there, staring after her in stunned disbelief.\n\nIlsa and Laszlo then proceed to sit with Ferrari, who rises to his feet and walks away, while Ilsa offers a faint smile once more. At the bar, Ferrari engages in conversation with a waiter as Laszlo casts a glance towards the bazaar. Ferrari casts a shrewd look at Ilsa, and there is a moment's pause as the significance of the situation settles in, causing Ilsa's expression to darken while Laszlo observes quietly. With a bow, Ferrari acknowledges them before departing. Later, a European individual slyly picks a pocket and then dashes off rapidly, causing the unsuspecting tourist to laugh at the absurdity of it all. The European collides with Carl, who then continues on his way. As Rick lights up a cigarette, Renault appears, and Rick courteously pours him a drink. Renault rises from his seat and takes a leisurely stroll away. Over at the bar, Yvonne and the German officer place their orders, with Yvonne gesturing with her hand to indicate precisely where she wants them placed. A nearby French officer makes a remark to Yvonne, sparking an argument between them, while Strasser observes the unfolding situation closely and smiles.\n\nRenault lights a cigarette and puffs away contentedly. Carl, with a bottle in hand, approaches the table where a middle-aged German couple, the Leuchtags, is seated and sits down beside them. He produces a glass from his back pocket, and together they clink glasses and drink. Annina crosses paths with Renault in the hallway as she exits the gambling room, and she then spots Rick and approaches his table. Rick looks at her intently as Annina shakes her head solemnly. He pours himself a drink as Annina appears visibly disturbed. Rick continues to look at her closely, then stares off into space briefly before abruptly rising from his seat. Laszlo looks around the room as Rick snaps his fingers to draw the headwaiter's attention, then strides over to Sam and whispers something to him. Sam shakes his head in response as Rick departs. A waiter approaches Ilsa and Laszlo's table, while Jan sits at the roulette table with only three chips remaining, appearing bewildered by his situation. As Rick approaches, the croupier speaks to Jan, and Rick stands attentively behind him. Jan looks between Rick and the chips in his hand, and Rick and the croupier exchange significant looks. The croupier understands what Rick wants him to do and spins the wheel. Jan hesitates for a moment, then places his chips on number twenty-two. The wheel eventually stops spinning, and Carl follows the proceedings with fascination as Jan hesitates once more, then withdraws his hands. Carl continues to watch intently as the wheel spins and finally halts, prompting Jan to rise and head to the cashier. A customer voices a complaint to Carl, and meanwhile, Rick has walked over to the croupier, then allows a slight smile to cross his face before making his way toward the door."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Laszlo, with measured steps, arrives at the bustling entrance of the lively cafe precisely at the moment when Rick is making his exit. Laszlo pauses briefly, momentarily stopping to directly address Rick in a courteous and polite manner. As Rick proceeds on his way past, Laszlo stands there, watching as Rick departs, a puzzled expression etched unmistakably across his face. Meanwhile, in another part of the marketplace, at a bustling linen stall filled with vibrant colors and activity, Ilsa is deeply absorbed in carefully examining a fine tablecloth, which an enthusiastic Arab vendor is eagerly trying to convince her to purchase. At that moment, Rick discreetly approaches her from behind. Ilsa casts a brief glance in Rick's direction, deliberately deciding to turn away, maintaining her formal and polite demeanor intact as she walks into the lively cafe, leaving Rick standing there, staring after her with an expression of stunned disbelief etched on his face.\n\nSubsequently, Ilsa and Laszlo make their way to sit down with Ferrari, who then rises to his feet graciously and makes his departure, while Ilsa offers a faint, almost imperceptible, smile once more. Over at the bar, Ferrari becomes engaged in a conversation with a waiter, while Laszlo casts a thoughtful glance towards the vibrant bazaar. Ferrari, with a shrewd expression, looks at Ilsa, and there is a brief, significant pause as the weight of the situation settles upon her, causing Ilsa's expression to darken, while Laszlo quietly observes the unfolding scene. With a courteous bow, Ferrari acknowledges them before making his departure. Later, a cunning European individual slyly picks a pocket and then dashes off at a rapid pace, causing the unsuspecting tourist to laugh at the sheer absurdity of the incident. The European individual collides unexpectedly with Carl, who then continues on his way without missing a beat. As Rick lights up a cigarette, Renault appears on the scene, and Rick courteously pours him a drink. Renault rises from his seat, taking a leisurely stroll away. At the bar, Yvonne and the German officer proceed to place their orders, with Yvonne using her hand to indicate precisely where she wants them placed. A nearby French officer makes a remark to Yvonne, sparking a heated argument between them, while Strasser, standing by, observes the unfolding situation with keen interest and smiles subtly.\n\nRenault lights a cigarette and puffs away contentedly, enjoying the moment. Carl, with a bottle expertly held in his hand, approaches the table where a middle-aged German couple, the Leuchtags, is seated comfortably, and he sits down beside them. He casually produces a glass from his back pocket, and together, they clink glasses and enjoy their drinks, savoring the camaraderie. Annina crosses paths with Renault in the hallway as she exits the bustling gambling room, and she then spots Rick, moving with determination to approach his table. Rick looks at her intently, as Annina shakes her head with a solemn expression. He pours himself a drink while Annina appears visibly disturbed, the weight of her emotions apparent. Rick continues to look at her closely, then momentarily stares off into space before abruptly rising from his seat. Laszlo takes in the room as Rick snaps his fingers to capture the headwaiter's attention, then strides with purpose over to Sam and whispers something discreetly to him. Sam, however, shakes his head in response as Rick departs. A waiter approaches Ilsa and Laszlo's table, attentive to their needs, while Jan sits at the roulette table with only three chips remaining, appearing bewildered by his precarious situation. As Rick approaches, the croupier speaks to Jan, while Rick stands attentively behind him, observing intently. Jan looks nervously between Rick and the chips in his hand, while Rick and the croupier exchange significant, meaningful looks. The croupier, understanding what Rick wants him to do, spins the wheel. Jan hesitates slightly, then places his chips on the number twenty-two. The wheel spins, and Carl follows the proceedings with growing fascination as Jan hesitates once more, then ultimately withdraws his hands. Carl continues to watch intently as the wheel spins and finally comes to a halt, prompting Jan to rise from his seat and head to the cashier's window. A customer voices a complaint to Carl, and meanwhile, Rick has walked over to the croupier, allowing a slight, satisfied smile to cross his face before purposefully making his way toward the door, ready to move on."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Laszlo reaches the entrance of the café just as Rick is making his way out, prompting Laszlo to come to a brief halt and address Rick with a respectful greeting. As Rick exits the café, Laszlo watches him leave, a look of confusion evident on his face. Nearby, at the linen stall, Ilsa inspects a tablecloth while an eager Arab vendor attempts to persuade her to buy it. Rick approaches Ilsa from behind, and as she senses his presence, she steals a quick glance at him before deliberately turning away. She adopts a demeanor of polite formality and walks toward the café, leaving Rick standing there, staring after her in a state of stunned disbelief. Inside the café, Ilsa and Laszlo take their seats with Ferrari, who soon rises and departs, prompting Ilsa to offer a faint, repeated smile. At the bar, Ferrari engages a waiter in conversation while Laszlo casts a thoughtful glance toward the bustling bazaar. Observing Ilsa, Ferrari directs a shrewd gaze in her direction, allowing a moment of silence to linger as the realization sinks in and the expression on Ilsa's face darkens, all under Laszlo's quiet watch. In a graceful gesture, Ferrari bows to them. Later on, in another part of the scene, a European tourist deftly picks another tourist's pocket, eliciting unexpected laughter from the victim. The pickpocket hastily makes his escape, only to collide with Carl, who then proceeds to move on from the encounter. Meanwhile, Rick, with a cigarette in hand, lights it and soon after is joined by Renault. In a casual manner, Rick pours Renault a drink before Renault stands up and leisurely strolls away. Simultaneously, at the bar, Yvonne and a German officer make their drink orders known, with Yvonne utilizing hand gestures to indicate her preferences. A French officer makes an offhand remark to Yvonne, which escalates into a confrontation, noticed by Strasser, who observes the unfolding altercation with a close eye and a subtle smile. Renault, unfazed, lights a cigarette and indulges in a puff. Carl, carrying a bottle, makes his way to the table of a middle-aged German couple, the Leuchtags, and sits down with them. From his back pocket, he retrieves a glass, and they clink glasses together before taking a drink. Annina exits the gambling room and encounters Renault in the hallway. She spots Rick and approaches his table, meeting his gaze as she shakes her head in distress. Rick, absorbing her demeanor, pours himself another drink, watching Annina's apparent agitation. He studies her intently, takes a moment to ponder, and then abruptly rises from his seat. Laszlo, seated nearby, glances around as Rick snaps his fingers to summon the headwaiter and strides over to Sam, whispering something into his ear. Sam responds with a shake of his head as Rick turns and departs. A waiter appears at the table where Ilsa and Laszlo are seated, offering his service, while at the roulette table, Jan is left with only three chips and appears bewildered. Rick approaches as the croupier addresses Jan, and Rick stands behind him, offering silent support. Jan looks at Rick and then down at the chips in his hand, contemplating his next move. Rick and the croupier exchange knowing glances, and the croupier comprehends Rick's silent request, spinning the wheel. Jan hesitates before placing his remaining chips on twenty-two, watching intently. As the wheel slows to a stop, Carl, following the events closely, observes Jan's hesitation, which finally leads to the cautious withdrawal of his hands. Carl remains absorbed in the spectacle as the wheel comes to a definitive halt. Jan rises from the table and moves toward the cashier, his gamble concluded. Meanwhile, Carl is approached by a customer voicing a complaint, as Rick, having walked over to the croupier, offers a slight, knowing smile before turning and making his way toward the door."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Laszlo encounters Rick exiting the cafe, addresses him politely, and watches him leave with a puzzled expression. At the linen stall, Ilsa examines a tablecloth as an Arab vendor tries to sell it; Rick approaches, and she briefly glances at him before entering the cafe, leaving Rick in stunned disbelief. Ilsa and Laszlo join Ferrari, who later gets up and walks away while Ilsa offers a faint smile. At the bar, Ferrari converses with a waiter, glancing shrewdly at Ilsa, while Laszlo quietly observes. Ferrari bows to them. A European pickpockets a tourist, who laughs as the thief dashes off, colliding with Carl, who departs. Rick lights a cigarette as Renault arrives, prompting Rick to pour him a drink before Renault strolls away. At the bar, Yvonne and a German officer place orders, and Yvonne communicates her preferences with a gesture. A French officer makes a remark, leading to a fight, observed closely by Strasser, who smiles. Renault lights a cigarette. Carl approaches the Leuchtags' table, sits, and shares a drink with them. Annina exits the gambling room and meets Renault in the hallway, then approaches Rick's table, visibly disturbed. Rick pours himself a drink, looks closely at Annina, and rises abruptly. Laszlo glances around as Rick signals the headwaiter and whispers to Sam, who shakes his head. Rick leaves, and a waiter approaches Ilsa and Laszlo's table. Meanwhile, Jan, confused, sits at the roulette table with three chips. As Rick arrives, he exchanges looks with the croupier, who understands and spins the wheel. Jan hesitates but places his chips on twenty-two. The wheel stops, Carl observes as events unfold, and Jan rises to go to the cashier. Rick approaches the croupier, smiles slightly, and heads toward the door."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Laszlo reaches the entrance to the cafe, a popular gathering spot in Casablanca known for its lively atmosphere, as Rick, the enigmatic owner of Rick's Café Américain, comes out, and he stops to address Rick politely. As he exits, Laszlo, a resistance leader sought by the Nazis, looks after him with a puzzled expression. At the linen stall, a colorful market corner in the bustling bazaar, Ilsa examines a tablecloth which an Arab vendor, skilled in the trade of fine textiles, is endeavoring to sell, and Rick walks up behind her. She looks briefly at Rick, a man from her past in Paris, then turns away, maintaining a politely formal manner, and walks away into the cafe as Rick stares after her in stunned disbelief. Ilsa and Laszlo then sit with Ferrari, a shrewd local figure who runs the black market in Casablanca, who gets to his feet and walks away while Ilsa smiles faintly and again. At the bar, Ferrari talks to a waiter, a young man eager for extra tips during the busy hours, as Laszlo glances in the direction of the bazaar, filled with the sounds and sights of vendors and shoppers. Ferrari looks shrewdly at Ilsa, recognizing her presence as significant, while there's a moment's pause as this sinks in, and Ilsa's face darkens as Laszlo quietly observes. Ferrari bows to them, an emblematic gesture of respect common in the market. Later, a European pickpocket, taking advantage of the crowded streets, picks a tourist's pocket, and the tourist, unexpectedly amused by the audacity, laughs. The European dashes off and collides with Carl, a cordial employee at Rick's Café Américain, who then leaves. As Rick lights a cigarette, a habit cultivated through years of stress, Renault, the self-interested Vichy officer, shows up, and Rick pours a drink for him. Renault gets up and strolls away, ever the opportunist in the complexities of war. At the bar, Yvonne, a frequent visitor nursing heartbreak, and the German officer place their orders, and she indicates with her hand where she wants them. A French officer makes a remark to Yvonne, sparking old tensions, and they begin to fight, as Strasser, a high-ranking Nazi officer, eyes him closely and smiles. Renault lights a cigarette and puffs away, finding solace in the smoke. Carl, bottle in hand, approaches the table of a middle-aged German couple, the Leuchtags, who are traveling through Casablanca, and sits down. He produces a glass from a back pocket, a practiced move for these gatherings, and they clink glasses and drink, sharing a moment of camaraderie in uncertain times. Annina meets Renault in the hallway, nervously leaving the gambling room where fortunes change rapidly, and then she sees Rick and goes to his table. Rick looks at her as Annina, troubled by her situation, shakes her head. He pours himself a drink as Annina appears very disturbed, contemplating her limited options. Rick looks at her closely, stares off into space, and abruptly rises, making a decision. Laszlo looks around as Rick snaps his fingers for the headwaiter, then walks over to Sam, the beloved pianist at the café, and whispers something to him. Sam shakes his head, understanding the depth of the request, as Rick leaves. A waiter appears at Ilsa and Laszlo's table while Jan, a hopeful gambler at the roulette table with only three chips left, seems bewildered. As Rick comes up, the croupier, adept at reading the unspoken cues in the room, speaks to Jan, and Rick stands behind him, a silent supporter. Jan looks at Rick and then at the chips in his hand, caught between hope and despair. Rick and the croupier exchange looks, a silent understanding, and the croupier understands what Rick wants him to do and spins the wheel. Jan pauses, then puts the chips on twenty-two, a longshot. The wheel stops spinning, and Carl follows the proceedings, fascinated by the unfolding drama, as Jan hesitates, then withdraws his hands, resigned to fate. Carl continues to watch as the wheel spins and stops, and Jan rises to go to the cashier, fate finally smiling on him. A customer complains to Carl, irritated by the turn of events, and meanwhile, Rick has walked over to the croupier, then smiles slightly, a hint of satisfaction, and goes toward the door, his mind already on future challenges."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "A French officer makes a remark to Yvonne and they begin to fight as Strasser eyes him closely and smiles Laszlo reaches the entrance to the cafe as Rick comes out and he stops to address Rick politely Later a European picks a tourist's pocket and the tourist laughs As he exits Laszlo looks after him with a puzzled expression At the linen stall Ilsa examines a tablecloth which an Arab vendor is endeavoring to sell and Rick walks up behind her She looks briefly at Rick then turns away maintaining a politely formal manner and walks away into the cafe as Rick stares after her in stunned disbelief Ilsa and Laszlo then sit with Ferrari who gets to his feet and walks away while Ilsa smiles faintly and again Rick looks at her closely stares off into space and abruptly rises At the bar Ferrari talks to a waiter as Laszlo glances in the direction of the bazaar Ferrari looks shrewdly at Ilsa while there is a moment's pause as this sinks in and Ilsa's face darkens as Laszlo quietly observes As he exits Laszlo looks after him with a puzzled expression Ferrari bows to them Later a European picks a tourist's pocket and the tourist laughs The European dashes off and collides with Carl who then leaves Jan looks at Rick and then at the chips in his hand As Rick lights a cigarette Renault shows up and Rick pours a drink for him Laszlo looks around as Rick snaps his fingers for the headwaiter then walks over to Sam and whispers something to him Renault gets up and strolls away She looks briefly at Rick then turns away maintaining a politely formal manner and walks away into the cafe as Rick stares after her in stunned disbelief Rick looks at her as Annina shakes her head Laszlo reaches the entrance to the cafe as Rick comes out and he stops to address Rick politely At the bar Yvonne and the German officer place their orders and she indicates with her hand where she wants them A French officer makes a remark to Yvonne and they begin to fight as Strasser eyes him closely and smiles Renault lights a cigarette and puffs away Carl bottle in hand approaches the table of a middleaged German couple the Leuchtags and sits down He produces a glass from a back pocket and they clink glasses and drink Annina meets Renault in the hallway as she leaves the gambling room and then she sees Rick and goes to his table Rick looks at her as Annina shakes her head He pours himself a drink as Annina appears very disturbed Rick looks at her closely stares off into space and abruptly rises Carl continues to watch as the wheel spins and stops and Jan rises to go to the cashier Annina meets Renault in the hallway as she leaves the gambling room and then she sees Rick and goes to his table Laszlo looks around as Rick snaps his fingers for the headwaiter then walks over to Sam and whispers something to him Sam shakes his head as Rick leaves A waiter appears at Ilsa and Laszlo's table while Jan sits at the roulette table with only three chips left and seems bewildered As Rick comes up the croupier speaks to Jan and Rick stands behind him Jan looks at Rick and then at the chips in his hand Rick and the croupier exchange looks and the croupier understands what Rick wants him to do and spins the wheel Jan pauses then puts the chips on twentytwo The wheel stops spinning and Carl follows the proceedings fascinated as Jan hesitates then withdraws his hands At the linen stall Ilsa examines a tablecloth which an Arab vendor is endeavoring to sell and Rick walks up behind her Ilsa and Laszlo then sit with Ferrari who gets to his feet and walks away while Ilsa smiles faintly and again A waiter appears at Ilsa and Laszlo's table while Jan sits at the roulette table with only three chips left and seems bewildered Carl continues to watch as the wheel spins and stops and Jan rises to go to the cashier The wheel stops spinning and Carl follows the proceedings fascinated as Jan hesitates then withdraws his hands Ferrari bows to them A customer complains to Carl and meanwhile Rick has walked over to the croupier then smiles slightly and goes toward the door"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Laszlo reaches the entrance to the cafe as Rick comes out and he stops to address Rick politely. As he exits Laszlo looks after him with a puzzled expression. At the linen stall Ilsa examines a tablecloth which an Arab vendor is endeavoring to sell and Rick walks up behind her. She looks briefly at Rick then turns away maintaining a politely formal manner and walks away into the cafe as Rick stares after her in stunned disbelief. Ilsa and Laszlo then sit with Ferrari who gets to his feet and walks away while Ilsa smiles faintly and again. At the bar Ferrari talks to a waiter as Laszlo glances in the direction of the bazaar. Ferrari looks shrewdly at Ilsa while there is a moment's pause as this sinks in and Ilsa's face darkens as Laszlo quietly observes. Ferrari bows to them. Later a European picks a tourist's pocket and the tourist laughs. The European dashes off and collides with Carl who then leaves. As Rick lights a cigarette Renault shows up and Rick pours a drink for him. Renault gets up and strolls away. At the bar Yvonne and the German officer place their orders and she indicates with her hand where she wants them. A French officer makes a remark to Yvonne and they begin to fight as Strasser eyes him closely and smiles. Renault lights a cigarette and puffs away. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. Carl bottle in hand approaches the table of a middleaged German couple the Leuchtags and sits down. He produces a glass from a back pocket and they clink glasses and drink. Annina meets Renault in the hallway as she leaves the gambling room and then she sees Rick and goes to his table. Rick looks at her as Annina shakes her head. He pours himself a drink as Annina appears very disturbed. Rick looks at her closely stares off into space and abruptly rises. Laszlo looks around as Rick snaps his fingers for the headwaiter then walks over to Sam and whispers something to him. Sam shakes his head as Rick leaves. A waiter appears at Ilsa and Laszlo's table while Jan sits at the roulette table with only three chips left and seems bewildered. As Rick comes up the croupier speaks to Jan and Rick stands behind him. Jan looks at Rick and then at the chips in his hand. Rick and the croupier exchange looks and the croupier understands what Rick wants him to do and spins the wheel. Jan pauses then puts the chips on twentytwo. The wheel stops spinning and Carl follows the proceedings fascinated as Jan hesitates then withdraws his hands. Carl continues to watch as the wheel spins and stops and Jan rises to go to the cashier. A customer complains to Carl and meanwhile Rick has walked over to the croupier then smiles slightly and goes toward the door."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Laszlo reaches the entrance to the cafe as Rick comes out and he stops to address Rick politely. As he exits Laszlo looks after him with a puzzled expression. At the linen stall Ilsa examines a tablecloth which an Arab vendor is endeavoring to sell and Rick walks up behind her. She looks briefly at Rick then turns away maintaining a politely formal manner and walks away into the cafe as Rick stares after her in stunned disbelief. Ilsa and Laszlo then sit with Ferrari who gets to his feet and walks away while Ilsa smiles faintly and again. At the bar Ferrari talks to a waiter as Laszlo glances in the direction of the bazaar. Ferrari looks shrewdly at Ilsa while there is a moment's pause as this sinks in and Ilsa's face darkens as Laszlo quietly observes. Ferrari bows to them. Later a European picks a tourist's pocket and the tourist laughs. The European dashes off and collides with Carl who then leaves. As Rick lights a cigarette Renault shows up and Rick pours a drink for him. Renault gets up and strolls away. At the bar Yvonne and the German officer place their orders and she indicates with her hand where she wants them. A French officer makes a remark to Yvonne and they begin to fight as Strasser eyes him closely and smiles. Renault lights a cigarette and puffs away. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. Carl bottle in hand approaches the table of a middleaged German couple the Leuchtags and sits down. He produces a glass from a back pocket and they clink glasses and drink. Annina meets Renault in the hallway as she leaves the gambling room and then she sees Rick and goes to his table. Rick looks at her as Annina shakes her head. He pours himself a drink as Annina appears very disturbed. Rick looks at her closely stares off into space and abruptly rises. Laszlo looks around as Rick snaps his fingers for the headwaiter then walks over to Sam and whispers something to him. Sam shakes his head as Rick leaves. A waiter appears at Ilsa and Laszlo's table while Jan sits at the roulette table with only three chips left and seems bewildered. As Rick comes up the croupier speaks to Jan and Rick stands behind him. Jan looks at Rick and then at the chips in his hand. Rick and the croupier exchange looks and the croupier understands what Rick wants him to do and spins the wheel. Jan pauses then puts the chips on twentytwo. The wheel stops spinning and Carl follows the proceedings fascinated as Jan hesitates then withdraws his hands. Carl continues to watch as the wheel spins and stops and Jan rises to go to the cashier. A customer complains to Carl and meanwhile Rick has walked over to the croupier then smiles slightly and goes toward the door."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Laszlo reaches the entrance to the cafe as Rick comes out and he stops to address Rick politely. As he exits Laszlo looks after him with a puzzled expression. At the linen stall Ilsa examines a tablecloth which an Arab vendor is endeavoring to sell and Rick walks up behind her. She looks briefly at Rick then turns away maintaining a politely formal manner and walks away into the cafe as Rick stares after her in stunned disbelief. Ilsa and Laszlo then sit with Ferrari who gets to his feet and walks away while Ilsa smiles faintly and again. At the bar Ferrari talks to a waiter as Laszlo glances in the direction of the bazaar. Ferrari looks shrewdly at Ilsa while there is a moment's pause as this sinks in and Ilsa's face darkens as Laszlo quietly observes. Ferrari bows to them. A waiter appears at Ilsa and Laszlo's table while Jan sits at the roulette table with only three chips left and seems bewildered. As Rick comes up the croupier speaks to Jan and Rick stands behind him. Jan looks at Rick and then at the chips in his hand. Rick and the croupier exchange looks and the croupier understands what Rick wants him to do and spins the wheel. Jan pauses then puts the chips on twentytwo. The wheel stops spinning and Carl follows the proceedings fascinated as Jan hesitates then withdraws his hands. Carl continues to watch as the wheel spins and stops and Jan rises to go to the cashier. A customer complains to Carl and meanwhile Rick has walked over to the croupier then smiles slightly and goes toward the door."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Laszlo reaches the entrance to the cafe as Rick comes out and he stops to address Rick politely. As he exits Laszlo looks after him with a puzzled expression. At the linen stall Ilsa examines a tablecloth which an Arab vendor is endeavoring to sell and Rick walks up behind her. Jan pauses then puts the chips on twentytwo. The wheel stops spinning and Carl follows the proceedings fascinated as Jan hesitates then withdraws his hands. Carl continues to watch as the wheel spins and stops and Jan rises to go to the cashier. A customer complains to Carl and meanwhile Rick has walked over to the croupier then smiles slightly and goes toward the door."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Gwendolyn reaches the entrance to the cafe as Fiona comes out, and she stops to address Fiona politely. As she exits, Gwendolyn looks after her with a puzzled expression. At the linen stall, Bert examines a tablecloth which a penguin vendor is endeavoring to sell, and Fiona walks up behind him. He looks briefly at Fiona, then turns away, maintaining a politely formal manner, and walks away into the cafe as Fiona stares after him in stunned disbelief. Bert and Gwendolyn then sit with Jonathan, who gets to his feet and walks away while Bert smiles faintly and again. At the bar, Jonathan talks to a waiter as Gwendolyn glances in the direction of the bazaar. Jonathan looks shrewdly at Bert while there's a moment's pause as this sinks in, and Bert's face darkens as Gwendolyn quietly observes. Jonathan bows to them. Later, a kangaroo picks a tourist's pocket, and the tourist laughs. The kangaroo dashes off and collides with Hector, who then leaves. As Fiona lights a cigarette, Marcus shows up, and Fiona pours a drink for him. Marcus gets up and strolls away. At the bar, Olivia and the Italian officer place their orders, and she indicates with her hand where she wants them. A Greek officer makes a remark to Olivia, and they begin to fight, as Tara eyes him closely and smiles. Marcus lights a cigarette and puffs away. Hector, bottle in hand, approaches the table of a middle-aged Italian couple, the Leuchtags, and sits down. He produces a glass from a back pocket, and they clink glasses and drink. Pauline meets Marcus in the hallway as she leaves the gambling room, and then she sees Fiona and goes to her table. Fiona looks at her as Pauline shakes her head. She pours herself a drink as Pauline appears very disturbed. Fiona looks at her closely, stares off into space, and abruptly rises. Gwendolyn looks around as Fiona snaps her fingers for the headwaiter, then walks over to Gary and whispers something to him. Gary shakes his head as Fiona leaves. A waiter appears at Bert and Gwendolyn's table while Peter sits at the roulette table with only three chips left and seems bewildered. As Fiona comes up, the croupier speaks to Peter, and Fiona stands behind him. Peter looks at Fiona and then at the chips in his hand. Fiona and the croupier exchange looks, and the croupier understands what Fiona wants him to do and spins the wheel. Peter pauses, then puts the chips on twenty-two. The wheel stops spinning, and Hector follows the proceedings, fascinated, as Peter hesitates, then withdraws his hands. Hector continues to watch as the wheel spins and stops, and Peter rises to go to the cashier. A customer complains to Hector, and meanwhile, Fiona has walked over to the croupier, then smiles slightly and goes toward the door."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Laszlo reaches the entrance to the bakery as Rick comes out, and he stops to address Rick politely. As he exits, Laszlo looks after him with a puzzled expression. At the antique stall, Ilsa examines a lamp which a Moroccan vendor is endeavoring to sell, and Rick walks up behind her. She looks briefly at Rick, then turns away, maintaining a politely formal manner, and walks away into the bakery as Rick stares after her in stunned disbelief. Ilsa and Laszlo then sit with Ferrari, who gets to his feet and walks away while Ilsa smiles faintly and again. At the lounge, Ferrari talks to a gardener as Laszlo glances in the direction of the gallery. Ferrari looks shrewdly at Ilsa while there's a moment's pause as this sinks in, and Ilsa's face darkens as Laszlo quietly observes. Ferrari bows to them. Later, a Scandinavian picks a traveler's wallet, and the traveler laughs. The Scandinavian dashes off and collides with Carl, who then leaves. As Rick lights a cigar, Renault shows up, and Rick pours a tea for him. Renault gets up and strolls away. At the lounge, Yvonne and the Russian officer place their orders, and she indicates with her hand where she wants them. A British officer makes a remark to Yvonne, and they begin to argue, as Strasser eyes him closely and smiles. Renault lights a cigar and puffs away. Carl, book in hand, approaches the table of a middle-aged Italian couple, the Leuchtags, and sits down. He produces a cup from a back pocket, and they clink cups and drink. Annina meets Renault in the corridor as she leaves the reading room, and then she sees Rick and goes to his table. Rick looks at her as Annina shakes her head. He pours himself a tea as Annina appears very disturbed. Rick looks at her closely, stares off into space, and abruptly rises. Laszlo looks around as Rick snaps his fingers for the maitre d', then walks over to Sam and whispers something to him. Sam shakes his head as Rick leaves. A gardener appears at Ilsa and Laszlo's table while Jan sits at the poker table with only three cards left and seems bewildered. As Rick comes up, the dealer speaks to Jan, and Rick stands behind him. Jan looks at Rick and then at the cards in his hand. Rick and the dealer exchange looks, and the dealer understands what Rick wants him to do and deals the cards. Jan pauses, then puts the cards on the table. The cards stop moving, and Carl follows the proceedings, fascinated, as Jan hesitates, then withdraws his hands. Carl continues to watch as the cards are revealed, and Jan rises to go to the cashier. A customer complains to Carl, and meanwhile, Rick has walked over to the dealer, then smiles slightly and goes toward the exit."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Laszlo arrives at the entrance to the cafe as Rick emerges, and he pauses to greet Rick politely. As he departs, Laszlo gazes after him with a confused expression. At the linen stall, Ilsa inspects a tablecloth which an Arab vendor is trying to gift, and Rick approaches her from behind. She glances briefly at Rick, then diverts her gaze, retaining a politely formal demeanor, and struts into the cafe as Rick gapes at her in stunned disbelief. Ilsa and Laszlo then confer with Ferrari, who rises and retreats while Ilsa chuckles softly and repeatedly. At the bar, Ferrari converses with a waiter as Laszlo peers toward the bazaar. Ferrari scrutinizes Ilsa while there's a moment's pause as this registers, and Ilsa's face clouds as Laszlo silently contemplates. Ferrari nods to them. Later, a European returns a tourist's wallet, and the tourist giggles. The European skips off and bumps into Carl, who then departs. As Rick ignites a cigarette, Renault arrives, and Rick fetches a drink for him. Renault stands up and meanders away. At the bar, Yvonne and the German officer make their selections, and she gestures with her hand where she prefers them. A French officer comments to Yvonne, and they start to bicker, as Strasser observes him keenly and grins. Renault ignites a cigarette and inhales deeply. Carl, bottle in hand, approaches the table of a middle-aged German couple, the Leuchtags, and settles down. He retrieves a glass from a back pocket, and they clink glasses and sip. Annina encounters Renault in the hallway as she exits the gambling room, and then she notices Rick and proceeds to his table. Rick glances at her as Annina nods. He serves himself a drink as Annina looks very worried. Rick observes her intently, gazes off into space, and suddenly gets up. Laszlo scans the room as Rick clicks his fingers for the headwaiter, then strides over to Sam and murmurs something to him. Sam shakes his head as Rick departs. A waiter materializes at Ilsa and Laszlo's table while Jan sits at the roulette table with only three chips left and appears confused. As Rick approaches, the croupier addresses Jan, and Rick stands beside him. Jan glances at Rick and then at the chips in his hand. Rick and the croupier exchange glances, and the croupier discerns what Rick wants him to do and lets the wheel spin. Jan hesitates, then places the chips on twenty-two. The wheel ceases spinning, and Carl watches the proceedings, intrigued, as Jan wavers, then retracts his hands. Carl continues watching as the wheel spins and halts, and Jan stands to proceed to the cashier. A customer praises Carl, and meanwhile, Rick has wandered over to the croupier, then smiles slightly and heads toward the door."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Max reaches the entrance to the bookstore as Tom comes out, and he stops to address Tom politely. As he exits, Max looks after him with a puzzled expression. At the pastry stall, Emma examines a pie which a Greek vendor is endeavoring to sell, and Tom walks up behind her. She looks briefly at Tom, then turns away, maintaining a politely formal manner, and walks away into the bookstore as Tom stares after her in stunned disbelief. Emma and Max then sit with Lucas, who gets to his feet and walks away while Emma smiles faintly and again. At the podium, Lucas talks to a caterer as Max glances in the direction of the fairground. Lucas looks shrewdly at Emma while there's a moment's pause as this sinks in, and Emma's face darkens as Max quietly observes. Lucas bows to them. Later, an Australian picks a photographer's pocket, and the photographer laughs. The Australian dashes off and collides with George, who then leaves. As Tom lights a lantern, Murphy shows up, and Tom pours a glass for him. Murphy gets up and strolls away. At the podium, Sophia and the Italian chef place their orders, and she indicates with her hand where she wants them. A Spanish cook makes a remark to Sophia, and they begin to fight, as Hans eyes him closely and smiles. Murphy lights a lantern and puffs away. George, plate in hand, approaches the table of a middle-aged Italian couple, the Escolas, and sits down. He produces a spoon from a back pocket, and they clink spoons and eat. Clara meets Murphy in the hallway as she leaves the reading room, and then she sees Tom and goes to his table. Tom looks at her as Clara shakes her head. He pours himself a glass as Clara appears very disturbed. Tom looks at her closely, stares off into space, and abruptly rises. Max looks around as Tom snaps his fingers for the head caterer, then walks over to Joe and whispers something to him. Joe shakes his head as Tom leaves. A caterer appears at Emma and Max's table while Greg sits at the bingo table with only three markers left and seems bewildered. As Tom comes up, the announcer speaks to Greg, and Tom stands behind him. Greg looks at Tom and then at the markers in his hand. Tom and the announcer exchange looks, and the announcer understands what Tom wants him to do and calls out the numbers. Greg pauses, then puts the markers on twenty-two. The numbers stop being called, and George follows the proceedings, fascinated, as Greg hesitates, then withdraws his hands. George continues to watch as the numbers are called and stopped, and Greg rises to go to the cashier. A guest complains to George, and meanwhile, Tom has walked over to the announcer, then smiles slightly and goes toward the door."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Orlando approaches the entrance to the museum as Marcus steps out, and he pauses to gesture at Marcus casually. As he departs, Orlando watches after him with a serene expression. At the fruit stall, Julia inspects an apple which a Greek merchant is attempting to present, and Marcus sidles up behind her. She glances briefly at Marcus, then shifts away, maintaining a casually formal demeanor, and drifts into the museum as Marcus gazes after her in muted curiosity. Julia and Orlando then stand with Giovanni, who rises from his seat and meanders away while Julia grins faintly and again. At the market, Giovanni chats with a chef as Orlando peers in the direction of the boulevard. Giovanni peers curiously at Julia while there's a moment's hesitation as this registers, and Julia's face pales as Orlando quietly notes. Giovanni nods to them. Later, an Australian drops a stranger’s wallet, and the stranger chuckles. The Australian leaps off and bumps into Henry, who then ambles away. As Marcus sips a soda, Hector arrives, and Marcus mixes a cocktail for him. Hector stands up and wanders away. At the market, Lily and the Italian captain make their requests, and she gestures with her finger where she prefers them. A Spanish officer makes a comment to Lily, and they start to argue, as Klaus scrutinizes him carefully and grins. Hector puffs a pipe and inhales deeply. Henry, tray in hand, moves toward the booth of a young Swedish pair, the Bergs, and perches down. He retrieves a tray from a jacket pocket, and they tap trays and sip. Ingrid meets Hector in the corridor as she exits the betting lounge, and then she spots Marcus and heads to his booth. Marcus watches her as Ingrid nods her head. He mixes himself a cocktail as Ingrid appears visibly upset. Marcus observes her carefully, gazes into the distance, and suddenly stands. Orlando glances around as Marcus claps his hands for the usher, then strides over to Jake and murmurs something to him. Jake nods as Marcus departs. A chef approaches Julia and Orlando's booth while Peter rests at the poker table with only two cards remaining and seems mystified. As Marcus approaches, the dealer addresses Peter, and Marcus stations himself beside him. Peter glances at Marcus and then at the cards in his hand. Marcus and the dealer swap glances, and the dealer grasps what Marcus expects him to do and shuffles the deck. Peter hesitates, then places the cards on thirteen. The deck stops shuffling, and Henry observes the proceedings, intrigued, as Peter falters, then retracts his hand. Henry keeps watching as the deck shuffles and stops, and Peter gets up to approach the banker. A customer protests to Henry, and meanwhile, Marcus has strolled over to the dealer, then smirks slightly and heads toward the exit."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Laszlo arrives at the threshold of the bakery as Rick steps out, and he pauses to gesture at Rick warmly. As he departs, Laszlo gazes in his direction with a bewildered expression. At the fruit stand, Ilsa inspects a basket which an Arab vendor is attempting to auction, and Rick sneaks up behind her. She glances fleetingly at Rick, then turns aside, keeping a courteously distant demeanor, and wanders into the bakery as Rick watches after her in astonished perplexity. Ilsa and Laszlo then perch alongside Ferrari, who rises to his toes and drifts away while Ilsa chuckles mildly once more. At the lounge, Ferrari confers with a chef as Laszlo peeks toward the arcade. Ferrari gazes cunningly at Ilsa while there's a moment of silence as this occurs, and Ilsa's expression clouds as Laszlo quietly notes. Ferrari bows to them. Later, a European swipes a local's backpack, and the local chuckles. The European sprints off and crashes into Carl, who then saunters away. As Rick ignites a lantern, Renault appears, and Rick serves a snack to him. Renault stands up and rambles away. At the lounge, Yvonne and the German officer make their selections, and she gestures with her foot where she wants them. A French officer offers a comment to Yvonne, and they begin to converse, as Strasser gazes at him closely and grins. Renault ignites a lantern and exhales. Carl, pitcher in hand, approaches the bench of a middle-aged German couple, the Leuchtags, and settles down. He reveals a mug from a side pocket, and they tap mugs and sip. Annina encounters Renault in the corridor as she exits the bingo hall, and then she spots Rick and approaches his bench. Rick peers at her as Annina nods. He serves himself a snack as Annina looks very perturbed. Rick observes her intently, gazes at the distance, and suddenly stands. Laszlo surveys the vicinity as Rick beckons the headwaiter with a wave, then strides over to Sam and murmurs something to him. Sam shakes his head as Rick departs. A server materializes at Ilsa and Laszlo's bench while Jan rests at the poker table with only three cards remaining and seems confused. As Rick approaches, the dealer speaks to Jan, and Rick stands behind him. Jan glances at Rick and then at the cards in his hand. Rick and the dealer swap glances, and the dealer understands what Rick wants him to do and shuffles the deck. Jan pauses, then places the cards on the table. The deck stops shuffling, and Carl follows the activity, intrigued, as Jan hesitates, then retracts his hands. Carl continues to observe as the deck is shuffled and halted, and Jan rises to go to the box office. A visitor complains to Carl, and meanwhile, Rick has walked over to the dealer, then grins slightly and moves toward the exit."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Mortimer ambles to the library's exit as Harold strolls in, and he pauses to greet Harold sarcastically. As he departs, Mortimer observes him with an amused smirk. At the fabric booth, Nancy inspects a quilt which an Italian baker is attempting to trade, and Harold sneaks up beside her. She glances quickly at Harold, then turns around, adopting a casually dismissive stance, and wanders away into the library as Harold gapes after her in muted surprise. Nancy and Mortimer then converse with Giovanni, who rises and drifts away while Nancy chuckles softly and once more. At the lounge, Giovanni consults with a chef as Mortimer peers towards the marketplace. Giovanni peers keenly at Nancy while there's a brief lull as this registers, and Nancy's expression hardens as Mortimer silently watches. Giovanni nods to them. Later, an Australian borrows a traveler's bag, and the traveler giggles. The Australian skips away and bumps into Jasper, who then vanishes. As Harold ignites a lantern, Lafayette arrives, and Harold brews tea for him. Lafayette stands up and meanders away. At the lounge, Penelope and the Spanish general request their appetizers, and she gestures with her elbow where she prefers them. A Canadian diplomat quips to Penelope, and they begin to argue, as Schmidt observes him intently and grins. Lafayette ignites a lantern and inhales deeply. Jasper, pastry in hand, approaches the booth of a middle-aged Spanish duo, the Meierhoffs, and settles in. He extracts a mug from a front pocket, and they clink mugs and sip. Clara encounters Lafayette in the corridor as she exits the auction chamber, and then she notices Harold and approaches his booth. Harold regards her as Clara shakes her head. He pours himself tea as Clara appears very uneasy. Harold studies her intently, gazes into the distance, and swiftly stands. Mortimer scans the area as Harold clicks his heels for the supervisor, then strides over to Tim and utters a secret to him. Tim shakes his head as Harold departs. A chef arrives at Nancy and Mortimer's booth while Eric sits at the blackjack table with only three tokens remaining and seems puzzled. As Harold approaches, the dealer speaks to Eric, and Harold hovers behind him. Eric glances at Harold and then at the tokens in his grasp. Harold and the dealer exchange glances, and the dealer grasps what Harold desires him to do and spins the roulette. Eric pauses, then places the tokens on thirty-five. The roulette halts its spin, and Jasper follows the scene, bewildered, as Eric hesitates, then retracts his hands. Jasper continues to observe as the roulette spins and ceases, and Eric rises to approach the teller. A patron grumbles to Jasper, and meanwhile, Harold has sauntered to the dealer, then smirks faintly and heads toward the exit."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Laszlo reaches the cafe entrance as Rick exits, and they briefly interact. Ilsa is at a linen stall, where Rick approaches her, prompting her to walk away, leaving him stunned. Ilsa and Laszlo meet Ferrari, who speaks with Laszlo as Ilsa's demeanor darkens. A European pickpocket collides with Carl, who departs. Renault joins Rick at the bar, then leaves. Yvonne and a German officer order drinks, leading to a conflict with a French officer, watched by Strasser. Carl shares a drink with the Leuchtags. Annina, disturbed, meets Renault and then Rick, who observes her closely before abruptly leaving. At the roulette table, Rick signals the croupier to favor Jan, who hesitates before placing a bet. The wheel stops, and Jan heads to the cashier. Rick exchanges looks with the croupier and smiles as he walks to the door."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "A customer complains to Carl and meanwhile Rick has walked over to the croupier then smiles slightly and goes toward the door Carl continues to watch as the wheel spins and stops and Jan rises to go to the cashier The wheel stops spinning and Carl follows the proceedings fascinated as Jan hesitates then withdraws his hands Jan pauses then puts the chips on twentytwo Rick and the croupier exchange looks and the croupier understands what Rick wants him to do and spins the wheel Jan looks at Rick and then at the chips in his hand As Rick comes up the croupier speaks to Jan and Rick stands behind him A waiter appears at Ilsa and Laszlo's table while Jan sits at the roulette table with only three chips left and seems bewildered Sam shakes his head as Rick leaves Laszlo looks around as Rick snaps his fingers for the headwaiter then walks over to Sam and whispers something to him Rick looks at her closely stares off into space and abruptly rises He pours himself a drink as Annina appears very disturbed Rick looks at her as Annina shakes her head Annina meets Renault in the hallway as she leaves the gambling room and then she sees Rick and goes to his table He produces a glass from a back pocket and they clink glasses and drink Carl bottle in hand approaches the table of a middleaged German couple the Leuchtags and sits down Renault lights a cigarette and puffs away A French officer makes a remark to Yvonne and they begin to fight as Strasser eyes him closely and smiles At the bar Yvonne and the German officer place their orders and she indicates with her hand where she wants them Renault gets up and strolls away As Rick lights a cigarette Renault shows up and Rick pours a drink for him The European dashes off and collides with Carl who then leaves Later a European picks a tourist's pocket and the tourist laughs Ferrari bows to them Ferrari looks shrewdly at Ilsa while there is a moment's pause as this sinks in and Ilsa's face darkens as Laszlo quietly observes At the bar Ferrari talks to a waiter as Laszlo glances in the direction of the bazaar Ilsa and Laszlo then sit with Ferrari who gets to his feet and walks away while Ilsa smiles faintly and again She looks briefly at Rick then turns away maintaining a politely formal manner and walks away into the cafe as Rick stares after her in stunned disbelief At the linen stall Ilsa examines a tablecloth which an Arab vendor is endeavoring to sell and Rick walks up behind her As he exits Laszlo looks after him with a puzzled expression Laszlo reaches the entrance to the cafe as Rick comes out and he stops to address Rick politely"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "He pours himself a drink as Annina appears very disturbed Renault lights a cigarette and puffs away As Rick lights a cigarette Renault shows up and Rick pours a drink for him As Rick comes up the croupier speaks to Jan and Rick stands behind him Jan pauses then puts the chips on twentytwo Ferrari looks shrewdly at Ilsa while there is a moment's pause as this sinks in and Ilsa's face darkens as Laszlo quietly observes At the bar Ferrari talks to a waiter as Laszlo glances in the direction of the bazaar At the bar Yvonne and the German officer place their orders and she indicates with her hand where she wants them Renault gets up and strolls away Carl bottle in hand approaches the table of a middleaged German couple the Leuchtags and sits down The European dashes off and collides with Carl who then leaves Rick and the croupier exchange looks and the croupier understands what Rick wants him to do and spins the wheel A customer complains to Carl and meanwhile Rick has walked over to the croupier then smiles slightly and goes toward the door Sam shakes his head as Rick leaves He produces a glass from a back pocket and they clink glasses and drink The wheel stops spinning and Carl follows the proceedings fascinated as Jan hesitates then withdraws his hands As he exits Laszlo looks after him with a puzzled expression A French officer makes a remark to Yvonne and they begin to fight as Strasser eyes him closely and smiles Rick looks at her as Annina shakes her head At the linen stall Ilsa examines a tablecloth which an Arab vendor is endeavoring to sell and Rick walks up behind her Annina meets Renault in the hallway as she leaves the gambling room and then she sees Rick and goes to his table Laszlo looks around as Rick snaps his fingers for the headwaiter then walks over to Sam and whispers something to him Carl continues to watch as the wheel spins and stops and Jan rises to go to the cashier Ilsa and Laszlo then sit with Ferrari who gets to his feet and walks away while Ilsa smiles faintly and again Jan looks at Rick and then at the chips in his hand Ferrari bows to them Later a European picks a tourist's pocket and the tourist laughs A waiter appears at Ilsa and Laszlo's table while Jan sits at the roulette table with only three chips left and seems bewildered Laszlo reaches the entrance to the cafe as Rick comes out and he stops to address Rick politely She looks briefly at Rick then turns away maintaining a politely formal manner and walks away into the cafe as Rick stares after her in stunned disbelief Rick looks at her closely stares off into space and abruptly rises"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "He produces a glass from a back pocket and they clink glasses and drink Annina meets Renault in the hallway as she leaves the gambling room and then she sees Rick and goes to his table Rick looks at her as Annina shakes her head He pours himself a drink as Annina appears very disturbed Rick looks at her closely stares off into space and abruptly rises Laszlo looks around as Rick snaps his fingers for the headwaiter then walks over to Sam and whispers something to him Sam shakes his head as Rick leaves A waiter appears at Ilsa and Laszlo's table while Jan sits at the roulette table with only three chips left and seems bewildered As Rick comes up the croupier speaks to Jan and Rick stands behind him Jan looks at Rick and then at the chips in his hand Rick and the croupier exchange looks and the croupier understands what Rick wants him to do and spins the wheel Jan pauses then puts the chips on twentytwo The wheel stops spinning and Carl follows the proceedings fascinated as Jan hesitates then withdraws his hands Carl continues to watch as the wheel spins and stops and Jan rises to go to the cashier A customer complains to Carl and meanwhile Rick has walked over to the croupier then smiles slightly and goes toward the door Laszlo reaches the entrance to the cafe as Rick comes out and he stops to address Rick politely As he exits Laszlo looks after him with a puzzled expression At the linen stall Ilsa examines a tablecloth which an Arab vendor is endeavoring to sell and Rick walks up behind her She looks briefly at Rick then turns away maintaining a politely formal manner and walks away into the cafe as Rick stares after her in stunned disbelief Ilsa and Laszlo then sit with Ferrari who gets to his feet and walks away while Ilsa smiles faintly and again At the bar Ferrari talks to a waiter as Laszlo glances in the direction of the bazaar Ferrari looks shrewdly at Ilsa while there is a moment's pause as this sinks in and Ilsa's face darkens as Laszlo quietly observes Ferrari bows to them Later a European picks a tourist's pocket and the tourist laughs The European dashes off and collides with Carl who then leaves As Rick lights a cigarette Renault shows up and Rick pours a drink for him Renault gets up and strolls away At the bar Yvonne and the German officer place their orders and she indicates with her hand where she wants them A French officer makes a remark to Yvonne and they begin to fight as Strasser eyes him closely and smiles Renault lights a cigarette and puffs away Carl bottle in hand approaches the table of a middleaged German couple the Leuchtags and sits down"
        }
      ]
    }
  ]
}