{
  "ground_truth": "Annina runs up to him and hugs him. He looks over and sees Rick. At the bar, Carl whispers in Sacha's ear. He kisses Rick on both cheeks. Carl pours a brandy for Rick. Pretending not to do so, Rick glances in Ilsa's direction. Renault comes up to him. He smiles and walks away. Laszlo comes up to Rick. Rick gets up, as does Laszlo. Laszlo looks at him, puzzled. Rick and Laszlo hear male voices singing downstairs. Rick stands at the balcony outside his office and watches the Germans below. At the bar, Renault watches with raised eyebrow. Laszlo's lips are very tight as he listens to the song. He starts down the step. Yvonne, sitting at a table with her German officer, stares down into her drink. Laszlo speaks to the orchestra. Laszlo passes the table where Ilsa sits and goes straight to the orchestra. Members of the orchestra glance toward the steps, toward Rick, who nods to them. Laszlo and Corina sing as they start to play. Strasser conducts the German singing in an attempt to drown out the competition. After a while, Strasser and his officers give up and sit down. Yvonne jumps up and sings with tears in her eyes. Ilsa, overcome with emotion, looks proudly at Laszlo, who sings with passion. Finally the whole cafe stands, singing, their faces aglow. The song finishes on a high, triumphant note. Yvonne's face is exalted. She shouts at the top of her lungs. She deliberately faces the alcove where the Germans are watching. Several French officers surround Laszlo, offering him a drink. Renault thinks a moment, then blows a loud blast on his whistle. The room grows quiet, all eyes turn toward Renault. An angry murmur starts among the crowd. People get up and begin to leave. Rick comes quickly up to Renault. This display of nerve leaves Rick at a loss. The croupier comes out of the gambling room and up to Renault. He hands him a roll of bills. His manner is abrupt but cordial. As the cafe empties, Strasser approaches Ilsa. She looks at him, understanding what he means. He bows and exits as Laszlo arrives at the table. They start out of the cafe. Ilsa and Laszlo walk to their room. Laszlo switches on the light as they enter. While Ilsa takes off some jewelry, he walks to the window and peers out into the darkness. Below and across the street, a man stands under an arch. Laszlo watches him, then draws down the shade. He crosses to a table, takes a cigarette from a box, and strikes a match. He lights the cigarette. Ilsa is now noticeably uncomfortable. Ilsa walks over to the couch and sits down.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Annina jogs up to him and embraces him. He glances over and spots Rick. At the pub, Carl murmurs in Sacha's ear. He pecks Rick on both cheeks. Carl fills a cognac for Rick. Feigning not to do so, Rick peeks in Ilsa's direction. Renault approaches him. He grins and strolls away. Laszlo approaches Rick. Rick rises, as does Laszlo. Laszlo gazes at him, bewildered. Rick and Laszlo overhear male voices vocalizing downstairs. Rick stands at the terrace outside his workplace and observes the Germans below. At the bar, Renault observes with elevated eyebrow. Laszlo's mouth is very taut as he listens to the melody. He begins down the stairs. Yvonne, seated at a table with her German officer, gazes into her beverage. Laszlo addresses the band. Laszlo passes the table where Ilsa sits and goes directly to the band. Members of the band glance toward the stairs, toward Rick, who nods to them. Laszlo and Corina chant as they start to play. Strasser directs the German singing in an effort to drown out the rivalry. After a while, Strasser and his officers concede and sit down. Yvonne springs up and sings with tears in her eyes. Ilsa, overwhelmed with emotion, looks proudly at Laszlo, who sings with fervor. Finally, the entire cafe rises, singing, their faces aglow. The melody concludes on a high, victorious note. Yvonne's face is elated. She hollers at the top of her lungs. She deliberately faces the alcove where the Germans are observing. Several French officers encircle Laszlo, offering him a beverage. Renault considers a moment, then blows a loud blast on his whistle. The room falls silent, all eyes turn toward Renault. An irate murmur begins among the crowd. People rise and commence to leave. Rick comes swiftly up to Renault. This display of courage leaves Rick at a loss. The croupier emerges from the gaming chamber and up to Renault. He hands him a bundle of bills. His demeanor is blunt but friendly. As the cafe clears, Strasser approaches Ilsa. She regards him, understanding what he signifies. He bows and departs as Laszlo arrives at the table. They start out of the cafe. Ilsa and Laszlo stroll to their room. Laszlo switches on the light as they enter. While Ilsa removes some jewelry, he walks to the window and peers out into the darkness. Below and across the street, a man stands under an archway. Laszlo observes him, then draws down the shade. He crosses to a table, takes a cigarette from a box, and strikes a match. He lights the cigarette. Ilsa is now noticeably uneasy. Ilsa walks over to the sofa and sits down."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Annina runs up to him and is hugged by him. Rick is looked over and seen by him. At the bar, Sacha's ear is whispered into by Carl. Rick is kissed on both cheeks by him. A brandy is poured for Rick by Carl. Pretending not to do so, Ilsa’s direction is glanced in by Rick. He is approached by Renault. A smile is given by him as he walks away. Rick is approached by Laszlo. Rick gets up, as does Laszlo. He is looked at by Laszlo, puzzled. Male voices singing downstairs are heard by Rick and Laszlo. The balcony outside his office is stood at by Rick, who watches the Germans below. At the bar, a raised eyebrow is used by Renault to watch. Laszlo's lips are very tight as the song is listened to by him. The step is started down by him. Down into her drink is stared by Yvonne, sitting at a table with her German officer. The orchestra is spoken to by Laszlo. The table where Ilsa sits is passed by Laszlo, who goes straight to the orchestra. The steps and Rick, who nods to them, are glanced toward by members of the orchestra. They are started to play by Laszlo and Corina as they sing. The German singing is conducted by Strasser in an attempt to drown out the competition. After a while, sitting down is done by Strasser and his officers as they give up. Yvonne jumps up and tears are in her eyes as she sings. Overcome with emotion, Laszlo is looked at proudly by Ilsa, who sings with passion. Singing is done by the whole cafe, their faces aglow, as it stands finally. A high, triumphant note finishes the song. Yvonne's face is exalted. The top of her lungs is shouted at by her. Deliberately, the alcove where the Germans are watching is faced by her. Laszlo is surrounded by several French officers, offering him a drink. A moment is thought by Renault, then a loud blast on his whistle is blown by him. The room grows quiet and Renault is turned toward by all eyes. An angry murmur among the crowd is started. People get up and leave is begun by them. Renault is quickly approached by Rick. This display of nerve leaves him at a loss. Renault is approached by the croupier, who comes out of the gambling room. A roll of bills is handed to him. His manner is abrupt but cordial. As the cafe empties, Ilsa is approached by Strasser. Her understanding of what he means is shown by her as she looks at him. A bow is made by him and he exits as Laszlo arrives at the table. They start out of the cafe. Their room is walked to by Ilsa and Laszlo. The light is switched on by Laszlo as they enter. While some jewelry is taken off by Ilsa, the window is walked to by him and the darkness is peered out into. Below and across the street, under an arch stands a man. He is watched by Laszlo, then the shade is drawn down by him. He crosses to a table, a cigarette is taken from a box, and a match is struck by him. The cigarette is lit by him. Ilsa is now noticeably uncomfortable. The couch is walked over to by Ilsa and she sits down."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Annina runs to him and hugs him. He sees Rick. At the bar, Carl whispers to Sacha and kisses Rick on both cheeks, then pours him a brandy. Rick discreetly glances at Ilsa. Renault approaches, smiles, and leaves. Laszlo joins Rick, puzzled. They hear male voices singing downstairs. Rick watches the Germans from his office balcony. Renault observes with a raised eyebrow. Laszlo listens tightly to the song and heads downstairs. Yvonne, with her German officer, stares into her drink. Laszlo speaks to the orchestra, passing Ilsa's table. The orchestra looks to Rick, who nods. Laszlo and Corina sing as the orchestra plays. Strasser tries to drown them out but eventually gives up. Yvonne, tearful, joins in, and Ilsa proudly watches Laszlo sing passionately. The cafe stands, singing triumphantly. Yvonne shouts, facing the Germans. French officers offer Laszlo a drink. Renault blows his whistle, silencing the room. An angry murmur begins as people leave. Rick approaches Renault, surprised. The croupier hands Renault a roll of bills. As the cafe empties, Strasser approaches Ilsa, who understands his meaning. He bows and exits as Laszlo arrives. Ilsa and Laszlo leave for their room. Laszlo turns on the light, and Ilsa removes her jewelry. He peers out the window at a man under an arch, then lowers the shade. He lights a cigarette, and Ilsa sits on the couch, visibly uncomfortable."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Annina hugs him as he sees Rick. At the bar, Carl whispers to Sacha and kisses Rick's cheeks, then pours him a brandy. Rick discreetly glances at Ilsa. Renault approaches, smiles, and leaves. Laszlo joins Rick, puzzled. They hear singing downstairs. Rick watches Germans from his balcony. Renault observes with a raised eyebrow. Laszlo listens tightly, then heads to the orchestra, passing Ilsa. The orchestra looks to Rick, who nods. Laszlo and Corina sing. Strasser tries to drown them out but fails. Yvonne joins, tearfully singing. Ilsa proudly watches Laszlo. The cafe stands, singing triumphantly. Yvonne shouts, facing the Germans. French officers offer Laszlo a drink. Renault blows his whistle, silencing the room. An angry murmur starts, and people leave. Rick approaches Renault, confused. The croupier gives Renault a roll of bills. As the cafe empties, Strasser approaches Ilsa, who understands. He exits as Laszlo arrives. Ilsa and Laszlo leave for their room. Laszlo turns on the light, watches a man outside, then lowers the shade. He lights a cigarette as Ilsa, uncomfortable, sits on the couch."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Annina eagerly runs up to him and wraps her arms around him in a warm embrace. He glances over and notices Rick standing nearby. Meanwhile, at the bar, Carl leans in close and whispers something into Sacha's ear. In a friendly gesture, he kisses Rick on both cheeks. Carl then proceeds to pour a glass of brandy for Rick. While pretending not to be doing so, Rick subtly glances in the direction where Ilsa is seated. Renault approaches him with a smile, then turns and walks away. Laszlo makes his way over to Rick. As Rick rises from his seat, Laszlo does the same. Laszlo looks at Rick with a puzzled expression on his face. Both Rick and Laszlo hear the sound of male voices singing from downstairs. Rick steps out onto the balcony outside his office and observes the Germans below. At the bar, Renault watches the scene unfold with a raised eyebrow. Laszlo's lips are tightly pressed together as he listens intently to the song. He begins to descend the steps. Yvonne, who is sitting at a table with her German officer, gazes down into her drink. Laszlo approaches the orchestra and speaks to them. As he passes the table where Ilsa is seated, he heads directly to the orchestra. The members of the orchestra glance toward the steps and then toward Rick, who gives them a nod of approval. Laszlo and Corina begin to sing as the orchestra starts to play. Strasser attempts to conduct the German singing in an effort to drown out the competition. After some time, Strasser and his officers concede and sit down. Yvonne suddenly jumps up and joins in the singing, tears welling in her eyes. Overcome with emotion, Ilsa looks at Laszlo with pride as he sings passionately. Eventually, the entire cafe stands together, singing with their faces glowing with emotion. The song concludes on a high, triumphant note. Yvonne's face is filled with exaltation as she shouts at the top of her lungs. She deliberately turns to face the alcove where the Germans are watching. Several French officers gather around Laszlo, offering him a drink in celebration. Renault pauses to think for a moment, then blows a loud, piercing blast on his whistle. The room falls silent, and all eyes turn toward Renault. An angry murmur begins to ripple through the crowd. People start to rise from their seats and begin to leave. Rick quickly approaches Renault, feeling at a loss due to this bold display of nerve. The croupier emerges from the gambling room and approaches Renault, handing him a roll of bills. His manner is abrupt yet cordial. As the cafe gradually empties, Strasser approaches Ilsa. She looks at him, fully understanding the implication of his presence. He bows politely and exits just as Laszlo arrives at the table. Together, they start to leave the cafe. Ilsa and Laszlo walk back to their room. As they enter, Laszlo switches on the light. While Ilsa removes some of her jewelry, he walks over to the window and peers out into the darkness. Below and across the street, a man stands under an archway. Laszlo watches him for a moment, then lowers the shade. He crosses over to a table, takes a cigarette from a box, and strikes a match to light it. Ilsa, now noticeably uncomfortable, walks over to the couch and sits down."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "With an aura of eagerness, Annina rushes up to him, wrapping her arms around him in a heartfelt, warm embrace. His gaze shifts, and he becomes aware of Rick standing just nearby. Meanwhile, over at the bustling bar area, Carl leans in closely and whispers something discreetly into Sacha's ear. In a display of friendliness, he affectionately kisses Rick on both cheeks. Following this gesture, Carl goes on to pour a glass of brandy and offers it to Rick. All the while, under the guise of indifference, Rick subtly directs his gaze toward the area where Ilsa is seated. Renault approaches with a broad smile, only to turn and walk away promptly. Laszlo then approaches Rick with a sense of purpose. As Rick stands up from his seat, Laszlo mirrors his movements, rising as well. With a puzzled look etched across his face, Laszlo glances at Rick. Simultaneously, both Rick and Laszlo catch the sound of male voices resonating from the floor below, singing harmoniously. Rick steps out and positions himself on the balcony just outside his office, observing the German crowd gathered below. Back at the bar, Renault watches the unfolding scene with a raised eyebrow, taking in the situation. Laszlo's lips are tightly pressed together, a sign of his deep concentration as he listens intently to the rousing song. He makes his way down the steps methodically. Yvonne, seated at a table with a German officer, gazes contemplatively into her drink. Laszlo approaches the orchestra purposefully and speaks to them. As he strides past the table where Ilsa is seated, he heads directly toward the orchestra. The orchestra members, sensing Laszlo's presence, glance toward the steps and then toward Rick, who gives them a nod of approval, encouraging them. Laszlo and Corina begin to sing fervently as the orchestra starts playing in accompaniment. In an effort to counteract, Strasser attempts to conduct the German singing, trying to overwhelm the competition with volume. After some time and effort, Strasser and his officers, realizing their defeat, concede and sit down. Suddenly, Yvonne jumps up energetically and joins in the singing, her eyes brimming with tears. Overcome with emotion, Ilsa gazes at Laszlo, filled with immense pride as he sings passionately with all his heart. Eventually, the entire cafe unites, standing together, their faces glowing with emotion as they sing in unison. The song concludes on a high, triumphant note, filling the room with a sense of exaltation. Yvonne's face is lit up with exhilaration as she shouts at the top of her lungs. She deliberately turns to face the alcove where the observing Germans are seated. A group of French officers gather around Laszlo, offering him a drink in celebration of the momentous occasion. Renault pauses, pondering momentarily, then blows a loud, piercing blast on his whistle, demanding attention. Instantly, the room falls silent, with all eyes turning toward Renault. An angry murmur begins to ripple through the crowd, growing in intensity. People gradually start to rise from their seats, preparing to leave. Rick hastily approaches Renault, his mind reeling due to this bold display of nerve. The croupier makes his appearance from the shadows of the gambling room and approaches Renault, handing over a roll of bills with an abrupt yet cordial manner. As the cafe gradually empties, Strasser approaches Ilsa, and she looks at him, fully aware of the implication of his presence there. He bows politely, acknowledging her, and exits, just as Laszlo arrives at the table. Together, Ilsa and Laszlo start to leave the cafe, their footsteps echoing softly. Ilsa and Laszlo walk companionably back to their room. As they enter, Laszlo switches on the light, illuminating the room. While Ilsa methodically removes some of her jewelry, he strolls over to the window and peers out into the enveloping darkness. Below, across the street, a man stands silently under an archway. Laszlo observes him for a contemplative moment before lowering the shade. He then crosses over to a table, retrieves a cigarette from a box, and strikes a match to light it. Meanwhile, Ilsa, now noticeably uneasy, walks over to the couch and sits down, lost in thought."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Annina, filled with excitement, runs up to him with open arms and embraces him warmly. As he returns the hug, he glances over and notices Rick standing nearby. Meanwhile, at the bar, Carl leans in close to Sacha and whispers something softly into his ear. In a friendly gesture, Carl approaches Rick and greets him by kissing him on both cheeks. He then turns to the bar and carefully pours a glass of brandy for Rick, who, while trying to appear nonchalant, subtly shifts his gaze in Ilsa's direction. Renault approaches Rick with a smile, and after a brief exchange, he turns and walks away. Laszlo then approaches Rick, prompting Rick to rise from his seat, with Laszlo following suit. Laszlo looks at Rick with a puzzled expression, trying to understand the situation. As they stand there, they hear the sound of male voices singing from downstairs. Rick steps out onto the balcony outside his office, where he stands and observes the Germans singing below. At the bar, Renault watches the scene unfold with a raised eyebrow, intrigued by the unfolding events. Laszlo listens intently to the song, his lips pressed tightly together in concentration. Determined, he begins to descend the steps. Yvonne, seated at a table with her German officer companion, gazes down into her drink, lost in thought. Laszlo approaches the orchestra and speaks to them, passing by the table where Ilsa sits without stopping, heading directly to the musicians. The members of the orchestra glance toward the steps and then toward Rick, who gives them a nod of approval. With that signal, Laszlo and Corina begin to sing as the orchestra starts to play. Strasser, in an attempt to overpower their performance, conducts the German singing, but after a while, he and his officers concede defeat and sit down. Yvonne, overcome with emotion, jumps up and joins in the singing, tears glistening in her eyes. Ilsa, moved by the moment, looks at Laszlo with pride as he sings passionately. The entire cafe, caught up in the fervor, stands and sings along, their faces illuminated with a sense of triumph. The song reaches its conclusion on a high, victorious note, leaving Yvonne's face radiant with exaltation. She shouts with all her might, deliberately turning to face the alcove where the Germans are watching. Several French officers gather around Laszlo, offering him a drink in celebration. Renault, after a moment of contemplation, blows a loud blast on his whistle, causing the room to fall silent as all eyes turn toward him. An angry murmur begins to ripple through the crowd as people rise from their seats and start to leave. Rick quickly approaches Renault, feeling at a loss for words in the face of such boldness. The croupier emerges from the gambling room and approaches Renault, handing him a roll of bills with an abrupt yet cordial manner. As the cafe empties, Strasser makes his way to Ilsa, who meets his gaze with an understanding of his intentions. He bows politely and exits just as Laszlo arrives at the table. Together, Ilsa and Laszlo make their way out of the cafe and walk to their room. Upon entering, Laszlo switches on the light, illuminating the space. While Ilsa removes some of her jewelry, Laszlo walks over to the window and peers out into the darkness. Below, across the street, he notices a man standing under an arch, watching intently. Laszlo observes the man for a moment before drawing down the shade to block the view. He then crosses to a table, selects a cigarette from a box, and strikes a match to light it. As he takes a drag, Ilsa, now visibly uncomfortable, walks over to the couch and sits down, contemplating the events that have transpired."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Annina runs up to him and hugs him as he notices Rick nearby. At the bar, Carl whispers to Sacha and then greets Rick with a kiss on both cheeks before pouring him a brandy. Rick discreetly glances at Ilsa while Renault approaches, smiles, and walks away. Laszlo joins Rick, and they both stand, puzzled by the male voices singing downstairs. Rick observes the Germans from his office balcony, while Renault watches from the bar with a raised eyebrow. Laszlo listens intently to the song, his lips tight, and then heads to the orchestra, passing Ilsa's table. The orchestra members look to Rick, who nods, and Laszlo and Corina begin to sing. Strasser attempts to drown them out with German singing but eventually gives up. Yvonne, emotional, joins in with tears in her eyes, and Ilsa looks proudly at Laszlo's passionate singing. The entire cafe stands and sings triumphantly, with Yvonne exalting and facing the Germans defiantly. French officers surround Laszlo, offering drinks, as Renault blows his whistle, quieting the room and prompting an angry murmur. As people begin to leave, Rick approaches Renault, feeling at a loss. The croupier hands Renault a roll of bills, and as the cafe empties, Strasser approaches Ilsa, who understands his meaning before he exits. Laszlo arrives, and they leave the cafe together. In their room, Laszlo switches on the light while Ilsa removes her jewelry. He peers out the window at a man standing under an arch, then lowers the shade, lights a cigarette, and notices Ilsa's discomfort as she sits on the couch."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Annina runs up to him and hugs him, her relief palpable as she reunites with her long-lost love in the bustling Moroccan city of Casablanca, a refuge for those fleeing the war. He looks over and sees Rick, the enigmatic American who owns the famous Café Américain, a hub for expatriates and wartime intrigue. At the bar, Carl, the kind-hearted waiter who often aids desperate refugees, whispers in Sacha's ear. Sacha, the ever-cunning bartender, kisses Rick on both cheeks, a common greeting in Casablanca signifying camaraderie. Carl pours a brandy for Rick, a luxury drink sourced with difficulty due to wartime rationing. Pretending not to do so, Rick glances in Ilsa's direction, memories of their past romance in Paris—before the German occupation—still fresh. Renault, the opportunistic yet charming French police captain, comes up to him. He smiles slyly and walks away, always playing both sides for survival. Laszlo, a renowned Czech resistance leader wanted by the Nazis, comes up to Rick. Rick gets up, as does Laszlo, both men measuring each other as potential allies or foes. Laszlo looks at him, puzzled by Rick's aloof demeanor. Rick and Laszlo hear male voices singing downstairs—patrons raising their spirits through song in defiance of the oppressors. Rick stands at the balcony outside his office—a vantage point that allows him to observe the fervor below—and watches the Germans, who are gathered to exert their influence, below. At the bar, Renault watches with raised eyebrow, always calculating his next move. Laszlo's lips are very tight as he listens to the song, a symbol of resistance against the occupying forces. He starts down the steps, determined to rally the crowd. Yvonne, sitting at a table with her German officer, stares down into her drink, conflicted by her company and her loyalties. Laszlo speaks to the orchestra, encouraging them to play \"La Marseillaise,\" the French national anthem, as an act of defiance. Laszlo passes the table where Ilsa sits and goes straight to the orchestra. Members of the orchestra glance toward the steps, toward Rick, who nods to them, granting permission for this bold act. Laszlo and Corina, an accomplished singer and ally of the Resistance, sing as they start to play. Strasser, a stern German officer intent on stifling dissent, conducts the German singing in an attempt to drown out the competition. After a while, Strasser and his officers give up and sit down, defeated by the spontaneous uprising of patriotism. Yvonne jumps up and sings with tears in her eyes, her allegiance reclaimed. Ilsa, overcome with emotion, looks proudly at Laszlo, who sings with passion and conviction for a free Europe. Finally the whole cafe stands, singing, their faces aglow, unified in their defiance. The song finishes on a high, triumphant note, igniting a spirit of rebellion. Yvonne's face is exalted, transformed by hope. She shouts at the top of her lungs, sending a clear message of defiance. She deliberately faces the alcove where the Germans are watching, challenging their authority. Several French officers surround Laszlo, offering him a drink, a gesture of support and camaraderie. Renault thinks a moment, then blows a loud blast on his whistle, a signal to regain control or perhaps orchestrate an exit strategy. The room grows quiet, all eyes turn toward Renault, aware of the delicate balance he maintains between the occupiers and the occupied. An angry murmur starts among the crowd, charged with the tension of the moment. People get up and begin to leave, aware of the potential repercussions. Rick comes quickly up to Renault, aware that the captain's actions could have dire consequences. This display of nerve leaves Rick at a loss, as he contemplates his own role in this conflict. The croupier comes out of the gambling room and up to Renault, his presence a reminder of the ongoing, perilous environment. He hands him a roll of bills, a bribe or payment for services rendered, his manner is abrupt but cordial, a necessity in these uncertain times. As the cafe empties, Strasser approaches Ilsa, intent on intimidation or persuasion. She looks at him, understanding what he means—a reminder of the ever-present danger. He bows and exits as Laszlo arrives at the table, their escape still uncertain. They start out of the cafe, knowing the risk that lies ahead. Ilsa and Laszlo walk to their room, a fleeting sanctuary in a city under constant surveillance. Laszlo switches on the light as they enter, illuminating the sparse, temporary quarters they've come to call home. While Ilsa takes off some jewelry, a reminder of a more carefree past, he walks to the window and peers out into the darkness, aware of the ever-present threat. Below and across the street, a man stands under an arch, possibly an ally or informant. Laszlo watches him, then draws down the shade, ensuring their privacy. He crosses to a table, takes a cigarette from a box, a momentary comfort, and strikes a match. He lights the cigarette, its glow brief and calming. Ilsa is now noticeably uncomfortable, the weight of their circumstances pressing down. Ilsa walks over to the couch and sits down, her mind racing with the uncertainties of their future."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Annina runs up to him and hugs him  He looks over and sees Rick  At the bar Carl whispers in Sacha's ear  He kisses Rick on both cheeks  Carl pours a brandy for Rick  Pretending not to do so  Rick glances in Ilsa's direction  Members of the orchestra glance toward the steps toward Rick who nods to them  Laszlo and Corina sing as they start to play  Strasser conducts the German singing in an attempt to drown out the competition  After a while Strasser and his officers give up and sit down  Yvonne jumps up and sings with tears in her eyes  Ilsa overcome with emotion looks proudly at Laszlo who sings with passion  Finally the whole cafe stands singing their faces aglow  The song finishes on a high triumphant note  Yvonne's face is exalted  She shouts at the top of her lungs  She deliberately faces the alcove where the Germans are watching  Several French officers surround Laszlo offering him a drink  Renault thinks a moment then blows a loud blast on his whistle  The room grows quiet all eyes turn toward Renault  An angry murmur starts among the crowd  People get up and begin to leave  Rick comes quickly up to Renault  This display of nerve leaves Rick at a loss  The croupier comes out of the gambling room and up to Renault  He hands him a roll of bills  His manner is abrupt but cordial  As the cafe empties Strasser approaches Ilsa  She looks at him understanding what he means  He bows and exits as Laszlo arrives at the table  They start out of the cafe  Ilsa and Laszlo walk to their room  Laszlo switches on the light as they enter  Renault comes up to him  He smiles and walks away  Laszlo comes up to Rick  Rick gets up as does Laszlo  Laszlo looks at him puzzled  Rick and Laszlo hear male voices singing downstairs  Rick stands at the balcony outside his office and watches the Germans below  At the bar Renault watches with raised eyebrow  Laszlo's lips are very tight as he listens to the song  He starts down the step  Yvonne sitting at a table with her German officer stares down into her drink  Laszlo speaks to the orchestra  Laszlo passes the table where Ilsa sits and goes straight to the orchestra  Members of the orchestra glance toward the steps toward Rick who nods to them  Laszlo and Corina sing as they start to play  Strasser conducts the German singing in an attempt to drown out the competition  After a while Strasser and his officers give up and sit down  Yvonne jumps up and sings with tears in her eyes  Ilsa overcome with emotion looks proudly at Laszlo who sings with passion  Finally the whole cafe stands singing their faces aglow  The song finishes on a high triumphant note  Yvonne's face is exalted  She shouts at the top of her lungs  She deliberately faces the alcove where the Germans are watching  Several French officers surround Laszlo offering him a drink  Renault thinks a moment then blows a loud blast on his whistle  The room grows quiet all eyes turn toward Renault  An angry murmur starts among the crowd  People get up and begin to leave  Rick comes quickly up to Renault  This display of nerve leaves Rick at a loss  The croupier comes out of the gambling room and up to Renault  He hands him a roll of bills  His manner is abrupt but cordial  As the cafe empties Strasser approaches Ilsa  She looks at him understanding what he means  He bows and exits as Laszlo arrives at the table  They start out of the cafe  Ilsa and Laszlo walk to their room  Laszlo switches on the light as they enter  While Ilsa takes off some jewelry he walks to the window and peers out into the darkness  Below and across the street a man stands under an arch  Laszlo watches him then draws down the shade  He crosses to a table takes a cigarette from a box and strikes a match  He lights the cigarette  Ilsa is now noticeably uncomfortable  Ilsa walks over to the couch and sits down"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Annina runs up to him and hugs him. He looks over and sees Rick. At the bar Carl whispers in Sacha's ear. He kisses Rick on both cheeks. Carl pours a brandy for Rick. Pretending not to do so. Rick glances in Ilsa's direction. Renault comes up to him. He smiles and walks away. Laszlo comes up to Rick. Rick gets up as does Laszlo. Laszlo looks at him puzzled. Rick and Laszlo hear male voices singing downstairs. Rick stands at the balcony outside his office and watches the Germans below. At the bar Renault watches with raised eyebrow. Laszlo's lips are very tight as he listens to the song. He starts down the step. Yvonne sitting at a table with her German officer stares down into her drink. Laszlo speaks to the orchestra. Laszlo passes the table where Ilsa sits and goes straight to the orchestra. Members of the orchestra glance toward the steps toward Rick who nods to them. Laszlo and Corina sing as they start to play. Strasser conducts the German singing in an attempt to drown out the competition. After a while Strasser and his officers give up and sit down. Yvonne jumps up and sings with tears in her eyes. Ilsa overcome with emotion looks proudly at Laszlo who sings with passion. Finally the whole cafe stands singing their faces aglow. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. The song finishes on a high triumphant note. Yvonne's face is exalted. She shouts at the top of her lungs. She deliberately faces the alcove where the Germans are watching. Several French officers surround Laszlo offering him a drink. Renault thinks a moment then blows a loud blast on his whistle. The room grows quiet all eyes turn toward Renault. An angry murmur starts among the crowd. People get up and begin to leave. Rick comes quickly up to Renault. This display of nerve leaves Rick at a loss. The croupier comes out of the gambling room and up to Renault. He hands him a roll of bills. His manner is abrupt but cordial. As the cafe empties Strasser approaches Ilsa. She looks at him understanding what he means. He bows and exits as Laszlo arrives at the table. They start out of the cafe. Ilsa and Laszlo walk to their room. Laszlo switches on the light as they enter. While Ilsa takes off some jewelry he walks to the window and peers out into the darkness. Below and across the street a man stands under an arch. Laszlo watches him then draws down the shade. He crosses to a table takes a cigarette from a box and strikes a match. He lights the cigarette. Ilsa is now noticeably uncomfortable. Ilsa walks over to the couch and sits down."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Annina runs up to him and hugs him. He looks over and sees Rick. At the bar Carl whispers in Sacha's ear. He kisses Rick on both cheeks. Carl pours a brandy for Rick. Pretending not to do so. Rick glances in Ilsa's direction. Renault comes up to him. He smiles and walks away. Laszlo comes up to Rick. Rick gets up as does Laszlo. Laszlo looks at him puzzled. Rick and Laszlo hear male voices singing downstairs. Rick stands at the balcony outside his office and watches the Germans below. At the bar Renault watches with raised eyebrow. Laszlo's lips are very tight as he listens to the song. He starts down the step. Yvonne sitting at a table with her German officer stares down into her drink. Laszlo speaks to the orchestra. Laszlo passes the table where Ilsa sits and goes straight to the orchestra. Members of the orchestra glance toward the steps toward Rick who nods to them. Laszlo and Corina sing as they start to play. Strasser conducts the German singing in an attempt to drown out the competition. After a while Strasser and his officers give up and sit down. Yvonne jumps up and sings with tears in her eyes. Ilsa overcome with emotion looks proudly at Laszlo who sings with passion. Finally the whole cafe stands singing their faces aglow. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. The song finishes on a high triumphant note. Yvonne's face is exalted. She shouts at the top of her lungs. She deliberately faces the alcove where the Germans are watching. Several French officers surround Laszlo offering him a drink. Renault thinks a moment then blows a loud blast on his whistle. The room grows quiet all eyes turn toward Renault. An angry murmur starts among the crowd. People get up and begin to leave. Rick comes quickly up to Renault. This display of nerve leaves Rick at a loss. The croupier comes out of the gambling room and up to Renault. He hands him a roll of bills. His manner is abrupt but cordial. As the cafe empties Strasser approaches Ilsa. She looks at him understanding what he means. He bows and exits as Laszlo arrives at the table. They start out of the cafe. Ilsa and Laszlo walk to their room. Laszlo switches on the light as they enter. While Ilsa takes off some jewelry he walks to the window and peers out into the darkness. Below and across the street a man stands under an arch. Laszlo watches him then draws down the shade. He crosses to a table takes a cigarette from a box and strikes a match. He lights the cigarette. Ilsa is now noticeably uncomfortable. Ilsa walks over to the couch and sits down."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Annina runs up to him and hugs him. He looks over and sees Rick. At the bar Carl whispers in Sacha's ear. He kisses Rick on both cheeks. Carl pours a brandy for Rick. Pretending not to do so. Rick glances in Ilsa's direction. Renault comes up to him. He smiles and walks away. Laszlo comes up to Rick. Rick gets up as does Laszlo. Laszlo looks at him puzzled. Rick and Laszlo hear male voices singing downstairs. Rick stands at the balcony outside his office and watches the Germans below. As the cafe empties Strasser approaches Ilsa. She looks at him understanding what he means. He bows and exits as Laszlo arrives at the table. They start out of the cafe. Ilsa and Laszlo walk to their room. Laszlo switches on the light as they enter. While Ilsa takes off some jewelry he walks to the window and peers out into the darkness. Below and across the street a man stands under an arch. Laszlo watches him then draws down the shade. He crosses to a table takes a cigarette from a box and strikes a match. He lights the cigarette. Ilsa is now noticeably uncomfortable. Ilsa walks over to the couch and sits down."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Annina runs up to him and hugs him. He looks over and sees Rick. At the bar Carl whispers in Sacha's ear. He kisses Rick on both cheeks. Carl pours a brandy for Rick. Pretending not to do so. Laszlo watches him then draws down the shade. He crosses to a table takes a cigarette from a box and strikes a match. He lights the cigarette. Ilsa is now noticeably uncomfortable. Ilsa walks over to the couch and sits down."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The giraffe runs up to the lamp and hugs the lamp. The lamp looks over and sees the donkey. At the bar, the penguin whispers in the panda's ear. The penguin kisses the donkey on both cheeks. The penguin pours a brandy for the donkey. Pretending not to do so, the donkey glances in the parrot's direction. The kangaroo comes up to the lamp. The kangaroo smiles and walks away. The koala comes up to the donkey. The donkey gets up, as does the koala. The koala looks at the donkey, puzzled. The donkey and the koala hear male voices singing downstairs. The donkey stands at the balcony outside his office and watches the zebras below. At the bar, the kangaroo watches with raised eyebrow. The koala's lips are very tight as he listens to the song. The koala starts down the step. The owl, sitting at a table with her German officer, stares down into her drink. The koala speaks to the orchestra. The koala passes the table where the parrot sits and goes straight to the orchestra. Members of the orchestra glance toward the steps, toward the donkey, who nods to them. The koala and the flamingo sing as they start to play. The elephant conducts the German singing in an attempt to drown out the competition. After a while, the elephant and his officers give up and sit down. The owl jumps up and sings with tears in her eyes. The parrot, overcome with emotion, looks proudly at the koala, who sings with passion. Finally the whole cafe stands, singing, their faces aglow. The song finishes on a high, triumphant note. The owl's face is exalted. The owl shouts at the top of her lungs. The owl deliberately faces the alcove where the zebras are watching. Several French officers surround the koala, offering him a drink. The kangaroo thinks a moment, then blows a loud blast on his whistle. The room grows quiet, all eyes turn toward the kangaroo. An angry murmur starts among the crowd. Cacti get up and begin to leave. The donkey comes quickly up to the kangaroo. This display of nerve leaves the donkey at a loss. The squirrel comes out of the gambling room and up to the kangaroo. The squirrel hands the kangaroo a roll of bills. The squirrel's manner is abrupt but cordial. As the cafe empties, the elephant approaches the parrot. The parrot looks at the elephant, understanding what he means. The elephant bows and exits as the koala arrives at the table. They start out of the cafe. The parrot and the koala walk to their room. The koala switches on the light as they enter. While the parrot takes off some jewelry, the llama walks to the window and peers out into the darkness. Below and across the street, a lion stands under an arch. The llama watches the lion, then draws down the shade. The llama crosses to a table, takes a cigarette from a box, and strikes a match. The llama lights the cigarette. The parrot is now noticeably uncomfortable. The parrot walks over to the couch and sits down."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Annina runs up to him and hugs him. He looks over and sees Rick. At the counter, Carl whispers in Sacha's ear. He kisses Rick on both cheeks. Carl pours a lemonade for Rick. Pretending not to do so, Rick glances in Ilsa's direction. Renault comes up to him. He smiles and walks away. Laszlo comes up to Rick. Rick gets up, as does Laszlo. Laszlo looks at him, puzzled. Rick and Laszlo hear male voices singing below deck. Rick stands at the rooftop outside his studio and watches the Germans below. At the counter, Renault watches with raised eyebrow. Laszlo's lips are very tight as he listens to the melody. He starts down the gangway. Yvonne, sitting at a booth with her German officer, stares down into her glass. Laszlo speaks to the choir. Laszlo passes the booth where Ilsa sits and goes straight to the choir. Members of the choir glance toward the gangway, toward Rick, who nods to them. Laszlo and Corina sing as they start to perform. Strasser conducts the German singing in an attempt to drown out the competition. After a while, Strasser and his officers give up and sit down. Yvonne jumps up and sings with tears in her eyes. Ilsa, overcome with emotion, looks proudly at Laszlo, who sings with passion. Finally the whole bistro stands, singing, their faces aglow. The song finishes on a high, triumphant note. Yvonne's face is exalted. She shouts at the top of her lungs. She deliberately faces the alcove where the Germans are watching. Several Italian officers surround Laszlo, offering him a soda. Renault thinks a moment, then blows a loud blast on his flute. The room grows quiet, all eyes turn toward Renault. An angry murmur starts among the crowd. People get up and begin to leave. Rick comes quickly up to Renault. This display of nerve leaves Rick at a loss. The croupier comes out of the pantry and up to Renault. He hands him a roll of tickets. His manner is abrupt but cordial. As the bistro empties, Strasser approaches Ilsa. She looks at him, understanding what he means. He bows and exits as Laszlo arrives at the booth. They start out of the bistro. Ilsa and Laszlo walk to their suite. Laszlo switches on the heater as they enter. While Ilsa takes off some accessories, he walks to the mirror and peers out into the darkness. Below and across the courtyard, a man stands under an umbrella. Laszlo watches him, then draws down the curtain. He crosses to a shelf, takes a gum stick from a pack, and strikes a match. He lights the gum. Ilsa is now noticeably uncomfortable. Ilsa walks over to the armchair and sits down."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Annina skips up to him and pats him. He turns around and spots Rick. At the bar, Carl shouts into Sacha's ear. He taps Rick on both shoulders. Carl slides a brandy toward Rick. Pretending not to do so, Rick peers in Ilsa's direction. Renault stumbles up to him. He frowns and rushes away. Laszlo dances up to Rick. Rick stretches, as does Laszlo. Laszlo squints at him, confused. Rick and Laszlo catch male voices humming downstairs. Rick leans on the balcony outside his office and observes the Germans below. At the bar, Renault observes with furrowed brow. Laszlo's lips are slightly parted as he listens to the tune. He strides down the step. Yvonne, sitting at a table with her German officer, spins her drink around with her straw. Laszlo gestures to the orchestra. Laszlo skips past the table where Ilsa sits and heads directly to the orchestra. Members of the orchestra glance toward the steps, toward Rick, who waves to them. Laszlo and Corina hum as they start to perform. Strasser commands the German chanting in an effort to overpower the opposition. After a while, Strasser and his officers relent and sink into their seats. Yvonne leaps up and chants with tears in her eyes. Ilsa, filled with emotion, stares proudly at Laszlo, who chants with fervor. Finally the whole cafe rises, chanting, their faces illuminated. The tune concludes on a high, victorious tone. Yvonne's face is radiant. She screams at the top of her lungs. She purposefully faces the alcove where the Germans are observing. Several French officers encircle Laszlo, handing him a beverage. Renault ponders a moment, then blasts a loud note on his whistle. The room falls silent, all eyes fix on Renault. An irritated murmur begins among the crowd. People stand up and begin to depart. Rick dashes quickly up to Renault. This display of nerve leaves Rick perplexed. The croupier strides out of the gambling room and up to Renault. He tosses him a roll of bills. His manner is abrupt but amiable. As the cafe empties, Strasser sidles up to Ilsa. She glances at him, catching what he implies. He salutes and departs as Laszlo nears the table. They shuffle out of the cafe. Ilsa and Laszlo amble to their room. Laszlo flicks on the light as they cross into it. While Ilsa removes some jewelry, he marches to the window and gazes out into the blackness. Below and across the street, a man paces under an arch. Laszlo observes him, then pulls down the shade. He strides to a table, grabs a cigarette from a box, and flicks a match. He ignites the cigarette. Ilsa is now visibly uneasy. Ilsa strolls over to the couch and perches down."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Biscuit hops up to the bookshelf and hugs it. The refrigerator looks over and sees the shoe. At the swing, the stapler whispers in the apple's ear. The stapler kisses the shoe on both elbows. The stapler pours a tea for the shoe. Pretending not to do so, the shoe glances in the horse's direction. The umbrella comes up to the shoe. The shoe smiles and walks away. The spinach comes up to the shoe. The shoe gets up, as does the spinach. The spinach looks at the shoe, puzzled. The shoe and the spinach hear bird calls singing underneath. The shoe stands at the balcony outside the garage and watches the vegetables below. At the swing, the umbrella watches with a raised eyebrow. The spinach's lips are very tight as it listens to the song. It starts down the ladder. The lantern, sitting at a table with its wooden spoon, stares down into its plate. The spinach speaks to the typewriter. The spinach passes the table where the horse sits and goes straight to the typewriter. Keys on the typewriter glance toward the ladder, toward the shoe, who nods to them. The spinach and the pillow sing as they start to whistle. The ketchup conducts the vegetables singing in an attempt to drown out the noise. After a while, the ketchup and its forks give up and sit down. The lantern jumps up and sings with tears in its buttons. The horse, overcome with emotion, looks proudly at the spinach, who sings with joy. Finally, the whole garage stands, singing, their faces alight. The song finishes on a high, triumphant beep. The lantern's face is radiant. It shouts at the top of its lungs. It deliberately faces the cabinet where the vegetables are watching. Several French papers surround the spinach, offering it a napkin. The umbrella thinks a moment, then blows a loud note on its trumpet. The room grows quiet, all eyes turn toward the umbrella. An angry whisper starts among the group. Chairs get up and begin to leave. The shoe comes quickly up to the umbrella. This display of energy leaves the shoe at a loss. The calendar comes out of the puzzle room and up to the umbrella. It hands it a roll of yarn. Its manner is abrupt but friendly. As the garage empties, the ketchup approaches the horse. The horse looks at it, understanding what it means. It bows and exits as the spinach arrives at the table. They start out of the garage. The horse and the spinach walk to their shelf. The spinach switches on the lamp as they enter. While the horse takes off some ribbons, the spinach walks to the curtain and peers out into the night. Below and across the mat, a mountain stands under an umbrella. The spinach watches it, then draws down the shade. It crosses to a table, takes a pencil from a cup, and strikes a match. It lights the pencil. The horse is now noticeably uncomfortable. The horse walks over to the cushion and sits down."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Marvin flies up to her and tickles her. She glances over and spots Marty. At the lounge, Jenny mumbles in Leo's ear. She pats Marty on both shoulders. Jenny brews a tea for Marty. Feigning indifference, Marty peers in Charlotte's direction. Harrison drifts up to her. He grins and dances away. Victor floats up to Marty. Marty rises, as does Victor. Victor gazes at him, bemused. Marty and Victor detect female voices yodeling upstairs. Marty perches on the terrace outside her office and observes the Italians below. At the lounge, Harrison observes with furrowed brow. Victor's fingers are very stiff as she absorbs the melody. She ascends the ladder. Adele, lounging at a counter with her Spanish commander, gazes deeply into her soup. Victor addresses the choir. Victor strolls past the counter where Charlotte reclines and proceeds directly to the choir. Members of the choir peek toward the ladder, toward Marty, who salutes them. Victor and Gina chant as they begin to strum. Klaus orchestrates the Italian chanting in a struggle to silence the rivalry. Eventually, Klaus and his commanders relent and recline. Adele leaps up and chants with joy in her voice. Charlotte, overwhelmed with nostalgia, gazes admiringly at Victor, who chants with fervor. Ultimately, the entire bistro rises, chanting, their expressions radiant. The chant concludes on a soaring, victorious note. Adele's expression is elated. She proclaims at the top of her lungs. She purposefully faces the nook where the Italians are observing. Several Spanish commanders encircle Victor, extending her a bouquet. Harrison ponders a moment, then emits a loud puff on his harmonica. The chamber falls silent, all gazes pivot toward Harrison. A frustrated grumble arises among the assembly. People rise and commence to depart. Marty briskly approaches Harrison. This exhibition of audacity leaves Marty bewildered. The bartender emerges from the gaming hall and sidles up to Harrison. He presents her a wad of tickets. Her demeanor is abrupt yet gracious. As the bistro vacates, Klaus nears Charlotte. She acknowledges him, grasping his intent. He nods and withdraws as Victor approaches the counter. They proceed out of the bistro. Charlotte and Victor wander to their suite. Victor flicks on the switch as they enter. While Charlotte removes some accessories, he meanders to the window and gazes out into the abyss. Below and across the avenue, an individual lingers beside a statue. Victor observes him, then pulls down the curtain. He strolls to a cabinet, takes a pen from a jar, and scratches a note. He inscribes the document. Charlotte is now markedly uneasy. Charlotte ambles over to the bench and reclines."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Annina skips up to him and pats him. He glances over and spots Rick. At the bar, Carl mutters in Sacha's ear. He pats Rick on both arms. Carl spills a soda for Rick. Pretending not to do so, Rick peers in Ilsa's direction. Renault glides up to him. He grins and saunters away. Laszlo dances up to Rick. Rick jumps up, as does Laszlo. Laszlo stares at him, confused. Rick and Laszlo hear male voices speaking loudly downstairs. Rick leans on the balcony outside his office and observes the Germans below. At the bar, Renault observes with a skeptical expression. Laszlo's lips are very pursed as he absorbs the noise. He steps up the stair. Yvonne, leaning on a booth with her German officer, glares down into her book. Laszlo gestures to the orchestra. Laszlo skips past the booth where Ilsa sits and goes straight to the orchestra. Members of the orchestra glance toward the stair, toward Rick, who winks to them. Laszlo and Corina hum as they start to play. Strasser leads the German clapping in an attempt to cover the sound. After a while, Strasser and his officers relent and sit down. Yvonne leaps up and shouts with tears in her eyes. Ilsa, overwhelmed with feeling, beams at Laszlo, who hums with fervor. Eventually the whole cafe rises, humming, their faces aglow. The noise ends on a high, triumphant cheer. Yvonne's face is radiant. She yells at the top of her voice. She deliberately faces the booth where the Germans are observing. Several French waiters surround Laszlo, offering him a sandwich. Renault pauses a moment, then blows a loud blast on his horn. The room grows quiet, all eyes turn toward Renault. A frustrated murmur rumbles among the crowd. People stand up and begin to wander. Rick rushes up to Renault. This show of daring leaves Rick puzzled. The croupier emerges from the kitchen and up to Renault. He offers him a stack of papers. His manner is brisk but friendly. As the cafe empties, Strasser approaches Ilsa. She gazes at him, grasping what he implies. He nods and departs as Laszlo arrives at the booth. They wander out of the cafe. Ilsa and Laszlo stroll to their room. Laszlo flips on the fan as they enter. While Ilsa removes some makeup, he walks to the curtain and gazes out into the shadows. Below and across the street, a cat sits under an arch. Laszlo studies it, then pulls down the shutter. He crosses to a stool, takes a pen from a jar, and presses a button. He writes the letter. Ilsa is now visibly tense. Ilsa walks over to the chair and lies down."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Elena skips over to the cat and taps its paw. The cat glances around and notices Ben. In the kitchen, Tom mumbles into Eva's scarf. He pats Ben on both shoulders. Tom fills a teapot for Ben. Acting as if uninterested, Ben peeks toward Mia's position. Grayson strolls near the cat. The cat chuckles and hops away. Jenny strides near Ben. Ben stands, as does Jenny. Jenny gazes at him, perplexed. Ben and Jenny detect female birds chirping outside. Ben leans against the railing beside his porch and observes the ducks flying. In the kitchen, Grayson observes with a twinkling nose. Jenny's eyebrows are furrowed as she absorbs the tune. She marches down the hill. Abigail, lounging on a bench with her Spanish soldier, glances down at her muffin. Jenny whispers to the choir. Jenny bypasses the bench where Mia rests and moves directly to the choir. Members of the choir peek toward the hill, toward Ben, who winks at them. Jenny and Olivia hum as they begin to strum. Oliver guides the parrots squawking in an effort to overcome the harmony. Eventually, Oliver and his sergeants relent and settle down. Abigail leaps up and chirps with laughter in her voice. Mia, overwhelmed with joy, beams fondly at Jenny, who hums with fervor. At last, the entire lounge hums, grinning, their expressions radiant. The melody concludes on a brilliant, victorious beat. Abigail's grin is ecstatic. She whispers with all her might. She intentionally faces the alcove where the parrots are perched. Several Brazilian dancers encircle Jenny, extending to her a muffin. Grayson ponders for a moment, then snaps a loud click with his fingers. The area falls silent, every head turns toward Grayson. A confused buzz begins among the audience. Creatures rise and commence departing. Ben dashes swiftly to Grayson. This show of courage confounds Ben. The pastry chef emerges from the pantry and crosses to Grayson. He presents him a stack of cards. His demeanor is terse yet friendly. As the lounge clears, Oliver advances toward Mia. She acknowledges him, recognizing his intent. He nods and exits as Jenny reaches the bench. They proceed out of the lounge. Mia and Jenny stroll to their den. Jenny flicks on the lamp as they step inside. While Mia removes some earrings, she strides to the balcony and gazes out into the dusk. Below and across the courtyard, a rabbit perches beneath a tree. Jenny observes it, then draws up the curtain. She wanders to a desk, grabs a candy from a jar, and flicks a lighter. She kindles the candy. Mia is now visibly uneasy. Mia strolls over to the hammock and reclines."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Annina embraces him while Rick notices from afar. At the bar, Carl whispers to Sacha, kisses Rick, and pours him brandy. Rick subtly glances at Ilsa before Renault approaches and exits. Laszlo arrives, and both he and Rick stand upon hearing male voices singing below. Rick observes from a balcony, while Renault watches skeptically. Laszlo, tense, walks to the orchestra, passing Ilsa, and encourages them to play. Despite Strasser's attempts to overpower their song, the Germans eventually relent. Yvonne passionately joins in, evoking emotion from Ilsa and pride from Laszlo. The entire cafe sings triumphantly, with Yvonne defiantly facing the Germans. As French officers gather around Laszlo, Renault whistles to silence the room, prompting the crowd to disperse. Rick approaches Renault, perplexed by the situation. As the cafe clears, Strasser confronts Ilsa before exiting. Ilsa and Laszlo head to their room, where Laszlo notices a man outside. Drawing the shade, he lights a cigarette while Ilsa, uncomfortable, sits on the couch."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Ilsa walks over to the couch and sits down Ilsa is now noticeably uncomfortable  He lights the cigarette  He crosses to a table takes a cigarette from a box and strikes a match  Laszlo watches him then draws down the shade  Below and across the street a man stands under an arch  While Ilsa takes off some jewelry he walks to the window and peers out into the darkness  Laszlo switches on the light as they enter  Ilsa and Laszlo walk to their room  They start out of the cafe  He bows and exits as Laszlo arrives at the table  She looks at him understanding what he means  As the cafe empties Strasser approaches Ilsa  His manner is abrupt but cordial  He hands him a roll of bills  The croupier comes out of the gambling room and up to Renault  This display of nerve leaves Rick at a loss  Rick comes quickly up to Renault  People get up and begin to leave  An angry murmur starts among the crowd  The room grows quiet all eyes turn toward Renault  Renault thinks a moment then blows a loud blast on his whistle  Several French officers surround Laszlo offering him a drink  She deliberately faces the alcove where the Germans are watching  She shouts at the top of her lungs  Yvonne's face is exalted  The song finishes on a high triumphant note  Finally the whole cafe stands singing their faces aglow  Ilsa overcome with emotion looks proudly at Laszlo who sings with passion  Yvonne jumps up and sings with tears in her eyes  After a while Strasser and his officers give up and sit down  Strasser conducts the German singing in an attempt to drown out the competition  Laszlo and Corina sing as they start to play  Members of the orchestra glance toward the steps toward Rick who nods to them  Laszlo passes the table where Ilsa sits and goes straight to the orchestra  Laszlo speaks to the orchestra  Yvonne sitting at a table with her German officer stares down into her drink  He starts down the step  Laszlo's lips are very tight as he listens to the song  At the bar Renault watches with raised eyebrow  Rick stands at the balcony outside his office and watches the Germans below  Rick and Laszlo hear male voices singing downstairs  Laszlo looks at him puzzled  Rick gets up as does Laszlo  Laszlo comes up to Rick  He smiles and walks away  Renault comes up to him  Rick glances in Ilsa's direction  Pretending not to do so  Carl pours a brandy for Rick  He kisses Rick on both cheeks  At the bar Carl whispers in Sacha's ear  He looks over and sees Rick  Annina runs up to him and hugs him "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "They start out of the cafe  Laszlo switches on the light as they enter  He starts down the step  Laszlo's lips are very tight as he listens to the song  He looks over and sees Rick  Laszlo comes up to Rick  Ilsa overcome with emotion looks proudly at Laszlo who sings with passion  He lights the cigarette  Several French officers surround Laszlo offering him a drink  Laszlo looks at him puzzled  He kisses Rick on both cheeks  Annina runs up to him and hugs him  The song finishes on a high triumphant note  The croupier comes out of the gambling room and up to Renault  An angry murmur starts among the crowd  The room grows quiet all eyes turn toward Renault  Laszlo watches him then draws down the shade  Below and across the street a man stands under an arch  Ilsa is now noticeably uncomfortable  Yvonne's face is exalted  Renault comes up to him  This display of nerve leaves Rick at a loss  As the cafe empties Strasser approaches Ilsa  Finally the whole cafe stands singing their faces aglow  Laszlo passes the table where Ilsa sits and goes straight to the orchestra  While Ilsa takes off some jewelry he walks to the window and peers out into the darkness  Members of the orchestra glance toward the steps toward Rick who nods to them  She deliberately faces the alcove where the Germans are watching  Renault thinks a moment then blows a loud blast on his whistle  He smiles and walks away  Laszlo and Corina sing as they start to play  Rick stands at the balcony outside his office and watches the Germans below  Strasser conducts the German singing in an attempt to drown out the competition  People get up and begin to leave  Rick gets up as does Laszlo  He crosses to a table takes a cigarette from a box and strikes a match  She shouts at the top of her lungs  Yvonne sitting at a table with her German officer stares down into her drink  Yvonne jumps up and sings with tears in her eyes  Rick glances in Ilsa's direction  He bows and exits as Laszlo arrives at the table  Pretending not to do so  Ilsa walks over to the couch and sits down At the bar Renault watches with raised eyebrow  She looks at him understanding what he means  At the bar Carl whispers in Sacha's ear  Carl pours a brandy for Rick  Ilsa and Laszlo walk to their room  Rick and Laszlo hear male voices singing downstairs  Rick comes quickly up to Renault  After a while Strasser and his officers give up and sit down  He hands him a roll of bills  His manner is abrupt but cordial  Laszlo speaks to the orchestra "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "The song finishes on a high triumphant note  Yvonne's face is exalted  She shouts at the top of her lungs  She deliberately faces the alcove where the Germans are watching  Several French officers surround Laszlo offering him a drink  Renault thinks a moment then blows a loud blast on his whistle  The room grows quiet all eyes turn toward Renault  An angry murmur starts among the crowd  People get up and begin to leave  Rick comes quickly up to Renault  This display of nerve leaves Rick at a loss  The croupier comes out of the gambling room and up to Renault  He hands him a roll of bills  His manner is abrupt but cordial  As the cafe empties Strasser approaches Ilsa  She looks at him understanding what he means  He bows and exits as Laszlo arrives at the table  They start out of the cafe  Ilsa and Laszlo walk to their room  Laszlo switches on the light as they enter  While Ilsa takes off some jewelry he walks to the window and peers out into the darkness  Below and across the street a man stands under an arch  Laszlo watches him then draws down the shade  He crosses to a table takes a cigarette from a box and strikes a match  He lights the cigarette  Ilsa is now noticeably uncomfortable  Ilsa walks over to the couch and sits down Annina runs up to him and hugs him  He looks over and sees Rick  At the bar Carl whispers in Sacha's ear  He kisses Rick on both cheeks  Carl pours a brandy for Rick  Pretending not to do so  Rick glances in Ilsa's direction  Renault comes up to him  He smiles and walks away  Laszlo comes up to Rick  Rick gets up as does Laszlo  Laszlo looks at him puzzled  Rick and Laszlo hear male voices singing downstairs  Rick stands at the balcony outside his office and watches the Germans below  At the bar Renault watches with raised eyebrow  Laszlo's lips are very tight as he listens to the song  He starts down the step  Yvonne sitting at a table with her German officer stares down into her drink  Laszlo speaks to the orchestra  Laszlo passes the table where Ilsa sits and goes straight to the orchestra  Members of the orchestra glance toward the steps toward Rick who nods to them  Laszlo and Corina sing as they start to play  Strasser conducts the German singing in an attempt to drown out the competition  After a while Strasser and his officers give up and sit down  Yvonne jumps up and sings with tears in her eyes  Ilsa overcome with emotion looks proudly at Laszlo who sings with passion  Finally the whole cafe stands singing their faces aglow "
        }
      ]
    }
  ]
}