{
  "ground_truth": "The Dude is hurled against the chief's desk, which he bounces off of, to come to rest more or less seated in a facing chair. His wallet is tossed onto the desk. The chief leans forward, takes the wallet, and sorts through it with disgusted incredulity, looking at the Ralph's Shopper's Club card. The Dude stares. The Chief hurls his steaming mug of coffee at the Dude, hitting him in the forehead with a thud, and the scalding coffee splashes everywhere. The Chief is already up off his chair, rounding the desk. He kicks the chair out from under the Dude, and then starts kicking at him. The Dude, in the back seat of a taxicab that rocks and squeaks with every bump, is gingerly touching sore spots on his face and scalp. The back of the driver, a large black man with rasta dreds under a knit cap, is visible. The place is a wreck. Furniture has been overturned, upholstery slashed, drawers dumped. Quiet ensues. Maude emerges from the bedroom wearing a bathrobe. She pulls open the bathrobe as she approaches, and the Dude is stupefied. A match is dragged across a headboard; the Dude is lighting himself a joint. He climbs out of bed, but Maude remains in it. She wedges a pillow into the small of her back and clasps a hand on each kneecap, pulling her knees in toward her chest to keep her pelvis raised. He picks a White Russian off the bedside table and spits some. The Dude is staring off into space, thinking. The Dude is leaving the bedroom. The man nervously complies, and the Dude flinches at the man's movement as he gets out. The man cringes, reacting to the Dude's flinch. He is wearing a cheap blue serge suit, is bald with a short fringe, and has a mustache. The Dude shouts to cover his fear and is stunned as he fumbles in his wallet. The Dude looks at the picture, which is probably a school portrait, unmistakably Bunny, but fresh-faced, much younger looking, with a corn-fed smile and straight Partridge Family hair and bangs. He is holding out another picture of a bleak farmhouse and silo, the only features on a flat snow-swept landscape, and hands back the picture. The Dude steps out to meet Walter's car as it pulls up, its passenger window open and the pomeranian leaning out and yapping. Four people sit at a booth: Dieter, Kieffer, Franz, all in black leather, and a young woman with long stringy blonde hair, wearing torn and patched jeans and a ribbed sleeveless tee-shirt, worn thin with age. A waitress enters with a checkpad and pen.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "The Dude is flung against the leader's desk, which he rebounds off of, to come to rest more or less perched in a facing chair. His billfold is lobbed onto the desk. The leader leans forward, takes the billfold, and sifts through it with disgusted amazement, gazing at the Ralph's Shopper's Club card. The Dude gapes. The Leader flings his steaming mug of coffee at the Dude, striking him in the brow with a thud, and the scalding coffee splatters everywhere. The Leader is already up off his seat, circling the desk. He kicks the chair out from under the Dude, and then begins kicking at him. The Dude, in the back seat of a taxicab that sways and squeaks with every jolt, is gingerly touching painful spots on his face and scalp. The back of the driver, a large black man with rasta dreds under a knit cap, is visible. The place is a shambles. Furniture has been upended, upholstery sliced, drawers emptied. Silence follows. Maude emerges from the bedroom wearing a bathrobe. She pulls open the bathrobe as she approaches, and the Dude is astonished. A match is dragged across a headboard; the Dude is igniting himself a joint. He climbs out of bed, but Maude remains in it. She wedges a pillow into the small of her back and clasps a hand on each patella, pulling her knees in toward her chest to keep her pelvis raised. He picks a White Russian off the nightstand and spits some. The Dude is gazing off into space, pondering. The Dude is exiting the bedroom. The man nervously complies, and the Dude recoils at the man's movement as he gets out. The man cringes, reacting to the Dude's recoil. He is wearing a cheap blue wool suit, is bald with a short fringe, and has a mustache. The Dude yells to mask his fear and is stunned as he fumbles in his billfold. The Dude looks at the picture, which is probably a school portrait, unmistakably Bunny, but fresh-faced, much younger appearing, with a corn-fed grin and straight Partridge Family hair and bangs. He is holding out another picture of a bleak farmhouse and silo, the only features on a flat snow-swept terrain, and hands back the picture. The Dude steps out to meet Walter's vehicle as it draws up, its passenger window open and the pomeranian leaning out and barking. Four individuals sit at a booth: Dieter, Kieffer, Franz, all in black leather, and a young woman with long stringy blonde hair, wearing torn and patched jeans and a ribbed sleeveless tee-shirt, worn thin with age. A waitress enters with a checkpad and pen."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The Dude is hurled against the chief's desk, which he bounces off of, to come to rest more or less seated in a facing chair. The desk is struck by The Dude, off which he bounces, to come to rest more or less seated in a facing chair. Onto the desk, his wallet is tossed. The chief leans forward, takes the wallet, and sorts through it with disgusted incredulity, looking at the Ralph's Shopper's Club card. The Dude stares. His steaming mug of coffee is hurled by the Chief at the Dude, hitting him in the forehead with a thud, and the scalding coffee splashes everywhere. The chair is kicked out from under the Dude by him, and then he starts kicking at him. In the back seat of a taxicab that rocks and squeaks with every bump, the Dude is gingerly touching sore spots on his face and scalp. A large black man with rasta dreds under a knit cap is driving, his back visible. The place is a wreck. Overturned furniture, slashed upholstery, and dumped drawers can be seen. Quiet ensues. Maude emerges from the bedroom wearing a bathrobe. As she approaches, the bathrobe is pulled open and the Dude is stupefied. Across a headboard, a match is dragged; a joint is being lit by the Dude. He climbs out of bed, but Maude remains in it. Into the small of her back, a pillow is wedged by her, and she clasps a hand on each kneecap, pulling her knees in toward her chest to keep her pelvis raised. Off the bedside table, he picks a White Russian and spits some. Off into space, the Dude is staring, thinking. The bedroom is left by the Dude. The man complies nervously, and as he gets out, the Dude flinches at his movement. To the Dude's flinch, the man cringes, reacting. He is wearing a cheap blue serge suit, is bald with a short fringe, and has a mustache. A shout is let out by the Dude to cover his fear and he is stunned while fumbling in his wallet. The picture is looked at by the Dude, which is probably a school portrait, unmistakably Bunny, but fresh-faced, much younger looking, with a corn-fed smile and straight Partridge Family hair and bangs. Another picture of a bleak farmhouse and silo, the only features on a flat snow-swept landscape, is held out by him and the picture is handed back. To meet Walter's car, the Dude steps out as it pulls up, its passenger window open and the pomeranian leaning out and yapping. At a booth, four people are sitting: Dieter, Kieffer, Franz, all in black leather, and a young woman with long stringy blonde hair, wearing torn and patched jeans and a ribbed sleeveless tee-shirt, worn thin with age. With a checkpad and pen, a waitress enters."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "The Dude is thrown against the chief's desk, bouncing off and landing in a chair. His wallet is tossed onto the desk, and the chief inspects it with disgust, focusing on the Ralph's Shopper's Club card. The Dude stares as the chief throws a mug of coffee at him, hitting his forehead, spilling hot coffee everywhere. The chief, now standing, kicks the chair from under the Dude and begins kicking him. In a taxicab, the Dude gingerly touches sore spots on his face, while the driver, a large black man with rasta dreds under a knit cap, is visible. The place is wrecked, with overturned furniture and slashed upholstery. Quiet follows as Maude, in a bathrobe, emerges from the bedroom and approaches the Dude, who is astonished. The Dude lights a joint and gets out of bed, leaving Maude, who remains. He picks up a White Russian from the bedside table, staring into space. As the Dude leaves the bedroom, a nervous man in a cheap blue serge suit flinches and the Dude reacts. The man is bald with a mustache. The Dude shouts, covering his fear, and examines a wallet picture, unmistakably Bunny, looking younger, with a corn-fed smile and Partridge Family hair. He looks at another photo of a bleak farmhouse and silo in a snowy landscape, then hands it back. The Dude steps out to meet Walter's car, its window open with a pomeranian yapping. Four people sit at a booth: Dieter, Kieffer, Franz in black leather, and a young woman with stringy blonde hair in torn jeans and an old sleeveless tee. A waitress arrives with a checkpad and pen."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "The Dude is thrown against the chief's desk, bounces off, and lands in a chair. His wallet is tossed on the desk. The chief examines it, disgusted at the Ralph's Shopper's Club card. The Dude watches as the chief throws hot coffee at him, hitting his forehead. The chief kicks the chair away and starts kicking him. In a taxicab, the Dude gently touches his sore face. The driver is a large black man with rasta dreds. The place is trashed, with overturned furniture and dumped drawers. Maude, in a bathrobe, emerges, and the Dude is stunned. He lights a joint, climbs out of bed, Maude remains. She adjusts her position with a pillow. The Dude picks up a White Russian, spits some, and stares into space. Leaving the bedroom, the Dude flinches at a man's movement. The man, in a blue serge suit, bald with a mustache, cringes. The Dude shouts, stunned, fumbles in his wallet, and examines a school photo of Bunny, young and fresh-faced. He hands back a picture of a farmhouse on a snowy landscape. The Dude leaves to meet Walter's car, with a yapping pomeranian. At a booth, sit Dieter, Kieffer, Franz in black leather, and a young woman in worn jeans and a sleeveless tee. A waitress approaches with a checkpad."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "The Dude is forcefully hurled against the chief's solid desk, his momentum causing him to bounce off of it, ultimately coming to a rest more or less seated in a chair facing the chief. His wallet is carelessly tossed onto the desk. With a look of disgusted incredulity, the chief leans forward, takes the wallet in his hands, and begins to sort through its contents, eventually coming across the Ralph's Shopper's Club card. The Dude stares blankly. Suddenly, the Chief hurls his steaming mug of coffee directly at the Dude, the mug striking him on the forehead with a thud, and causing the scalding coffee to splash everywhere. The Chief is already up from his chair, rounding the desk with swift determination. He then kicks the chair out from under the Dude, and proceeds to start kicking at him. Later, the Dude finds himself sitting in the back seat of a taxicab, which rocks and squeaks audibly with every bump it hits. He gingerly touches sore spots on his face and scalp, wincing. The back of the driver is visible; he is a large black man sporting rasta dreds under a knit cap. The place is an absolute wreck: furniture has been overturned, upholstery has been slashed, and drawers have been carelessly dumped. Silence eventually ensues. Maude emerges from the bedroom, wearing a bathrobe. As she approaches, she pulls open the bathrobe, leaving the Dude utterly stupefied. Meanwhile, a match is dragged across a headboard as the Dude lights himself a joint. He then climbs out of bed, but Maude remains in it comfortably. She wedges a pillow into the small of her back and clasps a hand on each of her kneecaps, pulling her knees in toward her chest to keep her pelvis elevated. The Dude picks up a White Russian from the bedside table and spits some out. He is staring off into space, clearly deep in thought. As the Dude leaves the bedroom, a man nervously complies, and the Dude flinches at the man's movement as he gets up. The man cringes in reaction to the Dude's flinch. This man is wearing a cheap blue serge suit; he is bald with a short fringe and has a mustache. The Dude shouts, trying to cover his fear, and is stunned as he fumbles around in his wallet. He looks at a picture, probably a school portrait, unmistakably of Bunny but with a fresh, youthful appearance, sporting a corn-fed smile and straight Partridge Family hair and bangs. He holds out another picture depicting a bleak farmhouse and silo, which are the only features on a flat, snow-swept landscape, and then hands the picture back. The Dude steps outside to meet Walter's car as it pulls up; the passenger window is open, and a pomeranian leans out, yapping energetically. Four people are seated at a booth: Dieter, Kieffer, Franz, all clad in black leather, along with a young woman who has long, stringy blonde hair and is wearing torn and patched jeans and a ribbed, sleeveless tee-shirt worn thin with age. A waitress enters the scene, holding a checkpad and pen in hand."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "The Dude is unceremoniously and with great force hurled against the solid, imposing desk of the chief. His momentum propels him to bounce off the desk, ultimately causing him to come to a rest, more or less seated in a chair that faces directly toward the chief. In a careless manner, his wallet is tossed onto the desk. With an expression of disgusted incredulity etched on his face, the chief leans forward, taking the wallet into his hands. He begins to sort meticulously through its contents, eventually discovering the Ralph's Shopper's Club card. The Dude stares ahead blankly, his expression unchanging. Without warning, the chief hurls his steaming mug of coffee directly at the Dude; the mug strikes him on the forehead with a resounding thud, causing the scalding coffee to splash in all directions. The Chief, even before the coffee settles, is already up from his chair. He rounds the desk with swift determination and then kicks the chair out from under the Dude, proceeding to viciously start kicking at him. Later on, the Dude finds himself sitting in the back seat of a taxicab, which rocks and squeaks audibly with every bump that it encounters. He gingerly touches sore spots on his face and scalp, wincing at the pain. From the back seat, the driver is visible; he is a large black man, sporting distinctively styled rasta dreads under a knit cap. The place where they are is an absolute wreck: furniture has been overturned, upholstery has been slashed, and drawers have been carelessly dumped. Silence, eventually and finally, ensues. Maude emerges from the bedroom, casually wearing a bathrobe. As she approaches, she pulls the bathrobe open, leaving the Dude utterly stupefied by the gesture. Simultaneously, a match is dragged across a headboard as the Dude lights himself a joint. He then climbs out of bed, whereas Maude remains comfortably in it. She wedges a pillow into the small of her back, clasping a hand on each of her kneecaps and pulling her knees in toward her chest to keep her pelvis elevated. The Dude picks up a White Russian from the bedside table, taking a sip and then spitting some out. He is staring off into space, clearly absorbed in deep thought. As the Dude leaves the bedroom, a man nervously complies, and the Dude flinches instinctively at the man's movement as he gets up. The man cringes, reacting to the Dude's flinch. This man is outfitted in a cheap blue serge suit; he is bald, except for a short fringe, and he sports a mustache. The Dude shouts, attempting to cover his fear, and is stunned as he fumbles clumsily around in his wallet. He looks at a photograph, most likely a school portrait unmistakably of Bunny, featuring her with a fresh, youthful appearance, sporting a corn-fed smile alongside straight, Partridge Family hair and bangs. He holds out another picture depicting a bleak farmhouse and silo, which are the only structures on an expansive, flat, snow-swept landscape, and then he hands the picture back. The Dude steps outside to meet Walter's car as it pulls up; the passenger window is open, and a small pomeranian leans out, yapping energetically. Four individuals are seated at a booth: Dieter, Kieffer, and Franz, all dressed in black leather, alongside a young woman with long, stringy blonde hair who is wearing torn and patched jeans and a ribbed, sleeveless tee-shirt, worn thin with age. A waitress enters the scene, holding a checkpad and a pen in hand."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "The Dude is forcibly thrown against the chief's desk, where he hits with a jolt and ricochets off, ultimately finding himself more or less seated in a chair directly facing the desk. Shortly thereafter, his wallet is carelessly flung onto the desk's surface. Observing this, the chief leans forward with an expression of sharp distaste, reaches out, grabs the wallet, and begins to rummage through its contents while exuding an air of incredulous disgust, particularly as he fixates on the Ralph's Shopper's Club card. The Dude, in turn, watches this unfold, seemingly in a state of passive observation. Suddenly, the Chief, filled with anger, propels his steaming mug of coffee towards the Dude, striking him in the forehead with a pronounced thud, causing the hot liquid to splash chaotically in all directions. Immediately after this act, the Chief rises briskly from his chair and moves quickly around the desk to confront the Dude further. In his aggression, he kicks the chair out from beneath the Dude, sending it sprawling, and proceeds to launch kicks at him. Following this violent encounter, the narrative shifts to the Dude now seated in the back of a taxicab, the vehicle itself rocking and creaking with each bump encountered along the road. As the taxi jostles about, he gently touches the sore spots on his face and scalp, wincing at the tenderness. From his vantage point, the back of the driver is visible—a large black man whose rasta dreads protrude from beneath a knit cap. The surrounding environment within the cab is in disarray, with furniture upturned, upholstery torn, and drawers emptied, creating a scene of chaos and dishevelment. In the midst of this turbulence, a moment of quiet descends. Maude appears, emerging from the bedroom dressed in a bathrobe, and as she approaches, she dramatically pulls the robe open, rendering the Dude momentarily stupefied by the sight. Subsequently, the scene shifts again to the Dude dragging a match across a headboard, igniting a joint for himself. He then climbs out of bed, leaving Maude sprawled comfortably within it. She adjusts her position by wedging a pillow into the small of her back and placing one hand on each kneecap, pulling her knees toward her chest to elevate her pelvis. Meanwhile, the Dude retrieves a White Russian cocktail from the bedside table, takes a sip, and spits some out, lost in thought as he stares blankly into space. The scene transitions once more as the Dude exits the bedroom. As he leaves, a man in the vicinity reacts with nervous compliance; the Dude flinches at this man's movement as he rises, provoking the man to cringe in response to the Dude's reflexive flinch. This man is clad in a cheap blue serge suit, with a bald head save for a short fringe, and a mustache adorning his face. The Dude, attempting to mask his trepidation, raises his voice in an outcry, seeming overwhelmed as he fumbles through his wallet. His attention is caught by a picture within it—a school portrait unmistakably of Bunny, albeit with a much fresher, youthful appearance, beaming a corn-fed smile and sporting straight Partridge Family-style hair and bangs. Holding another picture of a solitary, desolate farmhouse and silo set against an expansive, snow-laden landscape, he returns this image. As the scene evolves, the Dude steps outside just in time to see Walter's car approaching, leaning toward the open passenger window, inside of which a pomeranian eagerly leans out, barking animatedly. Meanwhile, a new environment is introduced, where four individuals occupy a booth: Dieter, Kieffer, Franz, all dressed in matching black leather attire, accompanied by a young woman with long, stringy blonde hair, her ensemble consisting of torn and patched jeans and a ribbed sleeveless tee-shirt so aged it appears nearly threadbare. In this setting, a waitress makes her entrance, equipped with a check pad and pen at the ready."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "The Dude is hurled against the chief's desk, bouncing off to settle into a chair. His wallet is tossed onto the desk, and the chief sorts through it with disgust before hurling his mug at the Dude, splattering hot coffee. The chief then kicks the chair from under the Dude and starts attacking him. Later, the Dude, in a taxi, gingerly touches sore spots on his face while noticing the large driver with rasta dreds. In a trashed apartment, Maude emerges in a bathrobe, stunning the Dude as she approaches. After lighting a joint, he gets out of bed while she remains, positioning herself comfortably. He picks up a White Russian, spits some, and stares into space, lost in thought before leaving the bedroom. Nervously, he interacts with a man in a cheap suit who reacts to the Dude's flinch and shouts. The Dude examines a picture of a young Bunny, then another of a bleak farmhouse, and hands it back. He exits to meet Walter’s car as it arrives, pomeranian barking from the window. In a booth, Dieter, Kieffer, Franz, and a young woman with long blonde hair sit in worn clothes as a waitress arrives with a checkpad."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "The Dude is hurled against the chief's desk, which he bounces off of, to come to rest more or less seated in a facing chair that looks like it's been around since the 70s. His wallet is tossed onto the desk. The chief, who has a reputation in the department for his no-nonsense attitude, leans forward, takes the wallet, and sorts through it with disgusted incredulity, looking at the Ralph's Shopper's Club card, part of a popular grocery chain in the western United States. The Dude stares. The Chief hurls his steaming mug of coffee, brewed from the finest Colombian beans, at the Dude, hitting him in the forehead with a thud, and the scalding coffee splashes everywhere, staining the old carpet. The Chief is already up off his chair, rounding the desk. He kicks the chair out from under the Dude, and then starts kicking at him. The Dude, now sitting in the back seat of a taxicab that rocks and squeaks with every bump due to its worn suspension, is gingerly touching sore spots on his face and scalp. The back of the driver, a large black man with rasta dreds under a knit cap made from colorful yarns, is visible. The place, likely an old apartment, is a wreck. Furniture has been overturned, upholstery slashed, drawers dumped, hinting at a struggle. Quiet ensues. Maude emerges from the bedroom wearing a bathrobe made of luxurious silk. She pulls open the bathrobe as she approaches, and the Dude is stupefied by her audacity. A match is dragged across a headboard made of solid oak; the Dude is lighting himself a joint, a habit he picked up during his college days in the early 70s. He climbs out of bed, but Maude remains in it. She wedges a pillow into the small of her back and clasps a hand on each kneecap, pulling her knees in toward her chest to keep her pelvis raised, following a routine from her yoga practice. He picks a White Russian, his favorite cocktail famously known from the movie 'The Big Lebowski,' off the bedside table and spits some. The Dude is staring off into space, thinking of his seemingly never-ending troubles. The Dude is leaving the bedroom. The man nervously complies, and the Dude flinches at the man's movement as he gets out. The man cringes, reacting to the Dude's flinch. He is wearing a cheap blue serge suit, typical of a department store sale, is bald with a short fringe, and has a mustache reminiscent of the 1980s style. The Dude shouts to cover his fear and is stunned as he fumbles in his wallet. The Dude looks at the picture, which is probably a school portrait, unmistakably Bunny, a nickname for a young woman known for her youthful looks, fresh-faced, much younger looking, with a corn-fed smile and straight Partridge Family hair and bangs. He is holding out another picture of a bleak farmhouse and silo, the only features on a flat snow-swept landscape reminiscent of the Great Plains, and hands back the picture. The Dude steps out to meet Walter's car as it pulls up, its passenger window open and the pomeranian, a small dog breed known for its fluffy coat and lively personality, leaning out and yapping. Four people sit at a booth in an old diner known for its bottomless coffee: Dieter, Kieffer, Franz, all in black leather like a biker gang, and a young woman with long stringy blonde hair, wearing torn and patched jeans and a ribbed sleeveless tee-shirt, worn thin with age, reflecting a punk fashion style. A waitress enters with a checkpad and pen, ready to take their orders in this small-town gathering place."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "She pulls open the bathrobe as she approaches and the Dude is stupefied The Dude is hurled against the chief's desk which he bounces off of to come to rest more or less seated in a facing chair The back of the driver a large black man with rasta dreds under a knit cap is visible His wallet is tossed onto the desk The chief leans forward takes the wallet and sorts through it with disgusted incredulity looking at the Ralph's Shopper's Club card The Dude stares The Chief hurls his steaming mug of coffee at the Dude hitting him in the forehead with a thud and the scalding coffee splashes everywhere The Dude is leaving the bedroom The Chief is already up off his chair rounding the desk He kicks the chair out from under the Dude and then starts kicking at him His wallet is tossed onto the desk The Dude in the back seat of a taxicab that rocks and squeaks with every bump is gingerly touching sore spots on his face and scalp The back of the driver a large black man with rasta dreds under a knit cap is visible The place is a wreck The Dude looks at the picture which is probably a school portrait unmistakably Bunny but freshfaced much younger looking with a cornfed smile and straight Partridge Family hair and bangs Furniture has been overturned upholstery slashed drawers dumped The man nervously complies and the Dude flinches at the man's movement as he gets out Quiet ensues The Dude stares He picks a White Russian off the bedside table and spits some The Dude is hurled against the chief's desk which he bounces off of to come to rest more or less seated in a facing chair Maude emerges from the bedroom wearing a bathrobe She pulls open the bathrobe as she approaches and the Dude is stupefied A match is dragged across a headboard the Dude is lighting himself a joint He climbs out of bed but Maude remains in it She wedges a pillow into the small of her back and clasps a hand on each kneecap pulling her knees in toward her chest to keep her pelvis raised He picks a White Russian off the bedside table and spits some The Dude is staring off into space thinking The Dude is leaving the bedroom Dieter Kieffer Franz all in black leather and a young woman with long stringy blonde hair wearing torn and patched jeans and a ribbed sleeveless teeshirt worn thin with age She wedges a pillow into the small of her back and clasps a hand on each kneecap pulling her knees in toward her chest to keep her pelvis raised The man nervously complies and the Dude flinches at the man's movement as he gets out The man cringes reacting to the Dude's flinch He is wearing a cheap blue serge suit is bald with a short fringe and has a mustache The Dude shouts to cover his fear and is stunned as he fumbles in his wallet The Dude looks at the picture which is probably a school portrait unmistakably Bunny but freshfaced much younger looking with a cornfed smile and straight Partridge Family hair and bangs He is holding out another picture of a bleak farmhouse and silo the only features on a flat snowswept landscape and hands back the picture The Dude steps out to meet Walter's car as it pulls up its passenger window open and the pomeranian leaning out and yapping Four people sit at a booth The chief leans forward takes the wallet and sorts through it with disgusted incredulity looking at the Ralph's Shopper's Club card The Chief hurls his steaming mug of coffee at the Dude hitting him in the forehead with a thud and the scalding coffee splashes everywhere He is wearing a cheap blue serge suit is bald with a short fringe and has a mustache Dieter Kieffer Franz all in black leather and a young woman with long stringy blonde hair wearing torn and patched jeans and a ribbed sleeveless teeshirt worn thin with age Four people sit at a booth The Dude in the back seat of a taxicab that rocks and squeaks with every bump is gingerly touching sore spots on his face and scalp A waitress enters with a checkpad and pen"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "The Dude is hurled against the chief's desk which he bounces off of to come to rest more or less seated in a facing chair. His wallet is tossed onto the desk. The chief leans forward takes the wallet and sorts through it with disgusted incredulity looking at the Ralph's Shopper's Club card. The Dude stares. The Chief hurls his steaming mug of coffee at the Dude hitting him in the forehead with a thud and the scalding coffee splashes everywhere. The Chief is already up off his chair rounding the desk. He kicks the chair out from under the Dude and then starts kicking at him. The Dude in the back seat of a taxicab that rocks and squeaks with every bump is gingerly touching sore spots on his face and scalp. The back of the driver a large black man with rasta dreds under a knit cap is visible. The place is a wreck. Furniture has been overturned upholstery slashed drawers dumped. Quiet ensues. Maude emerges from the bedroom wearing a bathrobe. She pulls open the bathrobe as she approaches and the Dude is stupefied. A match is dragged across a headboard. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. the Dude is lighting himself a joint. He climbs out of bed but Maude remains in it. She wedges a pillow into the small of her back and clasps a hand on each kneecap pulling her knees in toward her chest to keep her pelvis raised. He picks a White Russian off the bedside table and spits some. The Dude is staring off into space thinking. The Dude is leaving the bedroom. The man nervously complies and the Dude flinches at the man's movement as he gets out. The man cringes reacting to the Dude's flinch. He is wearing a cheap blue serge suit is bald with a short fringe and has a mustache. The Dude shouts to cover his fear and is stunned as he fumbles in his wallet. The Dude looks at the picture which is probably a school portrait unmistakably Bunny but freshfaced much younger looking with a cornfed smile and straight Partridge Family hair and bangs. He is holding out another picture of a bleak farmhouse and silo the only features on a flat snowswept landscape and hands back the picture. The Dude steps out to meet Walter's car as it pulls up its passenger window open and the pomeranian leaning out and yapping. Four people sit at a booth. Dieter Kieffer Franz all in black leather and a young woman with long stringy blonde hair wearing torn and patched jeans and a ribbed sleeveless teeshirt worn thin with age. A waitress enters with a checkpad and pen."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "The Dude is hurled against the chief's desk which he bounces off of to come to rest more or less seated in a facing chair. His wallet is tossed onto the desk. The chief leans forward takes the wallet and sorts through it with disgusted incredulity looking at the Ralph's Shopper's Club card. The Dude stares. The Chief hurls his steaming mug of coffee at the Dude hitting him in the forehead with a thud and the scalding coffee splashes everywhere. The Chief is already up off his chair rounding the desk. He kicks the chair out from under the Dude and then starts kicking at him. The Dude in the back seat of a taxicab that rocks and squeaks with every bump is gingerly touching sore spots on his face and scalp. The back of the driver a large black man with rasta dreds under a knit cap is visible. The place is a wreck. Furniture has been overturned upholstery slashed drawers dumped. Quiet ensues. Maude emerges from the bedroom wearing a bathrobe. She pulls open the bathrobe as she approaches and the Dude is stupefied. A match is dragged across a headboard. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. the Dude is lighting himself a joint. He climbs out of bed but Maude remains in it. She wedges a pillow into the small of her back and clasps a hand on each kneecap pulling her knees in toward her chest to keep her pelvis raised. He picks a White Russian off the bedside table and spits some. The Dude is staring off into space thinking. The Dude is leaving the bedroom. The man nervously complies and the Dude flinches at the man's movement as he gets out. The man cringes reacting to the Dude's flinch. He is wearing a cheap blue serge suit is bald with a short fringe and has a mustache. The Dude shouts to cover his fear and is stunned as he fumbles in his wallet. The Dude looks at the picture which is probably a school portrait unmistakably Bunny but freshfaced much younger looking with a cornfed smile and straight Partridge Family hair and bangs. He is holding out another picture of a bleak farmhouse and silo the only features on a flat snowswept landscape and hands back the picture. The Dude steps out to meet Walter's car as it pulls up its passenger window open and the pomeranian leaning out and yapping. Four people sit at a booth. Dieter Kieffer Franz all in black leather and a young woman with long stringy blonde hair wearing torn and patched jeans and a ribbed sleeveless teeshirt worn thin with age. A waitress enters with a checkpad and pen."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "The Dude is hurled against the chief's desk which he bounces off of to come to rest more or less seated in a facing chair. His wallet is tossed onto the desk. The chief leans forward takes the wallet and sorts through it with disgusted incredulity looking at the Ralph's Shopper's Club card. The Dude stares. The Chief hurls his steaming mug of coffee at the Dude hitting him in the forehead with a thud and the scalding coffee splashes everywhere. The Chief is already up off his chair rounding the desk. He kicks the chair out from under the Dude and then starts kicking at him. The Dude in the back seat of a taxicab that rocks and squeaks with every bump is gingerly touching sore spots on his face and scalp. He is wearing a cheap blue serge suit is bald with a short fringe and has a mustache. The Dude shouts to cover his fear and is stunned as he fumbles in his wallet. The Dude looks at the picture which is probably a school portrait unmistakably Bunny but freshfaced much younger looking with a cornfed smile and straight Partridge Family hair and bangs. He is holding out another picture of a bleak farmhouse and silo the only features on a flat snowswept landscape and hands back the picture. The Dude steps out to meet Walter's car as it pulls up its passenger window open and the pomeranian leaning out and yapping. Four people sit at a booth. Dieter Kieffer Franz all in black leather and a young woman with long stringy blonde hair wearing torn and patched jeans and a ribbed sleeveless teeshirt worn thin with age. A waitress enters with a checkpad and pen."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "The Dude is hurled against the chief's desk which he bounces off of to come to rest more or less seated in a facing chair. His wallet is tossed onto the desk. The chief leans forward takes the wallet and sorts through it with disgusted incredulity looking at the Ralph's Shopper's Club card. The Dude steps out to meet Walter's car as it pulls up its passenger window open and the pomeranian leaning out and yapping. Four people sit at a booth. Dieter Kieffer Franz all in black leather and a young woman with long stringy blonde hair wearing torn and patched jeans and a ribbed sleeveless teeshirt worn thin with age. A waitress enters with a checkpad and pen."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The kangaroo is hurled against the chief's desk, which it bounces off of, to come to rest more or less seated in a facing chair. Its wallet is tossed onto the desk. A giraffe leans forward, takes the wallet, and sorts through it with disgusted incredulity, looking at the Ralph's Shopper's Club card. The kangaroo stares. The giraffe hurls its steaming mug of coffee at the kangaroo, hitting it in the forehead with a thud, and the scalding coffee splashes everywhere. The giraffe is already up off its chair, rounding the desk. It kicks the chair out from under the kangaroo, and then starts kicking at it. The kangaroo, in the back seat of a taxicab that rocks and squeaks with every bump, is gingerly touching sore spots on its face and scalp. The back of the penguin, a large black man with rasta dreds under a knit cap, is visible. The place is a wreck. Furniture has been overturned, upholstery slashed, drawers dumped. Quiet ensues. The octopus emerges from the bedroom wearing a bathrobe. It pulls open the bathrobe as it approaches, and the kangaroo is stupefied. A match is dragged across a headboard; the kangaroo is lighting itself a joint. It climbs out of bed, but the octopus remains in it. It wedges a pillow into the small of its back and clasps a hand on each kneecap, pulling its knees in toward its chest to keep its pelvis raised. The kangaroo picks a White Russian off the bedside table and spits some. The kangaroo is staring off into space, thinking. The kangaroo is leaving the bedroom. The fish nervously complies, and the kangaroo flinches at the fish’s movement as it gets out. The fish cringes, reacting to the kangaroo's flinch. It is wearing a cheap blue serge suit, is bald with a short fringe, and has a mustache. The kangaroo shouts to cover its fear and is stunned as it fumbles in its wallet. The kangaroo looks at the picture, which is probably a school portrait, unmistakably Bunny, but fresh-faced, much younger looking, with a corn-fed smile and straight Partridge Family hair and bangs. It is holding out another picture of a bleak farmhouse and silo, the only features on a flat snow-swept landscape, and hands back the picture. The kangaroo steps out to meet the turtle's car as it pulls up, its passenger window open and the pomeranian leaning out and yapping. Four owls sit at a booth: Dieter, Kieffer, Franz, all in black leather, and a young walrus with long stringy blonde hair, wearing torn and patched jeans and a ribbed sleeveless tee-shirt, worn thin with age. A bee enters with a checkpad and pen."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "The Dude is hurled against the lawyer's bookshelf, which he bounces off of, to come to rest more or less seated in a facing stool. His passport is tossed onto the bookshelf. The lawyer leans forward, takes the passport, and sorts through it with disgusted incredulity, looking at the Costco Membership card. The Dude stares. The lawyer hurls his steaming bowl of soup at the Dude, hitting him in the forehead with a thud, and the scalding soup splashes everywhere. The lawyer is already up off his stool, rounding the bookshelf. He kicks the stool out from under the Dude, and then starts kicking at him. The Dude, in the back seat of a rickshaw that rocks and squeaks with every bump, is gingerly touching sore spots on his face and scalp. The back of the driver, a large black man with rasta dreds under a woolen hat, is visible. The place is a wreck. Cabinets have been overturned, curtains slashed, cupboards dumped. Quiet ensues. Maude emerges from the bathroom wearing a kimono. She pulls open the kimono as she approaches, and the Dude is stupefied. A match is dragged across a windowsill; the Dude is lighting himself a cigar. He climbs out of the hammock, but Maude remains in it. She wedges a cushion into the small of her back and clasps a hand on each elbow, pulling her knees in toward her chest to keep her pelvis raised. He picks a Margarita off the nightstand and spits some. The Dude is staring off into space, thinking. The Dude is leaving the bathroom. The man nervously complies, and the Dude flinches at the man's movement as he gets out. The man cringes, reacting to the Dude's flinch. He is wearing a cheap green tweed jacket, is bald with a short fringe, and has a mustache. The Dude shouts to cover his fear and is stunned as he fumbles in his passport. The Dude looks at the illustration, which is probably a class photo, unmistakably Bunny, but fresh-faced, much younger looking, with a corn-fed smile and straight Brady Bunch hair and bangs. He is holding out another illustration of a dreary warehouse and crane, the only features on a flat fog-covered landscape, and hands back the illustration. The Dude steps out to meet Walter's bicycle as it pulls up, its passenger basket open and the dachshund leaning out and barking. Four people sit at a picnic table: Dieter, Kieffer, Franz, all in black denim, and a young woman with long stringy blonde hair, wearing torn and patched overalls and a ribbed sleeveless blouse, worn thin with age. A waiter enters with a clipboard and pencil."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "The Dude is flung against the chief's desk, which he slides off of, to come to rest more or less perched in a facing chair. His wallet is lobbed onto the desk. The chief sits back, grabs the wallet, and flips through it with bemused disbelief, inspecting the Ralph's Shopper's Club card. The Dude glares. The Chief flings his full mug of coffee at the Dude, striking him in the forehead with a smack, and the hot coffee rains down everywhere. The Chief is already down off his chair, circling the desk. He shoves the chair out from under the Dude, and then starts stomping toward him. The Dude, in the back seat of a taxicab that jerks and rattles with every turn, is gingerly prodding sore spots on his face and scalp. The back of the driver, a large black man with rasta dreds under a knit cap, is visible. The place is a mess. Furniture has been displaced, upholstery torn, drawers emptied. Silence reigns. Maude emerges from the bedroom wearing a bathrobe. She flings open the bathrobe as she approaches, and the Dude is bewildered. A match is scraped across a headboard; the Dude is lighting himself a cigarette. He crawls out of bed, but Maude stays in it. She wedges a pillow into the small of her back and clasps a hand on each kneecap, tugging her knees in toward her chest to keep her pelvis elevated. He grabs a White Russian off the bedside table and sips some. The Dude is gazing off into space, pondering. The Dude is departing the bedroom. The man nervously obeys, and the Dude recoils at the man's movement as he stands. The man shrinks back, reacting to the Dude's recoil. He is wearing a cheap blue serge suit, is bald with a short fringe, and has a mustache. The Dude yells to mask his anxiety and is shocked as he fumbles in his wallet. The Dude glances at the picture, which is probably a school portrait, unmistakably Bunny, but fresh-faced, much younger looking, with a corn-fed smile and straight Partridge Family hair and bangs. He is extending another picture of a desolate farmhouse and silo, the only features on a flat snow-swept landscape, and hands over the picture. The Dude steps out to greet Walter's car as it pulls up, its passenger window open and the pomeranian leaning out and barking. Four people lounge at a booth: Dieter, Kieffer, Franz, all in black leather, and a young woman with long stringy blonde hair, wearing ragged and patched jeans and a ribbed sleeveless tee-shirt, worn thin with age. A waitress approaches with a checkpad and pen."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "The Guitar is hurled against the detective's bookshelf, which it bounces off of, to come to rest more or less nestled in a rocking ottoman. Its notebook is flung onto the bookshelf. The detective leans forward, takes the notebook, and flips through it with baffled skepticism, focusing on the Bartlett's Barista's Club coupon. The Guitar gazes. The Detective hurls his boiling pan of soup at the Guitar, striking it on the shoulder with a clang, and the bubbling soup splatters everywhere. The Detective is already up off his hammock, rounding the ottoman. He swats the ottoman out from under the Guitar, and then starts swatting at it. The Guitar, in the back seat of a limousine that wobbles and rattles with every bump, is gingerly patting tender spots on its neck and body. The back of the passenger, a tall red-haired woman with aviator glasses under a silk scarf, is visible. The space is a disaster. Books have been scattered, paintings slashed, shelves emptied. Silence follows. Clara emerges from the pantry wearing a windbreaker. She unzips the windbreaker as she approaches, and the Guitar is bewildered. A candle is dragged across a dresser; the Guitar is lighting itself a candle. It climbs out of a chair, but Clara remains in it. She wedges a cushion into the crook of her elbow and clasps a hand on each shoelace, pulling her feet in toward her chest to keep her shoulders elevated. It picks a martini off the mantlepiece and spills some. The Guitar is gazing off into oblivion, pondering. The Guitar is leaving the pantry. The woman nervously complies, and the Guitar flinches at the woman's movement as she exits. The woman shudders, reacting to the Guitar's flinch. She is wearing a shabby red velvet dress, is curly-haired with a short fringe, and has spectacles. The Guitar shouts to mask its anxiety and is bewildered as it fumbles in its notebook. The Guitar looks at the sketch, which is probably a family portrait, unmistakably Doe, but rosy-cheeked, significantly older looking, with a toothy grin and wavy Brady Bunch curls and a bow. It is holding out another sketch of a desolate barn and windmill, the only features on a vast sand-swept seascape, and hands back the sketch. The Guitar steps out to greet Louis's van as it rolls up, its back window down and the ferret leaning out and chattering. Four plants sit at a table: Maple, Oak, Pine, all in plaid shirts, and a young vine with short curly green leaves, wearing frayed and patched overalls and a ribbed sleeveless tank top, worn thin with age. A bartender enters with a menu and pencil."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "The catapult is tossed against the artist's easel, which it ricochets off of, to come to rest more or less perched in a nearby chair. Its notebook is flung onto the easel. The artist edges forward, grabs the notebook, and scans through it with bemused amazement, glancing at the Target's Loyalty Program card. The catapult gazes. The artist flings his steaming bowl of soup at the catapult, striking it on the pedal with a thud, and the boiling soup splatters everywhere. The artist is already up off his chair, circling the easel. He shoves the chair out from under the catapult, and then begins shoving at it. The catapult, in the front seat of a carriage that clinks and sways with every jolt, is cautiously feeling sore spots on its frame and wheels. The back of the musician, a lanky white woman with curly hair under a fedora, is visible. The room is a disaster. Curtains have been torn, wallpaper shredded, cabinets emptied. Silence ensues. Lydia appears from the attic wearing a trench coat. She pulls open the trench coat as she approaches, and the catapult is befuddled. A lighter is flicked against a headboard; the catapult is igniting itself a candle. It descends out of bed, but Lydia stays in it. She wedges a cushion into the small of her back and clasps a hand on each ankle, pulling her knees in toward her chest to keep her pelvis elevated. It selects a glass of water off the windowsill and sips some. The catapult is gazing off into space, pondering. The catapult is exiting the attic. The baker nervously agrees, and the catapult winces at the baker's motion as he departs. The baker quivers, responding to the catapult's wince. He is wearing a shabby red wool jacket, is bald with a thin tuft, and has a beard. The catapult yells to mask its anxiety and is flabbergasted as it fumbles in its notebook. The catapult examines the photograph, which is probably a wedding portrait, unmistakably Cindy, but bright-eyed, significantly younger looking, with a radiant grin and straight retro hair and bangs. It is holding out another photograph of a desolate barn and windmill, the only features on a flat frost-covered terrain, and returns the photograph. The catapult strides out to encounter Peter's van as it drives up, its driver's window open and the terrier leaning out and yapping. Four individuals sit at a counter: Gustav, Hans, Karl, all in brown corduroy, and a young man with short spiky black hair, wearing ripped and patched shorts and a ribbed sleeveless undershirt, worn thin with age. A bellhop enters with a clipboard and pencil."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "The Dude is launched against the chief's cabinet, which he ricochets off of, to settle more or less perched in an adjacent stool. His passport is flung onto the cabinet. The chief leans backward, grabs the passport, and flips through it with amazed disbelief, gazing at the Costco Membership card. The Dude gawks. The Chief flings his boiling teapot at the Dude, striking him in the shoulder with a clunk, and the hot tea splatters everywhere. The Chief is already off his stool, circling the cabinet. He nudges the stool out from under the Dude, and then begins stomping at him. The Dude, in the front seat of a motorcycle sidecar that sways and squeals with every spin, is cautiously prodding tender spots on his arms and thighs. The side of the driver, a large Asian woman with braids under a bucket hat, is visible. The place is chaos. Furniture has been upended, curtains shredded, cupboards emptied. Quiet follows. Maude steps out of the closet wearing a trench coat. She snaps open the trench coat as she approaches, and the Dude is astounded. A candle is scraped across a doorframe; the Dude is igniting himself a cigar. He hops out of the hammock, but Maude remains in it. She crams a cushion into the crook of her arm and clasps a hand on each elbow, pulling her elbows in toward her chest to keep her shoulders raised. He lifts a glass of orange juice off the nightstand and coughs some. The Dude is gazing at the ceiling, pondering. The Dude is exiting the closet. The woman tentatively obeys, and the Dude flinches at the woman's motion as she steps away. The woman recoils, reacting to the Dude's flinch. She is wearing a cheap red velvet dress, has long hair with a fringe, and has no mustache. The Dude yells to mask his anxiety and is amazed as he rifles in his pocket. The Dude examines the snapshot, which is probably a graduation picture, unmistakably Bunny, but innocent-looking, much more youthful, with a radiant smile and straight Charlie's Angels hair and bangs. He is holding out another snapshot of a rundown barn and well, the only structures on a flat wind-swept landscape, and hands back the snapshot. The Dude skips out to greet Walter's bike as it pulls up, its basket exposed and the parrot peeking out and squawking. Four people sit at a table: Dieter, Kieffer, Franz, all in bright polyester, and a young man with long stringy brown hair, wearing ripped and patched overalls and a ribbed sleeveless jersey, worn thin with age. A cook enters with a receipt pad and crayon."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "The Frog is tossed against the captain's piano, which he ricochets off of, to come to rest more or less sprawled in a reclining hammock. His hat is flung onto the piano. The captain bends sideways, grabs the hat, and flips through it with baffled curiosity, observing the Piggly Wiggly Membership Tag. The Frog blinks. The Captain flings his bubbling bowl of soup at the Frog, striking him in the elbow with a bang, and the scalding soup splatters everywhere. The Captain is already off his hammock, circling the piano. He scoots the hammock out from beneath the Frog, and then begins nudging at him. The Frog, in the passenger seat of a minivan that wobbles and clatters with every jolt, is gently prodding bruised spots on his arm and shoulder. The silhouette of the navigator, a petite woman with pixie curls under a straw hat, is noticeable. The room is a shambles. Shelves have been scattered, paintings shredded, boxes scattered. Silence follows. Laura steps from the bathroom wearing a wetsuit. She tears open the wetsuit as she nears, and the Frog is flabbergasted. A spark is scraped across a chalkboard; the Frog is igniting himself a candle. He hops out of the hammock, but Laura stays in it. She nudges a cushion into the crook of her knee and rests a foot on each ankle, drawing her feet in toward her shoulders to keep her abdomen elevated. He plucks a Lemonade from the floor mat and gulps some. The Frog is gazing off into the abyss, pondering. The Frog is exiting the bathroom. The goat anxiously obeys, and the Frog jumps at the goat's action as it rolls out. The goat quivers, reacting to the Frog's jump. It is wearing a frayed red velvet cape, is haired with a thin mane, and has a beard. The Frog yells to mask his anxiety and is dumbfounded as he fiddles in his hat. The Frog glances at the sketch, which is probably a work ID, undoubtedly Daisy, but soft-featured, much more youthful looking, with a radiant grin and sleek Brady Bunch tresses and curls. He is extending another sketch of a desolate lighthouse and windmill, the lone features on a barren rain-swept panorama, and returns the sketch. The Frog hops out to encounter Oscar's bicycle as it rolls up, its wheel basket open and the chihuahua peering out and barking. Four creatures perch at a counter: Hans, Fritz, Ludwig, all in tan corduroy, and an older man with short cropped red hair, dressed in baggy and faded overalls and a striped long-sleeve sweater, worn thin with time. A cook steps in with a clipboard and pencil."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "The Dude is thrown against the chief's desk and lands in a chair. His wallet is tossed on the desk, and the chief examines it disdainfully. Angrily, the chief throws his coffee at the Dude, then kicks him and his chair. The Dude later explores a wrecked place in the back seat of a cab, tenderly touching his injuries. Maude, in a bathrobe, appears, and shocks him by disrobing. The Dude lights a joint, exits the bed while Maude stays, and drinks a White Russian. He then leaves the bedroom, nervously interacting with a man in a cheap suit. The Dude shouts to mask his fear and looks at a picture of a younger Bunny with a wholesome smile. He also examines a grim farmhouse photo. As he steps out, he meets Walter's car, with a pomeranian barking out of the open window. At a booth, Dieter, Kieffer, Franz, and a young woman with blonde hair sit as a waitress approaches with a notepad."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "A waitress enters with a checkpad and pen Dieter Kieffer Franz all in black leather and a young woman with long stringy blonde hair wearing torn and patched jeans and a ribbed sleeveless teeshirt worn thin with age Four people sit at a booth The Dude steps out to meet Walter's car as it pulls up its passenger window open and the pomeranian leaning out and yapping He is holding out another picture of a bleak farmhouse and silo the only features on a flat snowswept landscape and hands back the picture The Dude looks at the picture which is probably a school portrait unmistakably Bunny but freshfaced much younger looking with a cornfed smile and straight Partridge Family hair and bangs The Dude shouts to cover his fear and is stunned as he fumbles in his wallet He is wearing a cheap blue serge suit is bald with a short fringe and has a mustache The man cringes reacting to the Dude's flinch The man nervously complies and the Dude flinches at the man's movement as he gets out The Dude is leaving the bedroom The Dude is staring off into space thinking He picks a White Russian off the bedside table and spits some She wedges a pillow into the small of her back and clasps a hand on each kneecap pulling her knees in toward her chest to keep her pelvis raised He climbs out of bed but Maude remains in it the Dude is lighting himself a joint A match is dragged across a headboard She pulls open the bathrobe as she approaches and the Dude is stupefied Maude emerges from the bedroom wearing a bathrobe Quiet ensues Furniture has been overturned upholstery slashed drawers dumped The place is a wreck The back of the driver a large black man with rasta dreds under a knit cap is visible The Dude in the back seat of a taxicab that rocks and squeaks with every bump is gingerly touching sore spots on his face and scalp He kicks the chair out from under the Dude and then starts kicking at him The Chief is already up off his chair rounding the desk The Chief hurls his steaming mug of coffee at the Dude hitting him in the forehead with a thud and the scalding coffee splashes everywhere The Dude stares The chief leans forward takes the wallet and sorts through it with disgusted incredulity looking at the Ralph's Shopper's Club card His wallet is tossed onto the desk The Dude is hurled against the chief's desk which he bounces off of to come to rest more or less seated in a facing chair"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "The Dude is staring off into space thinking A match is dragged across a headboard Furniture has been overturned upholstery slashed drawers dumped The Dude shouts to cover his fear and is stunned as he fumbles in his wallet The Dude steps out to meet Walter's car as it pulls up its passenger window open and the pomeranian leaning out and yapping He kicks the chair out from under the Dude and then starts kicking at him The Chief is already up off his chair rounding the desk Maude emerges from the bedroom wearing a bathrobe Quiet ensues the Dude is lighting himself a joint The place is a wreck He is holding out another picture of a bleak farmhouse and silo the only features on a flat snowswept landscape and hands back the picture A waitress enters with a checkpad and pen The man cringes reacting to the Dude's flinch He climbs out of bed but Maude remains in it Four people sit at a booth His wallet is tossed onto the desk She pulls open the bathrobe as she approaches and the Dude is stupefied He picks a White Russian off the bedside table and spits some The chief leans forward takes the wallet and sorts through it with disgusted incredulity looking at the Ralph's Shopper's Club card She wedges a pillow into the small of her back and clasps a hand on each kneecap pulling her knees in toward her chest to keep her pelvis raised The man nervously complies and the Dude flinches at the man's movement as he gets out Dieter Kieffer Franz all in black leather and a young woman with long stringy blonde hair wearing torn and patched jeans and a ribbed sleeveless teeshirt worn thin with age The Chief hurls his steaming mug of coffee at the Dude hitting him in the forehead with a thud and the scalding coffee splashes everywhere The Dude looks at the picture which is probably a school portrait unmistakably Bunny but freshfaced much younger looking with a cornfed smile and straight Partridge Family hair and bangs The Dude in the back seat of a taxicab that rocks and squeaks with every bump is gingerly touching sore spots on his face and scalp The back of the driver a large black man with rasta dreds under a knit cap is visible He is wearing a cheap blue serge suit is bald with a short fringe and has a mustache The Dude is hurled against the chief's desk which he bounces off of to come to rest more or less seated in a facing chair The Dude stares The Dude is leaving the bedroom"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "He climbs out of bed but Maude remains in it She wedges a pillow into the small of her back and clasps a hand on each kneecap pulling her knees in toward her chest to keep her pelvis raised He picks a White Russian off the bedside table and spits some The Dude is staring off into space thinking The Dude is leaving the bedroom The man nervously complies and the Dude flinches at the man's movement as he gets out The man cringes reacting to the Dude's flinch He is wearing a cheap blue serge suit is bald with a short fringe and has a mustache The Dude shouts to cover his fear and is stunned as he fumbles in his wallet The Dude looks at the picture which is probably a school portrait unmistakably Bunny but freshfaced much younger looking with a cornfed smile and straight Partridge Family hair and bangs He is holding out another picture of a bleak farmhouse and silo the only features on a flat snowswept landscape and hands back the picture The Dude steps out to meet Walter's car as it pulls up its passenger window open and the pomeranian leaning out and yapping Four people sit at a booth Dieter Kieffer Franz all in black leather and a young woman with long stringy blonde hair wearing torn and patched jeans and a ribbed sleeveless teeshirt worn thin with age A waitress enters with a checkpad and pen The Dude is hurled against the chief's desk which he bounces off of to come to rest more or less seated in a facing chair His wallet is tossed onto the desk The chief leans forward takes the wallet and sorts through it with disgusted incredulity looking at the Ralph's Shopper's Club card The Dude stares The Chief hurls his steaming mug of coffee at the Dude hitting him in the forehead with a thud and the scalding coffee splashes everywhere The Chief is already up off his chair rounding the desk He kicks the chair out from under the Dude and then starts kicking at him The Dude in the back seat of a taxicab that rocks and squeaks with every bump is gingerly touching sore spots on his face and scalp The back of the driver a large black man with rasta dreds under a knit cap is visible The place is a wreck Furniture has been overturned upholstery slashed drawers dumped Quiet ensues Maude emerges from the bedroom wearing a bathrobe She pulls open the bathrobe as she approaches and the Dude is stupefied A match is dragged across a headboard the Dude is lighting himself a joint"
        }
      ]
    }
  ]
}