{
  "ground_truth": "Mrs. Robinson's face appears in the crack in the door at Elaine's shoulder, and Elaine looks from Ben's face to the crack through which she can see her mother's eyes staring. She moves toward him as though to hit him, and Elaine slams the door shut. Mrs. Robinson stands at the end of it, looking at Ben, and he looks at her in horror. She gets further and further away as though it is a very long hall in a very bad dream. Ben sits cross-legged on his bed in the dark, his back against the fish tank, smoking. Ben drives by in his car and looks at the house. Dressed differently, Ben stands by the window overlooking the backyard, and over his shoulder, Mr. Braddock is seen down by the pool, dressed in a sweater, cleaning the pool with a long-handled scoop. Mr. Braddock looks up at Ben's window, and Ben moves aside. Ben is standing behind a tree watching the Robinson house, where in the driveway, Elaine is getting into the Robinson car, and Mr. Robinson is putting Elaine's luggage into the car. Mrs. Robinson stands at the door as Mr. Robinson gets into the car and starts it, and the car drives down the driveway and down the street. Ben, dressed differently again, sits in a chair by his desk writing. On the piece of paper is written: DEAR ELAINE, ELAINE, ELAINE, ELAINE, and her name several dozen times. He stops and looks up. It is early morning. A swinging door is pushed open to reveal Mr. Braddock, dressed in a bathrobe, standing at the kitchen counter by the window through which an orange tree can be seen, while Ben stands inside the door. Mr. Braddock starts to smile. Ben is driving his car, and on the empty campus, dressed carefully in his black suit, he sits on a bench in the quadrangle outside of Wendell Hall. The quadrangle and the area around him fill up with students; walking, talking, hurrying to class, strolling, sitting, reading, handing out petitions, etc. Elaine comes out carrying her books and walks in Ben's direction, approaching from the distance. As she walks, she is joined by another girl with whom she converses, and as they approach, they are joined by a tall boy with a beard. He starts toward them, falters, straightens himself, and Mr. McCleery stops and turns, almost causing Ben to run into him. Mr. McCleery takes a couple of steps up, Ben following, and stops again before taking a couple more steps and stopping once more. He looks at Ben searchingly, then turns and continues up the stairs and down the hall. The lady sitting next to Elaine looks at her, turns around and looks at Ben, then looks at Elaine again.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Mrs. Robinson's visage emerges in the fissure in the entrance at Elaine's shoulder, and Elaine gazes from Ben's visage to the fissure through which she can discern her mother's eyes glaring. She advances toward him as though to strike him, and Elaine slams the entrance shut. Mrs. Robinson stands at the extremity of it, gazing at Ben, and he gazes at her in dread. She becomes further and further distant as though it is a very lengthy corridor in a very terrible nightmare. Ben sits cross-legged on his bunk in the gloom, his back against the aquarium, smoking. Ben drives by in his automobile and gazes at the dwelling. Dressed differently, Ben stands by the window overlooking the backyard, and over his shoulder, Mr. Braddock is observed down by the pool, dressed in a sweater, cleansing the pool with a long-handled net. Mr. Braddock gazes up at Ben's window, and Ben moves aside. Ben is standing behind a tree watching the Robinson dwelling, where in the driveway, Elaine is getting into the Robinson automobile, and Mr. Robinson is placing Elaine's baggage into the automobile. Mrs. Robinson stands at the entrance as Mr. Robinson gets into the automobile and starts it, and the automobile drives down the driveway and down the street. Ben, dressed differently again, sits in a chair by his desk inscribing. On the piece of paper is inscribed: DEAR ELAINE, ELAINE, ELAINE, ELAINE, and her name numerous dozen times. He halts and gazes up. It is early dawn. A swinging entrance is pushed open to disclose Mr. Braddock, dressed in a bathrobe, standing at the kitchen counter by the window through which an orange tree can be discerned, while Ben stands inside the entrance. Mr. Braddock starts to grin. Ben is driving his automobile, and on the vacant campus, dressed meticulously in his black suit, he sits on a seat in the quadrangle outside of Wendell Hall. The quadrangle and the vicinity around him populate with pupils; walking, conversing, hurrying to class, strolling, sitting, reading, distributing petitions, etc. Elaine emerges carrying her tomes and walks in Ben's direction, approaching from the expanse. As she walks, she is joined by another lass with whom she converses, and as they approach, they are joined by a tall youth with a beard. He starts toward them, hesitates, straightens himself, and Mr. McCleery halts and turns, almost causing Ben to collide into him. Mr. McCleery takes a couple of steps upward, Ben following, and halts again before taking a couple more steps and halting once more. He gazes at Ben searchingly, then turns and continues up the stairs and down the corridor. The lady sitting next to Elaine gazes at her, turns around and gazes at Ben, then gazes at Elaine again."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Mrs. Robinson's face is seen by Elaine in the crack in the door at her shoulder, and Elaine's gaze shifts from Ben's face to the crack through which her mother's eyes are staring. She is moved toward him as though to hit him, and the door is slammed shut by Elaine. Mrs. Robinson is standing at the end of it, looking at Ben, and she is looked at in horror by him. She is seen getting further and further away as though it is a very long hall in a very bad dream. Ben is sitting cross-legged on his bed in the dark, his back against the fish tank, smoking. The house is looked at by Ben as he drives by in his car. Dressed differently, Ben stands by the window overlooking the backyard, and down by the pool, Mr. Braddock is cleaning the pool with a long-handled scoop while a sweater is being worn by him. Ben's window is looked up at by Mr. Braddock, and Ben moves aside. A tree is stood behind by Ben watching the Robinson house, where in the driveway, Elaine gets into the Robinson car, and Elaine's luggage is put into the car by Mr. Robinson. Mrs. Robinson is standing at the door as Mr. Robinson gets into the car and starts it, and the driveway and street are driven down by the car. Ben, dressed differently again, sits in a chair by his desk writing. On the piece of paper, he writes: DEAR ELAINE, ELAINE, ELAINE, ELAINE, and her name several dozen times. He stops and looks up. It is early morning. A swinging door is opened by Mr. Braddock, dressed in a bathrobe, standing at the kitchen counter by the window through which an orange tree is seen, while Ben is inside the door. A smile is started by Mr. Braddock. Ben drives his car, and on the empty campus, dressed carefully in his black suit, he sits on a bench in the quadrangle outside of Wendell Hall. The quadrangle and the area around him are filled up with students; walking, talking, hurrying to class, strolling, sitting, reading, handing out petitions, etc. Elaine comes out carrying her books and walks in Ben's direction, approaching from the distance. As she walks, another girl joins her, with whom she converses, and as they approach, a tall boy with a beard joins them. He starts toward them, falters, straightens himself, and Mr. McCleery stops and turns, almost running into Ben. A couple of steps up are taken by Mr. McCleery, Ben following, and he stops again before taking a couple more steps and stopping once more. He looks at Ben searchingly, then turns and continues up the stairs and down the hall. The lady sitting next to Elaine looks at her, turns around and looks at Ben, then looks at Elaine again."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Mrs. Robinson's face appears in the door crack at Elaine's shoulder, and Elaine glances from Ben to her mother's staring eyes. She moves as if to strike him, and Elaine slams the door. Mrs. Robinson stands at the end, looking at Ben, who is horrified. She seems to recede as if in a long, nightmarish hallway. Ben sits cross-legged on his bed in the dark, leaning against the fish tank and smoking. In his car, Ben drives by the house. Dressed differently, he stands by the window overlooking the backyard, with Mr. Braddock by the pool, cleaning it. Mr. Braddock looks up, and Ben moves aside. Behind a tree, Ben watches the Robinson house; Elaine gets into the car as Mr. Robinson loads her luggage. Mrs. Robinson stands in the doorway as Mr. Robinson starts the car, which drives away. Ben, in a different outfit, sits by his desk writing: DEAR ELAINE, ELAINE, ELAINE, repeatedly, then stops and looks up. In the early morning, a swinging door reveals Mr. Braddock in a bathrobe at the kitchen counter, with an orange tree visible outside, as Ben stands in the doorway. Mr. Braddock begins to smile. Ben, carefully dressed in his black suit, sits on a bench in the empty campus quadrangle outside Wendell Hall. The area fills with students walking, talking, and hurrying to class. Elaine approaches with books, joining another girl and a tall, bearded boy. Ben starts toward them, falters, and straightens. Mr. McCleery nearly collides with Ben, then climbs the steps with Ben following. He stops and looks at Ben before continuing up the stairs and down the hall. A lady sitting next to Elaine glances from Elaine to Ben and back again."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Mrs. Robinson peers through a door crack near Elaine's shoulder. Elaine looks at Ben, then the crack, seeing her mother's eyes. As Elaine moves to hit Ben, she shuts the door. Mrs. Robinson observes Ben in horror, seemingly distant, like in a nightmare. Ben smokes cross-legged in his dark room. He drives by the house, then stands by a window as Mr. Braddock cleans the pool. Mr. Braddock notices Ben, who then hides. Later, Ben watches the Robinson house as Elaine enters a car with her luggage, driven away by Mr. Robinson, while Mrs. Robinson watches. Ben, in different attire, writes \"DEAR ELAINE\" repeatedly. Morning reveals Mr. Braddock in a bathrobe at the kitchen counter. Ben, dressed in black, sits on a campus bench as students fill the quadrangle. Elaine, books in hand, approaches with friends. Ben hesitates, almost runs into Mr. McCleery, and follows him briefly. Mr. McCleery stops, examines Ben, and continues. A lady beside Elaine notices, exchanging looks between Elaine and Ben."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Mrs. Robinson’s face emerges hesitantly in the small crack in the door near Elaine's shoulder. Elaine shifts her gaze from Ben’s expression to the narrow opening, through which she can discern her mother’s eyes fixedly staring. With a sudden motion, she advances toward Ben as if she intends to strike him, and Elaine forcefully slams the door shut. Standing at the doorway, Mrs. Robinson gazes intently at Ben, who in return, looks at her with an expression of horror etched across his face. She seems to recede further and further away from him, as if she is at the end of an interminably long hall in a disturbingly vivid nightmare. Meanwhile, Ben sits cross-legged on his bed enveloped in darkness, with his back resting against the fish tank, quietly smoking. \n\nAs Ben drives by in his car, he casts a glance at the house. He later appears, dressed in a different attire, standing by the window that overlooks the backyard. Over his shoulder, Mr. Braddock is visible down by the pool, dressed casually in a sweater, diligently cleaning the pool with a long-handled scoop. Mr. Braddock glances upward in the direction of Ben’s window, prompting Ben to move aside cautiously. \n\nBen is then depicted standing behind a tree, intently watching the Robinson house. In the driveway, Elaine steps into the Robinson car, while Mr. Robinson methodically places her luggage into the vehicle. Nearby, Mrs. Robinson stands at the door, observing as Mr. Robinson enters the car and starts it, driving down the driveway and eventually disappearing down the street. Soon after, Ben, dressed differently once more, is seen sitting in a chair by his desk, fully absorbed in writing. The paper before him has the words: DEAR ELAINE, ELAINE, ELAINE, ELAINE written out, her name scrawled several dozen times. He pauses, momentarily lost in thought, and looks upward. It is early morning. \n\nA swinging door softly swings open to reveal Mr. Braddock, clad in a bathrobe, standing at the kitchen counter by the window, through which an orange tree is visible. Ben stands inside the door. Mr. Braddock begins to smile warmly. Ben is then driving his car, and on the empty campus, dressed meticulously in his black suit, he takes a seat on a bench situated in the quadrangle outside of Wendell Hall. Gradually, the quadrangle and the surrounding area become filled with students; they walk briskly, talk animatedly, hurry to their classes, stroll leisurely, sit while reading, or distribute petitions, carrying on with their day. \n\nElaine emerges, carrying her stack of books and walks purposefully in Ben’s direction, approaching steadily from a distance. While walking, she is joined by another girl, with whom she engages in conversation. As they draw nearer, a tall boy with a beard joins them. He moves toward them but hesitates momentarily, then straightens himself, only to have Mr. McCleery pause and turn, almost resulting in Ben colliding into him. Mr. McCleery takes a few steps upward, with Ben close behind, halting once again before climbing a couple more steps and stopping yet again. He scrutinizes Ben intently, then turns away and continues his path up the stairs and along the hall. A woman seated next to Elaine glances at her, then turns her attention to Ben, before looking back at Elaine once more."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Mrs. Robinson’s face slowly and cautiously emerges in the small crack in the door located near Elaine's shoulder. Elaine, shifting her gaze from Ben's expression, moves her attention to the narrow opening, through which she can distinctly discern her mother’s eyes intensely fixed upon the scene. With a sudden and swift motion, Elaine advances towards Ben, appearing as though she might strike him, and in a decisive action, she forcefully slams the door shut. Standing firmly at the doorway, Mrs. Robinson continues to gaze intently at Ben, who, in return, looks back at her with a blatant expression of horror etched deeply across his face. She appears to recede further and further away from him, as if standing at the end of an interminably long hall, one that seems right out of a disturbingly vivid nightmare. Meanwhile, Ben sits cross-legged on his bed, enveloped in darkness with the shadows surrounding him, his back resting against the cool surface of the fish tank, quietly and contemplatively smoking.\n\nAs Ben drives by in his car, he takes a moment to cast a glance at the familiar house. Later, he reappears, dressed in a different outfit, standing pensively by the window that provides a view of the backyard. Over his shoulder, Mr. Braddock becomes visible, down by the pool, dressed for comfort in a casual sweater, diligently cleaning the pool with a long-handled scoop. Mr. Braddock glances upward in the direction of Ben’s window, prompting Ben to step aside cautiously and quietly, so as not to be seen.\n\nBen is then portrayed standing with intent focus behind a tree, watching the Robinson house vigilantly. In the driveway, Elaine steps into the Robinson car, while Mr. Robinson methodically and carefully places her luggage into the vehicle. Nearby, Mrs. Robinson stands at the door, observing intently as Mr. Robinson enters the car and starts the engine, driving down the driveway and eventually disappearing down the street. Soon after the car departs, Ben, dressed differently once more, is depicted sitting in a chair by his desk, wholly absorbed in the act of writing. The paper before him is filled with the words: DEAR ELAINE, ELAINE, ELAINE, ELAINE scrawled out, her name repeated several dozen times. He pauses, temporarily lost in a deep thought, and looks upward. The scene is set in the early morning light.\n\nA swinging door gently glides open to reveal Mr. Braddock, clad in a bathrobe, standing comfortably at the kitchen counter by the window, through which an orange tree is clearly visible. Ben stands just inside the door. Mr. Braddock begins to smile warmly and invitingly. Ben is then depicted driving his car, and on the empty campus, impeccably dressed in his black suit, he takes a solitary seat on a bench situated in the quadrangle outside of Wendell Hall. Gradually, the quadrangle, along with the surrounding area, becomes filled with students; they walk briskly, talk animatedly, hurry to attend their classes, stroll leisurely, sit while immersed in reading, or diligently distribute petitions, carrying on energetically with their day.\n\nElaine emerges into view, carrying a stack of books and walking purposefully in Ben’s direction, approaching steadily from the distance. While walking, she is joined by another girl, with whom she engages in lively conversation. As they draw nearer, a tall boy with a beard joins their group. He moves toward them but hesitates momentarily, then straightens himself, only to have Mr. McCleery pause and turn, almost resulting in Ben colliding into him. Mr. McCleery takes a few steps upward, with Ben close behind, halting once again before climbing a couple more steps and stopping yet again. He scrutinizes Ben closely, then turns away and continues his path up the stairs and along the hall. A woman seated next to Elaine glances at her, then turns her attention to Ben, before looking back at Elaine once more, observing the silent exchange."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Mrs. Robinson's face slowly emerges into the narrow gap of the doorway, appearing just behind Elaine's shoulder. Elaine's gaze shifts from Ben’s expression to the slender opening in the door, where her mother's eyes are visible, intensely fixed on the scene. Feeling a surge of determination, Elaine makes a brisk move towards Ben as if intending to strike him. In a swift, decisive action, she slams the door shut. Outside, Mrs. Robinson stands at the door's edge, her gaze firmly locked on Ben, and he returns her look with an expression of pure horror. In an unsettling transformation, Mrs. Robinson seems to recede gradually, as if the hallway has elongated into the surreal, dreamlike distance of a nightmare. Meanwhile, inside a dimly lit room, Ben sits cross-legged on his bed, his back resting against the solid, cool surface of the fish tank, a cigarette casually emitting curls of smoke between his fingers. Transitioning scenes, Ben drives past in his car, casting a contemplative glance at a familiar house. Time passes, and Ben, now dressed in a different outfit, stands pensively by his window, gazing out over the backyard. Behind him, over his shoulder, Mr. Braddock is visible by the pool, casually attired in a sweater, methodically cleaning the water with a long-handled scoop. At one moment, Mr. Braddock glances upwards toward Ben's window, prompting Ben to shuffle aside. In another setting, Ben is discreetly stationed behind a tree, surreptitiously observing the Robinson residence. In the driveway below, Elaine prepares to enter the Robinson family car, while Mr. Robinson attentively loads her luggage into the vehicle. From the doorway, Mrs. Robinson watches as Mr. Robinson enters the driver’s seat, starts the engine, and the car begins its descent down the driveway and into the street beyond. Again, in a different attire, Ben sits thoughtfully in a chair at his desk, immersed in writing. On the sheet of paper before him, the words \"DEAR ELAINE\" are inscribed, followed by \"ELAINE, ELAINE, ELAINE,\" repeated several dozen times, covering the page. His pen eventually pauses, and he lifts his eyes pensively from his writing. As the early morning light filters in, a swinging door is gently pushed open, revealing Mr. Braddock, standing comfortably in a bathrobe by the kitchen counter, through which an orange tree can be seen flourishing outside the window. Meanwhile, Ben stands just within the doorway, and as Mr. Braddock turns, he begins to smile. Shifting locations once more, Ben drives along, and upon reaching an empty campus, he carefully exits his car. Dressed meticulously in a black suit, he sits on a bench in the quadrangle outside Wendell Hall. Gradually, the quadrangle and surrounding area fill with students engaging in a variety of activities—walking briskly, conversing animatedly, hurrying to class, leisurely strolling, absorbed in reading, and energetically handing out petitions. From a distance, Elaine appears, holding her books as she moves confidently in Ben's direction. As she walks, another girl joins her, and they converse animatedly. Their conversation is soon joined by a tall boy with a beard. Steeling himself, Ben begins to move toward them but suddenly hesitates, collecting himself before pressing forward once more. At that moment, Mr. McCleery unexpectedly stops and turns, almost causing Ben to collide with him. Mr. McCleery takes a couple of steps forward with Ben following closely behind, pauses, and then resumes, repeating this pattern of stopping and continuing, each time casting a searching glance at Ben before finally turning away and proceeding up the stairs and down the hall. As all this unfolds, a lady seated near Elaine in class looks at her, shifts her attention to Ben, then returns her gaze to Elaine, a curious look crossing her face."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Mrs. Robinson's eyes peer through the door crack above Elaine's shoulder. Elaine shifts her gaze between Ben and her mother's eyes before abruptly shutting the door. As Mrs. Robinson remains at the door, Ben, horrified, perceives her distancing, as if in a nightmarish long hallway. Later, Ben sits cross-legged on his bed in the dark, smoking with his back against the fish tank. He drives past the house, then appears differently dressed by the window overseeing the backyard, where Mr. Braddock, in a sweater, cleans the pool. Upon noticing Mr. Braddock's glance, Ben moves aside. Observing from behind a tree, Ben watches as Elaine enters the Robinson's car while Mr. Robinson loads her luggage. Mrs. Robinson stands at the door as Mr. Robinson drives away. In different attire, Ben sits at his desk, repetitively writing \"DEAR ELAINE\" on paper before pausing. Early in the morning, Mr. Braddock, in a bathrobe, stands in the kitchen near a window with an orange tree visible outside, smiling as Ben appears at the door. Ben drives to the empty campus, meticulously dressed in a black suit, and sits on a bench as the quadrangle fills with bustling students. Elaine approaches with books in hand, joined by a girl and a bearded boy. Ben hesitates, then straightens himself as Mr. McCleery nearly collides with him. Mr. McCleery proceeds up the stairs with Ben following closely, pausing repeatedly before turning to scrutinize Ben, then continuing down the hallway. Meanwhile, a woman next to Elaine glances at both her and Ben, alternating her gaze between them."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Mrs. Robinson's face appears in the crack in the door at Elaine's shoulder, and Elaine looks from Ben's face to the crack through which she can see her mother's eyes, with a gaze filled with both suspicion and concern, staring. She moves toward him as though to hit him, and Elaine, in a moment of decision influenced by mixed emotions, slams the door shut. Mrs. Robinson stands at the end of it, looking at Ben, and he looks at her with horror recalling past confrontations. She gets further and further away as though it is a very long hall, reminiscent of the surreal, elongated corridors in a very bad dream. Ben sits cross-legged on his bed in the dark, his back against the fish tank where colorful exotic fish swim idly, smoking a cigarette that burns dimly in the room. Ben drives by in his classic convertible, a symbol of his carefree yet complicated life, and looks at the house imbued with memories. Dressed differently to reflect perhaps a change in mood or intention, Ben stands by the window overlooking the backyard, and over his shoulder, Mr. Braddock is seen down by the pool, dressed in a sweater against the morning chill, cleaning the pool methodically with a long-handled scoop. Mr. Braddock looks up at Ben's window, catching a glimpse of his pensive son, and Ben moves aside, avoiding further scrutiny. Ben is standing behind a tree, a convenient cover for his watchful presence, watching the Robinson house, where in the driveway, Elaine is getting into the Robinson car, and Mr. Robinson, with a father's reluctance, is putting Elaine's luggage into the car. Mrs. Robinson stands at the door, her presence as imposing as ever, as Mr. Robinson gets into the car and starts it, and the car drives down the driveway and down the street lined with blooming jacarandas. Ben, dressed differently again as if trying to remake his image, sits in a chair by his desk writing feverishly. On the piece of paper is written: DEAR ELAINE, ELAINE, ELAINE, ELAINE, and her name several dozen times, capturing his obsessive longing. He stops and looks up. It is early morning, the sun casting a golden hue through the window. A swinging door is pushed open to reveal Mr. Braddock, dressed in a bathrobe, standing at the kitchen counter by the window through which an orange tree, a symbol of California's abundant produce, can be seen, while Ben stands inside the door. Mr. Braddock starts to smile, in a gesture of fatherly understanding. Ben is driving his car, and on the empty campus of the university known for its sprawling lawns, dressed carefully in his black suit indicative of his serious resolve, he sits on a bench in the quadrangle outside of Wendell Hall, a well-known meeting spot for students. The quadrangle and the area around him fill up with students; walking, talking, hurrying to class, strolling, sitting, reading, handing out petitions reflecting the political activism of the era, etc. Elaine comes out carrying her books, academic symbols of her scholarly aspirations, and walks in Ben's direction, approaching from the distance. As she walks, she is joined by another girl, likely a close friend, with whom she converses, and as they approach, they are joined by a tall boy with a beard, reflecting the casual student fashion of the time. He starts toward them, falters in his step as if battling inner hesitation, straightens himself, and Mr. McCleery, a well-regarded professor at the institution, stops and turns, almost causing Ben to run into him. Mr. McCleery takes a couple of steps up, Ben following with cautious intention, and stops again before taking a couple more steps and stopping once more. He looks at Ben searchingly, then turns and continues up the stairs and down the hall, his figure disappearing into the bustling academic environment. The lady sitting next to Elaine looks at her, turns around and looks at Ben, then looks at Elaine again, her gaze filled with curiosity and perhaps a hint of gossip."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "He looks at Ben searchingly then turns and continues up the stairs and down the hall Mrs Robinson's face appears in the crack in the door at Elaine's shoulder and Elaine looks from Ben's face to the crack through which she can see her mother's eyes staring Mrs Robinson's face appears in the crack in the door at Elaine's shoulder and Elaine looks from Ben's face to the crack through which she can see her mother's eyes staring She moves toward him as though to hit him and Elaine slams the door shut Mrs Robinson stands at the end of it looking at Ben and he looks at her in horror She gets further and further away as though it is a very long hall in a very bad dream Ben sits crosslegged on his bed in the dark his back against the fish tank smoking Ben drives by in his car and looks at the house he sits on a bench in the quadrangle outside of Wendell Hall Ben following and stops again before taking a couple more steps and stopping once more She gets further and further away as though it is a very long hall in a very bad dream A swinging door is pushed open to reveal Mr Braddock dressed in a bathrobe standing at the kitchen counter by the window through which an orange tree can be seen while Ben stands inside the door Dressed differently It is early morning Ben stands by the window overlooking the backyard and over his shoulder Mr Braddock is seen down by the pool dressed in a sweater cleaning the pool with a longhandled scoop As she walks she is joined by another girl with whom she converses and as they approach they are joined by a tall boy with a beard Mr Braddock looks up at Ben's window and Ben moves aside Ben stands by the window overlooking the backyard and over his shoulder She moves toward him as though to hit him and Elaine slams the door shut Ben is standing behind a tree watching the Robinson house where in the driveway Elaine is getting into the Robinson car and Mr Robinson is putting Elaine's luggage into the car Mrs Robinson stands at the door as Mr Robinson gets into the car and starts it and the car drives down the driveway and down the street Ben sits crosslegged on his bed in the dark his back against the fish tank smoking Ben dressed differently again sits in a chair by his desk writing On the piece of paper is written On the piece of paper is written DEAR ELAINE ELAINE ELAINE ELAINE and her name several dozen times He stops and looks up It is early morning A swinging door is pushed open to reveal Mr Braddock dressed in a bathrobe standing at the kitchen counter by the window through which an orange tree can be seen while Ben stands inside the door Mr Braddock starts to smile Mrs Robinson stands at the end of it looking at Ben and he looks at her in horror Ben is driving his car and on the empty campus dressed carefully in his black suit he sits on a bench in the quadrangle outside of Wendell Hall The quadrangle and the area around him fill up with students walking talking hurrying to class strolling sitting reading handing out petitions etc Mr Braddock is seen down by the pool dressed in a sweater cleaning the pool with a longhandled scoop Mr McCleery takes a couple of steps up Elaine comes out carrying her books and walks in Ben's direction approaching from the distance As she walks she is joined by another girl with whom she converses and as they approach they are joined by a tall boy with a beard He starts toward them falters straightens himself and Mr McCleery stops and turns almost causing Ben to run into him Mr McCleery takes a couple of steps up Ben following and stops again before taking a couple more steps and stopping once more He looks at Ben searchingly then turns and continues up the stairs and down the hall The lady sitting next to Elaine looks at her turns around and looks at Ben then looks at Elaine again"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Mrs Robinson's face appears in the crack in the door at Elaine's shoulder and Elaine looks from Ben's face to the crack through which she can see her mother's eyes staring. She moves toward him as though to hit him and Elaine slams the door shut. Mrs Robinson stands at the end of it looking at Ben and he looks at her in horror. She gets further and further away as though it is a very long hall in a very bad dream. Ben sits crosslegged on his bed in the dark his back against the fish tank smoking. Ben drives by in his car and looks at the house. Dressed differently. Ben stands by the window overlooking the backyard and over his shoulder. Mr Braddock is seen down by the pool dressed in a sweater cleaning the pool with a longhandled scoop. Mr Braddock looks up at Ben's window and Ben moves aside. Ben is standing behind a tree watching the Robinson house where in the driveway Elaine is getting into the Robinson car and Mr Robinson is putting Elaine's luggage into the car. Mrs Robinson stands at the door as Mr Robinson gets into the car and starts it and the car drives down the driveway and down the street. Ben dressed differently again sits in a chair by his desk writing. On the piece of paper is written. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. DEAR ELAINE ELAINE ELAINE ELAINE and her name several dozen times. He stops and looks up. It is early morning. A swinging door is pushed open to reveal Mr Braddock dressed in a bathrobe standing at the kitchen counter by the window through which an orange tree can be seen while Ben stands inside the door. Mr Braddock starts to smile. Ben is driving his car and on the empty campus dressed carefully in his black suit. he sits on a bench in the quadrangle outside of Wendell Hall. The quadrangle and the area around him fill up with students walking talking hurrying to class strolling sitting reading handing out petitions etc. Elaine comes out carrying her books and walks in Ben's direction approaching from the distance. As she walks she is joined by another girl with whom she converses and as they approach they are joined by a tall boy with a beard. He starts toward them falters straightens himself and Mr McCleery stops and turns almost causing Ben to run into him. Mr McCleery takes a couple of steps up. Ben following and stops again before taking a couple more steps and stopping once more. He looks at Ben searchingly then turns and continues up the stairs and down the hall. The lady sitting next to Elaine looks at her turns around and looks at Ben then looks at Elaine again."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Mrs Robinson's face appears in the crack in the door at Elaine's shoulder and Elaine looks from Ben's face to the crack through which she can see her mother's eyes staring. She moves toward him as though to hit him and Elaine slams the door shut. Mrs Robinson stands at the end of it looking at Ben and he looks at her in horror. She gets further and further away as though it is a very long hall in a very bad dream. Ben sits crosslegged on his bed in the dark his back against the fish tank smoking. Ben drives by in his car and looks at the house. Dressed differently. Ben stands by the window overlooking the backyard and over his shoulder. Mr Braddock is seen down by the pool dressed in a sweater cleaning the pool with a longhandled scoop. Mr Braddock looks up at Ben's window and Ben moves aside. Ben is standing behind a tree watching the Robinson house where in the driveway Elaine is getting into the Robinson car and Mr Robinson is putting Elaine's luggage into the car. Mrs Robinson stands at the door as Mr Robinson gets into the car and starts it and the car drives down the driveway and down the street. Ben dressed differently again sits in a chair by his desk writing. On the piece of paper is written. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. DEAR ELAINE ELAINE ELAINE ELAINE and her name several dozen times. He stops and looks up. It is early morning. A swinging door is pushed open to reveal Mr Braddock dressed in a bathrobe standing at the kitchen counter by the window through which an orange tree can be seen while Ben stands inside the door. Mr Braddock starts to smile. Ben is driving his car and on the empty campus dressed carefully in his black suit. he sits on a bench in the quadrangle outside of Wendell Hall. The quadrangle and the area around him fill up with students walking talking hurrying to class strolling sitting reading handing out petitions etc. Elaine comes out carrying her books and walks in Ben's direction approaching from the distance. As she walks she is joined by another girl with whom she converses and as they approach they are joined by a tall boy with a beard. He starts toward them falters straightens himself and Mr McCleery stops and turns almost causing Ben to run into him. Mr McCleery takes a couple of steps up. Ben following and stops again before taking a couple more steps and stopping once more. He looks at Ben searchingly then turns and continues up the stairs and down the hall. The lady sitting next to Elaine looks at her turns around and looks at Ben then looks at Elaine again."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Mrs Robinson's face appears in the crack in the door at Elaine's shoulder and Elaine looks from Ben's face to the crack through which she can see her mother's eyes staring. She moves toward him as though to hit him and Elaine slams the door shut. Mrs Robinson stands at the end of it looking at Ben and he looks at her in horror. She gets further and further away as though it is a very long hall in a very bad dream. Ben sits crosslegged on his bed in the dark his back against the fish tank smoking. Ben drives by in his car and looks at the house. Dressed differently. The quadrangle and the area around him fill up with students walking talking hurrying to class strolling sitting reading handing out petitions etc. Elaine comes out carrying her books and walks in Ben's direction approaching from the distance. As she walks she is joined by another girl with whom she converses and as they approach they are joined by a tall boy with a beard. He starts toward them falters straightens himself and Mr McCleery stops and turns almost causing Ben to run into him. Mr McCleery takes a couple of steps up. Ben following and stops again before taking a couple more steps and stopping once more. He looks at Ben searchingly then turns and continues up the stairs and down the hall. The lady sitting next to Elaine looks at her turns around and looks at Ben then looks at Elaine again."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Mrs Robinson's face appears in the crack in the door at Elaine's shoulder and Elaine looks from Ben's face to the crack through which she can see her mother's eyes staring. She moves toward him as though to hit him and Elaine slams the door shut. Mrs Robinson stands at the end of it looking at Ben and he looks at her in horror. Ben following and stops again before taking a couple more steps and stopping once more. He looks at Ben searchingly then turns and continues up the stairs and down the hall. The lady sitting next to Elaine looks at her turns around and looks at Ben then looks at Elaine again."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Mrs. Smith's face appears in the crack in the door at Laura's shoulder, and Laura looks from Mike's face to the crack through which she can see her aunt's eyes staring. She moves toward him as though to hit him, and Laura slams the door shut. Mrs. Smith stands at the end of it, looking at Mike, and he looks at her in horror. She gets further and further away as though it is a very long hall in a very bad dream. Mike sits cross-legged on his bed in the dark, his back against the fish tank, smoking. Jake drives by in his car and looks at the house. Dressed differently, Jake stands by the window overlooking the backyard, and over his shoulder, Mr. Kelly is seen down by the pool, dressed in a sweater, cleaning the pool with a long-handled scoop. Mr. Kelly looks up at Jake's window, and Jake moves aside. Jake is standing behind a tree watching the Smith house, where in the driveway, Laura is getting into the Smith car, and Mr. Johnson is putting Laura's luggage into the car. Mrs. Smith stands at the door as Mr. Johnson gets into the car and starts it, and the car drives down the driveway and down the street. Jake, dressed differently again, sits in a chair by his desk writing. On the piece of paper is written: DEAR LAURA, LAURA, LAURA, LAURA, and her name several dozen times. He stops and looks up. It is early morning. A swinging door is pushed open to reveal Mr. Kelly, dressed in a bathrobe, standing at the kitchen counter by the window through which an orange tree can be seen, while Jake stands inside the door. Mr. Kelly starts to smile. Jake is driving his car, and on the empty campus, dressed carefully in his black suit, he sits on a bench in the quadrangle outside of Franklin Hall. The quadrangle and the area around him fill up with students; walking, talking, hurrying to class, strolling, sitting, reading, handing out petitions, etc. Laura comes out carrying her books and walks in Jake's direction, approaching from the distance. As she walks, she is joined by another girl with whom she converses, and as they approach, they are joined by a tall boy with a beard. He starts toward them, falters, straightens himself, and Mr. Thompson stops and turns, almost causing Jake to run into him. Mr. Thompson takes a couple of steps up, Jake following, and stops again before taking a couple more steps and stopping once more. He looks at Jake searchingly, then turns and continues up the stairs and down the hall. The lady sitting next to Laura looks at her, turns around and looks at Jake, then looks at Laura again."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Mrs. Robinson's face appears in the gap in the curtain at Elaine's shoulder, and Elaine looks from Ben's face to the gap through which she can see her mother's eyes staring. She moves toward him as though to hit him, and Elaine pulls the curtain shut. Mrs. Robinson stands at the end of it, looking at Ben, and he looks at her in horror. She gets further and further away as though it is a very long corridor in a very bad dream. Ben sits cross-legged on his couch in the dark, his back against the bookcase, smoking. Ben drives by in his scooter and looks at the apartment. Dressed differently, Ben stands by the mirror overlooking the garden, and over his shoulder, Mr. Braddock is seen down by the fountain, dressed in a hoodie, cleaning the fountain with a long-handled net. Mr. Braddock looks up at Ben's mirror, and Ben moves aside. Ben is standing behind a bush watching the Robinson apartment, where in the driveway, Elaine is getting into the Robinson bike, and Mr. Robinson is putting Elaine's backpack into the bike. Mrs. Robinson stands at the door as Mr. Robinson gets onto the bike and starts it, and the bike rolls down the driveway and down the street. Ben, dressed differently again, sits in a chair by his bookshelf writing. On the piece of parchment is written: DEAR ELAINE, ELAINE, ELAINE, ELAINE, and her name several dozen times. He stops and looks up. It is early afternoon. A revolving door is pushed open to reveal Mr. Braddock, dressed in a trench coat, standing at the kitchen island by the window through which a rose bush can be seen, while Ben stands inside the door. Mr. Braddock starts to grin. Ben is driving his scooter, and on the empty courtyard, dressed carefully in his gray suit, he sits on a stool in the amphitheater outside of Wendell Library. The amphitheater and the area around him fill up with students; walking, chatting, hurrying to class, wandering, sitting, sketching, handing out leaflets, etc. Elaine comes out carrying her folders and walks in Ben's direction, approaching from the distance. As she walks, she is joined by another girl with whom she converses, and as they approach, they are joined by a tall boy with a cap. He starts toward them, falters, straightens himself, and Mr. McCleery stops and turns, almost causing Ben to run into him. Mr. McCleery takes a couple of steps up, Ben following, and stops again before taking a couple more steps and stopping once more. He looks at Ben inquisitively, then turns and continues up the ladder and down the corridor. The lady sitting next to Elaine looks at her, turns around and looks at Ben, then looks at Elaine again."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Mrs. Robinson's face appears in the crack in the door at Elaine's shoulder, and Elaine glances from Ben's face to the crack through which she can see her mother's eyes blinking. She drifts toward him as though to hug him, and Elaine pulls the door shut. Mrs. Robinson waits at the end of it, staring at Ben, and he glances at her in confusion. She drifts further and further away as though it is a very long hall in a very strange dream. Ben lounges cross-legged on his bed in the dark, his back against the fish tank, humming. Ben cruises by in his car and gazes at the house. Dressed differently, Ben paces by the window overlooking the backyard, and over his shoulder, Mr. Braddock is seen down by the pool, dressed in a sweater, sketching the pool with a long-handled net. Mr. Braddock peers up at Ben's window, and Ben shifts aside. Ben is hiding behind a tree observing the Robinson house, where in the driveway, Elaine is climbing into the Robinson car, and Mr. Robinson is lifting Elaine's luggage into the car. Mrs. Robinson leans against the door as Mr. Robinson climbs into the car and ignites it, and the car rolls down the driveway and down the street. Ben, dressed differently again, reclines in a chair by his desk doodling. On the piece of paper is scrawled: DEAR ELAINE, ELAINE, ELAINE, ELAINE, and her name several dozen times. He pauses and gazes up. It is early morning. A swinging door sways open to uncover Mr. Braddock, dressed in a bathrobe, standing at the kitchen counter by the window through which an orange tree can be spotted, while Ben lounges inside the door. Mr. Braddock begins to chuckle. Ben is cruising in his car, and on the empty campus, dressed carefully in his black suit, he reclines on a bench in the quadrangle outside of Wendell Hall. The quadrangle and the area around him fill up with students; wandering, chatting, rushing to class, meandering, lounging, writing, handing out flyers, etc. Elaine emerges carrying her books and strolls in Ben's direction, approaching from the distance. As she proceeds, she meets another girl with whom she chats, and as they approach, they are joined by a tall boy with a beard. He trudges toward them, stumbles, steadies himself, and Mr. McCleery pauses and pivots, almost leading Ben to bump into him. Mr. McCleery meanders a couple of steps up, Ben trailing, and pauses again before meandering a couple more steps and halting once more. He glances at Ben thoughtfully, then turns and proceeds up the stairs and down the hall. The lady seated next to Elaine glances at her, swivels around and regards Ben, then glances at Elaine again."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Mr. Thompson's mitten appears in the crack in the fridge at Samantha's ankle, and Samantha looks from Max's mitten to the crack through which she can see her uncle's buttons staring. She moves toward it as though to tickle it, and Samantha slams the fridge shut. Mr. Thompson stands at the end of it, looking at Max, and it looks at her in disbelief. She gets further and further away as though it is a very tall mountain in a very strange adventure. Max sits cross-legged on its hammock in the dark, its back against the bookshelf, painting. Max floats by in its canoe and looks at the lighthouse. Dressed differently, Max stands by the curtain overlooking the alley, and over its elbow, Dr. Stewart is seen down by the fountain, dressed in a jacket, sweeping the fountain with a golden broom. Dr. Stewart looks up at Max's curtain, and Max moves aside. Max is standing behind a shrub watching the Thompson lighthouse, where in the field, Samantha is getting into the Thompson bicycle, and Mr. Thompson is putting Samantha's marbles into the bicycle. Mr. Thompson stands at the curtain as Mr. Thompson gets into the bicycle and starts it, and the bicycle rolls down the field and down the lane. Max, dressed differently again, sits in a hammock by its lamp scribbling. On the piece of cardboard is scribbled: DEAR SAMANTHA, SAMANTHA, SAMANTHA, SAMANTHA, and its name several dozen times. It stops and looks up. It is early noon. A sliding curtain is pushed open to reveal Dr. Stewart, dressed in a hoodie, standing at the wash basin by the curtain through which a daffodil can be seen, while Max stands inside the curtain. Dr. Stewart starts to blink. Max is rowing its canoe, and on the vacant airfield, dressed carefully in its orange suit, it sits on a branch in the meadow outside of Harper Pavilion. The meadow and the area around it fill up with turtles; gliding, whispering, rushing to the pond, ambling, lying, dozing, dealing out decks, etc. Samantha comes out carrying her kites and skips in Max's direction, approaching from the horizon. As she skips, she is joined by another turtle with which she whispers, and as they approach, they are joined by a lanky turtle with a beanie. It starts toward them, topples, straightens itself, and Dr. McCleery halts and spins, almost causing Max to stumble into it. Dr. McCleery takes a couple of leaps up, Max trailing, and pauses once more before taking a couple more leaps and pausing again. It peers at Max keenly, then spins and continues up the ladder and down the passage. The dove sitting next to Samantha looks at her, twirls and looks at Max, then looks at Samantha again."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Mr. Johnson's silhouette emerges in the crevice in the curtain at Lisa's elbow, and Lisa gazes from Tom's silhouette to the crevice through which she can see her father's eyes blinking. She drifts toward him as though to embrace him, and Lisa snaps the curtain closed. Mr. Johnson lingers at the edge of it, peering at Tom, and he peers back at him in disbelief. He fades further and further as though it is an endless corridor in a very vivid dream. Tom reclines cross-legged on his couch in the dusk, his back against the bookcase, humming. Tom cycles by on his bike and glares at the apartment. Clothed differently, Tom hovers near the window overlooking the garden, and over his shoulder, Mrs. Smith is spotted down by the pond, wearing a jacket, polishing the pond with a long-handled mop. Mrs. Smith glances up at Tom's window, and Tom steps aside. Tom is lurking behind a bush watching the Johnson residence, where in the driveway, Lisa is stepping into the Johnson van, and Mr. Johnson is arranging Lisa's bags into the van. Mr. Johnson leans at the gate as Mrs. Johnson climbs into the van and operates it, and the van rolls down the driveway and down the avenue. Tom, attired differently once more, lounges in a chair by his table scribbling. On the sheet of paper is penned: DEAR LISA, LISA, LISA, LISA, and her name repeated multiple times. He halts and stares ahead. It is midday. A sliding door is nudged open to disclose Mrs. Smith, clad in a robe, leaning against the dining counter by the window through which an apple tree can be spied, while Tom waits inside the entrance. Mrs. Smith begins to chuckle. Tom is navigating his bike, and on the deserted courtyard, clothed meticulously in his gray suit, he reclines on a bench in the plaza outside of Moore Hall. The plaza and the space around him throng with individuals; sauntering, chattering, rushing to class, meandering, lounging, perusing, distributing flyers, etc. Lisa appears carrying her papers and strides in Tom's course, approaching from afar. As she strides, she is accompanied by another woman with whom she chats, and as they approach, they are accompanied by a tall man with a mustache. He advances toward them, stumbles, composes himself, and Mr. Thompson stops and pivots, nearly causing Tom to bump into him. Mr. Thompson strides a few paces ahead, Tom trailing, and halts yet again before striding a few additional paces and halting anew. He gazes at Tom inquisitively, then swivels and proceeds up the stairs and along the corridor. The gentleman seated beside Lisa gazes at her, rotates and gazes at Tom, then gazes at Lisa once again."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Mrs. Robinson's shadow appears in the crack in the wall at Elaine's elbow, and Elaine glances from Ben's shoes to the gap through which she can see her mother's hands gesturing. She drifts toward him as though to hug him, and Elaine swings the door open. Mrs. Robinson rests at the edge of it, gazing at Ben, and he gazes at her in surprise. She drifts further and further away as though it is a very narrow path in a very cheerful dream. Ben stands cross-legged on his rug in the light, his back against the bookshelf, whistling. Ben cycles by on his motorcycle and glances at the apartment. Clothed differently, Ben leans by the railing overlooking the garden, and over his shoulder, Mr. Braddock is observed down by the fountain, dressed in a jacket, watering the plants with a long-handled hose. Mr. Braddock glances up at Ben's railing, and Ben steps aside. Ben is hiding behind a bush watching the Robinson apartment, where in the parking lot, Elaine is boarding the Robinson bus, and Mr. Robinson is lifting Elaine's backpack into the bus. Mrs. Robinson rests at the window as Mr. Robinson boards the bus and accelerates it, and the bus rolls down the parking lot and around the corner. Ben, clothed differently again, kneels in a corner by his table doodling. On the piece of paper is scribbled: DEAR ELAINE, ELAINE, ELAINE, ELAINE, and her name several dozen times. He pauses and gazes up. It is late afternoon. A revolving door is nudged open to disclose Mr. Braddock, dressed in pajamas, resting at the kitchen table by the window through which an apple tree can be noticed, while Ben leans inside the hallway. Mr. Braddock begins to frown. Ben is pedaling his motorcycle, and on the crowded plaza, dressed haphazardly in his blue jeans, he reclines on a fountain in the quad outside of Wendell Hall. The quad and the zone around him fill up with professors; jogging, muttering, rushing to meetings, wandering, standing, writing, distributing pamphlets, etc. Elaine emerges carrying her laptop and marches in Ben's direction, approaching from the horizon. As she marches, she is joined by another boy with whom she debates, and as they approach, they are joined by a short girl with glasses. He stumbles toward them, hesitates, composes himself, and Mr. McCleery pauses and pivots, almost causing Ben to bump into him. Mr. McCleery leaps a couple of steps up, Ben tagging along, and halts again before taking a couple more leaps and pausing once more. He glances at Ben inquisitively, then pivots and advances up the stairs and through the corridor. The gentleman reclining next to Elaine ponders her, rotates around, and ponders Ben, then ponders Elaine once more."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Mrs. Bananas's hat appears in the gap in the fence by Oliver's elbow, and Oliver glances from Sam's hat to the gap through which he can see his aunt's shoes blinking. He drifts toward her as though to greet her, and Oliver swings the gate closed. Mrs. Bananas lounges at the edge of it, gazing at Sam, and he stares at her in confusion. She gets closer and closer as though it is a very short hallway in a very strange comedy. Sam perches cross-legged on his couch in the light, his feet against the terrarium, eating. Sam flies by in his airplane and gazes at the barn. Dressed fashionably, Sam lounges by the curtain overlooking the meadow, and over his elbow, Mr. Turtleneck is noticed down by the fountain, dressed in a coat, trimming the grass with a short-handled broom. Mr. Turtleneck glances up at Sam's curtain, and Sam moves forward. Sam is hiding behind a bush observing the Bananas shack, where in the courtyard, Oliver is climbing onto the Bananas bicycle, and Mr. Bananas is throwing Oliver's umbrella onto the bicycle. Mrs. Bananas lounges at the fence as Mr. Bananas climbs onto the bicycle and rides it, and the bicycle glides down the courtyard and down the path. Sam, dressed unpredictably again, perches in a hammock by his dresser doodling. On the piece of cardboard is scribbled: DEAR OLIVER, OLIVER, OLIVER, OLIVER, and his name multiple hundred times. He hesitates and gazes forward. It is late afternoon. A revolving curtain is pushed open to reveal Mr. Turtleneck, dressed in pajamas, lounging at the garden bench by the curtain through which a banana tree can be noticed, while Sam lounges inside the curtain. Mr. Turtleneck begins to giggle. Sam is riding his bicycle, and on the crowded playground, dressed casually in his red jacket, he perches on a swing in the playground outside of Lennox Tower. The playground and the area around him fill up with artists; painting, whispering, strolling to lunch, dancing, standing, drawing, handing out balloons, etc. Oliver leaves carrying his instruments and hops in Sam's direction, disappearing into the distance. As he hops, he is joined by another boy with whom he sings, and as they disappear, they are joined by a short girl with a cap. She glides toward them, hesitates, collapses herself, and Mr. Brown stops and spins, nearly prompting Sam to dash into him. Mr. Brown takes a couple of hops down, Sam trailing, and hesitates again before taking a couple more hops and hesitating once more. He gazes at Sam dreamily, then spins and saunters down the ladder and up the meadow. The gentleman lounging next to Oliver giggles at him, spins around and glances at Sam, then giggles at Oliver again."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Elaine looks at Ben and then at her mother's eyes peering through a door crack. She moves to hit him, but Elaine shuts the door. Ben, horrified, watches Mrs. Robinson retreat down a long hall, reminiscent of a nightmare. Later, Ben sits smoking in bed, his back against a fish tank. He drives past Elaine’s house, where he observes through a window, Mr. Braddock cleaning the pool. Ben spies on the Robinsons as they depart with Elaine’s luggage. At his desk, Ben writes \"DEAR ELAINE\" repeatedly, then stops and looks up. In the morning, Mr. Braddock, in a bathrobe, stands by a window, smiling at Ben. On an empty campus, Ben, in a black suit, sits as it fills with students. Elaine approaches with friends, and Ben starts toward her but hesitates. Mr. McCleery nearly collides with Ben, then leads him up stairs. A woman next to Elaine observes Ben, then looks at Elaine again."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "The lady sitting next to Elaine looks at her turns around and looks at Ben then looks at Elaine again He looks at Ben searchingly then turns and continues up the stairs and down the hall Ben following and stops again before taking a couple more steps and stopping once more Mr McCleery takes a couple of steps up He starts toward them falters straightens himself and Mr McCleery stops and turns almost causing Ben to run into him As she walks she is joined by another girl with whom she converses and as they approach they are joined by a tall boy with a beard Elaine comes out carrying her books and walks in Ben's direction approaching from the distance The quadrangle and the area around him fill up with students walking talking hurrying to class strolling sitting reading handing out petitions etc he sits on a bench in the quadrangle outside of Wendell Hall Ben is driving his car and on the empty campus dressed carefully in his black suit Mr Braddock starts to smile A swinging door is pushed open to reveal Mr Braddock dressed in a bathrobe standing at the kitchen counter by the window through which an orange tree can be seen while Ben stands inside the door It is early morning He stops and looks up DEAR ELAINE ELAINE ELAINE ELAINE and her name several dozen times On the piece of paper is written Ben dressed differently again sits in a chair by his desk writing Mrs Robinson stands at the door as Mr Robinson gets into the car and starts it and the car drives down the driveway and down the street Ben is standing behind a tree watching the Robinson house where in the driveway Elaine is getting into the Robinson car and Mr Robinson is putting Elaine's luggage into the car Mr Braddock looks up at Ben's window and Ben moves aside Mr Braddock is seen down by the pool dressed in a sweater cleaning the pool with a longhandled scoop Ben stands by the window overlooking the backyard and over his shoulder Dressed differently Ben drives by in his car and looks at the house Ben sits crosslegged on his bed in the dark his back against the fish tank smoking She gets further and further away as though it is a very long hall in a very bad dream Mrs Robinson stands at the end of it looking at Ben and he looks at her in horror She moves toward him as though to hit him and Elaine slams the door shut Mrs Robinson's face appears in the crack in the door at Elaine's shoulder and Elaine looks from Ben's face to the crack through which she can see her mother's eyes staring"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Mr Braddock starts to smile DEAR ELAINE ELAINE ELAINE ELAINE and her name several dozen times Ben is standing behind a tree watching the Robinson house where in the driveway Elaine is getting into the Robinson car and Mr Robinson is putting Elaine's luggage into the car Elaine comes out carrying her books and walks in Ben's direction approaching from the distance The quadrangle and the area around him fill up with students walking talking hurrying to class strolling sitting reading handing out petitions etc Dressed differently Ben drives by in his car and looks at the house Ben dressed differently again sits in a chair by his desk writing Mrs Robinson stands at the door as Mr Robinson gets into the car and starts it and the car drives down the driveway and down the street He stops and looks up Mr Braddock looks up at Ben's window and Ben moves aside He starts toward them falters straightens himself and Mr McCleery stops and turns almost causing Ben to run into him Ben is driving his car and on the empty campus dressed carefully in his black suit The lady sitting next to Elaine looks at her turns around and looks at Ben then looks at Elaine again It is early morning Ben following and stops again before taking a couple more steps and stopping once more She moves toward him as though to hit him and Elaine slams the door shut On the piece of paper is written Mrs Robinson stands at the end of it looking at Ben and he looks at her in horror A swinging door is pushed open to reveal Mr Braddock dressed in a bathrobe standing at the kitchen counter by the window through which an orange tree can be seen while Ben stands inside the door He looks at Ben searchingly then turns and continues up the stairs and down the hall Ben sits crosslegged on his bed in the dark his back against the fish tank smoking Mr McCleery takes a couple of steps up Ben stands by the window overlooking the backyard and over his shoulder Mr Braddock is seen down by the pool dressed in a sweater cleaning the pool with a longhandled scoop As she walks she is joined by another girl with whom she converses and as they approach they are joined by a tall boy with a beard Mrs Robinson's face appears in the crack in the door at Elaine's shoulder and Elaine looks from Ben's face to the crack through which she can see her mother's eyes staring She gets further and further away as though it is a very long hall in a very bad dream he sits on a bench in the quadrangle outside of Wendell Hall"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "He stops and looks up It is early morning A swinging door is pushed open to reveal Mr Braddock dressed in a bathrobe standing at the kitchen counter by the window through which an orange tree can be seen while Ben stands inside the door Mr Braddock starts to smile Ben is driving his car and on the empty campus dressed carefully in his black suit he sits on a bench in the quadrangle outside of Wendell Hall The quadrangle and the area around him fill up with students walking talking hurrying to class strolling sitting reading handing out petitions etc Elaine comes out carrying her books and walks in Ben's direction approaching from the distance As she walks she is joined by another girl with whom she converses and as they approach they are joined by a tall boy with a beard He starts toward them falters straightens himself and Mr McCleery stops and turns almost causing Ben to run into him Mr McCleery takes a couple of steps up Ben following and stops again before taking a couple more steps and stopping once more He looks at Ben searchingly then turns and continues up the stairs and down the hall The lady sitting next to Elaine looks at her turns around and looks at Ben then looks at Elaine again Mrs Robinson's face appears in the crack in the door at Elaine's shoulder and Elaine looks from Ben's face to the crack through which she can see her mother's eyes staring She moves toward him as though to hit him and Elaine slams the door shut Mrs Robinson stands at the end of it looking at Ben and he looks at her in horror She gets further and further away as though it is a very long hall in a very bad dream Ben sits crosslegged on his bed in the dark his back against the fish tank smoking Ben drives by in his car and looks at the house Dressed differently Ben stands by the window overlooking the backyard and over his shoulder Mr Braddock is seen down by the pool dressed in a sweater cleaning the pool with a longhandled scoop Mr Braddock looks up at Ben's window and Ben moves aside Ben is standing behind a tree watching the Robinson house where in the driveway Elaine is getting into the Robinson car and Mr Robinson is putting Elaine's luggage into the car Mrs Robinson stands at the door as Mr Robinson gets into the car and starts it and the car drives down the driveway and down the street Ben dressed differently again sits in a chair by his desk writing On the piece of paper is written DEAR ELAINE ELAINE ELAINE ELAINE and her name several dozen times"
        }
      ]
    }
  ]
}