{
  "ground_truth": "She looks at Eddie anxiously as she digs in her purse for the coins. She pays, collects her purse and book, and rises to leave. The public address system bleats over the noise of the crowded luncheonette. The waitress leans over and slaps Eddie on the shoulder. He wakes up with a cramped neck. The bar is nearly empty when Eddie comes in. As he looks around the bar, he sees Sarah, alone at a back booth, sipping a highball. She seems amused by their encounter. He takes his drink and joins her at the booth. Sarah nods. There is a long pause as she tries to read his face. Eddie finishes his drink, rises, crosses to the bar, pays the bill, and returns to the booth. As they go out, Sarah stumbles, and he catches her by the arm. Eddie pauses a moment to register this as she limps off, then follows. Eddie goes into the liquor store. Sarah waits outside, stiff and uneasy. Then he comes out with the scotch and they walk off down the street together. They walk slowly, with their eyes pointed straight ahead. He tries to ignore her halting gait. They pass under the awning of the neighborhood's elegant Parisien restaurant. As she searches through her purse for her keys, he reaches out and puts his hand on her shoulder. She closes her eyes, then draws back against the door, fearful, like a threatened animal. He takes her head in his hands and kisses her. She responds but, as he holds her tighter, she starts to struggle. She pushes him away and shakes her head. They stand there for a long moment: she looks away; he looks down at the floor. Then Eddie takes the bag of scotch and places it underneath her arm. He leaves her there in the hall and walks off. A door opens. A hotel manager shows Eddie into a dingy, barely furnished room. He reaches in his pocket and pulls out some bills. Eddie removes his bags from the locker. The sight of the lunch counter reminds him of Sarah. But the lunchroom is empty; only the janitor is there, mopping up. Eddie picks up his bags and goes out. Eddie, on his way back to the hotel, stops at the same liquor store for a bottle. He enters his room, puts down his bags and the liquor, and sits on his rusted brass bed. From his pocket he pulls out the few crumpled bills he has left. He looks at the money, shakes his head disgustedly, and closes his eyes. It is a friendly, neighborhood bar for business people and cocktail drinkers. Eddie walks casually by the pool table and over to the bar.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "She regards Eddie worriedly as she rummages in her handbag for the coins. She pays, gathers her handbag and tome, and stands to depart. The public address system blares over the din of the packed diner. The server bends over and pats Eddie on the shoulder. He awakens with a stiff neck. The tavern is nearly vacant when Eddie arrives. As he glances around the bar, he notices Sarah, solitary at a rear booth, sipping a cocktail. She appears entertained by their meeting. He takes his beverage and joins her at the booth. Sarah acknowledges. There is a lengthy pause as she attempts to read his expression. Eddie drains his drink, stands, moves to the bar, pays the tab, and returns to the booth. As they exit, Sarah trips, and he seizes her by the arm. Eddie hesitates a moment to register this as she hobbles away, then follows. Eddie enters the liquor shop. Sarah waits outside, rigid and uncomfortable. Then he emerges with the whiskey and they stroll down the avenue together. They amble slowly, with their eyes set straight ahead. He attempts to disregard her faltering stride. They pass beneath the canopy of the neighborhood's refined Parisien eatery. As she searches through her handbag for her keys, he extends his hand and places it on her shoulder. She shuts her eyes, then recoils against the door, afraid, like a threatened creature. He takes her head in his hands and kisses her. She reacts but, as he holds her more firmly, she begins to resist. She shoves him away and shakes her head. They stand there for a prolonged moment: she glances away; he looks down at the ground. Then Eddie takes the bag of whiskey and places it beneath her arm. He leaves her there in the corridor and walks away. A door opens. A hotel director escorts Eddie into a shabby, sparsely furnished room. He reaches in his pocket and withdraws some notes. Eddie retrieves his bags from the locker. The sight of the lunch counter reminds him of Sarah. But the cafe is vacant; only the custodian is there, cleaning up. Eddie lifts his bags and leaves. Eddie, on his way back to the hotel, stops at the same liquor shop for a bottle. He enters his room, puts down his bags and the alcohol, and sits on his corroded brass bed. From his pocket he withdraws the few rumpled notes he has left. He regards the money, shakes his head angrily, and shuts his eyes. It is a sociable, neighborhood tavern for business individuals and cocktail enthusiasts. Eddie strolls casually by the billiards table and over to the bar."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "She is looked at by Eddie anxiously as coins are dug in her purse by her. Payment is made by her, her purse and book are collected, and she rises to leave. Over the noise of the crowded luncheonette, the public address system bleats. Eddie is leaned over and slapped on the shoulder by the waitress. A cramped neck wakes him up. When Eddie comes in, the bar is nearly empty. As he looks around the bar, Sarah is seen by him, alone at a back booth, sipping a highball. Amusement seems to be felt by her at their encounter. His drink is taken by him and he joins her at the booth. She nods. There is a long pause as his face is tried to be read by her. His drink is finished by Eddie, the bar is crossed by him, the bill is paid, and the booth is returned to by him. As they go out, Sarah is stumbled by and her arm is caught by him. A moment is paused by Eddie to register this as she limps off, then he follows. The liquor store is entered by Eddie. Outside, Sarah waits, stiff and uneasy. Then, with the scotch, he comes out and they walk off down the street together. Slowly, with their eyes pointed straight ahead, they walk. Her halting gait is tried to be ignored by him. Under the awning of the neighborhood's elegant Parisien restaurant, they pass. As she searches through her purse for her keys, her shoulder is reached out and touched by him. Her eyes are closed by her, then against the door, she draws back, fearful, like a threatened animal. Her head is taken by him in his hands and she is kissed by him. She responds but, as she is held tighter by him, she starts to struggle. He is pushed away by her and her head is shaken by her. There they stand for a long moment: he is looked away from by her; the floor is looked down at by him. Then the bag of scotch is taken by Eddie and it is placed underneath her arm by him. She is left by him in the hall and he walks off. A door opens. Eddie is shown into a dingy, barely furnished room by a hotel manager. Some bills are pulled out from his pocket by him. Eddie's bags are removed by him from the locker. The lunch counter reminds him of Sarah. But the lunchroom is empty; the janitor is there, mopping up. His bags are picked up by Eddie and he goes out. On his way back to the hotel, at the same liquor store, Eddie stops for a bottle. His room is entered, his bags and the liquor are put down, and he sits on his rusted brass bed. From his pocket, the few crumpled bills he has left are pulled out by him. The money is looked at by him, his head is shaken disgustedly, and his eyes are closed. It is a friendly, neighborhood bar for business people and cocktail drinkers. The pool table is walked by casually by Eddie and over to the bar."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "She looks at Eddie anxiously while searching for coins in her purse. After paying, she collects her purse and book before leaving. The public address system blares over the noisy luncheonette. The waitress slaps Eddie's shoulder, waking him with a cramped neck. The bar is nearly empty when Eddie arrives. Spotting Sarah alone at a booth with a drink, he joins her. Sarah nods, trying to read his face during a long pause. Eddie finishes his drink, pays the bill, and returns to the booth. As they leave, Sarah stumbles, and he supports her before she limps away. Eddie enters a liquor store, and Sarah waits outside, tense. He exits with scotch, and they walk together, eyes fixed ahead, ignoring her limp. They pass a fancy Parisien restaurant. Searching for her keys, he places a hand on her shoulder, prompting fear. Eddie kisses her; she responds but then struggles and pushes him away. They stand silently before he tucks the scotch under her arm and leaves. A hotel manager shows Eddie to a shabby room where he pays with crumpled bills. Removing bags from a locker, he recalls Sarah at the empty lunch counter, now only occupied by a janitor. Eddie picks up his bags and exits. On his hotel return, he stops at the liquor store again, entering his room to sit on his rusted bed and examine his dwindling bills. The neighborhood bar is friendly, catering to business people. Eddie casually approaches the bar, passing the pool table."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "She anxiously searches her purse for coins, pays, and leaves. The noisy PA system blares as a waitress wakes Eddie by slapping his shoulder. The bar is almost empty, but Eddie spots Sarah alone, sipping a highball. Amused, she nods as he joins her. After finishing his drink, Eddie pays and they exit together. Sarah stumbles, and Eddie steadies her. He visits a liquor store while she waits uneasily. Exiting with scotch, they walk slowly, eyes forward, past a neighborhood restaurant. Searching for her keys, he touches her shoulder. Fearful, she pulls away as he kisses her. She struggles and pushes him off. They stand silently before Eddie places the scotch under her arm and leaves. A hotel manager shows Eddie to a dim room where he retrieves his bags. Remembering Sarah at the lunch counter, he finds it empty. Leaving with his bags, he stops at the liquor store for a bottle. In his room, he sits, examining his dwindling cash with disgust. Later, he casually walks by the bar's pool table to get a drink."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "She glances at Eddie with anxiety evident in her eyes as she rummages through the disorganized contents of her purse to find the handful of coins. After paying, she collects her purse and book, and then rises from her seat to leave. Meanwhile, the public address system blares indistinctly over the din of the bustling luncheonette. The waitress leans over, gives Eddie a playful slap on the shoulder, and he stirs awake, rubbing a cramped neck. When Eddie enters the bar, it is almost devoid of patrons. As he surveys the scene, his eyes land on Sarah, who is alone at a back booth, sipping a highball. She seems to find their encounter entertaining. With his drink in hand, he joins her at the booth. Sarah acknowledges him with a nod. There is a prolonged silence as she attempts to decipher the emotions displayed on his face. Eddie finishes his drink, rises, and makes his way to the bar where he pays the bill before returning to the booth. As they exit, Sarah stumbles slightly, and Eddie quickly catches her by the arm. He pauses momentarily to absorb this event as she limps away, and then he follows her. Eddie proceeds into the liquor store while Sarah waits outside, appearing tense and uncomfortable. Shortly after, he emerges with a bottle of scotch, and they begin to walk down the street together, their pace slow with their attention fixed straight ahead. Eddie makes an effort to overlook her faltering steps. They pass beneath the elegant awning of the neighborhood's prestigious Parisien restaurant. As she searches through her purse for the keys, he gently places his hand on her shoulder. She closes her eyes momentarily, then recoils against the door, like an animal that feels threatened. He tenderly takes her head in his hands and kisses her. She reciprocates, but as he embraces her more tightly, she begins to resist. She pushes him away and shakes her head. They remain standing there for an extended moment: she averts her eyes, and he directs his gaze downward to the floor. Eddie then takes the bag containing the scotch and places it beneath her arm. He leaves her standing in the hallway and walks away. A door creaks open, and a hotel manager leads Eddie into a drab, sparsely furnished room. Eddie reaches into his pocket and pulls out some bills. He retrieves his bags from the locker. The sight of the lunch counter recalls memories of Sarah, though the lunchroom is now deserted except for the janitor, who is busy mopping up. Eddie collects his bags and exits. On his return journey to the hotel, Eddie makes another stop at the familiar liquor store to purchase a bottle. Entering his room, he sets down his bags and the liquor and then sits heavily on the rusted brass bed. From his pocket, he retrieves the few remaining crumpled bills. Staring at the money, he shakes his head with disgust and closes his eyes in frustration. The bar is a welcoming spot in the neighborhood, a favorite for business people and those who enjoy cocktails. Eddie walks casually past the pool table and over to the bar."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "She glances over at Eddie, a hint of anxiety unmistakably visible in her eyes, as she frantically rummages through the disorganized contents of her purse in a desperate attempt to locate the small handful of coins. After she finally manages to pay, she gathers up her purse and book, then rises from her seat in preparation to leave. Meanwhile, the public address system blares indistinctly, its noise barely audible over the constant din of the bustling luncheonette. The waitress, leaning over with a cheerful demeanor, gives Eddie a playful slap on the shoulder, causing him to stir awake and rub his cramped neck. When Eddie eventually enters the bar, he finds it to be almost devoid of patrons. As he surveys the scene, his eyes ultimately land on Sarah, who is sitting alone in a back booth, sipping her highball. She seems to find their encounter quite entertaining. With his drink in hand, he makes his way over to join her at the booth. Sarah acknowledges his presence with a nod. There is a prolonged silence as she makes an attempt to decipher the complex emotions displayed across his face. Eddie finishes his drink, gets up from the booth, and makes his way to the bar, where he pays the bill before returning to Sarah. As they begin to exit, Sarah stumbles slightly, and Eddie quickly reaches out to catch her by the arm. He pauses for a moment, absorbing the event as she limps away, and then he follows closely behind her. Eddie proceeds into the nearby liquor store, while Sarah waits outside, appearing tense and somewhat uncomfortable. Shortly after, he emerges from the store with a bottle of scotch in hand, and together they start to walk down the street, moving at a slow pace with their attention fixed straight ahead. Eddie makes a conscious effort to overlook her unsteady steps. They make their way beneath the elegant awning of the neighborhood’s prestigious Parisien restaurant. As she begins searching through her purse for the keys, he gently places a reassuring hand on her shoulder. She closes her eyes for a brief moment, then recoils against the door, much like an animal feeling threatened. He tenderly takes her head in his hands and kisses her. She reciprocates the gesture, but as he embraces her more tightly, she starts to resist. She pushes him away, shaking her head with determination. They remain standing there for an extended moment: she averts her eyes, and he directs his gaze downward to the floor. Eddie then takes the bag containing the scotch and places it securely beneath her arm. He leaves her standing in the hallway and walks away. A door creaks open, and a hotel manager leads Eddie into a drab, sparsely furnished room. Eddie reaches into his pocket and pulls out some bills. He retrieves his bags from the locker. The sight of the lunch counter brings back memories of Sarah, though the lunchroom is now deserted except for the janitor, who is busy mopping up the floor. Eddie collects his bags and exits. On his return journey to the hotel, Eddie makes another stop at the familiar liquor store to purchase a bottle. Entering his room, he sets down his bags and the bottle of liquor and then sits heavily on the rusted brass bed. From his pocket, he retrieves the few remaining crumpled bills. Staring at the money with a look of disgust, he shakes his head and closes his eyes in frustration. The bar is known as a welcoming spot in the neighborhood, a favorite for business people and those who enjoy cocktails. Eddie walks casually past the pool table and over to the bar."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "She anxiously glances at Eddie while her fingers fumble through her purse, searching for the coins she needs. Once she finds them, she pays for her meal, ensuring the coins are securely handed over, then gathers her purse and book, methodically checking that nothing is left behind, and stands up, preparing to leave. Simultaneously, the public address system blares loudly, struggling to be heard over the constant chatter and clinking of cutlery that fills the crowded luncheonette. The waitress, seeing Eddie, approaches and leans over him, giving him a firm slap on the shoulder to rouse him from his slumber. Eddie awakens, feeling the discomfort of a cramped neck as he blinks away sleep. Later, the atmosphere shifts as Eddie enters a nearly empty bar, taking in the space as his eyes scan his surroundings. In a back booth, he spots Sarah, sitting alone, casually sipping a highball, a hint of amusement playing on her lips from their previous encounter. Deciding to join her, he retrieves his drink and walks over to her booth, where Sarah acknowledges him with a nod. A silence hangs in the air between them, laden with anticipation, as Sarah scrutinizes his expression, attempting to decipher his thoughts. Eddie, finishing his drink, stands up purposefully, walks over to the bar, settles the bill, and then returns to Sarah. As they finally decide to leave together, Sarah stumbles unexpectedly, and Eddie instinctively reaches out, steadying her by the arm. Pausing briefly, he absorbs the moment as she hobbles away, then follows her outside. They soon make their way to a liquor store, where Eddie enters while Sarah waits outside, visibly stiff and uneasy. Emerging with a bottle of scotch, they resume their walk down the street, moving deliberately with eyes focused ahead, while he endeavors not to notice her uneven steps. As they pass beneath the elegantly adorned awning of the neighborhood's Parisien restaurant, she begins searching through her purse for her keys. He gently places his hand on her shoulder, prompting her to close her eyes momentarily, then recoil against the door, her demeanor shifting to one of alarm, like a cornered creature. Despite her initial response, he tenderly cradles her head in his hands and kisses her, to which she initially responds, but soon starts to resist as he embraces her more tightly. She pushes him away, shaking her head in a clear gesture of refusal. They remain standing there, frozen in a poignant silence, as she averts her gaze and he drops his eyes to the floor, contemplating the moment. Making a decision, Eddie takes the scotch bottle and places it under her arm, then departs, leaving her standing in the hallway. The scene transitions to a new setting as a door creaks open. A hotel manager guides Eddie into a dingy, sparsely furnished room. Eddie reaches into his pocket and extracts some bills, handing them over for the room. Next, he retrieves his bags from a locker, where they have been stored. As he moves past the sight of the lunch counter, a wave of nostalgia hits him, thoughts of Sarah flooding back. However, the lunchroom now stands starkly empty, with only a janitor methodically mopping the floor. Resigning to the solitude, Eddie collects his bags and walks out. On his way back to the hotel, he cannot resist stopping at the same liquor store to purchase another bottle. Upon entering his room, he sets down his bags and the newly acquired liquor, sinking wearily onto his rusted brass bed. From his pocket, he pulls out the remaining few crumpled bills, gazing at them with dismay before shaking his head, a gesture filled with a mix of regret and resignation, and closes his eyes, overwhelmed by the weight of his circumstances. In a shift to a more social environment, it becomes a friendly, neighborhood bar frequented by business people and cocktail enthusiasts. Eddie strolls in with a casual air, bypassing the pool table and making his way over to the bar, ready to escape his thoughts momentarily."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "She searches her purse for coins, pays, and gathers her belongings, ready to leave as the public address system blares in the bustling luncheonette. The waitress rouses Eddie from his nap with a tap on the shoulder. Later, Eddie enters a nearly empty bar, spots Sarah at a back booth with a drink, and joins her. After a brief exchange, he finishes his drink, settles the bill, and returns to Sarah. Leaving together, Eddie steadies Sarah when she stumbles, noting her limp, before they continue to a liquor store where Eddie purchases scotch. They walk quietly through the neighborhood, passing an upscale restaurant before pausing at Sarah's door where she hesitates under his touch. A tense moment follows their kiss until she pushes him away. Eddie hands her the scotch and departs. At a hotel, he pays the manager and retrieves his bags from a locker. The deserted lunch counter stirs memories of Sarah as he exits. On his way back, Eddie buys another bottle from the liquor store, returns to his room, and surveys his dwindling cash with dismay. Later, he casually navigates a friendly bar, passing by the pool table toward the bar."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "She looks at Eddie anxiously as she digs in her purse for the coins, which have become a rare commodity in a city increasingly reliant on digital payments. She pays, collects her purse and book, a well-worn copy of \"The Great Gatsby\" known for its themes of aspiration and despair, and rises to leave. The public address system bleats over the noise of the crowded luncheonette, a vintage diner that retains its 1950s charm with chrome fixtures and neon lights. The waitress, who has worked here for over a decade and knows all the regulars, leans over and slaps Eddie on the shoulder. He wakes up with a cramped neck, having dozed off after a long night at work as a security guard. The bar, a dimly lit place popular with local jazz musicians, is nearly empty when Eddie comes in. As he looks around the bar, he sees Sarah, alone at a back booth, sipping a highball, a cocktail originally popularized in the 1920s. She seems amused by their encounter, recalling their last meeting at a mutual friend's party. He takes his drink and joins her at the booth. Sarah nods, acknowledging the unspoken connection they share. There is a long pause as she tries to read his face, searching for hints of his true feelings. Eddie finishes his drink, rises, crosses to the bar, pays the bill with his last few coins, and returns to the booth. As they go out, Sarah stumbles on the uneven sidewalk, and he catches her by the arm, a reflex born from years of looking out for others. Eddie pauses a moment to register this as she limps off, then follows, his mind swirling with concern. Eddie goes into the liquor store, a small shop run by an old man who remembers when the neighborhood was thriving. Sarah waits outside, stiff and uneasy, her past experiences with confrontation making her wary. Then he comes out with the scotch, a brand he's grown fond of over the years, and they walk off down the street together. They walk slowly, with their eyes pointed straight ahead, each lost in thought about the uncertain future. He tries to ignore her halting gait that speaks volumes about her hidden plight. They pass under the awning of the neighborhood's elegant Parisien restaurant, a local landmark famous for its exquisite cuisine and moonlit dinners. As she searches through her purse for her keys, he reaches out and puts his hand on her shoulder, a comforting gesture they have shared before. She closes her eyes, then draws back against the door, fearful, like a threatened animal sensing danger. He takes her head in his hands and kisses her, a moment they've both anticipated yet feared. She responds but, as he holds her tighter, she starts to struggle, battling inner demons he can't see. She pushes him away and shakes her head, a silent plea for space. They stand there for a long moment: she looks away; he looks down at the floor, both trapped in their own turmoil. Then Eddie takes the bag of scotch and places it underneath her arm, a gesture of reluctant resignation. He leaves her there in the hall, under the dim corridor light that flickers ominously, and walks off. A door opens. A hotel manager, whose tired eyes reflect years of managing transient lodgers, shows Eddie into a dingy, barely furnished room. He reaches in his pocket and pulls out some bills, just enough to cover the night's stay. Eddie removes his bags from the locker, where they've been stored since his arrival in town. The sight of the lunch counter, with its greasy aroma and clinking cutlery, reminds him of Sarah. But the lunchroom is empty; only the janitor is there, mopping up the remnants of the day's rush. Eddie picks up his bags and goes out. Eddie, on his way back to the hotel, stops at the same liquor store for a bottle, as the owner, with a knowing nod, rings him up. He enters his room, puts down his bags and the liquor, and sits on his rusted brass bed, which creaks under his weight. From his pocket he pulls out the few crumpled bills he has left, symbols of his dwindling fortune. He looks at the money, shakes his head disgustedly, and closes his eyes, hoping to escape reality for a moment. It is a friendly, neighborhood bar for business people and cocktail drinkers, a place where deals are made and stories exchanged. Eddie walks casually by the pool table, where a game is perpetually paused and over to the bar, settling in for another night of forgotten dreams."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "The bar is nearly empty when Eddie comes in She looks at Eddie anxiously as she digs in her purse for the coins She pays collects her purse and book and rises to leave The public address system bleats over the noise of the crowded luncheonette The waitress leans over and slaps Eddie on the shoulder He wakes up with a cramped neck The bar is nearly empty when Eddie comes in As he looks around the bar he sees Sarah alone at a back booth sipping a highball She seems amused by their encounter They pass under the awning of the neighborhood's elegant Parisien restaurant He takes his drink and joins her at the booth He takes her head in his hands and kisses her He looks at the money shakes his head disgustedly and closes his eyes Sarah nods He leaves her there in the hall and walks off She looks at Eddie anxiously as she digs in her purse for the coins There is a long pause as she tries to read his face Eddie finishes his drink rises crosses to the bar pays the bill and returns to the booth As they go out Sarah stumbles and he catches her by the arm Eddie pauses a moment to register this as she limps off then follows Sarah waits outside stiff and uneasy Then he comes out with the scotch and they walk off down the street together Eddie goes into the liquor store Sarah waits outside stiff and uneasy As he looks around the bar he sees Sarah alone at a back booth sipping a highball Then he comes out with the scotch and they walk off down the street together It is a friendly neighborhood bar for business people and cocktail drinkers They walk slowly with their eyes pointed straight ahead He tries to ignore her halting gait They pass under the awning of the neighborhood's elegant Parisien restaurant As she searches through her purse for her keys he reaches out and puts his hand on her shoulder She closes her eyes then draws back against the door fearful like a threatened animal He takes her head in his hands and kisses her only the janitor is there mopping up She responds but as he holds her tighter she starts to struggle She pushes him away and shakes her head They stand there for a long moment They walk slowly with their eyes pointed straight ahead Eddie goes into the liquor store she looks away he looks down at the floor Then Eddie takes the bag of scotch and places it underneath her arm He leaves her there in the hall and walks off A door opens A hotel manager shows Eddie into a dingy barely furnished room Eddie walks casually by the pool table and over to the bar He reaches in his pocket and pulls out some bills Eddie removes his bags from the locker He takes his drink and joins her at the booth She pays collects her purse and book and rises to leave The sight of the lunch counter reminds him of Sarah But the lunchroom is empty He reaches in his pocket and pulls out some bills only the janitor is there mopping up Eddie picks up his bags and goes out Eddie on his way back to the hotel stops at the same liquor store for a bottle He enters his room puts down his bags and the liquor and sits on his rusted brass bed From his pocket he pulls out the few crumpled bills he has left he looks down at the floor From his pocket he pulls out the few crumpled bills he has left He looks at the money shakes his head disgustedly and closes his eyes The public address system bleats over the noise of the crowded luncheonette It is a friendly neighborhood bar for business people and cocktail drinkers She seems amused by their encounter The sight of the lunch counter reminds him of Sarah Eddie walks casually by the pool table and over to the bar"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "She looks at Eddie anxiously as she digs in her purse for the coins. She pays collects her purse and book and rises to leave. The public address system bleats over the noise of the crowded luncheonette. The waitress leans over and slaps Eddie on the shoulder. He wakes up with a cramped neck. The bar is nearly empty when Eddie comes in. As he looks around the bar he sees Sarah alone at a back booth sipping a highball. She seems amused by their encounter. He takes his drink and joins her at the booth. Sarah nods. There is a long pause as she tries to read his face. Eddie finishes his drink rises crosses to the bar pays the bill and returns to the booth. As they go out Sarah stumbles and he catches her by the arm. Eddie pauses a moment to register this as she limps off then follows. Eddie goes into the liquor store. Sarah waits outside stiff and uneasy. Then he comes out with the scotch and they walk off down the street together. They walk slowly with their eyes pointed straight ahead. He tries to ignore her halting gait. They pass under the awning of the neighborhood's elegant Parisien restaurant. As she searches through her purse for her keys he reaches out and puts his hand on her shoulder. She closes her eyes then draws back against the door fearful like a threatened animal. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. He takes her head in his hands and kisses her. She responds but as he holds her tighter she starts to struggle. She pushes him away and shakes her head. They stand there for a long moment. she looks away. he looks down at the floor. Then Eddie takes the bag of scotch and places it underneath her arm. He leaves her there in the hall and walks off. A door opens. A hotel manager shows Eddie into a dingy barely furnished room. He reaches in his pocket and pulls out some bills. Eddie removes his bags from the locker. The sight of the lunch counter reminds him of Sarah. But the lunchroom is empty. only the janitor is there mopping up. Eddie picks up his bags and goes out. Eddie on his way back to the hotel stops at the same liquor store for a bottle. He enters his room puts down his bags and the liquor and sits on his rusted brass bed. From his pocket he pulls out the few crumpled bills he has left. He looks at the money shakes his head disgustedly and closes his eyes. It is a friendly neighborhood bar for business people and cocktail drinkers. Eddie walks casually by the pool table and over to the bar."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "She looks at Eddie anxiously as she digs in her purse for the coins. She pays collects her purse and book and rises to leave. The public address system bleats over the noise of the crowded luncheonette. The waitress leans over and slaps Eddie on the shoulder. He wakes up with a cramped neck. The bar is nearly empty when Eddie comes in. As he looks around the bar he sees Sarah alone at a back booth sipping a highball. She seems amused by their encounter. He takes his drink and joins her at the booth. Sarah nods. There is a long pause as she tries to read his face. Eddie finishes his drink rises crosses to the bar pays the bill and returns to the booth. As they go out Sarah stumbles and he catches her by the arm. Eddie pauses a moment to register this as she limps off then follows. Eddie goes into the liquor store. Sarah waits outside stiff and uneasy. Then he comes out with the scotch and they walk off down the street together. They walk slowly with their eyes pointed straight ahead. He tries to ignore her halting gait. They pass under the awning of the neighborhood's elegant Parisien restaurant. As she searches through her purse for her keys he reaches out and puts his hand on her shoulder. She closes her eyes then draws back against the door fearful like a threatened animal. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. He takes her head in his hands and kisses her. She responds but as he holds her tighter she starts to struggle. She pushes him away and shakes her head. They stand there for a long moment. she looks away. he looks down at the floor. Then Eddie takes the bag of scotch and places it underneath her arm. He leaves her there in the hall and walks off. A door opens. A hotel manager shows Eddie into a dingy barely furnished room. He reaches in his pocket and pulls out some bills. Eddie removes his bags from the locker. The sight of the lunch counter reminds him of Sarah. But the lunchroom is empty. only the janitor is there mopping up. Eddie picks up his bags and goes out. Eddie on his way back to the hotel stops at the same liquor store for a bottle. He enters his room puts down his bags and the liquor and sits on his rusted brass bed. From his pocket he pulls out the few crumpled bills he has left. He looks at the money shakes his head disgustedly and closes his eyes. It is a friendly neighborhood bar for business people and cocktail drinkers. Eddie walks casually by the pool table and over to the bar."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "She looks at Eddie anxiously as she digs in her purse for the coins. She pays collects her purse and book and rises to leave. The public address system bleats over the noise of the crowded luncheonette. The waitress leans over and slaps Eddie on the shoulder. He wakes up with a cramped neck. The bar is nearly empty when Eddie comes in. As he looks around the bar he sees Sarah alone at a back booth sipping a highball. She seems amused by their encounter. He takes his drink and joins her at the booth. Sarah nods. There is a long pause as she tries to read his face. Eddie removes his bags from the locker. The sight of the lunch counter reminds him of Sarah. But the lunchroom is empty. only the janitor is there mopping up. Eddie picks up his bags and goes out. Eddie on his way back to the hotel stops at the same liquor store for a bottle. He enters his room puts down his bags and the liquor and sits on his rusted brass bed. From his pocket he pulls out the few crumpled bills he has left. He looks at the money shakes his head disgustedly and closes his eyes. It is a friendly neighborhood bar for business people and cocktail drinkers. Eddie walks casually by the pool table and over to the bar."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "She looks at Eddie anxiously as she digs in her purse for the coins. She pays collects her purse and book and rises to leave. The public address system bleats over the noise of the crowded luncheonette. The waitress leans over and slaps Eddie on the shoulder. He wakes up with a cramped neck. From his pocket he pulls out the few crumpled bills he has left. He looks at the money shakes his head disgustedly and closes his eyes. It is a friendly neighborhood bar for business people and cocktail drinkers. Eddie walks casually by the pool table and over to the bar."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "She looks at Maurice anxiously as she digs in her purse for the coins. The cat pays, collects her purse and book, and rises to leave. The public address system bleats over the noise of the crowded luncheonette. The dog leans over and slaps Maurice on the shoulder. The rabbit wakes up with a cramped neck. The bar is nearly empty when Sylvia comes in. As the turtle looks around the bar, it sees Harold, alone at a back booth, sipping a highball. The penguin seems amused by their encounter. The deer takes its drink and joins the monkey at the booth. Harold nods. There is a long pause as the goat tries to read the sheep's face. The rabbit finishes its drink, rises, crosses to the bar, pays the bill, and returns to the booth. As they go out, Harold stumbles, and the rabbit catches her by the arm. Sylvia pauses a moment to register this as the rabbit limps off, then follows. The bear goes into the liquor store. Harold waits outside, stiff and uneasy. Then the rabbit comes out with the scotch and they walk off down the street together. They walk slowly, with their eyes pointed straight ahead. The owl tries to ignore the lion's halting gait. The giraffe and the gazelle pass under the awning of the neighborhood's elegant Parisien restaurant. As the bear searches through his purse for her keys, the parrot reaches out and puts his hand on the owl's shoulder. The kangaroo closes her eyes, then draws back against the door, fearful, like a threatened animal. The fox takes her head in his hands and kisses her. The rabbit responds but, as the fox holds her tighter, the bear starts to struggle. The rabbit pushes the fox away and shakes his head. They stand there for a long moment: the kangaroo looks away; the fox looks down at the floor. Then the rabbit takes the bag of scotch and places it underneath the kangaroo's arm. The rabbit leaves the kangaroo there in the hall and walks off. A door opens. A hotel manager shows the rabbit into a dingy, barely furnished room. The rabbit reaches in its pocket and pulls out some bills. The rabbit removes his bags from the locker. The sight of the lunch counter reminds the rabbit of Harold. But the lunchroom is empty; only the janitor is there, mopping up. The rabbit picks up his bags and goes out. The rabbit, on the way back to the hotel, stops at the same liquor store for a bottle. The rabbit enters his room, puts down his bags and the liquor, and sits on his rusted brass bed. From his pocket the rabbit pulls out the few crumpled bills he has left. The rabbit looks at the money, shakes his head disgustedly, and closes his eyes. It is a friendly, neighborhood bar for business people and cocktail drinkers. The rabbit walks casually by the pool table and over to the bar."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "She looks at Eddie anxiously as she digs in her backpack for the marbles. She pays, collects her backpack and magazine, and rises to leave. The loudspeaker bleats over the noise of the crowded cafeteria. The waitress leans over and slaps Eddie on the shoulder. He wakes up with a cramped neck. The cafe is nearly empty when Eddie comes in. As he looks around the cafe, he sees Sarah, alone at a back booth, sipping a lemonade. She seems amused by their encounter. He takes his smoothie and joins her at the booth. Sarah nods. There is a long pause as she tries to read his face. Eddie finishes his smoothie, rises, crosses to the counter, pays the bill, and returns to the booth. As they go out, Sarah stumbles, and he catches her by the arm. Eddie pauses a moment to register this as she limps off, then follows. Eddie goes into the grocery store. Sarah waits outside, stiff and uneasy. Then he comes out with the juice and they walk off down the street together. They walk slowly, with their eyes pointed straight ahead. He tries to ignore her halting gait. They pass under the awning of the neighborhood's elegant French bakery. As she searches through her backpack for her keys, he reaches out and puts his hand on her shoulder. She closes her eyes, then draws back against the door, fearful, like a threatened animal. He takes her head in his hands and kisses her. She responds but, as he holds her tighter, she starts to struggle. She pushes him away and shakes her head. They stand there for a long moment: she looks away; he looks down at the floor. Then Eddie takes the bag of juice and places it underneath her arm. He leaves her there in the hall and walks off. A door opens. A motel manager shows Eddie into a dingy, barely furnished room. He reaches in his pocket and pulls out some bills. Eddie removes his bags from the closet. The sight of the snack bar reminds him of Sarah. But the snack bar is empty; only the janitor is there, sweeping up. Eddie picks up his bags and goes out. Eddie, on his way back to the motel, stops at the same grocery store for a carton. He enters his room, puts down his bags and the drink, and sits on his worn wooden bed. From his pocket he pulls out the few crumpled bills he has left. He looks at the money, shakes his head disgustedly, and closes his eyes. It is a friendly, neighborhood cafe for locals and coffee drinkers. Eddie walks casually by the pinball machine and over to the counter."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "She glances at Eddie anxiously as she rummages through her purse for the coins. She settles, collects her purse and book, and stands to leave. The public address system drones over the noise of the crowded luncheonette. The waitress bends over and taps Eddie on the shoulder. He stirs with a cramped neck. The bar is nearly empty when Eddie arrives. As he scans the bar, he notices Sarah, alone at a back booth, nursing a highball. She appears amused by their encounter. He grabs his drink and approaches her at the booth. Sarah inclines her head. There is a long pause as she attempts to read his face. Eddie drains his drink, stands, moves to the bar, settles the bill, and returns to the booth. As they exit, Sarah trips, and he steadies her by the arm. Eddie hesitates a moment to absorb this as she hobbles off, then trails behind. Eddie enters the liquor store. Sarah waits outside, tense and uneasy. Then he exits with the scotch and they stroll off down the street together. They proceed slowly, their eyes directed straight ahead. He attempts to disregard her faltering gait. They walk beneath the awning of the neighborhood's elegant Parisien restaurant. As she digs through her purse for her keys, he extends his hand and places it on her shoulder. She shuts her eyes, then recoils against the door, wary, like a cornered animal. He cradles her head in his hands and kisses her. She reciprocates but, as he holds her closer, she begins to resist. She shoves him away and shakes her head. They linger there for a long moment: she averts her gaze; he lowers his eyes to the floor. Then Eddie takes the bag of scotch and tucks it beneath her arm. He abandons her there in the hall and departs. A door opens. A hotel manager escorts Eddie into a dim, sparsely furnished room. He fishes in his pocket and extracts some bills. Eddie retrieves his bags from the locker. The sight of the lunch counter evokes thoughts of Sarah. But the lunchroom is deserted; only the janitor is there, cleaning up. Eddie snatches his bags and leaves. Eddie, on his trek back to the hotel, pauses at the same liquor store for a bottle. He steps into his room, sets down his bags and the liquor, and perches on his rusted brass bed. From his pocket, he extracts the few crumpled bills he has left. He stares at the money, shakes his head in frustration, and shuts his eyes. It is a congenial, neighborhood bar for business people and cocktail drinkers. Eddie strolls casually by the pool table and up to the bar."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "She looks at the giraffe anxiously as she digs in her backpack for the strawberries. She pays, collects her backpack and umbrella, and rises to leave. The foghorn bleats over the noise of the crowded amusement park. The magician leans over and slaps the giraffe on the shoulder. It wakes up with a cramped neck. The greenhouse is nearly empty when the giraffe comes in. As it looks around the greenhouse, it sees an owl, alone at a back booth, sipping a lemonade. It seems amused by their encounter. The giraffe takes its strawberry and joins it at the booth. The owl nods. There is a long pause as it tries to read the giraffe's face. The giraffe finishes its strawberry, rises, crosses to the greenhouse entrance, pays the bill, and returns to the booth. As they go out, the owl stumbles, and it catches the owl by the beak. The giraffe pauses a moment to register this as it limps off, then follows. The giraffe goes into the bakery. The owl waits outside, stiff and uneasy. Then the giraffe comes out with the croissant and they walk off down the runway together. They walk slowly, with their eyes pointed straight ahead. It tries to ignore the owl's halting gait. They pass under the awning of the neighborhood's elegant Italian theater. As it searches through its backpack for its keys, the giraffe reaches out and puts its hoof on the owl's wing. The owl closes its eyes, then draws back against the gate, fearful, like a threatened tree. The giraffe takes the owl's branch in its hooves and kisses it. The owl responds but, as the giraffe holds it tighter, it starts to struggle. The owl pushes the giraffe away and shakes its head. They stand there for a long moment: the owl looks away; the giraffe looks down at the dirt. Then the giraffe takes the bag of croissants and places it underneath the owl's wing. It leaves the owl there in the forest and walks off. A curtain opens. A zookeeper shows the giraffe into a dingy, barely furnished nest. It reaches into its backpack and pulls out some feathers. The giraffe removes its antlers from the locker. The sight of the ice cream stand reminds it of the owl. But the diner is empty; only the gardener is there, mopping up. The giraffe picks up its antlers and goes out. The giraffe, on its way back to the nest, stops at the same bakery for a baguette. It enters its nest, puts down its antlers and the baguette, and sits on its rusted brass hammock. From its backpack it pulls out the few crumpled feathers it has left. It looks at the feathers, shakes its head disgustedly, and closes its eyes. It is a friendly, neighborhood garden for farmers and soda drinkers. The giraffe walks casually by the terrarium and over to the garden."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "He watches Lucy curiously as he rummages in his jacket for the tickets. He departs, gathers his jacket and glasses, and stands to exit. The radio announcer drones over the hum of the crowded library. The librarian reaches over and pats Lucy on the back. She stirs awake with a stiff neck. The café is nearly deserted when Lucy walks in. As she glances around the café, she notices Alex, alone at a corner table, sipping a latte. He seems puzzled by their meeting. She grabs her drink and joins him at the table. Alex shrugs. There is a long silence as he tries to decipher her expression. Lucy finishes her drink, stands, moves to the counter, settles the tab, and returns to the table. As they head out, Alex trips, and she grips him by the elbow. Lucy halts briefly to understand this as he limps away, then follows. Lucy enters the bookstore. Alex waits outside, tense and fidgety. Then she emerges with the novel and they amble down the street together. They stroll leisurely, with their eyes fixed forward. She attempts to disregard his uneven stride. They pass beneath the canopy of the neighborhood's cozy Italian bistro. As he digs through his jacket for his wallet, she extends her hand and places it on his back. He closes his eyes, then leans against the railing, apprehensive, like a startled deer. She cradles his face in her hands and hugs him. He reciprocates but, as she clutches him tighter, he begins to resist. He pushes her off and shakes his head. They stand there silently for a while: he glances away; she stares at the ground. Then Lucy takes the bundle of novels and sets it beneath his arm. She leaves him there on the sidewalk and ambles away. A window slides open. A concierge ushers Lucy into a cramped, sparsely decorated office. She reaches in her bag and extracts a few coins. Lucy retrieves her suitcase from the closet. The sight of the bookstore reminds her of Alex. But the bookstore is vacant; only the cleaner is there, tidying up. Lucy grabs her suitcase and leaves. Lucy, on her way back to the hostel, pauses at the same bookshop for a hardcover. She enters her room, sets down her suitcase and the hardcover, and collapses on her creaky wooden bed. From her bag she takes out the several wrinkled coins she has left. She eyes the coins, sighs heavily, and shuts her eyes. It is a lively, community coffeehouse for students and bookworms. Lucy ambles leisurely by the bookshelves and over to the counter."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "She glances at Eddie apprehensively as she rummages in her backpack for the marbles. She settles up, gathers her backpack and sketchpad, and stands to depart. The public address system buzzes over the noise of the bustling bakery. The waitress leans over and taps Eddie on the elbow. He stirs with a stiff neck. The arcade is nearly deserted when Eddie strolls in. As he scans the arcade, he spots Sarah, alone at a back booth, nibbling on a cupcake. She appears entertained by their meeting. He picks up his snack and joins her at the booth. Sarah grins. There is an extended silence as she attempts to decipher his expression. Eddie finishes his snack, stands, ambles to the counter, settles the tab, and returns to the booth. As they step out, Sarah trips, and he steadies her by the elbow. Eddie hesitates for a moment to ponder this as she hobbles away, then trails behind. Eddie heads into the grocery store. Sarah lingers outside, tense and awkward. Then he emerges with the sandwiches and they stroll away down the avenue together. They amble slowly, their gazes fixed straight ahead. He strives to overlook her uneven stride. They pass beneath the canopy of the neighborhood's refined Italian bistro. As she searches through her backpack for her gloves, he extends a hand and rests it on her elbow. She shuts her eyes, then leans back against the gate, apprehensive, like a cornered creature. He cradles her head in his hands and embraces her. She reacts, but as he grips her more firmly, she begins to resist. She shoves him away and shakes her head. They remain there for an extended moment: she averts her gaze; he stares at the ground. Then Eddie takes the sack of sandwiches and tucks it under her elbow. He leaves her there in the corridor and strides off. A gate opens. A concierge guides Eddie into a shabby, sparsely decorated lounge. He reaches into his wallet and extracts some coins. Eddie takes his packages from the closet. The sight of the bakery reminds him of Sarah. But the café is vacant; only the cleaner is present, polishing up. Eddie retrieves his packages and exits. Eddie, on his way back to the lounge, pauses at the same grocery store for a sandwich. He enters his lounge, sets down his packages and the sandwich, and reclines on his corroded metal sofa. From his wallet, he extracts the few crumpled coins he has left. He gazes at the money, shakes his head in frustration, and shuts his eyes. It is a cozy, neighborhood arcade for commuters and tea enthusiasts. Eddie saunters casually by the pinball machine and over to the arcade counter."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "She glances at Oliver nervously as she scratches in her backpack for the pebbles. She hands over, gathers her backpack and magazine, and stands to vanish. The alarm clock chirps over the clamor of the cramped library. The librarian bends over and pats Oliver on the elbow. He jolts awake with a stiff wrist. The café is nearly deserted when Oliver arrives. As he glances around the café, he notices Mia, solitary at a distant table, nibbling a cupcake. She looks entertained by their rendezvous. He grabs his sandwich and settles with her at the table. Mia winks. There is a prolonged silence as she attempts to interpret his expression. Oliver devours his sandwich, stands, strides to the kitchen, settles the invoice, and returns to the table. As they step out, Mia trips, and he steadies her by the hand. Oliver halts for a moment to acknowledge this as she hobbles away, then trails after. Oliver walks into the bakery. Mia lingers outside, rigid and jittery. Then he emerges with the cookies and they stroll off down the avenue together. They tread leisurely, with their attention fixed directly ahead. He strives to disregard her jerky stride. They wander beneath the canopy of the district's fancy Italian bistro. As she rifles through her backpack for her lock, he stretches out and places his hand on her elbow. She shuts her eyes, then retreats against the gate, anxious, like a menaced feline. He cups her face in his hands and embraces her. She reacts, but as he clutches her more firmly, she begins to resist. She shoves him away and shakes her face. They linger there for a lingering moment: she averts her gaze; he gazes downward at the carpet. Then Oliver hands the packet of cookies and positions it beneath her hand. He departs her there in the corridor and strides away. A window unlatches. A janitor guides Oliver into a shabby, sparsely decorated chamber. He reaches in his pouch and extracts some coins. Oliver retrieves his suitcases from the vault. The vision of the art studio reminds him of Mia. But the studio is vacant; only the curator is there, sweeping up. Oliver hoists his suitcases and exits. Oliver, en route back to the hostel, halts at the same bakery for a croissant. He enters his chamber, sets down his suitcases and the croissant, and reclines on his tarnished metal bench. From his pouch, he extracts the few crumpled coins he has remaining. He inspects the currency, shakes his face with annoyance, and shuts his eyes. It is a cordial, local café for scholars and espresso sippers. Oliver meanders nonchalantly by the chess board and over to the café."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Eddie awakens in a crowded luncheonette and encounters Sarah at a bar. They share a drink, and when leaving, Sarah stumbles, and Eddie supports her. They proceed to a liquor store, with Sarah waiting outside uneasily. As Sarah searches for her keys, Eddie kisses her, but she resists, ending their brief moment. Eddie places a bag of scotch under her arm and departs, leaving Sarah in the hallway. He checks into a rundown hotel room, retrieves his bags, and reflects on Sarah's memory at an empty lunch counter. On his way back, Eddie purchases another liquor bottle, sits on his bed, and looks at his dwindling money with dismay, before visiting a neighborhood bar."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Eddie walks casually by the pool table and over to the bar It is a friendly neighborhood bar for business people and cocktail drinkers He looks at the money shakes his head disgustedly and closes his eyes From his pocket he pulls out the few crumpled bills he has left He enters his room puts down his bags and the liquor and sits on his rusted brass bed Eddie on his way back to the hotel stops at the same liquor store for a bottle Eddie picks up his bags and goes out only the janitor is there mopping up But the lunchroom is empty The sight of the lunch counter reminds him of Sarah Eddie removes his bags from the locker He reaches in his pocket and pulls out some bills A hotel manager shows Eddie into a dingy barely furnished room A door opens He leaves her there in the hall and walks off Then Eddie takes the bag of scotch and places it underneath her arm he looks down at the floor she looks away They stand there for a long moment She pushes him away and shakes her head She responds but as he holds her tighter she starts to struggle He takes her head in his hands and kisses her She closes her eyes then draws back against the door fearful like a threatened animal As she searches through her purse for her keys he reaches out and puts his hand on her shoulder They pass under the awning of the neighborhood's elegant Parisien restaurant He tries to ignore her halting gait They walk slowly with their eyes pointed straight ahead Then he comes out with the scotch and they walk off down the street together Sarah waits outside stiff and uneasy Eddie goes into the liquor store Eddie pauses a moment to register this as she limps off then follows As they go out Sarah stumbles and he catches her by the arm Eddie finishes his drink rises crosses to the bar pays the bill and returns to the booth There is a long pause as she tries to read his face Sarah nods He takes his drink and joins her at the booth She seems amused by their encounter As he looks around the bar he sees Sarah alone at a back booth sipping a highball The bar is nearly empty when Eddie comes in He wakes up with a cramped neck The waitress leans over and slaps Eddie on the shoulder The public address system bleats over the noise of the crowded luncheonette She pays collects her purse and book and rises to leave She looks at Eddie anxiously as she digs in her purse for the coins"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Sarah nods The waitress leans over and slaps Eddie on the shoulder There is a long pause as she tries to read his face Eddie removes his bags from the locker He enters his room puts down his bags and the liquor and sits on his rusted brass bed He tries to ignore her halting gait A hotel manager shows Eddie into a dingy barely furnished room she looks away He wakes up with a cramped neck But the lunchroom is empty She responds but as he holds her tighter she starts to struggle Eddie finishes his drink rises crosses to the bar pays the bill and returns to the booth A door opens She closes her eyes then draws back against the door fearful like a threatened animal As they go out Sarah stumbles and he catches her by the arm They stand there for a long moment Eddie picks up his bags and goes out Eddie on his way back to the hotel stops at the same liquor store for a bottle Then Eddie takes the bag of scotch and places it underneath her arm Eddie pauses a moment to register this as she limps off then follows She pushes him away and shakes her head As she searches through her purse for her keys he reaches out and puts his hand on her shoulder He takes her head in his hands and kisses her He leaves her there in the hall and walks off Eddie walks casually by the pool table and over to the bar She looks at Eddie anxiously as she digs in her purse for the coins They pass under the awning of the neighborhood's elegant Parisien restaurant Then he comes out with the scotch and they walk off down the street together It is a friendly neighborhood bar for business people and cocktail drinkers only the janitor is there mopping up He reaches in his pocket and pulls out some bills He looks at the money shakes his head disgustedly and closes his eyes The public address system bleats over the noise of the crowded luncheonette he looks down at the floor The bar is nearly empty when Eddie comes in The sight of the lunch counter reminds him of Sarah As he looks around the bar he sees Sarah alone at a back booth sipping a highball He takes his drink and joins her at the booth Eddie goes into the liquor store Sarah waits outside stiff and uneasy They walk slowly with their eyes pointed straight ahead She pays collects her purse and book and rises to leave She seems amused by their encounter From his pocket he pulls out the few crumpled bills he has left"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "He takes her head in his hands and kisses her She responds but as he holds her tighter she starts to struggle She pushes him away and shakes her head They stand there for a long moment she looks away he looks down at the floor Then Eddie takes the bag of scotch and places it underneath her arm He leaves her there in the hall and walks off A door opens A hotel manager shows Eddie into a dingy barely furnished room He reaches in his pocket and pulls out some bills Eddie removes his bags from the locker The sight of the lunch counter reminds him of Sarah But the lunchroom is empty only the janitor is there mopping up Eddie picks up his bags and goes out Eddie on his way back to the hotel stops at the same liquor store for a bottle He enters his room puts down his bags and the liquor and sits on his rusted brass bed From his pocket he pulls out the few crumpled bills he has left He looks at the money shakes his head disgustedly and closes his eyes It is a friendly neighborhood bar for business people and cocktail drinkers Eddie walks casually by the pool table and over to the bar She looks at Eddie anxiously as she digs in her purse for the coins She pays collects her purse and book and rises to leave The public address system bleats over the noise of the crowded luncheonette The waitress leans over and slaps Eddie on the shoulder He wakes up with a cramped neck The bar is nearly empty when Eddie comes in As he looks around the bar he sees Sarah alone at a back booth sipping a highball She seems amused by their encounter He takes his drink and joins her at the booth Sarah nods There is a long pause as she tries to read his face Eddie finishes his drink rises crosses to the bar pays the bill and returns to the booth As they go out Sarah stumbles and he catches her by the arm Eddie pauses a moment to register this as she limps off then follows Eddie goes into the liquor store Sarah waits outside stiff and uneasy Then he comes out with the scotch and they walk off down the street together They walk slowly with their eyes pointed straight ahead He tries to ignore her halting gait They pass under the awning of the neighborhood's elegant Parisien restaurant As she searches through her purse for her keys he reaches out and puts his hand on her shoulder She closes her eyes then draws back against the door fearful like a threatened animal"
        }
      ]
    }
  ]
}