{
  "ground_truth": "The raincoats swaying slowly. The camera approaches one of them. From the pocket projects a bottle of whiskey. He is wiping his parched mouth. He puts the handkerchief back. He fishes the coat check from his pocket, buries it in his fist, fighting the foolish impulse. He rises and, to the irritation of his neighbors, leaves his seat amid some disapproving shushings from the row behind. He puts the check on the counter. The attendant looks up from a newspaper. The attendant takes the check and leaves. Don rolls his program and sticks it into the sand of the cuspidor. The attendant returns. The attendant holds a short leopard coat and a lady's small umbrella. Don looks. Don's nervousness is mounting. He is biting his lips, unable to find another argument. He shoves the leopard coat and umbrella close to Don. The attendant has returned to the other end of the counter and resumed his doze. He takes his coat rather brusquely, thrusts the leopard coat at her. Don takes the coat, feels it hurriedly to make sure the bottle is still there, and starts away. Helen is left with the leopard coat and his bowler. Don comes back, takes the hat, starts away again. His patience exhausted, Don stops again, takes the umbrella and tosses it in Helen's direction. Helen, who is getting into her coat, can't catch it. It falls right next to her. Don stands abashed. He goes back, picks up the umbrella. As they go on talking, they walk from the cloak room, through the vestibule, to the street, Don carrying his coat over his arm. There is a split second of indecision but it is ended by Don's awareness of the bottle in his raincoat. He is unfurling his raincoat in order to put it on before he steps from under the marquee. Helen is about a step and a half away when there is a crash. On the sidewalk lies the pint of whiskey, broken. She stops and looks down, as does Don. She goes. Don looks at the broken bottle, then after Helen. With sudden decision he calls after her. It is dark and the rain has settled to a drizzle. He joins her, takes the umbrella out of her hand and holds it over them both as they go down the street. As we have left it, empty save for Nat and Don. Sunlight outside. Nat is now taking the chairs from the tables and arranging the bar for the afternoon and evening trade, while Don leans back against the bar, the jigger of whiskey in his hand, and goes on talking. Don drinks. It is filled with the routine activity of a big commercial hotel on a hot summer day.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "The raincoats swaying slowly. The camera approaches one of them. From the bag extends a bottle of whiskey. He is wiping his dry lips. He returns the handkerchief back. He retrieves the coat check from his pocket, buries it in his grasp, resisting the foolish impulse. He stands and, to the irritation of his neighbors, leaves his seat amid some disapproving murmurs from the row behind. He places the slip on the counter. The attendant looks up from a magazine. The attendant takes the slip and leaves. Don folds his brochure and embeds it into the sand of the spittoon. The attendant returns. The attendant holds a short leopard jacket and a woman’s small umbrella. Don watches. Don's agitation is increasing. He is biting his lips, unable to find another reason. He pushes the leopard jacket and umbrella near to Don. The attendant has returned to the other side of the counter and resumed his nap. He takes his jacket rather curtly, thrusts the leopard jacket at her. Don grabs the jacket, feels it quickly to confirm the bottle is still there, and proceeds. Helen is left with the leopard jacket and his derby. Don returns, takes the hat, proceeds again. His composure depleted, Don pauses again, takes the umbrella and flings it in Helen's direction. Helen, who is wearing her jacket, can't catch it. It lands right beside her. Don stands embarrassed. He returns, picks up the umbrella. As they continue conversing, they stroll from the cloakroom, through the foyer, to the street, Don carrying his jacket over his arm. There is a brief moment of hesitation but it is resolved by Don's awareness of the bottle in his raincoat. He is unfolding his raincoat in order to wear it before he steps from under the canopy. Helen is about a step and a half away when there is a crash. On the pavement lies the pint of whiskey, shattered. She pauses and gazes down, as does Don. She departs. Don gazes at the shattered bottle, then after Helen. With sudden resolve he calls after her. It is dark and the rain has settled to a drizzle. He joins her, takes the umbrella out of her hand and holds it over them both as they walk down the street. As we have left it, vacant save for Nat and Don. Sunlight outside. Nat is now taking the chairs from the tables and arranging the counter for the afternoon and evening business, while Don leans back against the counter, the measure of whiskey in his hand, and continues talking. Don drinks. It is filled with the routine activity of a big commercial inn on a warm summer day."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The raincoats are swaying slowly. One of them is approached by the camera. A bottle of whiskey is projected from the pocket. His parched mouth is being wiped by him. The handkerchief is put back by him. The coat check is fished from his pocket by him, and it is buried in his fist, fighting the foolish impulse. He rises, and his seat is left by him amid some disapproving shushings from the row behind, to the irritation of his neighbors. The check is put on the counter by him. The attendant looks up from a newspaper. The check is taken by the attendant, who then leaves. Don rolls his program and it is stuck into the sand of the cuspidor by him. The attendant returns. A short leopard coat and a lady's small umbrella are held by the attendant. Don looks. Don’s nervousness is mounting. His lips are being bitten by him, unable to find another argument. The leopard coat and umbrella are shoved close to Don by the attendant. The attendant returns to the other end of the counter and resumes his doze. His coat is taken rather brusquely by him, and the leopard coat is thrust at her by him. The coat is taken by Don, who feels it hurriedly to make sure the bottle is still there, and he starts away. Helen is left with the leopard coat and his bowler. Don returns, takes the hat, and starts away again. His patience exhausted, he stops again and takes the umbrella, tossing it in Helen's direction. Helen, who is getting into her coat, can’t catch it. Right next to her it falls. Abashed, Don stands. The umbrella is picked up by him. The cloak room is left by them as they go on talking, through the vestibule, and to the street, Don carrying his coat over his arm. There is a split second of indecision, but Don's awareness of the bottle in his raincoat ends it. His raincoat is unfurled by him in order to put it on before stepping from under the marquee. Helen is about a step and a half away when a crash is heard. On the sidewalk lies the pint of whiskey, broken. She stops and looks down, as does Don. She goes. The broken bottle is looked at by Don, then after Helen. With sudden decision, he calls after her. It is dark, and a drizzle has settled from the rain. He joins her, takes the umbrella from her hand, and holds it over them both as they go down the street. As we have left it, Nat and Don are the only ones present. Sunlight is outside. The chairs are now being taken from the tables and arranged for the afternoon and evening trade by Nat, while Don leans back against the bar with the jigger of whiskey in his hand and continues talking. Don drinks. The routine activity of a big commercial hotel on a hot summer day fills it."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "The raincoats sway slowly as the camera nears one. A whiskey bottle protrudes from its pocket. He wipes his dry mouth, returns the handkerchief, pulls out a coat check, and clenches it, resisting temptation. Rising to his neighbors’ annoyance, he exits to disapproving shushes. At the counter, he hands the check to the attendant, who looks up from a newspaper, takes it, and walks off. Don rolls his program and sticks it into the cuspidor's sand. The attendant returns with a short leopard coat and a small umbrella. Don, anxious and lip-biting, offers no resistance as they’re shoved toward him. The attendant resumes his nap. Don grabs his coat, checks for the bottle, and starts off. Helen is left with the leopard coat and his bowler. Don returns, grabs his hat, starts off again, then halts, tosses the umbrella to Helen—she misses it. It drops beside her. Don, embarrassed, retrieves it. As they talk, they walk from the cloakroom to the street, Don carrying his coat. A moment’s hesitation ends when Don feels the bottle. He unfurls his raincoat to wear it before stepping out. A crash—his whiskey lies shattered on the sidewalk. Helen and Don both stare. She walks off. He looks at the bottle, then at her, and suddenly calls out. Rain drizzles in the dark. He joins her, takes the umbrella from her hand, and shields them both as they walk on. The scene returns to Nat and Don alone. Sunlight streams in. Nat sets chairs and readies the bar for the afternoon. Don leans on the bar, whiskey in hand, and talks. He drinks. The hotel buzzes with routine summer activity."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "The raincoats sway. The camera nears one with whiskey in its pocket. He wipes his mouth, replaces the handkerchief, and clutches the coat check, resisting impulse. He rises, irritating neighbors, and leaves amid shushes. He gives the check to the attendant, who retrieves a leopard coat and umbrella. Don nervously bites his lips. The attendant shoves the coat and umbrella to Don, then dozes. Don brusquely takes his coat, ensures the bottle is there, and leaves. Helen is left with the coat and bowler. Don returns, takes his hat, and leaves again. Frustrated, Don tosses the umbrella to Helen, but she misses. He retrieves it, and they exit to the street. Don unfurls his raincoat, aware of the bottle. A crash reveals the broken whiskey on the sidewalk. Helen and Don look down. She leaves, but he calls after her, joining her and sharing the umbrella. They walk together. Nat and Don remain. Sunlight outside. Nat arranges the bar, and Don drinks whiskey, talking. It's a routine day at a commercial hotel."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "The raincoats are gently swaying back and forth, almost as if they are dancing in the soft breeze. The camera slowly zooms in on one particular raincoat. From the pocket of this coat, a bottle of whiskey is visibly protruding. The man, whose mouth is dry and parched, wipes it with a handkerchief. After doing so, he carefully places the handkerchief back into his pocket. He then retrieves a coat check from his pocket, clenching it tightly in his fist, as if battling a foolish impulse. Rising from his seat, he inadvertently annoys his neighbors, who express their irritation with disapproving shushes from the row behind him. He proceeds to place the coat check on the counter. The attendant, who had been engrossed in reading a newspaper, looks up. Taking the check, the attendant leaves momentarily. Meanwhile, Don rolls up his program and sticks it into the sand of the cuspidor. The attendant soon returns, holding a short leopard coat and a small lady's umbrella. Don's nervousness is visibly increasing; he bites his lips, unable to muster another argument. The attendant pushes the leopard coat and umbrella towards Don, then returns to the other end of the counter, resuming his doze. Don takes his own coat rather abruptly and thrusts the leopard coat at Helen. He hurriedly feels his coat to ensure the bottle is still there and begins to walk away. Helen is left holding the leopard coat and his bowler hat. Don returns, retrieves the hat, and starts to leave once more. His patience wearing thin, Don stops again, picks up the umbrella, and tosses it in Helen's direction. Helen, who is in the process of putting on her coat, fails to catch it, and it falls right beside her. Don stands there, feeling embarrassed. He goes back, picks up the umbrella, and as they continue their conversation, they walk from the cloakroom, through the vestibule, and out to the street, with Don carrying his coat draped over his arm. There is a brief moment of indecision, but it is quickly resolved by Don's awareness of the bottle in his raincoat. He unfurls his raincoat, preparing to put it on before stepping out from under the marquee. Helen is about a step and a half away when suddenly there is a crash. On the sidewalk lies the pint of whiskey, shattered. She stops and looks down at the broken glass, as does Don. She continues on her way. Don gazes at the broken bottle, then after Helen. With a sudden resolve, he calls out to her. The night is dark, and the rain has settled into a gentle drizzle. He catches up to her, takes the umbrella from her hand, and holds it over both of them as they walk down the street together. As we leave the scene, it is empty except for Nat and Don. Sunlight streams in from outside. Nat is busy taking chairs from the tables and arranging the bar for the afternoon and evening trade, while Don leans back against the bar, a jigger of whiskey in his hand, continuing to talk. Don takes a drink. The scene is filled with the routine activity of a bustling commercial hotel on a hot summer day."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "The raincoats are gently swaying back and forth, almost as if they are engaged in an elegant dance with the soft, gentle breeze. The camera, with slow and deliberate movement, zooms in on one raincoat in particular. From the pocket of this specifically highlighted coat, a bottle of whiskey is visibly protruding, its presence unmistakable. The man, whose mouth is dry, parched, and yearning for moisture, wipes it meticulously with a handkerchief. After attending to this task, he carefully places the handkerchief back into his pocket with considered care. He then retrieves a coat check from his pocket, clenching it tightly in his fist, as if struggling against a foolish, impulsive urge. Rising from his seat, he inadvertently annoys his neighbors, who express their irritation with disapproving shushes coming from the row behind him. He proceeds to place the coat check on the counter in front of him. The attendant, who had been deeply engrossed in reading a newspaper, looks up with mild surprise. Taking the check, the attendant leaves the counter momentarily. Meanwhile, Don rolls up his program, transforming it into a small cylinder, and sticks it into the sand of the cuspidor. The attendant soon returns, holding a short leopard coat and a small lady's umbrella in his hands. Don's nervousness is visibly intensifying; he bites his lips, unable to muster another argument. The attendant pushes the leopard coat and umbrella towards Don, then returns to the other end of the counter, resuming his earlier doze. Don takes hold of his own coat rather abruptly and thrusts the leopard coat towards Helen. He hurriedly feels his coat to ensure that the bottle is still safely nestled there and begins to walk away. Helen is left holding not only the leopard coat but also his bowler hat. Don returns, retrieves the hat from her, and starts to leave once more. His patience wearing thin, Don stops again to pick up the umbrella and tosses it in Helen’s direction. Helen, who is in the process of putting on her coat, fails to catch it, and it falls right beside her, missing her grasp. Don stands there, feeling a sense of embarrassment. He goes back to pick up the umbrella, and as they continue their conversation, they walk together from the cloakroom, through the vestibule, and out to the street, with Don carrying his coat draped over his arm. There is a brief moment of indecision, but it is quickly resolved by Don's heightened awareness of the bottle in his raincoat pocket. He unfurls his raincoat, preparing himself to put it on before stepping out from under the protective shelter of the marquee. Helen is about a step and a half away when, suddenly, there is an unexpected crash. On the sidewalk lies the pint of whiskey, shattered into pieces. She halts and looks down at the broken glass, as does Don. She continues on her way, unabated. Don gazes at the broken bottle, then after Helen. With sudden resolve and determination, he calls out to her. The night is dark, and the rain has settled into a gentle, persistent drizzle. He catches up to her, takes the umbrella from her hand, and holds it over both of them as they walk down the street together. As we leave this scene, it is empty except for Nat and Don. Sunlight streams in vibrantly from outside. Nat is absorbed in the task of taking chairs from the tables and arranging the bar meticulously for the afternoon and evening trade, while Don leans back against the bar, a jigger of whiskey in his hand, continuing to talk. Don takes a drink, savoring it. The scene is filled with the routine activity of a bustling commercial hotel on a hot summer day."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "The raincoats are swaying slowly in the gentle breeze, creating a rhythmic motion that captures the eye. The camera gradually zooms in on one particular raincoat, drawing closer until the details become clear. From the pocket of this raincoat, a bottle of whiskey protrudes slightly, hinting at its presence. The man, feeling the dryness of his mouth, wipes it with a handkerchief, savoring the brief relief it provides. He then carefully folds the handkerchief and tucks it back into his pocket. With a sense of determination, he retrieves a coat check from his pocket, clenching it tightly in his fist as he battles an internal urge he deems foolish. Rising from his seat, he inadvertently disturbs his neighbors, who express their annoyance with disapproving shushes from the row behind him. Ignoring the irritation, he makes his way to the counter, where he places the coat check down. The attendant, momentarily distracted from reading a newspaper, looks up to acknowledge the check. Taking the check, the attendant departs to fulfill the request. Meanwhile, Don rolls up his program and casually inserts it into the sand of the cuspidor, a habitual gesture. The attendant soon returns, holding a short leopard coat and a lady's small umbrella, presenting them to Don. As Don's nervousness intensifies, he bites his lips, struggling to articulate another argument. The attendant, having completed his task, shoves the leopard coat and umbrella towards Don before returning to the other end of the counter to resume his doze. Don, feeling a sense of urgency, takes his own coat rather brusquely and thrusts the leopard coat at Helen. He hurriedly checks his coat to ensure the bottle is still safely inside, then begins to walk away. Helen is left holding the leopard coat and his bowler hat. Realizing his oversight, Don returns to retrieve the hat, then starts to leave once more. Frustrated, he pauses again, picks up the umbrella, and tosses it towards Helen, who is in the process of putting on her coat. Unable to catch it, the umbrella lands beside her. Don, feeling embarrassed, goes back to pick up the umbrella. As they continue their conversation, they walk together from the cloakroom, through the vestibule, and out to the street, with Don carrying his coat draped over his arm. A moment of hesitation grips him, but it quickly dissipates as he becomes acutely aware of the bottle nestled in his raincoat. He unfurls his raincoat, preparing to put it on before stepping out from under the protective cover of the marquee. Helen is just a step and a half ahead when a sudden crash echoes through the air. On the sidewalk lies the shattered remains of the whiskey bottle. Both Helen and Don stop to look down at the broken glass. Helen then continues on her way. Don, torn between the broken bottle and Helen, makes a sudden decision and calls after her. The night is dark, and the rain has settled into a gentle drizzle. He catches up to her, takes the umbrella from her hand, and holds it over them both as they walk down the street together. The scene shifts to an empty space, save for Nat and Don. Sunlight streams in from outside as Nat busies himself by taking chairs from the tables and arranging the bar in preparation for the afternoon and evening trade. Don leans back against the bar, a jigger of whiskey in his hand, continuing his conversation. He takes a drink, savoring the moment amidst the routine activity of a bustling commercial hotel on a hot summer day."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "The camera focuses on a raincoat with a whiskey bottle protruding from its pocket. Don wipes his mouth, pockets his handkerchief, and clutches a coat check, resisting an impulse. He rises, drawing disapproving shushes from nearby patrons, and places the check on the counter. The attendant, momentarily distracted from a newspaper, retrieves a short leopard coat and a lady's umbrella. Don, visibly nervous, accepts them, ensuring the whiskey bottle remains in his coat. He brusquely hands the leopard coat to Helen, retrieves his bowler, and awkwardly tosses the umbrella, which she misses. Embarrassed, he picks it up, and they exit the cloakroom, walking through the vestibule to the street. Don, aware of the whiskey, unfurls his raincoat to wear it just as the bottle crashes to the sidewalk. Both he and Helen pause to look at the broken bottle before she departs. Don, after a moment of decision, calls after her, joins her, and takes the umbrella to shield them both from the drizzle as they walk down the street. Later, in a sunlit, bustling hotel bar, Nat arranges chairs for the afternoon trade while Don, leaning against the bar with a jigger of whiskey, continues their conversation and drinks."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "The raincoats, swaying slowly in the dim light of the theater, create a quiet rustle in the air. The camera approaches one of them, capturing its worn fabric. From the pocket projects a bottle of whiskey, a common brand known for its robust flavor. He is wiping his parched mouth with the finesse of someone well-acquainted with such moments. He puts the handkerchief back, its embroidered initials indicating a personal touch amidst the evening’s events. He fishes the coat check from his pocket, buries it in his fist, fighting the foolish impulse to dash out into the busy streets of New York City. He rises and, to the irritation of his neighbors in this packed theater, leaves his seat amid some disapproving shushings from the row behind. He puts the check on the counter of the cloakroom, a small, tucked-away space in the lobby. The attendant, a familiar figure in these parts, looks up from reading the sports section of a local newspaper. The attendant takes the check and leaves to retrieve the coat. Don rolls his program, an elegant playbill from tonight's performance, and sticks it into the sand of the cuspidor, an object once common in such venues. The attendant returns. The attendant holds a short leopard coat, an extravagant piece that seems out of place here, and a lady's small umbrella, likely a fashionable accessory for the rain outside. Don looks. Don's nervousness is mounting, a familiar anxiety swelling within him. He is biting his lips, unable to find another argument in his mind. He shoves the leopard coat and umbrella close to Don. The attendant has returned to the other end of the counter and resumed his doze, an old habit from many long shifts. He takes his coat rather brusquely, thrusts the leopard coat at her, who is standing nearby. Don takes the coat, feels it hurriedly to make sure the bottle is still there, a precaution he's taken more than once, and starts away. Helen is left with the leopard coat and his bowler, a classic hat style that matches his attire. Don comes back, takes the hat, a well-worn favorite, starts away again. His patience exhausted, Don stops again, takes the umbrella and tosses it in Helen's direction. Helen, who is getting into her coat, can't catch it. It falls right next to her on the polished floor. Don stands abashed. He goes back, picks up the umbrella. As they go on talking, they walk from the cloak room, through the vestibule, to the street, Don carrying his coat over his arm, a familiar scene in this bustling district. There is a split second of indecision but it is ended by Don's awareness of the bottle in his raincoat, a continuous reminder of the night's unease. He is unfurling his raincoat in order to put it on before he steps from under the theater marquee, its neon lights flickering softly. Helen is about a step and a half away when there is a crash. On the sidewalk lies the pint of whiskey, broken, its contents seeping into the cracks. She stops and looks down, as does Don. She goes, her silhouette merging into the night's drizzle. Don looks at the broken bottle, then after Helen, her figure barely discernible now. With sudden decision he calls after her, his voice breaking the rhythmic patter of the rain. It is dark and the rain has settled to a drizzle, a gentle but persistent presence. He joins her, takes the umbrella out of her hand and holds it over them both as they go down the street, a gesture of unspoken reconciliation. As we have left it, the bar is empty save for Nat and Don. Sunlight outside spills across the room. Nat is now taking the chairs from the tables and arranging the bar for the afternoon and evening trade, a routine task in this bustling establishment, while Don leans back against the bar, the jigger of whiskey in his hand, savoring the moment, and goes on talking. Don drinks, the liquid offering a fleeting comfort. It is filled with the routine activity of a big commercial hotel on a hot summer day, bustling with guests and staff alike."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "The raincoats swaying slowly  The camera approaches one of them  From the pocket projects a bottle of whiskey  He is wiping his parched mouth  He puts the handkerchief back  He fishes the coat check from his pocket buries it in his fist fighting the foolish impulse  He rises and to the irritation of his neighbors leaves his seat amid some disapproving shushings from the row behind  Helen is left with the leopard coat and his bowler  Don comes back takes the hat starts away again  His patience exhausted  Don stops again takes the umbrella and tosses it in Helen's direction  Helen who is getting into her coat can't catch it  It falls right next to her  Don stands abashed  He goes back picks up the umbrella  As they go on talking they walk from the cloak room through the vestibule to the street  Don carrying his coat over his arm  There is a split second of indecision but it is ended by Don's awareness of the bottle in his raincoat  He is unfurling his raincoat in order to put it on before he steps from under the marquee  Helen is about a step and a half away when there is a crash  On the sidewalk lies the pint of whiskey broken  She stops and looks down as does Don  She goes  Don looks at the broken bottle then after Helen  With sudden decision he calls after her  It is dark and the rain has settled to a drizzle  He joins her takes the umbrella out of her hand and holds it over them both as they go down the street  As we have left it empty save for Nat and Don  Sunlight outside  Nat is now taking the chairs from the tables and arranging the bar for the afternoon and evening trade while Don leans back against the bar the jigger of whiskey in his hand and goes on talking  He puts the check on the counter  The attendant looks up from a newspaper  The attendant takes the check and leaves  Don rolls his program and sticks it into the sand of the cuspidor  The attendant returns  The attendant holds a short leopard coat and a lady's small umbrella  Don looks  Don's nervousness is mounting  He is biting his lips unable to find another argument  He shoves the leopard coat and umbrella close to Don  The attendant has returned to the other end of the counter and resumed his doze  He takes his coat rather brusquely thrusts the leopard coat at her  Don takes the coat feels it hurriedly to make sure the bottle is still there and starts away  Helen is left with the leopard coat and his bowler  Don comes back takes the hat starts away again  His patience exhausted  Don stops again takes the umbrella and tosses it in Helen's direction  Helen who is getting into her coat can't catch it  It falls right next to her  Don stands abashed  He goes back picks up the umbrella  As they go on talking they walk from the cloak room through the vestibule to the street  Don carrying his coat over his arm  There is a split second of indecision but it is ended by Don's awareness of the bottle in his raincoat  He is unfurling his raincoat in order to put it on before he steps from under the marquee  Helen is about a step and a half away when there is a crash  On the sidewalk lies the pint of whiskey broken  She stops and looks down as does Don  She goes  Don looks at the broken bottle then after Helen  With sudden decision he calls after her  It is dark and the rain has settled to a drizzle  He joins her takes the umbrella out of her hand and holds it over them both as they go down the street  As we have left it empty save for Nat and Don  Sunlight outside  Nat is now taking the chairs from the tables and arranging the bar for the afternoon and evening trade while Don leans back against the bar the jigger of whiskey in his hand and goes on talking  Don drinks  It is filled with the routine activity of a big commercial hotel on a hot summer day"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "The raincoats swaying slowly. The camera approaches one of them. From the pocket projects a bottle of whiskey. He is wiping his parched mouth. He puts the handkerchief back. He fishes the coat check from his pocket buries it in his fist fighting the foolish impulse. He rises and to the irritation of his neighbors leaves his seat amid some disapproving shushings from the row behind. He puts the check on the counter. The attendant looks up from a newspaper. The attendant takes the check and leaves. Don rolls his program and sticks it into the sand of the cuspidor. The attendant returns. The attendant holds a short leopard coat and a lady's small umbrella. Don looks. Don's nervousness is mounting. He is biting his lips unable to find another argument. He shoves the leopard coat and umbrella close to Don. The attendant has returned to the other end of the counter and resumed his doze. He takes his coat rather brusquely thrusts the leopard coat at her. Don takes the coat feels it hurriedly to make sure the bottle is still there and starts away. Helen is left with the leopard coat and his bowler. Don comes back takes the hat starts away again. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. His patience exhausted. Don stops again takes the umbrella and tosses it in Helen's direction. Helen who is getting into her coat cannot catch it. It falls right next to her. Don stands abashed. He goes back picks up the umbrella. As they go on talking they walk from the cloak room through the vestibule to the street. Don carrying his coat over his arm. There is a split second of indecision but it is ended by Don's awareness of the bottle in his raincoat. He is unfurling his raincoat in order to put it on before he steps from under the marquee. Helen is about a step and a half away when there is a crash. On the sidewalk lies the pint of whiskey broken. She stops and looks down as does Don. She goes. Don looks at the broken bottle then after Helen. With sudden decision he calls after her. It is dark and the rain has settled to a drizzle. He joins her takes the umbrella out of her hand and holds it over them both as they go down the street. As we have left it empty save for Nat and Don. Sunlight outside. Nat is now taking the chairs from the tables and arranging the bar for the afternoon and evening trade while Don leans back against the bar the jigger of whiskey in his hand and goes on talking. Don drinks. It is filled with the routine activity of a big commercial hotel on a hot summer day."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "The raincoats swaying slowly. The camera approaches one of them. From the pocket projects a bottle of whiskey. He is wiping his parched mouth. He puts the handkerchief back. He fishes the coat check from his pocket buries it in his fist fighting the foolish impulse. He rises and to the irritation of his neighbors leaves his seat amid some disapproving shushings from the row behind. He puts the check on the counter. The attendant looks up from a newspaper. The attendant takes the check and leaves. Don rolls his program and sticks it into the sand of the cuspidor. The attendant returns. The attendant holds a short leopard coat and a lady's small umbrella. Don looks. Don's nervousness is mounting. He is biting his lips unable to find another argument. He shoves the leopard coat and umbrella close to Don. The attendant has returned to the other end of the counter and resumed his doze. He takes his coat rather brusquely thrusts the leopard coat at her. Don takes the coat feels it hurriedly to make sure the bottle is still there and starts away. Helen is left with the leopard coat and his bowler. Don comes back takes the hat starts away again. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. His patience exhausted. Don stops again takes the umbrella and tosses it in Helen's direction. Helen who is getting into her coat cannot catch it. It falls right next to her. Don stands abashed. He goes back picks up the umbrella. As they go on talking they walk from the cloak room through the vestibule to the street. Don carrying his coat over his arm. There is a split second of indecision but it is ended by Don's awareness of the bottle in his raincoat. He is unfurling his raincoat in order to put it on before he steps from under the marquee. Helen is about a step and a half away when there is a crash. On the sidewalk lies the pint of whiskey broken. She stops and looks down as does Don. She goes. Don looks at the broken bottle then after Helen. With sudden decision he calls after her. It is dark and the rain has settled to a drizzle. He joins her takes the umbrella out of her hand and holds it over them both as they go down the street. As we have left it empty save for Nat and Don. Sunlight outside. Nat is now taking the chairs from the tables and arranging the bar for the afternoon and evening trade while Don leans back against the bar the jigger of whiskey in his hand and goes on talking. Don drinks. It is filled with the routine activity of a big commercial hotel on a hot summer day."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "The raincoats swaying slowly. The camera approaches one of them. From the pocket projects a bottle of whiskey. He is wiping his parched mouth. He puts the handkerchief back. He fishes the coat check from his pocket buries it in his fist fighting the foolish impulse. He rises and to the irritation of his neighbors leaves his seat amid some disapproving shushings from the row behind. He puts the check on the counter. The attendant looks up from a newspaper. The attendant takes the check and leaves. Don rolls his program and sticks it into the sand of the cuspidor. On the sidewalk lies the pint of whiskey broken. She stops and looks down as does Don. She goes. Don looks at the broken bottle then after Helen. With sudden decision he calls after her. It is dark and the rain has settled to a drizzle. He joins her takes the umbrella out of her hand and holds it over them both as they go down the street. As we have left it empty save for Nat and Don. Sunlight outside. Nat is now taking the chairs from the tables and arranging the bar for the afternoon and evening trade while Don leans back against the bar the jigger of whiskey in his hand and goes on talking. Don drinks. It is filled with the routine activity of a big commercial hotel on a hot summer day."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "The raincoats swaying slowly. The camera approaches one of them. From the pocket projects a bottle of whiskey. He is wiping his parched mouth. As we have left it empty save for Nat and Don. Sunlight outside. Nat is now taking the chairs from the tables and arranging the bar for the afternoon and evening trade while Don leans back against the bar the jigger of whiskey in his hand and goes on talking. Don drinks. It is filled with the routine activity of a big commercial hotel on a hot summer day."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The raincoats swaying slowly. The camera approaches one of them. From the pocket projects a bottle of whiskey. A squirrel is wiping its parched mouth. The squirrel puts the handkerchief back. The squirrel fishes the coat check from its pocket, buries it in its fist, fighting the foolish impulse. The squirrel rises and, to the irritation of its neighbors, leaves its seat amid some disapproving shushings from the row behind. The squirrel puts the check on the counter. A giraffe looks up from a newspaper. The giraffe takes the check and leaves. A mouse rolls its program and sticks it into the sand of the cuspidor. The giraffe returns. The giraffe holds a short leopard coat and a lady's small umbrella. The mouse looks. The mouse's nervousness is mounting. The mouse is biting its lips, unable to find another argument. The mouse shoves the leopard coat and umbrella close to the mouse. The giraffe has returned to the other end of the counter and resumed its doze. A cat takes its coat rather brusquely, thrusts the leopard coat at her. The mouse takes the coat, feels it hurriedly to make sure the bottle is still there, and starts away. An elephant is left with the leopard coat and its bowler. The mouse comes back, takes the hat, starts away again. Its patience exhausted, the mouse stops again, takes the umbrella and tosses it in the elephant's direction. The elephant, who is getting into its coat, can't catch it. It falls right next to it. The mouse stands abashed. The mouse goes back, picks up the umbrella. As they go on talking, they walk from the cloak room, through the vestibule, to the street, the mouse carrying its coat over its arm. There is a split second of indecision but it is ended by the mouse's awareness of the bottle in its raincoat. The mouse is unfurling its raincoat in order to put it on before it steps from under the marquee. The elephant is about a step and a half away when there is a crash. On the sidewalk lies the pint of whiskey, broken. The lion stops and looks down, as does the mouse. The lion goes. The mouse looks at the broken bottle, then after the elephant. With sudden decision the mouse calls after it. It is dark and the rain has settled to a drizzle. The mouse joins it, takes the umbrella out of its hand and holds it over them both as they go down the street. As we have left it, empty save for a parrot and a mouse. Sunlight outside. The parrot is now taking the chairs from the tables and arranging the bar for the afternoon and evening trade, while the mouse leans back against the bar, the jigger of whiskey in its hand, and goes on talking. The mouse drinks. It is filled with the routine activity of a big commercial hotel on a hot summer day."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "The umbrellas swaying slowly. The camera approaches one of them. From the pocket projects a flashlight. He is wiping his sweaty brow. He puts the bandana back. He fishes the movie ticket from his pocket, buries it in his fist, fighting the foolish impulse. He rises and, to the irritation of his neighbors, leaves his seat amid some disapproving shushings from the row behind. He puts the ticket on the counter. The attendant looks up from a magazine. The attendant takes the ticket and leaves. Don rolls his menu and sticks it into the soil of the planter. The attendant returns. The attendant holds a short mink jacket and a lady's small parasol. Don looks. Don's nervousness is mounting. He is biting his lips, unable to find another argument. He shoves the mink jacket and parasol close to Don. The attendant has returned to the other end of the counter and resumed his doze. He takes his jacket rather brusquely, thrusts the mink jacket at her. Don takes the jacket, feels it hurriedly to make sure the flashlight is still there, and starts away. Helen is left with the mink jacket and his fedora. Don comes back, takes the hat, starts away again. His patience exhausted, Don stops again, takes the parasol and tosses it in Helen's direction. Helen, who is getting into her jacket, can't catch it. It falls right next to her. Don stands abashed. He goes back, picks up the parasol. As they go on talking, they walk from the coat check, through the foyer, to the street, Don carrying his jacket over his arm. There is a split second of indecision but it is ended by Don's awareness of the flashlight in his umbrella. He is unfurling his umbrella in order to put it on before he steps from under the awning. Helen is about a step and a half away when there is a crash. On the sidewalk lies the pint of cola, broken. She stops and looks down, as does Don. She goes. Don looks at the broken bottle, then after Helen. With sudden decision he calls after her. It is dark and the mist has settled to a drizzle. He joins her, takes the parasol out of her hand and holds it over them both as they go down the street. As we have left it, empty save for Nat and Don. Sunlight outside. Nat is now taking the stools from the counters and arranging the café for the afternoon and evening trade, while Don leans back against the counter, the cup of tea in his hand, and goes on talking. Don drinks. It is filled with the routine activity of a big commercial airport on a hot spring day."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "The raincoats fluttering quickly. The camera zooms in on one of them. From the pocket extends a flower bouquet. He is dusting his sweaty forehead. He tucks the handkerchief away. He extracts the coat check from his pocket, crushes it in his fist, resisting the ridiculous temptation. He sits and, to the amusement of his neighbors, remains in his seat amid some approving whispers from the row behind. He drops the check on the shelf. The attendant peers over from a magazine. The attendant grabs the check and lingers. Don unfolds his program and tosses it into the soil of the planter. The attendant returns. The attendant presents a long velvet scarf and a child's pink kite. Don peers. Don's excitement is growing. He is tapping his fingers, unable to find a distraction. He nudges the velvet scarf and kite next to Don. The attendant retreats to the other side of the counter and resumed his slumber. He takes his coat gently, offers the velvet scarf to her. Don takes the coat, pats it carefully to ensure the bouquet is still there, and steps aside. Helen is left with the velvet scarf and his cap. Don returns, grabs the cap, steps aside again. His enthusiasm renewed, Don pauses again, takes the kite and tosses it in Helen's direction. Helen, who is adjusting her scarf, can't catch it. It lands right beside her. Don stands sheepishly. He goes back, retrieves the kite. As they continue chatting, they stroll from the cloak room, through the lobby, to the street, Don draping his coat over his shoulder. There is a brief moment of hesitation but it is quelled by Don's consciousness of the bouquet in his raincoat. He is folding his raincoat in order to carry it before he steps out from under the awning. Helen is about a step and a half away when there is a clatter. On the sidewalk lies the flower bouquet, scattered. She halts and gazes down, as does Don. She departs. Don regards the scattered flowers, then after Helen. With abrupt determination, he calls after her. It is bright and the sun has settled to a blaze. He joins her, takes the kite out of her hand and holds it beside them both as they stroll down the street. As we have left it, crowded save for Nat and Don. Moonlight outside. Nat is now pulling the curtains from the windows and preparing the lounge for the morning and afternoon visitors, while Don lounges back against the bar, the glass of lemonade in his hand, and continues chatting. Don sips. It is filled with the routine activity of a bustling commercial hotel on a crisp winter day."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "The toasters swaying slowly. The bookshelf approaches one of them. From the backpack projects a lamp. She is wiping her dusty nose. She puts the scarf back. She fishes the library card from her backpack, buries it in her fist, fighting the foolish impulse. She rises and, to the irritation of her neighbors, leaves her sled amid some disapproving shushings from the row behind. She puts the card on the shelf. The librarian looks up from a notebook. The librarian takes the card and leaves. Sarah rolls her menu and sticks it into the soil of the planter. The librarian returns. The librarian holds a short giraffe scarf and a child's small kite. Sarah looks. Sarah's nervousness is mounting. She is biting her nails, unable to find another argument. She shoves the giraffe scarf and kite close to Sarah. The librarian has returned to the other end of the shelf and resumed her nap. She takes her scarf rather briskly, thrusts the giraffe scarf at him. Sarah takes the scarf, feels it hurriedly to make sure the lamp is still there, and starts away. Lisa is left with the giraffe scarf and her fedora. Sarah comes back, takes the helmet, starts away again. Her patience exhausted, Sarah stops again, takes the kite and tosses it in Lisa's direction. Lisa, who is getting into her scarf, can't catch it. It falls right next to him. Sarah stands abashed. She goes back, picks up the kite. As they go on talking, they walk from the cloak room, through the vestibule, to the sidewalk, Sarah carrying her scarf over her leg. There is a split second of indecision but it is ended by Sarah's awareness of the lamp in her toaster. She is unfurling her toaster in order to put it on before she steps from under the canopy. Lisa is about a hop and a half away when there is a crash. On the ground lies the gallon of lamp oil, broken. He stops and looks down, as does Sarah. He goes. Sarah looks at the broken lamp oil, then after Lisa. With sudden decision she calls after him. It is bright and the wind has settled to a breeze. She joins him, takes the kite out of his hand and holds it over them both as they go down the path. As we have left it, empty save for Tom and Sarah. Moonlight outside. Tom is now taking the lanterns from the shelves and arranging the counter for the morning and afternoon trade, while Sarah leans back against the counter, the martini of lamp oil in her hand, and goes on talking. Sarah drinks. It is filled with the routine activity of a big commercial library on a windy winter afternoon."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "The umbrellas swaying gracefully. The spotlight zooms in on one of them. From the pocket protrudes a flask of gin. She is dabbing her dry lips. She places the napkin back. She retrieves the train ticket from her bag, tucks it in her palm, quelling the reckless urge. She rises and, to the annoyance of her neighbors, abandons her spot amid some disapproving whispers from the row behind. She places the ticket on the stand. The cashier glances up from a magazine. The cashier collects the ticket and departs. Nat folds his newspaper and wedges it into the planter of the fern. The cashier returns. The cashier holds a long mink coat and a man's broad umbrella. Nat observes. Nat's tension is escalating. He is clenching his teeth, unable to form a counterpoint. He thrusts the mink coat and umbrella toward Nat. The cashier has returned to the far end of the stand and resumed his nap. He takes his jacket rather briskly, hands the mink coat to him. Nat collects the jacket, pats it quickly to ensure the flask remains, and moves on. Leo is left with the mink coat and his fedora. Nat returns, collects the hat, departs once more. His endurance worn thin, Nat halts again, snatches the umbrella and tosses it toward Leo. Leo, who is slipping into his jacket, fails to catch it. It lands right beside him. Nat pauses embarrassed. He retraces his steps, retrieves the umbrella. As they continue conversing, they exit the lobby, through the hallway, to the avenue, Nat carrying his jacket over his shoulder. There is a brief moment of hesitation but it is resolved by Nat's awareness of the flask in his umbrella. He is unfolding his umbrella to shield them before he steps from under the canopy. Leo is about a step and a half away when there is a clatter. On the pavement lies the pint of gin, shattered. He halts and glances down, as does Nat. He departs. Nat surveys the shattered flask, then after Leo. With abrupt resolve he shouts after him. It is dim and the drizzle has turned to mist. He joins him, takes the umbrella out of his grasp and positions it above them both as they stroll down the avenue. As we have left it, vacant save for Sue and Nat. Moonlight outside. Sue is now clearing the tables and setting the stage for the evening and night business, while Nat reclines against the counter, the shot of gin in his hand, and continues speaking. Nat sips. It is bustling with the daily operations of a large corporate inn on a warm summer night."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "The umbrellas fluttering gently. The microphone glides towards one of them. From the sleeve protrudes a baguette. He is scratching his itchy eyebrow. He places the bookmark back. He retrieves the paperclip from his pocket, clenches it in his hand, resisting the sneaky urge. He stands and, to the annoyance of his companions, abandons his spot amid some disapproving murmurs from the row behind. He places the paperclip on the podium. The usher glances up from a magazine. The usher takes the paperclip and departs. Don folds his brochure and sticks it into the soil of the planter. The usher returns. The usher holds a short zebra blanket and a child's small kite. Don observes. Don's anxiety is rising. He is gnawing his fingernails, unable to invent another excuse. He pushes the zebra blanket and kite towards Don. The usher has returned to the far side of the podium and resumed his nap. He takes his jacket rather hastily, thrusts the zebra blanket at her. Don takes the jacket, pats it quickly to ensure the baguette is still there, and strides away. Helen is left with the zebra blanket and his fedora. Don returns, grabs the hat, strides away again. His endurance drained, Don pauses again, grabs the kite and flings it in Helen's direction. Helen, who is donning her jacket, can't seize it. It lands right beside her. Don stands embarrassed. He returns, picks up the kite. As they continue chatting, they stroll from the dressing room, through the foyer, to the avenue, Don carrying his jacket over his arm. There is a fleeting moment of hesitation but it ends with Don's realization of the baguette in his umbrella. He is unrolling his umbrella in order to open it before he steps out from beneath the awning. Helen is about a step and a half away when there is a crash. On the pavement lies the loaf of bread, shattered. She pauses and gazes down, as does Don. She leaves. Don stares at the broken baguette, then after Helen. With abrupt resolve, he calls after her. It is dim and the mist has dwindled to a sprinkle. He joins her, takes the kite out of her hand and holds it over them both as they proceed down the avenue. As we have left it, vacant save for Nat and Don. Brightness outside. Nat is now removing the stools from the counters and preparing the café for the afternoon and evening patrons, while Don leans back against the counter, the shot glass of lemonade in his hand, and continues speaking. Don sips. It is filled with the routine hustle of a grand commercial inn on a scorching summer afternoon."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "The aprons bouncing quickly. The satellite drifts toward one of them. From the sleeve extends a flute of champagne. She is rubbing her damp elbow. She places the napkin aside. She grabs the bookmark from her sleeve, tucks it into her palm, battling the brave temptation. She descends and, to the delight of her companions, stays in her place amid some approving applauses from the group behind. She places the bookmark on the ledger. The librarian glances up from a pamphlet. The librarian grabs the bookmark and stays. Max folds his brochure and inserts it into the soil of the planter. The librarian reappears. The librarian clutches a long parrot scarf and a gentleman's large hat. Max observes. Max's confidence is soaring. He is scratching his chin, trying to find another excuse. He slides the parrot scarf and hat near Max. The librarian has returned to the other side of the ledger and resumed her snooze. He retrieves his scarf rather calmly, shoves the parrot scarf at him. Max clutches the scarf, examines it slowly to confirm the flute is still there, and proceeds away. Arthur is left with the parrot scarf and her top hat. Max returns, grabs the hat, goes away once more. Her curiosity piqued, Max hesitates again, grabs the hat and flips it in Arthur's way. Arthur, who is donning her scarf, can't catch it. It lands right beside him. Max stands amused. He returns, retrieves the hat. As they continue chatting, they stroll from the cloak room, through the lobby, to the platform, Max lugging his scarf over his hand. There is a brief moment of certainty but it is interrupted by Max's realization of the flute in his apron. He is rolling his apron in order to wear it after he lurches from beyond the archway. Arthur is roughly two steps away when there is a bang. On the pavement lies the quart of champagne, shattered. He halts and glances down, as does Max. He departs. Max gazes at the shattered flute, then after Arthur. With swift resolve, he shouts after him. It is dim and the mist has risen to a storm. He catches her, grabs the hat out of his grasp and places it over them both as they walk up the avenue. As we have abandoned it, void except for Bob and Max. Moonlight inside. Bob is now pulling the stools from the crates and arranging the café for the morning and lunchtime service, while Max rests against the counter, the pint of champagne in her grasp, and continues chatting. Max sips. It is loaded with the random movement of a small rural inn on a cold winter night."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "The camera focuses on a swaying raincoat from which a whiskey bottle protrudes. Don wipes his mouth, suppresses an impulse, and leaves his seat despite objections. He trades his coat check for a leopard coat and umbrella at the counter, nervously ensuring his bottle remains hidden. As he exits, he awkwardly handles the items, inadvertently tossing the umbrella to Helen. They head outside together, but Don’s whiskey bottle crashes, shattering on the sidewalk. Helen leaves, prompting Don to call after her, and they walk together under an umbrella. Later, Don is seen with Nat in a hotel bar, sipping whiskey and talking amid the hotel’s routine activities."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "It is filled with the routine activity of a big commercial hotel on a hot summer day Don drinks  Nat is now taking the chairs from the tables and arranging the bar for the afternoon and evening trade while Don leans back against the bar the jigger of whiskey in his hand and goes on talking  Sunlight outside  As we have left it empty save for Nat and Don  He joins her takes the umbrella out of her hand and holds it over them both as they go down the street  It is dark and the rain has settled to a drizzle  With sudden decision he calls after her  Don looks at the broken bottle then after Helen  She goes  She stops and looks down as does Don  On the sidewalk lies the pint of whiskey broken  Helen is about a step and a half away when there is a crash  He is unfurling his raincoat in order to put it on before he steps from under the marquee  There is a split second of indecision but it is ended by Don's awareness of the bottle in his raincoat  Don carrying his coat over his arm  As they go on talking they walk from the cloak room through the vestibule to the street  He goes back picks up the umbrella  Don stands abashed  It falls right next to her  Helen who is getting into her coat can't catch it  Don stops again takes the umbrella and tosses it in Helen's direction  His patience exhausted  Don comes back takes the hat starts away again  Helen is left with the leopard coat and his bowler  Don takes the coat feels it hurriedly to make sure the bottle is still there and starts away  He takes his coat rather brusquely thrusts the leopard coat at her  The attendant has returned to the other end of the counter and resumed his doze  He shoves the leopard coat and umbrella close to Don  He is biting his lips unable to find another argument  Don's nervousness is mounting  Don looks  The attendant holds a short leopard coat and a lady's small umbrella  The attendant returns  Don rolls his program and sticks it into the sand of the cuspidor  The attendant takes the check and leaves  The attendant looks up from a newspaper  He puts the check on the counter  He rises and to the irritation of his neighbors leaves his seat amid some disapproving shushings from the row behind  He fishes the coat check from his pocket buries it in his fist fighting the foolish impulse  He puts the handkerchief back  He is wiping his parched mouth  From the pocket projects a bottle of whiskey  The camera approaches one of them  The raincoats swaying slowly "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "He is biting his lips unable to find another argument  The raincoats swaying slowly  Don looks  He joins her takes the umbrella out of her hand and holds it over them both as they go down the street  Nat is now taking the chairs from the tables and arranging the bar for the afternoon and evening trade while Don leans back against the bar the jigger of whiskey in his hand and goes on talking  He goes back picks up the umbrella  Don stands abashed  On the sidewalk lies the pint of whiskey broken  It falls right next to her  There is a split second of indecision but it is ended by Don's awareness of the bottle in his raincoat  Don drinks  Helen is left with the leopard coat and his bowler  Sunlight outside  He is unfurling his raincoat in order to put it on before he steps from under the marquee  Don rolls his program and sticks it into the sand of the cuspidor  He rises and to the irritation of his neighbors leaves his seat amid some disapproving shushings from the row behind  The attendant has returned to the other end of the counter and resumed his doze  Don takes the coat feels it hurriedly to make sure the bottle is still there and starts away  She goes  The attendant returns  Don's nervousness is mounting  The attendant looks up from a newspaper  Helen is about a step and a half away when there is a crash  He is wiping his parched mouth  As they go on talking they walk from the cloak room through the vestibule to the street  As we have left it empty save for Nat and Don  The attendant takes the check and leaves  Don looks at the broken bottle then after Helen  With sudden decision he calls after her  Don comes back takes the hat starts away again  The camera approaches one of them  He puts the handkerchief back  The attendant holds a short leopard coat and a lady's small umbrella  Don stops again takes the umbrella and tosses it in Helen's direction  He takes his coat rather brusquely thrusts the leopard coat at her  He fishes the coat check from his pocket buries it in his fist fighting the foolish impulse  Helen who is getting into her coat can't catch it  He puts the check on the counter  She stops and looks down as does Don  Don carrying his coat over his arm  From the pocket projects a bottle of whiskey  He shoves the leopard coat and umbrella close to Don  It is dark and the rain has settled to a drizzle  It is filled with the routine activity of a big commercial hotel on a hot summer day His patience exhausted "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Don stops again takes the umbrella and tosses it in Helen's direction  Helen who is getting into her coat can't catch it  It falls right next to her  Don stands abashed  He goes back picks up the umbrella  As they go on talking they walk from the cloak room through the vestibule to the street  Don carrying his coat over his arm  There is a split second of indecision but it is ended by Don's awareness of the bottle in his raincoat  He is unfurling his raincoat in order to put it on before he steps from under the marquee  Helen is about a step and a half away when there is a crash  On the sidewalk lies the pint of whiskey broken  She stops and looks down as does Don  She goes  Don looks at the broken bottle then after Helen  With sudden decision he calls after her  It is dark and the rain has settled to a drizzle  He joins her takes the umbrella out of her hand and holds it over them both as they go down the street  As we have left it empty save for Nat and Don  Sunlight outside  Nat is now taking the chairs from the tables and arranging the bar for the afternoon and evening trade while Don leans back against the bar the jigger of whiskey in his hand and goes on talking  Don drinks  It is filled with the routine activity of a big commercial hotel on a hot summer day The raincoats swaying slowly  The camera approaches one of them  From the pocket projects a bottle of whiskey  He is wiping his parched mouth  He puts the handkerchief back  He fishes the coat check from his pocket buries it in his fist fighting the foolish impulse  He rises and to the irritation of his neighbors leaves his seat amid some disapproving shushings from the row behind  He puts the check on the counter  The attendant looks up from a newspaper  The attendant takes the check and leaves  Don rolls his program and sticks it into the sand of the cuspidor  The attendant returns  The attendant holds a short leopard coat and a lady's small umbrella  Don looks  Don's nervousness is mounting  He is biting his lips unable to find another argument  He shoves the leopard coat and umbrella close to Don  The attendant has returned to the other end of the counter and resumed his doze  He takes his coat rather brusquely thrusts the leopard coat at her  Don takes the coat feels it hurriedly to make sure the bottle is still there and starts away  Helen is left with the leopard coat and his bowler  Don comes back takes the hat starts away again  His patience exhausted "
        }
      ]
    }
  ]
}