{
  "ground_truth": "Behind the glass lies the folder of matches, which attracts Don's attention enough to make him push the glass to one side. The waiter takes the check, which is thrust between his vest and stiff shirt, and puts it face down in front of Don before hurrying on with the tray of drinks. Don turns the check over and puts his hand in his pocket, pulling out what cash he has, but he only has two one-dollar bills and some small change, which isn't enough. At that moment, the waiter returns, expecting to be paid, and takes the check before leaving. Next to Don, a couple is cooing, but on the bench between him and the girl lies her bag. Don thinks there must be some money in the bag as the man whispers something into the girl's ear, and she shakes her head. Don looks around the room, forming a plan, and inadvertently drops his hand on the bench beside the handsome leather bag with gold initials, M. M. The bag moves very close to his coat, and Don imperceptibly pulls it closer to himself, switching his cigarette and crossing his other arm so he can pull the bag up under his coat to his armpit, holding it close to his ribs. Don calmly smokes his cigarette as a great gentleman while the waiter comes back with the drink, and guests and waiters pass by. He points to a door at the other end of the room, and there is a tiny puzzled look from the waiter as Don walks slowly towards the washroom. The waiter pulls the table away for him, and Don starts to rise. The washroom has two washbasins, with a colored attendant brushing a customer as Don enters, carrying the bag under his open coat by the pressure of his upper arm. Between his fingers is a cigarette, making the whole thing look fairly natural. As Don picks up the cake of soap, he watches the attendant get a polishing rag and bend down to dust off his shoes. Don puts down the soap, pulls out the bag, opens it, and finds some bills between a compact, lipstick, and keys. He fishes out a ten-dollar bill, thrusts it in his pocket, and is about to close the purse when he sees the carnations. Smiling at the idea that flashes into his mind, he takes one of the carnations, puts it into the purse, closes it, and thrusts it back under his coat. Just as the attendant straightens up, Don puts both hands into the water.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Behind the pane lies the dossier of games, which entices Don's attention sufficiently to cause him to shove the pane to one edge. The server takes the bill, which is pressed between his waistcoat and stiff shirt, and places it face down in front of Don before hastening on with the platter of beverages. Don flips the bill over and puts his hand in his pocket, drawing out what currency he possesses, but he only has two one-dollar notes and some minor coins, which isn't sufficient. At that instant, the server returns, anticipating payment, and takes the bill before departing. Next to Don, a pair is murmuring, but on the seat between him and the young lady lies her handbag. Don suspects there must be some funds in the handbag as the gentleman murmurs something into the young lady's ear, and she shakes her head. Don glances around the chamber, devising a scheme, and unintentionally drops his hand on the seat beside the elegant leather handbag with gold letters, M. M. The handbag shifts very near to his jacket, and Don subtly pulls it nearer to himself, switching his smoke and folding his other arm so he can tug the handbag up under his jacket to his armpit, clutching it close to his side. Don serenely smokes his smoke like a grand gentleman while the server returns with the beverage, and patrons and servers pass by. He gestures to a portal at the other end of the chamber, and there is a tiny puzzled glance from the server as Don strolls slowly towards the lavatory. The server pulls the table aside for him, and Don begins to stand. The lavatory has two basins, with a colored assistant brushing a client as Don enters, carrying the handbag under his open jacket by the pressure of his upper arm. Between his fingers is a smoke, making the whole affair appear fairly natural. As Don picks up the bar of cleanser, he observes the assistant obtain a polishing cloth and bend down to clean off his footwear. Don places down the cleanser, pulls out the handbag, opens it, and finds some notes between a compact, lipstick, and keys. He extracts a ten-dollar note, thrusts it in his pocket, and is about to close the handbag when he sees the blooms. Smiling at the notion that flashes into his mind, he takes one of the blooms, puts it into the handbag, closes it, and thrusts it back under his jacket. Just as the assistant straightens up, Don puts both hands into the liquid."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Behind the glass lies the folder of matches, which is enough to attract Don's attention and cause the glass to be pushed to one side by him. The check is taken by the waiter, who thrusts it between his vest and stiff shirt, and it is placed face down in front of Don before he hurries on with the tray of drinks. The check is turned over by Don, and his hand is put in his pocket to pull out what cash he has, but only two one-dollar bills and some small change are found, which aren't enough. At that moment, the waiter returns, expecting to be paid, and he leaves with the check. Next to Don, the couple coos, but on the bench between him and the girl, her bag lies. Don thinks there must be some money in the bag as the man whispers something into the girl's ear, causing her to shake her head. Don looks around the room, forms a plan, and his hand is inadvertently dropped on the bench beside the handsome leather bag with gold initials, M. M. The bag is moved very close to his coat, and it is imperceptibly pulled closer to himself by Don, who switches his cigarette and crosses his other arm so the bag can be pulled up under his coat to his armpit, held close to his ribs. The cigarette is calmly smoked by Don, who appears as a great gentleman while the waiter returns with the drink, and guests and waiters pass by. A door at the other end of the room is pointed to by him, and a tiny puzzled look is given by the waiter as Don slowly walks toward the washroom. The table is pulled away for him by the waiter, and Don starts to rise. The washroom has two washbasins, and a colored attendant brushes a customer as Don enters, carrying the bag under his open coat by the pressure of his upper arm. Between his fingers, a cigarette is held, making the whole thing look fairly natural. The cake of soap is picked up by Don, who watches the attendant get a polishing rag and bend down to dust off his shoes. The soap is put down by Don, who pulls out the bag, opens it, and finds some bills between a compact, lipstick, and keys. A ten-dollar bill is fished out by him, thrust into his pocket, and as he is about to close the purse, the carnations are seen. Smiling at the idea that flashes into his mind, he takes one of the carnations, puts it into the purse, closes it, and thrusts it back under his coat. Just as the attendant straightens up, both hands are put into the water by Don."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Behind the glass is a folder of matches that catches Don's eye, prompting him to slide the glass aside. The waiter places a check in front of Don, retrieves a drink tray, and departs. Don flips the check and checks his pocket, finding only two dollars and some change—insufficient to pay. The waiter returns to collect the check. Nearby, a couple whispers, and Don notices the girl's bag with gold initials, M. M., on the bench. Suspecting money inside, he discreetly pulls the bag closer, switching his cigarette and maneuvering the bag under his coat. Maintaining composure, Don smokes as the waiter returns with drinks. Don points to a door and, with a puzzled look, the waiter moves the table, allowing Don to rise and head toward the washroom. Inside, Don carries the bag under his coat, appearing natural with a cigarette in hand. Watching the attendant polish shoes, Don opens the bag, finds some bills, and pockets a ten-dollar bill. Spotting carnations, he takes one, places it in the purse, closes it, and conceals the bag under his coat. As the attendant stands, Don puts his hands in the water."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Behind glass is a match folder that draws Don's attention enough to slide it aside. The waiter, with the check between his vest and shirt, places it face down before Don and leaves with a drink tray. Don turns the check over, checks his pocket, but only finds two one-dollar bills and some change, not enough. The waiter returns, reclaims the check, and leaves. Beside Don, a couple cuddles, separated by her bag, which Don suspects contains money. Don discreetly moves the bag, switching his cigarette and arm to tuck it under his coat. As he smokes, the waiter returns with the drink. Don points to a door, the waiter moves the table, and Don rises. In the washroom with two basins, an attendant brushes a customer. Carrying the bag under his arm and holding a cigarette, Don opens the bag, finds bills, takes a ten-dollar bill, and sees carnations. Amused, he places a carnation in the bag, closes it, and returns it under his coat just as the attendant rises. Don immerses both hands in the water."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Behind the shimmering glass panel rests the intriguing folder of matches, which captures Don's interest just enough for him to decisively push the glass aside. In a swift motion, the waiter, impeccably dressed, delicately takes the check that has been wedged in the space between his snug vest and stiff, starched shirt. He then places the check face down in front of Don with precision before quickly moving on with his tray full of various drinks, bustling onward to serve other patrons. Don, with a degree of nonchalance, flips the check over and seamlessly slips his hand into his pocket, withdrawing the little cash he possesses. Unfortunately, he only has two crumpled one-dollar bills along with a smattering of small coins, which are far from sufficient. At that precise moment, the waiter, with a polite yet expectant demeanor, returns to Don, looking to be compensated, and promptly takes the check before moving away.\n\nSeated beside Don, a couple is softly cooing to each other, their affection palpable, yet on the bench that separates him and the girl rests her elegant handbag. Don suspects that there might be some money within the confines of the bag as he observes the man lean in to whisper something into the girl’s ear, to which she responds by shaking her head slightly. Don discreetly scans the room, his mind whirring as he formulates a plan. Almost instinctively, his hand lands upon the bench beside the exquisite leather handbag adorned with elegant gold initials, M. M. The bag edges closer, almost brushing against his coat, and Don subtly pulls it nearer, adjusting his cigarette with one hand and crossing his other arm so he can deftly slide the bag under his coat, tucking it snugly beneath his armpit, where it rests securely against his ribs.\n\nDon maintains an air of calm, continuing to smoke his cigarette with the dignified demeanor of a distinguished gentleman. Meanwhile, the waiter returns with his drink, and both guests and waiters in the bustling room continue to pass by, absorbed in their own activities. Gesturing discreetly, he indicates a door at the far end of the room, which elicits a fleeting, puzzled expression from the waiter as Don leisurely makes his way towards the washroom. The waiter, ever attentive, pulls the table aside to allow him space to rise. The washroom, modest in size, is equipped with two washbasins, and as Don enters, he observes a colored attendant meticulously brushing the shoes of a customer. With the bag securely tucked under his open coat, held in place by the subtle pressure of his upper arm, Don proceeds. A lit cigarette remains pinned between his fingers, adding an air of casual naturalness to his actions.\n\nUpon reaching for a bar of soap, Don observes the attendant retrieving a polishing rag and bending down attentively to dust off a pair of shoes. He sets the soap down, pulls out the handbag, and opens it. Inside, he discovers several bills interspersed amongst a compact, a tube of lipstick, and a set of keys. Decisively, he fishes out a crisp ten-dollar bill and smoothly slips it into his pocket. Just as he is about to close the elegant purse, his gaze falls upon a bunch of carnations. A whimsical idea dances through his mind, bringing a smile to his face. He plucks one of the delicate carnations and places it gently into the handbag before closing it. With measured precision, he tucks the purse back under his coat. As the attendant straightens up from his task, Don casually immerses both hands into the cool, flowing water."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Behind the shimmering glass panel, there lies an intriguing folder of matches, which captures just enough of Don's curiosity to compel him to decisively push this glass aside. In a swift, fluid motion, the waiter, who is impeccably dressed in a crisp uniform, delicately retrieves the check that has been snugly wedged in the narrow space between his snug vest and the stiff, starched shirt underneath. With precision and a practiced ease, he places the check face down in front of Don before efficiently moving on with his tray, brimming with a variety of drinks, bustling onward to attentively serve other patrons in the busy establishment. Don, with a degree of practiced nonchalance, casually flips the check over and seamlessly slips his hand into the depths of his pocket, only to withdraw the little cash he possesses. Unfortunately for Don, the sum amounts to merely two crumpled one-dollar bills along with a modest smattering of small coins, which are decidedly insufficient for his needs. At that precise moment, the waiter returns with a polite yet expectant demeanor, looking to be compensated, and promptly takes back the check before moving swiftly away.\n\nSeated just beside Don is a couple softly cooing sweet nothings to each other, their palpable affection evident in their intimate interactions. However, on the bench that separates Don and the girl rests her elegant handbag. Don, observing closely, suspects there might be some money within the confines of this stylish accessory, as he notices the man gently lean in to whisper something into the girl's ear, to which she responds by shaking her head ever so slightly. Don discreetly scans the room with a sharp eye, his mind whirring as he begins to formulate a plan. Almost instinctively, his hand lands upon the bench beside the exquisite leather handbag, which is adorned with elegant gold initials, M. M. The bag edges closer, almost brushing casually against his coat, and Don subtly pulls it even nearer, adjusting his cigarette with one hand while crossing his other arm so he can deftly slide the bag under his coat, tucking it snugly beneath his armpit, where it rests securely and inconspicuously against his ribs.\n\nDon maintains an air of calmness, continuing to smoke his cigarette with the dignified demeanor of a distinguished gentleman, all the while ensuring he remains composed. Meanwhile, the waiter returns to his side with his drink, and both guests and waiters in the bustling room continue to pass by, absorbed in their own myriad activities. Gesturing discreetly with a subtle nod, he indicates a door located at the far end of the room, which elicits a fleeting, slightly puzzled expression from the ever-watchful waiter as Don leisurely makes his way towards the washroom area. With attentiveness, the waiter pulls the table aside to allow Don ample space to rise. The washroom, modest in size, is equipped with not one but two washbasins, and as Don enters, he observes a colored attendant meticulously brushing the shoes of a customer. With the bag securely tucked under his open coat, held in place by the subtle pressure of his upper arm, Don proceeds with his actions. A lit cigarette remains nonchalantly pinned between his fingers, adding an air of casual naturalness to his every movement.\n\nUpon reaching for a bar of soap at the sink, Don observes the attendant diligently retrieving a polishing rag and bending down attentively to dust off a pair of shoes. He sets the soap down, pulls out the handbag, and opens it with intent. Inside, he discovers several bills interspersed amongst a compact, a tube of lipstick, and a set of keys. With decisiveness, he fishes out a crisp ten-dollar bill and smoothly slips it into his pocket. Just as he is about to close the elegant purse, his gaze unexpectedly falls upon a lovely bunch of carnations. A whimsical idea dances through his mind, bringing an amused smile to his face. He plucks one of the delicate carnations from the bunch and carefully places it back into the handbag before closing it. With measured precision, he tucks the purse back under his coat. As the attendant straightens up from his task, Don casually immerses both hands into the cool, flowing water to complete his ruse."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Behind the glass, Don notices a folder of matches, which draws his attention enough that he decides to push the glass to one side to get a better look. While this happens, the waiter comes by and takes the check, which had been slid between his vest and stiff shirt, and places it face down in front of Don before quickly moving on with a tray filled with drinks. Don then flips the check over, reaches into his pocket, and pulls out all the cash he has, only to find two one-dollar bills and some small change, which disappointingly isn't enough to cover the check. Just at that moment, the waiter returns, anticipating payment, but seeing the situation, takes the check and departs. Beside Don, a couple is engaged in close conversation, cooing to each other, but their attention is not on their belongings between them on the bench, where the girl's bag is placed. As the man leans in to whisper something sweet into the girl's ear, she shakes her head, and Don considers that the bag might contain money. Scanning the room quickly to see if anyone's watching, he begins to form a plan and, without drawing attention, lets his hand drop onto the bench next to the stylish leather bag with gold initials, M. M. In a subtle motion, he shifts the bag until it is nearer to his coat, and while pretending to adjust his cigarette with one hand, he crosses his other arm over, stealthily pulling the bag up and tucking it under his coat, securing it against his ribs. With the bag concealed, Don maintains his composure, appearing as a calm gentleman as he smokes his cigarette, even as the waiter returns with the drinks and people bustle by. He casually gestures towards a door at the far end of the room, which prompts a slightly perplexed look from the waiter as Don begins to head towards the washroom. The waiter obligingly pulls the table away, allowing Don to rise without hassle. Once inside the washroom, which has two basins and a colored attendant busy brushing another customer, Don holds the bag under his open coat, kept there by the pressure of his upper arm, all while maintaining the casual appearance by keeping a cigarette between his fingers. Moving to the sink, Don picks up a cake of soap and watches as the attendant retrieves a polishing rag and bends down to buff the customer's shoes. This gives Don the opportunity to set the soap down, discreetly extract the bag from under his coat, open it, and sift through its contents. Among a compact, lipstick, and some keys, he finds bills and quickly extracts a ten-dollar bill, stuffing it into his pocket. Just as he is about to close the bag, he catches sight of some carnations, which ignite a whimsical idea. With a smile, he takes one of the carnations, places it inside the purse, closes it securely, and tucks it back under his coat, all completed with precision timing just as the attendant stands upright again. To complete the illusion of innocence, Don casually places both of his hands into the water, as if washing them, maintaining the facade as an ordinary gentleman."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Behind the glass lies the folder of matches, catching Don's attention enough for him to slide the glass aside. The waiter, after placing the check discreetly in front of Don and hurrying off with a tray of drinks, returns expecting payment. Don checks his pockets, finding insufficient cash with just two one-dollar bills and some change. Nearby, a couple converses intimately, with the woman's bag resting on the bench between them. Observing this, Don forms a plan, casually dropping his hand beside the bag adorned with the initials M. M. He discreetly pulls it closer, positioning it under his coat with practiced ease while maintaining a nonchalant demeanor as he smokes. As the waiter returns with a drink, Don indicates a door across the room, drawing a puzzled look as he slowly makes his way toward the washroom. The waiter assists by pulling the table back, and Don enters the washroom, carrying the bag naturally under his coat by holding it with his upper arm. Inside, he observes the attendant polishing a customer's shoes. Taking advantage of this, Don pretends to wash his hands, then swiftly opens the bag to retrieve a ten-dollar bill from amidst cosmetics and keys, slipping it into his pocket. Inspired, he takes a carnation from the bag, places it inside as a token, and re-conceals the purse under his coat just as the attendant finishes, then immerses his hands in the water."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Behind the glass lies the folder of matches, a promotional item from the nearby Café du Monde, which attracts Don's attention enough to make him push the glass to one side. The waiter, dressed in the classic black-and-white uniform common in upscale establishments like this, takes the check, which is thrust between his vest and stiff shirt, and puts it face down in front of Don before hurrying on with the tray of drinks he is delivering to a boisterous group of businessmen at the corner table. Don turns the check over and puts his hand in his pocket, pulling out what cash he has, but he only has two one-dollar bills and some small change, which isn't enough to cover the tab. At that moment, the waiter returns, expecting to be paid, and takes the check before leaving to serve another table. Next to Don, a couple is cooing, sharing a moment of whispered affection, but on the bench between him and the girl lies her elegant leather bag, adorned with gold initials, M. M., which suggests the owner’s name might be Mary or Michael. Don thinks there must be some money in the bag as the man whispers something into the girl's ear, and she shakes her head demurely. Don looks around the room, forming a plan reminiscent of capers from old films, and inadvertently drops his hand on the bench beside the handsome leather bag. The bag moves very close to his coat, and Don imperceptibly pulls it closer to himself, switching his cigarette, a habit formed by bar patrons for ease of conversation, and crossing his other arm so he can pull the bag up under his coat to his armpit, holding it close to his ribs. Don calmly smokes his cigarette, mimicking the demeanor of a great gentleman, while the waiter comes back with the drink, and guests and waiters pass by, focusing on their own evenings. He points to a door at the other end of the room, marked discretely to indicate the washroom, and there is a tiny puzzled look from the waiter as Don walks slowly towards the washroom. The waiter pulls the table away for him, and Don starts to rise. The washroom, typical of the venue with its Art Deco style, has two washbasins, with a colored attendant brushing a customer’s jacket as Don enters, carrying the bag under his open coat by the pressure of his upper arm. Between his fingers is a cigarette, making the whole thing look fairly natural as if he’s merely a patron freshening up. As Don picks up the cake of soap, he watches the attendant get a polishing rag and bend down to dust off his shoes, a service often offered in upscale venues of the era. Don puts down the soap, pulls out the bag, opens it, and finds some bills between a compact, lipstick, and keys, which are the typical contents of a lady's handbag in the 1940s. He fishes out a ten-dollar bill, equivalent to nearly a hundred dollars today, thrusts it in his pocket, and is about to close the purse when he sees the carnations, known for their symbolism of fascination and distinction. Smiling at the idea that flashes into his mind, he takes one of the carnations, puts it into the purse, closes it, and thrusts it back under his coat. Just as the attendant straightens up, Don puts both hands into the water, completing the illusion of an innocuous visit."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Just as the attendant straightens up Don puts both hands into the water Behind the glass lies the folder of matches which attracts Don's attention enough to make him push the glass to one side Don turns the check over and puts his hand in his pocket pulling out what cash he has but he only has two onedollar bills and some small change which is not enough M M The waiter takes the check which is thrust between his vest and stiff shirt and puts it face down in front of Don before hurrying on with the tray of drinks At that moment the waiter returns expecting to be paid and takes the check before leaving The waiter pulls the table away for him and Don starts to rise The waiter takes the check which is thrust between his vest and stiff shirt and puts it face down in front of Don before hurrying on with the tray of drinks Don turns the check over and puts his hand in his pocket pulling out what cash he has but he only has two onedollar bills and some small change which is not enough At that moment the waiter returns expecting to be paid and takes the check before leaving Next to Don a couple is cooing but on the bench between him and the girl lies her bag Don thinks there must be some money in the bag as the man whispers something into the girl's ear and she shakes her head Don looks around the room forming a plan and inadvertently drops his hand on the bench beside the handsome leather bag with gold initials M M The bag moves very close to his coat and Don imperceptibly pulls it closer to himself switching his cigarette and crossing his other arm so he can pull the bag up under his coat to his armpit holding it close to his ribs Don calmly smokes his cigarette as a great gentleman while the waiter comes back with the drink and guests and waiters pass by He points to a door at the other end of the room and there is a tiny puzzled look from the waiter as Don walks slowly towards the washroom He points to a door at the other end of the room and there is a tiny puzzled look from the waiter as Don walks slowly towards the washroom The waiter pulls the table away for him and Don starts to rise He fishes out a tendollar bill thrusts it in his pocket and is about to close the purse when he sees the carnations The bag moves very close to his coat and Don imperceptibly pulls it closer to himself switching his cigarette and crossing his other arm so he can pull the bag up under his coat to his armpit holding it close to his ribs The washroom has two washbasins with a colored attendant brushing a customer as Don enters carrying the bag under his open coat by the pressure of his upper arm Between his fingers is a cigarette making the whole thing look fairly natural As Don picks up the cake of soap he watches the attendant get a polishing rag and bend down to dust off his shoes Don puts down the soap pulls out the bag opens it and finds some bills between a compact lipstick and keys He fishes out a tendollar bill thrusts it in his pocket and is about to close the purse when he sees the carnations Behind the glass lies the folder of matches which attracts Don's attention enough to make him push the glass to one side Smiling at the idea that flashes into his mind he takes one of the carnations puts it into the purse closes it and thrusts it back under his coat Just as the attendant straightens up Don puts both hands into the water"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Behind the glass lies the folder of matches which attracts Don's attention enough to make him push the glass to one side. The waiter takes the check which is thrust between his vest and stiff shirt and puts it face down in front of Don before hurrying on with the tray of drinks. Don turns the check over and puts his hand in his pocket pulling out what cash he has but he only has two onedollar bills and some small change which is not enough. At that moment the waiter returns expecting to be paid and takes the check before leaving. Next to Don a couple is cooing but on the bench between him and the girl lies her bag. Don thinks there must be some money in the bag as the man whispers something into the girl's ear and she shakes her head. Don looks around the room forming a plan and inadvertently drops his hand on the bench beside the handsome leather bag with gold initials. M M. The bag moves very close to his coat and Don imperceptibly pulls it closer to himself switching his cigarette and crossing his other arm so he can pull the bag up under his coat to his armpit holding it close to his ribs. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. Don calmly smokes his cigarette as a great gentleman while the waiter comes back with the drink and guests and waiters pass by. He points to a door at the other end of the room and there is a tiny puzzled look from the waiter as Don walks slowly towards the washroom. The waiter pulls the table away for him and Don starts to rise. The washroom has two washbasins with a colored attendant brushing a customer as Don enters carrying the bag under his open coat by the pressure of his upper arm. Between his fingers is a cigarette making the whole thing look fairly natural. As Don picks up the cake of soap he watches the attendant get a polishing rag and bend down to dust off his shoes. Don puts down the soap pulls out the bag opens it and finds some bills between a compact lipstick and keys. He fishes out a tendollar bill thrusts it in his pocket and is about to close the purse when he sees the carnations. Smiling at the idea that flashes into his mind he takes one of the carnations puts it into the purse closes it and thrusts it back under his coat. Just as the attendant straightens up Don puts both hands into the water."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Behind the glass lies the folder of matches which attracts Don's attention enough to make him push the glass to one side. The waiter takes the check which is thrust between his vest and stiff shirt and puts it face down in front of Don before hurrying on with the tray of drinks. Don turns the check over and puts his hand in his pocket pulling out what cash he has but he only has two onedollar bills and some small change which is not enough. At that moment the waiter returns expecting to be paid and takes the check before leaving. Next to Don a couple is cooing but on the bench between him and the girl lies her bag. Don thinks there must be some money in the bag as the man whispers something into the girl's ear and she shakes her head. Don looks around the room forming a plan and inadvertently drops his hand on the bench beside the handsome leather bag with gold initials. M M. The bag moves very close to his coat and Don imperceptibly pulls it closer to himself switching his cigarette and crossing his other arm so he can pull the bag up under his coat to his armpit holding it close to his ribs. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. Don calmly smokes his cigarette as a great gentleman while the waiter comes back with the drink and guests and waiters pass by. He points to a door at the other end of the room and there is a tiny puzzled look from the waiter as Don walks slowly towards the washroom. The waiter pulls the table away for him and Don starts to rise. The washroom has two washbasins with a colored attendant brushing a customer as Don enters carrying the bag under his open coat by the pressure of his upper arm. Between his fingers is a cigarette making the whole thing look fairly natural. As Don picks up the cake of soap he watches the attendant get a polishing rag and bend down to dust off his shoes. Don puts down the soap pulls out the bag opens it and finds some bills between a compact lipstick and keys. He fishes out a tendollar bill thrusts it in his pocket and is about to close the purse when he sees the carnations. Smiling at the idea that flashes into his mind he takes one of the carnations puts it into the purse closes it and thrusts it back under his coat. Just as the attendant straightens up Don puts both hands into the water."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Behind the glass lies the folder of matches which attracts Don's attention enough to make him push the glass to one side. The waiter takes the check which is thrust between his vest and stiff shirt and puts it face down in front of Don before hurrying on with the tray of drinks. Don turns the check over and puts his hand in his pocket pulling out what cash he has but he only has two onedollar bills and some small change which is not enough. At that moment the waiter returns expecting to be paid and takes the check before leaving. Next to Don a couple is cooing but on the bench between him and the girl lies her bag. As Don picks up the cake of soap he watches the attendant get a polishing rag and bend down to dust off his shoes. Don puts down the soap pulls out the bag opens it and finds some bills between a compact lipstick and keys. He fishes out a tendollar bill thrusts it in his pocket and is about to close the purse when he sees the carnations. Smiling at the idea that flashes into his mind he takes one of the carnations puts it into the purse closes it and thrusts it back under his coat. Just as the attendant straightens up Don puts both hands into the water."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Behind the glass lies the folder of matches which attracts Don's attention enough to make him push the glass to one side. The waiter takes the check which is thrust between his vest and stiff shirt and puts it face down in front of Don before hurrying on with the tray of drinks. Smiling at the idea that flashes into his mind he takes one of the carnations puts it into the purse closes it and thrusts it back under his coat. Just as the attendant straightens up Don puts both hands into the water."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Behind the glass lies the folder of matches, which attracts the giraffe's attention enough to make it push the glass to one side. The firefighter takes the check, which is thrust between his vest and stiff shirt, and puts it face down in front of the giraffe before hurrying on with the tray of drinks. The giraffe turns the check over and puts its hand in its pocket, pulling out what cash it has, but it only has two one-dollar bills and some small change, which isn't enough. At that moment, the firefighter returns, expecting to be paid, and takes the check before leaving. Next to the giraffe, a couple is cooing, but on the bench between it and the girl lies her bag. The giraffe thinks there must be some money in the bag as the robot whispers something into the girl's ear, and she shakes her head. The giraffe looks around the room, forming a plan, and inadvertently drops its hand on the bench beside the handsome leather bag with gold initials, M. M. The bag moves very close to its coat, and the giraffe imperceptibly pulls it closer to itself, switching its cigarette and crossing its other arm so it can pull the bag up under its coat to its armpit, holding it close to its ribs. The giraffe calmly smokes its cigarette as a great gentleman while the firefighter comes back with the drink, and guests and waiters pass by. It points to a door at the other end of the room, and there is a tiny puzzled look from the firefighter as the giraffe walks slowly towards the washroom. The firefighter pulls the table away for it, and the giraffe starts to rise. The washroom has two washbasins, with a dragon brushing a customer as the giraffe enters, carrying the bag under its open coat by the pressure of its upper arm. Between its fingers is a cigarette, making the whole thing look fairly natural. As the giraffe picks up the cake of soap, it watches the dragon get a polishing rag and bend down to dust off its shoes. The giraffe puts down the soap, pulls out the bag, opens it, and finds some bills between a compact, lipstick, and keys. It fishes out a ten-dollar bill, thrusts it in its pocket, and is about to close the purse when it sees the carnations. Smiling at the idea that flashes into its mind, it takes one of the carnations, puts it into the purse, closes it, and thrusts it back under its coat. Just as the dragon straightens up, the giraffe puts both hands into the water."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Behind the curtain lies the envelope of postcards, which attracts Don's attention enough to make him pull the curtain to one side. The waiter takes the napkin, which is tucked between his apron and crisp blouse, and puts it face down in front of Don before hurrying on with the tray of appetizers. Don turns the napkin over and puts his hand in his pocket, pulling out what coins he has, but he only has two quarters and some loose buttons, which isn't enough. At that moment, the waiter returns, expecting to be paid, and takes the napkin before leaving. Next to Don, a couple is whispering, but on the chair between him and the girl lies her scarf. Don thinks there must be some tickets in the scarf as the man whispers something into the girl's ear, and she shakes her head. Don looks around the room, forming a plan, and inadvertently drops his hand on the chair beside the elegant silk scarf with monogrammed initials, M. M. The scarf moves very close to his jacket, and Don imperceptibly pulls it closer to himself, switching his toothpick and crossing his other arm so he can pull the scarf up under his jacket to his shoulder, holding it close to his chest. Don calmly munches his toothpick as a great gentleman while the waiter comes back with the platter, and guests and waiters pass by. He points to a curtain at the other end of the room, and there is a tiny puzzled look from the waiter as Don walks slowly towards the lounge. The waiter pulls the stool away for him, and Don starts to rise. The lounge has two mirrors, with a painted attendant shining a customer as Don enters, carrying the scarf under his open jacket by the pressure of his upper arm. Between his fingers is a toothpick, making the whole thing look fairly natural. As Don picks up the bar of chocolate, he watches the attendant get a feather duster and bend down to dust off his hat. Don puts down the chocolate, pulls out the scarf, opens it, and finds some vouchers between a mirror, mascara, and keychain. He fishes out a fifty-dollar voucher, thrusts it in his pocket, and is about to close the scarf when he sees the daisies. Smiling at the idea that flashes into his mind, he takes one of the daisies, puts it into the scarf, closes it, and thrusts it back under his jacket. Just as the attendant straightens up, Don puts both hands into the air."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Behind the glass rests the folder of matches, which captivates Don's attention enough to make him slide the glass to one side. The waiter grabs the check, which is tucked between his vest and stiff shirt, and lays it face down in front of Don before gliding on with the tray of drinks. Don flips the check over and reaches into his pocket, extracting what cash he has, but he only has two one-dollar bills and some small change, which isn't sufficient. At that moment, the waiter returns, anticipating payment, and snatches the check before departing. Next to Don, a couple is chattering, but on the bench between him and the girl lies her bag. Don thinks there must be some money in the bag as the man murmurs something into the girl's ear, and she nods. Don scans the room, devising a plan, and subtly places his hand on the bench beside the handsome leather bag with gold initials, M. M. The bag shifts very close to his coat, and Don discreetly nudges it closer to himself, switching his cigarette and crossing his other arm so he can slide the bag up under his coat to his armpit, clutching it close to his ribs. Don serenely enjoys his cigarette as a great gentleman while the waiter returns with the drink, and guests and waiters move by. He gestures to a door at the other end of the room, and there is a tiny curious look from the waiter as Don strolls slowly towards the washroom. The waiter nudges the table away for him, and Don begins to stand. The washroom contains two washbasins, with a colored attendant brushing a customer as Don enters, holding the bag under his open coat by the pressure of his upper arm. Between his fingers is a cigarette, making the whole thing look fairly natural. As Don lifts the cake of soap, he watches the attendant retrieve a polishing rag and crouch down to dust off his shoes. Don sets down the soap, extracts the bag, opens it, and discovers some bills between a compact, lipstick, and keys. He retrieves a ten-dollar bill, slips it in his pocket, and is about to close the purse when he notices the carnations. Grinning at the idea that springs into his mind, he plucks one of the carnations, places it into the purse, closes it, and tucks it back under his coat. Just as the attendant rises, Don plunges both hands into the water."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Behind the curtain lies the collection of feathers, which attracts Jerry's attention enough to make him push the curtain to one side. The gardener takes the feather, which is thrust between his jacket and wool shirt, and puts it face down in front of Jerry before hurrying on with the basket of apples. Jerry turns the feather over and puts his hand in his shoe, pulling out what marbles he has, but he only has two round pebbles and some small pebbles, which isn't enough. At that moment, the gardener returns, expecting to be thanked, and takes the feather before leaving. Next to Jerry, a bird is chirping, but on the log between him and the nest lies its twig. Jerry thinks there must be some fruit in the twig as the squirrel whispers something into the bird's ear, and it shakes its head. Jerry looks around the garden, forming a plan, and inadvertently drops his hand on the log beside the shiny metal twig with bronze initials, R. R. The twig moves very close to his sock, and Jerry imperceptibly pulls it closer to himself, switching his leaf and crossing his other arm so he can pull the twig up under his sock to his ankle, holding it close to his heel. Jerry calmly chews his leaf as a great scholar while the gardener comes back with the apple, and birds and gardeners pass by. He points to a window at the other end of the garden, and there is a tiny puzzled look from the gardener as Jerry walks slowly towards the hedge. The gardener pulls the branch away for him, and Jerry starts to rise. The hedge has two nests, with a striped beetle brushing a rabbit as Jerry enters, carrying the twig under his open sock by the pressure of his lower arm. Between his fingers is a leaf, making the whole thing look fairly natural. As Jerry picks up the clump of dirt, he watches the beetle get a polishing shell and bend down to dust off his paw. Jerry puts down the dirt, pulls out the twig, opens it, and finds some bark between a stone, berry, and leaves. He fishes out a square stone, thrusts it in his sock, and is about to close the cluster when he sees the thistles. Smiling at the idea that flashes into his mind, he takes one of the thistles, puts it into the cluster, closes it, and thrusts it back under his sock. Just as the beetle straightens up, Jerry puts both hands into the mud."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Behind the submarine floats the jar of feathers, which fascinates Ralph's curiosity enough to make him nudge the submarine to one side. The gardener lifts the umbrella, which is wedged between his vest and stiff shirt, and places it face down in front of Ralph before sprinting on with the platter of fruits. Ralph rotates the umbrella over and puts his foot in his pocket, pulling out what threads he has, but he only has two one-dollar scarves and some tiny marbles, which isn't enough. At that moment, the gardener returns, expecting to be applauded, and snatches the umbrella before wandering off. Next to Ralph, a band is howling, but on the stage between him and the singer lies her hat. Ralph believes there must be some money in the hat as the drummer murmurs something into the singer's ear, and she nods her head. Ralph glances around the arena, deriving a strategy, and inadvertently drops his elbow on the stage beside the elegant velvet hat with silver initials, R. R. The hat drifts very near to his jacket, and Ralph subtly tugs it nearer to himself, exchanging his cigarette and folding his other leg so he can tug the hat up under his jacket to his elbow, clutching it close to his ribs. Ralph leisurely smokes his cigarette as a great monarch while the gardener returns with the fruit, and guests and gardeners parade by. He gestures to a window at the other end of the arena, and there is a tiny curious expression from the gardener as Ralph strolls slowly towards the cloakroom. The gardener slides the platform away for him, and Ralph begins to leap. The cloakroom has two mirrors, with a painted assistant scrubbing a client as Ralph steps in, carrying the hat under his open jacket by the pressure of his forearm. Between his toes is a cigarette, making the whole scene appear fairly ordinary. As Ralph snatches the bowl of beans, he observes the assistant get a cleaning towel and crouch down to scrub his shoelaces. Ralph sets down the beans, extracts the hat, opens it, and discovers some scarves between a compact, lipstick, and keys. He retrieves a ten-dollar scarf, wedges it in his pocket, and is about to seal the hat when he sees the oranges. Grinning at the notion that sparks into his thoughts, he takes one of the oranges, places it into the hat, seals it, and wedges it back under his jacket. Just as the assistant rises, Ralph dips both ears into the water."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Behind the curtain lies the envelope of feathers, which captures Don's curiosity enough to make him slide the curtain aside. The waiter grabs the menu, which is wedged between his apron and soft vest, and places it upside down in front of Don before dashing off with the plate of pastries. Don flips the menu over and digs his hand into his bag, pulling out what coins he has, but he only has two quarters and some loose buttons, which isn't adequate. At that juncture, the waiter returns, anticipating a tip, and snatches the menu before departing. Beside Don, a couple is humming, but on the cushion between him and the girl rests her notebook. Don speculates there must be some treasures in the notebook as the man mumbles something into the girl's ear, and she shrugs. Don scans the room, concocting a scheme, and accidentally lets his hand land on the cushion next to the elegant velvet notebook with gold lettering, G. G. The notebook shifts very close to his umbrella, and Don stealthily pulls it nearer to himself, switching his cigar and folding his opposite arm so he can lift the notebook up under his coat to his side, clutching it tightly to his ribs. Don leisurely puffs his cigar as a refined gentleman while the waiter returns with the pastry, and patrons and staff bustle past. He gestures to a curtain at the other end of the room, and there is a faintly bemused expression from the waiter as Don ambles slowly towards the cloakroom. The waiter slides the bench away for him, and Don begins to rise. The cloakroom contains two mirrors, with a colorful assistant sweeping a patron as Don steps in, clutching the notebook under his open coat with the grip of his upper arm. Between his fingers is a cigar, making the entire affair seem quite ordinary. As Don reaches for the piece of cloth, he watches the assistant retrieve a shining cloth and lean down to polish his shoes. Don sets down the cloth, extracts the notebook, opens it, and discovers some vouchers tucked between a brush, eyeliner, and clips. He plucks out a twenty-dollar voucher, slips it into his pocket, and is about to close the notebook when he notices the daisies. Grinning at the notion that pops into his head, he takes one of the daisies, places it into the notebook, closes it, and tucks it back under his coat. Just as the assistant rises, Don immerses both hands into the sink."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Beyond the curtain sits the collection of marbles, which captures Janet's curiosity enough to make her slide the curtain aside. The baker steals the note, which is tucked under his jacket and wool shirt, and sets it upside down near Janet before wandering off with the platter of pastries. Janet flips the note and dips her hand into her wallet, extracting what coins she possesses, but she only has three ten-cent pieces and a few pebbles, which isn't sufficient. At that instant, the baker reappears, anticipating payment, and retrieves the note before departing. Beside Janet, a duo is humming, but on the pillow between her and the lad rests his hat. Janet supposes there might be a key in the hat as the woman shouts something into the lad's eye, and he blinks. Janet peers around the café, concocting an idea, and accidentally drops her foot on the pillow beside the gleaming straw hat with silver letters, B. B. The hat drifts very near to her shoes, and Janet subtly tugs it closer to herself, switching her sunglasses and folding her opposite leg so she can tuck the hat up under her scarf to her neck, clutching it close to her ribs. Janet gracefully adjusts her sunglasses as a grand duchess while the baker returns with the pie, and patrons and bakers stroll by. She gestures to a window at the opposite side of the café, and there is a slight bewildered expression from the baker as Janet strides leisurely towards the pantry. The baker shifts the chair for her, and Janet begins to stand. The pantry contains two cabinets, with a tall assistant brushing a visitor as Janet strides in, bearing the hat under her loose scarf by the grip of her upper hand. Between her toes is a candy cane, making the whole scene appear quite natural. As Janet reaches for the bar of chocolate, she observes the assistant grab a cleaning cloth and crouch to tidy up her boots. Janet sets down the chocolate, pulls out the hat, opens it, and discovers some coins between a brush, pen, and cards. She extracts a twenty-cent coin, stashes it in her wallet, and is about to seal the hat when she notices the apples. Chuckling at the thought that springs into her head, she takes one of the apples, places it into the hat, closes it, and tucks it back under her scarf. Just as the assistant stands upright, Janet plunges both hands into the juice."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Behind the glass, a folder of matches catches Don's interest, prompting him to move the glass aside. He turns over a bill left by the waiter and finds he only has two dollars and some change, which isn’t enough. When the waiter returns expecting payment, Don eyes a nearby couple's bag, thinking it might contain money. Formulating a plan, Don discreetly pulls the bag towards him and conceals it under his coat. Acting nonchalant, he smokes as he heads to the washroom, where he opens the bag and finds some bills. He takes a ten-dollar bill, then notices carnations inside and, in a whimsical gesture, places one in the purse before hiding it again. The attendant finishes polishing a customer's shoes as Don casually continues washing his hands."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Just as the attendant straightens up Don puts both hands into the water Smiling at the idea that flashes into his mind he takes one of the carnations puts it into the purse closes it and thrusts it back under his coat He fishes out a tendollar bill thrusts it in his pocket and is about to close the purse when he sees the carnations Don puts down the soap pulls out the bag opens it and finds some bills between a compact lipstick and keys As Don picks up the cake of soap he watches the attendant get a polishing rag and bend down to dust off his shoes Between his fingers is a cigarette making the whole thing look fairly natural The washroom has two washbasins with a colored attendant brushing a customer as Don enters carrying the bag under his open coat by the pressure of his upper arm The waiter pulls the table away for him and Don starts to rise He points to a door at the other end of the room and there is a tiny puzzled look from the waiter as Don walks slowly towards the washroom Don calmly smokes his cigarette as a great gentleman while the waiter comes back with the drink and guests and waiters pass by The bag moves very close to his coat and Don imperceptibly pulls it closer to himself switching his cigarette and crossing his other arm so he can pull the bag up under his coat to his armpit holding it close to his ribs M M Don looks around the room forming a plan and inadvertently drops his hand on the bench beside the handsome leather bag with gold initials Don thinks there must be some money in the bag as the man whispers something into the girl's ear and she shakes her head Next to Don a couple is cooing but on the bench between him and the girl lies her bag At that moment the waiter returns expecting to be paid and takes the check before leaving Don turns the check over and puts his hand in his pocket pulling out what cash he has but he only has two onedollar bills and some small change which is not enough The waiter takes the check which is thrust between his vest and stiff shirt and puts it face down in front of Don before hurrying on with the tray of drinks Behind the glass lies the folder of matches which attracts Don's attention enough to make him push the glass to one side"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "As Don picks up the cake of soap he watches the attendant get a polishing rag and bend down to dust off his shoes Between his fingers is a cigarette making the whole thing look fairly natural Next to Don a couple is cooing but on the bench between him and the girl lies her bag Don calmly smokes his cigarette as a great gentleman while the waiter comes back with the drink and guests and waiters pass by Don thinks there must be some money in the bag as the man whispers something into the girl's ear and she shakes her head Don puts down the soap pulls out the bag opens it and finds some bills between a compact lipstick and keys Smiling at the idea that flashes into his mind he takes one of the carnations puts it into the purse closes it and thrusts it back under his coat Don looks around the room forming a plan and inadvertently drops his hand on the bench beside the handsome leather bag with gold initials The washroom has two washbasins with a colored attendant brushing a customer as Don enters carrying the bag under his open coat by the pressure of his upper arm He fishes out a tendollar bill thrusts it in his pocket and is about to close the purse when he sees the carnations He points to a door at the other end of the room and there is a tiny puzzled look from the waiter as Don walks slowly towards the washroom The waiter takes the check which is thrust between his vest and stiff shirt and puts it face down in front of Don before hurrying on with the tray of drinks The waiter pulls the table away for him and Don starts to rise Don turns the check over and puts his hand in his pocket pulling out what cash he has but he only has two onedollar bills and some small change which is not enough Just as the attendant straightens up Don puts both hands into the water M M The bag moves very close to his coat and Don imperceptibly pulls it closer to himself switching his cigarette and crossing his other arm so he can pull the bag up under his coat to his armpit holding it close to his ribs Behind the glass lies the folder of matches which attracts Don's attention enough to make him push the glass to one side At that moment the waiter returns expecting to be paid and takes the check before leaving"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "He points to a door at the other end of the room and there is a tiny puzzled look from the waiter as Don walks slowly towards the washroom The waiter pulls the table away for him and Don starts to rise The washroom has two washbasins with a colored attendant brushing a customer as Don enters carrying the bag under his open coat by the pressure of his upper arm Between his fingers is a cigarette making the whole thing look fairly natural As Don picks up the cake of soap he watches the attendant get a polishing rag and bend down to dust off his shoes Don puts down the soap pulls out the bag opens it and finds some bills between a compact lipstick and keys He fishes out a tendollar bill thrusts it in his pocket and is about to close the purse when he sees the carnations Smiling at the idea that flashes into his mind he takes one of the carnations puts it into the purse closes it and thrusts it back under his coat Just as the attendant straightens up Don puts both hands into the water Behind the glass lies the folder of matches which attracts Don's attention enough to make him push the glass to one side The waiter takes the check which is thrust between his vest and stiff shirt and puts it face down in front of Don before hurrying on with the tray of drinks Don turns the check over and puts his hand in his pocket pulling out what cash he has but he only has two onedollar bills and some small change which is not enough At that moment the waiter returns expecting to be paid and takes the check before leaving Next to Don a couple is cooing but on the bench between him and the girl lies her bag Don thinks there must be some money in the bag as the man whispers something into the girl's ear and she shakes her head Don looks around the room forming a plan and inadvertently drops his hand on the bench beside the handsome leather bag with gold initials M M The bag moves very close to his coat and Don imperceptibly pulls it closer to himself switching his cigarette and crossing his other arm so he can pull the bag up under his coat to his armpit holding it close to his ribs Don calmly smokes his cigarette as a great gentleman while the waiter comes back with the drink and guests and waiters pass by"
        }
      ]
    }
  ]
}