{
  "ground_truth": "Westley examines where the flames burst over Buttercup and pulls her aside to safety as another great spout of flame suddenly shoots up, while Buttercup is frozen with fear. He takes her hand and gently leads her forward as they move slowly through a particularly dangerous part of the Fire Swamp. Later, with the sun slanting down at a slightly different angle, Westley picks up Buttercup as they walk along, moves her out of danger, puts her back down, and continues talking without missing a beat. Using his sword, Westley slices a path for them, causing the vines to groan as they fall, all while chatting. Westley picks Buttercup up to carry her across some swamp water that is bridged by a narrow, rickety tree branch, and they have by now crossed the pond. As Buttercup, perplexed, is about to reply, the ground gives way beneath her—it’s Lightning Sand—and she sinks into it, crying Westley’s name before disappearing. Whirling, Westley slashes a U-shaped vine in half, grabs it, drops his sword, and dives into the lightning sand, clutching the other end of the vine, resulting in another cloud of white powder. Nothing can be seen now except the lightning sand, which is lovely and lethal. A giant R.O.U.S. darts into view, sniffs around, and then disappears. Westley, with lungs near bursting, explodes out of the sand with Buttercup across his shoulders, pulling them to the edge of the pit using the vine. Buttercup's face is caked with white powder—in her eyes, ears, hair, and mouth—yet she is still probably beautiful, but you have to look awfully hard to see it, as Westley continues to pull them to safety. The R.O.U.S., high above them, watches. Buttercup is placed against a tree while Westley cleans the lightning sand from her face. The R.O.U.S., now on a much lower branch, stares down at Westley, who stares back. As Buttercup's eyes flutter, he continues to work on her. There are now two R.O.U.S.s that have climbed into a nearby tree, staring hungrily down. Westley picks Buttercup up, puts an arm around her, and starts to walk with her as he encouragingly continues talking.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Westley inspects where the blazes erupt over Buttercup and drags her aside to refuge as another immense geyser of blaze suddenly shoots up, while Buttercup is immobile with terror. He grasps her hand and tenderly guides her onward as they proceed slowly through a particularly perilous segment of the Fire Swamp. Later, with the sun inclining down at a slightly altered angle, Westley lifts Buttercup as they stroll along, shifts her out of peril, sets her back down, and proceeds speaking without omitting a beat. Utilizing his sword, Westley cleaves a trail for them, causing the vines to moan as they descend, all while conversing. Westley hoists Buttercup to bear her across some bog water that is spanned by a narrow, unstable tree limb, and they have by now traversed the pond. As Buttercup, puzzled, is about to respond, the ground gives way beneath her—it’s Lightning Sand—and she descends into it, calling Westley’s name before vanishing. Spinning, Westley hacks a U-shaped vine in half, grasps it, relinquishes his sword, and plunges into the lightning sand, gripping the other end of the vine, resulting in another haze of white dust. Nothing can be observed now except the lightning sand, which is exquisite and deadly. A giant R.O.U.S. rushes into sight, sniffs around, and then vanishes. Westley, with lungs near bursting, erupts out of the sand with Buttercup across his shoulders, pulling them to the edge of the chasm using the vine. Buttercup's visage is encrusted with white dust—in her eyes, ears, hair, and mouth—yet she is still probably exquisite, but you have to look extremely hard to discern it, as Westley continues to pull them to refuge. The R.O.U.S., high above them, observes. Buttercup is set against a tree while Westley cleans the lightning sand from her visage. The R.O.U.S., now on a much lower bough, stares down at Westley, who gazes back. As Buttercup's eyes flicker, he proceeds to work on her. There are now two R.O.U.S.s that have climbed into an adjacent tree, gazing ravenously down. Westley hoists Buttercup up, puts an arm around her, and begins to walk with her as he encouragingly persists talking."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Where the flames burst over Buttercup was examined by Westley, and she was pulled aside to safety by him as another great spout of flame suddenly shoots up, while Buttercup is frozen with fear. Her hand is taken by him, and they are gently led forward as they are moved slowly through a particularly dangerous part of the Fire Swamp. Later, with the sun slanting down at a slightly different angle, Buttercup is picked up by Westley as they walk along, and she is moved out of danger, put back down, and he continues talking without missing a beat. A path is sliced for them by Westley using his sword, causing the vines to groan as they fall, all while he chats. Buttercup is picked up by Westley to be carried across some swamp water that is bridged by a narrow, rickety tree branch, and the pond has been crossed by them by now. As Buttercup, perplexed, is about to reply, the ground gives way beneath her, and it’s Lightning Sand—it causes her to sink into it, crying Westley’s name before disappearing. A U-shaped vine is slashed in half by Westley, grabbed by him, he drops his sword, and he dives into the lightning sand, clutching the other end of the vine, resulting in another cloud of white powder. Now nothing can be seen except the lightning sand, which is lovely and lethal. A giant R.O.U.S. darts into view, sniffs around, and then disappears. With lungs near bursting, Westley explodes out of the sand with Buttercup across his shoulders, and the edge of the pit is pulled to by them using the vine. Buttercup’s face is caked with white powder—in her eyes, ears, hair, and mouth—yet she is still probably beautiful, but someone has to look awfully hard to see it, as they continue to be pulled to safety by Westley. The R.O.U.S., high above them, watches. Buttercup is placed against a tree by Westley while the lightning sand is cleaned from her face by him. The R.O.U.S., now on a much lower branch, stares down at Westley, who stares back. As Buttercup's eyes flutter, her face continues to be worked on by him. There are now two R.O.U.S.s that have climbed into a nearby tree, staring hungrily down. Buttercup is picked up by Westley, an arm is put around her by him, and they start to walk as she is encouraged by his continued talking."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Westley examines the flames that burst around Buttercup and quickly pulls her to safety, taking her hand to lead her through the dangerous Fire Swamp. Later, as the sun shifts slightly, he carries Buttercup out of harm's way, continuing to chat and clear a path with his sword as vines fall. Westley carries Buttercup across swamp water on a narrow, rickety branch. Suddenly, Buttercup sinks into Lightning Sand, crying out as she vanishes. Westley swiftly cuts a vine, drops his sword, and dives in after her, emerging with Buttercup on his shoulders and pulling them to safety. Her face is caked with white powder, obscuring her beauty, but Westley persists, cleaning her face while the R.O.U.S. observes from above. Westley places Buttercup against a tree, resumes clearing the sand, and watches the R.O.U.S. as Buttercup regains consciousness. More R.O.U.S.s appear, eyeing them hungrily from a tree, as Westley supports Buttercup and continues talking reassuringly."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Westley pulls Buttercup to safety from the flames as she stands frozen in fear. He gently leads her through the Fire Swamp, later lifting her to avoid danger as they walk and converse. Using his sword, Westley clears their path, carrying Buttercup over swamp water on a rickety branch. Suddenly, Buttercup sinks into Lightning Sand, calling Westley as she vanishes. Westley cuts a vine, dives in, and emerges with Buttercup on his shoulders, pulling them out using the vine. Her face is covered in white powder, yet her beauty remains visible with effort. R.O.U.S.s watch hungrily as Westley cleans Buttercup's face. He picks her up, supports her, and they continue walking and talking."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Westley carefully examines the spot where the fierce flames dramatically burst over Buttercup and quickly pulls her aside to a safer area, ensuring her protection as another sudden and spectacular spout of flame erupts. During this terrifying moment, Buttercup remains frozen with fear, unable to move. Gently, Westley takes her hand and leads her with care, guiding her forward as they cautiously make their way through a particularly treacherous section of the notorious Fire Swamp. Later on, when the sun is casting its rays down at a slightly different angle, Westley effortlessly picks up Buttercup as they walk along. He expertly moves her out of harm's way, places her back on the ground, and seamlessly continues their conversation without pausing. Using his trusty sword, Westley efficiently slices a path for them, causing the tangled vines to groan as they fall, all while maintaining a lively conversation. Westley then lifts Buttercup once more to carry her across a patch of swamp water, precariously bridged by a narrow, rickety tree branch, and they successfully cross the pond together. Just as Buttercup, perplexed by their predicament, is about to respond, the ground suddenly gives way beneath her—it is the deadly Lightning Sand—and she sinks into it, crying out Westley’s name in desperation before disappearing from view. Whirling around with urgency, Westley expertly slashes a U-shaped vine in half, grabs hold of it, drops his sword, and dives headfirst into the treacherous lightning sand, clutching the other end of the vine. This action results in another cloud of white, powdery substance. At this moment, nothing can be seen except the captivating yet deadly beauty of the lightning sand. A giant Rodent of Unusual Size (R.O.U.S.) briefly darts into view, sniffs the air, and then disappears back into the swamp. With his lungs nearly bursting from the effort, Westley suddenly erupts from the sand, carrying Buttercup draped across his shoulders. He pulls them both to the edge of the pit, using the vine for leverage. Buttercup's face is completely caked with the white powder—it covers her eyes, ears, hair, and mouth—yet, despite this, she retains her beauty, though it may be hard to see amidst the chaos, as Westley tirelessly continues to pull them both to safety. The R.O.U.S., positioned high above them, carefully watches their every move. Westley gently places Buttercup against a tree and begins to clean the persistent lightning sand from her face. The R.O.U.S., now perched on a much lower branch, fixes its gaze on Westley, who returns the stare with determination. As Buttercup's eyes flutter open, Westley continues to diligently work on her, ensuring she is alright. By now, two additional R.O.U.S.s have climbed into a nearby tree, hungrily staring down at the duo. Westley, ever the protector, picks Buttercup up once more, wraps an arm around her for support, and starts to walk with her by his side, continuously offering words of encouragement as they proceed on their perilous journey."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Westley, with great care and precision, turns his keen eyes to the exact spot where the fierce, roaring flames had erupted dramatically, casting a dangerous glow over Buttercup. He swiftly pulls her aside to a safer and more secure location, ensuring her protection from harm, just as another sudden and awe-inspiring spout of flame bursts forth nearby. During this heart-pounding and terrifying moment, Buttercup stands completely frozen with fear, paralyzed and unable to move an inch. With a gentle touch, Westley takes her trembling hand and leads her with utmost care, guiding her step by step as they cautiously navigate their way through a particularly treacherous section of the infamous and perilous Fire Swamp. Later on, as the sun moves across the sky, casting its warm rays at a slightly altered angle, Westley lifts Buttercup effortlessly as they walk along the rugged path. With expertise and care, he moves her out of potential danger, places her gently back on the ground, and seamlessly continues their important conversation without skipping a beat. Using his trusty and reliable sword, Westley efficiently slices a path through the overgrown vegetation for them, causing the tangled vines to groan and rustle as they fall away, all the while maintaining a lively and engaging conversation. Westley then lifts Buttercup once again to carry her across a stretch of swamp water, precariously spanned by a narrow and rickety tree branch, and they successfully make their way across the pond together. Just as Buttercup, perplexed and bewildered by their predicament, is about to speak, the ground suddenly gives way beneath her—it is the infamous and deadly Lightning Sand—and she sinks swiftly into it, crying out Westley’s name in sheer desperation before disappearing from view. Whirling around with urgency and determination, Westley expertly slashes a U-shaped vine cleanly in half, grabs hold of one end with a firm grip, drops his sword in haste, and dives headfirst into the treacherous lightning sand, clutching the other end of the vine. This daring action results in another billowing cloud of white, powdery substance filling the air. At this critical moment, nothing can be seen except for the captivating yet deadly beauty of the lightning sand. A giant Rodent of Unusual Size (R.O.U.S.) briefly darts into view, sniffing cautiously at the air before disappearing back into the depths of the swamp. With his lungs nearly bursting from exertion, Westley suddenly erupts from the sand, carrying Buttercup draped securely across his shoulders. He pulls them both to the safety of the pit's edge, using the vine for much-needed leverage. Buttercup's face is entirely caked with the pervasive white powder—it coats her eyes, ears, hair, and mouth—yet, despite this, she retains her undeniable beauty, though it may be difficult to recognize amidst the chaos. Westley tirelessly continues to pull them both to safety. The R.O.U.S., positioned high above them, watches their every move with careful scrutiny. Westley gently places Buttercup against a nearby tree and begins to meticulously clean the stubborn lightning sand from her face. The R.O.U.S., now perched on a much lower branch, fixes its intense gaze on Westley, who returns the stare with unyielding determination. As Buttercup's eyes flutter open, Westley continues to diligently work on her, ensuring she is indeed alright. By now, two additional R.O.U.S.s have climbed into a nearby tree, hungrily staring down at the duo with keen interest. Westley, ever the vigilant protector, picks Buttercup up once more, wraps a supportive arm around her, and starts to walk with her by his side, continuously offering words of encouragement as they bravely proceed on their perilous journey through the daunting swamp."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Westley stands with a keen gaze fixed on the space where the flames leap over Buttercup, and with swift precision, he maneuvers her to the side, ensuring her safety just as another impressive spout of fire erupts upwards, leaving Buttercup momentarily frozen with fear. Taking her hand with a reassuring grasp, he gently guides her forward, each step careful and deliberate, as they traverse slowly across a particularly treacherous segment of the Fire Swamp. As time passes and the sun casts its rays at a slightly different angle, Westley, with a smooth and practiced motion, lifts Buttercup with ease, carrying her a short distance to avert danger, then gently sets her down, all the while maintaining an ongoing conversation without missing a beat. His sword at the ready, Westley expertly slices through the dense foliage, the vines protesting with groans as they descend, while he continues to chat effortlessly. When they reach a patch of swamp water precariously spanned by a narrow, unstable tree branch, Westley effortlessly hoists Buttercup into his arms and carries her across, ensuring steady footing as they together cross the pond. As Buttercup, filled with perplexity, prepares to respond, the ground betrays her by collapsing beneath her feet—it’s Lightning Sand—and she descends into it, her voice ringing out with Westley's name before she vanishes from sight. In a swift, fluid motion, Westley pivots, slices a U-shaped vine in half, secures it firmly in his grasp, releases his hold on his sword, and plunges into the lightning sand, maintaining a grip on the vine’s other end, resulting in a burst of white powder dispersing into the air. At this moment, the scene is dominated by the sight of the treacherous lightning sand, both beautiful and deadly. A giant R.O.U.S. appears briefly, sniffing the air before retreating from view. With his lungs nearing the breaking point, Westley erupts from the sand with a dramatic burst, Buttercup draped over his shoulders, laboriously pulling them both to the pit's edge using the vine as leverage. Buttercup's visage is obscured by white powder—coating her eyes, ears, hair, and mouth—yet her beauty remains, albeit beneath a layer of grime, as Westley persists in drawing them to safety. Observing from above, the R.O.U.S. monitors their progress. Once on solid ground, Westley positions Buttercup against a tree, diligently wiping the lightning sand from her face. The R.O.U.S., having descended to a lower branch, gazes intently at Westley, who returns the stare. As Buttercup's eyes flicker open, Westley continues his careful ministrations, undeterred. Meanwhile, a pair of additional R.O.U.S.s has scaled a nearby tree, their eyes fixed hungrily upon the scene below. Westley, with unwavering resolve, lifts Buttercup once more, wraps an arm around her for support, and begins to walk with her, his voice steady and encouraging as he continues to speak."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Westley swiftly moves Buttercup to safety as flames burst near them and then guides her cautiously through the perilous Fire Swamp. As they progress, Westley carries Buttercup across hazardous obstacles, using his sword to clear their path while maintaining conversation effortlessly. When Buttercup unexpectedly sinks into the Lightning Sand, Westley immediately cuts a vine, dives in after her, and with determination, pulls them both to safety despite the sand's lethal beauty. After emerging from the sand with Buttercup on his shoulders, Westley cleans her face of caked white powder as she regains consciousness. Meanwhile, ominous R.O.U.S.s observe from above. Unfazed, Westley helps Buttercup to her feet, supporting her as they continue their journey, all the while keeping her spirits up with his reassuring words."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Westley examines where the flames, notoriously unpredictable in the dangerous Fire Swamp known for its deadly conditions, burst over Buttercup and pulls her aside to safety as another great spout of flame suddenly shoots up, while Buttercup is frozen with fear. He takes her hand and gently leads her forward as they move slowly through a particularly dangerous part of the Fire Swamp, a place fabled for its treacherous landscape and home to many legends. Later, with the sun slanting down at a slightly different angle, casting long shadows that shift eerily around them, Westley picks up Buttercup as they walk along, moves her out of danger, puts her back down, and continues talking without missing a beat. Using his sword, a weapon he mastered while training with the finest swordsmen in the land, Westley slices a path for them, causing the vines to groan as they fall, all while chatting. Westley picks Buttercup up to carry her across some swamp water that is bridged by a narrow, rickety tree branch, and they have by now crossed the pond, whose surface was deceptively calm. As Buttercup, perplexed and overwhelmed by their perilous journey, is about to reply, the ground gives way beneath her—it’s Lightning Sand, infamous for its ability to swallow travelers whole—and she sinks into it, crying Westley’s name before disappearing. Whirling, Westley slashes a U-shaped vine in half, grabs it, drops his sword, and dives into the lightning sand, clutching the other end of the vine, resulting in another cloud of white powder. Nothing can be seen now except the lightning sand, which is lovely in its shimmering allure yet undeniably lethal. A giant R.O.U.S., or Rodent of Unusual Size, a creature feared and often spoken of in hushed tones by those who live near the swamp, darts into view, sniffs around, and then disappears. Westley, with lungs near bursting and driven by his determination to save Buttercup, explodes out of the sand with Buttercup across his shoulders, pulling them to the edge of the pit using the vine. Buttercup's face is caked with white powder—in her eyes, ears, hair, and mouth—yet she is still probably beautiful, but you have to look awfully hard to see it, as Westley continues to pull them to safety. The R.O.U.S., high above them on a gnarled branch, watches. Buttercup is placed against a tree while Westley cleans the lightning sand from her face, working quickly to ensure her comfort. The R.O.U.S., now on a much lower branch, stares down at Westley, who stares back with defiance. As Buttercup's eyes flutter, regaining focus and understanding, he continues to work on her. There are now two R.O.U.S.s that have climbed into a nearby tree, staring hungrily down, their eyes glinting with menace. Westley picks Buttercup up, puts an arm around her, and starts to walk with her as he encouragingly continues talking, hoping to keep her spirits high."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "The ROUS now on a much lower branch stares down at Westley who stares back Westley examines where the flames burst over Buttercup and pulls her aside to safety as another great spout of flame suddenly shoots up while Buttercup is frozen with fear Later with the sun slanting down at a slightly different angle Westley picks Buttercup up puts an arm around her and starts to walk with her as he encouragingly continues talking He takes her hand and gently leads her forward as they move slowly through a particularly dangerous part of the Fire Swamp Westley picks up Buttercup as they walk along moves her out of danger puts her back down and continues talking without missing a beat Buttercup's face is caked with white powder—in her eyes ears hair and mouth—yet she is still probably beautiful but you have to look awfully hard to see it as Westley continues to pull them to safety He takes her hand and gently leads her forward as they move slowly through a particularly dangerous part of the Fire Swamp Later with the sun slanting down at a slightly different angle Westley picks up Buttercup as they walk along moves her out of danger puts her back down and continues talking without missing a beat Using his sword Westley slices a path for them causing the vines to groan as they fall all while chatting Westley picks Buttercup up to carry her across some swamp water that is bridged by a narrow rickety tree branch and they have by now crossed the pond As Buttercup perplexed is about to reply the ground gives way beneath her—it is Lightning Sand—and she sinks into it crying Westley’s name before disappearing Whirling Westley slashes a Ushaped vine in half grabs it drops his sword and dives into the lightning sand clutching the other end of the vine resulting in another cloud of white powder Nothing can be seen now except the lightning sand which is lovely and lethal A giant ROUS darts into view sniffs around and then disappears As Buttercup's eyes flutter he continues to work on her Westley with lungs near bursting explodes out of the sand with Buttercup across his shoulders pulling them to the edge of the pit using the vine Buttercup's face is caked with white powder—in her eyes ears hair and mouth—yet she is still probably beautiful but you have to look awfully hard to see it as Westley continues to pull them to safety Nothing can be seen now except the lightning sand which is lovely and lethal The ROUS high above them watches Buttercup is placed against a tree while Westley cleans the lightning sand from her face The ROUS now on a much lower branch stares down at Westley who stares back As Buttercup's eyes flutter he continues to work on her There are now two ROUSs that have climbed into a nearby tree staring hungrily down Westley examines where the flames burst over Buttercup and pulls her aside to safety as another great spout of flame suddenly shoots up while Buttercup is frozen with fear Westley picks Buttercup up puts an arm around her and starts to walk with her as he encouragingly continues talking"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Westley examines where the flames burst over Buttercup and pulls her aside to safety as another great spout of flame suddenly shoots up while Buttercup is frozen with fear. He takes her hand and gently leads her forward as they move slowly through a particularly dangerous part of the Fire Swamp. Later with the sun slanting down at a slightly different angle. Westley picks up Buttercup as they walk along moves her out of danger puts her back down and continues talking without missing a beat. Using his sword Westley slices a path for them causing the vines to groan as they fall all while chatting. Westley picks Buttercup up to carry her across some swamp water that is bridged by a narrow rickety tree branch and they have by now crossed the pond. As Buttercup perplexed is about to reply the ground gives way beneath her—it is Lightning Sand—and she sinks into it crying Westley’s name before disappearing. Whirling Westley slashes a Ushaped vine in half grabs it drops his sword and dives into the lightning sand clutching the other end of the vine resulting in another cloud of white powder. Nothing can be seen now except the lightning sand which is lovely and lethal. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. A giant ROUS darts into view sniffs around and then disappears. Westley with lungs near bursting explodes out of the sand with Buttercup across his shoulders pulling them to the edge of the pit using the vine. Buttercup's face is caked with white powder—in her eyes ears hair and mouth—yet she is still probably beautiful but you have to look awfully hard to see it as Westley continues to pull them to safety. The ROUS high above them watches. Buttercup is placed against a tree while Westley cleans the lightning sand from her face. The ROUS now on a much lower branch stares down at Westley who stares back. As Buttercup's eyes flutter he continues to work on her. There are now two ROUSs that have climbed into a nearby tree staring hungrily down. Westley picks Buttercup up puts an arm around her and starts to walk with her as he encouragingly continues talking."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Westley examines where the flames burst over Buttercup and pulls her aside to safety as another great spout of flame suddenly shoots up while Buttercup is frozen with fear. He takes her hand and gently leads her forward as they move slowly through a particularly dangerous part of the Fire Swamp. Later with the sun slanting down at a slightly different angle. Westley picks up Buttercup as they walk along moves her out of danger puts her back down and continues talking without missing a beat. Using his sword Westley slices a path for them causing the vines to groan as they fall all while chatting. Westley picks Buttercup up to carry her across some swamp water that is bridged by a narrow rickety tree branch and they have by now crossed the pond. As Buttercup perplexed is about to reply the ground gives way beneath her—it is Lightning Sand—and she sinks into it crying Westley’s name before disappearing. Whirling Westley slashes a Ushaped vine in half grabs it drops his sword and dives into the lightning sand clutching the other end of the vine resulting in another cloud of white powder. Nothing can be seen now except the lightning sand which is lovely and lethal. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. A giant ROUS darts into view sniffs around and then disappears. Westley with lungs near bursting explodes out of the sand with Buttercup across his shoulders pulling them to the edge of the pit using the vine. Buttercup's face is caked with white powder—in her eyes ears hair and mouth—yet she is still probably beautiful but you have to look awfully hard to see it as Westley continues to pull them to safety. The ROUS high above them watches. Buttercup is placed against a tree while Westley cleans the lightning sand from her face. The ROUS now on a much lower branch stares down at Westley who stares back. As Buttercup's eyes flutter he continues to work on her. There are now two ROUSs that have climbed into a nearby tree staring hungrily down. Westley picks Buttercup up puts an arm around her and starts to walk with her as he encouragingly continues talking."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Westley examines where the flames burst over Buttercup and pulls her aside to safety as another great spout of flame suddenly shoots up while Buttercup is frozen with fear. He takes her hand and gently leads her forward as they move slowly through a particularly dangerous part of the Fire Swamp. Later with the sun slanting down at a slightly different angle. Westley picks up Buttercup as they walk along moves her out of danger puts her back down and continues talking without missing a beat. Using his sword Westley slices a path for them causing the vines to groan as they fall all while chatting. The ROUS now on a much lower branch stares down at Westley who stares back. As Buttercup's eyes flutter he continues to work on her. There are now two ROUSs that have climbed into a nearby tree staring hungrily down. Westley picks Buttercup up puts an arm around her and starts to walk with her as he encouragingly continues talking."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Westley examines where the flames burst over Buttercup and pulls her aside to safety as another great spout of flame suddenly shoots up while Buttercup is frozen with fear. He takes her hand and gently leads her forward as they move slowly through a particularly dangerous part of the Fire Swamp. There are now two ROUSs that have climbed into a nearby tree staring hungrily down. Westley picks Buttercup up puts an arm around her and starts to walk with her as he encouragingly continues talking."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The mouse examines where the flames burst over the tree and pulls it aside to safety as another great spout of flame suddenly shoots up, while the tree is frozen with fear. The mouse takes its hand and gently leads it forward as they move slowly through a particularly dangerous part of the Fire Swamp. Later, with the sun slanting down at a slightly different angle, the mouse picks up the tree as they walk along, moves it out of danger, puts it back down, and continues talking without missing a beat. Using its sword, the mouse slices a path for them, causing the vines to groan as they fall, all while chatting. The mouse picks the tree up to carry it across some swamp water that is bridged by a narrow, rickety tree branch, and they have by now crossed the pond. As the tree, perplexed, is about to reply, the ground gives way beneath it—it’s Lightning Sand—and it sinks into it, crying the mouse's name before disappearing. Whirling, the mouse slashes a U-shaped vine in half, grabs it, drops its sword, and dives into the lightning sand, clutching the other end of the vine, resulting in another cloud of white powder. Nothing can be seen now except the lightning sand, which is lovely and lethal. A giant R.O.U.S. darts into view, sniffs around, and then disappears. The mouse, with lungs near bursting, explodes out of the sand with the tree across its shoulders, pulling them to the edge of the pit using the vine. The tree's face is caked with white powder—in its eyes, ears, hair, and mouth—yet it is still probably beautiful, but you have to look awfully hard to see it, as the mouse continues to pull them to safety. The R.O.U.S., high above them, watches. The tree is placed against a tree while the mouse cleans the lightning sand from its face. The R.O.U.S., now on a much lower branch, stares down at the mouse, who stares back. As the tree's eyes flutter, the mouse continues to work on it. There are now two R.O.U.S.s that have climbed into a nearby tree, staring hungrily down. The mouse picks the tree up, puts an arm around it, and starts to walk with it as the mouse encouragingly continues talking."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Westley examines where the geysers burst over Buttercup and pulls her aside to safety as another great spout of water suddenly shoots up, while Buttercup is frozen with fear. He takes her hand and gently leads her forward as they move slowly through a particularly dangerous part of the Misty Marsh. Later, with the moon slanting down at a slightly different angle, Westley picks up Buttercup as they walk along, moves her out of danger, puts her back down, and continues talking without missing a beat. Using his walking stick, Westley slices a path for them, causing the branches to rustle as they fall, all while chatting. Westley picks Buttercup up to carry her across some marshland that is bridged by a narrow, rickety wooden plank, and they have by now crossed the lagoon. As Buttercup, perplexed, is about to reply, the ground gives way beneath her—it’s Quicksand Mud—and she sinks into it, crying Westley’s name before disappearing. Whirling, Westley slashes a U-shaped branch in half, grabs it, drops his walking stick, and dives into the quicksand mud, clutching the other end of the branch, resulting in another cloud of brown dust. Nothing can be seen now except the quicksand mud, which is sticky and treacherous. A giant P.O.U.S. darts into view, sniffs around, and then disappears. Westley, with lungs near bursting, explodes out of the mud with Buttercup across his shoulders, pulling them to the edge of the pit using the branch. Buttercup's face is caked with brown dust—in her eyes, ears, hair, and mouth—yet she is still probably beautiful, but you have to look awfully hard to see it, as Westley continues to pull them to safety. The P.O.U.S., high above them, watches. Buttercup is placed against a rock while Westley cleans the quicksand mud from her face. The P.O.U.S., now on a much lower boulder, stares down at Westley, who stares back. As Buttercup's eyes flutter, he continues to work on her. There are now two P.O.U.S.s that have climbed into a nearby bush, staring hungrily down. Westley picks Buttercup up, puts an arm around her, and starts to walk with her as he encouragingly continues talking."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Westley observes where the flames twirl around Buttercup and nudges her aside to safety as another great spout of flame suddenly flickers up, while Buttercup is frozen with fear. He clasps her hand and steadily guides her forward as they tiptoe slowly through a particularly risky part of the Fire Swamp. Later, with the sun hanging down at a slightly different angle, Westley hoists Buttercup as they march along, nudges her out of danger, sets her back down, and continues humming without missing a beat. Using his sword, Westley trims a path for them, causing the vines to shiver as they collapse, all while skipping. Westley lifts Buttercup up to swing her across some swamp water that is crossed by a narrow, rickety tree branch, and they have by now floated over the pond. As Buttercup, baffled, is about to exclaim, the ground shifts beneath her—it’s Lightning Sand—and she drifts into it, murmuring Westley’s name before vanishing. Swirling, Westley sweeps a U-shaped vine in two, snatches it, drops his sword, and plunges into the lightning sand, clutching the other end of the vine, resulting in another puff of white powder. Nothing can be seen now except the lightning sand, which is graceful and deadly. A giant R.O.U.S. swirls into view, peeks around, and then evaporates. Westley, with lungs near bursting, erupts out of the sand with Buttercup across his shoulders, dragging them to the edge of the pit using the vine. Buttercup's face is caked with white powder—in her eyes, ears, hair, and mouth—yet she is still probably beautiful, but you have to gaze awfully hard to see it, as Westley continues to drag them to safety. The R.O.U.S., high above them, peers. Buttercup is positioned against a tree while Westley brushes the lightning sand from her face. The R.O.U.S., now on a much lower branch, peers down at Westley, who peers back. As Buttercup's eyes flicker, he continues to tend to her. There are now two R.O.U.S.s that have scampered into a nearby tree, peering hungrily down. Westley cradles Buttercup up, wraps an arm around her, and starts to stroll with her as he cheerfully continues singing."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Giraffe inspects where the waterfalls burst over Daffodil and pulls her aside to safety as another great geyser of confetti suddenly shoots up, while Daffodil is frozen with anxiety. It takes her elbow and gently leads her forward as they move slowly through a particularly hazardous part of the Jelly Marsh. Later, with the moon slanting down at a slightly different angle, Giraffe picks up Daffodil as they hop along, moves her out of peril, puts her back down, and continues chatting without missing a beat. Using its whisk, Giraffe slices a route for them, causing the cattails to groan as they topple, all while joking. Giraffe picks Daffodil up to carry her across some marshy water that is bridged by a narrow, rickety swing, and they have by now crossed the puddle. As Daffodil, puzzled, is about to reply, the floor gives way beneath her—it’s Thunder Grit—and she sinks into it, shouting Giraffe's name before vanishing. Twisting, Giraffe slashes a J-shaped reed in half, grabs it, drops its whisk, and dives into the thunder grit, clutching the other end of the reed, resulting in another plume of pink mist. Nothing can be perceived now except the thunder grit, which is enchanting and deadly. A giant S.M.O.S. dashes into view, sniffs around, and then vanishes. Giraffe, with lungs near bursting, erupts out of the grit with Daffodil across its shoulders, pulling them to the lip of the hollow using the reed. Daffodil's face is coated with pink mist—in her eyes, ears, hair, and mouth—yet she is still potentially graceful, but you have to look awfully hard to perceive it, as Giraffe continues to pull them to safety. The S.M.O.S., high above them, observes. Daffodil is placed against a bush while Giraffe wipes the thunder grit from her face. The S.M.O.S., now on a much lower perch, glares down at Giraffe, who glares back. As Daffodil's eyes twitch, it continues to tidy her. There are now two S.M.O.S.s that have climbed into a nearby thicket, glaring hungrily down. Giraffe picks Daffodil up, puts an arm around her, and starts to leap with her as it encouragingly continues conversing."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Bernard analyzes where the rainbows sprout over Daisy and pushes her aside to safety as another great gust of wind suddenly breezes through, while Daisy is immobilized with awe. He nudges her elbow and softly guides her onward as they shuffle slowly through a particularly treacherous section of the Thunder Valley. Later, with the moon casting down at a slightly altered angle, Bernard lifts Daisy as they stroll along, shifts her out of risk, places her back down, and keeps conversing without losing track. Using his cane, Bernard prunes a trail for them, causing the branches to moan as they collapse, all while chatting. Bernard hoists Daisy up to carry her across some marshland water that is spanned by a narrow, shaky log, and they have now traversed the pool. As Daisy, bewildered, is about to respond, the soil gives way beneath her—it’s Quicksand Dust—and she sinks into it, calling Bernard’s name before vanishing. Spinning, Bernard splits a U-shaped branch in half, clutches it, drops his cane, and plunges into the quicksand dust, holding the other end of the branch, resulting in another puff of white mist. Nothing can be seen now except the quicksand dust, which is dazzling and deadly. A giant S.O.U.S. flits into sight, sniffs the air, and then withdraws. Bernard, with lungs nearly exhausted, erupts out of the dust with Daisy across his shoulders, hauling them to the edge of the sinkhole using the branch. Daisy's face is coated with white mist—in her eyes, ears, hair, and mouth—yet she is still possibly stunning, but you have to look incredibly closely to notice it, as Bernard continues to drag them to security. The S.O.U.S., high above them, observes. Daisy is positioned against a bush while Bernard wipes the quicksand dust from her face. The S.O.U.S., now on a much lower branch, glowers down at Bernard, who gazes back. As Daisy's eyes flicker, he continues to tend to her. There are now two S.O.U.S.s that have climbed into a nearby shrub, watching eagerly down. Bernard lifts Daisy up, wraps an arm around her, and begins to stroll with her as he encouragingly continues conversing."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Westley inspects where the waves crash over Buttercup and tugs her aside to safety as another great splash of water suddenly leaps up, while Buttercup is immobilized with surprise. He takes her elbow and softly guides her forward as they tiptoe slowly through a particularly perilous part of the Ice Jungle. Later, with the moon shining down at a slightly different angle, Westley hoists Buttercup as they wander along, shifts her out of harm's way, places her back down, and continues laughing without missing a pause. Using his dagger, Westley carves a route for them, causing the branches to shudder as they drop, all while singing. Westley lifts Buttercup up to carry her across some muddy puddle that is spanned by a narrow, flimsy wooden plank, and they have by now crossed the bog. As Buttercup, bewildered, is about to speak, the air gives way beneath her—it’s Quicksilver Sand—and she descends into it, whispering Westley’s name before vanishing. Spinning, Westley chops a C-shaped rope in half, clutches it, drops his dagger, and plunges into the quicksilver sand, grasping the other end of the rope, resulting in another puff of red smoke. Nothing can be seen now except the quicksilver sand, which is bright and perilous. A giant R.E.E.K. darts into view, sniffs around, and then vanishes. Westley, with lungs near collapsing, erupts out of the sand with Buttercup across his back, hauling them to the rim of the pit using the rope. Buttercup's face is smeared with red smoke—in her eyes, ears, hair, and mouth—yet she is still perhaps elegant, but you have to look incredibly hard to see it, as Westley continues to drag them to safety. The R.E.E.K., high above them, observes. Buttercup is positioned against a shrub while Westley brushes the quicksilver sand from her face. The R.E.E.K., now on a much lower branch, gazes down at Westley, who gazes back. As Buttercup's eyes flutter, he continues his task on her. There are now two R.E.E.K.s that have scaled a nearby bush, observing hungrily down. Westley lifts Buttercup up, wraps an arm around her, and starts to stroll with her as he cheerfully continues chatting."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Brody inspects where the sparks pop over Jasmine and nudges her aside to shelter as another massive gush of water abruptly erupts upward, while Jasmine is immobilized with bewilderment. He grabs her umbrella and delicately guides her onward as they trot leisurely through a particularly risky part of the Misty Jungle. Later, with the stars beaming down at a slightly altered angle, Brody hefts Jasmine as they mosey along, shifts her towards safety, places her back down, and carries on speaking without skipping a word. Using his cane, Brody carves a trail for them, prompting the brambles to sigh as they topple, all while murmuring. Brody lifts Jasmine to carry her across some murky water that is spanned by a thin, wobbly metal beam, and they have by now traversed the lagoon. As Jasmine, baffled, is about to respond, the surface caves in beneath her—it’s Quicksilver Sand—and she descends into it, shouting Brody’s name before vanishing. Twisting, Brody slices an L-shaped twig in half, seizes it, drops his cane, and plunges into the quicksilver sand, clutching the other end of the twig, creating another puff of golden mist. Nothing is visible now except the quicksilver sand, which is mesmerizing and perilous. A colossal A.O.U.S. darts into sight, sniffs the surroundings, and then vanishes. Brody, with lungs near imploding, bursts out of the sand with Jasmine atop his shoulders, dragging them to the brink of the pit using the twig. Jasmine's face is encrusted with golden mist—in her eyes, ears, hair, and mouth—yet she is still potentially striking, but you have to squint really hard to notice it, as Brody continues to drag them to security. The A.O.U.S., high above them, observes. Jasmine is set against a boulder while Brody cleans the quicksilver sand from her visage. The A.O.U.S., now on a much lower ledge, glares down at Brody, who glares back. As Jasmine's eyes flutter, he continues to attend to her. There are now two A.O.U.S.s that have clambered into a nearby shrub, gawking eagerly down. Brody picks Jasmine up, wraps an arm around her, and begins to stroll with her as he optimistically proceeds chatting."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Westley rescues Buttercup from sudden flames in the Fire Swamp, leading her safely through its dangers. He skillfully uses his sword to clear a path and carries Buttercup past obstacles, including swamp water. Suddenly, Buttercup falls into the lethal Lightning Sand, disappearing as she cries out for Westley. Acting quickly, Westley uses a vine to dive into the sand, and after a tense moment, resurfaces with Buttercup. Covered in white powder, Buttercup is still beautiful but needs cleaning. As Westley tends to her, R.O.U.S.s (Rodents of Unusual Size) watch from above. Westley continues to reassure and support Buttercup as they prepare to move forward, all while being observed by the creatures."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Westley picks Buttercup up puts an arm around her and starts to walk with her as he encouragingly continues talking There are now two ROUSs that have climbed into a nearby tree staring hungrily down As Buttercup's eyes flutter he continues to work on her The ROUS now on a much lower branch stares down at Westley who stares back Buttercup is placed against a tree while Westley cleans the lightning sand from her face The ROUS high above them watches Buttercup's face is caked with white powder—in her eyes ears hair and mouth—yet she is still probably beautiful but you have to look awfully hard to see it as Westley continues to pull them to safety Westley with lungs near bursting explodes out of the sand with Buttercup across his shoulders pulling them to the edge of the pit using the vine A giant ROUS darts into view sniffs around and then disappears Nothing can be seen now except the lightning sand which is lovely and lethal Whirling Westley slashes a Ushaped vine in half grabs it drops his sword and dives into the lightning sand clutching the other end of the vine resulting in another cloud of white powder As Buttercup perplexed is about to reply the ground gives way beneath her—it is Lightning Sand—and she sinks into it crying Westley’s name before disappearing Westley picks Buttercup up to carry her across some swamp water that is bridged by a narrow rickety tree branch and they have by now crossed the pond Using his sword Westley slices a path for them causing the vines to groan as they fall all while chatting Westley picks up Buttercup as they walk along moves her out of danger puts her back down and continues talking without missing a beat Later with the sun slanting down at a slightly different angle He takes her hand and gently leads her forward as they move slowly through a particularly dangerous part of the Fire Swamp Westley examines where the flames burst over Buttercup and pulls her aside to safety as another great spout of flame suddenly shoots up while Buttercup is frozen with fear"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Buttercup is placed against a tree while Westley cleans the lightning sand from her face The ROUS high above them watches Using his sword Westley slices a path for them causing the vines to groan as they fall all while chatting A giant ROUS darts into view sniffs around and then disappears Westley picks Buttercup up to carry her across some swamp water that is bridged by a narrow rickety tree branch and they have by now crossed the pond Whirling Westley slashes a Ushaped vine in half grabs it drops his sword and dives into the lightning sand clutching the other end of the vine resulting in another cloud of white powder There are now two ROUSs that have climbed into a nearby tree staring hungrily down As Buttercup perplexed is about to reply the ground gives way beneath her—it is Lightning Sand—and she sinks into it crying Westley’s name before disappearing Westley with lungs near bursting explodes out of the sand with Buttercup across his shoulders pulling them to the edge of the pit using the vine As Buttercup's eyes flutter he continues to work on her He takes her hand and gently leads her forward as they move slowly through a particularly dangerous part of the Fire Swamp Buttercup's face is caked with white powder—in her eyes ears hair and mouth—yet she is still probably beautiful but you have to look awfully hard to see it as Westley continues to pull them to safety Later with the sun slanting down at a slightly different angle The ROUS now on a much lower branch stares down at Westley who stares back Westley picks Buttercup up puts an arm around her and starts to walk with her as he encouragingly continues talking Nothing can be seen now except the lightning sand which is lovely and lethal Westley examines where the flames burst over Buttercup and pulls her aside to safety as another great spout of flame suddenly shoots up while Buttercup is frozen with fear Westley picks up Buttercup as they walk along moves her out of danger puts her back down and continues talking without missing a beat"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "A giant ROUS darts into view sniffs around and then disappears Westley with lungs near bursting explodes out of the sand with Buttercup across his shoulders pulling them to the edge of the pit using the vine Buttercup's face is caked with white powder—in her eyes ears hair and mouth—yet she is still probably beautiful but you have to look awfully hard to see it as Westley continues to pull them to safety The ROUS high above them watches Buttercup is placed against a tree while Westley cleans the lightning sand from her face The ROUS now on a much lower branch stares down at Westley who stares back As Buttercup's eyes flutter he continues to work on her There are now two ROUSs that have climbed into a nearby tree staring hungrily down Westley picks Buttercup up puts an arm around her and starts to walk with her as he encouragingly continues talking Westley examines where the flames burst over Buttercup and pulls her aside to safety as another great spout of flame suddenly shoots up while Buttercup is frozen with fear He takes her hand and gently leads her forward as they move slowly through a particularly dangerous part of the Fire Swamp Later with the sun slanting down at a slightly different angle Westley picks up Buttercup as they walk along moves her out of danger puts her back down and continues talking without missing a beat Using his sword Westley slices a path for them causing the vines to groan as they fall all while chatting Westley picks Buttercup up to carry her across some swamp water that is bridged by a narrow rickety tree branch and they have by now crossed the pond As Buttercup perplexed is about to reply the ground gives way beneath her—it is Lightning Sand—and she sinks into it crying Westley’s name before disappearing Whirling Westley slashes a Ushaped vine in half grabs it drops his sword and dives into the lightning sand clutching the other end of the vine resulting in another cloud of white powder Nothing can be seen now except the lightning sand which is lovely and lethal"
        }
      ]
    }
  ]
}