{
  "ground_truth": "Mary opens the door and looks in to see Cassidy drinking from a large tumbler; he winks at her without pausing in his drinking. She remains on the threshold for a moment, then crosses to the desk, talking as she goes. Mary then slams down on the brake, trying to pull herself together, as the Patrolman raps again, less gently. Reluctantly, she rolls down the window, and the Patrolman studies her for a moment. Mary pulls her handbag up from the floor, where she had placed it when she stretched out for sleep, and puts her hand in it, rummaging for her wallet but cannot find it. The Patrolman is staring at her, and she glances at him nervously, pokes in her bag a bit more, sighs, and realizes she'll have to remove some of its contents. Nervously, trying to control her fear, she takes out the money-filled envelope, then the important papers envelope, and a couple of other items, placing them on the seat, finally finding her wallet, opening it, and handing it to him. He looks at the wallet, then at the car, and walks around to the front of the car to check the license plate before returning. The Patrolman peers in, checks the car registration on the steering wheel, and returns Mary's wallet, and she takes it, looking at him for a flicker of a moment before starting ahead fast. As she drives, she glances into her rear-view mirror to see the Patrolman following in his automobile at a matched speed. She glances out at her surroundings and sees the freeway ahead before suddenly turning off the highway and checking her mirror to see that the Patrolman is no longer following and has not turned off after her. Breathing a sigh of relief, she thinks for a moment and makes a quick decision as she gets out of the car, glances toward the lot office, and turns her attention to the line of cars, noticing the California license plates on all of them. The car dealer calls out from his office, and Mary nods, starting to walk along the line of cars as if making a selection. Her eye is caught by the iron newspaper stand on the corner, just outside the lot, and she stares at the papers, turns away as if what she is fearing would have to be impossible, then, having to satisfy herself, goes to the stand, drops a dime in the iron slot, picks up a Los Angeles newspaper, and starts back into the car lot, glancing worriedly at the front page. As she goes, the same Patrolman is seen coming up the street toward the lot, and he sees Mary, slows, swerves over to the opposite side of the street, and stops by the curb. Mary, engrossed in the newspaper and walking back through the lot, does not see the Patrolman.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Mary unlatches the portal and glances in to observe Cassidy sipping from a sizable glass; he blinks at her without hesitating in his sipping. She stays on the verge for an instant, then strides to the bureau, speaking as she proceeds. Mary then slams down on the stopper, attempting to collect herself, as the Officer knocks again, less softly. Reluctantly, she lowers the pane, and the Officer examines her for an instant. Mary lifts her purse up from the ground, where she had set it when she stretched out for slumber, and puts her hand in it, searching for her billfold but cannot locate it. The Officer is gazing at her, and she glances at him apprehensively, digs in her bag a bit more, exhales, and realizes she'll have to extract some of its contents. Apprehensively, attempting to manage her dread, she removes the cash-filled packet, then the significant documents packet, and a pair of other objects, placing them on the seat, finally discovering her billfold, opening it, and handing it to him. He glances at the billfold, then at the vehicle, and ambles around to the fore of the vehicle to inspect the license plate before returning. The Officer peers in, checks the vehicle documentation on the steering wheel, and returns Mary's billfold, and she takes it, observing him for an instant of a moment before proceeding ahead rapidly. As she travels, she glances into her rear-view mirror to observe the Officer trailing in his automobile at a matched velocity. She glances out at her vicinity and sees the expressway ahead before abruptly turning off the roadway and examining her mirror to see that the Officer is no longer trailing and has not turned off after her. Breathing a sigh of relief, she ponders for a moment and makes a swift choice as she exits the vehicle, glances toward the lot office, and directs her focus to the line of automobiles, noticing the California license plates on all of them. The car merchant calls out from his office, and Mary nods, commencing to stroll along the line of automobiles as if making a choice. Her gaze is captured by the metal newsstand on the corner, just outside the lot, and she gazes at the papers, turns away as if what she is fearing would have to be unthinkable, then, needing to satisfy herself, proceeds to the stand, drops a ten-cent piece in the metal slot, picks up a Los Angeles newspaper, and starts back into the car lot, glancing anxiously at the front page. As she goes, the same Officer is seen coming up the street toward the lot, and he observes Mary, decelerates, swerves over to the opposing side of the street, and halts by the curb. Mary, absorbed in the newspaper and walking back through the lot, does not perceive the Officer."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The door is opened by Mary, and the room is looked into by her to see Cassidy drinking from a large tumbler; she is winked at by him without any pause in his drinking. On the threshold, she remains for a moment, then the desk is crossed to by her, talking as she goes. The brake is slammed down on by Mary, trying to pull herself together, while the Patrolman raps again, less gently. Reluctantly, the window is rolled down by her, and her is studied for a moment by the Patrolman. Her handbag is pulled up from the floor by Mary, where it had been placed when she stretched out for sleep, and her hand is put in it, rummaging for her wallet but the wallet cannot be found. Her is stared at by the Patrolman, and him is glanced at nervously by her, a bit more is poked in her bag, she sighs, and the realization that some of its contents will have to be removed comes to her. Nervously, trying to control her fear, the money-filled envelope is taken out by her, then the important papers envelope, and a couple of other items, placing them on the seat, finally the wallet is found, opened, and handed to him. The wallet is looked at by him, then the car is looked at, and the license plate is checked by him at the front of the car before returning. In peering, the car registration on the steering wheel is checked by the Patrolman, and Mary's wallet is returned to her, and it is taken by her, looking at him for a flicker of a moment before the car is started ahead fast. As driving, the rear-view mirror is glanced into by her to see the Patrolman following in his automobile at a matched speed. Out at her surroundings, she glances and sees the freeway ahead before a sudden turn off the highway and a check in her mirror shows her that the Patrolman is no longer following and has not turned off after her. A sigh of relief is breathed by her, she thinks for a moment and makes a quick decision as the car is gotten out of by her, glanced toward is the lot office by her, and to the line of cars, her attention is turned, noticing the California license plates on all of them. From his office, a call is made by the car dealer, and a nod is given by Mary, starting to walk along the line of cars as if a selection is being made. By the iron newspaper stand on the corner, her eye is caught, just outside the lot, and the papers are stared at by her, turned away as if what is feared by her would have to be impossible, then, having to satisfy herself, the stand is approached, a dime is dropped by her in the iron slot, a Los Angeles newspaper is picked up, and back into the car lot she starts, glancing worriedly at the front page. As she goes, the same Patrolman comes up the street toward the lot, sees Mary, slows, swerves over to the opposite side of the street, and stops by the curb. In the newspaper and walking back through the lot, Mary is engrossed, and the Patrolman is not seen by her."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Mary opens the door and sees Cassidy drinking from a large tumbler; he winks at her without stopping. She hesitates briefly, then heads to the desk, speaking as she moves. Mary then brakes hard, trying to compose herself as the Patrolman knocks again, more firmly. She reluctantly rolls down the window, and the Patrolman observes her. Mary retrieves her handbag from the floor where she had placed it for sleep, searching for her wallet but can't find it. The Patrolman watches her, and she nervously rummages deeper, realizing she'll need to remove some contents. She takes out a money-filled envelope, important papers, and other items, placing them on the seat, finally finding her wallet, and hands it to him. He examines the wallet, checks the car's license plate, and returns to peer inside, verifying the registration on the steering wheel before giving Mary's wallet back. She briefly looks at him and quickly drives off. While driving, she notices in her rear-view mirror that the Patrolman follows at the same speed. Seeing the freeway ahead, she suddenly turns off and checks the mirror, relieved to find he didn't follow. She breathes deeply, decides quickly, steps out of the car, glances at the lot office, and focuses on the row of cars, noting all have California plates. The car dealer calls from his office, and Mary nods while inspecting the cars. She notices a newspaper stand, stares at it, then approaches, drops a dime in, grabs a Los Angeles paper, and returns to the car lot, anxiously glancing at the front page. As she walks back, the same Patrolman approaches the lot, sees Mary, slows down, swerves to the opposite curb, and stops. Mary, engrossed in the newspaper and walking back, doesn't notice him."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Mary opens the door, seeing Cassidy drink from a large tumbler; he winks at her without stopping. She pauses, then moves to the desk, talking. Mary slams the brake, trying to compose herself as the Patrolman knocks again, less gently. Reluctantly, she rolls down the window. The Patrolman studies her, and she nervously searches for her wallet in her handbag, removing its contents: a money-filled envelope, important papers, and other items, before finding and handing him her wallet. He inspects the wallet and car, checks the license plate, then returns her wallet. She drives off, noticing in the mirror the Patrolman following. She turns off the highway, realizing he's no longer following, and sighs in relief. Making a quick decision, she exits the car, notices California plates, and heads to a car lot. A dealer calls out, and she nods, inspecting cars. Her eye catches a newspaper stand, and she grabs a Los Angeles newspaper, glancing fearfully at the front page. The same Patrolman appears, swerves across the street, stopping by the curb as Mary, engrossed, walks back through the lot, unaware."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Mary slowly and deliberately opens the door, casting a curious glance inside to find Cassidy already seated comfortably, sipping from an impressively large tumbler. Without missing a beat in his drinking, he shoots her a playful wink. She hesitates briefly on the threshold, then decisively crosses over to the desk, her voice filling the space as she talks while moving. Suddenly, Mary forcefully slams down on the brake, trying with all her might to compose herself, as the persistent Patrolman raps insistently, this time with less patience. With evident reluctance, she rolls down the window, feeling the Patrolman's scrutinizing gaze upon her. She reaches down to retrieve her handbag from the car floor—where she had placed it earlier when she stretched out to rest—and begins to rummage through it, searching for her wallet but failing to locate it. Feeling the Patrolman’s eyes fixed intently on her, she casts him a nervous glance, continues to dig through her bag, lets out a sigh, and realizes she needs to unload some items to find what she seeks. Fighting the rising tide of anxiety, she hesitantly extracts a money-filled envelope, followed by an envelope containing crucial documents, along with a couple of other personal items, setting them on the car seat. At last, she locates her wallet, opens it, and hands it over to the Patrolman. He takes a moment to examine the wallet, shifts his gaze toward the car, then walks purposefully around to the front to inspect the license plate, before making his way back. The Patrolman peers inside the vehicle, checks the car's registration attached to the steering wheel, and eventually returns Mary's wallet, which she takes promptly, casting a quick glance at him before decisively driving forward. As she accelerates, she glances into her rear-view mirror to notice the Patrolman trailing behind in his vehicle, matching her speed precisely. Her eyes flick to her surroundings, observing the stretch of freeway ahead, before she makes a sudden decision to veer off the highway, taking a quick look in her mirror to confirm that the Patrolman is no longer in pursuit and has not followed her off the road. Letting out a relieved sigh, she takes a moment to gather her thoughts and swiftly makes a decision to exit the car. She glances toward the lot office, shifting her focus to the lineup of cars, spotting the California license plates adorning each one of them. The car dealer's voice calls out from his office, prompting Mary to nod in acknowledgment as she begins to stroll along the line of vehicles, appearing to deliberate on a selection. Her attention is momentarily seized by an iron newspaper stand positioned at the corner, just outside the lot, and she stares at the newspapers, turning away with a sense of foreboding, as if what she dreads could not be true. Still, needing reassurance, she approaches the stand, drops a dime into the iron slot, retrieves a Los Angeles newspaper, and makes her way back into the car lot, casting anxious glances at the front page. As she moves, the very same Patrolman appears, coming up the street toward the lot. He notices Mary, reduces his speed, swerves slightly to the opposite side of the street, and comes to a stop by the curb. Oblivious, Mary, deeply absorbed in the newspaper and making her way back through the lot, does not see the Patrolman at all."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Mary, taking her time and moving with a deliberate slowness, carefully opens the door and casts a curious glance inside. She observes Cassidy, who is already seated comfortably, enjoying a drink from an impressively large tumbler. Without even pausing in his drinking, he shoots her a playful wink. Mary's hesitation is brief as she stands on the threshold, but she then decisively crosses over to the desk. Her voice, full of determination, fills the space as she continues talking while in motion.\n\nSuddenly, Mary's demeanor shifts as she forcefully slams down on the brake, trying as hard as she can to compose herself. Her efforts are in response to the persistent knocking from the Patrolman, who now raps insistently with noticeably less patience than before. With evident reluctance, she rolls down the window, acutely aware of the Patrolman's scrutinizing gaze upon her. She reaches downward to retrieve her handbag from the car floor—its place since she earlier stretched out to rest—and begins rummaging through it, searching in vain for her wallet. Feeling the intensity of the Patrolman's eyes fixed on her, she casts a nervous glance in his direction, continues the search in her bag, lets out a deep sigh, and realizes she must unload some items to find what she seeks.\n\nAs anxiety begins to rise within her, she hesitantly extracts a money-filled envelope, following it with an envelope that holds crucial documents, and a couple of other personal items, setting them all on the car seat. Finally, after some effort, she locates her wallet. With a sense of relief, she opens it and hands it over to the Patrolman. He takes his time to examine the wallet carefully, shifts his gaze toward the car, then walks purposefully around to the front of the vehicle to inspect the license plate, before making his way back. The Patrolman peers inside the car once more, checks the car registration attached to the steering wheel, and eventually returns Mary's wallet to her. She promptly takes it, casting a quick, relieved glance at him before decisively driving forward.\n\nAs she accelerates, her eyes flick to the rear-view mirror, noticing the Patrolman trailing behind in his vehicle, perfectly matching her speed. Her attention shifts to the stretch of freeway ahead, and she quickly makes the sudden decision to veer off the highway. A quick look in the mirror reassures her that the Patrolman is no longer in pursuit and has not followed her off the road. Letting out a sigh of relief, she takes a moment to gather her thoughts and swiftly decides to exit the car. Her glance shifts toward the lot office, focusing on the line of cars and spotting the California license plates adorning each one. The car dealer's voice calls out from his office, prompting Mary to nod in acknowledgment as she begins to stroll along the line of vehicles, appearing to contemplate her selection.\n\nHer attention is momentarily seized by the sight of an iron newspaper stand positioned at the corner, just outside the lot. She stares at the newspapers, feeling a sense of foreboding, as if what she dreads might be confirmed. Still needing reassurance, she approaches the stand, drops a dime into the iron slot, retrieves a Los Angeles newspaper, and makes her way back into the car lot, casting anxious glances at the front page.\n\nAs she moves with the newspaper, the same Patrolman appears, coming up the street toward the lot. Noticing Mary, he reduces his speed, swerves slightly to the opposite side of the street, and comes to a stop by the curb. Lost in her focus, Mary, deeply absorbed in the newspaper as she makes her way back through the lot, does not see the Patrolman at all."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Mary carefully turns the door handle and gently pushes the door open, peering inside to catch sight of Cassidy who is leisurely sipping from a large tumbler. Cassidy notices her presence and acknowledges her with a playful wink, all the while not pausing from his drinking. Mary stands still for a fraction of a second on the threshold, taking in the scene before she decisively steps into the room, heading toward the desk and engaging in conversation as she continues her approach. Later, sitting in her car, Mary abruptly slams her foot onto the brake pedal, trying to gather her thoughts and calm herself when she's startled by the Patrolman knocking more insistently on her window. With hesitance, she reaches for the window crank and rolls it down, allowing the Patrolman to scrutinize her intently for a brief moment. Trying to maintain composure, Mary bends down to retrieve her handbag from the car floor where she'd left it when she attempted to rest. She places her hand inside the bag and begins to rummage through its contents in search of her wallet, but her fingers fail to locate it. Feeling the Patrolman's eyes on her, she glances up at him nervously, then resumes her search with increased urgency. Realizing she'd have to clear some space, she hesitantly begins to remove items from the bag, starting with a money-filled envelope, followed by an envelope of important papers, and a couple of other small items, placing each carefully on the seat beside her. Finally, her hand closes around the elusive wallet, which she promptly opens and extends toward the Patrolman. He takes a moment to examine the wallet before shifting his gaze to the exterior of her car, choosing to walk around to check the license plate at the front. Satisfied, he returns to the open window where he inspects the car's registration affixed to the steering wheel, then hands the wallet back to Mary. She accepts it, meeting his gaze briefly, her eyes lingering for just a moment before she refocuses on the road and drives forward with increased speed. As she continues, her eyes flicker to the rear-view mirror, revealing the Patrolman tailing her in his vehicle at an identical pace. Her attention shifts back and forth between the road ahead and the imposing figure following her, as she spots the freeway looming in the distance. In a split-second decision, she veers off the highway, her eyes darting to the mirror to confirm that the Patrolman has not followed her onto the new path. Feeling waves of relief wash over her, she contemplates her next move, swiftly deciding to exit her car. She surveys her surroundings, briefly casting a glance toward the lot office, then redirects her focus to the lineup of cars, noting their California license plates. The car dealer calls out from his office, and Mary acknowledges him with a nod, beginning to meander along the row of cars as though she is browsing for a purchase. Her gaze is momentarily captured by an iron newspaper stand at the corner, just at the periphery of the lot. She stares at the newspapers, her mind racing with concern over what she might discover, and then, driven by the need to quell her anxiety, she approaches the stand, deposits a dime into the iron slot, and extracts a Los Angeles newspaper. Clutching the paper, she navigates back into the car lot, her eyes scanning the front page with worry etched on her face. As she continues, the same Patrolman appears up the street, steering his vehicle toward the lot. His pace slows as he maneuvers across the street to the opposite curb, coming to a halt. Meanwhile, Mary, deeply absorbed in the newspaper and making her way through the lot, remains oblivious to the Patrolman's presence."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Mary enters the room and notices Cassidy drinking from a large tumbler; he winks at her as she crosses to the desk while talking. Meanwhile, a Patrolman knocks less gently on her car window, prompting Mary to reluctantly roll it down as he studies her. She retrieves her handbag from the floor, rummages through it in search of her wallet, and nervously removes various items before finding and handing over the wallet to the Patrolman. He examines it, checks the car's license plate, and reviews the registration before returning the wallet, allowing Mary to drive away quickly. In her rear-view mirror, she notices the Patrolman following her at the same speed but turns off the highway to ensure he is no longer following her. Relieved, Mary stops, gets out of the car, and heads toward a car lot, observing the California license plates on the vehicles. The car dealer calls out, and Mary acknowledges him as she walks along the line of cars. She is drawn to a newspaper stand outside the lot, retrieves a Los Angeles newspaper with a dime, and returns to the lot, scanning the front page with concern. Unaware, Mary is engrossed in the newspaper and doesn't notice the same Patrolman approaching from the street, stopping across from the lot."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Mary opens the door of the dimly lit office and looks in to see Cassidy, a well-known local figure with a penchant for strong drinks, drinking from a large tumbler filled with his customary whiskey; he winks at her without pausing in his drinking. The room, filled with the scent of old leather and tobacco, invites her to stay a moment. She remains on the threshold for a moment, then crosses to the desk, talking as she goes about their mutual friends and recent events in town. Later, Mary, now on a quiet highway infamous for its speed traps, slams down on the brake, trying to pull herself together, as the Patrolman, a no-nonsense officer known for his strict enforcement of traffic laws, raps again, less gently. Reluctantly, she rolls down the window, and the Patrolman studies her for a moment with the practiced eyes of someone who has seen a lot on this stretch of road. Mary pulls her designer handbag up from the floor, where she had placed it when she stretched out for a nap earlier, and puts her hand in it, rummaging for her wallet but cannot find it. The Patrolman is staring at her, and she glances at him nervously, pokes in her bag a bit more, sighs, and realizes she'll have to remove some of its contents. Nervously, trying to control her fear, she takes out the money-filled envelope she's been safeguarding for a business deal, then the envelope containing important legal papers regarding her recent house sale, and a couple of other items, placing them on the seat, finally finding her wallet, opening it, and handing it to him. He looks at the wallet, then at the car, and walks around to the front of the car to check the license plate, noting the out-of-state registration, before returning. The Patrolman peers in, checks the car registration on the steering wheel, and returns Mary's wallet, and she takes it, casting a brief, searching look at him for a flicker of a moment before starting ahead fast, heading towards the bustling city she aims to reach by nightfall. As she drives, she glances into her rear-view mirror to see the Patrolman following in his patrol car at a matched speed, creating a tense feeling of being watched. She glances out at the sprawling landscape and sees the freeway ahead, a major artery leading into the city, before suddenly turning off the highway, taking a back road known to locals but often overlooked by outsiders, and checking her mirror to see that the Patrolman is no longer following and has not turned off after her. Breathing a sigh of relief, she thinks for a moment and makes a quick decision as she gets out of the car, glances toward the lot office managed by a friendly acquaintance, and turns her attention to the line of cars, noticing the California license plates on all of them, indicative of their origin from a recent cross-country auction. The car dealer, a jovial man with years of experience, calls out from his office, and Mary nods, starting to walk along the line of cars as if making a selection. Her eye is caught by the iron newspaper stand on the corner, where local and national headlines scream for attention, just outside the lot, and she stares at the papers, turns away as if what she is fearing would have to be impossible, then, having to satisfy herself, goes to the stand, drops a dime in the iron slot, picks up a Los Angeles newspaper known for its thorough coverage of regional crime, and starts back into the car lot, glancing worriedly at the front page. As she goes, the same Patrolman is seen coming up the street toward the lot, and he sees Mary, slows, swerves over to the opposite side of the street, and stops by the curb. Mary, engrossed in the newspaper and walking back through the lot, does not see the Patrolman."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "The car dealer calls out from his office and Mary nods starting to walk along the line of cars as if making a selection Mary opens the door and looks in to see Cassidy drinking from a large tumbler She remains on the threshold for a moment then crosses to the desk talking as she goes Mary engrossed in the newspaper and walking back through the lot does not see the Patrolman he winks at her without pausing in his drinking Mary then slams down on the brake trying to pull herself together as the Patrolman raps again less gently She glances out at her surroundings and sees the freeway ahead before suddenly turning off the highway and checking her mirror to see that the Patrolman is no longer following and has not turned off after her he winks at her without pausing in his drinking She remains on the threshold for a moment then crosses to the desk talking as she goes Mary then slams down on the brake trying to pull herself together as the Patrolman raps again less gently Reluctantly she rolls down the window and the Patrolman studies her for a moment Mary pulls her handbag up from the floor where she had placed it when she stretched out for sleep and puts her hand in it rummaging for her wallet but cannot find it The Patrolman is staring at her and she glances at him nervously pokes in her bag a bit more sighs and realizes she will have to remove some of its contents Nervously trying to control her fear she takes out the moneyfilled envelope then the important papers envelope and a couple of other items placing them on the seat finally finding her wallet opening it and handing it to him He looks at the wallet then at the car and walks around to the front of the car to check the license plate before returning The Patrolman peers in checks the car registration on the steering wheel and returns Mary's wallet and she takes it looking at him for a flicker of a moment before starting ahead fast Her eye is caught by the iron newspaper stand on the corner just outside the lot and she stares at the papers turns away as if what she is fearing would have to be impossible then having to satisfy herself goes to the stand drops a dime in the iron slot picks up a Los Angeles newspaper and starts back into the car lot glancing worriedly at the front page As she drives she glances into her rearview mirror to see the Patrolman following in his automobile at a matched speed She glances out at her surroundings and sees the freeway ahead before suddenly turning off the highway and checking her mirror to see that the Patrolman is no longer following and has not turned off after her He looks at the wallet then at the car and walks around to the front of the car to check the license plate before returning Breathing a sigh of relief she thinks for a moment and makes a quick decision as she gets out of the car glances toward the lot office and turns her attention to the line of cars noticing the California license plates on all of them The car dealer calls out from his office and Mary nods starting to walk along the line of cars as if making a selection Her eye is caught by the iron newspaper stand on the corner just outside the lot and she stares at the papers turns away as if what she is fearing would have to be impossible then having to satisfy herself goes to the stand drops a dime in the iron slot picks up a Los Angeles newspaper and starts back into the car lot glancing worriedly at the front page As she goes the same Patrolman is seen coming up the street toward the lot and he sees Mary slows swerves over to the opposite side of the street and stops by the curb Mary opens the door and looks in to see Cassidy drinking from a large tumbler Mary engrossed in the newspaper and walking back through the lot does not see the Patrolman"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Mary opens the door and looks in to see Cassidy drinking from a large tumbler. he winks at her without pausing in his drinking. She remains on the threshold for a moment then crosses to the desk talking as she goes. Mary then slams down on the brake trying to pull herself together as the Patrolman raps again less gently. Reluctantly she rolls down the window and the Patrolman studies her for a moment. Mary pulls her handbag up from the floor where she had placed it when she stretched out for sleep and puts her hand in it rummaging for her wallet but cannot find it. The Patrolman is staring at her and she glances at him nervously pokes in her bag a bit more sighs and realizes she will have to remove some of its contents. Nervously trying to control her fear she takes out the moneyfilled envelope then the important papers envelope and a couple of other items placing them on the seat finally finding her wallet opening it and handing it to him. He looks at the wallet then at the car and walks around to the front of the car to check the license plate before returning. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. The Patrolman peers in checks the car registration on the steering wheel and returns Mary's wallet and she takes it looking at him for a flicker of a moment before starting ahead fast. As she drives she glances into her rearview mirror to see the Patrolman following in his automobile at a matched speed. She glances out at her surroundings and sees the freeway ahead before suddenly turning off the highway and checking her mirror to see that the Patrolman is no longer following and has not turned off after her. Breathing a sigh of relief she thinks for a moment and makes a quick decision. as she gets out of the car glances toward the lot office and turns her attention to the line of cars noticing the California license plates on all of them. The car dealer calls out from his office and Mary nods starting to walk along the line of cars as if making a selection. Her eye is caught by the iron newspaper stand on the corner just outside the lot and she stares at the papers turns away as if what she is fearing would have to be impossible then having to satisfy herself goes to the stand drops a dime in the iron slot picks up a Los Angeles newspaper and starts back into the car lot glancing worriedly at the front page. As she goes the same Patrolman is seen coming up the street toward the lot and he sees Mary slows swerves over to the opposite side of the street and stops by the curb. Mary engrossed in the newspaper and walking back through the lot does not see the Patrolman."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Mary opens the door and looks in to see Cassidy drinking from a large tumbler. he winks at her without pausing in his drinking. She remains on the threshold for a moment then crosses to the desk talking as she goes. Mary then slams down on the brake trying to pull herself together as the Patrolman raps again less gently. Reluctantly she rolls down the window and the Patrolman studies her for a moment. Mary pulls her handbag up from the floor where she had placed it when she stretched out for sleep and puts her hand in it rummaging for her wallet but cannot find it. The Patrolman is staring at her and she glances at him nervously pokes in her bag a bit more sighs and realizes she will have to remove some of its contents. Nervously trying to control her fear she takes out the moneyfilled envelope then the important papers envelope and a couple of other items placing them on the seat finally finding her wallet opening it and handing it to him. He looks at the wallet then at the car and walks around to the front of the car to check the license plate before returning. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. The Patrolman peers in checks the car registration on the steering wheel and returns Mary's wallet and she takes it looking at him for a flicker of a moment before starting ahead fast. As she drives she glances into her rearview mirror to see the Patrolman following in his automobile at a matched speed. She glances out at her surroundings and sees the freeway ahead before suddenly turning off the highway and checking her mirror to see that the Patrolman is no longer following and has not turned off after her. Breathing a sigh of relief she thinks for a moment and makes a quick decision. as she gets out of the car glances toward the lot office and turns her attention to the line of cars noticing the California license plates on all of them. The car dealer calls out from his office and Mary nods starting to walk along the line of cars as if making a selection. Her eye is caught by the iron newspaper stand on the corner just outside the lot and she stares at the papers turns away as if what she is fearing would have to be impossible then having to satisfy herself goes to the stand drops a dime in the iron slot picks up a Los Angeles newspaper and starts back into the car lot glancing worriedly at the front page. As she goes the same Patrolman is seen coming up the street toward the lot and he sees Mary slows swerves over to the opposite side of the street and stops by the curb. Mary engrossed in the newspaper and walking back through the lot does not see the Patrolman."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Mary opens the door and looks in to see Cassidy drinking from a large tumbler. he winks at her without pausing in his drinking. She remains on the threshold for a moment then crosses to the desk talking as she goes. Mary then slams down on the brake trying to pull herself together as the Patrolman raps again less gently. Reluctantly she rolls down the window and the Patrolman studies her for a moment. The car dealer calls out from his office and Mary nods starting to walk along the line of cars as if making a selection. Her eye is caught by the iron newspaper stand on the corner just outside the lot and she stares at the papers turns away as if what she is fearing would have to be impossible then having to satisfy herself goes to the stand drops a dime in the iron slot picks up a Los Angeles newspaper and starts back into the car lot glancing worriedly at the front page. As she goes the same Patrolman is seen coming up the street toward the lot and he sees Mary slows swerves over to the opposite side of the street and stops by the curb. Mary engrossed in the newspaper and walking back through the lot does not see the Patrolman."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Mary opens the door and looks in to see Cassidy drinking from a large tumbler. he winks at her without pausing in his drinking. As she goes the same Patrolman is seen coming up the street toward the lot and he sees Mary slows swerves over to the opposite side of the street and stops by the curb. Mary engrossed in the newspaper and walking back through the lot does not see the Patrolman."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "John opens the door and looks in to see a squirrel drinking from a large tumbler; it winks at him without pausing in its drinking. He remains on the threshold for a moment, then crosses to the desk, talking as he goes. John then slams down on the brake, trying to pull himself together, as the librarian raps again, less gently. Reluctantly, he rolls down the window, and the librarian studies him for a moment. John pulls his handbag up from the floor, where he had placed it when he stretched out for sleep, and puts his hand in it, rummaging for his wallet but cannot find it. The librarian is staring at him, and he glances at her nervously, pokes in his bag a bit more, sighs, and realizes he'll have to remove some of its contents. Nervously, trying to control his fear, he takes out the money-filled envelope, then the important papers envelope, and a couple of other items, placing them on the seat, finally finding his wallet, opening it, and handing it to her. She looks at the wallet, then at the car, and walks around to the front of the car to check the license plate before returning. The librarian peers in, checks the car registration on the steering wheel, and returns John's wallet, and he takes it, looking at her for a flicker of a moment before starting ahead fast. As he drives, he glances into his rear-view mirror to see the librarian following in her vehicle at a matched speed. He glances out at his surroundings and sees the freeway ahead before suddenly turning off the highway and checking his mirror to see that the librarian is no longer following and has not turned off after him. Breathing a sigh of relief, he thinks for a moment and makes a quick decision as he gets out of the car, glances toward the lot office, and turns his attention to the line of cars, noticing the California license plates on all of them. The gardener calls out from his office, and John nods, starting to walk along the line of cars as if making a selection. His eye is caught by the iron newspaper stand on the corner, just outside the lot, and he stares at the papers, turns away as if what he is fearing would have to be impossible, then, having to satisfy himself, goes to the stand, drops a dime in the iron slot, picks up a Los Angeles newspaper, and starts back into the car lot, glancing worriedly at the front page. As he goes, the same librarian is seen coming up the street toward the lot, and she sees John, slows, swerves over to the opposite side of the street, and stops by the curb. John, engrossed in the newspaper and walking back through the lot, does not see the librarian."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Mary opens the gate and looks in to see Cassidy drinking from a large vase; he winks at her without pausing in his drinking. She remains on the threshold for a moment, then crosses to the counter, talking as she goes. Mary then slams down on the accelerator, trying to pull herself together, as the Ranger raps again, less gently. Reluctantly, she rolls down the sail, and the Ranger studies her for a moment. Mary pulls her backpack up from the floor, where she had placed it when she stretched out for sleep, and puts her hand in it, rummaging for her ticket but cannot find it. The Ranger is staring at her, and she glances at him nervously, pokes in her bag a bit more, sighs, and realizes she'll have to remove some of its contents. Nervously, trying to control her fear, she takes out the coin-filled envelope, then the vital documents envelope, and a couple of other items, placing them on the bench, finally finding her ticket, opening it, and handing it to him. He looks at the ticket, then at the van, and walks around to the front of the van to check the ID badge before returning. The Ranger peers in, checks the van registration on the joystick, and returns Mary's ticket, and she takes it, looking at him for a flicker of a moment before starting ahead fast. As she drives, she glances into her rear-view mirror to see the Ranger following in his truck at a matched speed. She glances out at her surroundings and sees the boulevard ahead before suddenly turning off the street and checking her mirror to see that the Ranger is no longer following and has not turned off after her. Breathing a sigh of relief, she thinks for a moment and makes a quick decision as she gets out of the van, glances toward the shed office, and turns her attention to the line of bicycles, noticing the Texas license plates on all of them. The bike dealer calls out from his office, and Mary nods, starting to walk along the line of bicycles as if making a selection. Her eye is caught by the wooden magazine stand on the corner, just outside the shed, and she stares at the magazines, turns away as if what she is fearing would have to be impossible, then, having to satisfy herself, goes to the stand, drops a nickel in the wooden slot, picks up a San Francisco magazine, and starts back into the bike shed, glancing worriedly at the cover. As she goes, the same Ranger is seen coming up the road toward the shed, and he sees Mary, slows, swerves over to the opposite side of the road, and stops by the sidewalk. Mary, engrossed in the magazine and walking back through the shed, does not see the Ranger."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Mary closes the door and listens in to hear Cassidy singing from a large television; he waves at her without pausing in his singing. She lingers on the threshold for a moment, then skips to the desk, whispering as she goes. Mary then accelerates on the brake, trying to calm herself down, as the Patrolman taps again, less gently. Reluctantly, she slides down the window, and the Patrolman observes her for a moment. Mary lifts her handbag up from the floor, where she had dropped it when she curled up for sleep, and puts her hand in it, searching for her wallet but cannot uncover it. The Patrolman is scrutinizing her, and she peeks at him nervously, digs in her bag a bit more, huffs, and realizes she'll have to display some of its contents. Nervously, trying to suppress her fear, she pulls out the coin-filled envelope, then the significant papers envelope, and a couple of other objects, placing them on the seat, finally locating her wallet, unveiling it, and handing it to him. He examines the wallet, then at the car, and strolls around to the front of the car to inspect the license plate before returning. The Patrolman peers in, inspects the car registration on the steering wheel, and returns Mary's wallet, and she grabs it, glancing at him for a flicker of a moment before racing ahead fast. As she drives, she peeks into her rear-view mirror to see the Patrolman tagging along in his automobile at a similar speed. She glances out at her surroundings and sees the freeway ahead before abruptly veering off the highway and verifying her mirror to see that the Patrolman is no longer trailing and has not veered off after her. Breathing a sigh of relief, she ponders for a moment and makes a spontaneous decision as she leaps out of the car, glances toward the lot office, and diverts her attention to the line of cars, observing the California license plates on all of them. The car dealer shouts from his office, and Mary waves, beginning to jog along the line of cars as if making a decision. Her eye is caught by the iron newspaper stand on the corner, just outside the lot, and she gazes at the papers, turns away as if what she is dreading would have to be unlikely, then, needing to confirm for herself, goes to the stand, inserts a dime in the iron slot, snatches a Los Angeles newspaper, and strides back into the car lot, glancing anxiously at the front page. As she goes, the same Patrolman is seen driving up the street toward the lot, and he notices Mary, slows, veers over to the opposite side of the street, and halts by the curb. Mary, absorbed in the newspaper and strolling back through the lot, does not notice the Patrolman."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "The giraffe opens the portal and glances in to see the drum sipping from a grand vessel; it winks at the giraffe without pausing in its sipping. The giraffe remains on the threshold for a moment, then crosses to the piano, chatting as it goes. The giraffe then slams down on the trampoline, trying to pull itself together, as the penguin raps again, less gently. Reluctantly, it rolls down the curtain, and the penguin studies it for a moment. The giraffe pulls its umbrella up from the sand, where it had placed it when it stretched out to nap, and puts its paw in it, rummaging for its compass but cannot find it. The penguin is staring at it, and it glances at him nervously, pokes in its umbrella a bit more, sighs, and realizes it'll have to remove some of its contents. Nervously, trying to control its fear, it takes out the treasure-filled box, then the secret map envelope, and a couple of other items, placing them on the hammock, finally finding its compass, opening it, and handing it to him. He looks at the compass, then at the spaceship, and walks around to the front of the spaceship to check the signpost before returning. The penguin peers in, checks the spaceship registration on the steering wheel, and returns the giraffe's compass, and it takes it, looking at him for a flicker of a moment before starting ahead fast. As it flies, it glances into its side-view mirror to see the penguin following in his canoe at a matched speed. It glances out at its surroundings and sees the jungle ahead before suddenly turning off the riverbank and checking its mirror to see that the penguin is no longer following and has not turned off after it. Breathing a sigh of relief, it thinks for a moment and makes a quick decision as it gets out of the spaceship, glances toward the lighthouse, and turns its attention to the line of pineapples, noticing the tropical stickers on all of them. The gardener calls out from his hut, and the giraffe nods, starting to walk along the line of pineapples as if making a selection. Its eye is caught by the silver telescope on the ridge, just outside the grove, and it stares at the lenses, turns away as if what it is fearing would have to be impossible, then, having to satisfy itself, goes to the telescope, drops a pebble in the silver slot, picks up a New York telescope, and starts back into the grove, glancing worriedly at the lens. As it goes, the same penguin is seen coming up the river toward the grove, and he sees the giraffe, slows, swerves over to the opposite side of the water, and stops by the shore. The giraffe, engrossed in the telescope and striding back through the grove, does not see the penguin."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Sam pushes the curtain aside and peers in to see Jordan playing with a large jigsaw puzzle; he nods at her without hesitating in his playing. She stays on the doorstep for a moment, then strides to the dining table, chatting as she goes. Sam then hits the gas pedal, trying to calm herself down, as the Doorman taps again, less patiently. Hesitantly, she slides down the visor, and the Doorman examines her for a moment. Sam lifts her satchel up from the bench, where she had placed it when she leaned back for rest, and puts her hand in it, searching for her lipstick but cannot find it. The Doorman is gazing at her, and she glances at him cautiously, digs in her bag a bit further, groans, and realizes she'll have to rearrange some of its contents. Anxiously, trying to manage her anxiety, she pulls out the stamp-filled booklet, then the confidential notes folder, and a few other objects, placing them on the dashboard, finally uncovering her lipstick, revealing it, and showing it to him. He glances at the lipstick, then at the vehicle, and ambles around to the hood of the car to inspect the bumper sticker before returning. The Doorman peers in, examines the insurance card on the dashboard, and returns Sam's lipstick, and she takes it, looking at him for a brief second before moving forward quickly. As she drives, she peeks into her side-view mirror to see the Doorman trailing in his motorbike at a comparable pace. She looks out at her surroundings and sees the off-ramp ahead before abruptly exiting the highway and checking her mirror to see that the Doorman is no longer trailing and has not exited after her. Exhaling a breath of relief, she ponders for a moment and makes a swift choice as she steps out of the vehicle, glances toward the repair shop, and shifts her gaze to the row of bikes, noticing the Florida license plates on all of them. The mechanic yells out from his shop, and Sam acknowledges, beginning to stroll along the row of bikes as if picking one. Her attention is caught by the wooden bench at the intersection, just outside the lot, and she glances at the seats, turns away as if what she is dreading would have to be unrealistic, then, needing to reassure herself, marches to the bench, slips a quarter in the wooden slot, snatches a Miami leaflet, and starts back into the bike display, glancing uneasily at the cover page. As she proceeds, the same Doorman is seen approaching up the avenue toward the display, and he notices Sam, decelerates, veers over to the far side of the avenue, and halts by the sidewalk. Sam, absorbed with the leaflet and walking back through the display, does not notice the Doorman."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Mary closes the gate and peers in to see Cassidy sipping from a small goblet; he nods at her without pausing in his sipping. She lingers at the entrance for a moment, then strides to the chair, chatting as she goes. Mary then stomps on the pedal, trying to gather her thoughts, as the Patrolman taps again, more insistently. Hesitantly, she lowers the blinds, and the Patrolman examines her for a moment. Mary lifts her backpack up from the ground, where she had placed it when she sprawled out for rest, and puts her hand in it, searching for her keys but cannot locate them. The Patrolman is observing her, and she glances at him apprehensively, fumbles in her bag a bit more, exhales, and realizes she'll have to rearrange some of its contents. Anxiously, trying to master her anxiety, she extracts the document-filled pouch, then the essential receipts envelope, and a couple of other gadgets, placing them on the bench, finally finding her keys, unlocking it, and showing it to him. He glances at the keys, then at the bicycle, and strolls around to the front wheel to check the emblem before returning. The Patrolman peers in, verifies the bicycle registration on the handlebars, and returns Mary's keys, and she takes them, glancing at him for a brief instant before speeding off rapidly. As she pedals, she glances into her side-view mirror to see the Patrolman trailing in his automobile at a synchronized pace. She looks out at her surroundings and sees the parkway ahead before suddenly veering off the path and checking her mirror to see that the Patrolman is no longer trailing and has not veered off after her. Breathing a sigh of relief, she muses for a moment and makes a hasty decision as she dismounts the bicycle, glances toward the shack office, and turns her attention to the row of bicycles, noticing the Nevada emblems on all of them. The vendor calls out from his office, and Mary nods, commencing to stroll along the row of bicycles as if making a choice. Her attention is caught by the wooden magazine rack on the corner, just outside the shack, and she stares at the magazines, turns away as if what she is dreading would have to be inconceivable, then, needing to reassure herself, goes to the rack, drops a penny in the wooden slot, picks up a San Francisco magazine, and starts back into the bicycle shack, glancing anxiously at the cover page. As she goes, the same Patrolman is seen coming up the avenue toward the shack, and he notices Mary, slows, veers over to the opposite side of the avenue, and halts by the verge. Mary, absorbed in the magazine and strolling back through the shack, does not notice the Patrolman."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Jake unlocks the gate and peers in to see Taylor munching on a small sandwich; she nods at him without pausing in her munching. He lingers in the doorway for a moment, then strides to the couch, chatting as he goes. Jake then stomps hard on the gas, trying to steady himself, as the Salesman taps again, more firmly. Hesitantly, he lowers the curtain, and the Salesman examines him for a moment. Jake pulls his backpack up from the shelf, where he had set it when he leaned back for a nap, and puts his elbow in it, fishing for his keys but cannot spot it. The Salesman is glaring at him, and he peeks at her anxiously, digs in his pack a bit more, groans, and realizes he'll have to shuffle some of its contents. Anxiously, trying to mask his dread, he pulls out the note-filled pouch, then the crucial documents pouch, and a couple of other trinkets, dropping them on the chair, finally uncovering his keys, flipping it, and showing it to her. She peers at the keys, then at the van, and strides around to the back of the van to inspect the bumper before returning. The Salesman peers in, checks the van brochure on the dashboard, and returns Jake's keys, and he clutches it, looking at her for a flicker of a moment before bolting forward hastily. As he speeds, he glances into his side-view mirror to see the Salesman trailing in her motorcycle at a matched pace. He peeks out at his surroundings and spots the avenue ahead before abruptly veering off the road and checking his mirror to see that the Salesman is no longer trailing and has not veered off after him. Breathing a sigh of relief, he ponders for a moment and makes a swift choice as he steps out of the van, glances toward the café office, and shifts his gaze to the row of vans, observing the Nevada decals on all of them. The mechanic shouts out from his office, and Jake nods, beginning to stroll along the row of vans as if making a selection. His gaze is drawn by the bronze mailbox stand on the corner, just outside the lot, and he glares at the letters, turns aside as if what he is dreading would have to be unrealistic, then, needing to reassure himself, goes to the stand, flips a quarter in the bronze slot, lifts a San Francisco magazine, and heads back into the van lot, peering nervously at the front cover. As he proceeds, the same Salesman is spotted cruising up the road toward the lot, and she spots Jake, decelerates, veers over to the far side of the road, and halts by the railing. Jake, absorbed in the magazine and wandering back through the lot, does not spot the Salesman."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Mary enters a room to find Cassidy drinking and winking at her. She hesitates, then approaches him, speaking. Later, she is stopped by a Patrolman, who knocks on her car window. Nervously, Mary searches her handbag for her wallet, removing various items before finding it and handing it over. The Patrolman checks her car's details and returns the wallet. Mary drives off, noticing the Patrolman following her. She quickly turns off the highway and, relieved, sees he’s no longer behind her. Mary stops at a car lot, noticing California plates, and browses the cars. Distracted by a newspaper stand, she buys a Los Angeles paper, concerned about its contents. The same Patrolman approaches as she walks back, but Mary, focused on the newspaper, doesn’t notice him."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Mary engrossed in the newspaper and walking back through the lot does not see the Patrolman As she goes the same Patrolman is seen coming up the street toward the lot and he sees Mary slows swerves over to the opposite side of the street and stops by the curb Her eye is caught by the iron newspaper stand on the corner just outside the lot and she stares at the papers turns away as if what she is fearing would have to be impossible then having to satisfy herself goes to the stand drops a dime in the iron slot picks up a Los Angeles newspaper and starts back into the car lot glancing worriedly at the front page The car dealer calls out from his office and Mary nods starting to walk along the line of cars as if making a selection as she gets out of the car glances toward the lot office and turns her attention to the line of cars noticing the California license plates on all of them Breathing a sigh of relief she thinks for a moment and makes a quick decision She glances out at her surroundings and sees the freeway ahead before suddenly turning off the highway and checking her mirror to see that the Patrolman is no longer following and has not turned off after her As she drives she glances into her rearview mirror to see the Patrolman following in his automobile at a matched speed The Patrolman peers in checks the car registration on the steering wheel and returns Mary's wallet and she takes it looking at him for a flicker of a moment before starting ahead fast He looks at the wallet then at the car and walks around to the front of the car to check the license plate before returning Nervously trying to control her fear she takes out the moneyfilled envelope then the important papers envelope and a couple of other items placing them on the seat finally finding her wallet opening it and handing it to him The Patrolman is staring at her and she glances at him nervously pokes in her bag a bit more sighs and realizes she will have to remove some of its contents Mary pulls her handbag up from the floor where she had placed it when she stretched out for sleep and puts her hand in it rummaging for her wallet but cannot find it Reluctantly she rolls down the window and the Patrolman studies her for a moment Mary then slams down on the brake trying to pull herself together as the Patrolman raps again less gently She remains on the threshold for a moment then crosses to the desk talking as she goes he winks at her without pausing in his drinking Mary opens the door and looks in to see Cassidy drinking from a large tumbler"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "as she gets out of the car glances toward the lot office and turns her attention to the line of cars noticing the California license plates on all of them Breathing a sigh of relief she thinks for a moment and makes a quick decision Reluctantly she rolls down the window and the Patrolman studies her for a moment The Patrolman peers in checks the car registration on the steering wheel and returns Mary's wallet and she takes it looking at him for a flicker of a moment before starting ahead fast Mary pulls her handbag up from the floor where she had placed it when she stretched out for sleep and puts her hand in it rummaging for her wallet but cannot find it Nervously trying to control her fear she takes out the moneyfilled envelope then the important papers envelope and a couple of other items placing them on the seat finally finding her wallet opening it and handing it to him As she goes the same Patrolman is seen coming up the street toward the lot and he sees Mary slows swerves over to the opposite side of the street and stops by the curb The Patrolman is staring at her and she glances at him nervously pokes in her bag a bit more sighs and realizes she will have to remove some of its contents As she drives she glances into her rearview mirror to see the Patrolman following in his automobile at a matched speed Her eye is caught by the iron newspaper stand on the corner just outside the lot and she stares at the papers turns away as if what she is fearing would have to be impossible then having to satisfy herself goes to the stand drops a dime in the iron slot picks up a Los Angeles newspaper and starts back into the car lot glancing worriedly at the front page he winks at her without pausing in his drinking She glances out at her surroundings and sees the freeway ahead before suddenly turning off the highway and checking her mirror to see that the Patrolman is no longer following and has not turned off after her She remains on the threshold for a moment then crosses to the desk talking as she goes The car dealer calls out from his office and Mary nods starting to walk along the line of cars as if making a selection Mary engrossed in the newspaper and walking back through the lot does not see the Patrolman He looks at the wallet then at the car and walks around to the front of the car to check the license plate before returning Mary opens the door and looks in to see Cassidy drinking from a large tumbler Mary then slams down on the brake trying to pull herself together as the Patrolman raps again less gently"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "The Patrolman peers in checks the car registration on the steering wheel and returns Mary's wallet and she takes it looking at him for a flicker of a moment before starting ahead fast As she drives she glances into her rearview mirror to see the Patrolman following in his automobile at a matched speed She glances out at her surroundings and sees the freeway ahead before suddenly turning off the highway and checking her mirror to see that the Patrolman is no longer following and has not turned off after her Breathing a sigh of relief she thinks for a moment and makes a quick decision as she gets out of the car glances toward the lot office and turns her attention to the line of cars noticing the California license plates on all of them The car dealer calls out from his office and Mary nods starting to walk along the line of cars as if making a selection Her eye is caught by the iron newspaper stand on the corner just outside the lot and she stares at the papers turns away as if what she is fearing would have to be impossible then having to satisfy herself goes to the stand drops a dime in the iron slot picks up a Los Angeles newspaper and starts back into the car lot glancing worriedly at the front page As she goes the same Patrolman is seen coming up the street toward the lot and he sees Mary slows swerves over to the opposite side of the street and stops by the curb Mary engrossed in the newspaper and walking back through the lot does not see the Patrolman Mary opens the door and looks in to see Cassidy drinking from a large tumbler he winks at her without pausing in his drinking She remains on the threshold for a moment then crosses to the desk talking as she goes Mary then slams down on the brake trying to pull herself together as the Patrolman raps again less gently Reluctantly she rolls down the window and the Patrolman studies her for a moment Mary pulls her handbag up from the floor where she had placed it when she stretched out for sleep and puts her hand in it rummaging for her wallet but cannot find it The Patrolman is staring at her and she glances at him nervously pokes in her bag a bit more sighs and realizes she will have to remove some of its contents Nervously trying to control her fear she takes out the moneyfilled envelope then the important papers envelope and a couple of other items placing them on the seat finally finding her wallet opening it and handing it to him He looks at the wallet then at the car and walks around to the front of the car to check the license plate before returning"
        }
      ]
    }
  ]
}