{
  "ground_truth": "In perfect lip sync is. There is a TIGHT SHOT of Darryl's face going deeper and deeper into a state of shock, and TIGHT SHOTS of Hal, Max, and others all looking intently at the screen, which displays a VIDEO IMAGE of Thelma boldly ordering a cashier to fill her purse with money. As the cashier loads the purse with bills, Thelma takes beef jerky from the display and adds it to the purse while pointing a gun at the cashier. Thelma and Louise are in the car driving, and Louise notices the speedometer touching 80 mph, so she lets her foot off the gas, looking a little nervous. Thelma howls like a dog and drinks from a little bottle of Wild Turkey. As they drive next to a truck, the truck driver smiles and waves at them, and they smile and wave back. He then flicks his tongue at them, causing Louise to scream. They both pause for a moment, and as the sun sets, the T-Bird drives deeper into the vast desert. Darryl sits in the hallway as two officers lead J.D. down the hall with Hal, Max, and other plainclothes officers following. Hal thinks for a moment, looks to Max, who agrees and opens the door for the others to leave. Hal and Max make eye contact before Max closes the door, and Hal sits down across the table from J.D. They sit there for a moment, then J.D. shifts in his chair. Hal opens the door, allowing Max and the others to straggle back in, and the TV is ON with the place in a mess. As the phone RINGS, Darryl, Hal, Max, and other cops spring into action, donning headsets, turning on tape recorders. Darryl picks up the phone while Hal, Max, and others gesticulate wildly. Thelma hangs up the phone, leaving everyone disappointed as they take off their headsets and turn off tape recorders, looking at Darryl like he's an idiot. Darryl holds the phone in his hand as Thelma and Louise stare at each other intently. Louise steps up to the phone and again everyone springs into action while Darryl fumbles with the phone, giving Hal and Max a look as if he's got everything under control. Louise hangs up the phone and all are busy trying to trace the call. Darryl returns to his recliner, still in shock. Louise stomps back to the car with Thelma following doggedly. A moving van pulls in and parks in the background. Louise stops as she is about to get in, faces Thelma, who is standing on the other side of the car, yanks open her car door, gets in, slams the door, and fires up the ENGINE.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "In flawless lip sync is. There is a CLOSE-UP of Darryl's visage going further and further into a state of astonishment, and CLOSE-UPS of Hal, Max, and others all peering intently at the monitor, which exhibits a VIDEO VISUAL of Thelma audaciously instructing a teller to fill her handbag with currency. As the teller stuffs the handbag with notes, Thelma takes beef jerky from the exhibit and adds it to the handbag while aiming a firearm at the teller. Thelma and Louise are in the vehicle cruising, and Louise observes the speedometer reaching 80 mph, so she lets her foot off the accelerator, looking a tad uneasy. Thelma bays like a canine and sips from a small flask of Wild Turkey. As they travel adjacent to a lorry, the lorry operator grins and waves at them, and they grin and wave back. He then flicks his tongue at them, prompting Louise to shriek. They both linger momentarily, and as the sun declines, the T-Bird moves further into the vast wasteland. Darryl perches in the corridor as two constables escort J.D. down the passageway with Hal, Max, and other undercover constables trailing. Hal ponders for a second, glances to Max, who concurs and unlocks the portal for the others to exit. Hal and Max exchange looks before Max shuts the door, and Hal seats himself across the table from J.D. They remain there briefly, then J.D. shifts in his chair. Hal unlocks the portal, permitting Max and the others to trickle back in, and the TV is ON with the place in disarray. As the telephone RINGS, Darryl, Hal, Max, and other officers leap into action, wearing headsets, activating tape recorders. Darryl lifts the receiver while Hal, Max, and others gesticulate feverishly. Thelma hangs up the receiver, leaving everyone frustrated as they remove their headsets and deactivate tape recorders, gazing at Darryl like he's a fool. Darryl grips the phone in his grasp as Thelma and Louise gaze at each other intently. Louise approaches the phone and once more everyone bursts into action while Darryl fumbles with the telephone, casting Hal and Max a look as if he's got everything under control. Louise hangs up the telephone and all are occupied attempting to trace the call. Darryl returns to his recliner, still astounded. Louise strides back to the vehicle with Thelma following persistently. A relocation van rolls in and parks in the backdrop. Louise halts as she is about to enter, faces Thelma, who is standing on the opposite side of the vehicle, yanks open her automobile door, gets in, slams the door, and ignites the MOTOR."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "In perfect lip sync is. A TIGHT SHOT is taken of Darryl's face as it goes deeper and deeper into a state of shock, and TIGHT SHOTS are taken of Hal, Max, and others all looking intently at the screen, which displays a VIDEO IMAGE of Thelma boldly ordering a cashier to fill her purse with money. The purse is loaded with bills by the cashier, and beef jerky is taken from the display by Thelma, who adds it to the purse while pointing a gun at the cashier. The car is driven by Thelma and Louise, and the speedometer touching 80 mph is noticed by Louise, so the gas is let off by her, looking a little nervous. A howl like a dog is made by Thelma, and a little bottle of Wild Turkey is drunk by her. As a truck is driven next to, the truck driver smiles and waves at them, and they are smiled and waved back at by them. His tongue is then flicked at them by him, causing a scream from Louise. A pause is taken by both for a moment, and as the sun sets, the T-Bird is driven deeper into the vast desert. The hallway is sat in by Darryl as J.D. is led down the hall by two officers with Hal, Max, and other plainclothes officers following. Hal thinks for a moment, looks at Max, who agrees and the door is opened by him for the others to leave. Eye contact is made between Hal and Max before the door is closed by Max, and Hal sits down across the table from J.D. A moment is spent sitting there by them, then a shift is made by J.D. in his chair. The door is opened by Hal, allowing Max and the others to straggle back in, and the TV is ON with the place in a mess. As the phone RINGS, action is sprung into by Darryl, Hal, Max, and other cops, headsets are donned, tape recorders are turned on. The phone is picked up by Darryl while wild gesticulations are made by Hal, Max, and others. The phone is hung up by Thelma, leaving everyone disappointed as headsets are taken off and tape recorders are turned off, looking at Darryl like he's an idiot. The phone is held in Darryl's hand as Thelma and Louise stare at each other intently. The phone is stepped up to by Louise and action is again sprung into by everyone while the phone is fumbled with by Darryl, giving a look to Hal and Max as if everything is under control by him. The phone is hung up by Louise and all are busy trying to trace the call. The recliner is returned to by Darryl, still in shock. The car is stomped back to by Louise with Thelma following doggedly. A moving van is pulled in and parked in the background. As she is about to get in, Louise stops, faces Thelma, who stands on the other side of the car, her car door is yanked open by her, she gets in, the door is slammed, and the ENGINE is fired up."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "In lip sync, there’s a TIGHT SHOT of Darryl’s shocked face and TIGHT SHOTS of Hal, Max, and others watching a VIDEO of Thelma ordering a cashier to fill her purse with money. She adds beef jerky while holding a gun. Thelma and Louise drive as Louise, noticing the speedometer at 80 mph, eases off the gas, appearing nervous. Thelma howls and drinks Wild Turkey. Next to a truck, they wave at a driver who flicks his tongue, causing Louise to scream. They pause as the sun sets and the T-Bird heads into the desert. In the hallway, Darryl sits as officers escort J.D., followed by Hal, Max, and others. Hal, contemplating, gets Max to open the door for others to leave. Hal and J.D. exchange glances before J.D. fidgets, prompting Hal to let the others re-enter. The TV is on amidst a mess as the phone RINGS, prompting Darryl, Hal, Max, and cops to spring into action, don headsets, and turn on tape recorders. Darryl answers the phone as Thelma hangs up, disappointing everyone. Darryl holds the phone as Thelma and Louise stare intensely. Louise approaches the phone, prompting more action, while Darryl fumbles but reassures Hal and Max. Louise hangs up, leading to a call tracing frenzy. Darryl, still in shock, returns to his recliner. Louise stomps to the car with Thelma following. A moving van parks in the background. Louise faces Thelma, opens her car door, gets in, slams it, and starts the ENGINE."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "In perfect lip sync, Darryl's face shows shock, with tight shots of Hal, Max, and others watching a video of Thelma ordering a cashier to fill her purse with money. She adds beef jerky to the purse while pointing a gun. In the car, Louise sees they're at 80 mph and eases off the gas, looking nervous. Thelma howls and drinks Wild Turkey. A truck driver smiles, they wave back, he flicks his tongue, causing Louise to scream. As the sun sets, the T-Bird drives into the desert. Darryl sits while officers escort J.D., followed by Hal and Max. Hal glances at Max, they leave, make eye contact, and Hal sits with J.D. J.D. shifts, Hal invites others in, and the TV is on. The phone rings, and Darryl, Hal, Max, and cops act, don headsets, and turn on recorders. Darryl answers, Thelma hangs up, disappointing everyone. They remove headsets and glare at Darryl. Louise steps to the phone; everyone acts, Darryl fumbles. Louise hangs up, they trace the call. Darryl, still shocked, returns to his recliner. Louise stomps to the car, Thelma follows, a moving van parks behind. Louise faces Thelma, opens the car door, gets in, and starts the engine."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "In flawless synchronization with the video playing out before them, there is an intense and focused TIGHT SHOT capturing Darryl’s face as it transitions deeper and deeper into a state of shock. Similarly, there are TIGHT SHOTS of Hal, Max, and several others who are all fixated on the screen, which is currently displaying a VIDEO IMAGE of Thelma. In a daring display, she is seen commanding a cashier with bold determination to fill her purse with money. As the cashier obediently stuffs the purse with stacks of bills, Thelma casually reaches for some beef jerky from a nearby display and tucks it into her purse, all while keeping a gun pointed squarely at the cashier. Meanwhile, Thelma and Louise are in their car, driving along, with Louise noticing the speedometer creeping up to 80 mph. Feeling a hint of anxiety, she eases her foot off the gas pedal and looks slightly uneasy. Thelma, from the passenger seat, howls exuberantly like a wild dog and takes a hearty swig from a small bottle of Wild Turkey. As they pull alongside a passing truck, the truck driver cheerfully smiles and waves at them, to which they respond with smiles and waves of their own. However, the moment takes a distasteful turn when the truck driver flicks his tongue at them provocatively, causing Louise to scream in disgust. They both pause momentarily, and as the sun sets beautifully in the horizon, the T-Bird continues to drive deeper into the expansive and seemingly endless desert terrain. \n\nMeanwhile, back in the hallway, Darryl sits helplessly as two officers escort J.D. down the corridor, followed closely by Hal, Max, and several other plainclothes officers. Hal halts momentarily to ponder, then locks eyes with Max, who signals his agreement and opens the door to allow the others to exit the room. There is a quiet moment of understanding between Hal and Max, with Hal taking a seat across the table from J.D. After a moment, J.D. adjusts his position in the chair, and Hal opens the door, ushering Max and the others as they straggle back into the room, which is now filled with tension, and where the TV remains ON amidst the disorder. Suddenly, the phone RINGS, prompting Darryl, Hal, Max, and the other cops to spring into action rapidly, as they hastily put on headsets and activate tape recorders. Darryl reaches for the phone, while Hal, Max, and others make frantic gestures. Thelma then hangs up the phone abruptly, leaving everyone visibly dejected, as they remove their headsets and switch off the tape recorders, casting frustrated glances at Darryl as though he is inept. Holding the phone, Darryl appears bewildered, while Thelma and Louise gaze intently at each other. Louise approaches the phone with determination, causing everyone to leap into action once more, while Darryl fumbles nervously with the phone, shooting a look at Hal and Max as if to signal that he’s got the situation under control. Louise hangs up the phone again, and everyone is immediately occupied with attempting to trace the call. Darryl, still in shock, retreats to his recliner. Meanwhile, Louise stomps briskly back to the car with Thelma trailing persistently behind. In the background, a moving van pulls in and parks quietly. Louise comes to a stop as she prepares to get into the car. She faces Thelma, who stands on the opposite side of the vehicle, yanks open her car door, climbs in, slams the door shut with determination, and fires up the ENGINE."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "In perfect synchronization with the unfolding scene on the video playing out before them, the camera captures an intense, focused TIGHT SHOT, zeroing in on Darryl’s face as it gradually and profoundly shifts to convey a deepening sense of shock. Similarly, there are TIGHT SHOTS capturing the expressions of Hal, Max, and several others, all of whom are fixated on the screen, which currently displays a vivid VIDEO IMAGE of Thelma. In a daring and bold display, she is portrayed assertively commanding a cashier to fill her purse with stacks of money. As the cashier obediently complies and stuffs the purse overflowing with bills, Thelma nonchalantly reaches for some beef jerky from a nearby display, casually tucking it into her purse, all while keeping a gun pointed squarely in the direction of the cashier. Meanwhile, Thelma and Louise are in their car, driving along the road, with Louise noticing the needle of the speedometer inching perilously close to 80 mph. Feeling a twinge of anxiety, she gently eases her foot off the gas pedal and glances sideways, appearing slightly uneasy. Seated in the passenger seat, Thelma lets out an exuberant howl, reminiscent of a wild dog, before taking a hearty swig from a small bottle of Wild Turkey. As they pull alongside a passing truck, the truck driver offers them a cheerful smile and a friendly wave, prompting them to reciprocate with smiles and waves of their own. However, the moment takes a distasteful turn when the truck driver crudely flicks his tongue at them provocatively, prompting Louise to scream in utter disgust. They both pause momentarily, and as the sun sets beautifully on the horizon, casting a warm glow, the T-Bird continues its journey deeper into the vast, expansive, and seemingly endless desert terrain.\n\nSimultaneously, back in the hallway, Darryl sits helplessly as two officers escort J.D. down the corridor, with Hal, Max, and a group of plainclothes officers trailing closely behind. Hal pauses momentarily to reflect, then locks eyes with Max, who nods his agreement and proceeds to open the door, allowing the others to exit the room. There is a brief, quiet moment of mutual understanding between Hal and Max, with Hal taking a seat across the table from J.D. After a short pause, J.D. shifts his position in the chair, as Hal opens the door, ushering Max and the others back into the room, now brimming with tension, where the TV remains ON amidst the disorder. Suddenly, the phone RINGS, prompting Darryl, Hal, Max, and the other officers to spring into swift action, as they hastily don headsets and activate tape recorders in a flurry of movement. Darryl reaches for the phone, while Hal, Max, and others make frantic gestures. Thelma then abruptly hangs up the phone, leaving everyone visibly dejected, as they remove their headsets and switch off the tape recorders, casting frustrated glances in Darryl's direction, as though he is inept. Holding the phone, Darryl appears bewildered, while Thelma and Louise gaze intently at each other. Louise approaches the phone with determined resolve, causing everyone to leap into action once more, while Darryl fumbles nervously with the phone, shooting a look of assurance at Hal and Max as if to signal that he’s got the situation under control. Louise hangs up the phone again, and everyone is immediately occupied with a frenzied attempt to trace the call. Darryl, still in shock, retreats to his recliner in a daze. Meanwhile, Louise stomps purposefully back to the car with Thelma trailing persistently behind her. In the background, a moving van pulls in and parks quietly. Louise comes to a stop as she prepares to get into the car. She faces Thelma, who stands on the opposite side of the vehicle, yanks open her car door, climbs in with determination, slams the door shut, and promptly fires up the ENGINE."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "In perfect lip sync, a scene unfolds with the camera tightly focused on Darryl's face as he progressively sinks into a deeper state of shock, his expression mirroring the gravity of the situation. Simultaneously, similarly tight shots of Hal, Max, and others reveal their keen focus on a screen that broadcasts a video image of Thelma, who is audaciously commanding a cashier to fill her purse with money. As the cashier dutifully stuffs the purse with bills, Thelma, with an air of defiance, reaches over to the display, grabs a piece of beef jerky, and adds it to her stash while maintaining her aim at the cashier with a gun. Meanwhile, Thelma and Louise are in the car; Louise, sitting in the driver’s seat, notices the speedometer edging up to 80 mph. She reacts with a hint of nervousness, easing her foot off the gas pedal to slow the vehicle. Thelma, riding shotgun, lets out a howl reminiscent of a dog and takes a swig from a small bottle of Wild Turkey, savoring the rebellious moment. As they cruise along, a truck pulls up beside them, and the driver, wearing a grin, flashes a wave, to which both women respond with their own friendly waves. However, the driver’s demeanor shifts as he provocatively flicks his tongue at them, prompting a startled scream from Louise. They both momentarily pause as the situation settles, and as the sun sets, casting an orange glow, the T-Bird drives on, delving further into the expansive desert. Back in a hallway, Darryl sits pensively as two officers escort J.D. down the corridor, with Hal, Max, and other plainclothes officers trailing behind. Hal, momentarily lost in thought, exchanges a quick glance with Max, who acknowledges with a nod and opens the door, allowing the others to exit. Hal and Max share a fleeting look of understanding before Max navigates the door closed, and Hal settles into a chair across the table from J.D. For an instant, they sit in silence, a tension filling the air until J.D. shifts slightly in his chair. Hal then rises and opens the door once more, permitting Max and the other officers to trickle back inside. As the TV blares with a cacophony and the surroundings lie in disarray, the phone rings sharply. The urgency escalates as Darryl, Hal, Max, and the other officers snap into action, hurriedly donning headsets and flipping on tape recorders. Darryl answers the phone with a sense of anticipation while Hal, Max, and the others gesture animatedly, caught in the throes of the moment. However, the call is short-lived as Thelma hangs up, leaving a palpable disappointment in the air. A shared look of disparagement is cast toward Darryl as everyone removes their headsets and switches off the recorders, silently condemning his perceived incompetence. Still holding the phone, Darryl sits with the weight of the situation pressing upon him, while elsewhere, Thelma and Louise engage in an intense, wordless exchange of glances. Taking the initiative, Louise approaches the phone, prompting everyone to spring back into action as Darryl fumbles awkwardly with the phone, offering Hal and Max a look of assurance as if signaling that he has the situation under control. Once more, Louise hangs up, setting off a flurry of activity as all involved scramble to trace the call. Darryl returns to his recliner, still enveloped in a fog of shock. Meanwhile, Louise strides back purposefully to the car, with Thelma closely trailing behind her. As a moving van rolls in and parks in the background, Louise halts abruptly, poised to enter the vehicle. She turns to face Thelma, who stands on the opposite side of the car, then decisively yanks open her door, settles into the driver's seat, slams the door shut with finality, and revs the engine, ready to take off once again."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "In a state of perfect lip sync, there is a TIGHT SHOT of Darryl's face deepening in shock, complemented by TIGHT SHOTS of Hal, Max, and others watching Thelma on screen as she boldly orders a cashier to fill her purse with money, adding beef jerky while brandishing a gun. As Thelma and Louise drive away, Louise nervously eases off the gas upon noticing the speedometer at 80 mph. Thelma howls playfully and drinks, and they exchange smiles and waves with a truck driver, who then makes a lewd gesture, prompting Louise to scream. They momentarily pause, and the T-Bird continues deeper into the desert as the sun sets.\n\nMeanwhile, Darryl sits in a hallway while two officers escort J.D., followed by Hal, Max, and other plainclothes officers. After a brief consultation, Hal and Max decide to leave and return; Max shuts the door, leaving Hal with J.D. They sit silently until Hal signals for the others to return, and chaos ensues as the phone rings. Darryl, Hal, Max, and the others spring into action, donning headsets and recording equipment. As Darryl answers, they gesture wildly until Thelma hangs up, leaving them disappointed. They remove their headsets, visibly frustrated with Darryl. He holds the phone as Thelma and Louise lock eyes intensely.\n\nWhen Louise steps up to the phone, the team hastily attempts to trace the call. Despite Darryl's fumbling, he tries to assure Hal and Max he's in control. After another hang-up, they intensify their tracing efforts, and Darryl returns to his recliner, stunned. Louise, followed by Thelma, returns to their car as a moving van parks in the distance. Louise confronts Thelma before forcefully entering the car, slamming the door, and starting the ENGINE."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "In perfect lip sync is, a skill usually associated with dubbing or live performances, giving the scene an eerily synchronized feel. There is a TIGHT SHOT of Darryl's face going deeper and deeper into a state of shock, and TIGHT SHOTS of Hal, an experienced detective known for his methodical approach, Max, a rookie but eager officer, and others all looking intently at the screen, which displays a VIDEO IMAGE of Thelma boldly ordering a cashier to fill her purse with money. This action mirrors numerous real-life heists captured on security cameras. As the cashier loads the purse with bills, Thelma casually takes beef jerky from the display, a common impulse purchase, and adds it to the purse while pointing a gun at the cashier. Thelma and Louise are in the car, a classic 1966 Ford Thunderbird known for its powerful V8 engine, driving, and Louise notices the speedometer touching 80 mph, so she lets her foot off the gas, looking a little nervous as the car is capable of high speeds. Thelma howls like a dog and drinks from a little bottle of Wild Turkey, a popular brand of bourbon whiskey. As they drive next to a truck, the truck driver, a typical highway traveler used to long hauls, smiles and waves at them, and they smile and wave back. He then flicks his tongue at them, causing Louise to scream in disgust at the inappropriate gesture. They both pause for a moment, and as the sun sets, casting a warm glow over the landscape, the T-Bird drives deeper into the vast desert, a place often associated with freedom and escape. Darryl sits in the hallway as two officers lead J.D., a charming drifter with a knack for getting into trouble, down the hall with Hal, Max, and other plainclothes officers following. Hal thinks for a moment, looks to Max, who agrees, reflecting their seasoned partnership, and opens the door for the others to leave. Hal and Max make eye contact before Max closes the door, and Hal sits down across the table from J.D. They sit there for a moment, then J.D. shifts in his chair, suggesting his nervousness. Hal opens the door, allowing Max and the others to straggle back in, and the TV is ON with the place in a mess, papers and files scattered everywhere. As the phone RINGS, sounding like an alarm bell, Darryl, Hal, Max, and other cops spring into action, donning headsets, turning on tape recorders, standard protocol in wiretapping operations. Darryl picks up the phone while Hal, Max, and others gesticulate wildly, trying to maintain order. Thelma hangs up the phone, leaving everyone disappointed as they take off their headsets and turn off tape recorders, looking at Darryl like he's an idiot, their frustration palpable. Darryl holds the phone in his hand as Thelma and Louise stare at each other intently, a moment of silent communication. Louise steps up to the phone and again everyone springs into action while Darryl fumbles with the phone, giving Hal and Max a look as if he's got everything under control, though his demeanor suggests otherwise. Louise hangs up the phone and all are busy trying to trace the call, a race against time. Darryl returns to his recliner, still in shock, as the chaos unfolds around him. Louise stomps back to the car with Thelma following doggedly, determined to push forward. A moving van pulls in and parks in the background, perhaps signaling change. Louise stops as she is about to get in, faces Thelma, who is standing on the other side of the car, yanks open her car door, gets in, slams the door with a sense of finality, and fires up the ENGINE, the roar cutting through the evening silence."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "As the phone RINGS Darryl Hal Max and other cops spring into action donning headsets turning on tape recorders Darryl sits in the hallway as two officers lead JD down the hall with Hal Max and other plainclothes In perfect lip sync is There is a TIGHT SHOT of Darryl's face going deeper and deeper into a state of shock and TIGHT SHOTS of Hal Max and others all looking intently at the screen which displays a VIDEO IMAGE of Thelma boldly ordering a cashier to fill her purse with money As the cashier loads the purse with bills Thelma takes beef jerky from the display and adds it to the purse while pointing a gun at the cashier Thelma and Louise are in the car driving and Louise notices the speedometer touching 80 mph so she let us her foot off the gas looking a little nervous Thelma howls like a dog and drinks from a little bottle of Wild Turkey As they drive next to a truck the truck driver smiles and waves at them and they smile and wave back He then flicks his tongue at them causing Louise to scream Darryl returns to his recliner still in shock Thelma howls like a dog and drinks from a little bottle of Wild Turkey As the cashier loads the purse with bills Thelma takes beef jerky from the display and adds it to the purse while pointing a gun at the cashier They both pause for a moment and as the sun sets the TBird drives deeper into the vast desert Darryl sits in the hallway as two officers lead JD down the hall with Hal Max and other plainclothes officers following As they drive next to a truck the truck driver smiles and waves at them and they smile and wave back Hal thinks for a moment looks to Max who agrees and opens the door for the others to leave Thelma and Louise are in the car driving and Louise notices the speedometer touching 80 mph so she let us her foot off the gas looking a little nervous Hal and Max make eye contact before Max closes the door and Hal sits down across the table from JD They sit there for a moment A moving van pulls in and parks in the background then JD shifts in his chair Hal opens the door allowing Max and the others to straggle back in and the TV is ON with the place in a mess Thelma who is standing on the other side of the car yanks open her car door gets in slams the door and fires up the ENGINE In perfect lip sync is There is a TIGHT SHOT of Darryl's face going deeper and deeper into a state of shock and TIGHT SHOTS of Hal Max and others all looking intently at the screen which displays a VIDEO IMAGE of Thelma boldly ordering a cashier to fill her purse with money As the phone RINGS Darryl Hal Max and other cops spring into action donning headsets turning on tape recorders Darryl picks up the phone while Hal Max and others gesticulate wildly officers following Thelma hangs up the phone leaving everyone disappointed as they take off their headsets and turn off tape recorders looking at Darryl like he is an idiot Darryl holds the phone in his hand as Thelma and Louise stare at each other intently Louise steps up to the phone and again everyone springs into action while Darryl fumbles with the phone giving Hal and Max a look as if he is got everything under control Louise stops as she is about to get in faces Hal opens the door allowing Max and the others to straggle back in and the TV is ON with the place in a mess Louise hangs up the phone and all are busy trying to trace the call Darryl returns to his recliner still in shock Louise stomps back to the car with Thelma following doggedly A moving van pulls in and parks in the background Louise stops as she is about to get in faces Thelma who is standing on the other side of the car yanks open her car door gets in slams the door and fires up the ENGINE"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "In perfect lip sync is There is a TIGHT SHOT of Darryl's face going deeper and deeper into a state of shock and TIGHT SHOTS of Hal Max and others all looking intently at the screen which displays a VIDEO IMAGE of Thelma boldly ordering a cashier to fill her purse with money. As the cashier loads the purse with bills Thelma takes beef jerky from the display and adds it to the purse while pointing a gun at the cashier. Thelma and Louise are in the car driving and Louise notices the speedometer touching 80 mph so she let us her foot off the gas looking a little nervous. Thelma howls like a dog and drinks from a little bottle of Wild Turkey. As they drive next to a truck the truck driver smiles and waves at them and they smile and wave back. He then flicks his tongue at them causing Louise to scream. They both pause for a moment and as the sun sets the TBird drives deeper into the vast desert. Darryl sits in the hallway as two officers lead JD down the hall with Hal Max and other plainclothes. officers following. Hal thinks for a moment looks to Max who agrees and opens the door for the others to leave. Hal and Max make eye contact before Max closes the door and Hal sits down across the table from JD. They sit there for a moment. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. then JD shifts in his chair. Hal opens the door allowing Max and the others to straggle back in and the TV is ON with the place in a mess. As the phone RINGS Darryl Hal Max and other cops spring into action donning headsets turning on tape recorders. Darryl picks up the phone while Hal Max and others gesticulate wildly. Thelma hangs up the phone leaving everyone disappointed as they take off their headsets and turn off tape recorders looking at Darryl like he is an idiot. Darryl holds the phone in his hand as Thelma and Louise stare at each other intently. Louise steps up to the phone and again everyone springs into action while Darryl fumbles with the phone giving Hal and Max a look as if he is got everything under control. Louise hangs up the phone and all are busy trying to trace the call. Darryl returns to his recliner still in shock. Louise stomps back to the car with Thelma following doggedly. A moving van pulls in and parks in the background. Louise stops as she is about to get in faces. Thelma who is standing on the other side of the car yanks open her car door gets in slams the door and fires up the ENGINE."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "In perfect lip sync is There is a TIGHT SHOT of Darryl's face going deeper and deeper into a state of shock and TIGHT SHOTS of Hal Max and others all looking intently at the screen which displays a VIDEO IMAGE of Thelma boldly ordering a cashier to fill her purse with money. As the cashier loads the purse with bills Thelma takes beef jerky from the display and adds it to the purse while pointing a gun at the cashier. Thelma and Louise are in the car driving and Louise notices the speedometer touching 80 mph so she let us her foot off the gas looking a little nervous. Thelma howls like a dog and drinks from a little bottle of Wild Turkey. As they drive next to a truck the truck driver smiles and waves at them and they smile and wave back. He then flicks his tongue at them causing Louise to scream. They both pause for a moment and as the sun sets the TBird drives deeper into the vast desert. Darryl sits in the hallway as two officers lead JD down the hall with Hal Max and other plainclothes. officers following. Hal thinks for a moment looks to Max who agrees and opens the door for the others to leave. Hal and Max make eye contact before Max closes the door and Hal sits down across the table from JD. They sit there for a moment. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. then JD shifts in his chair. Hal opens the door allowing Max and the others to straggle back in and the TV is ON with the place in a mess. As the phone RINGS Darryl Hal Max and other cops spring into action donning headsets turning on tape recorders. Darryl picks up the phone while Hal Max and others gesticulate wildly. Thelma hangs up the phone leaving everyone disappointed as they take off their headsets and turn off tape recorders looking at Darryl like he is an idiot. Darryl holds the phone in his hand as Thelma and Louise stare at each other intently. Louise steps up to the phone and again everyone springs into action while Darryl fumbles with the phone giving Hal and Max a look as if he is got everything under control. Louise hangs up the phone and all are busy trying to trace the call. Darryl returns to his recliner still in shock. Louise stomps back to the car with Thelma following doggedly. A moving van pulls in and parks in the background. Louise stops as she is about to get in faces. Thelma who is standing on the other side of the car yanks open her car door gets in slams the door and fires up the ENGINE."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "In perfect lip sync is There is a TIGHT SHOT of Darryl's face going deeper and deeper into a state of shock and TIGHT SHOTS of Hal Max and others all looking intently at the screen which displays a VIDEO IMAGE of Thelma boldly ordering a cashier to fill her purse with money. As the cashier loads the purse with bills Thelma takes beef jerky from the display and adds it to the purse while pointing a gun at the cashier. Thelma and Louise are in the car driving and Louise notices the speedometer touching 80 mph so she let us her foot off the gas looking a little nervous. Thelma howls like a dog and drinks from a little bottle of Wild Turkey. As they drive next to a truck the truck driver smiles and waves at them and they smile and wave back. He then flicks his tongue at them causing Louise to scream. Louise steps up to the phone and again everyone springs into action while Darryl fumbles with the phone giving Hal and Max a look as if he is got everything under control. Louise hangs up the phone and all are busy trying to trace the call. Darryl returns to his recliner still in shock. Louise stomps back to the car with Thelma following doggedly. A moving van pulls in and parks in the background. Louise stops as she is about to get in faces. Thelma who is standing on the other side of the car yanks open her car door gets in slams the door and fires up the ENGINE."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "In perfect lip sync is There is a TIGHT SHOT of Darryl's face going deeper and deeper into a state of shock and TIGHT SHOTS of Hal Max and others all looking intently at the screen which displays a VIDEO IMAGE of Thelma boldly ordering a cashier to fill her purse with money. As the cashier loads the purse with bills Thelma takes beef jerky from the display and adds it to the purse while pointing a gun at the cashier. A moving van pulls in and parks in the background. Louise stops as she is about to get in faces. Thelma who is standing on the other side of the car yanks open her car door gets in slams the door and fires up the ENGINE."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "In perfect lip sync is. There is a TIGHT SHOT of a squirrel's face going deeper and deeper into a state of shock, and TIGHT SHOTS of an elephant, a dolphin, and others all looking intently at the screen, which displays a VIDEO IMAGE of a penguin boldly ordering a cashier to fill her purse with money. As the cashier loads the purse with bills, the penguin takes beef jerky from the display and adds it to the purse while pointing a gun at the cashier. The penguin and a flamingo are in the car driving, and the flamingo notices the speedometer touching 80 mph, so she lets her foot off the gas, looking a little nervous. The penguin howls like a dog and drinks from a little bottle of Wild Turkey. As they drive next to a truck, the truck driver smiles and waves at them, and they smile and wave back. He then flicks his tongue at them, causing the flamingo to scream. They both pause for a moment, and as the sun sets, the T-Bird drives deeper into the vast desert. A squirrel sits in the hallway as two officers lead a kangaroo down the hall with an elephant, a dolphin, and other plainclothes officers following. An elephant thinks for a moment, looks to a dolphin, who agrees and opens the door for the others to leave. An elephant and a dolphin make eye contact before a dolphin closes the door, and an elephant sits down across the table from the kangaroo. They sit there for a moment, then the kangaroo shifts in his chair. An elephant opens the door, allowing a dolphin and the others to straggle back in, and the TV is ON with the place in a mess. As the phone RINGS, a squirrel, an elephant, a dolphin, and other cops spring into action, donning headsets, turning on tape recorders. A squirrel picks up the phone while an elephant, a dolphin, and others gesticulate wildly. A penguin hangs up the phone, leaving everyone disappointed as they take off their headsets and turn off tape recorders, looking at a squirrel like he's an idiot. A squirrel holds the phone in his hand as a penguin and a flamingo stare at each other intently. The flamingo steps up to the phone and again everyone springs into action while a squirrel fumbles with the phone, giving an elephant and a dolphin a look as if he's got everything under control. The flamingo hangs up the phone and all are busy trying to trace the call. A squirrel returns to his recliner, still in shock. The flamingo stomps back to the car with a penguin following doggedly. A moving van pulls in and parks in the background. The flamingo stops as she is about to get in, faces the penguin, who is standing on the other side of the car, yanks open her car door, gets in, slams the door, and fires up the ENGINE."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "In perfect lip sync is. There is a TIGHT SHOT of Darryl's face going deeper and deeper into a state of shock, and TIGHT SHOTS of Hal, Max, and others all looking intently at the screen, which displays a VIDEO IMAGE of Thelma boldly ordering a florist to fill her backpack with flowers. As the florist loads the backpack with bouquets, Thelma takes a chocolate bar from the display and adds it to the backpack while pointing a water gun at the florist. Thelma and Louise are in the tram riding, and Louise notices the altimeter touching 8000 feet, so she lets her hand off the lever, looking a little nervous. Thelma howls like a wolf and drinks from a little flask of apple juice. As they ride next to a cart, the cart driver smiles and waves at them, and they smile and wave back. He then flicks his thumb at them, causing Louise to scream. They both pause for a moment, and as the moon rises, the scooter rides deeper into the vast canyon. Darryl sits in the kitchen as two officers lead J.D. down the aisle with Hal, Max, and other plainclothes officers trailing. Hal thinks for a moment, looks to Max, who agrees and opens the portal for the others to leave. Hal and Max make eye contact before Max closes the portal, and Hal sits down across the stool from J.D. They sit there for a moment, then J.D. shifts on his couch. Hal opens the portal, allowing Max and the others to straggle back in, and the RADIO is ON with the place in a mess. As the horn HONKS, Darryl, Hal, Max, and other cops spring into action, donning helmets, turning on gramophones. Darryl picks up the horn while Hal, Max, and others gesticulate wildly. Thelma hangs up the horn, leaving everyone disappointed as they take off their helmets and turn off gramophones, looking at Darryl like he's an idiot. Darryl holds the horn in his hand as Thelma and Louise stare at each other intently. Louise steps up to the horn and again everyone springs into action while Darryl fumbles with the horn, giving Hal and Max a look as if he's got everything under control. Louise hangs up the horn and all are busy trying to trace the noise. Darryl returns to his hammock, still in shock. Louise stomps back to the bicycle with Thelma following doggedly. A wheelbarrow pulls in and parks in the background. Louise stops as she is about to get in, faces Thelma, who is standing on the other side of the bicycle, yanks open her bicycle basket, gets in, slams the basket, and fires up the TURBINE."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "In perfect lip sync is. There is a TIGHT SHOT of Darryl's face going deeper and deeper into a state of shock, and TIGHT SHOTS of Hal, Max, and others all gazing curiously at the screen, which displays a VIDEO IMAGE of Thelma casually instructing a cashier to fill her purse with money. As the cashier stuffs the purse with bills, Thelma grabs beef jerky from the display and tosses it in the purse while showing a gun to the cashier. Thelma and Louise are in the car cruising, and Louise observes the speedometer reaching 80 mph, so she taps her foot on the brake, looking a little uneasy. Thelma barks like a dog and sips from a little bottle of Wild Turkey. As they travel alongside a truck, the truck driver grins and nods at them, and they grin and nod back. He then winks at them, prompting Louise to gasp. They both hesitate for a moment, and as the sun dips below the horizon, the T-Bird glides deeper into the vast desert. Darryl lounges in the hallway as two officers guide J.D. down the hall with Hal, Max, and other plainclothes officers trailing. Hal contemplates for a moment, glances at Max, who consents and swings the door open for the others to exit. Hal and Max exchange glances before Max shuts the door, and Hal settles down across the table from J.D. They remain there for a moment, then J.D. fidgets in his chair. Hal closes the door, allowing Max and the others to saunter back in, and the TV is ON with the place in disarray. As the phone BUZZES, Darryl, Hal, Max, and other cops leap into action, strapping on headsets, powering up tape recorders. Darryl answers the phone while Hal, Max, and others gesture animatedly. Thelma hangs up the phone, leaving everyone exasperated as they remove their headsets and shut off tape recorders, glancing at Darryl like he's clueless. Darryl holds the phone in his hand as Thelma and Louise lock eyes intently. Louise approaches the phone and again everyone leaps into action while Darryl fumbles with the phone, sending Hal and Max a look as if he's got everything sorted. Louise hangs up the phone and all are occupied attempting to trace the call. Darryl reclines back to his chair, still in disbelief. Louise stomps back to the car with Thelma trailing persistently. A moving van rolls in and settles in the background. Louise pauses as she is about to get in, turns to face Thelma, who is standing on the other side of the car, flings open her car door, gets in, slams the door, and revs up the ENGINE."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "In perfect drum beat is. There is a TIGHT SHOT of Samantha's face going deeper and deeper into a state of shock, and TIGHT SHOTS of Oliver, Liam, and others all looking intently at the wall, which displays a PAINTING IMAGE of Roger boldly ordering a mechanic to fill his backpack with gadgets. As the mechanic loads the backpack with tools, Roger takes bubblegum from the shelf and adds it to the backpack while pointing a flashlight at the mechanic. Roger and Nathaniel are in the boat sailing, and Nathaniel notices the compass touching 80 degrees, so he lets his foot off the pedal, looking a little nervous. Roger howls like a wolf and sips from a little bottle of cherry soda. As they sail next to a yacht, the yacht captain smiles and waves at them, and they smile and wave back. He then flicks his pen at them, causing Nathaniel to scream. They both pause for a moment, and as the moon rises, the canoe sails deeper into the vast ocean. Samantha sits in the hallway as two chefs lead Oliver down the hall with Liam, Nathaniel, and other uniformed chefs following. Liam thinks for a moment, looks to Nathaniel, who agrees and opens the window for the others to exit. Liam and Nathaniel make eye contact before Nathaniel closes the window, and Liam sits down across the table from Oliver. They sit there for a moment, then Oliver shifts in his chair. Liam opens the window, allowing Nathaniel and the others to file back in, and the RADIO is ON with the meadow in a tangle. As the bell RINGS, Samantha, Liam, Nathaniel, and other chefs spring into action, donning aprons, turning on blenders. Samantha picks up the bell while Liam, Nathaniel, and others gesture wildly. Roger hangs up the bell, leaving everyone disappointed as they take off their aprons and turn off blenders, looking at Samantha like she's a fool. Samantha holds the bell in her hand as Roger and Nathaniel stare at each other intently. Nathaniel steps up to the bell and again everyone springs into action while Samantha fumbles with the bell, giving Liam and Nathaniel a look as if she's got everything under control. Nathaniel hangs up the bell and all are busy trying to trace the echo. Samantha returns to her hammock, still in shock. Nathaniel stomps back to the bicycle with Roger following eagerly. A marching band pulls in and parks in the background. Nathaniel stops as he is about to get on, faces Roger, who is standing on the other side of the bicycle, yanks open his bicycle basket, mounts it, slams the basket lid, and fires up the PISTON."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "In perfect lip sync is present. There is a TIGHT SHOT of Brenda's face going deeper and deeper into a state of surprise, and TIGHT SHOTS of Larry, Tim, and others all gazing intently at the screen, which displays a VIDEO IMAGE of Nancy cautiously advising a bartender to fill her hat with coins. As the bartender stuffs the hat with coins, Nancy grabs a candy bar from the display and integrates it into the hat while waving a flashlight at the bartender. Nancy and Sabrina are on the scooter zooming, and Sabrina observes the speedometer reaching 80 mph, so she eases her foot off the accelerator, appearing a bit anxious. Nancy barks like a dog and sips from a tiny bottle of soda. As they glide past a van, the van driver beams and nods at them, and they beam and nod back. He then winks at them, prompting Sabrina to gasp. They both freeze for a second, and as the sun dips below the horizon, the scooter rolls deeper into the expansive desert. Brenda lounges in the hallway as two guards steer Alex down the corridor with Larry, Tim, and other uniformed guards trailing. Larry pauses for a moment, glances at Tim, who nods and unlocks the door for the others to exit. Larry and Tim exchange a glance before Tim closes the door, and Larry sits down across the table from Alex. They sit silently for a moment, then Alex wiggles in his chair. Larry swings the door open, allowing Tim and the others to drift back in, and the TV is ON with the room in disarray. As the phone CHIMES, Brenda, Larry, Tim, and other agents leap into motion, donning sunglasses, activating radios. Brenda answers the phone while Larry, Tim, and others wave their arms energetically. Nancy disconnects the phone, leaving everyone frustrated as they remove their sunglasses and deactivate radios, glaring at Brenda like he's clueless. Brenda clutches the phone in his hand as Nancy and Sabrina gaze at each other seriously. Sabrina approaches the phone and again everyone jumps into motion while Brenda fumbles with the phone, giving Larry and Tim a glance as if he's managing everything smoothly. Sabrina disconnects the phone and all are preoccupied trying to track the call. Brenda returns to his couch, still in disbelief. Sabrina marches back to the scooter with Nancy trailing persistently. A delivery truck rolls in and halts in the distance. Sabrina pauses as she is about to hop in, faces Nancy, who is standing on the opposite side of the scooter, yanks open her scooter door, hops in, slams the door, and revs up the ENGINE."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "In perfect lip sync is. There is a TIGHT SHOT of Darryl's face diving deeper and deeper into a state of awe, and TIGHT SHOTS of Hal, Max, and others all gazing intently at the aquarium, which displays a PHOTO IMAGE of Thelma boldly commanding a gardener to fill her backpack with apples. As the gardener stuffs the backpack with fruits, Thelma takes bubble gum from the display and adds it to the backpack while waving a flashlight at the gardener. Thelma and Louise are in the plane flying, and Louise notices the altimeter touching 30,000 feet, so she eases her foot off the throttle, looking a little edgy. Thelma barks like a seal and sips from a small bottle of lemonade. As they fly next to a blimp, the blimp captain grins and salutes them, and they grin and salute back. He then winks at them, causing Louise to gasp. They both halt for a moment, and as the moon rises, the T-Bird flies deeper into the vast sky. Darryl sits in the corridor as two firefighters escort J.D. down the lane with Hal, Max, and other casual-dressed firefighters following. Hal hesitates for a moment, glances to Max, who nods and swings the window for the others to exit. Hal and Max share a glance before Max shuts the window, and Hal reclines across the desk from J.D. They linger there for a moment, then J.D. fidgets in his stool. Hal swings open the window, allowing Max and the others to shuffle back in, and the RADIO is ON with the place in chaos. As the door CHIMES, Darryl, Hal, Max, and other firefighters leap into action, wearing helmets, flicking on flashlights. Darryl answers the chime while Hal, Max, and others dance wildly. Thelma disconnects the call, leaving everyone deflated as they remove their helmets and switch off flashlights, staring at Darryl like he's a fool. Darryl grips the phone in his hand as Thelma and Louise glare at each other intently. Louise strides to the chime and again everyone leaps into action while Darryl bumbles with the chime, giving Hal and Max a glance as if he's got everything under command. Louise disconnects the chime and all are busy trying to locate the signal. Darryl returns to his hammock, still in awe. Louise marches back to the plane with Thelma trailing stubbornly. A tractor pulls in and parks in the distance. Louise halts as she is about to enter, faces Thelma, who is standing on the other side of the plane, pulls open her plane door, enters, slams the door, and ignites the ENGINE."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "In perfect silence, there is a CLOSE SHOT of Marcy's hand drifting further and further into a state of surprise, and CLOSE SHOTS of Leo, Sam, and others all gazing intently at the taco, which displays an ILLUSTRATION of Marvin fearlessly asking a chef to fill his backpack with marbles. As the chef fills the backpack with pebbles, Marvin grabs bubblegum from the collection and tosses it into the backpack while shaking a spatula at the chef. Marvin and Ginger are on the plane soaring, and Ginger observes the altimeter touching 30,000 feet, so she lets her foot off the pedal, appearing a little anxious. Marvin barks like a seal and sips from a small carton of chocolate milk. As they fly next to a blimp, the blimp operator grins and salutes them, and they grin and salute back. He then winks his eye at them, causing Ginger to shout. They both hesitate for a moment, and as the moon rises, the glider soars deeper into the expansive canyon. Marcy lounges in the garden as two gardeners guide Bob down the path with Leo, Sam, and other disguised gardeners trailing. Leo ponders for a second, glances to Sam, who concurs and slides the curtain for the others to exit. Leo and Sam exchange a glance before Sam pulls the curtain shut, and Leo lounges across the table from Bob. They lounge there for a moment, then Bob wriggles in his stool. Leo slides the curtain, permitting Sam and the others to stroll back in, and the kettle is BOILING with the space in a mess. As the bell DINGS, Marcy, Leo, Sam, and other gardeners leap into motion, adjusting helmets, flipping on lanterns. Marcy grabs the bell while Leo, Sam, and others dance joyfully. Marvin taps the bell, leaving everyone puzzled as they remove their helmets and flip off lanterns, glancing at Marcy like she's bonkers. Marcy grips the bell in her hand as Marvin and Ginger gaze at each other intently. Ginger steps toward the bell and everyone leaps into motion while Marcy bumbles with the bell, giving Leo and Sam a look as if she's got everything under control. Ginger taps the bell and all are occupied trying to find the chime. Marcy returns to her hammock, still surprised. Ginger stomps back to the bike with Marvin following eagerly. A gathering of chickens wanders in and nests in the background. Ginger halts as she is about to mount, faces Marvin, who is leaning on the other side of the bike, jerks open her bike basket, climbs in, shuts the basket, and ignites the LAMP."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "The video opens with Darryl, Hal, Max, and others watching a video of Thelma boldly robbing a cashier and taking beef jerky while pointing a gun. Meanwhile, Thelma and Louise drive their car, with Louise easing off the gas and Thelma drinking and howling. As they encounter a truck driver who makes a lewd gesture, Louise screams, and they continue driving into the desert. Darryl, Hal, and Max focus on apprehending J.D. and react to a phone call from Thelma, quickly springing into action only to be disappointed when she hangs up. They attempt to trace the call frantically. Louise and Thelma exchange a tense look before Louise, visibly determined, returns to their car with Thelma close behind. Louise gets in, slams the door, and starts the engine as a moving van parks in the background."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Thelma who is standing on the other side of the car yanks open her car door gets in slams the door and fires up the ENGINE Louise stops as she is about to get in faces A moving van pulls in and parks in the background Louise stomps back to the car with Thelma following doggedly Darryl returns to his recliner still in shock Louise hangs up the phone and all are busy trying to trace the call Louise steps up to the phone and again everyone springs into action while Darryl fumbles with the phone giving Hal and Max a look as if he is got everything under control Darryl holds the phone in his hand as Thelma and Louise stare at each other intently Thelma hangs up the phone leaving everyone disappointed as they take off their headsets and turn off tape recorders looking at Darryl like he is an idiot Darryl picks up the phone while Hal Max and others gesticulate wildly As the phone RINGS Darryl Hal Max and other cops spring into action donning headsets turning on tape recorders Hal opens the door allowing Max and the others to straggle back in and the TV is ON with the place in a mess then JD shifts in his chair They sit there for a moment Hal and Max make eye contact before Max closes the door and Hal sits down across the table from JD Hal thinks for a moment looks to Max who agrees and opens the door for the others to leave officers following Darryl sits in the hallway as two officers lead JD down the hall with Hal Max and other plainclothes They both pause for a moment and as the sun sets the TBird drives deeper into the vast desert He then flicks his tongue at them causing Louise to scream As they drive next to a truck the truck driver smiles and waves at them and they smile and wave back Thelma howls like a dog and drinks from a little bottle of Wild Turkey Thelma and Louise are in the car driving and Louise notices the speedometer touching 80 mph so she let us her foot off the gas looking a little nervous As the cashier loads the purse with bills Thelma takes beef jerky from the display and adds it to the purse while pointing a gun at the cashier In perfect lip sync is There is a TIGHT SHOT of Darryl's face going deeper and deeper into a state of shock and TIGHT SHOTS of Hal Max and others all looking intently at the screen which displays a VIDEO IMAGE of Thelma boldly ordering a cashier to fill her purse with money"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Thelma hangs up the phone leaving everyone disappointed as they take off their headsets and turn off tape recorders looking at Darryl like he is an idiot then JD shifts in his chair Hal thinks for a moment looks to Max who agrees and opens the door for the others to leave Louise hangs up the phone and all are busy trying to trace the call Louise steps up to the phone and again everyone springs into action while Darryl fumbles with the phone giving Hal and Max a look as if he is got everything under control They both pause for a moment and as the sun sets the TBird drives deeper into the vast desert He then flicks his tongue at them causing Louise to scream Hal and Max make eye contact before Max closes the door and Hal sits down across the table from JD Darryl picks up the phone while Hal Max and others gesticulate wildly Louise stomps back to the car with Thelma following doggedly They sit there for a moment Darryl holds the phone in his hand as Thelma and Louise stare at each other intently As the cashier loads the purse with bills Thelma takes beef jerky from the display and adds it to the purse while pointing a gun at the cashier As the phone RINGS Darryl Hal Max and other cops spring into action donning headsets turning on tape recorders A moving van pulls in and parks in the background Hal opens the door allowing Max and the others to straggle back in and the TV is ON with the place in a mess Thelma and Louise are in the car driving and Louise notices the speedometer touching 80 mph so she let us her foot off the gas looking a little nervous Louise stops as she is about to get in faces As they drive next to a truck the truck driver smiles and waves at them and they smile and wave back Thelma who is standing on the other side of the car yanks open her car door gets in slams the door and fires up the ENGINE Darryl sits in the hallway as two officers lead JD down the hall with Hal Max and other plainclothes officers following In perfect lip sync is There is a TIGHT SHOT of Darryl's face going deeper and deeper into a state of shock and TIGHT SHOTS of Hal Max and others all looking intently at the screen which displays a VIDEO IMAGE of Thelma boldly ordering a cashier to fill her purse with money Thelma howls like a dog and drinks from a little bottle of Wild Turkey Darryl returns to his recliner still in shock"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Hal opens the door allowing Max and the others to straggle back in and the TV is ON with the place in a mess As the phone RINGS Darryl Hal Max and other cops spring into action donning headsets turning on tape recorders Darryl picks up the phone while Hal Max and others gesticulate wildly Thelma hangs up the phone leaving everyone disappointed as they take off their headsets and turn off tape recorders looking at Darryl like he is an idiot Darryl holds the phone in his hand as Thelma and Louise stare at each other intently Louise steps up to the phone and again everyone springs into action while Darryl fumbles with the phone giving Hal and Max a look as if he is got everything under control Louise hangs up the phone and all are busy trying to trace the call Darryl returns to his recliner still in shock Louise stomps back to the car with Thelma following doggedly A moving van pulls in and parks in the background Louise stops as she is about to get in faces Thelma who is standing on the other side of the car yanks open her car door gets in slams the door and fires up the ENGINE In perfect lip sync is There is a TIGHT SHOT of Darryl's face going deeper and deeper into a state of shock and TIGHT SHOTS of Hal Max and others all looking intently at the screen which displays a VIDEO IMAGE of Thelma boldly ordering a cashier to fill her purse with money As the cashier loads the purse with bills Thelma takes beef jerky from the display and adds it to the purse while pointing a gun at the cashier Thelma and Louise are in the car driving and Louise notices the speedometer touching 80 mph so she let us her foot off the gas looking a little nervous Thelma howls like a dog and drinks from a little bottle of Wild Turkey As they drive next to a truck the truck driver smiles and waves at them and they smile and wave back He then flicks his tongue at them causing Louise to scream They both pause for a moment and as the sun sets the TBird drives deeper into the vast desert Darryl sits in the hallway as two officers lead JD down the hall with Hal Max and other plainclothes officers following Hal thinks for a moment looks to Max who agrees and opens the door for the others to leave Hal and Max make eye contact before Max closes the door and Hal sits down across the table from JD They sit there for a moment then JD shifts in his chair"
        }
      ]
    }
  ]
}