{
  "ground_truth": "As he reaches the door and turns to look back at her, Alyssa pounces on him, grabs his face, and locks lips with him, big time. He drops his keys and embraces her. There they stand, by the side of the road, drenched, kissing. Banky carries a bag in one arm and pulls out his keys with the other. He picks up the mail on the floor and jams them into the lock, opening the door. He closes the door behind him and shuffles to the kitchenette, passing by the blanket-covered, slumbering forms of Holden and Alyssa, who are out cold in each other's arms. The place looks a mess - like a couple of people were engaged in some tremendous activity. Then he freezes. He looks down again, and drops his jaw and his carton of choco, which hits the floor with a pop. They look at one another, then at the flabbergasted Banky. Holden and Alyssa shoot straight up, eyes struggling to focus. Banky blinks, then shuffles toward the door again and lets himself out. Banky sits on a curb, staring into the distance; Holden saunters up and sits beside him. He follows Banky's gaze, and Banky shoots him a glare before walking away. Holden shakes his head. At an all-girl gathering, Tory, Nica, Dalia, and Jane help Alyssa finish an issue of 'Idiosyncratic Routine'. Tory letters a page, while Nica and Dalia lay-out the artwork, and Dalia drinks wine. Alyssa buries her face, giggling, and they all cackle. Alyssa tries to laugh with them, but Dalia stares at her suspiciously. All four girls stare at Alyssa, a bit horrified. Holden and Alyssa lie in each other's arms, moonlight bathing them. She smokes, and Holden looks down at a book, shakes his head at Banky, and flips it open to a page showing Alyssa's senior year photo. Cut to Cohee Lundon in the parking lot of Food City, addressing the camera. Back in the office, Holden stares at Banky, grabs him, and pins him against the wall, then releases him. Banky brushes himself off. Holden and Hooper peruse laser discs when a young black kid approaches Hooper, holding a comic book, and after the kid leaves, Hooper slips back into his real voice. On the ice, players skid into the corner, and the crowd around Alyssa and Holden goes wild. Player One checks Player Two into the boards hard; Alyssa is into the game. Player Two scrambles to his feet, throws down his gloves, pulls Player One's helmet off, and punches him in the face before yanking at Player One's jersey and gut punching him. Holden's face looks really sour. On the ice, Player One staggers a bit, quickly rights his jersey, and lunges at Player Two, landing a barrage of his own punches.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "As he arrives at the entrance and rotates to glance back at her, Alyssa leaps on him, seizes his visage, and locks lips with him, big time. He lets fall his keys and hugs her. There they stand, by the side of the street, drenched, kissing. Banky totes a sack in one limb and extracts his keys with the other. He picks up the post on the ground and thrusts them into the lock, opening the entrance. He shuts the entrance behind him and shuffles to the kitchenette, passing by the blanket-covered, slumbering shapes of Holden and Alyssa, who are out cold in each other's embrace. The place appears a mess - like a couple of individuals were engaged in some tremendous activity. Then he halts. He glances down again, and drops his jaw and his carton of choco, which strikes the ground with a pop. They gaze at one another, then at the flabbergasted Banky. Holden and Alyssa shoot straight up, eyes struggling to focus. Banky blinks, then shuffles toward the entrance again and lets himself out. Banky sits on a curb, staring into the distance; Holden strolls up and sits beside him. He follows Banky's gaze, and Banky shoots him a glare before walking away. Holden shakes his head. At an all-girl gathering, Tory, Nica, Dalia, and Jane help Alyssa finish an issue of 'Idiosyncratic Routine'. Tory letters a sheet, while Nica and Dalia lay-out the artwork, and Dalia sips wine. Alyssa buries her visage, giggling, and they all cackle. Alyssa tries to laugh with them, but Dalia gazes at her suspiciously. All four girls gaze at Alyssa, a bit horrified. Holden and Alyssa lie in each other's embrace, moonlight bathing them. She smokes, and Holden glances down at a tome, shakes his head at Banky, and flips it open to a sheet showing Alyssa's senior year photo. Cut to Cohee Lundon in the parking lot of Food City, addressing the camera. Back in the office, Holden stares at Banky, seizes him, and pins him against the wall, then releases him. Banky brushes himself off. Holden and Hooper peruse laser discs when a young black kid approaches Hooper, holding a comic book, and after the kid leaves, Hooper slips back into his real voice. On the ice, athletes skid into the corner, and the crowd around Alyssa and Holden goes wild. Athlete One checks Athlete Two into the boards hard; Alyssa is into the game. Athlete Two scrambles to his feet, throws down his gloves, pulls Athlete One's helmet off, and punches him in the visage before yanking at Athlete One's jersey and gut punching him. Holden's visage appears really sour. On the ice, Athlete One staggers a bit, quickly rights his jersey, and lunges at Athlete Two, landing a barrage of his own punches."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "As the door is reached by him and he turns to look back at her, Alyssa pounces on him, his face is grabbed by her, and lips are locked with him, big time. The keys are dropped by him, and she is embraced by him. There they stand, by the side of the road, drenched, kissing. A bag is carried by Banky in one arm, and his keys are pulled out with the other. The mail is picked up by him on the floor and jammed into the lock, opening the door. The door is closed behind him by him, and the kitchenette is shuffled to, passing by the blanket-covered, slumbering forms of Holden and Alyssa, who lie out cold in each other's arms. The place looks a mess - like some tremendous activity has been engaged in by a couple of people. Then he freezes. He looks down again, and his jaw and his carton of choco are dropped by him, which hits the floor with a pop. At one another, they look, then at Banky, who is flabbergasted. Holden and Alyssa shoot straight up, their eyes struggling to focus. Banky blinks, then the door is shuffled toward again by him, and he lets himself out. Banky sits on a curb, staring into the distance; Holden saunters up and sits beside him. Banky's gaze is followed by him, and a glare is shot at him by Banky before walking away. Holden shakes his head. At an all-girl gathering, Alyssa is helped by Tory, Nica, Dalia, and Jane to finish an issue of 'Idiosyncratic Routine'. A page is lettered by Tory, while the artwork is laid-out by Nica and Dalia, and wine is drunk by Dalia. Alyssa's face is buried by her, giggling, and cackling is done by all. Alyssa tries to laugh with them, but she is suspiciously stared at by Dalia. Alyssa is stared at by all four girls, a bit horrified. In each other's arms, Holden and Alyssa lie, moonlight bathing them. She smokes, and a book is looked down at by Holden, his head is shaken at Banky, and it is flipped open to a page showing Alyssa's senior year photo. Cut to Cohee Lundon in the parking lot of Food City, who addresses the camera. Back in the office, Banky is stared at by Holden, who grabs him, pins him against the wall, then releases him. Banky brushes himself off. Laser discs are perused by Holden and Hooper when a young black kid approaches Hooper, holds a comic book, and after the kid leaves, Hooper slips back into his real voice. On the ice, players skid into the corner, and Alyssa and Holden's surrounding crowd goes wild. Player One checks Player Two into the boards hard; the game is enjoyed by Alyssa. Player Two scrambles to his feet, throws down his gloves, pulls off Player One's helmet, and punches him in the face before he yanks at Player One's jersey and gut-punches him. Holden's face looks really sour. On the ice, Player One staggers a bit, quickly rights his jersey, and at Player Two lunges, landing a barrage of his own punches."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "As he reaches the door and looks back, Alyssa jumps on him, grabs his face, and kisses him passionately. He drops his keys, embraces her, and they stand on the roadside, drenched and kissing. Banky, carrying a bag, retrieves his keys, picks up the mail, and opens the door. Inside, he passes the sleeping forms of Holden and Alyssa, embracing amidst a messy room. He freezes, drops his jaw and choco carton. They look at each other, then at the stunned Banky, who blinks and leaves. Banky sits on a curb, staring; Holden joins him. After a glare from Banky, Holden shakes his head as Banky departs. At an all-girl gathering, Tory, Nica, Dalia, and Jane help Alyssa with 'Idiosyncratic Routine'. Tory letters, Nica and Dalia arrange artwork, and Dalia drinks wine. Alyssa giggles, and they all laugh, though Dalia eyes her suspiciously. The girls are shocked as they stare at Alyssa. Holden and Alyssa lie under moonlight. She smokes while Holden examines a book, seeing Alyssa's senior photo, and shakes his head at Banky. Cohee Lundon addresses the camera in a Food City parking lot. Back at the office, Holden pins Banky against a wall before releasing him. Holden and Hooper browse laser discs when a young black kid shows Hooper a comic; after the kid leaves, Hooper drops his facade. During a game, Alyssa and Holden are in the crowd as players clash. Player One checks Player Two, who retaliates by punching and yanking Player One's jersey. Holden looks displeased. Player One regains composure and counters Player Two with punches."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "As he reaches the door, Alyssa jumps on him, grabbing his face, and kisses him passionately. He drops his keys and embraces her, both drenched and kissing by the roadside. Banky holds a bag, retrieves his keys, collects the mail, and opens the door, passing the sleeping Holden and Alyssa in a messy room. He freezes, drops his jaw and choco carton. They glance at him, startled. Banky leaves and sits on the curb, staring distantly; Holden sits beside him. Banky glares, then walks away. Holden shakes his head. At an all-girl gathering, Tory, Nica, Dalia, and Jane assist Alyssa with 'Idiosyncratic Routine'. Tory letters, Nica and Dalia lay-out artwork, Dalia drinks wine. Alyssa giggles, but Dalia watches her suspiciously. All four girls are horrified. Holden and Alyssa lie together, moonlit, as she smokes and he shakes his head at Banky over a photo of Alyssa. Cohee Lundon addresses the camera in Food City's parking lot. In the office, Holden pins Banky against the wall, then releases him. Banky brushes off. Holden and Hooper browse laser discs; a young black kid approaches Hooper with a comic book, then leaves. Players skid on ice; Alyssa and Holden's crowd goes wild. Player One checks Player Two hard; Alyssa is engaged. Player Two punches and jersey-tugs Player One, who retaliates with his own punches, as Holden's face turns sour."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "As he approaches the door, he pauses momentarily and turns around to cast one last glance at her. At that very moment, Alyssa energetically leaps toward him, seizing his face with both hands, and they passionately engage in a profound kiss. In the process, he accidentally lets his keys slip from his fingers and, without hesitation, wraps his arms around her in a warm embrace. There they remain, standing by the roadside, completely soaked from the rain, yet fully immersed in their kiss. Meanwhile, Banky is casually carrying a bag in the crook of one arm while skillfully using his other hand to retrieve his keys. He dutifully picks up the scattered mail from the floor and inserts them into the lock, successfully opening the door. Once inside, he closes the door behind him and shuffles his way toward the kitchenette. As he moves, he passes by the blanket-covered figures of Holden and Alyssa, who are soundly asleep, wrapped in each other's arms. The place appears disorderly, with scattered items suggesting that a substantial amount of activity had taken place. Suddenly, Banky comes to an abrupt halt. He gazes downward, stunned, and his mouth drops open in disbelief, causing the carton of choco he was holding to slip from his grasp and hit the floor with a noticeable pop. The sleeping couple jolts awake, exchanging bewildered glances before shifting their attention to the astounded Banky. Holden and Alyssa quickly sit up straight, their eyes struggling to focus and comprehend the situation. Banky blinks in surprise before turning around and shuffling back toward the door, eventually letting himself out. Once outside, Banky settles onto a curb, his gaze fixed on the distance. Holden casually approaches and takes a seat beside him, following Banky's line of sight. Without uttering a word, Banky shoots him a disapproving glare before getting up and walking away. Holden simply shakes his head, reflecting on the encounter. As for the all-girl gathering, Tory, Nica, Dalia, and Jane are industriously assisting Alyssa in completing an issue of 'Idiosyncratic Routine.' Tory meticulously letters a page while Nica and Dalia meticulously arrange the artwork, and Dalia leisurely sips wine. Alyssa, unable to contain her amusement, buries her face in her hands, giggling, and the group erupts into joyous laughter. Although Alyssa attempts to join in the laughter, Dalia, with a hint of suspicion, eyes her closely. Soon, all four girls stare at Alyssa, a mix of horror and bewilderment etched on their faces. Later, Holden and Alyssa lie cocooned in each other's arms, bathed in the gentle moonlight. She leisurely smokes a cigarette while Holden, his attention on a book, shakes his head disapprovingly at Banky and flips it open to reveal a page displaying Alyssa's high school senior year photo. The scene cuts to Cohee Lundon standing in the parking lot of Food City, addressing the camera directly. Back at the office, Holden stares intensely at Banky, grabbing him with force and pressing him against the wall before eventually releasing him. Banky nonchalantly brushes himself off. Elsewhere, Holden and Hooper are engrossed in looking through laser discs when a young black boy approaches Hooper, holding a comic book. After the boy departs, Hooper reverts to using his natural voice. On the ice, players furiously skid into the corner as the crowd encircling Alyssa and Holden erupts with excitement. Player One aggressively checks Player Two into the boards with great force; Alyssa is fully engrossed in the action. Player Two quickly regains his footing, removes his gloves, tears off Player One's helmet, and delivers a punch to his face before vigorously pulling at Player One's jersey and delivering a forceful punch to his gut. Holden's expression turns incredibly sour. On the ice, Player One stumbles momentarily, quickly adjusts his jersey, and lunges at Player Two, launching a flurry of retaliatory punches."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "As he makes his way toward the door, he pauses for a brief moment and spins around to cast one final glance in her direction. At precisely that moment, Alyssa bounds forward with great energy, clasping his face with both her hands, and they passionately engage in a deeply meaningful kiss. In the fervor of the moment, he unintentionally lets his keys slip from his grip, and without a second thought, he envelops her in a warm and loving embrace. There they stand, positioned by the roadside, thoroughly drenched from the relentless rain, yet completely enveloped in their kiss.\n\nMeanwhile, Banky nonchalantly carries a bag nestled in the crook of one arm while deftly maneuvering his other hand to retrieve his keys. He conscientiously gathers the scattered mail from the floor and places them into the lock, managing to successfully open the door. Once inside, he closes the door behind him, making his way toward the kitchenette with small, shuffling steps. As he moves through the space, he passes by the blanket-covered forms of Holden and Alyssa, who are soundly asleep, wrapped securely in each other's arms. The place appears disheveled, with an array of scattered items indicating that an abundance of activity had occurred. Suddenly, Banky comes to a sudden stop. He lowers his gaze in astonishment, his mouth falling open in disbelief, causing the carton of chocolate he was holding to slip from his grasp and hit the floor with a noticeable pop.\n\nThe slumbering couple is jolted awake, exchanging bewildered glances before turning their attention to the stunned Banky. Holden and Alyssa quickly sit up straight, their eyes working to focus and comprehend the unexpected situation. Banky blinks in surprise before turning around and shuffling back toward the door, eventually letting himself out. Once outside, Banky settles down onto a curb, directing his gaze far into the distance. Holden approaches casually and takes a seat beside him, aligning his line of sight with Banky's. Without uttering a single word, Banky shoots him a disapproving glare before rising to his feet and walking away. Holden only shakes his head, reflecting on the peculiar encounter.\n\nAs for the lively all-girl gathering, Tory, Nica, Dalia, and Jane are industriously assisting Alyssa in completing an issue of 'Idiosyncratic Routine.' Tory meticulously letters a page while Nica and Dalia diligently arrange the artwork, and Dalia leisurely enjoys sipping wine. Alyssa, unable to contain her amusement, buries her face in her hands as laughter bubbles up within her, and the group erupts into joyful mirth. Although Alyssa attempts to join in the lively laughter, Dalia, with a hint of suspicion, keeps a careful eye on her. Soon, all four girls turn their gaze to Alyssa, a medley of horror and bewilderment clearly etched upon their faces.\n\nLater on, Holden and Alyssa lie cocooned in each other's arms, gently bathed by the tender glow of moonlight. She leisurely smokes a cigarette while Holden, his attention absorbed by a book, shakes his head disapprovingly at Banky and flips it open to reveal a page displaying Alyssa's high school senior year photo. The scene transitions to Cohee Lundon standing in the parking lot of Food City, addressing the camera directly. \n\nBack at the office, Holden fixes Banky with an intense stare, grabbing him with force and pressing him up against the wall before eventually releasing him from his grasp. Banky nonchalantly brushes himself off. In another setting, Holden and Hooper are thoroughly engrossed in browsing through laser discs when a young black boy approaches Hooper, holding a comic book. After the boy departs, Hooper reverts to speaking in his natural voice.\n\nOut on the ice, players are fiercely skidding into the corner as the crowd encircling Alyssa and Holden erupts with excitement. Player One forcefully checks Player Two into the boards with great intensity; Alyssa is fully engaged in the action. Player Two quickly regains his footing, removes his gloves, tears off Player One's helmet, and delivers a punch to his face before vigorously pulling at Player One's jersey and delivering a powerful punch to his gut. Holden's expression turns incredibly sour. On the ice, Player One stumbles momentarily, but quickly adjusts his jersey and lunges at Player Two, launching into a flurry of retaliatory punches."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "As he reaches the door, he slowly pivots to turn and glance back at her, allowing his eyes to meet Alyssa's before she energetically pounces forward, wrapping herself around him with enthusiasm. She swiftly grabs his face with both hands, pulling him closer, and passionately locks lips with him, completely immersing them both in the moment. In the heat of their embrace, he lets his keys slip from his grasp, letting them clatter to the ground, and instinctively wraps his arms around her. There they stand, soaked from head to toe, standing by the side of the road, deeply engaged in a long, lingering kiss. Meanwhile, Banky approaches with a bag casually slung over one arm while using his other hand to fish out his keys. With a quick, fluid motion, he bends down, scoops up the scattered mail on the floor, and deftly jams them into the lock, turning the key to gain entry. After stepping inside, he closes the door behind him with a soft click and shuffles toward the small kitchenette. As he makes his way through the living room, he notices the blanket-covered forms of Holden and Alyssa, fast asleep, wrapped in each other's arms. The room around them is in disarray, showing evidence of prior activity and chaos. Suddenly, he comes to a standstill, his body frozen in place as he takes in the scene before him. He glances down, eyes widening in shock, his jaw dropping open in disbelief. In his moment of surprise, the carton of choco slips from his hand, hitting the floor with a distinct pop. This unexpected noise snaps Holden and Alyssa awake, and they immediately sit up, blinking as they try to focus their eyes on the bewildered Banky. Banky, after a moment of staring, blinks slowly and then moves toward the door again, quietly letting himself out. Seated on a curb, Banky gazes into the distance, lost in thought. Holden approaches with a relaxed gait, settling beside him, his eyes following Banky's fixed stare. Banky responds with a sharp glare directed at Holden before standing up and walking away in frustration. Holden simply shakes his head, watching him go. At an all-girl gathering, Tory, Nica, Dalia, and Jane work together with Alyssa on completing an issue of 'Idiosyncratic Routine'. Tory meticulously letters a page, while Nica and Dalia focus on arranging the artwork; amid the hustle, Dalia takes a sip of her wine. Alyssa, unable to contain her amusement, hides her face, giggling, and soon they all burst into laughter. Trying to join in, Alyssa attempts to laugh along with them, but Dalia gives her a suspicious look, leading all four girls to stare at Alyssa with expressions that betray a mix of horror and disbelief. Elsewhere, Holden and Alyssa cuddle in each other's arms, moonlight streaming through, casting a gentle glow over them. While Alyssa takes a drag from her cigarette, Holden looks down at a book, briefly shaking his head in response to something about Banky, and then flips it open to a page displaying Alyssa's senior year photo. The scene shifts to Cohee Lundon standing in the parking lot of Food City, addressing the camera with confidence. Back in the office, Holden locks eyes with Banky, strides over with determination, and forcefully grabs him, pinning him against the wall with a burst of frustration, but then releases him, allowing Banky to brush himself off. Later, as Holden and Hooper browse through a collection of laser discs, a young black kid approaches Hooper, clutching a comic book. After the kid leaves, Hooper, in a moment of privacy, switches back to his real voice. Out on the ice, hockey players race toward the corner, and the crowd surrounding Alyssa and Holden erupts in wild excitement. Player One aggressively checks Player Two into the boards, and Alyssa's enthusiasm for the game is palpable. Player Two quickly scrambles to his feet, angrily throws down his gloves, and with a swift motion, rips off Player One's helmet, delivering a powerful punch to Player One's face before grabbing his jersey and landing a gut punch. Holden watches, his expression turning sour as the confrontation escalates. Meanwhile, on the ice, Player One regains his balance, adjusts his jersey back into place, and retaliates by lunging at Player Two, unleashing a flurry of punches."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "As he reaches the door and looks back at her, Alyssa suddenly kisses him passionately. He drops his keys and embraces her, and they stand by the roadside, drenched and kissing. Banky, carrying a bag, retrieves his keys and picks up the mail from the floor, unlocking and entering the apartment. He walks to the kitchenette, passing Holden and Alyssa asleep in each other's arms, amidst a disheveled room. Catching sight of something surprising, he freezes, dropping his drink as Holden and Alyssa wake up and exchange bewildered glances with Banky. Banky blinks, then exits the apartment. Sitting on a curb, he stares into the distance until Holden joins him. After an exchanged glance, Banky leaves, and Holden looks on. At an all-girl gathering, Tory, Nica, Dalia, and Jane assist Alyssa with her comic, 'Idiosyncratic Routine.' As they joke and laugh together, Dalia looks at Alyssa suspiciously. The mood shifts as all four women appear horrified while looking at Alyssa. Elsewhere, under moonlight, Holden and Alyssa lie together; she smokes while he reflects on her past using a yearbook photo. In the parking lot of Food City, Cohee Lundon speaks to the camera. Back in the office, Holden confronts Banky, pinning him against the wall before letting go. Banky regains composure, and later, Holden and Hooper browse laser discs when Hooper drops his facade after interacting with a young fan. At a hockey game, Alyssa and Holden watch as the crowd erupts in excitement. Tensions escalate on the ice as Player Two retaliates against Player One with a fight, thrilling Alyssa but souring Holden’s mood. Player One quickly recovers to return the punches in the ongoing brawl."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "As he reaches the door of their shared apartment and turns to look back at her, Alyssa pounces on him, grabs his face, and locks lips with him with a passion reminiscent of a dramatic movie scene. He drops his keys and embraces her. There they stand, by the side of the road in a quiet suburban neighborhood known for its tree-lined streets, drenched from the recent rain, kissing. Banky, who just returned from a late-night convenience store run, carries a bag in one arm and pulls out his keys with the other. He picks up the mail scattered on the floor, a collection of bills and one postcard from a friend traveling in Europe, and jams them into the lock, opening the door. He closes the door behind him and shuffles to the kitchenette, an area crowded with mismatched dishes and a perpetually humming fridge, passing by the blanket-covered, slumbering forms of Holden and Alyssa, who are out cold in each other's arms. The place looks a mess, reminiscent of a whirlwind party scene from a college frat house, like a couple of people were engaged in some tremendous activity. Then he freezes. He looks down again, and drops his jaw and his carton of choco, which hits the floor with a pop, splattering cheap tile with droplets of rich brown. They look at one another, then at the flabbergasted Banky. Holden and Alyssa shoot straight up, eyes struggling to focus with the weight of the unexpected morning. Banky blinks, then shuffles toward the door again and lets himself out into the crisp morning air. Banky sits on a curb by the local park, staring into the distance; Holden saunters up and sits beside him. He follows Banky's gaze, which is fixed on a nearby playground where children laugh and play, and Banky shoots him a glare before walking away, feeling the weight of unspoken words. Holden shakes his head. At an all-girl gathering, Tory, Nica, Dalia, and Jane help Alyssa finish an issue of 'Idiosyncratic Routine', a local zine gaining a cult following in indie circles. Tory, who has a knack for calligraphy, letters a page, while Nica and Dalia creatively lay-out the artwork, and Dalia sips a glass of red wine from a bottle brought by Jane. Alyssa buries her face, giggling, and they all cackle, the camaraderie echoing tales of long-standing friendships. Alyssa tries to laugh with them, but Dalia stares at her suspiciously, sensing something amiss. All four girls stare at Alyssa, a bit horrified, perhaps reflecting on a secret just revealed. Holden and Alyssa lie in each other's arms, moonlight bathing them through the small window above, casting shadows that dance across their faces. She smokes her favorite brand of menthol cigarettes, and Holden looks down at a book, shakes his head at Banky in absent thought, and flips it open to a page showing Alyssa's senior year photo from a local high school's yearbook. Cut to Cohee Lundon, a popular local news reporter, in the parking lot of Food City, addressing the camera about the recent community events. Back in the office, Holden stares at Banky, a moment fraught with tension, grabs him, and pins him against the wall, then releases him, their friendship tested but unbroken. Banky brushes himself off, maintaining his cool demeanor. Holden and Hooper, who moonlights as a comic book author, peruse laser discs in a retro shop, a nostalgic nod to a time past, when a young black kid, sporting a superhero t-shirt, approaches Hooper, holding a comic book, and after the kid leaves, Hooper slips back into his real voice, dropping the affectation he'd adopted earlier for show. On the ice, at a local hockey game known for its spirited fans, players skid into the corner, and the crowd around Alyssa and Holden goes wild, the clamor of die-hard sports enthusiasts reaching a fever pitch. Player One checks Player Two into the boards hard; Alyssa is into the game, her enthusiasm infectious. Player Two scrambles to his feet, throws down his gloves, pulls Player One's helmet off, and punches him in the face, a confrontation that reflects the high stakes nature of the match, before yanking at Player One's jersey and gut punching him. Holden's face looks really sour, perhaps recalling a past grievance with similar emotional intensity. On the ice, Player One staggers a bit, quickly rights his jersey, and lunges at Player Two, landing a barrage of his own punches, a physical exchange as raw as the emotions felt by the spectators."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Tory letters a page while Nica and Dalia layout the artwork and Dalia drinks wine As he reaches the door and turns to look back at her Alyssa pounces on him grabs his face and locks lips with him On the ice Player One staggers a bit quickly rights his jersey and lunges at Player Two landing a barrage of his own punches big time He drops his keys and embraces her There they stand by the side of the road drenched kissing Banky carries a bag in one arm and pulls out his keys with the other He picks up the mail on the floor and jams them into the lock opening the door He closes the door behind him and shuffles to the kitchenette passing by the blanketcovered slumbering forms of Holden and Alyssa who are out cold in each other's arms The place looks a mess  like a couple of people were engaged in some tremendous activity Banky sits on a curb staring into the distance Then he freezes He looks down again and drops his jaw and his carton of choco which hits the floor with a pop They look at one another then at the flabbergasted Banky Banky carries a bag in one arm and pulls out his keys with the other Holden and Alyssa shoot straight up eyes struggling to focus All four girls stare at Alyssa a bit horrified Banky blinks then shuffles toward the door again and let us himself out The place looks a mess  like a couple of people were engaged in some tremendous activity He drops his keys and embraces her big time Holden and Alyssa lie in each other's arms moonlight bathing them Banky sits on a curb staring into the distance Holden saunters up and sits beside him He follows Banky's gaze and Banky shoots him a glare before walking away Holden shakes his head At an allgirl gathering Tory Nica Dalia and Jane help Alyssa finish an issue of 'Idiosyncratic Routine' Tory letters a page while Nica and Dalia layout the artwork and Dalia drinks wine As he reaches the door and turns to look back at her Alyssa pounces on him grabs his face and locks lips with him Alyssa buries her face giggling and they all cackle Alyssa tries to laugh with them but Dalia stares at her suspiciously All four girls stare at Alyssa a bit horrified There they stand by the side of the road drenched kissing Holden and Hooper peruse laser discs when a young black kid approaches Hooper holding a comic book and after the kid leaves Hooper slips back into his real voice Holden and Alyssa lie in each other's arms moonlight bathing them She smokes and Holden looks down at a book shakes his head at Banky and flips it open to a page showing Alyssa's senior year photo Cut to Cohee Lundon in the parking lot of Food City addressing the camera Back in the office Holden stares at Banky grabs him and pins him against the wall then releases him Banky brushes himself off Holden and Hooper peruse laser discs when a young black kid approaches Hooper holding a comic book and after the kid leaves Hooper slips back into his real voice On the ice players skid into the corner and the crowd around Alyssa and Holden goes wild Player One checks Player Two into the boards hard Player Two scrambles to his feet throws down his gloves pulls Player One's helmet off and punches him in the face before yanking at Player One's jersey and gut punching him She smokes and Holden looks down at a book shakes his head at Banky and flips it open to a page showing Alyssa's senior year photo At an allgirl gathering Tory Nica Dalia and Jane help Alyssa finish an issue of 'Idiosyncratic Routine' Alyssa is into the game Holden's face looks really sour Alyssa is into the game Player Two scrambles to his feet throws down his gloves pulls Player One's helmet off and punches him in the face before yanking at Player One's jersey and gut punching him Holden's face looks really sour On the ice Player One staggers a bit quickly rights his jersey and lunges at Player Two landing a barrage of his own punches"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "As he reaches the door and turns to look back at her Alyssa pounces on him grabs his face and locks lips with him. big time. He drops his keys and embraces her. There they stand by the side of the road drenched kissing. Banky carries a bag in one arm and pulls out his keys with the other. He picks up the mail on the floor and jams them into the lock opening the door. He closes the door behind him and shuffles to the kitchenette passing by the blanketcovered slumbering forms of Holden and Alyssa who are out cold in each other's arms. The place looks a mess  like a couple of people were engaged in some tremendous activity. Then he freezes. He looks down again and drops his jaw and his carton of choco which hits the floor with a pop. They look at one another then at the flabbergasted Banky. Holden and Alyssa shoot straight up eyes struggling to focus. Banky blinks then shuffles toward the door again and let us himself out. Banky sits on a curb staring into the distance. Holden saunters up and sits beside him. He follows Banky's gaze and Banky shoots him a glare before walking away. Holden shakes his head. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. At an allgirl gathering Tory Nica Dalia and Jane help Alyssa finish an issue of 'Idiosyncratic Routine'. Tory letters a page while Nica and Dalia layout the artwork and Dalia drinks wine. Alyssa buries her face giggling and they all cackle. Alyssa tries to laugh with them but Dalia stares at her suspiciously. All four girls stare at Alyssa a bit horrified. Holden and Alyssa lie in each other's arms moonlight bathing them. She smokes and Holden looks down at a book shakes his head at Banky and flips it open to a page showing Alyssa's senior year photo. Cut to Cohee Lundon in the parking lot of Food City addressing the camera. Back in the office Holden stares at Banky grabs him and pins him against the wall then releases him. Banky brushes himself off. Holden and Hooper peruse laser discs when a young black kid approaches Hooper holding a comic book and after the kid leaves Hooper slips back into his real voice. On the ice players skid into the corner and the crowd around Alyssa and Holden goes wild. Player One checks Player Two into the boards hard. Alyssa is into the game. Player Two scrambles to his feet throws down his gloves pulls Player One's helmet off and punches him in the face before yanking at Player One's jersey and gut punching him. Holden's face looks really sour. On the ice Player One staggers a bit quickly rights his jersey and lunges at Player Two landing a barrage of his own punches."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "As he reaches the door and turns to look back at her Alyssa pounces on him grabs his face and locks lips with him. big time. He drops his keys and embraces her. There they stand by the side of the road drenched kissing. Banky carries a bag in one arm and pulls out his keys with the other. He picks up the mail on the floor and jams them into the lock opening the door. He closes the door behind him and shuffles to the kitchenette passing by the blanketcovered slumbering forms of Holden and Alyssa who are out cold in each other's arms. The place looks a mess  like a couple of people were engaged in some tremendous activity. Then he freezes. He looks down again and drops his jaw and his carton of choco which hits the floor with a pop. They look at one another then at the flabbergasted Banky. Holden and Alyssa shoot straight up eyes struggling to focus. Banky blinks then shuffles toward the door again and let us himself out. Banky sits on a curb staring into the distance. Holden saunters up and sits beside him. He follows Banky's gaze and Banky shoots him a glare before walking away. Holden shakes his head. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. At an allgirl gathering Tory Nica Dalia and Jane help Alyssa finish an issue of 'Idiosyncratic Routine'. Tory letters a page while Nica and Dalia layout the artwork and Dalia drinks wine. Alyssa buries her face giggling and they all cackle. Alyssa tries to laugh with them but Dalia stares at her suspiciously. All four girls stare at Alyssa a bit horrified. Holden and Alyssa lie in each other's arms moonlight bathing them. She smokes and Holden looks down at a book shakes his head at Banky and flips it open to a page showing Alyssa's senior year photo. Cut to Cohee Lundon in the parking lot of Food City addressing the camera. Back in the office Holden stares at Banky grabs him and pins him against the wall then releases him. Banky brushes himself off. Holden and Hooper peruse laser discs when a young black kid approaches Hooper holding a comic book and after the kid leaves Hooper slips back into his real voice. On the ice players skid into the corner and the crowd around Alyssa and Holden goes wild. Player One checks Player Two into the boards hard. Alyssa is into the game. Player Two scrambles to his feet throws down his gloves pulls Player One's helmet off and punches him in the face before yanking at Player One's jersey and gut punching him. Holden's face looks really sour. On the ice Player One staggers a bit quickly rights his jersey and lunges at Player Two landing a barrage of his own punches."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "As he reaches the door and turns to look back at her Alyssa pounces on him grabs his face and locks lips with him. big time. He drops his keys and embraces her. There they stand by the side of the road drenched kissing. Banky carries a bag in one arm and pulls out his keys with the other. He picks up the mail on the floor and jams them into the lock opening the door. He closes the door behind him and shuffles to the kitchenette passing by the blanketcovered slumbering forms of Holden and Alyssa who are out cold in each other's arms. The place looks a mess  like a couple of people were engaged in some tremendous activity. Then he freezes. Banky brushes himself off. Holden and Hooper peruse laser discs when a young black kid approaches Hooper holding a comic book and after the kid leaves Hooper slips back into his real voice. On the ice players skid into the corner and the crowd around Alyssa and Holden goes wild. Player One checks Player Two into the boards hard. Alyssa is into the game. Player Two scrambles to his feet throws down his gloves pulls Player One's helmet off and punches him in the face before yanking at Player One's jersey and gut punching him. Holden's face looks really sour. On the ice Player One staggers a bit quickly rights his jersey and lunges at Player Two landing a barrage of his own punches."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "As he reaches the door and turns to look back at her Alyssa pounces on him grabs his face and locks lips with him. big time. He drops his keys and embraces her. There they stand by the side of the road drenched kissing. Player Two scrambles to his feet throws down his gloves pulls Player One's helmet off and punches him in the face before yanking at Player One's jersey and gut punching him. Holden's face looks really sour. On the ice Player One staggers a bit quickly rights his jersey and lunges at Player Two landing a barrage of his own punches."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "As the dog reaches the door and turns to look back at the cat, the giraffe pounces on the dog, grabs the dog's face, and locks lips with the dog, big time. The elephant drops its keys and embraces the giraffe. There they stand, by the side of the road, drenched, kissing. The monkey carries a bag in one arm and pulls out its keys with the other. The monkey picks up the mail on the floor and jams them into the lock, opening the door. The monkey closes the door behind it and shuffles to the kitchenette, passing by the blanket-covered, slumbering forms of the kangaroo and the giraffe, who are out cold in each other's arms. The place looks a mess - like a couple of people were engaged in some tremendous activity. Then the monkey freezes. The monkey looks down again, and drops its jaw and its carton of choco, which hits the floor with a pop. They look at one another, then at the flabbergasted monkey. The kangaroo and the giraffe shoot straight up, eyes struggling to focus. The monkey blinks, then shuffles toward the door again and lets itself out. The monkey sits on a curb, staring into the distance; the kangaroo saunters up and sits beside the monkey. The kangaroo follows the monkey's gaze, and the monkey shoots the kangaroo a glare before walking away. The kangaroo shakes its head. At an all-girl gathering, the rabbit, the squirrel, the turtle, and the owl help the giraffe finish an issue of 'Idiosyncratic Routine'. The rabbit letters a page, while the squirrel and the turtle lay-out the artwork, and the turtle drinks wine. The giraffe buries its face, giggling, and they all cackle. The giraffe tries to laugh with them, but the turtle stares at the giraffe suspiciously. All four girls stare at the giraffe, a bit horrified. The kangaroo and the giraffe lie in each other's arms, moonlight bathing them. The cat smokes, and the kangaroo looks down at a book, shakes its head at the monkey, and flips it open to a page showing the giraffe's senior year photo. Cut to the penguin in the parking lot of Food City, addressing the camera. Back in the office, the kangaroo stares at the monkey, grabs the monkey, and pins it against the wall, then releases it. The monkey brushes itself off. The kangaroo and the fox peruse laser discs when a young black kid approaches the fox, holding a comic book, and after the kid leaves, the fox slips back into its real voice. On the ice, players skid into the corner, and the crowd around the giraffe and the kangaroo goes wild. Player Three checks Player Four into the boards hard; the giraffe is into the game. Player Four scrambles to its feet, throws down its gloves, pulls Player Three's helmet off, and punches Player Three in the face before yanking at Player Three's jersey and gut punching Player Three. The kangaroo's face looks really sour. On the ice, Player Three staggers a bit, quickly rights its jersey, and lunges at Player Four, landing a barrage of its own punches."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "As he reaches the gate and turns to look back at her, Alyssa leaps on him, grabs his shoulders, and locks lips with him, intensely. He drops his wallet and embraces her. There they stand, by the side of the river, drenched, kissing. Banky carries a briefcase in one arm and pulls out his sunglasses with the other. He picks up the magazines on the carpet and jams them into the latch, opening the wardrobe. He closes the wardrobe behind him and shuffles to the conservatory, passing by the sheet-covered, slumbering forms of Holden and Alyssa, who are out cold in each other's arms. The place looks a mess - like a couple of people were engaged in some tremendous activity. Then he freezes. He looks down again, and drops his jaw and his carton of juice, which hits the carpet with a splash. They look at one another, then at the flabbergasted Banky. Holden and Alyssa shoot straight up, eyes struggling to focus. Banky blinks, then shuffles toward the wardrobe again and lets himself out. Banky sits on a porch, staring into the distance; Holden saunters up and sits beside him. He follows Banky's gaze, and Banky shoots him a glare before walking away. Holden shakes his head. At an all-girl gathering, Tory, Nica, Dalia, and Jane help Alyssa finish an issue of 'Quirky Habits'. Tory paints a page, while Nica and Dalia piece together the photos, and Dalia drinks coffee. Alyssa buries her face, giggling, and they all cackle. Alyssa tries to laugh with them, but Dalia stares at her suspiciously. All four girls stare at Alyssa, a bit horrified. Holden and Alyssa lie in each other's arms, starlight bathing them. She plays a harmonica, and Holden looks down at a magazine, shakes his head at Banky, and flips it open to a page showing Alyssa's senior year artwork. Cut to Cohee Lundon in the parking lot of Grocery Kingdom, addressing the camera. Back in the library, Holden stares at Banky, grabs him, and pins him against the bookshelf, then releases him. Banky brushes himself off. Holden and Hooper browse vinyl records when a young black kid approaches Hooper, holding a graphic novel, and after the kid leaves, Hooper slips back into his real voice. On the rink, players slide into the corner, and the crowd around Alyssa and Holden goes wild. Player One tackles Player Two into the fence hard; Alyssa is into the game. Player Two scrambles to his feet, throws down his hat, pulls Player One's mask off, and punches him in the face before yanking at Player One's jacket and gut punching him. Holden's face looks really sour. On the rink, Player One staggers a bit, quickly rights his jacket, and lunges at Player Two, landing a barrage of his own punches."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "As he reaches the door and glances at her, Alyssa lunges toward him, clutches his shoulder, and whispers secrets to him, big time. He flings his keys and high-fives her. There they stand, by the side of the road, drenched, giggling. Banky balances a bag in one arm and fishes out his keys with the other. He scoops up the mail on the floor and tosses them at the lock, swinging the door open. He swings the door shut behind him and tiptoes to the kitchenette, bypassing the blanket-covered, snoozing forms of Holden and Alyssa, who are blissfully asleep in each other's arms. The place looks a mess - like a couple of people were involved in some tremendous activity. Then he halts. He glances down again and gasps, dropping his jaw and his carton of choco, which bursts on the floor with a pop. They glance at one another, then at the bewildered Banky. Holden and Alyssa leap straight up, eyes struggling to focus. Banky blinks, then tiptoes toward the door once more and slips out. Banky perches on a curb, contemplating the distance; Holden strolls up and perches beside him. He traces Banky's gaze, and Banky casts him a glare before striding away. Holden shrugs. At an all-girl gathering, Tory, Nica, Dalia, and Jane assist Alyssa in brainstorming an issue of 'Idiosyncratic Routine'. Tory sketches a page, while Nica and Dalia color in the artwork, and Dalia sips wine. Alyssa covers her face, chortling, and they all burst into laughter. Alyssa attempts to join in their laughter, but Dalia peers at her skeptically. All four girls gape at Alyssa, slightly shocked. Holden and Alyssa rest in each other's arms, moonlight enveloping them. She inhales on a cigarette, and Holden glances down at a book, rolls his eyes at Banky, and opens it to a page displaying Alyssa's senior year photo. Cut to Cohee Lundon in the parking lot of Food City, speaking to the camera. Back in the office, Holden gazes at Banky, pushes him, and presses him against the wall, then steps back. Banky brushes off his shirt. Holden and Hooper browse laser discs when a young black kid approaches Hooper, holding a comic book, and after the kid leaves, Hooper switches back to his real voice. On the ice, players glide into the corner, and the crowd around Alyssa and Holden cheers wildly. Player One nudges Player Two into the boards gently; Alyssa is engrossed in the game. Player Two scrambles to his feet, tosses his gloves, yanks Player One's helmet off, and pats him on the face before tugging at Player One's jersey and tickling him. Holden's face looks slightly amused. On the ice, Player One sways a bit, quickly adjusts his jersey, and leaps at Player Two, delivering a flurry of playful punches."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "As the toaster reaches the window and turns to look back at the chair, the elephant pounces on it, grabs its wheels, and locks lips with it, big time. The bookshelf drops its pencils and embraces the elephant. There they stand, by the side of the rainbow, drenched, kissing. The cactus carries a violin in one arm and pulls out its pencils with the other. The cactus picks up the dice on the floor and jams them into the bridge, opening the window. The cactus closes the window behind it and shuffles to the trellis, passing by the curtain-covered, slumbering forms of a dragon and the elephant, who are out cold in each other's arms. The castle looks a mess - like a couple of turtles were engaged in some tremendous activity. Then the cactus freezes. The cactus looks down again, and drops its jaw and its carton of feathers, which hits the floor with a pop. They look at one another, then at the flabbergasted cactus. The dragon and the elephant shoot straight up, eyes struggling to focus. The cactus blinks, then shuffles toward the window again and lets itself out. The cactus sits on a bike, staring into the clouds; the dragon saunters up and sits beside it. The dragon follows the cactus's gaze, and the cactus shoots it a glare before walking away. The dragon shakes its head. At an all-tree gathering, a fox, a squirrel, a frog, and a flamingo help the elephant finish a painting of 'Quirky Dance'. The fox letters a box, while the squirrel and frog lay-out the sculpture, and the frog drinks tea. The elephant buries its paws, giggling, and they all cackle. The elephant tries to laugh with them, but the frog stares at it suspiciously. All four trees stare at the elephant, a bit horrified. The dragon and the elephant lie in each other's arms, moonlight bathing them. The elephant cooks, and the dragon looks down at a spoon, shakes its head at the cactus, and flips it open to a page showing the elephant's senior year cupcake. Cut to a penguin in the garden of Flower Mart, addressing the telescope. Back in the dungeon, the dragon stares at the cactus, grabs it, and pins it against the curtain, then releases it. The cactus brushes itself off. The dragon and the lion peruse kites when a young green cat approaches the lion, holding a music note, and after the cat leaves, the lion slips back into its real voice. On the carpet, figures skid into the tree, and the crowd around the elephant and the dragon goes wild. Figure One checks Figure Two into the beans hard; the elephant is into the race. Figure Two scrambles to its feet, throws down its socks, pulls Figure One's hat off, and punches it in the elbow before yanking at Figure One's vest and gut punching it. The dragon's elbow looks really sour. On the carpet, Figure One staggers a bit, quickly rights its vest, and lunges at Figure Two, landing a barrage of its own punches."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "As she approaches the window and waves to gaze back at him, Ethan darts at her, tugs her hand, and locks elbows with her, emphatically. She drops her hat and tickles him. There they remain, by the edge of the garden, soaked, hugging. Dana hoists a basket in one arm and fishes out her glasses with the other. She picks up the newspaper on the table and slides them into the frame, opening the window. She closes the window behind her and ambles to the den, passing by the quilt-covered, snoozing forms of Carter and Ethan, who are sound asleep in each other's arms. The room looks chaotic - like a couple of people were engaged in some hearty merriment. Then she pauses. She glances down again, and drops her jaw and her mug of tea, which hits the floor with a clatter. They glance at one another, then at the speechless Dana. Carter and Ethan bolt upright, eyes struggling to adjust. Dana blinks, then ambles toward the window again and slips herself out. Dana reclines on a bench, gazing into the distance; Carter wanders up and reclines beside her. He follows Dana's gaze, and Dana shoots him a frown before strolling away. Carter shrugs. At an all-boys gathering, Kyle, Leo, Sam, and Mike assist Ethan in finishing an issue of 'Chaotic Habit'. Kyle sketches a character, while Leo and Sam arrange the layout, and Sam sips coffee. Ethan buries his face, chuckling, and they all guffaw. Ethan tries to laugh with them, but Sam watches him cautiously. All four boys gaze at Ethan, a bit shocked. Carter and Ethan relax in each other's arms, moonlight caressing them. He reads, and Ethan looks down at a newspaper, shrugs at Dana, and unfolds it to a section displaying Ethan's senior year picture. Cut to Stevie Benson in the alleyway of Market Plaza, narrating to the camera. Back in the study, Carter stares at Dana, grasps her, and pins her against the bookshelf, then releases her. Dana dusts herself off. Carter and Tanner browse vinyl records when a young girl approaches Tanner, holding a graphic novel, and after the girl leaves, Tanner switches back to his real accent. On the field, athletes glide into the middle, and the audience around Ethan and Carter goes wild. Athlete A checks Athlete B into the grass hard; Ethan is engaged in the match. Athlete B scrambles to his knees, tosses down his stick, pulls Athlete A's cap off, and slaps him in the cheek before tugging at Athlete A's jersey and kneeing him. Carter's expression looks really displeased. On the field, Athlete A stumbles a bit, quickly straightens his jersey, and charges at Athlete B, landing a series of his own swipes."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "As he approaches the window and turns to glance back at her, Alyssa bounds over him, seizes his shoulders, and plants a gentle kick on him, subtly. He tosses his wallet and hugs her gently. There they remain, by the edge of the field, soaking, laughing. Banky balances a package in one hand and fishes out his wallet with the other. He scoops up the newspaper on the carpet and slots them into the hinge, swinging the window open. He shuts the window behind him and tiptoes to the pantry, moving past the curtain-covered, snoozing figures of Holden and Alyssa, who are comfortable in each other's embrace. The room appears chaotic - like a group of people were immersed in some colossal event. Then he halts. He peers down again, and his jaw drops as he releases his carton of milk, which splashes onto the tiles with a fizz. They peer at each other, then at the bewildered Banky. Holden and Alyssa bolt straight up, eyes attempting to adjust. Banky blinks, then tiptoes toward the window again and eases himself out. Banky perches on a bench, gazing into the void; Holden strolls up and plops down beside him. He tracks Banky's view, and Banky gives him a scowl before wandering off. Holden shrugs. At an all-girl meet-up, Tory, Nica, Dalia, and Jane assist Alyssa in finishing a chapter of 'Quirky Patterns'. Tory sketches a page, while Nica and Dalia arrange the frames, and Dalia sips juice. Alyssa lowers her face, chuckling, and they all howl. Alyssa attempts to giggle with them, but Dalia eyes her cautiously. All four girls gape at Alyssa, somewhat appalled. Holden and Alyssa rest in each other's arms, starlight covering them. She sips coffee, and Holden glances down at a magazine, sighs at Banky, and flips it open to a page displaying Alyssa's senior year sketch. Cut to Cohee Lundon in the parking area of Food Mart, speaking to the camera. Back in the workspace, Holden glares at Banky, clutches him, and shoves him against the window, then releases him. Banky dusts himself off. Holden and Hooper browse vinyl records when a young black kid approaches Hooper, holding a graphic novel, and after the kid leaves, Hooper reverts to his usual tone. On the rink, players glide into the edge, and the crowd around Alyssa and Holden cheers. Player One nudges Player Two into the rails hard; Alyssa is engrossed in the match. Player Two rises to his knees, tosses down his stick, pulls Player One's boots off, and kicks him in the shin before tugging at Player One's scarf and kneeing him. Holden's face appears really dismayed. On the rink, Player One wobbles a bit, quickly fixes his scarf, and lunges at Player Two, delivering a flurry of his own kicks."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "As the bird reaches the gate and flips to glance back at the statue, Mona leaps onto the bird, grabs its wing, and links feathers with it, in a grand way. The bird drops its acorns and hugs the statue. There they hover, beside the path of the field, soaked, embracing. Charlie hauls a suitcase in one paw and extracts his acorns with the other. He scoops up the leaves on the ground and wedges them into the latch, unlocking the gate. He shuts the gate behind him and tiptoes to the shed, passing by the tarp-covered, snoozing figures of Mason and Mona, who are fast asleep in each other's branches. The space appears chaotic - as if a couple of creatures were involved in some colossal pursuit. Then he halts. He squints down once more, and drops his jaw and his box of cocoa, which clunks on the ground with a thud. They glance at each other, then at the astonished Charlie. Mason and Mona spring upright, eyes struggling to adjust. Charlie blinks, then tiptoes toward the gate again and lets himself out. Charlie perches on a bench, gazing into the horizon; Mason strolls up and perches beside him. He traces Charlie's stare, and Charlie shoots him a scowl before sauntering away. Mason sighs. At an all-dog fiesta, Piper, Lila, Reese, and Casey aid Mona in completing a volume of 'Peculiar Habit'. Piper scribes a sheet, while Lila and Reese arrange the illustrations, and Reese sips soda. Mona hides her beak, chuckling, and they all guffaw. Mona attempts to chuckle with them, but Reese peers at her skeptically. All four dogs gaze at Mona, a bit stunned. Mason and Mona rest in each other's branches, moonlight washing over them. She sips, and Mason glances down at a scroll, shakes his head at Charlie, and flips it open to a sheet revealing Mona’s final year sketch. Cut to Rainy Maleek in the garage of Grocery Mart, addressing the tripod. Back in the den, Mason glares at Charlie, seizes him, and pins him against the shelf, then releases him. Charlie dusts himself off. Mason and Hunter examine cassette tapes when a young green parrot approaches Hunter, clutching a magazine, and after the parrot departs, Hunter slips back into his authentic language. On the rink, skaters glide into the nook, and the assembly around Mona and Mason erupts. Skater One shoves Skater Two into the barriers firmly; Mona is engrossed in the contest. Skater Two scrambles to his paws, flings down his headgear, pulls Skater One's visor off, and slaps him on the beak before tugging at Skater One's coat and belly punching him. Mason’s expression appears quite sour. On the rink, Skater One stumbles a bit, quickly aligns his coat, and lunges at Skater Two, launching a series of his own slaps."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Alyssa kisses Holden passionately as he drops his keys, and they embrace on the street, drenched. Banky enters their messy apartment, finding them asleep together, and is shocked. He leaves abruptly, later sitting on a curb. Holden approaches, but Banky glares and walks away. At an all-girl gathering, Alyssa and friends work on a comic issue, with Dalia eyeing Alyssa suspiciously. That night, Alyssa and Holden lie in moonlit embrace; Holden reflects on Alyssa's past. Elsewhere, Cohee Lundon speaks to the camera at Food City. In the office, Holden confronts Banky and then releases him. At a hockey game, Alyssa is engaged while Holden seems displeased as a fight breaks out on the ice."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "On the ice Player One staggers a bit quickly rights his jersey and lunges at Player Two landing a barrage of his own punches Holden's face looks really sour Player Two scrambles to his feet throws down his gloves pulls Player One's helmet off and punches him in the face before yanking at Player One's jersey and gut punching him Alyssa is into the game Player One checks Player Two into the boards hard On the ice players skid into the corner and the crowd around Alyssa and Holden goes wild Holden and Hooper peruse laser discs when a young black kid approaches Hooper holding a comic book and after the kid leaves Hooper slips back into his real voice Banky brushes himself off Back in the office Holden stares at Banky grabs him and pins him against the wall then releases him Cut to Cohee Lundon in the parking lot of Food City addressing the camera She smokes and Holden looks down at a book shakes his head at Banky and flips it open to a page showing Alyssa's senior year photo Holden and Alyssa lie in each other's arms moonlight bathing them All four girls stare at Alyssa a bit horrified Alyssa tries to laugh with them but Dalia stares at her suspiciously Alyssa buries her face giggling and they all cackle Tory letters a page while Nica and Dalia layout the artwork and Dalia drinks wine At an allgirl gathering Tory Nica Dalia and Jane help Alyssa finish an issue of 'Idiosyncratic Routine' Holden shakes his head He follows Banky's gaze and Banky shoots him a glare before walking away Holden saunters up and sits beside him Banky sits on a curb staring into the distance Banky blinks then shuffles toward the door again and let us himself out Holden and Alyssa shoot straight up eyes struggling to focus They look at one another then at the flabbergasted Banky He looks down again and drops his jaw and his carton of choco which hits the floor with a pop Then he freezes The place looks a mess  like a couple of people were engaged in some tremendous activity He closes the door behind him and shuffles to the kitchenette passing by the blanketcovered slumbering forms of Holden and Alyssa who are out cold in each other's arms He picks up the mail on the floor and jams them into the lock opening the door Banky carries a bag in one arm and pulls out his keys with the other There they stand by the side of the road drenched kissing He drops his keys and embraces her big time As he reaches the door and turns to look back at her Alyssa pounces on him grabs his face and locks lips with him"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "He picks up the mail on the floor and jams them into the lock opening the door Alyssa buries her face giggling and they all cackle Alyssa tries to laugh with them but Dalia stares at her suspiciously Banky blinks then shuffles toward the door again and let us himself out Cut to Cohee Lundon in the parking lot of Food City addressing the camera On the ice players skid into the corner and the crowd around Alyssa and Holden goes wild He follows Banky's gaze and Banky shoots him a glare before walking away They look at one another then at the flabbergasted Banky Holden shakes his head Holden and Alyssa shoot straight up eyes struggling to focus Banky brushes himself off Holden saunters up and sits beside him Back in the office Holden stares at Banky grabs him and pins him against the wall then releases him He looks down again and drops his jaw and his carton of choco which hits the floor with a pop Then he freezes Player One checks Player Two into the boards hard He closes the door behind him and shuffles to the kitchenette passing by the blanketcovered slumbering forms of Holden and Alyssa who are out cold in each other's arms Holden and Alyssa lie in each other's arms moonlight bathing them As he reaches the door and turns to look back at her Alyssa pounces on him grabs his face and locks lips with him Holden's face looks really sour Banky sits on a curb staring into the distance Tory letters a page while Nica and Dalia layout the artwork and Dalia drinks wine He drops his keys and embraces her Player Two scrambles to his feet throws down his gloves pulls Player One's helmet off and punches him in the face before yanking at Player One's jersey and gut punching him Holden and Hooper peruse laser discs when a young black kid approaches Hooper holding a comic book and after the kid leaves Hooper slips back into his real voice All four girls stare at Alyssa a bit horrified There they stand by the side of the road drenched kissing She smokes and Holden looks down at a book shakes his head at Banky and flips it open to a page showing Alyssa's senior year photo Banky carries a bag in one arm and pulls out his keys with the other Alyssa is into the game On the ice Player One staggers a bit quickly rights his jersey and lunges at Player Two landing a barrage of his own punches At an allgirl gathering Tory Nica Dalia and Jane help Alyssa finish an issue of 'Idiosyncratic Routine' big time The place looks a mess  like a couple of people were engaged in some tremendous activity"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "At an allgirl gathering Tory Nica Dalia and Jane help Alyssa finish an issue of 'Idiosyncratic Routine' Tory letters a page while Nica and Dalia layout the artwork and Dalia drinks wine Alyssa buries her face giggling and they all cackle Alyssa tries to laugh with them but Dalia stares at her suspiciously All four girls stare at Alyssa a bit horrified Holden and Alyssa lie in each other's arms moonlight bathing them She smokes and Holden looks down at a book shakes his head at Banky and flips it open to a page showing Alyssa's senior year photo Cut to Cohee Lundon in the parking lot of Food City addressing the camera Back in the office Holden stares at Banky grabs him and pins him against the wall then releases him Banky brushes himself off Holden and Hooper peruse laser discs when a young black kid approaches Hooper holding a comic book and after the kid leaves Hooper slips back into his real voice On the ice players skid into the corner and the crowd around Alyssa and Holden goes wild Player One checks Player Two into the boards hard Alyssa is into the game Player Two scrambles to his feet throws down his gloves pulls Player One's helmet off and punches him in the face before yanking at Player One's jersey and gut punching him Holden's face looks really sour On the ice Player One staggers a bit quickly rights his jersey and lunges at Player Two landing a barrage of his own punches As he reaches the door and turns to look back at her Alyssa pounces on him grabs his face and locks lips with him big time He drops his keys and embraces her There they stand by the side of the road drenched kissing Banky carries a bag in one arm and pulls out his keys with the other He picks up the mail on the floor and jams them into the lock opening the door He closes the door behind him and shuffles to the kitchenette passing by the blanketcovered slumbering forms of Holden and Alyssa who are out cold in each other's arms The place looks a mess  like a couple of people were engaged in some tremendous activity Then he freezes He looks down again and drops his jaw and his carton of choco which hits the floor with a pop They look at one another then at the flabbergasted Banky Holden and Alyssa shoot straight up eyes struggling to focus Banky blinks then shuffles toward the door again and let us himself out Banky sits on a curb staring into the distance Holden saunters up and sits beside him He follows Banky's gaze and Banky shoots him a glare before walking away Holden shakes his head"
        }
      ]
    }
  ]
}