{
  "ground_truth": "By now, half the boat has been chopped up into matchwood, and the blades are getting closer; the wind of the blades is on their necks. Indy grabs Kazim just in time and jumps into the motorboat driven by Elsa, which gets alongside in the nick of time. Kazim pulls back his shirt to reveal a birthmark, or is it a tattoo? Whatever it is, it's a cruciform sword, a Christian cross that tapers down like the blades of a broadsword. The boat is close to the edge of the canal as Kazim steps ashore and walks away. Close on the water-soaked paper impression: the rubbing taken from the shield of the Grail Knight. Brody is giving it careful study while he dabs the lump on the back of his head with an ice pack. Indy, wearing a bathrobe, leans over to study the impression. Brody lowers the ice pack from his head and looks at Indy, picks up the Grail Diary which covers two pages of the Diary, and Brody's finger moves across it. Indy closes the Grail Diary and puts it into the pocket of his robe, opens the door, and finds his bedroom has been ransacked, with the mattress on the floor, the drawers turned out. Indy approaches another door (Elsa's bedroom) and knocks. He goes in and finds that Elsa's bedroom is in a similar ransacked state to his own. He is worried for her, knocks and calls out, steps into the room, and knocks upon the bathroom door. He opens the bathroom door, peering inside, where Elsa is standing before a mirror, wearing a silk bathrobe. She gasps, startled, as Indy enters, and he retreats back into her bedroom as she reaches up to turn off a record player sitting on a ledge above the bathtub. Elsa joins Indy, waiting in the ransacked room, looking around in shock. She looks to Indy, who pulls the Grail Diary from his pocket. She comes closer to him, stomps her foot angrily, and starts to walk away, but Indy grabs her. He pulls her to him and kisses her. Now Elsa reaches for Indy and kisses him, and he embraces her, and Elsa begins to nibble at his ear. Indy smiles slyly as they fall to the bed. A gondolier sings as he steers his gondola carrying two passengers past Indy's window. Indy lies on top of Elsa, kissing her. He stops for a moment as he hears the gondolier singing. Elsa reaches up and pulls him back down to her. A Mercedes-Benz glides through the sharp mountain curves, superimposed over a map that charts their course from Venice across Austria toward Salzburg as storm clouds darken the skies.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "By now, half the vessel has been chopped up into kindling, and the blades are getting closer; the wind of the blades is on their necks. Indy seizes Kazim just in time and jumps into the speedboat driven by Elsa, which gets alongside in the nick of time. Kazim pulls back his shirt to disclose a birthmark, or is it a tattoo? Whatever it is, it's a cruciform sword, a Christian cross that tapers down like the blades of a broadsword. The boat is close to the edge of the canal as Kazim steps ashore and strides away. Close on the water-soaked paper impression: the rubbing taken from the shield of the Grail Knight. Brody is giving it careful examination while he dabs the bump on the back of his head with an ice pack. Indy, wearing a bathrobe, leans over to examine the impression. Brody lowers the ice pack from his head and glances at Indy, picks up the Grail Diary which covers two pages of the Diary, and Brody's finger moves across it. Indy shuts the Grail Diary and places it into the pocket of his robe, opens the door, and finds his bedroom has been ransacked, with the mattress on the floor, the drawers turned out. Indy approaches another door (Elsa's bedroom) and knocks. He enters and discovers that Elsa's bedroom is in a similar ransacked state to his own. He is anxious for her, knocks and calls out, steps into the room, and taps upon the bathroom door. He opens the bathroom door, peering inside, where Elsa is standing before a mirror, wearing a silk bathrobe. She gasps, startled, as Indy enters, and he retreats back into her bedroom as she reaches up to turn off a phonograph sitting on a ledge above the bathtub. Elsa joins Indy, waiting in the ransacked room, looking around in shock. She looks to Indy, who pulls the Grail Diary from his pocket. She comes closer to him, stomps her foot angrily, and starts to walk away, but Indy seizes her. He pulls her to him and kisses her. Now Elsa reaches for Indy and kisses him, and he embraces her, and Elsa begins to nibble at his ear. Indy grins slyly as they fall to the bed. A gondolier sings as he steers his gondola carrying two passengers past Indy's window. Indy lies on top of Elsa, kissing her. He pauses for a moment as he hears the gondolier singing. Elsa reaches up and pulls him back down to her. A Mercedes-Benz glides through the sharp hill curves, superimposed over a chart that plots their route from Venice across Austria toward Salzburg as storm clouds darken the heavens."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "By now, half the boat has been chopped up into matchwood, and their necks are being touched by the wind of the blades, which are getting closer. Kazim is grabbed by Indy just in time as he jumps into the motorboat, which is driven by Elsa and gets alongside in the nick of time. Kazim pulls back his shirt to reveal a birthmark, or is it a tattoo? Whatever it is, it's a cruciform sword, a Christian cross that tapers down like the blades of a broadsword. The edge of the canal is approached by the boat as Kazim steps ashore and walks away. Close on the water-soaked paper impression: the rubbing taken by them from the shield of the Grail Knight. Careful study is given by Brody to it while an ice pack is dabbed by him on the lump on the back of his head. In a bathrobe, Indy leans over to study the impression. Brody lowers the ice pack from his head and looks at Indy, picking up the Grail Diary that covers two pages of the Diary, and his finger moves across it. The Grail Diary is closed by Indy, put into the pocket of his robe by him, and he opens the door to find that his bedroom has been ransacked, with the mattress on the floor and the drawers turned out. Another door (Elsa's bedroom) is approached by Indy, who knocks. He goes in and finds that Elsa's bedroom is in a state similar to his own, ransacked. He is worried for her, knocks and calls out, steps into the room, and knocks upon the bathroom door. The bathroom door is opened by him, peering inside, where Elsa is standing before a mirror, wearing a silk bathrobe. She gasps, startled, as Indy enters, and he retreats back into her bedroom as a record player is turned off by her, which is sitting on a ledge above the bathtub. Indy is joined by Elsa, who waits in the ransacked room, looking around in shock. She looks to Indy, who pulls the Grail Diary from his pocket. She comes closer to him, stomps her foot angrily, and starts to walk away, but Elsa is grabbed by Indy. She is pulled to him and kissed by him. Now Elsa reaches for Indy and kisses him, and he is embraced by her, and Elsa begins to nibble at his ear. A sly smile is given by Indy as they fall to the bed. A gondolier sings as he steers his gondola carrying two passengers past Indy's window. Elsa is lied on top of by Indy, who is kissing her. He stops for a moment as the gondolier is heard singing by him. She reaches up and pulls him back down to her. A Mercedes-Benz is glided through the sharp mountain curves, superimposed over a map that charts their course from Venice across Austria toward Salzburg as the skies are darkened by storm clouds."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Half the boat is now matchwood, and the blades are nearing; their wind is on their necks. Indy grabs Kazim just in time and jumps into Elsa's motorboat, which arrives just in time. Kazim reveals a cruciform sword birthmark or tattoo. The boat nears the canal's edge as Kazim steps ashore. Brody studies a water-soaked paper impression from the Grail Knight's shield, dabbing his head with an ice pack. Indy, in a bathrobe, examines the impression. Brody lowers the ice pack, looks at Indy, and picks up the Grail Diary, which covers two pages. Indy closes the Diary, pockets it, and finds his ransacked bedroom. He knocks on Elsa's door, finds her room similarly ransacked, and calls out. In the bathroom, Elsa, in a silk robe, is startled by Indy. She turns off a record player and joins him in the ransacked room. Elsa looks at Indy, who shows her the Grail Diary. She stomps angrily and starts to leave, but Indy grabs and kisses her. Elsa kisses back, and they fall to the bed. A gondolier sings as he steers past Indy's window. Indy pauses, hearing the singing, but Elsa pulls him back. A Mercedes-Benz navigates mountain curves, superimposed over a map charting their course from Venice to Salzburg as storm clouds gather."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Half the boat is now matchwood, and the blades are nearing; their wind is on their necks. Indy saves Kazim just in time, jumping into Elsa's motorboat. Kazim reveals a cruciform sword birthmark or tattoo. The boat nears the canal's edge as Kazim disembarks. A water-soaked paper impression from the Grail Knight's shield is studied by Brody, who dabs his head with ice. Indy, in a bathrobe, examines it too. Brody lowers the ice pack, looks at Indy, and examines the Grail Diary. Indy closes it, pockets it, and finds his ransacked bedroom. He checks Elsa's similarly ransacked room, worried, and knocks on the bathroom door. Elsa, in a silk robe, is startled by Indy, who retreats as she turns off a record player. Elsa joins Indy, shocked, and he shows her the Grail Diary. She stomps angrily and starts to leave, but Indy grabs and kisses her. Elsa kisses back, and they fall to the bed. A gondolier sings past Indy's window as he kisses Elsa. He pauses, hears the singing, but Elsa pulls him back. A Mercedes-Benz travels through mountain curves, superimposed over a map from Venice to Salzburg as storm clouds gather."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "By this point in the unfolding events, a significant portion of the boat has been reduced to mere matchwood, and the menacing blades are inching ever closer; the gusty wind generated by these blades can be felt on their necks. In a swift and timely move, Indy manages to grab Kazim just in the nick of time and leaps into the motorboat, which is being expertly driven by Elsa. This motorboat arrives alongside them just at the crucial moment. Kazim then pulls back his shirt to reveal a distinctive mark on his skin—whether it is a birthmark or a tattoo is uncertain. Regardless, it is a cruciform sword, a Christian cross that tapers elegantly downwards, reminiscent of the blades of a broadsword. The boat is now perilously close to the edge of the canal as Kazim steps ashore and walks away with purpose. The camera focuses closely on the water-soaked paper impression: it is the rubbing taken from the shield of the Grail Knight. Brody is giving this impression his careful and undivided attention while he gently dabs the lump on the back of his head with an ice pack. Indy, dressed in a bathrobe, leans over to examine the impression with interest. Brody lowers the ice pack from his head, glances at Indy, and then picks up the Grail Diary, which spans two pages of the Diary. Brody's finger moves thoughtfully across it. Indy then closes the Grail Diary, tucks it securely into the pocket of his robe, and opens the door to discover that his bedroom has been thoroughly ransacked, with the mattress tossed onto the floor and the drawers emptied out. Indy approaches another door, which leads to Elsa's bedroom, and knocks. He enters and finds that Elsa's bedroom is in a similarly disheveled state as his own. Concerned for her well-being, he knocks and calls out, stepping into the room, and then knocks upon the bathroom door. He opens the bathroom door and peers inside, where Elsa is standing before a mirror, clad in a silk bathrobe. She gasps, visibly startled, as Indy enters, prompting him to retreat back into her bedroom as she reaches up to turn off a record player that is perched on a ledge above the bathtub. Elsa then joins Indy, standing in the ransacked room, looking around in shock and disbelief. She turns her gaze to Indy, who retrieves the Grail Diary from his pocket. She moves closer to him, stomps her foot in frustration, and begins to walk away, but Indy seizes her. He pulls her towards him and kisses her passionately. In response, Elsa reaches for Indy and kisses him back, and he embraces her warmly as Elsa begins to nibble playfully at his ear. Indy smiles slyly as they both fall onto the bed. Outside, a gondolier sings melodiously as he skillfully steers his gondola, carrying two passengers past Indy's window. Indy lies atop Elsa, kissing her tenderly. He pauses for a brief moment as he hears the gondolier's song. Elsa reaches up and pulls him back down to her. Meanwhile, a sleek Mercedes-Benz glides smoothly through the sharp mountain curves, superimposed over a map that charts their course from Venice across Austria toward Salzburg, as ominous storm clouds gather and darken the skies above."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "As the unfolding events reach this critical juncture, a major portion of the boat has been shattered into nothing more than mere matchwood, and the ominous, menacing blades are relentlessly inching ever closer. The gusty, powerful wind generated by the rotation of these blades can be distinctly felt on the backs of their necks. In a swift, timely, and decisive move, Indy skillfully manages to grab Kazim, rescuing him in the very nick of time, and makes a daring leap into the nearby motorboat. This motorboat is expertly driven by Elsa, and it arrives alongside them at just the crucial, opportune moment. Kazim, in turn, uncovers his shirt to reveal a distinctive mark on his skin—whether this mark is a birthmark or a tattoo remains uncertain. Regardless of its origin, it is a cruciform sword, a Christian cross that tapers elegantly downwards, reminiscent and evocative of the blades of a broadsword.\n\nAs the boat edges perilously close to the canal's brink, Kazim steps ashore and strides away with clear purpose. The camera closely zooms in, focusing intently on the water-soaked paper impression: the rubbing taken from the shield of the Grail Knight. Brody, meanwhile, is intently giving this impression his careful, undivided attention while he gently dabs a lump on the back of his head with an ice pack for relief. Indy, dressed comfortably in a bathrobe, leans over to examine the impression with genuine interest. Brody then lowers the ice pack from his head, glances thoughtfully at Indy, and proceeds to pick up the Grail Diary, spanning two well-worn pages of the Diary. With his finger, Brody moves thoughtfully across it. Indy, in response, closes the Grail Diary, tucks it securely into the pocket of his robe, and opens the door to reveal that his bedroom has been thoroughly ransacked, with the mattress carelessly tossed onto the floor and the drawers completely emptied out. Indy moves to another door, leading to Elsa's bedroom, and knocks on it.\n\nEntering cautiously, he finds Elsa's bedroom is in a similarly disheveled state as his own. Concerned for her safety and well-being, he knocks once more and calls out to her, stepping inside the room before knocking on the bathroom door. He opens the bathroom door and peers inside, where he finds Elsa standing before a mirror, wrapped in a luxurious silk bathrobe. She gasps, visibly taken by surprise, as Indy makes his entrance, prompting him to retreat back into her bedroom. She reaches up to switch off a record player perched on a ledge above the bathtub. Elsa then joins Indy in the ransacked room, looking around in shock and disbelief at the disarray. Her gaze turns to Indy, who retrieves the Grail Diary from the pocket of his robe. She steps closer to him, stomps her foot in frustration, and begins to walk away, but Indy quickly seizes the moment. He pulls her towards him and kisses her passionately. In response, Elsa reaches for Indy and kisses him back, and he embraces her warmly, lovingly, as she begins to nibble playfully at his ear. Indy responds with a sly smile as they both fall onto the bed together.\n\nOutside, a gondolier sings melodically, his voice carrying through the air as he skillfully steers his gondola, transporting two passengers past Indy's window. Indy lies atop Elsa, kissing her tenderly. He pauses momentarily as he becomes aware of the gondolier's song. Elsa reaches up and gently pulls him back down to her. Meanwhile, a sleek, elegant Mercedes-Benz glides smoothly and gracefully through the sharp, winding mountain curves. This scene is superimposed over a map that charts their course, illustrating a journey from Venice across Austria toward Salzburg, ominous storm clouds steadily gathering and darkening the skies above."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "By now, as the relentless blades continue their destructive path, half the boat has been reduced to matchwood, and the ominous wind from the blades brushes against their necks, signaling imminent danger. In a swift and decisive move, Indy reaches out and grabs Kazim just in time, pulling him along as he leaps into the motorboat driven by Elsa, which skillfully maneuvers alongside them at the last possible moment. Once aboard, Kazim, with a deliberate motion, pulls back his shirt to reveal a distinct mark on his skin, which could be a birthmark or perhaps a tattoo. This mark is a cruciform sword, resembling a Christian cross that tapers elegantly like the blades of a broadsword. As the boat edges closer to the canal's boundary, Kazim steps ashore with a purposeful stride and walks away, leaving behind the chaos. Meanwhile, the focus shifts to a water-soaked paper impression, a rubbing meticulously taken from the shield of the Grail Knight. Brody, with a concentrated expression, studies it intently while simultaneously tending to a lump on the back of his head with an ice pack. Indy, casually dressed in a bathrobe, leans over to examine the impression alongside Brody. As Brody lowers the ice pack from his head, he glances at Indy, then picks up the Grail Diary, which spans two pages, and traces his finger across it thoughtfully. Indy, with a decisive gesture, closes the Grail Diary, tucks it securely into the pocket of his robe, and proceeds to open the door, only to discover his bedroom in disarray, with the mattress displaced onto the floor and drawers emptied. Concerned, Indy approaches another door leading to Elsa's bedroom and knocks, calling out for her. He enters to find her room similarly ransacked, heightening his worry. He knocks again, this time on the bathroom door, and upon opening it, peers inside to find Elsa standing before a mirror, clad in a silk bathrobe. Startled by his sudden entrance, she gasps, prompting Indy to retreat back into her bedroom. Elsa, regaining her composure, reaches up to turn off a record player perched on a ledge above the bathtub. She then joins Indy in the disordered room, her eyes wide with shock as she surveys the mess. She turns to Indy, who retrieves the Grail Diary from his pocket, prompting her to approach him. In a moment of frustration, she stomps her foot and begins to walk away, but Indy quickly grabs her, pulling her back to him and kissing her. Elsa responds by reaching for Indy, returning his kiss, and as they embrace, she playfully nibbles at his ear. Indy, with a sly smile, allows them to fall onto the bed together. Outside, a gondolier serenades as he skillfully navigates his gondola, carrying two passengers past Indy's window. Inside, Indy lies atop Elsa, continuing to kiss her, but pauses momentarily as the gondolier's song reaches his ears. Elsa, undeterred, reaches up and pulls him back down to her. Meanwhile, a Mercedes-Benz glides smoothly through the sharp mountain curves, its journey superimposed over a map that charts their course from Venice across Austria toward Salzburg, as storm clouds gather ominously in the sky."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Half the boat is reduced to matchwood as the blades draw near, their wind brushing against their necks. Indy swiftly pulls Kazim into the motorboat driven by Elsa, arriving just in time. Kazim reveals a cruciform sword birthmark or tattoo before stepping ashore near the canal's edge. Meanwhile, Brody examines a water-soaked paper impression from the Grail Knight's shield, tending to a head lump with an ice pack. Indy, in a bathrobe, studies the impression with Brody, who then references the Grail Diary. Indy closes the diary, pockets it, and discovers his ransacked bedroom. Concerned, he checks Elsa's similarly disheveled room, calling out and entering to find her startled in the bathroom. Elsa turns off a record player and joins Indy in the chaotic room. She reacts angrily, but Indy stops her, leading to a passionate embrace and kiss. As they fall onto the bed, a gondolier's song drifts through the window. Indy pauses to listen, but Elsa pulls him back to her. Meanwhile, a Mercedes-Benz navigates sharp mountain curves, its journey from Venice to Salzburg mapped out against darkening storm clouds."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "By now, half the boat has been chopped up into matchwood, the kind used in early matches, and the blades of the watercraft destroyer are getting closer; the wind of the blades, which can be powerful enough to cause disorientation, is on their necks. Indy, the renowned archaeologist known for his daring adventures, grabs Kazim just in time and jumps into the motorboat driven by Elsa, a former art conservator turned adventurer, which gets alongside in the nick of time. Kazim pulls back his shirt to reveal a birthmark, or is it a tattoo? Whatever it is, it's a cruciform sword, a Christian cross that tapers down like the blades of a broadsword, a weapon historically used in medieval Europe. The boat is close to the edge of the canal, one of Venice’s iconic waterways, as Kazim steps ashore and walks away. Close on the water-soaked paper impression: the rubbing taken from the shield of the Grail Knight, a legendary figure in the quest for the Holy Grail. Brody, a museum curator and close friend of Indy, is giving it careful study while he dabs the lump on the back of his head with an ice pack. Indy, wearing a bathrobe reminiscent of the ones provided in luxury hotels, leans over to study the impression. Brody lowers the ice pack from his head and looks at Indy, picks up the Grail Diary, a crucial artifact in their quest, which covers two pages of the Diary, and Brody's finger moves across it. Indy closes the Grail Diary and puts it into the pocket of his robe, opens the door, and finds his bedroom, in a hotel known for its views of the canals, has been ransacked, with the mattress on the floor, the drawers turned out. Indy approaches another door (Elsa's bedroom) and knocks. He goes in and finds that Elsa's bedroom is in a similar ransacked state to his own. He is worried for her, knocks and calls out, steps into the room, and knocks upon the bathroom door. He opens the bathroom door, peering inside, where Elsa is standing before a mirror, wearing a silk bathrobe, a garment reflecting her taste for elegance. She gasps, startled, as Indy enters, and he retreats back into her bedroom as she reaches up to turn off a record player, an object of vintage charm, sitting on a ledge above the bathtub. Elsa joins Indy, waiting in the ransacked room, looking around in shock. She looks to Indy, who pulls the Grail Diary from his pocket. She comes closer to him, stomps her foot angrily, and starts to walk away, but Indy grabs her. He pulls her to him and kisses her. Now Elsa reaches for Indy and kisses him, and he embraces her, and Elsa begins to nibble at his ear, a playful gesture. Indy smiles slyly as they fall to the bed, an antique piece that creaks under their weight. A gondolier, part of a profession that has been emblematic of Venetian culture for centuries, sings as he steers his gondola carrying two passengers past Indy's window. Indy lies on top of Elsa, kissing her. He stops for a moment as he hears the gondolier singing. Elsa reaches up and pulls him back down to her. A Mercedes-Benz, synonymous with luxury and engineering precision, glides through the sharp mountain curves, superimposed over a map that charts their course from Venice across Austria toward Salzburg, a city known for its baroque architecture and musical heritage, as storm clouds darken the skies."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "By now half the boat has been chopped up into matchwood and the blades are getting closer  the wind of the blades is on their necks  Indy grabs Kazim just in time and jumps into the motorboat driven by Elsa which gets alongside in the nick of time  Indy picks up the Grail Diary which covers two pages of the Diary and Brody's finger moves across it  Indy closes the Grail Diary and puts it into the pocket of his robe opens the door and finds his bedroom has been ransacked with the mattress on the floor  the drawers turned out  Indy approaches another door Elsa's bedroom and knocks  He goes in and finds that Elsa's bedroom is in a similar ransacked state to his own  He is worried for her knocks and calls out steps into the room and knocks upon the bathroom door  He opens the bathroom door peering inside where Elsa is standing before a mirror wearing a silk bathrobe  She gasps startled as Indy enters and he retreats back into her bedroom as she reaches up to turn off a record player sitting on a ledge above the bathtub  Elsa joins Indy waiting in the ransacked room looking around in shock  She looks to Indy who pulls the Grail Diary from his pocket  She comes closer to him stomps her foot angrily and starts to walk away but Indy grabs her  He pulls her to him and kisses her  Now Elsa reaches for Indy and kisses him and he embraces her and Elsa begins to nibble at his ear  Indy smiles slyly as they fall to the bed  A gondolier sings as he steers his gondola carrying two passengers past Indy's window  Kazim pulls back his shirt to reveal a birthmark or is it a tattoo  Whatever it is it's a cruciform sword a Christian cross that tapers down like the blades of a broadsword  The boat is close to the edge of the canal as Kazim steps ashore and walks away  Close on the watersoaked paper impression the rubbing taken from the shield of the Grail Knight  Brody is giving it careful study while he dabs the lump on the back of his head with an ice pack  Indy wearing a bathrobe leans over to study the impression  Brody lowers the ice pack from his head and looks at  Indy picks up the Grail Diary which covers two pages of the Diary and Brody's finger moves across it  Indy closes the Grail Diary and puts it into the pocket of his robe opens the door and finds his bedroom has been ransacked with the mattress on the floor  the drawers turned out  Indy approaches another door Elsa's bedroom and knocks  He goes in and finds that Elsa's bedroom is in a similar ransacked state to his own  He is worried for her knocks and calls out steps into the room and knocks upon the bathroom door  He opens the bathroom door peering inside where Elsa is standing before a mirror wearing a silk bathrobe  She gasps startled as Indy enters and he retreats back into her bedroom as she reaches up to turn off a record player sitting on a ledge above the bathtub  Elsa joins Indy waiting in the ransacked room looking around in shock  She looks to Indy who pulls the Grail Diary from his pocket  She comes closer to him stomps her foot angrily and starts to walk away but Indy grabs her  He pulls her to him and kisses her  Now Elsa reaches for Indy and kisses him and he embraces her and Elsa begins to nibble at his ear  Indy smiles slyly as they fall to the bed  A gondolier sings as he steers his gondola carrying two passengers past Indy's window  Indy lies on top of Elsa kissing her  He stops for a moment as he hears the gondolier singing  Elsa reaches up and pulls him back down to her  A MercedesBenz glides through the sharp mountain curves superimposed over a map that charts their course from Venice across Austria toward Salzburg as storm clouds darken the skies"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "By now half the boat has been chopped up into matchwood and the blades are getting closer. the wind of the blades is on their necks. Indy grabs Kazim just in time and jumps into the motorboat driven by Elsa which gets alongside in the nick of time. Kazim pulls back his shirt to reveal a birthmark or is it a tattoo. Whatever it is it is a cruciform sword a Christian cross that tapers down like the blades of a broadsword. The boat is close to the edge of the canal as Kazim steps ashore and walks away. Close on the watersoaked paper impression the rubbing taken from the shield of the Grail Knight. Brody is giving it careful study while he dabs the lump on the back of his head with an ice pack. Indy wearing a bathrobe leans over to study the impression. Brody lowers the ice pack from his head and looks at. Indy picks up the Grail Diary which covers two pages of the Diary and Brody's finger moves across it. Indy closes the Grail Diary and puts it into the pocket of his robe. opens the door and finds his bedroom has been ransacked with the mattress on the floor. the drawers turned out. Indy approaches another door Elsa's bedroom and knocks. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. He goes in and finds that Elsa's bedroom is in a similar ransacked state to his own. He is worried for her knocks and calls out steps into the room and knocks upon the bathroom door. He opens the bathroom door peering inside where Elsa is standing before a mirror wearing a silk bathrobe. She gasps startled as Indy enters and he retreats back into her bedroom as she reaches up to turn off a record player sitting on a ledge above the bathtub. Elsa joins Indy waiting in the ransacked room looking around in shock. She looks to Indy who pulls the Grail Diary from his pocket. She comes closer to him stomps her foot angrily and starts to walk away but Indy grabs her. He pulls her to him and kisses her. Now Elsa reaches for Indy and kisses him and he embraces her and Elsa begins to nibble at his ear. Indy smiles slyly as they fall to the bed. A gondolier sings as he steers his gondola carrying two passengers past Indy's window. Indy lies on top of Elsa kissing her. He stops for a moment as he hears the gondolier singing. Elsa reaches up and pulls him back down to her. A MercedesBenz glides through the sharp mountain curves superimposed over a map that charts their course from Venice across Austria toward Salzburg as storm clouds darken the skies."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "By now half the boat has been chopped up into matchwood and the blades are getting closer. the wind of the blades is on their necks. Indy grabs Kazim just in time and jumps into the motorboat driven by Elsa which gets alongside in the nick of time. Kazim pulls back his shirt to reveal a birthmark or is it a tattoo. Whatever it is it is a cruciform sword a Christian cross that tapers down like the blades of a broadsword. The boat is close to the edge of the canal as Kazim steps ashore and walks away. Close on the watersoaked paper impression the rubbing taken from the shield of the Grail Knight. Brody is giving it careful study while he dabs the lump on the back of his head with an ice pack. Indy wearing a bathrobe leans over to study the impression. Brody lowers the ice pack from his head and looks at. Indy picks up the Grail Diary which covers two pages of the Diary and Brody's finger moves across it. Indy closes the Grail Diary and puts it into the pocket of his robe. opens the door and finds his bedroom has been ransacked with the mattress on the floor. the drawers turned out. Indy approaches another door Elsa's bedroom and knocks. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. He goes in and finds that Elsa's bedroom is in a similar ransacked state to his own. He is worried for her knocks and calls out steps into the room and knocks upon the bathroom door. He opens the bathroom door peering inside where Elsa is standing before a mirror wearing a silk bathrobe. She gasps startled as Indy enters and he retreats back into her bedroom as she reaches up to turn off a record player sitting on a ledge above the bathtub. Elsa joins Indy waiting in the ransacked room looking around in shock. She looks to Indy who pulls the Grail Diary from his pocket. She comes closer to him stomps her foot angrily and starts to walk away but Indy grabs her. He pulls her to him and kisses her. Now Elsa reaches for Indy and kisses him and he embraces her and Elsa begins to nibble at his ear. Indy smiles slyly as they fall to the bed. A gondolier sings as he steers his gondola carrying two passengers past Indy's window. Indy lies on top of Elsa kissing her. He stops for a moment as he hears the gondolier singing. Elsa reaches up and pulls him back down to her. A MercedesBenz glides through the sharp mountain curves superimposed over a map that charts their course from Venice across Austria toward Salzburg as storm clouds darken the skies."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "By now half the boat has been chopped up into matchwood and the blades are getting closer. the wind of the blades is on their necks. Indy grabs Kazim just in time and jumps into the motorboat driven by Elsa which gets alongside in the nick of time. Kazim pulls back his shirt to reveal a birthmark or is it a tattoo. Whatever it is it is a cruciform sword a Christian cross that tapers down like the blades of a broadsword. The boat is close to the edge of the canal as Kazim steps ashore and walks away. Close on the watersoaked paper impression the rubbing taken from the shield of the Grail Knight. Brody is giving it careful study while he dabs the lump on the back of his head with an ice pack. Now Elsa reaches for Indy and kisses him and he embraces her and Elsa begins to nibble at his ear. Indy smiles slyly as they fall to the bed. A gondolier sings as he steers his gondola carrying two passengers past Indy's window. Indy lies on top of Elsa kissing her. He stops for a moment as he hears the gondolier singing. Elsa reaches up and pulls him back down to her. A MercedesBenz glides through the sharp mountain curves superimposed over a map that charts their course from Venice across Austria toward Salzburg as storm clouds darken the skies."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "By now half the boat has been chopped up into matchwood and the blades are getting closer. the wind of the blades is on their necks. Indy grabs Kazim just in time and jumps into the motorboat driven by Elsa which gets alongside in the nick of time. He stops for a moment as he hears the gondolier singing. Elsa reaches up and pulls him back down to her. A MercedesBenz glides through the sharp mountain curves superimposed over a map that charts their course from Venice across Austria toward Salzburg as storm clouds darken the skies."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "By now, half the boat has been chopped up into matchwood, and the blades are getting closer; the wind of the blades is on their necks. A penguin grabs a giraffe just in time and jumps into the motorboat driven by a kangaroo, which gets alongside in the nick of time. The giraffe pulls back its shirt to reveal a birthmark, or is it a tattoo? Whatever it is, it's a cruciform sword, a Christian cross that tapers down like the blades of a broadsword. The boat is close to the edge of the canal as the giraffe steps ashore and walks away. Close on the water-soaked paper impression: the rubbing taken from the shield of the Grail Knight. A dolphin is giving it careful study while it dabs the lump on the back of its head with an ice pack. The penguin, wearing a bathrobe, leans over to study the impression. The dolphin lowers the ice pack from its head and looks at the penguin, picks up the Grail Diary which covers two pages of the Diary, and the dolphin's finger moves across it. The penguin closes the Grail Diary and puts it into the pocket of its robe, opens the door, and finds its bedroom has been ransacked, with the mattress on the floor, the drawers turned out. The penguin approaches another door (the kangaroo's bedroom) and knocks. It goes in and finds that the kangaroo's bedroom is in a similar ransacked state to its own. It is worried for the kangaroo, knocks and calls out, steps into the room, and knocks upon the bathroom door. It opens the bathroom door, peering inside, where the kangaroo is standing before a mirror, wearing a silk bathrobe. The kangaroo gasps, startled, as the penguin enters, and it retreats back into the kangaroo's bedroom as the kangaroo reaches up to turn off a record player sitting on a ledge above the bathtub. The kangaroo joins the penguin, waiting in the ransacked room, looking around in shock. The kangaroo looks to the penguin, who pulls the Grail Diary from its pocket. The kangaroo comes closer to the penguin, stomps its foot angrily, and starts to walk away, but the penguin grabs the kangaroo. It pulls the kangaroo to it and kisses the kangaroo. Now the kangaroo reaches for the penguin and kisses it, and the penguin embraces the kangaroo, and the kangaroo begins to nibble at its ear. The penguin smiles slyly as they fall to the bed. A flamingo sings as it steers its gondola carrying two passengers past the penguin's window. The penguin lies on top of the kangaroo, kissing it. It stops for a moment as it hears the flamingo singing. The kangaroo reaches up and pulls it back down to it. A spaceship glides through the sharp mountain curves, superimposed over a map that charts their course from Venice across Austria toward Salzburg as storm clouds darken the skies."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "By now, half the train has been chopped up into firewood, and the waves are getting closer; the gust of the waves is on their necks. Indy grabs Kazim just in time and jumps into the carriage driven by Elsa, which gets alongside in the nick of time. Kazim pulls back his shirt to reveal a scar, or is it a tattoo? Whatever it is, it's a cruciform spoon, a Christian cross that tapers down like the waves of a river. The train is close to the edge of the street as Kazim steps ashore and walks away. Close on the rain-soaked paper impression: the sketch taken from the helmet of the Grail Knight. Brody is giving it careful study while he dabs the bump on the back of his head with a bandage. Indy, wearing a cardigan, leans over to study the impression. Brody lowers the bandage from his head and looks at Indy, picks up the Grail Manuscript which covers two pages of the Manuscript, and Brody's finger moves across it. Indy closes the Grail Manuscript and puts it into the pocket of his cardigan, opens the door, and finds his kitchen has been ransacked, with the pantry on the floor, the cabinets turned out. Indy approaches another door (Elsa's kitchen) and knocks. He goes in and finds that Elsa's kitchen is in a similar ransacked state to his own. He is worried for her, knocks and calls out, steps into the room, and knocks upon the closet door. He opens the closet door, peering inside, where Elsa is standing before a window, wearing a cotton jacket. She gasps, startled, as Indy enters, and he retreats back into her kitchen as she reaches up to turn off a lamp sitting on a shelf above the sink. Elsa joins Indy, waiting in the ransacked room, looking around in shock. She looks to Indy, who pulls the Grail Manuscript from his pocket. She comes closer to him, stomps her foot angrily, and starts to walk away, but Indy grabs her. He pulls her to him and kisses her. Now Elsa reaches for Indy and kisses him, and he embraces her, and Elsa begins to nibble at his nose. Indy smiles slyly as they fall to the sofa. A violinist sings as he steers his violin carrying two passengers past Indy's window. Indy lies on top of Elsa, kissing her. He stops for a moment as he hears the violinist singing. Elsa reaches up and pulls him back down to her. A Rolls-Royce glides through the sharp desert curves, superimposed over a blueprint that charts their course from Venice across Austria toward Salzburg as storm clouds darken the skies."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "By now, half the boat has been twisted into matchwood, and the blades are getting closer; the wind of the blades is on their necks. Indy nudges Kazim just in time and slides into the motorboat piloted by Elsa, which arrives alongside in the nick of time. Kazim adjusts his shirt to display a scar, or is it a drawing? Whatever it is, it's a cruciform sword, a Christian cross that tapers down like the blades of a broadsword. The boat is close to the edge of the canal as Kazim hops ashore and strolls away. Close on the water-soaked paper impression: the tracing taken from the shield of the Grail Knight. Brody is examining it carefully while he pats the lump on the back of his head with an ice pack. Indy, wearing a bathrobe, leans over to examine the impression. Brody lowers the ice pack from his head and glances at Indy, picks up the Grail Diary which spans two pages of the Diary, and Brody's finger slides across it. Indy shuts the Grail Diary and slips it into the pocket of his robe, opens the door, and discovers his bedroom has been turned upside down, with the mattress on the floor, the drawers emptied out. Indy approaches another door (Elsa's bedroom) and taps. He goes in and finds that Elsa's bedroom is in a similar disordered state to his own. He is concerned for her, taps and calls out, steps into the room, and taps upon the bathroom door. He opens the bathroom door, peering inside, where Elsa is standing before a mirror, wearing a silk bathrobe. She jumps, startled, as Indy enters, and he steps back into her bedroom as she stretches up to switch off a record player perched on a ledge above the bathtub. Elsa joins Indy, waiting in the disheveled room, looking around in surprise. She glances at Indy, who pulls the Grail Diary from his pocket. She moves closer to him, stamps her foot angrily, and starts to wander away, but Indy catches her. He draws her to him and kisses her. Now Elsa reaches for Indy and kisses him, and he hugs her, and Elsa begins to tickle his ear. Indy grins slyly as they tumble to the bed. A gondolier hums as he navigates his gondola carrying two passengers past Indy's window. Indy lies on top of Elsa, kissing her. He pauses for a moment as he hears the gondolier humming. Elsa reaches up and pulls him back down to her. A Mercedes-Benz cruises through the sharp mountain curves, superimposed over a map that marks their course from Venice across Austria toward Salzburg as storm clouds obscure the skies."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "By now, half the mansion has been chopped up into cardboard, and the ribbons are getting closer; the breeze of the ribbons is on their elbows. The cactus grabs the giraffe just in time and jumps into the skateboard driven by the raccoon, which gets alongside in the nick of time. The giraffe pulls back its sweater to reveal a freckle, or is it a sticker? Whatever it is, it's a cruciform umbrella, a Christian spoon that tapers down like the ribbons of a kite. The mansion is close to the edge of the highway as the giraffe steps ashore and walks away. Close on the water-soaked napkin impression: the rubbing taken from the helmet of the Unicorn Tamer. The flamingo is giving it careful study while it dabs the bruise on the back of its neck with a tomato. The cactus, wearing a tuxedo, leans over to study the impression. The flamingo lowers the tomato from its neck and looks at the cactus, picks up the Unicorn Manual which covers two pages of the Manual, and the flamingo's talon moves across it. The cactus closes the Unicorn Manual and puts it into the pocket of its tuxedo, opens the portal, and finds its kitchen has been ransacked, with the pillow on the ceiling, the baskets turned out. The cactus approaches another portal (the raccoon's kitchen) and knocks. It goes in and finds that the raccoon's kitchen is in a similar ransacked state to its own. It is worried for the raccoon, knocks and calls out, steps into the space, and knocks upon the wardrobe portal. It opens the wardrobe portal, peering inside, where the raccoon is standing before a painting, wearing a velvet tuxedo. She gasps, startled, as the cactus enters, and it retreats back into the raccoon's kitchen as she reaches up to turn off a lantern sitting on a ledge above the sink. The raccoon joins the cactus, waiting in the ransacked space, looking around in shock. She looks to the cactus, who pulls the Unicorn Manual from its pocket. She comes closer to it, stomps her foot angrily, and starts to walk away, but the cactus grabs her. It pulls her to it and hugs her. Now the raccoon reaches for the cactus and hugs it, and it embraces her, and the raccoon begins to nibble at its elbow. The cactus smiles slyly as they fall to the hammock. A pelican sings as it steers its rowboat carrying two envelopes past the cactus's window. The cactus lies on top of the raccoon, hugging her. It stops for a moment as it hears the pelican singing. The raccoon reaches up and pulls it back down to her. A tricycle glides through the sharp desert curves, superimposed over a calendar that charts their course from Paris across Belgium toward Brussels as snowflakes brighten the skies."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "By now, half the barn has been fried up into pancakes, and the flames are getting closer; the warmth of the flames is on their cheeks. Leo pushes Wendy just in time and falls into the canoe steered by Daniel, which drifts nearby at the last moment. Wendy opens up her jacket to unveil a scar, or is it a brand? Whatever it is, it's a crescent moon, an astral shape that narrows down like the tip of a scimitar. The canoe is close to the edge of the pond as Wendy hops onto land and strolls away. Close on the rain-drenched drawing: the etching taken from the armor of the Silver Knight. Parker is giving it careful thought while he touches the bruise on his cheek with a cold compress. Leo, wearing pajamas, bends over to examine the etching. Parker places the compress on the table and glances at Leo, picks up the Knight’s Journal which contains two pages of the Journal, and Parker's finger glides across it. Leo shuts the Knight’s Journal and tucks it into the pocket of his pajamas, opens the closet, and discovers his living room has been trashed, with the sofa on its side, the cabinets emptied. Leo moves toward the hallway (Daniel's living room) and taps. He enters and notices that Daniel's living room is in a similar trashed condition to his own. He is concerned for him, taps and calls out, steps into the area, and taps upon the kitchen door. He swings open the kitchen door, peeking inside, where Daniel is standing before a clock, wearing a fluffy bathrobe. He gasps, surprised, as Leo enters, and he steps back into his living room as Daniel bends down to turn off a lamp sitting on a table near the sink. Daniel joins Leo, standing in the messy room, glancing around in disbelief. He turns to Leo, who retrieves the Knight’s Journal from his pocket. He approaches him, stomps his foot irritably, and begins to leave, but Leo tugs him back. He pulls him close and hugs him. Now Daniel wraps his arms around Leo and hugs him, and he holds him, and Daniel begins to whisper into his ear. Leo grins slyly as they collapse onto the couch. A violinist plays as he guides his boat carrying two tourists past Leo's window. Leo lies beside Daniel, holding him. He pauses for an instant as he hears the violinist playing. Daniel leans over and pulls him back to him. A Citroën cruises along the winding coastal road, superimposed over a map that traces their path from Florence across Sweden toward Oslo as rain clouds gather in the distance."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "By now, half the submarine has been carved up into driftwood, and the hammers are getting closer; the gale of the hammers is on their necks. Indy snatches Kazim just in time and leaps into the canoe paddled by Elsa, which glides alongside in the nick of time. Kazim rolls up his sleeve to reveal a scar, or is it a bracelet? Whatever it is, it's a zigzag dagger, a twisted dagger that narrows down like the hammers of a gavel. The submarine is close to the edge of the lagoon as Kazim hops onto the land and strolls away. Close on the soaked fabric impression: the imprint taken from the armor of the Grail Knight. Brody is examining it meticulously while he rubs the bruise on the back of his head with a warm towel. Indy, wearing a poncho, leans over to examine the imprint. Brody lowers the towel from his head and glances at Indy, lifts the Grail Diary which spreads across two pages of the Diary, and Brody's finger glides over it. Indy shuts the Grail Diary and stuffs it into the pocket of his poncho, opens the window, and finds his library has been pillaged, with the cushions on the floor, the shelves overturned. Indy strides toward another window (Elsa's library) and claps. He steps inside and discovers that Elsa's library is in a similar pillaged state to his own. He is nervous for her, claps and calls out, steps into the space, and taps upon the closet door. He opens the closet door, peering inside, where Elsa is standing before a painting, wearing a wool sweater. She gasps, startled, as Indy enters, and he retreats back into her library as she reaches up to switch off a radio perched on a shelf above the fireplace. Elsa joins Indy, waiting in the pillaged space, glancing around in disbelief. She turns to Indy, who pulls the Grail Diary from his pocket. She approaches him, stamps her foot indignantly, and begins to wander away, but Indy catches her. He draws her to him and hugs her. Now Elsa reaches for Indy and embraces him, and he holds her, and Elsa starts to nibble at his chin. Indy grins coyly as they tumble to the couch. A violinist plays as he rows his skiff carrying two passengers past Indy's window. Indy reclines on top of Elsa, kissing her. He pauses for a moment as he hears the violinist playing. Elsa reaches up and pulls him down to her again. A convertible cruises through the winding forest paths, superimposed over a map that traces their route from Venice across France toward Munich as snowflakes blanket the skies."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "By now, half the bicycle has been carved up into toothpicks, and the lasers are getting closer; the light of the lasers is on their arms. Miles grabs Trevor just in time and leaps into the skateboard driven by Lila, which glides alongside in the nick of time. Trevor pulls back his coat to reveal a scar, or is it a piercing? Whatever it is, it's a triangular shield, a mythical emblem that tapers down like the edge of a longsword. The bicycle is near the brink of the lagoon as Trevor steps onto the sand and meanders away. Close on the ink-stained parchment replica: the tracing taken from the armor of the Knight Rogue. Jamie is giving it focused attention while he massages the bruise on the side of his cheek with a cold compress. Miles, wearing a kimono, leans over to inspect the replica. Jamie lowers the cold compress from his cheek and glances at Miles, picks up the Rogue Journal which spans two pages of the Journal, and Jamie's thumb glides across it. Miles shuts the Rogue Journal and slips it into the pocket of his kimono, swings the gate, and discovers his den has been pillaged, with the futon on the carpet, the cabinets overturned. Miles ventures toward another gate (Lila's den) and taps. He proceeds in and discovers that Lila's den is in a comparable pillaged state to his own. He is anxious for her, taps and calls out, steps into the den, and taps upon the restroom gate. He pushes open the restroom gate, peering within, where Lila is standing before a window, wearing a satin kimono. She gasps, surprised, as Miles enters, and he retreats back into her den as she reaches up to silence a phonograph sitting on a shelf above the washbasin. Lila joins Miles, standing in the pillaged den, glancing around in disbelief. She glances to Miles, who draws the Rogue Journal from his pocket. She steps closer to him, stamps her foot irritably, and begins to saunter away, but Miles grasps her. He tugs her to him and kisses her. Now Lila reaches for Miles and kisses him, and he hugs her, and Lila starts to nibble at his shoulder. Miles grins mischievously as they tumble to the rug. A minstrel sings as he navigates his raft carrying two companions past Miles' window. Miles rests on top of Lila, kissing her. He pauses for a moment as he hears the minstrel singing. Lila reaches up and pulls him back down to her. A Rolls Royce cruises through the winding desert paths, superimposed over a chart that depicts their route from Florence across Hungary toward Vienna as thunderclouds obscure the skies."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Half the boat is destroyed, and the blades are dangerously close. Indy saves Kazim just in time, jumping into a motorboat driven by Elsa. Kazim reveals a cruciform sword mark before stepping ashore. Brody examines a water-soaked paper impression from the Grail Knight's shield while nursing a head lump as Indy, in a bathrobe, studies it too. Indy finds their rooms ransacked and checks on Elsa, who is startled in her bathroom. In Elsa’s bedroom, they share a passionate moment, falling onto the bed as a gondolier sings outside. Meanwhile, a Mercedes-Benz travels from Venice to Salzburg, as storm clouds gather."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "A MercedesBenz glides through the sharp mountain curves superimposed over a map that charts their course from Venice across Austria toward Salzburg as storm clouds darken the skies Elsa reaches up and pulls him back down to her  He stops for a moment as he hears the gondolier singing  Indy lies on top of Elsa kissing her  A gondolier sings as he steers his gondola carrying two passengers past Indy's window  Indy smiles slyly as they fall to the bed  Now Elsa reaches for Indy and kisses him and he embraces her and Elsa begins to nibble at his ear  He pulls her to him and kisses her  She comes closer to him stomps her foot angrily and starts to walk away but Indy grabs her  She looks to Indy who pulls the Grail Diary from his pocket  Elsa joins Indy waiting in the ransacked room looking around in shock  She gasps startled as Indy enters and he retreats back into her bedroom as she reaches up to turn off a record player sitting on a ledge above the bathtub  He opens the bathroom door peering inside where Elsa is standing before a mirror wearing a silk bathrobe  He is worried for her knocks and calls out steps into the room and knocks upon the bathroom door  He goes in and finds that Elsa's bedroom is in a similar ransacked state to his own  Indy approaches another door Elsa's bedroom and knocks  the drawers turned out  Indy closes the Grail Diary and puts it into the pocket of his robe opens the door and finds his bedroom has been ransacked with the mattress on the floor  Indy picks up the Grail Diary which covers two pages of the Diary and Brody's finger moves across it  Brody lowers the ice pack from his head and looks at  Indy wearing a bathrobe leans over to study the impression  Brody is giving it careful study while he dabs the lump on the back of his head with an ice pack  Close on the watersoaked paper impression the rubbing taken from the shield of the Grail Knight  The boat is close to the edge of the canal as Kazim steps ashore and walks away  Whatever it is it's a cruciform sword a Christian cross that tapers down like the blades of a broadsword  Kazim pulls back his shirt to reveal a birthmark or is it a tattoo  Indy grabs Kazim just in time and jumps into the motorboat driven by Elsa which gets alongside in the nick of time  the wind of the blades is on their necks  By now half the boat has been chopped up into matchwood and the blades are getting closer "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "He is worried for her knocks and calls out steps into the room and knocks upon the bathroom door  Indy approaches another door Elsa's bedroom and knocks  Close on the watersoaked paper impression the rubbing taken from the shield of the Grail Knight  Indy lies on top of Elsa kissing her  Brody is giving it careful study while he dabs the lump on the back of his head with an ice pack  He pulls her to him and kisses her  By now half the boat has been chopped up into matchwood and the blades are getting closer  She gasps startled as Indy enters and he retreats back into her bedroom as she reaches up to turn off a record player sitting on a ledge above the bathtub  He opens the bathroom door peering inside where Elsa is standing before a mirror wearing a silk bathrobe  The boat is close to the edge of the canal as Kazim steps ashore and walks away  Brody lowers the ice pack from his head and looks at  Elsa reaches up and pulls him back down to her  Whatever it is it's a cruciform sword a Christian cross that tapers down like the blades of a broadsword  She comes closer to him stomps her foot angrily and starts to walk away but Indy grabs her  Elsa joins Indy waiting in the ransacked room looking around in shock  A MercedesBenz glides through the sharp mountain curves superimposed over a map that charts their course from Venice across Austria toward Salzburg as storm clouds darken the skies Indy smiles slyly as they fall to the bed  He goes in and finds that Elsa's bedroom is in a similar ransacked state to his own  the wind of the blades is on their necks  Indy wearing a bathrobe leans over to study the impression  She looks to Indy who pulls the Grail Diary from his pocket  Now Elsa reaches for Indy and kisses him and he embraces her and Elsa begins to nibble at his ear  Indy closes the Grail Diary and puts it into the pocket of his robe opens the door and finds his bedroom has been ransacked with the mattress on the floor  He stops for a moment as he hears the gondolier singing  the drawers turned out  Indy grabs Kazim just in time and jumps into the motorboat driven by Elsa which gets alongside in the nick of time  Kazim pulls back his shirt to reveal a birthmark or is it a tattoo  Indy picks up the Grail Diary which covers two pages of the Diary and Brody's finger moves across it  A gondolier sings as he steers his gondola carrying two passengers past Indy's window "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "He is worried for her knocks and calls out steps into the room and knocks upon the bathroom door  He opens the bathroom door peering inside where Elsa is standing before a mirror wearing a silk bathrobe  She gasps startled as Indy enters and he retreats back into her bedroom as she reaches up to turn off a record player sitting on a ledge above the bathtub  Elsa joins Indy waiting in the ransacked room looking around in shock  She looks to Indy who pulls the Grail Diary from his pocket  She comes closer to him stomps her foot angrily and starts to walk away but Indy grabs her  He pulls her to him and kisses her  Now Elsa reaches for Indy and kisses him and he embraces her and Elsa begins to nibble at his ear  Indy smiles slyly as they fall to the bed  A gondolier sings as he steers his gondola carrying two passengers past Indy's window  Indy lies on top of Elsa kissing her  He stops for a moment as he hears the gondolier singing  Elsa reaches up and pulls him back down to her  A MercedesBenz glides through the sharp mountain curves superimposed over a map that charts their course from Venice across Austria toward Salzburg as storm clouds darken the skies By now half the boat has been chopped up into matchwood and the blades are getting closer  the wind of the blades is on their necks  Indy grabs Kazim just in time and jumps into the motorboat driven by Elsa which gets alongside in the nick of time  Kazim pulls back his shirt to reveal a birthmark or is it a tattoo  Whatever it is it's a cruciform sword a Christian cross that tapers down like the blades of a broadsword  The boat is close to the edge of the canal as Kazim steps ashore and walks away  Close on the watersoaked paper impression the rubbing taken from the shield of the Grail Knight  Brody is giving it careful study while he dabs the lump on the back of his head with an ice pack  Indy wearing a bathrobe leans over to study the impression  Brody lowers the ice pack from his head and looks at  Indy picks up the Grail Diary which covers two pages of the Diary and Brody's finger moves across it  Indy closes the Grail Diary and puts it into the pocket of his robe opens the door and finds his bedroom has been ransacked with the mattress on the floor  the drawers turned out  Indy approaches another door Elsa's bedroom and knocks  He goes in and finds that Elsa's bedroom is in a similar ransacked state to his own "
        }
      ]
    }
  ]
}