{
  "ground_truth": "A small sign in elegant neon scroll gives the name of the place, which sits on rolling green lawns. Evelyn's car pulls up before the elegant Spanish rest home, its entryway illuminated by streetlights. Gittes gets out of the car with Evelyn, offers her his arm, and they go up the walkway to the entrance. They are approached by an unctuous man in his forties, with a flower in his buttonhole, who gets a clear look at Gittes, bruised, with torn trousers. He sees Evelyn first, who shakes her head and can't quite conceal her surprise at his question, staring back at Gittes, amused and appalled, but she manages to nod. Gittes locks eyes with Palmer and points to the wall. After Evelyn looks, she turns to Gittes, who strolls toward the women knitting and working on a quilt. Two of the ladies giggle, while a third gives them a curt look and goes back to her knitting. Gittes approaches her and looks at the quilt, spotting the head of a fish among the rest of the crazy quilt pattern, with Evelyn beside him. Evelyn gestures as if there's someone behind Palmer, and Gittes looks up to see Palmer standing in the doorway, looking taut and a little drawn. Mulvihill walks up beside Gittes, and he makes the mistake of opening the glass door in the entryway, putting his back to Gittes momentarily. Gittes swiftly pulls Mulvihill's jacket up over his head, spins him around, and hammers away at him, beating him against the glass door and along the wall, pounding his fists into the cloth until it turns red and Mulvihill begins to sink to the red tile floor. Mulvihill's gun clatters to the floor. Gittes jumps in as she takes off across the lawn, tilting the elegant little neon sign as she goes. Evelyn drives, looking straight ahead, and after a moment takes one hand off the wheel to rub her left eye a little, as Gittes watches her. Gittes stands on the veranda, smoking a cigarette and staring off into the night, then turns as Evelyn comes out, carrying a tray with whiskey and an ice bucket. They drink, with Gittes looking sharply at her, and then she looks at him. They're very close now as she goes over a mouse very near his eye. The view shifts to include Gittes in bed, watching Evelyn next to him as she talks on the phone. Gittes stares at her silently, then she kisses him, rushes to the bathroom, and shuts the door. Gittes stares at the door for a moment.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "A diminutive notice in refined neon script gives the designation of the locale, which rests on undulating verdant lawns. Evelyn's vehicle halts before the refined Spanish convalescent home, its portal illuminated by streetlamps. Gittes exits the vehicle with Evelyn, proffers her his arm, and they proceed up the walkway to the entry. They are approached by an oily gentleman in his forties, with a blossom in his buttonhole, who gets a transparent view of Gittes, battered, with ripped trousers. He observes Evelyn first, who shakes her head and cannot quite mask her astonishment at his inquiry, staring back at Gittes, entertained and horrified, but she succeeds in nodding. Gittes locks eyes with Palmer and indicates the barrier. After Evelyn looks, she turns to Gittes, who saunters toward the women knitting and working on a patchwork. Two of the ladies titter, while a third gives them a terse look and goes back to her knitting. Gittes approaches her and examines the patchwork, noticing the skull of a fish among the rest of the eccentric patchwork design, with Evelyn beside him. Evelyn motions as if there is someone behind Palmer, and Gittes glances up to see Palmer standing in the portal, appearing tense and a bit haggard. Mulvihill strides up beside Gittes, and he makes the error of opening the glass portal in the entry, putting his back to Gittes momentarily. Gittes swiftly pulls Mulvihill's coat up over his head, spins him around, and pounds away at him, battering him against the glass portal and along the barrier, pounding his fists into the cloth until it turns crimson and Mulvihill begins to collapse to the crimson tile floor. Mulvihill's firearm clatters to the floor. Gittes leaps in as she takes off across the lawn, tilting the refined little neon notice as she goes. Evelyn drives, looking directly forward, and after a moment takes one hand off the wheel to rub her left eye a bit, as Gittes observes her. Gittes stands on the terrace, smoking a cigarette and staring off into the night, then turns as Evelyn emerges, bearing a tray with whiskey and an ice pail. They imbibe, with Gittes looking keenly at her, and then she gazes at him. They're very close now as she goes over a rodent very near his eye. The view shifts to include Gittes in bed, observing Evelyn next to him as she converses on the telephone. Gittes gazes at her silently, then she kisses him, rushes to the lavatory, and closes the portal. Gittes stares at the portal for a moment."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "A small sign in elegant neon scroll is given by the place's name, which is situated on rolling green lawns. Evelyn's car is pulled up before the elegant Spanish rest home, with its entryway illuminated by streetlights. The car is exited by Gittes with Evelyn, and his arm is offered to her, as the walkway to the entrance is approached by them. An unctuous man in his forties, with a flower in his buttonhole, approaches them, getting a clear look at Gittes, who is bruised and has torn trousers. Evelyn is seen by him first, who shakes her head and can't quite conceal her surprise at his question, staring back at Gittes, amused and appalled, but a nod is managed by her. Palmer locks eyes with Gittes, and the wall is pointed to by him. After looking, Evelyn turns to Gittes, who strolls toward the women knitting and working on a quilt. Giggles are given by two of the ladies, while a curt look is given by a third, who goes back to her knitting. Gittes approaches her and looks at the quilt, spotting the head of a fish among the rest of the crazy quilt pattern, with Evelyn beside him. Evelyn gestures as if there's someone behind Palmer, and Gittes looks up to see Palmer standing in the doorway, appearing taut and a little drawn. Next to Gittes, Mulvihill walks, and he makes the mistake of opening the glass door in the entryway, turning his back to Gittes momentarily. Mulvihill's jacket is swiftly pulled up over his head by Gittes, who spins him around and hammers away at him, beating him against the glass door and along the wall, pounding his fists into the cloth until it turns red, and Mulvihill begins to sink to the red tile floor. The floor is struck by Mulvihill's gun. Evelyn takes off across the lawn, tilting the elegant little neon sign as she goes, as Gittes jumps in. Evelyn drives, looking straight ahead, and after a moment, her left eye is rubbed a little by her as Gittes watches her. On the veranda, a cigarette is smoked by Gittes, who stares off into the night, then turns as Evelyn comes out carrying a tray with whiskey and an ice bucket. They drink, with Evelyn looked at sharply by Gittes, and then he is looked at by her. They're very close now as a mouse very near his eye is gone over by her. The view shifts to show Gittes in bed, watching Evelyn next to him as she talks on the phone. He stares at her silently, then is kissed by her, who rushes to the bathroom and shuts the door. For a moment, the door is stared at by Gittes."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "A small neon sign elegantly names the place on green lawns. Evelyn's car stops at the Spanish rest home, entryway lit by streetlights. Gittes exits with Evelyn, offering his arm, and they walk to the entrance. A man in his forties, with a flower in his buttonhole, notices Gittes's bruised appearance and torn trousers. Evelyn is surprised by his question, looking at Gittes amused and appalled but nods. Gittes points to the wall, and Evelyn turns to see him approach women knitting a quilt. Two ladies giggle, while a third, curt, resumes knitting. Gittes spots a fish pattern in the quilt with Evelyn beside him. Evelyn gestures to someone behind Palmer, and Gittes sees him looking drawn. Mulvihill approaches Gittes, who swiftly lifts Mulvihill's jacket, spins and beats him against the glass door until it turns red, causing Mulvihill to sink, dropping his gun. Evelyn drives off, tilting the neon sign. She rubs her left eye while Gittes observes. On the veranda, Gittes smokes a cigarette, staring into the night until Evelyn brings whiskey. Drinking, they are close, with Evelyn examining a mark near Gittes's eye. In bed, Gittes watches Evelyn on the phone, kisses her, then she rushes to the bathroom, leaving him staring at the door."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "A neon sign names the place on green lawns. Evelyn parks by the Spanish rest home, lit by streetlights. Gittes exits the car with Evelyn, offering his arm, and they walk to the entrance. A man with a flower in his buttonhole sees Gittes's bruised face and torn trousers. Evelyn is surprised, nodding at Gittes, who points to a wall. Evelyn looks, then Gittes approaches women quilting. Two giggle, a third gives a curt look. Gittes notices a fish pattern in the quilt. Evelyn gestures, and Gittes sees Palmer in the doorway, looking tense. Mulvihill nears Gittes and opens the glass door, turning his back. Gittes yanks Mulvihill's jacket over his head, beating him until he sinks to the floor, his gun falling. Gittes jumps in a car as Evelyn speeds off, tilting the neon sign. She drives, rubs her eye, with Gittes watching. On the veranda, Gittes smokes. Evelyn brings whiskey, and they drink, watching each other closely. They’re intimate, and Gittes is later in bed, watching Evelyn on the phone. She kisses him, rushes into the bathroom, and shuts the door, leaving Gittes staring."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "A modest yet captivating sign, crafted in elegant neon scroll, proudly displays the name of the establishment, which rests gracefully amid sprawling, verdant green lawns. As Evelyn's car approaches, it comes to a stop before the stately Spanish-style rest home, whose entrance is softly aglow under the streetlights' tender illumination. With a gentlemanly gesture, Gittes exits the vehicle alongside Evelyn, courteously offering her his arm, and together they proceed along the pathway leading to the grand entrance.\n\nTheir approach is intercepted by a man of a somewhat unctuous demeanor, appearing to be in his forties, adorned with a flower prominently placed in his buttonhole. His eyes fixate intently on Gittes, noting his bruised face and the telltale signs of wear on his torn trousers. Initially, his gaze falls upon Evelyn, who, caught off guard, shakes her head and struggles to mask her surprise at the man's query. She casts a glance towards Gittes, her expression a blend of amusement and astonishment, yet manages a polite nod in response. Gittes, with a firm and pointed gesture, directs Palmer's attention to the wall.\n\nFollowing Gittes' lead, Evelyn turns to observe the scene, subsequently shifting her focus back to Gittes as he leisurely saunters toward a group of women, some of whom are diligently engaged in knitting and quilting. Two of these ladies cannot suppress a lighthearted giggle, while a third regards them with a curt, disapproving glance before resuming her knitting. Gittes draws nearer to her, examining the quiltwork closely, discerning a fish's head embedded within the intricate pattern of the crazy quilt, Evelyn standing by his side as this unfolds. Evelyn subtly gestures towards an unseen presence behind Palmer, prompting Gittes to glance upward and notice Palmer stationed in the doorway, appearing somewhat tense and drawn.\n\nAt this juncture, Mulvihill arrives, positioning himself beside Gittes. He inadvertently makes an error by opening the glass door of the entryway, inadvertently turning his back to Gittes. Seizing the opportunity, Gittes swiftly maneuvers, pulling Mulvihill's jacket over his head, then spins him around and relentlessly pounds him against the glass door and along the wall, landing blow after blow until the fabric becomes stained crimson and Mulvihill begins to slump towards the red tile floor. The gun in Mulvihill's possession slips from his grasp and clatters to the ground.\n\nGittes makes a quick decision, joining Evelyn as she dashes across the lawn, inadvertently nudging the elegant little neon sign in her haste. Evelyn, focused and determined, drives straight ahead, and after a moment, she lifts her hand off the steering wheel to rub her left eye thoughtfully, all the while being observed by Gittes. Meanwhile, Gittes stands contemplatively on the veranda, smoking a cigarette, his gaze distant as he peers into the night. His attention shifts as Evelyn emerges, carrying a tray laden with whiskey and an ice bucket. They share a drink, Gittes scrutinizing her with a penetrating gaze before their eyes meet.\n\nNow in close proximity, she tends to a small blemish near his eye. The scene transitions, capturing Gittes lying in bed, observing Evelyn intently as she engages in a phone conversation next to him. Gittes is silent, his eyes fixated on her, before she leans in to kiss him, then hastily retreats to the bathroom, closing the door behind her. For a brief moment, Gittes continues to stare at the door, lost in thought."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "A modest yet captivating sign, thoughtfully crafted in elegant neon scroll, proudly showcases the name of this particular establishment. It rests gracefully amidst sprawling, verdant green lawns that stretch expansively before it. As Evelyn's car makes its approach, it gently comes to a complete stop in front of the stately Spanish-style rest home. The entrance of this distinguished building is softly aglow under the streetlights' tender illumination, casting a warm and inviting light. With a gentlemanly gesture filled with courteous intent, Gittes exits the vehicle alongside Evelyn, courteously offering her his arm. Together, they proceed along the carefully laid pathway that leads to the grand entrance of the home.\n\nTheir approach is soon intercepted by a man who carries himself with a somewhat unctuous demeanor. He appears to be somewhere in his forties and is adorned with a prominent flower that is carefully placed in his buttonhole. His eyes fixate intently on Gittes, taking note of his bruised face and the telltale signs of wear on his torn trousers. Initially, his gaze falls upon Evelyn, who is caught off guard. She shakes her head and struggles to mask her surprise at the unexpected query posed by the man. She glances towards Gittes, her expression a unique blend of amusement and astonishment, yet she manages to offer a polite nod in response. Gittes, with a firm and pointed gesture, directs Palmer's attention to the wall.\n\nFollowing Gittes' lead, Evelyn turns to observe the scene before her. She subsequently shifts her focus back to Gittes as he leisurely saunters toward a nearby group of women, some of whom are diligently engaged in knitting and quilting. Two of these ladies cannot suppress a lighthearted giggle, while a third one regards them with a curt, disapproving glance before resuming her knitting. Gittes draws nearer to this third lady, taking the time to examine the quiltwork closely. He discerns a fish's head embedded within the intricate pattern of the crazy quilt, Evelyn standing by his side as this unfolds in front of them. Evelyn subtly gestures towards an unseen presence behind Palmer, prompting Gittes to glance upward and notice Palmer stationed in the doorway, appearing somewhat tense and drawn.\n\nAt this particular juncture, Mulvihill arrives on the scene, positioning himself beside Gittes. He inadvertently makes an error by opening the glass door of the entryway, turning his back to Gittes without realizing. Seizing this opportunity, Gittes swiftly maneuvers, pulling Mulvihill's jacket over his head. He spins him around and relentlessly pounds him against both the glass door and the wall, landing blow after forceful blow until the fabric becomes stained with crimson and Mulvihill begins to slump towards the red-tiled floor. The gun in Mulvihill's possession slips from his grasp and makes a loud clatter as it hits the ground.\n\nMaking a quick decision, Gittes joins Evelyn as she dashes across the spacious lawn, inadvertently nudging the elegant little neon sign in her haste. Evelyn, focused and determined, drives straight ahead, maintaining her course. After a brief moment, she lifts her hand off the steering wheel to thoughtfully rub her left eye, all the while being closely observed by Gittes. Meanwhile, Gittes remains standing contemplatively on the veranda. Smoking a cigarette, his gaze is distant as he peers into the dark expanse of the night. His attention shifts as Evelyn emerges, carrying a tray laden with whiskey and an ice bucket. They share a drink together, Gittes scrutinizing her with a penetrating gaze before their eyes meet in a moment of understanding.\n\nNow in very close proximity, she tends to a small blemish near his eye with gentle care. The scene transitions smoothly, capturing Gittes as he lies in bed, observing Evelyn intently while she engages in a phone conversation next to him. Gittes remains silent, his eyes steadfastly fixated on her, before she leans in to give him a quick, tender kiss, then hastily retreats to the bathroom, closing the door behind her with a soft click. For a brief moment, Gittes continues to stare at the door, his mind lost in thought as he ponders the evening's events."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "A small, elegantly crafted neon sign emits a soft glow, advertising the name of the establishment, which is nestled amidst expansive, rolling green lawns. Evelyn's car gradually decelerates and smoothly pulls up in front of the sophisticated Spanish-style rest home, its entryway softly bathed in the ambient light of nearby street lamps. Gittes carefully steps out of the vehicle, followed closely by Evelyn, and attentively extends his arm towards her in a polite gesture. Together, they proceed up the walkway, moving toward the entrance with an air of purpose. As they near the door, an obsequious man in his forties, distinguished by a flower placed jauntily in his buttonhole, approaches them. He catches a full view of Gittes, who bears visible bruises and sports torn trousers, suggesting a recent altercation. The man first notices Evelyn, who, upon hearing his unexpected question, shakes her head and struggles to fully mask her surprise. She momentarily locks eyes with Gittes, her expression oscillating between amusement and shock, but ultimately she manages to nod in acknowledgement. Gittes, maintaining direct eye contact with a man named Palmer, raises his finger to point at the wall, prompting Evelyn to follow his gaze. She then turns her attention back to Gittes, who begins to casually meander toward a group of women who are engrossed in knitting and quilting. As he approaches, two of the ladies burst into a fit of giggles, while a third casts a disapproving glance in their direction before resuming her focus on her knitting. Gittes steps closer to her, examining the intricate quilt and immediately noticing the distinct shape of a fish’s head woven into the otherwise chaotic pattern. Evelyn stands beside him, subtly gesturing as if to indicate someone’s presence behind Palmer. Gittes redirects his attention upward, spotting Palmer standing in the doorway, his expression taut and slightly strained. At that moment, Mulvihill strolls up beside Gittes and, in a careless lapse of attention, opens the glass door at the entryway, inadvertently turning his back to Gittes. Seizing the opportunity, Gittes swiftly jerks Mulvihill's jacket up over his head, using it as leverage to spin him around, before launching into a series of forceful blows. He relentlessly slams Mulvihill's body against the glass door and against the wall, pummeling his fists through the heavy fabric until it is stained with red. Mulvihill, weakened and off-balance, begins to collapse toward the red-tiled floor, his firearm slipping from his grasp and clattering onto the ground. In a moment of urgency, Gittes leaps into action as Evelyn makes a hasty retreat across the lawn, the force of her departure causing the dainty neon sign to tilt precariously. Behind the wheel, Evelyn drives with her gaze fixed straight ahead, her focus interrupted only as she briefly lifts one hand from the wheel to gently rub her left eye, all the while Gittes watching her intently. Later, Gittes finds himself standing on the veranda, leisurely smoking a cigarette and gazing contemplatively into the night. He turns at the sound of Evelyn’s approach as she emerges, delicately balancing a tray laden with whiskey and an ice bucket. They pour and sip the drinks, with Gittes casting a penetrating look at Evelyn, who in turn meets his gaze with equal intensity. Their proximity increases as she attentively examines a small mouse situated very near to his eye. The scene transitions to reveal Gittes lying in bed, quietly observing Evelyn beside him as she engages in a conversation on the phone. He continues to watch her in silence until she ends the call, leans over to kiss him, and then hurries into the bathroom, firmly closing the door behind her. Gittes fixates on the door, momentarily lost in thought."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "A small neon sign identifies the Spanish rest home, nestled on rolling green lawns, as Evelyn's car arrives and parks under the glow of streetlights. Gittes exits with Evelyn, and together they walk up the entrance pathway. They encounter an unctuous man, who notices Gittes' bruised appearance and torn trousers. Initially surprised by the man's inquiry, Evelyn acknowledges him, while Gittes exchanges a pointed glance with Palmer and gestures toward the wall. After Evelyn looks, they move toward a group of women working on a quilt. Amidst giggles and curt glances, Gittes examines the quilt with Evelyn, noticing a fish pattern. Evelyn gestures toward Palmer, standing tensely in the doorway. As Mulvihill approaches, Gittes seizes the opportunity to overpower him, swiftly attacking and subduing him against the glass door, causing Mulvihill’s gun to fall to the floor. Evelyn drives away swiftly across the lawn, slightly adjusting the neon sign. Meanwhile, Gittes stands on the veranda, smoking and reflecting, until Evelyn returns with whiskey. They share a tense moment, locking eyes before growing closer. Later, Gittes lies in bed, observing Evelyn on the phone. She kisses him lightly before retreating to the bathroom, leaving Gittes contemplating as he watches the door close."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "A small sign in elegant neon scroll, reminiscent of 1940s art deco design, gives the name of the place, which sits on rolling green lawns reminiscent of the manicured landscapes typical of Southern Californian estates. Evelyn's car pulls up before the elegant Spanish rest home, its architecture echoing the famous Spanish Revival style popular in the early 20th century, with its entryway illuminated by streetlights casting a soft glow. Gittes gets out of the car with Evelyn, offers her his arm, and they walk up the sandstone walkway to the entrance. They are approached by an unctuous man in his forties, with a flower in his buttonhole, likely a symbol of his pretentious demeanor, who gets a clear look at Gittes, bruised from an earlier confrontation, with torn trousers hinting at recent troubles. He sees Evelyn first, who shakes her head and can't quite conceal her surprise at his question, staring back at Gittes with a mix of amusement and appraisal, but she manages to nod in agreement. Gittes locks eyes with Palmer, a figure from Evelyn's past, and points to the wall. After Evelyn looks, she turns to Gittes, who strolls toward the women knitting and working on a quilt, an art form often passed down through generations. Two of the ladies giggle, while a third gives them a curt look and goes back to her knitting in a huff. Gittes approaches her and examines the quilt, spotting the head of a fish among the rest of the crazy quilt pattern, a unique patchwork style, with Evelyn beside him. Evelyn gestures subtly as if there's someone behind Palmer, and Gittes looks up to see Palmer standing in the doorway, looking taut and a little drawn, perhaps from the stress of the ongoing situation. Mulvihill, whose reputation for being a hard man precedes him, walks up beside Gittes, and he makes the mistake of opening the glass door in the entryway, putting his back to Gittes momentarily. Gittes swiftly pulls Mulvihill's jacket up over his head, spins him around, and hammers away at him with the precision of a seasoned street brawler, beating him against the glass door and along the wall, pounding his fists into the cloth until it turns red and Mulvihill begins to sink to the red tile floor, a vivid design choice evoking traditional Spanish interiors. Mulvihill's gun clatters to the floor with a metallic thud. Gittes jumps in as she takes off across the lawn, tilting the elegant little neon sign advertising the exclusive nature of the rest home as she goes. Evelyn drives, looking straight ahead, and after a moment takes one hand off the wheel to rub her left eye a little in a gesture of fatigue, as Gittes watches her with quiet concern. Gittes stands on the veranda, smoking a cigarette thoughtfully and staring off into the night, the cool breeze carrying the scent of nearby jasmine, then turns as Evelyn comes out, carrying a tray with whiskey, distilled in the traditional manner, and an ice bucket. They drink, with Gittes looking sharply at her, and then she looks at him with intensity. They're very close now as she goes over a mouse very near his eye, an intimate gesture with deeper implications. The view shifts to include Gittes in bed, watching Evelyn next to him as she talks on the phone in a hushed tone. Gittes stares at her silently, then she kisses him softly, rushes to the bathroom, and shuts the door with a sense of urgency. Gittes stares at the door for a moment, contemplating the night's events."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Gittes approaches her and looks at the quilt spotting the head of a fish among the rest of the crazy quilt pattern with Evelyn beside him Mulvihill walks up beside Gittes and he makes the mistake of opening the glass door in the entryway putting his back to Gittes momentarily A small sign in elegant neon scroll gives the name of the place which sits on rolling green lawns Two of the ladies giggle while a third gives them a curt look and goes back to her knitting A small sign in elegant neon scroll gives the name of the place which sits on rolling green lawns Evelyn's car pulls up before the elegant Spanish rest home its entryway illuminated by streetlights Gittes gets out of the car with Evelyn offers her his arm and they go up the walkway to the entrance They are very close now as she goes over a mouse very near his eye He sees Evelyn first who shakes her head and cannot quite conceal her surprise at his question staring back at Gittes amused and appalled but she manages to nod They are approached by an unctuous man in his forties with a flower in his buttonhole who gets a clear look at Gittes bruised with torn trousers He sees Evelyn first who shakes her head and cannot quite conceal her surprise at his question staring back at Gittes amused and appalled but she manages to nod Gittes locks eyes with Palmer and points to the wall Gittes swiftly pulls Mulvihill's jacket up over his head spins him around and hammers away at him beating him against the glass door and along the wall pounding his fists into the cloth until it turns red and Mulvihill begins to sink to the red tile floor After Evelyn looks she turns to Gittes who strolls toward the women knitting and working on a quilt Evelyn's car pulls up before the elegant Spanish rest home its entryway illuminated by streetlights Two of the ladies giggle while a third gives them a curt look and goes back to her knitting Gittes approaches her and looks at the quilt spotting the head of a fish among the rest of the crazy quilt pattern with Evelyn beside him Evelyn gestures as if there is someone behind Palmer and Gittes looks up to see Palmer standing in the doorway looking taut and a little drawn Mulvihill walks up beside Gittes and he makes the mistake of opening the glass door in the entryway putting his back to Gittes momentarily then she kisses him rushes to the bathroom and shuts the door Gittes swiftly pulls Mulvihill's jacket up over his head spins him around and hammers away at him beating him against the glass door and along the wall pounding his fists into the cloth until it turns red and Mulvihill begins to sink to the red tile floor Mulvihill's gun clatters to the floor They are approached by an unctuous man in his forties with a flower in his buttonhole who gets a clear look at Gittes bruised with torn trousers Gittes jumps in as she takes off across the lawn tilting the elegant little neon sign as she goes Evelyn drives looking straight ahead and after a moment takes one hand off the wheel to rub her left eye a little as Gittes watches her Gittes stands on the veranda smoking a cigarette and staring off into the night then turns as Evelyn comes out carrying a tray with whiskey and an ice bucket The view shifts to include Gittes in bed watching Evelyn next to him as she talks on the phone They drink with Gittes looking sharply at her and then she looks at him Gittes stares at her silently They are very close now as she goes over a mouse very near his eye The view shifts to include Gittes in bed watching Evelyn next to him as she talks on the phone Gittes stares at her silently then she kisses him rushes to the bathroom and shuts the door Gittes stares at the door for a moment"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "A small sign in elegant neon scroll gives the name of the place which sits on rolling green lawns. Evelyn's car pulls up before the elegant Spanish rest home its entryway illuminated by streetlights. Gittes gets out of the car with Evelyn offers her his arm and they go up the walkway to the entrance. They are approached by an unctuous man in his forties with a flower in his buttonhole who gets a clear look at Gittes bruised with torn trousers. He sees Evelyn first who shakes her head and cannot quite conceal her surprise at his question staring back at Gittes amused and appalled but she manages to nod. Gittes locks eyes with Palmer and points to the wall. After Evelyn looks she turns to Gittes who strolls toward the women knitting and working on a quilt. Two of the ladies giggle while a third gives them a curt look and goes back to her knitting. Gittes approaches her and looks at the quilt spotting the head of a fish among the rest of the crazy quilt pattern with Evelyn beside him. Evelyn gestures as if there is someone behind Palmer and Gittes looks up to see Palmer standing in the doorway looking taut and a little drawn. Mulvihill walks up beside Gittes and he makes the mistake of opening the glass door in the entryway putting his back to Gittes momentarily. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Gittes swiftly pulls Mulvihill's jacket up over his head spins him around and hammers away at him beating him against the glass door and along the wall pounding his fists into the cloth until it turns red and Mulvihill begins to sink to the red tile floor. Mulvihill's gun clatters to the floor. Gittes jumps in as she takes off across the lawn tilting the elegant little neon sign as she goes. Evelyn drives looking straight ahead and after a moment takes one hand off the wheel to rub her left eye a little as Gittes watches her. Gittes stands on the veranda smoking a cigarette and staring off into the night. then turns as Evelyn comes out carrying a tray with whiskey and an ice bucket. They drink with Gittes looking sharply at her and then she looks at him. They are very close now as she goes over a mouse very near his eye. The view shifts to include Gittes in bed watching Evelyn next to him as she talks on the phone. Gittes stares at her silently. then she kisses him rushes to the bathroom and shuts the door. Gittes stares at the door for a moment."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "A small sign in elegant neon scroll gives the name of the place which sits on rolling green lawns. Evelyn's car pulls up before the elegant Spanish rest home its entryway illuminated by streetlights. Gittes gets out of the car with Evelyn offers her his arm and they go up the walkway to the entrance. They are approached by an unctuous man in his forties with a flower in his buttonhole who gets a clear look at Gittes bruised with torn trousers. He sees Evelyn first who shakes her head and cannot quite conceal her surprise at his question staring back at Gittes amused and appalled but she manages to nod. Gittes locks eyes with Palmer and points to the wall. After Evelyn looks she turns to Gittes who strolls toward the women knitting and working on a quilt. Two of the ladies giggle while a third gives them a curt look and goes back to her knitting. Gittes approaches her and looks at the quilt spotting the head of a fish among the rest of the crazy quilt pattern with Evelyn beside him. Evelyn gestures as if there is someone behind Palmer and Gittes looks up to see Palmer standing in the doorway looking taut and a little drawn. Mulvihill walks up beside Gittes and he makes the mistake of opening the glass door in the entryway putting his back to Gittes momentarily. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. Gittes swiftly pulls Mulvihill's jacket up over his head spins him around and hammers away at him beating him against the glass door and along the wall pounding his fists into the cloth until it turns red and Mulvihill begins to sink to the red tile floor. Mulvihill's gun clatters to the floor. Gittes jumps in as she takes off across the lawn tilting the elegant little neon sign as she goes. Evelyn drives looking straight ahead and after a moment takes one hand off the wheel to rub her left eye a little as Gittes watches her. Gittes stands on the veranda smoking a cigarette and staring off into the night. then turns as Evelyn comes out carrying a tray with whiskey and an ice bucket. They drink with Gittes looking sharply at her and then she looks at him. They are very close now as she goes over a mouse very near his eye. The view shifts to include Gittes in bed watching Evelyn next to him as she talks on the phone. Gittes stares at her silently. then she kisses him rushes to the bathroom and shuts the door. Gittes stares at the door for a moment."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "A small sign in elegant neon scroll gives the name of the place which sits on rolling green lawns. Evelyn's car pulls up before the elegant Spanish rest home its entryway illuminated by streetlights. Gittes gets out of the car with Evelyn offers her his arm and they go up the walkway to the entrance. They are approached by an unctuous man in his forties with a flower in his buttonhole who gets a clear look at Gittes bruised with torn trousers. He sees Evelyn first who shakes her head and cannot quite conceal her surprise at his question staring back at Gittes amused and appalled but she manages to nod. Gittes locks eyes with Palmer and points to the wall. They drink with Gittes looking sharply at her and then she looks at him. They are very close now as she goes over a mouse very near his eye. The view shifts to include Gittes in bed watching Evelyn next to him as she talks on the phone. Gittes stares at her silently. then she kisses him rushes to the bathroom and shuts the door. Gittes stares at the door for a moment."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "A small sign in elegant neon scroll gives the name of the place which sits on rolling green lawns. Evelyn's car pulls up before the elegant Spanish rest home its entryway illuminated by streetlights. Gittes stares at her silently. then she kisses him rushes to the bathroom and shuts the door. Gittes stares at the door for a moment."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "A small sign in elegant neon scroll gives the name of the place, which sits on rolling green lawns. Henry's bike pulls up before the elegant Spanish rest home, its entryway illuminated by streetlights. Larson gets out of the bike with Henry, offers her his arm, and they go up the walkway to the entrance. They are approached by a mischievous child in his forties, with a flower in his buttonhole, who gets a clear look at Larson, bruised, with torn trousers. He sees Henry first, who shakes her head and can't quite conceal her surprise at his question, staring back at Larson, amused and appalled, but she manages to nod. Larson locks eyes with Bennett and points to the wall. After Henry looks, she turns to Larson, who strolls toward the women knitting and working on a quilt. Two of the ladies giggle, while a third gives them a curt look and goes back to her knitting. Larson approaches her and looks at the quilt, spotting the head of a fish among the rest of the crazy quilt pattern, with Henry beside him. Henry gestures as if there's someone behind Bennett, and Larson looks up to see Bennett standing in the doorway, looking taut and a little drawn. Peterson walks up beside Larson, and he makes the mistake of opening the glass door in the entryway, putting his back to Larson momentarily. Larson swiftly pulls Peterson's jacket up over his head, spins him around, and hammers away at him, beating him against the glass door and along the wall, pounding his fists into the cloth until it turns red and Peterson begins to sink to the red tile floor. Peterson's gun clatters to the floor. Larson jumps in as she takes off across the lawn, tilting the elegant little neon sign as she goes. Henry drives, looking straight ahead, and after a moment takes one hand off the wheel to rub her left eye a little, as Larson watches her. Larson stands on the veranda, smoking a cigarette and staring off into the night, then turns as Henry comes out, carrying a tray with whiskey and an ice bucket. They drink, with Larson looking sharply at her, and then she looks at him. They're very close now as she goes over a mouse very near his eye. The view shifts to include Larson in bed, watching Henry next to him as she talks on the phone. Larson stares at her silently, then she kisses him, rushes to the bathroom, and shuts the door. Larson stares at the door for a moment."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "A small sign in elegant chalk script gives the name of the place, which sits on sandy dunes. Evelyn's bicycle pulls up before the elegant Italian villa, its entryway illuminated by lanterns. Gittes gets off the bicycle with Evelyn, offers her his arm, and they go up the boardwalk to the entrance. They are approached by an unctuous man in his forties, with a pinwheel in his buttonhole, who gets a clear look at Gittes, bruised, with torn overalls. He sees Evelyn first, who shakes her head and can't quite conceal her surprise at his question, staring back at Gittes, amused and appalled, but she manages to nod. Gittes locks eyes with Palmer and points to the hedges. After Evelyn looks, she turns to Gittes, who strolls toward the women painting and working on a mosaic. Two of the ladies giggle, while a third gives them a curt look and goes back to her painting. Gittes approaches her and looks at the mosaic, spotting the head of a turtle among the rest of the whimsical pattern, with Evelyn beside him. Evelyn gestures as if there's someone behind Palmer, and Gittes looks up to see Palmer standing in the archway, looking tense and a little worn. Mulvihill walks up beside Gittes, and he makes the mistake of opening the wooden gate in the entryway, putting his back to Gittes momentarily. Gittes swiftly pulls Mulvihill's scarf up over his head, spins him around, and hammers away at him, beating him against the wooden gate and along the hedges, pounding his fists into the cloth until it turns blue and Mulvihill begins to sink to the blue gravel path. Mulvihill's knife clatters to the ground. Gittes jumps in as she takes off across the dunes, tilting the elegant little chalk sign as she goes. Evelyn rides, looking straight ahead, and after a moment takes one hand off the handlebars to rub her left eye a little, as Gittes watches her. Gittes stands on the gazebo, sipping a martini and staring off into the night, then turns as Evelyn comes out, carrying a basket with lemonade and an ice bucket. They drink, with Gittes looking sharply at her, and then she looks at him. They're very close now as she goes over a pebble very near his eye. The view shifts to include Gittes in a hammock, watching Evelyn next to him as she talks on the walkie-talkie. Gittes stares at her silently, then she kisses him, rushes to the outhouse, and shuts the door. Gittes stares at the door for a moment."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "A small sign in elegant neon scroll reveals the name of the place, which rests on rolling green lawns. Evelyn's car arrives in front of the elegant Spanish rest home, its entryway shadowed by streetlights. Gittes steps out of the car with Evelyn, extends his arm to her, and they stroll along the walkway to the entrance. They are met by an unctuous man in his forties, with a flower in his buttonhole, who gets a good look at Gittes, bruised, with torn trousers. He notices Evelyn first, who nods her head and struggles to mask her surprise at his question, glancing back at Gittes, amused and appalled, but she continues to nod. Gittes exchanges a glance with Palmer and gestures toward the wall. After Evelyn looks, she turns to Gittes, who ambles toward the women knitting and working on a quilt. Two of the ladies chuckle, while a third gives them a sharp glance and resumes her knitting. Gittes nears her and examines the quilt, identifying the head of a fish amidst the rest of the crazy quilt pattern, with Evelyn beside him. Evelyn motions as if there's someone behind Palmer, and Gittes glances up to see Palmer stationed in the doorway, appearing tense and somewhat drawn. Mulvihill approaches Gittes, and he errs by pulling open the glass door in the entryway, momentarily turning his back to Gittes. Gittes deftly lifts Mulvihill's jacket over his head, twirls him around, and jabs at him, striking him against the glass door and along the wall, slamming his hands into the cloth until it turns red and Mulvihill begins to topple to the red tile floor. Mulvihill's gun slips to the floor. Gittes leaps in as she dashes across the lawn, nudging the elegant little neon sign as she goes. Evelyn maneuvers the car, staring directly ahead, and after a moment lifts one hand off the wheel to touch her left eye slightly, as Gittes observes her. Gittes stands on the veranda, puffing a cigarette and gazing into the night, then turns as Evelyn emerges, carrying a tray with whiskey and an ice bucket. They sip, with Gittes scrutinizing her, and then she regards him. They're very close now as she touches a hair very near his eye. The view shifts to show Gittes in bed, observing Evelyn beside him as she chats on the phone. Gittes gazes at her quietly, then she pecks him, dashes to the bathroom, and swings the door shut. Gittes gazes at the door for a moment."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "A small mailbox in elegant neon scroll gives the name of the bicycle, which sits on rolling green beaches. Oliver's suitcase pulls up before the elegant Italian art gallery, its entryway illuminated by televisions. Kensington gets out of the suitcase with Oliver, offers her his elbow, and they go up the runway to the gate. They are approached by a jubilant cat in his twenties, with a banana in his hat, who gets a clear look at Kensington, bruised, with torn pajamas. He sees Oliver first, who shakes her book and can't quite conceal her surprise at his question, staring back at Kensington, amused and appalled, but she manages to nod. Kensington locks eyes with Bradley and points to the curtain. After Oliver looks, she turns to Kensington, who strolls toward the clocks knitting and working on a ladder. Two of the maps giggle, while a third gives them a curt look and goes back to her knitting. Kensington approaches her and looks at the ladder, spotting the head of a chair among the rest of the crazy ladder pattern, with Oliver beside him. Oliver gestures as if there's someone behind Bradley, and Kensington looks up to see Bradley standing in the office, looking taut and a little drawn. Fortescue walks up beside Kensington, and he makes the mistake of opening the bookcase door in the entryway, putting his back to Kensington momentarily. Kensington swiftly pulls Fortescue's shirt up over his head, spins him around, and hammers away at him, beating him against the bookcase door and along the curtain, pounding his fists into the cloth until it turns red and Fortescue begins to sink to the red tile floor. Fortescue's shoe clatters to the floor. Kensington jumps in as she takes off across the field, tilting the elegant little neon mailbox as she goes. Oliver drives, looking straight ahead, and after a moment takes one hand off the wheel to rub her left knee a little, as Kensington watches her. Kensington stands on the terrace, smoking a candle and staring off into the night, then turns as Oliver comes out, carrying a bag with juice and an ice bucket. They drink, with Kensington looking sharply at her, and then she looks at him. They're very close now as she goes over a cat very near his nose. The view shifts to include Kensington in bed, watching Oliver next to him as she talks on the radio. Kensington stares at her silently, then she kisses him, rushes to the attic, and shuts the door. Kensington stares at the door for a moment."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "A giant mural in clunky LED letters reveals the name of the establishment, which rests on barren gray gravel. Carl's bicycle squeaks to a stop before the ornate French bistro, its facade shadowed by traffic lights. Lydia hops off the bicycle with Carl, pats him on the back, and they wander down the driveway to the foyer. They are intercepted by a grizzled woman in her sixties, with a brooch on her lapel, who takes a hard look at Lydia, disheveled, with mismatched shoes. She notices Carl first, who shrugs and fails to hide her bewilderment at his inquiry, gazing back at Lydia, entertained and distressed, but she manages to smile. Lydia averts her gaze from Tucker and gestures to the window. After Carl glances, he turns to Lydia, who meanders toward the children drawing and playing with blocks. Two of the kids chuckle, while a third shoots them a stern glance and returns to her drawing. Lydia nears her and scrutinizes the blocks, spotting the tail of a lizard among the rest of the jumbled block formation, with Carl beside her. Carl signals as if there's a creature behind Tucker, and Lydia peers up to spot Tucker leaning in the archway, looking tense and somewhat fatigued. Jensen strides up next to Lydia, and he foolishly swings the screen door in the foyer, turning his back to Lydia momentarily. Lydia deftly flips Jensen's scarf over her head, twirls him around, and slaps at her, pounding her against the screen door and along the fence, slapping her palms into the fabric until it turns blue and Jensen begins to collapse to the blue stone ground. Jensen's umbrella thuds to the ground. Lydia dashes in as he jogs across the gravel, shifting the ornate jumbo LED mural as he goes. Carl pedals, gazing straight ahead, and after a moment lifts one foot off the pedal to scratch her right ear briefly, as Lydia observes her. Lydia poses on the terrace, sipping a tea and gazing off into the dusk, then pivots as Carl steps out, holding a platter with cider and a fruit bowl. They sip, with Lydia gazing steadily at him, and then he reciprocates. They're quite near now as he skips over a feather very near her cheek. The scene transitions to show Lydia in a hammock, observing Carl beside him as he writes on the laptop. Lydia watches him quietly, then he hugs her, dashes to the garage, and presses the button. Lydia watches the button for a moment."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "A tiny placard in ornate fluorescent script reveals the name of the establishment, which rests on undulating sandy dunes. Evelyn's scooter glides to a stop in front of the luxurious Italian villa, its facade brightened by lampposts. Gittes hops off the scooter with Evelyn, hands her his elbow, and they saunter down the trail to the entrance. They are greeted by a greasy man in his forties, with a leaf in his lapel, who gets a good glance at Gittes, battered, with ripped jeans. He notices Evelyn first, who wags her finger and can't quite hide her shock at his inquiry, glaring back at Gittes, entertained and horrified, but she manages to bow slightly. Gittes locks eyes with Palmer and gestures toward the ceiling. After Evelyn glances, she turns to Gittes, who strides toward the women painting and piecing together a mosaic. Two of the ladies chuckle, while a third casts them a stern glance and returns to her painting. Gittes approaches her and examines the mosaic, spotting the face of a bird among the rest of the chaotic mosaic pattern, with Evelyn beside him. Evelyn motions as if there's someone above Palmer, and Gittes gazes up to see Palmer standing by the window, appearing tense and somewhat pale. Mulvihill strolls up beside Gittes, and he makes the error of closing the wooden door in the hallway, turning his back to Gittes temporarily. Gittes deftly pulls Mulvihill's hat over his face, spins him around, and pounds away at him, slamming him against the wooden door and along the wall, driving his elbows into the fabric until it turns blue and Mulvihill begins to slump to the blue carpeted floor. Mulvihill's badge clinks to the floor. Gittes leaps in as she sprints across the dunes, skewing the ornate little fluorescent placard as she moves. Evelyn rides, gazing straight ahead, and after a moment lifts one hand from the handlebars to scratch her right ear a little, as Gittes observes her. Gittes stands on the porch, puffing on a cigar and gazing out into the dusk, then pivots as Evelyn emerges, holding a platter with soda and a salt shaker. They sip, with Gittes glancing intensely at her, and then she peers at him. They're very close now as she brushes away a butterfly very near his nose. The scene shifts to show Gittes on a hammock, observing Evelyn beside him as she writes in a journal. Gittes gazes at her quietly, then she hugs him, dashes to the closet, and closes the door. Gittes gazes at the door for a moment."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "A large toad on rustic wooden panels states the motto of the forest, which rests on jagged rocky cliffs. Harold's trolley skids up before the rustic Egyptian spa, its porch darkened by sunbeams. Perkins leaps out of the trolley with Harold, lends him a paw, and they slink down the trail to the exit. They are intercepted by a grumpy woman in her sixties, with a feather in her bonnet, who gets a hazy glimpse at Perkins, cheerful, with clean sneakers. She spots Harold first, who nods and can't quite hide his joy at her whisper, glaring back at Perkins, bored and thrilled, but he manages to shrug. Perkins locks thoughts with Stanley and stomps to the ceiling. After Harold peeks, he turns to Perkins, who skips toward the children painting and scribbling on a scroll. Three of the kids chuckle, while another grants them a joyful grin and returns to his painting. Perkins addresses him and scans the scroll, noticing the tail of a parrot among the rest of the orderly scroll design, with Harold behind him. Harold signals as if there's someone under Stanley, and Perkins glances down to spot Stanley crouching under the ceiling, looking relaxed and a little content. O'Toole skips up behind Perkins, and he makes the blunder of shutting the wooden window in the porch, turning his face to Perkins momentarily. Perkins slowly shoves O'Toole's hat down over his toes, twirls him around, and jumps around him, hugging him against the wooden window and under the ceiling, gripping his elbows into the paper until it turns blue and O'Toole begins to float to the blue stone sky. O'Toole's shoe rustles to the sky. Perkins dives out as he lands on the cliff, shaking the rustic giant wooden toad as he stays. Harold kneels, glancing far below, and after some time places both feet on the ground to scratch his right knee a little, as Perkins watches him. Perkins sits on the meadow, eating an orange and glancing into the dusk, then turns as Harold emerges, holding a basket with lemonade and a sugar jar. They sip, with Perkins nodding softly at him, and then he glances at him. They're very far now as she trips over a rock very far from his foot. The scene shifts to exclude Perkins on a bench, hearing Harold far from him as she sings on the radio. Perkins listens to her loudly, then she hugs him, sneaks to the hallway, and leaves the room. Perkins listens to the room for some time."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "A neon sign marks the elegant Spanish rest home on green lawns. Evelyn and Gittes arrive, greeted by a man who notices Gittes' bruised appearance. They proceed inside, encountering women working on a quilt. Gittes notes a fish pattern on the quilt, while Evelyn gestures to someone behind Palmer. Seeing Palmer looking tense, Mulvihill approaches but makes a mistake by turning his back on Gittes, who then overpowers him, leaving Mulvihill injured and disarmed. Evelyn drives them away, rubbing her eye as Gittes observes her. Later, they share a drink on the veranda. Gittes watches Evelyn make a call, and then she kisses him before disappearing into the bathroom, leaving Gittes contemplative."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Gittes stares at the door for a moment then she kisses him rushes to the bathroom and shuts the door Gittes stares at her silently The view shifts to include Gittes in bed watching Evelyn next to him as she talks on the phone They are very close now as she goes over a mouse very near his eye They drink with Gittes looking sharply at her and then she looks at him then turns as Evelyn comes out carrying a tray with whiskey and an ice bucket Gittes stands on the veranda smoking a cigarette and staring off into the night Evelyn drives looking straight ahead and after a moment takes one hand off the wheel to rub her left eye a little as Gittes watches her Gittes jumps in as she takes off across the lawn tilting the elegant little neon sign as she goes Mulvihill's gun clatters to the floor Gittes swiftly pulls Mulvihill's jacket up over his head spins him around and hammers away at him beating him against the glass door and along the wall pounding his fists into the cloth until it turns red and Mulvihill begins to sink to the red tile floor Mulvihill walks up beside Gittes and he makes the mistake of opening the glass door in the entryway putting his back to Gittes momentarily Evelyn gestures as if there is someone behind Palmer and Gittes looks up to see Palmer standing in the doorway looking taut and a little drawn Gittes approaches her and looks at the quilt spotting the head of a fish among the rest of the crazy quilt pattern with Evelyn beside him Two of the ladies giggle while a third gives them a curt look and goes back to her knitting After Evelyn looks she turns to Gittes who strolls toward the women knitting and working on a quilt Gittes locks eyes with Palmer and points to the wall He sees Evelyn first who shakes her head and cannot quite conceal her surprise at his question staring back at Gittes amused and appalled but she manages to nod They are approached by an unctuous man in his forties with a flower in his buttonhole who gets a clear look at Gittes bruised with torn trousers Gittes gets out of the car with Evelyn offers her his arm and they go up the walkway to the entrance Evelyn's car pulls up before the elegant Spanish rest home its entryway illuminated by streetlights A small sign in elegant neon scroll gives the name of the place which sits on rolling green lawns"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "then turns as Evelyn comes out carrying a tray with whiskey and an ice bucket Gittes stands on the veranda smoking a cigarette and staring off into the night Gittes gets out of the car with Evelyn offers her his arm and they go up the walkway to the entrance Evelyn drives looking straight ahead and after a moment takes one hand off the wheel to rub her left eye a little as Gittes watches her Gittes locks eyes with Palmer and points to the wall Gittes jumps in as she takes off across the lawn tilting the elegant little neon sign as she goes They drink with Gittes looking sharply at her and then she looks at him Mulvihill's gun clatters to the floor Gittes stares at the door for a moment After Evelyn looks she turns to Gittes who strolls toward the women knitting and working on a quilt Evelyn gestures as if there is someone behind Palmer and Gittes looks up to see Palmer standing in the doorway looking taut and a little drawn Evelyn's car pulls up before the elegant Spanish rest home its entryway illuminated by streetlights The view shifts to include Gittes in bed watching Evelyn next to him as she talks on the phone Gittes swiftly pulls Mulvihill's jacket up over his head spins him around and hammers away at him beating him against the glass door and along the wall pounding his fists into the cloth until it turns red and Mulvihill begins to sink to the red tile floor Mulvihill walks up beside Gittes and he makes the mistake of opening the glass door in the entryway putting his back to Gittes momentarily then she kisses him rushes to the bathroom and shuts the door He sees Evelyn first who shakes her head and cannot quite conceal her surprise at his question staring back at Gittes amused and appalled but she manages to nod They are very close now as she goes over a mouse very near his eye Two of the ladies giggle while a third gives them a curt look and goes back to her knitting Gittes approaches her and looks at the quilt spotting the head of a fish among the rest of the crazy quilt pattern with Evelyn beside him A small sign in elegant neon scroll gives the name of the place which sits on rolling green lawns They are approached by an unctuous man in his forties with a flower in his buttonhole who gets a clear look at Gittes bruised with torn trousers Gittes stares at her silently"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Mulvihill's gun clatters to the floor Gittes jumps in as she takes off across the lawn tilting the elegant little neon sign as she goes Evelyn drives looking straight ahead and after a moment takes one hand off the wheel to rub her left eye a little as Gittes watches her Gittes stands on the veranda smoking a cigarette and staring off into the night then turns as Evelyn comes out carrying a tray with whiskey and an ice bucket They drink with Gittes looking sharply at her and then she looks at him They are very close now as she goes over a mouse very near his eye The view shifts to include Gittes in bed watching Evelyn next to him as she talks on the phone Gittes stares at her silently then she kisses him rushes to the bathroom and shuts the door Gittes stares at the door for a moment A small sign in elegant neon scroll gives the name of the place which sits on rolling green lawns Evelyn's car pulls up before the elegant Spanish rest home its entryway illuminated by streetlights Gittes gets out of the car with Evelyn offers her his arm and they go up the walkway to the entrance They are approached by an unctuous man in his forties with a flower in his buttonhole who gets a clear look at Gittes bruised with torn trousers He sees Evelyn first who shakes her head and cannot quite conceal her surprise at his question staring back at Gittes amused and appalled but she manages to nod Gittes locks eyes with Palmer and points to the wall After Evelyn looks she turns to Gittes who strolls toward the women knitting and working on a quilt Two of the ladies giggle while a third gives them a curt look and goes back to her knitting Gittes approaches her and looks at the quilt spotting the head of a fish among the rest of the crazy quilt pattern with Evelyn beside him Evelyn gestures as if there is someone behind Palmer and Gittes looks up to see Palmer standing in the doorway looking taut and a little drawn Mulvihill walks up beside Gittes and he makes the mistake of opening the glass door in the entryway putting his back to Gittes momentarily Gittes swiftly pulls Mulvihill's jacket up over his head spins him around and hammers away at him beating him against the glass door and along the wall pounding his fists into the cloth until it turns red and Mulvihill begins to sink to the red tile floor"
        }
      ]
    }
  ]
}