{
  "ground_truth": "Indy finally manages to pull himself atop the tank once more where he punches Vogel over the side, then peers down to Henry, still inside the tank. Indy pulls Henry and Brody from the tank. Vogel pulls himself back atop the tank armed again with the shovel which he swings at Indy, who ducks and grabs Vogel's arm. As Indy winds up to punch Vogel he catches Brody in the face on the backswing, then completes the movement and knocks Vogel down. Vogel's hat sails in and falls to the floor. Before Indy can answer, Vogel is up and swinging with the shovel. Indy ducks but the shovel catches Henry sending him over the side and onto the moving tread. Indy grabs his whip, knocking Vogel aside. As Henry speeds toward the front of the tank to certain doom, Indy, with lightning speed, whips out his bullwhip, wrapping the end of the whip around Henry's right ankle. Sallah draws his horse next to the treads. He tips his fez to Henry. Vogel now punches Indy in the back and grabs him around the neck. Still, Indy refuses to let go of the whip. Sallah reaches out to Henry. Sallah manages to hold onto Henry as he brings his horse to a stop just at the cliff's edge. Indy finally frees himself of Vogel's grasp, twisting his arm painfully away from Indy's neck, then landing a hard blow to Vogel's head. Looks down at the fast-approaching cliff, his face filled with horror. We see his hat blow off and sail over the cliff's edge. The tank trundles over the cliff and plummets to the bottom. Henry, Brody, and Sallah look down at the flaming wreckage of the tank. Looking dazed and bewildered, Indy staggers up behind them. He joins the others at the edge of the cliff, looking down at the wreckage below with a bewildered expression. Finally, Henry becomes aware of his presence. He just looks at Indy, overcome with emotion. Finally, he throws his arms around him. And he becomes aware of his father's embrace. He hugs his father back. Brody and Sallah are moved by this sudden reconciliation. Henry pats Indy on the back and Indy collapses, sitting hard on the rocky cliff edge. Unaware, Henry, Sallah, and Brody start to walk away. Henry turns and walks toward the horse with Brody and Sallah. Suddenly the fedora, borne on the wind, blows into scene and lands at Indy's feet. Donovan peers through binoculars to see the Canyon of the Crescent Moon. He lowers the binoculars and turns to Elsa. Now Elsa peers through the binoculars. Indy, Henry, Sallah, and Brody ride into the canyon. Now we turn a corner and they see the hidden city.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Indy finally contrives to haul himself atop the tank once more where he strikes Vogel over the side, then gazes down to Henry, still within the tank. Indy pulls Henry and Brody from the tank. Vogel drags himself back atop the tank armed again with the spade which he swings at Indy, who ducks and grabs Vogel's limb. As Indy winds up to punch Vogel he catches Brody in the visage on the backswing, then completes the motion and knocks Vogel down. Vogel's cap sails in and drops to the floor. Before Indy can respond, Vogel is up and swinging with the spade. Indy ducks but the spade catches Henry sending him over the side and onto the moving tread. Indy grabs his lash, knocking Vogel aside. As Henry speeds toward the front of the tank to certain ruin, Indy, with lightning velocity, whips out his bullwhip, wrapping the end of the lash around Henry's right ankle. Sallah draws his steed next to the treads. He tips his fez to Henry. Vogel now punches Indy in the back and grabs him around the neck. Still, Indy refuses to let go of the lash. Sallah reaches out to Henry. Sallah contrives to hold onto Henry as he brings his steed to a stop just at the precipice's edge. Indy finally frees himself of Vogel's grasp, twisting his limb painfully away from Indy's neck, then landing a hard strike to Vogel's head. Looks down at the fast-approaching precipice, his visage filled with terror. We see his cap blow off and sail over the precipice's edge. The tank trundles over the precipice and plummets to the bottom. Henry, Brody, and Sallah gaze down at the flaming debris of the tank. Looking stunned and bewildered, Indy staggers up behind them. He joins the others at the edge of the precipice, gazing down at the debris below with a bewildered expression. Finally, Henry becomes aware of his presence. He just gazes at Indy, overcome with sentiment. Finally, he throws his limbs around him. And he becomes aware of his father's embrace. He hugs his father back. Brody and Sallah are moved by this sudden reconciliation. Henry pats Indy on the back and Indy collapses, sitting hard on the rocky precipice edge. Unaware, Henry, Sallah, and Brody start to walk away. Henry turns and walks toward the steed with Brody and Sallah. Suddenly the fedora, carried on the wind, blows into scene and lands at Indy's feet. Donovan peers through binoculars to see the Canyon of the Crescent Moon. He lowers the binoculars and turns to Elsa. Now Elsa peers through the binoculars. Indy, Henry, Sallah, and Brody ride into the canyon. Now we turn a corner and they see the concealed city."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Indy finally manages to be pulled atop the tank once more where Vogel is punched by him over the side, then peered down by him to Henry, who is still inside the tank. Henry and Brody are pulled from the tank by Indy. Vogel pulls himself back atop the tank armed again with the shovel which is swung at Indy by him, who ducks and grabs Vogel's arm. As Vogel is wound up to be punched by Indy, Brody is caught in the face by him on the backswing, then the movement is completed by him and Vogel is knocked down. Vogel's hat sails in and falls to the floor. Before Vogel can be answered by Indy, up is Vogel and swinging with the shovel. Henry is caught by the shovel when Indy ducks, sending him over the side and onto the moving tread. Vogel is knocked aside by Indy as he grabs his whip. As Henry speeds toward the front of the tank to certain doom, with lightning speed, the bullwhip is whipped out by Indy, wrapping the end of the whip around Henry's right ankle. His horse is drawn by Sallah next to the treads. Henry is tipped to by him with his fez. Indy is now punched in the back by Vogel, and he grabs Indy around the neck. Still, the whip is refused to be let go of by Indy. Henry is reached out to by Sallah. Henry is managed to be held onto by Sallah as the horse is brought by him to a stop just at the cliff's edge. Vogel's grasp is finally freed from by Indy, who twists his arm painfully away from Indy's neck, then a hard blow is landed to Vogel's head. His face filled with horror looks down at the fast-approaching cliff. We see his hat blow off and sail over the cliff's edge. The cliff is trundled over by the tank and it plummets to the bottom. The flaming wreckage of the tank is looked down at by Henry, Brody, and Sallah. Looking dazed and bewildered, up staggers Indy behind them. The edge of the cliff is joined by him at with the others, looking down at the wreckage below with a bewildered expression. Finally, Indy's presence becomes aware to Henry. He just looks at Indy, overcome with emotion. Finally, his arms are thrown around Indy by him. And his father's embrace becomes aware to him. His father is hugged back by him. This sudden reconciliation moves Brody and Sallah. Indy is patted on the back by Henry, and to the rocky cliff edge, Indy collapses, sitting hard. Unaware, away start to walk Henry, Sallah, and Brody. To the horse turns Henry and walks toward it with Brody and Sallah. Suddenly the fedora, borne on the wind, is blown into the scene and it lands at Indy's feet. Donovan peers through binoculars to see the Canyon of the Crescent Moon. The binoculars are lowered by him and Elsa is turned to by him. Now through the binoculars, Elsa peers. Into the canyon ride Indy, Henry, Sallah, and Brody. Now a corner is turned and they see the hidden city."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Indy climbs atop the tank, punches Vogel over the side, and helps Henry and Brody out. Vogel returns with a shovel, swinging at Indy, who ducks and grabs Vogel's arm. Indy accidentally hits Brody, then knocks Vogel down. Vogel's hat falls. Vogel attacks again, hitting Henry, who falls onto the moving tread. Indy uses his whip to save Henry, while Sallah rides alongside, helping Henry to safety. Vogel grabs Indy, but Indy breaks free and punches him. The tank goes over the cliff. Indy, Henry, Brody, and Sallah watch the wreckage below. Indy joins them, and Henry, emotional, hugs him. Brody and Sallah are moved. Indy sits on the cliff edge as the others walk away. A fedora lands at Indy's feet. Donovan and Elsa observe the Canyon of the Crescent Moon. Indy, Henry, Sallah, and Brody ride into the canyon and see the hidden city."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Indy climbs atop the tank and punches Vogel over the side, then pulls Henry and Brody out. Vogel, armed with a shovel, swings at Indy, who ducks and grabs his arm. Indy accidentally hits Brody but knocks Vogel down. Vogel’s hat falls off. He swings again, but Indy ducks as Vogel’s shovel sends Henry over the side. Indy uses his whip to knock Vogel aside, then saves Henry from falling with a quick whip around his ankle. Sallah rides up to Henry, tips his fez, and stops at the cliff’s edge. Vogel punches Indy, but Indy breaks free and knocks him out. Indy looks at the approaching cliff in horror as his hat blows off. The tank plunges over the cliff, and the group watches the wreckage. Indy joins them, looking dazed. Henry hugs Indy, and they share a moment of reconciliation, moved by Brody and Sallah. Henry pats Indy, who collapses. Henry, Sallah, and Brody walk away, and the fedora blows into Indy’s hands. Donovan and Elsa, watching through binoculars, see the Canyon of the Crescent Moon. Indy, Henry, Sallah, and Brody enter the canyon and discover the hidden city."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Indy, with great effort and determination, finally manages to pull himself up onto the top of the tank once more. In a swift and decisive move, he punches Vogel, sending him tumbling over the side. Indy then peers down into the tank, where he sees Henry, who is still inside. With urgency, Indy pulls both Henry and Brody from the confines of the tank. However, Vogel, not one to be easily defeated, pulls himself back atop the tank, now armed once again with the shovel. He swings it menacingly at Indy, who quickly ducks and grabs hold of Vogel's arm. As Indy winds up to deliver a punch to Vogel, he inadvertently catches Brody in the face on the backswing. Nevertheless, he completes the movement and successfully knocks Vogel down. Vogel's hat sails through the air and falls to the floor. Before Indy can respond, Vogel is back on his feet, swinging the shovel once more. Indy ducks, but the shovel catches Henry, sending him over the side and onto the moving tread. Indy, acting with lightning speed, grabs his whip and knocks Vogel aside. As Henry speeds toward the front of the tank, facing certain doom, Indy expertly whips out his bullwhip, wrapping the end securely around Henry's right ankle. Sallah, riding alongside on his horse, draws near to the treads and tips his fez to Henry. Meanwhile, Vogel punches Indy in the back and grabs him around the neck. Despite this, Indy refuses to let go of the whip. Sallah reaches out to Henry, managing to hold onto him as he brings his horse to a stop just at the cliff's edge. Indy finally frees himself from Vogel's grasp, twisting his arm painfully away from his neck, and then lands a hard blow to Vogel's head. Indy looks down at the fast-approaching cliff, his face filled with horror. We see Vogel's hat blow off and sail over the cliff's edge. The tank trundles over the cliff and plummets to the bottom. Henry, Brody, and Sallah look down at the flaming wreckage of the tank. Looking dazed and bewildered, Indy staggers up behind them. He joins the others at the edge of the cliff, looking down at the wreckage below with a bewildered expression. Finally, Henry becomes aware of his presence. He just looks at Indy, overcome with emotion. Finally, he throws his arms around him. And he becomes aware of his father's embrace. He hugs his father back. Brody and Sallah are moved by this sudden reconciliation. Henry pats Indy on the back and Indy collapses, sitting hard on the rocky cliff edge. Unaware, Henry, Sallah, and Brody start to walk away. Henry turns and walks toward the horse with Brody and Sallah. Suddenly the fedora, borne on the wind, blows into scene and lands at Indy's feet. Donovan peers through binoculars to see the Canyon of the Crescent Moon. He lowers the binoculars and turns to Elsa. Now Elsa peers through the binoculars. Indy, Henry, Sallah, and Brody ride into the canyon. Now we turn a corner and they see the hidden city."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Indy, exerting considerable effort and driven by sheer determination, manages to hoist himself back up onto the top of the formidable tank once more. In a swift and decisive motion, filled with resolve, he delivers a powerful punch to Vogel, sending him tumbling over the side with force. Indy then leans over to peer down into the interior of the tank, where his eyes meet Henry, clearly still trapped inside. With a sense of urgency and concern, Indy promptly pulls both Henry and Brody out from the cramped confines of the tank. However, Vogel, a man not easily bested, stubbornly climbs back atop the tank, now armed once again with the ominous shovel. He brandishes it menacingly at Indy, who quickly ducks to avoid the strike and grabs hold of Vogel's arm with determination. As Indy prepares to land another punch on Vogel, he inadvertently catches Brody in the face on the backswing. Nevertheless, he completes the powerful movement and successfully sends Vogel sprawling. Vogel's hat takes flight, sailing through the air and eventually falling to the ground. Before Indy can react, Vogel is back on his feet, swinging the deadly shovel once more. Indy ducks instinctively, but the shovel accidentally strikes Henry, sending him over the edge and onto the fast-moving tank tread. Indy, acting with lightning-fast reflexes, grabs his trusty whip and knocks Vogel aside with precision. As Henry speeds toward the front of the tank, facing what appears to be certain doom, Indy expertly flicks his bullwhip, wrapping the end securely around Henry's right ankle. Meanwhile, Sallah, riding alongside on his horse, draws near to the treads and tips his fez in a gesture of camaraderie to Henry. In the midst of this chaos, Vogel punches Indy in the back and grabs him fiercely around the neck. Despite this assault, Indy refuses to let go of the whip. Sallah reaches out desperately to Henry, managing to hold onto him as he skillfully brings his horse to a stop just at the precipice of the cliff's edge. Indy finally liberates himself from Vogel's tight grasp, painfully twisting the villain's arm away from his neck, and then delivers a hard, decisive blow to Vogel's head. Indy glances down at the fast-approaching cliff, his face filled with a mix of horror and urgency. We watch as Vogel's hat is blown off, sailing over the cliff's edge, disappearing from view. The mighty tank trundles over the cliff and plummets to the depths below. Henry, Brody, and Sallah stand at the edge, peering down at the flaming wreckage of the tank, their expressions a mix of awe and relief. Looking dazed and bewildered, Indy staggers up behind them. He joins the others at the cliff's edge, his face etched with a look of bewilderment as he peers down at the destruction below. Finally, Henry becomes aware of Indy's presence. Overcome with emotion, he simply looks at Indy, then throws his arms around him in a heartfelt embrace. Indy, feeling the warmth of his father's embrace, hugs him back. Brody and Sallah stand nearby, deeply moved by this sudden reconciliation. Henry gently pats Indy on the back, signaling a new understanding between them, and Indy collapses, sitting heavily on the rocky cliff edge. Unaware of Indy's emotional state, Henry, Sallah, and Brody start to walk away from the edge. Henry turns and walks toward the horses with Brody and Sallah by his side. Suddenly, the familiar fedora, carried by the wind, drifts into the scene and lands softly at Indy's feet. Meanwhile, Donovan peers intently through binoculars, surveying the vast expanse of the Canyon of the Crescent Moon. He lowers the binoculars and turns to Elsa, passing them to her. Now Elsa peers through the binoculars, taking in the view. Indy, Henry, Sallah, and Brody ride onward into the canyon, their love for adventure undeterred. Eventually, they turn a corner and behold the sight of the hidden city, a testament to their journey and determination."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Indy, with determination etched on his face, finally manages to hoist himself atop the tank once more, where he immediately engages in a struggle with Vogel, delivering a powerful punch that sends Vogel tumbling over the side. Indy then quickly peers down into the tank, spotting Henry, who is still trapped inside. With urgency, Indy reaches down and pulls both Henry and Brody from the confines of the tank. Meanwhile, Vogel, not one to be easily defeated, pulls himself back atop the tank, now armed with a shovel. He swings the shovel menacingly at Indy, who swiftly ducks to avoid the blow and simultaneously grabs hold of Vogel's arm. As Indy prepares to deliver another punch to Vogel, his backswing inadvertently catches Brody in the face, but he continues the motion, successfully knocking Vogel down. Vogel's hat is dislodged in the scuffle, sailing through the air before falling to the floor. Before Indy can catch his breath, Vogel is back on his feet, swinging the shovel once more. Indy ducks again, but this time the shovel strikes Henry, sending him over the side and onto the moving tread of the tank. Reacting with lightning speed, Indy grabs his bullwhip, using it to knock Vogel aside, and then expertly whips the end around Henry's right ankle, halting his perilous slide toward the front of the tank. At this critical moment, Sallah rides up alongside the treads on his horse, tipping his fez to Henry in a gesture of camaraderie. Vogel, relentless in his pursuit, punches Indy in the back and wraps his arms around Indy's neck in a chokehold. Despite the pressure, Indy refuses to relinquish his grip on the whip. Sallah reaches out to Henry, managing to hold onto him as he brings his horse to a stop just at the edge of a cliff. Indy, with a final burst of strength, twists his arm free from Vogel's grasp, delivering a hard blow to Vogel's head. As Indy looks down, he is filled with horror at the sight of the fast-approaching cliff. Vogel's hat is caught by the wind and sails over the cliff's edge as the tank trundles over and plummets to the bottom. Henry, Brody, and Sallah stand at the cliff's edge, looking down at the flaming wreckage of the tank. Indy, appearing dazed and bewildered, staggers up behind them and joins them at the edge, his expression mirroring their disbelief. Finally, Henry becomes aware of Indy's presence and, overcome with emotion, throws his arms around him. Indy, realizing the depth of his father's embrace, hugs him back. Brody and Sallah, witnessing this sudden reconciliation, are visibly moved. Henry pats Indy on the back, and Indy, overwhelmed, collapses, sitting hard on the rocky cliff edge. Unaware of Indy's state, Henry, Sallah, and Brody begin to walk away. Henry turns and walks toward the horse with Brody and Sallah. Suddenly, the fedora, carried by the wind, blows into the scene and lands at Indy's feet. Meanwhile, Donovan peers through binoculars, scanning the landscape until he spots the Canyon of the Crescent Moon. He lowers the binoculars and turns to Elsa, who then takes her turn peering through them. Indy, Henry, Sallah, and Brody ride into the canyon, and as they turn a corner, they are greeted by the sight of the hidden city."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Indy climbs back onto the tank, dispatches Vogel over the side, and rescues Henry and Brody. Vogel returns with a shovel, but Indy dodges and counters, inadvertently hitting Brody before knocking Vogel down. As Vogel recovers and attacks again, Henry is knocked onto the moving tread. Indy quickly uses his bullwhip to secure Henry's ankle, while Sallah rides alongside to assist. Despite Vogel's interference, Indy maintains his grip on the whip, allowing Sallah to pull Henry to safety just before the tank goes over the cliff. Indy frees himself from Vogel's grasp and delivers a decisive blow, watching in horror as the tank plummets. Rejoining Henry, Brody, and Sallah at the cliff's edge, Indy shares a heartfelt embrace with his father, marking a moment of reconciliation. As they prepare to leave, Indy's fedora lands at his feet, carried by the wind. Meanwhile, Donovan and Elsa observe the Canyon of the Crescent Moon through binoculars. Indy, Henry, Sallah, and Brody ride into the canyon, eventually discovering the hidden city."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Indy finally manages to pull himself atop the tank once more, a German Panzer from World War I, where he punches Vogel over the side, then peers down to Henry, his father, still inside the tank. Indy pulls Henry and Brody, Indy's trusted friend and a museum curator, from the tank. Vogel pulls himself back atop the tank armed again with the shovel, a typical tool found in military vehicles for digging trenches, which he swings at Indy, who ducks and grabs Vogel's arm. As Indy winds up to punch Vogel he catches Brody in the face on the backswing, then completes the movement and knocks Vogel down. Vogel's hat, a standard German officer's cap, sails in and falls to the floor. Before Indy can answer, Vogel is up and swinging with the shovel. Indy ducks, but the shovel catches Henry, sending him over the side and onto the moving tread. Indy grabs his whip, a bullwhip that has become his trademark, knocking Vogel aside. As Henry speeds toward the front of the tank to certain doom, Indy, with lightning speed, whips out his bullwhip, wrapping the end of the whip around Henry's right ankle. Sallah, a skilled Egyptian excavator, draws his horse next to the treads. He tips his fez, a traditional felt hat originating from the Ottoman Empire, to Henry. Vogel now punches Indy in the back and grabs him around the neck. Still, Indy refuses to let go of the whip. Sallah reaches out to Henry. Sallah manages to hold onto Henry as he brings his horse to a stop just at the cliff's edge. Indy finally frees himself of Vogel's grasp, twisting his arm painfully away from Indy's neck, then landing a hard blow to Vogel's head. Indy looks down at the fast-approaching cliff, his face filled with horror. We see his hat blow off and sail over the cliff's edge. The tank trundles over the cliff and plummets to the bottom. Henry, Brody, and Sallah look down at the flaming wreckage of the tank. Looking dazed and bewildered, Indy staggers up behind them. He joins the others at the edge of the cliff, looking down at the wreckage below with a bewildered expression. Finally, Henry becomes aware of his presence. He just looks at Indy, overcome with emotion. Finally, he throws his arms around him. And Indy becomes aware of his father's embrace, feeling the warmth of a long-overdue connection. He hugs his father back. Brody and Sallah are moved by this sudden reconciliation. Henry pats Indy on the back and Indy collapses, sitting hard on the rocky cliff edge, surrounded by the vast desert. Unaware, Henry, Sallah, and Brody start to walk away. Henry turns and walks toward the horse with Brody and Sallah. Suddenly the fedora, Indy's iconic hat symbolizing his adventurous spirit, borne on the wind, blows into the scene and lands at Indy's feet. Donovan, Indy's rival in search of the Holy Grail, peers through binoculars to see the Canyon of the Crescent Moon, a fictional location inspired by the ancient city of Petra in Jordan. He lowers the binoculars and turns to Elsa, his cunning accomplice. Now Elsa peers through the binoculars. Indy, Henry, Sallah, and Brody ride into the canyon. Now we turn a corner and they see the hidden city, a place echoing with history and secrets waiting to be uncovered."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Indy finally manages to pull himself atop the tank once more where he punches Vogel over the side then peers down to Henry still inside the tank  As Indy winds up to punch Vogel he catches Brody in the face on the backswing then completes the movement and knocks Vogel down  Vogel's hat sails in and falls to the floor  Before Indy can answer Vogel is up and swinging with the shovel  Indy ducks but the shovel catches Henry sending him over the side and onto the moving tread  Indy grabs his whip knocking Vogel aside  As Henry speeds toward the front of the tank to certain doom Indy with lightning speed whips out his bullwhip wrapping the end of the whip around Henry's right ankle  Sallah draws his horse next to the treads  He tips his fez to Henry  Vogel now punches Indy in the back and grabs him around the neck  Still Indy refuses to let go of the whip  Sallah reaches out to Henry  Sallah manages to hold onto Henry as he brings his horse to a stop just at the cliff's edge  Indy finally frees himself of Vogel's grasp twisting his arm painfully away from Indy's neck then landing a hard blow to Vogel's head  Looks down at the fastapproaching cliff his face filled with horror  We see his hat blow off and sail over the cliff's edge  The tank trundles over the cliff and plummets to the bottom  Henry Brody and Sallah look down at the flaming wreckage of the tank  Looking dazed and bewildered Indy staggers up behind them  He joins the others at the edge of the cliff looking down at the wreckage below with a bewildered expression  Indy pulls Henry and Brody from the tank  Vogel pulls himself back atop the tank armed again with the shovel which he swings at Indy who ducks and grabs Vogel's arm  As Indy winds up to punch Vogel he catches Brody in the face on the backswing then completes the movement and knocks Vogel down  Vogel's hat sails in and falls to the floor  Before Indy can answer Vogel is up and swinging with the shovel  Indy ducks but the shovel catches Henry sending him over the side and onto the moving tread  Indy grabs his whip knocking Vogel aside  As Henry speeds toward the front of the tank to certain doom Indy with lightning speed whips out his bullwhip wrapping the end of the whip around Henry's right ankle  Sallah draws his horse next to the treads  He tips his fez to Henry  Vogel now punches Indy in the back and grabs him around the neck  Still Indy refuses to let go of the whip  Sallah reaches out to Henry  Sallah manages to hold onto Henry as he brings his horse to a stop just at the cliff's edge  Indy finally frees himself of Vogel's grasp twisting his arm painfully away from Indy's neck then landing a hard blow to Vogel's head  Looks down at the fastapproaching cliff his face filled with horror  We see his hat blow off and sail over the cliff's edge  The tank trundles over the cliff and plummets to the bottom  Henry Brody and Sallah look down at the flaming wreckage of the tank  Looking dazed and bewildered Indy staggers up behind them  He joins the others at the edge of the cliff looking down at the wreckage below with a bewildered expression  Finally Henry becomes aware of his presence  He just looks at Indy overcome with emotion  Finally he throws his arms around him  And he becomes aware of his father's embrace  He hugs his father back  Brody and Sallah are moved by this sudden reconciliation  Henry pats Indy on the back and Indy collapses sitting hard on the rocky cliff edge  Unaware Henry Sallah and Brody start to walk away  Henry turns and walks toward the horse with Brody and Sallah  Suddenly the fedora borne on the wind blows into scene and lands at Indy's feet  Donovan peers through binoculars to see the Canyon of the Crescent Moon  He lowers the binoculars and turns to Elsa  Now Elsa peers through the binoculars  Indy Henry Sallah and Brody ride into the canyon  Now we turn a corner and they see the hidden city"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Indy finally manages to pull himself atop the tank once more where he punches Vogel over the side then peers down to Henry still inside the tank. Indy pulls Henry and Brody from the tank. Vogel pulls himself back atop the tank armed again with the shovel which he swings at Indy who ducks and grabs Vogel's arm. As Indy winds up to punch Vogel he catches Brody in the face on the backswing then completes the movement and knocks Vogel down. Vogel's hat sails in and falls to the floor. Before Indy can answer Vogel is up and swinging with the shovel. Indy ducks but the shovel catches Henry sending him over the side and onto the moving tread. Indy grabs his whip knocking Vogel aside. As Henry speeds toward the front of the tank to certain doom Indy with lightning speed whips out his bullwhip wrapping the end of the whip around Henry's right ankle. Sallah draws his horse next to the treads. He tips his fez to Henry. Vogel now punches Indy in the back and grabs him around the neck. Still Indy refuses to let go of the whip. Sallah reaches out to Henry. Sallah manages to hold onto Henry as he brings his horse to a stop just at the cliff's edge. Indy finally frees himself of Vogel's grasp twisting his arm painfully away from Indy's neck then landing a hard blow to Vogel's head. Looks down at the fastapproaching cliff his face filled with horror. We see his hat blow off and sail over the cliff's edge. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. The tank trundles over the cliff and plummets to the bottom. Henry Brody and Sallah look down at the flaming wreckage of the tank. Looking dazed and bewildered Indy staggers up behind them. He joins the others at the edge of the cliff looking down at the wreckage below with a bewildered expression. Finally Henry becomes aware of his presence. He just looks at Indy overcome with emotion. Finally he throws his arms around him. And he becomes aware of his father's embrace. He hugs his father back. Brody and Sallah are moved by this sudden reconciliation. Henry pats Indy on the back and Indy collapses sitting hard on the rocky cliff edge. Unaware Henry Sallah and Brody start to walk away. Henry turns and walks toward the horse with Brody and Sallah. Suddenly the fedora borne on the wind blows into scene and lands at Indy's feet. Donovan peers through binoculars to see the Canyon of the Crescent Moon. He lowers the binoculars and turns to Elsa. Now Elsa peers through the binoculars. Indy Henry Sallah and Brody ride into the canyon. Now we turn a corner and they see the hidden city."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Indy finally manages to pull himself atop the tank once more where he punches Vogel over the side then peers down to Henry still inside the tank. Indy pulls Henry and Brody from the tank. Vogel pulls himself back atop the tank armed again with the shovel which he swings at Indy who ducks and grabs Vogel's arm. As Indy winds up to punch Vogel he catches Brody in the face on the backswing then completes the movement and knocks Vogel down. Vogel's hat sails in and falls to the floor. Before Indy can answer Vogel is up and swinging with the shovel. Indy ducks but the shovel catches Henry sending him over the side and onto the moving tread. Indy grabs his whip knocking Vogel aside. As Henry speeds toward the front of the tank to certain doom Indy with lightning speed whips out his bullwhip wrapping the end of the whip around Henry's right ankle. Sallah draws his horse next to the treads. He tips his fez to Henry. Vogel now punches Indy in the back and grabs him around the neck. Still Indy refuses to let go of the whip. Sallah reaches out to Henry. Sallah manages to hold onto Henry as he brings his horse to a stop just at the cliff's edge. Indy finally frees himself of Vogel's grasp twisting his arm painfully away from Indy's neck then landing a hard blow to Vogel's head. Looks down at the fastapproaching cliff his face filled with horror. We see his hat blow off and sail over the cliff's edge. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. The tank trundles over the cliff and plummets to the bottom. Henry Brody and Sallah look down at the flaming wreckage of the tank. Looking dazed and bewildered Indy staggers up behind them. He joins the others at the edge of the cliff looking down at the wreckage below with a bewildered expression. Finally Henry becomes aware of his presence. He just looks at Indy overcome with emotion. Finally he throws his arms around him. And he becomes aware of his father's embrace. He hugs his father back. Brody and Sallah are moved by this sudden reconciliation. Henry pats Indy on the back and Indy collapses sitting hard on the rocky cliff edge. Unaware Henry Sallah and Brody start to walk away. Henry turns and walks toward the horse with Brody and Sallah. Suddenly the fedora borne on the wind blows into scene and lands at Indy's feet. Donovan peers through binoculars to see the Canyon of the Crescent Moon. He lowers the binoculars and turns to Elsa. Now Elsa peers through the binoculars. Indy Henry Sallah and Brody ride into the canyon. Now we turn a corner and they see the hidden city."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Indy finally manages to pull himself atop the tank once more where he punches Vogel over the side then peers down to Henry still inside the tank. Indy pulls Henry and Brody from the tank. Vogel pulls himself back atop the tank armed again with the shovel which he swings at Indy who ducks and grabs Vogel's arm. As Indy winds up to punch Vogel he catches Brody in the face on the backswing then completes the movement and knocks Vogel down. Vogel's hat sails in and falls to the floor. Before Indy can answer Vogel is up and swinging with the shovel. Indy ducks but the shovel catches Henry sending him over the side and onto the moving tread. Indy grabs his whip knocking Vogel aside. As Henry speeds toward the front of the tank to certain doom Indy with lightning speed whips out his bullwhip wrapping the end of the whip around Henry's right ankle. Brody and Sallah are moved by this sudden reconciliation. Henry pats Indy on the back and Indy collapses sitting hard on the rocky cliff edge. Unaware Henry Sallah and Brody start to walk away. Henry turns and walks toward the horse with Brody and Sallah. Suddenly the fedora borne on the wind blows into scene and lands at Indy's feet. Donovan peers through binoculars to see the Canyon of the Crescent Moon. He lowers the binoculars and turns to Elsa. Now Elsa peers through the binoculars. Indy Henry Sallah and Brody ride into the canyon. Now we turn a corner and they see the hidden city."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Indy finally manages to pull himself atop the tank once more where he punches Vogel over the side then peers down to Henry still inside the tank. Indy pulls Henry and Brody from the tank. Vogel pulls himself back atop the tank armed again with the shovel which he swings at Indy who ducks and grabs Vogel's arm. As Indy winds up to punch Vogel he catches Brody in the face on the backswing then completes the movement and knocks Vogel down. He lowers the binoculars and turns to Elsa. Now Elsa peers through the binoculars. Indy Henry Sallah and Brody ride into the canyon. Now we turn a corner and they see the hidden city."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Gandalf finally manages to pull himself atop the tank once more where he punches Dobby over the side, then peers down to Frodo, still inside the tank. Gandalf pulls Frodo and Samwise from the tank. Dobby pulls himself back atop the tank armed again with the shovel which he swings at Gandalf, who ducks and grabs Dobby's arm. As Gandalf winds up to punch Dobby he catches Samwise in the face on the backswing, then completes the movement and knocks Dobby down. Dobby's hat sails in and falls to the floor. Before Gandalf can answer, Dobby is up and swinging with the shovel. Gandalf ducks but the shovel catches Frodo sending him over the side and onto the moving tread. Gandalf grabs his whip, knocking Dobby aside. As Frodo speeds toward the front of the tank to certain doom, Gandalf, with lightning speed, whips out his bullwhip, wrapping the end of the whip around Frodo's right ankle. Aragorn draws his horse next to the treads. He tips his fez to Frodo. Dobby now punches Gandalf in the back and grabs him around the neck. Still, Gandalf refuses to let go of the whip. Aragorn reaches out to Frodo. Aragorn manages to hold onto Frodo as he brings his horse to a stop just at the cliff's edge. Gandalf finally frees himself of Dobby's grasp, twisting his arm painfully away from Gandalf's neck, then landing a hard blow to Dobby's head. Looks down at the fast-approaching cliff, his face filled with horror. We see his hat blow off and sail over the cliff's edge. The tank trundles over the cliff and plummets to the bottom. Frodo, Samwise, and Aragorn look down at the flaming wreckage of the tank. Looking dazed and bewildered, Gandalf staggers up behind them. He joins the others at the edge of the cliff, looking down at the wreckage below with a bewildered expression. Finally, Frodo becomes aware of his presence. He just looks at Gandalf, overcome with emotion. Finally, he throws his arms around him. And he becomes aware of his father's embrace. He hugs his father back. Samwise and Aragorn are moved by this sudden reconciliation. Frodo pats Gandalf on the back and Gandalf collapses, sitting hard on the rocky cliff edge. Unaware, Frodo, Aragorn, and Samwise start to walk away. Frodo turns and walks toward the horse with Samwise and Aragorn. Suddenly the fedora, borne on the wind, blows into scene and lands at Gandalf's feet. Legolas peers through binoculars to see the Canyon of the Crescent Moon. He lowers the binoculars and turns to Galadriel. Now Galadriel peers through the binoculars. Gandalf, Frodo, Aragorn, and Samwise ride into the canyon. Now we turn a corner and they see the hidden city."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Indy finally manages to pull himself atop the submarine once more where he punches Vogel over the side, then peers down to Henry, still inside the submarine. Indy pulls Henry and Brody from the submarine. Vogel pulls himself back atop the submarine armed again with the wrench which he swings at Indy, who ducks and grabs Vogel's arm. As Indy winds up to punch Vogel he catches Brody in the face on the backswing, then completes the movement and knocks Vogel down. Vogel's scarf sails in and falls to the floor. Before Indy can answer, Vogel is up and swinging with the wrench. Indy ducks but the wrench catches Henry sending him over the side and onto the moving conveyor belt. Indy grabs his rope, knocking Vogel aside. As Henry speeds toward the front of the submarine to certain doom, Indy, with lightning speed, whips out his rope, wrapping the end of the rope around Henry's right ankle. Sallah draws his camel next to the conveyor belt. He tips his hat to Henry. Vogel now punches Indy in the back and grabs him around the neck. Still, Indy refuses to let go of the rope. Sallah reaches out to Henry. Sallah manages to hold onto Henry as he brings his camel to a stop just at the chasm's edge. Indy finally frees himself of Vogel's grasp, twisting his arm painfully away from Indy's neck, then landing a hard blow to Vogel's head. Looks down at the fast-approaching chasm, his face filled with horror. We see his scarf blow off and sail over the chasm's edge. The submarine trundles over the chasm and plummets to the bottom. Henry, Brody, and Sallah look down at the flaming wreckage of the submarine. Looking dazed and bewildered, Indy staggers up behind them. He joins the others at the edge of the chasm, looking down at the wreckage below with a bewildered expression. Finally, Henry becomes aware of his presence. He just looks at Indy, overcome with emotion. Finally, he throws his arms around him. And he becomes aware of his father's embrace. He hugs his father back. Brody and Sallah are moved by this sudden reconciliation. Henry pats Indy on the back and Indy collapses, sitting hard on the grassy chasm edge. Unaware, Henry, Sallah, and Brody start to walk away. Henry turns and walks toward the camel with Brody and Sallah. Suddenly the beret, borne on the wind, blows into scene and lands at Indy's feet. Donovan peers through goggles to see the Valley of the Crescent Moon. He lowers the goggles and turns to Elsa. Now Elsa peers through the goggles. Indy, Henry, Sallah, and Brody ride into the valley. Now we turn a corner and they see the hidden fortress."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Indy finally manages to lift himself atop the tank once more where he nudges Vogel over the side, then glances down to Henry, still inside the tank. Indy helps Henry and Brody from the tank. Vogel climbs back atop the tank armed again with the shovel which he tosses at Indy, who sidesteps and seizes Vogel's arm. As Indy prepares to trip Vogel, he accidentally taps Brody in the face on the return swing, then continues the motion and topples Vogel down. Vogel's hat glides in and lands on the floor. Before Indy can react, Vogel is up and brandishing the shovel. Indy sidesteps but the shovel nudges Henry sending him over the side and onto the moving tread. Indy grabs his whip, shoving Vogel aside. As Henry drifts toward the front of the tank to certain doom, Indy, with astonishing speed, lashes out his bullwhip, coiling the end of the whip around Henry's right ankle. Sallah guides his horse next to the treads. He doffs his fez to Henry. Vogel now tugs Indy in the back and catches him around the neck. Still, Indy refuses to release the whip. Sallah extends his hand to Henry. Sallah manages to grasp Henry as he brings his horse to a halt just at the cliff's edge. Indy finally disentangles himself from Vogel's grip, twisting his arm awkwardly away from Indy's neck, then delivering a forceful shove to Vogel's head. Looks down at the fast-approaching cliff, his face filled with dread. We see his hat flutter off and float over the cliff's edge. The tank rolls over the cliff and descends to the bottom. Henry, Brody, and Sallah gaze down at the fiery wreckage of the tank. Looking stunned and confused, Indy stumbles up behind them. He joins the others at the edge of the cliff, gazing down at the wreckage below with a perplexed expression. Finally, Henry becomes conscious of his presence. He just looks at Indy, overwhelmed with emotion. Finally, he stretches his arms around him. And he becomes conscious of his father's embrace. He embraces his father back. Brody and Sallah are touched by this sudden reconciliation. Henry taps Indy on the back and Indy collapses, sitting heavily on the rocky cliff edge. Unaware, Henry, Sallah, and Brody start to wander away. Henry turns and walks toward the horse with Brody and Sallah. Suddenly the fedora, carried on the wind, floats into view and settles at Indy's feet. Donovan peers through binoculars to see the Canyon of the Crescent Moon. He drops the binoculars and directs his attention to Elsa. Now Elsa observes through the binoculars. Indy, Henry, Sallah, and Brody trek into the canyon. Now we round a corner and they discover the hidden city."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Max finally manages to pull himself atop the refrigerator once more where he punches the toaster over the side, then peers down to Janet, still inside the refrigerator. Max pulls Janet and Lucas from the refrigerator. The toaster pulls itself back atop the refrigerator armed again with the spoon which it swings at Max, who ducks and grabs the toaster's arm. As Max winds up to punch the toaster he catches Lucas in the face on the backswing, then completes the movement and knocks the toaster down. The toaster's scarf sails in and falls to the floor. Before Max can answer, the toaster is up and swinging with the spoon. Max ducks but the spoon catches Janet sending her over the side and onto the moving treadmill. Max grabs his rope, knocking the toaster aside. As Janet speeds toward the front of the refrigerator to certain doom, Max, with lightning speed, whips out his shoelace, wrapping the end of the shoelace around Janet's right ankle. Oliver draws his bicycle next to the treadmill. He tips his cap to Janet. The toaster now punches Max in the back and grabs him around the neck. Still, Max refuses to let go of the shoelace. Oliver reaches out to Janet. Oliver manages to hold onto Janet as he brings his bicycle to a stop just at the cliff's edge. Max finally frees himself of the toaster's grasp, twisting its handle painfully away from Max's neck, then landing a hard blow to the toaster's face. Looks down at the fast-approaching cliff, his face filled with shock. We see his scarf blow off and sail over the cliff's edge. The refrigerator trundles over the cliff and plummets to the bottom. Janet, Lucas, and Oliver look down at the flaming wreckage of the refrigerator. Looking dazed and bewildered, Max staggers up behind them. He joins the others at the edge of the cliff, looking down at the wreckage below with a bewildered expression. Finally, Janet becomes aware of his presence. She just looks at Max, overcome with emotion. Finally, she throws her arms around him. And he becomes aware of his mother's embrace. He hugs his mother back. Lucas and Oliver are moved by this sudden reconciliation. Janet pats Max on the back and Max collapses, sitting hard on the rocky cliff edge. Unaware, Janet, Oliver, and Lucas start to walk away. Janet turns and walks toward the bicycle with Lucas and Oliver. Suddenly the bonnet, borne on the wind, blows into scene and lands at Max's feet. Gordon peers through binoculars to see the Valley of the Crescent Dome. He lowers the binoculars and turns to Rachel. Now Rachel peers through the binoculars. Max, Janet, Oliver, and Lucas ride into the valley. Now we turn a corner and they see the hidden village."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Max finally manages to drag himself atop the machine once more where he shoves Lars over the side, then glances down to Samuel, still inside the machine. Max drags Samuel and Carter from the machine. Lars clambers back atop the machine armed again with the stick which he hurls at Max, who dodges and seizes Lars's arm. As Max gears up to shove Lars he elbows Carter in the face on the backswing, then finishes the move and pushes Lars down. Lars's hat glides in and drops to the ground. Before Max can comment, Lars is up and throwing with the stick. Max dodges but the stick hits Samuel sending him over the side and onto the moving wheel. Max seizes his rope, pushing Lars aside. As Samuel races toward the front of the machine to certain disaster, Max, with lightning speed, flings out his lasso, coiling the end of the rope around Samuel's right ankle. Malik draws his camel next to the wheels. He nods his fez to Samuel. Lars now shoves Max in the back and seizes him around the waist. Still, Max refuses to release the rope. Malik reaches out to Samuel. Malik manages to cling to Samuel as he brings his camel to a stop just at the cliff's edge. Max finally releases himself from Lars's grip, twisting his shoulder painfully away from Max's waist, then landing a hard strike to Lars's head. Gazes down at the rapidly nearing cliff, his face filled with terror. We see his hat blow off and glide over the cliff's edge. The machine rumbles over the cliff and descends to the bottom. Samuel, Carter, and Malik gaze down at the burning wreckage of the machine. Looking shocked and confused, Max totters up behind them. He joins the others at the edge of the cliff, gazing down at the wreckage below with a puzzled expression. Finally, Samuel becomes aware of his presence. He just gazes at Max, overcome with feeling. Finally, he throws his arms around him. And he becomes aware of his son's embrace. He hugs his son back. Carter and Malik are moved by this abrupt reconciliation. Samuel pats Max on the back and Max collapses, sitting hard on the rocky cliff edge. Oblivious, Samuel, Malik, and Carter start to walk away. Samuel turns and walks toward the camel with Carter and Malik. Suddenly the hat, carried on the wind, flutters into scene and rests at Max's feet. Richard surveys through binoculars to see the Valley of the Crescent Moon. He lowers the binoculars and turns to Claire. Now Claire surveys through the binoculars. Max, Samuel, Malik, and Carter ride into the valley. Now they turn a corner and they see the concealed city."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Indy finally manages to hoist himself atop the boulder once more where he shoves Vogel over the edge, then glances down to Henry, still inside the boulder. Indy drags Henry and Brody from the boulder. Vogel pulls himself back atop the boulder armed again with the rake which he hurls at Indy, who crouches and seizes Vogel's leg. As Indy gears up to shove Vogel he thumps Brody in the shoulder on the backswing, then completes the motion and sends Vogel tumbling. Vogel's scarf flutters in and lands on the ground. Before Indy can retort, Vogel is up and hurling with the rake. Indy crouches but the rake knocks Henry, sending him over the edge and onto the rolling grass. Indy grabs his cane, veering Vogel aside. As Henry rolls toward the front of the boulder to certain peril, Indy, with rapid speed, whips out his walking stick, looping the end of the stick around Henry's left wrist. Sallah rides his camel next to the grass. He nods his turban to Henry. Vogel now shoves Indy in the side and seizes him around the chest. Still, Indy refuses to let go of the stick. Sallah reaches out to Henry. Sallah manages to hold onto Henry as he brings his camel to a stop just at the canyon's edge. Indy finally extricates himself from Vogel's hold, twisting his arm awkwardly away from Indy's chest, then landing a hard kick to Vogel's stomach. Looks down at the rapidly-approaching canyon, his face filled with panic. We see his scarf drift off and soar over the canyon's edge. The boulder rolls over the canyon and crashes to the bottom. Henry, Brody, and Sallah look down at the smoking remains of the boulder. Looking dazed and perplexed, Indy wanders up behind them. He joins the others at the edge of the canyon, looking down at the debris below with a perplexed expression. Finally, Henry becomes aware of his presence. He just looks at Indy, overwhelmed with emotion. Finally, he throws his arms around him. And he becomes aware of his father's embrace. He hugs his father back. Brody and Sallah are touched by this sudden reunion. Henry pats Indy on the shoulder and Indy collapses, sitting hard on the rocky canyon edge. Unaware, Henry, Sallah, and Brody start to walk away. Henry turns and walks toward the camel with Brody and Sallah. Suddenly the helmet, carried on the breeze, blows into scene and lands at Indy's feet. Donovan peers through a telescope to see the Valley of the Half Moon. He lowers the telescope and turns to Elsa. Now Elsa peers through the telescope. Indy, Henry, Sallah, and Brody gallop into the valley. Now we round a bend and they see the hidden fortress."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Benny eventually strains to haul himself atop the submarine once again where he tosses Nigel over the railing, then glances down to Arthur, still inside the submarine. Benny hauls Arthur and Chester from the submarine. Nigel strains to heave himself back atop the submarine wielding once more the accordion which he brandishes at Benny, who dodges and grips Nigel's shoulder. As Benny gears up to slap Nigel he inadvertently strikes Chester in the nose on the downswing, then completes the action and sends Nigel tumbling. Nigel's scarf glides through the air and lands to the ground. Before Benny can react, Nigel is back and swinging with the accordion. Benny dodges but the accordion clips Arthur causing him to topple over the edge and onto the rotating propeller. Benny snatches his lasso, shoving Nigel aside. As Arthur zips toward the bow of the submarine to inevitable demise, Benny, with blinding swiftness, flicks out his lasso, coiling the length of the rope around Arthur’s left wrist. Khalil draws his camel next to the propellers. He tilts his cap to Arthur. Nigel now slaps Benny on the spine and clenches him around the waist. Still, Benny refuses to release the lasso. Khalil stretches out to Arthur. Khalil manages to clutch Arthur as he halts his camel just at the shore's brink. Benny finally liberates himself from Nigel’s hold, wrenching his elbow painfully away from Benny’s waist, then delivering a solid strike to Nigel’s ear. Gazes at the rapidly-approaching shore, his expression filled with dread. We see his scarf drift off and glide over the shore's brink. The submarine rolls over the shore and crashes to the ground. Arthur, Chester, and Khalil gaze down at the smoldering debris of the submarine. Appearing confused and astounded, Benny stumbles up behind them. He joins the others at the brink of the shore, gazing down at the debris below with an astounded expression. Eventually, Arthur becomes conscious of his presence. He just gazes at Benny, overwhelmed with feeling. Finally, he throws his arms around him. And he becomes conscious of his son’s embrace. He hugs his son back. Chester and Khalil are touched by this sudden reunion. Arthur pats Benny on the shoulder and Benny collapses, dropping heavily on the rocky shore brink. Oblivious, Arthur, Khalil, and Chester begin to saunter away. Arthur turns and strides toward the camel with Chester and Khalil. Abruptly the boater, carried by the breeze, drifts into the scene and lands at Benny’s feet. Edward squints through opera glasses to see the Gorge of the Crescent Dune. He lowers the opera glasses and turns to Ingrid. Now Ingrid squints through the opera glasses. Benny, Arthur, Khalil, and Chester trot into the gorge. Now we navigate a curve and they behold the concealed village."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Indy climbs atop the tank, confronts Vogel, and rescues Henry and Brody. Vogel attacks Indy, but Indy defends himself, accidentally hitting Brody. As Vogel struggles with Indy, he knocks Henry over the side, but Indy saves him with his whip, and Sallah helps pull Henry to safety. Indy fights off Vogel and manages to escape just before the tank goes over a cliff. Indy, Henry, Brody, and Sallah watch the wreckage below. An emotional reconciliation between Indy and Henry follows as they hug, witnessed by a moved Brody and Sallah. As they start to walk away, Indy's hat lands at his feet. Meanwhile, Donovan and Elsa look through binoculars at the Canyon of the Crescent Moon. Indy, Henry, Sallah, and Brody ride into the canyon and discover the hidden city."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Now we turn a corner and they see the hidden city Indy Henry Sallah and Brody ride into the canyon  Now Elsa peers through the binoculars  He lowers the binoculars and turns to Elsa  Donovan peers through binoculars to see the Canyon of the Crescent Moon  Suddenly the fedora borne on the wind blows into scene and lands at Indy's feet  Henry turns and walks toward the horse with Brody and Sallah  Unaware Henry Sallah and Brody start to walk away  Henry pats Indy on the back and Indy collapses sitting hard on the rocky cliff edge  Brody and Sallah are moved by this sudden reconciliation  He hugs his father back  And he becomes aware of his father's embrace  Finally he throws his arms around him  He just looks at Indy overcome with emotion  Finally Henry becomes aware of his presence  He joins the others at the edge of the cliff looking down at the wreckage below with a bewildered expression  Looking dazed and bewildered Indy staggers up behind them  Henry Brody and Sallah look down at the flaming wreckage of the tank  The tank trundles over the cliff and plummets to the bottom  We see his hat blow off and sail over the cliff's edge  Looks down at the fastapproaching cliff his face filled with horror  Indy finally frees himself of Vogel's grasp twisting his arm painfully away from Indy's neck then landing a hard blow to Vogel's head  Sallah manages to hold onto Henry as he brings his horse to a stop just at the cliff's edge  Sallah reaches out to Henry  Still Indy refuses to let go of the whip  Vogel now punches Indy in the back and grabs him around the neck  He tips his fez to Henry  Sallah draws his horse next to the treads  As Henry speeds toward the front of the tank to certain doom Indy with lightning speed whips out his bullwhip wrapping the end of the whip around Henry's right ankle  Indy grabs his whip knocking Vogel aside  Indy ducks but the shovel catches Henry sending him over the side and onto the moving tread  Before Indy can answer Vogel is up and swinging with the shovel  Vogel's hat sails in and falls to the floor  As Indy winds up to punch Vogel he catches Brody in the face on the backswing then completes the movement and knocks Vogel down  Vogel pulls himself back atop the tank armed again with the shovel which he swings at Indy who ducks and grabs Vogel's arm  Indy pulls Henry and Brody from the tank  Indy finally manages to pull himself atop the tank once more where he punches Vogel over the side then peers down to Henry still inside the tank "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Finally he throws his arms around him  The tank trundles over the cliff and plummets to the bottom  Suddenly the fedora borne on the wind blows into scene and lands at Indy's feet  Finally Henry becomes aware of his presence  He tips his fez to Henry  Indy grabs his whip knocking Vogel aside  Donovan peers through binoculars to see the Canyon of the Crescent Moon  And he becomes aware of his father's embrace  Vogel's hat sails in and falls to the floor  Now Elsa peers through the binoculars  Indy finally manages to pull himself atop the tank once more where he punches Vogel over the side then peers down to Henry still inside the tank  He just looks at Indy overcome with emotion  Indy finally frees himself of Vogel's grasp twisting his arm painfully away from Indy's neck then landing a hard blow to Vogel's head  Looking dazed and bewildered Indy staggers up behind them  Looks down at the fastapproaching cliff his face filled with horror  He hugs his father back  Indy Henry Sallah and Brody ride into the canyon  He lowers the binoculars and turns to Elsa  Vogel pulls himself back atop the tank armed again with the shovel which he swings at Indy who ducks and grabs Vogel's arm  Henry turns and walks toward the horse with Brody and Sallah  Unaware Henry Sallah and Brody start to walk away  Now we turn a corner and they see the hidden city Sallah manages to hold onto Henry as he brings his horse to a stop just at the cliff's edge  Indy pulls Henry and Brody from the tank  As Henry speeds toward the front of the tank to certain doom Indy with lightning speed whips out his bullwhip wrapping the end of the whip around Henry's right ankle  Henry Brody and Sallah look down at the flaming wreckage of the tank  Henry pats Indy on the back and Indy collapses sitting hard on the rocky cliff edge  Brody and Sallah are moved by this sudden reconciliation  Vogel now punches Indy in the back and grabs him around the neck  As Indy winds up to punch Vogel he catches Brody in the face on the backswing then completes the movement and knocks Vogel down  Still Indy refuses to let go of the whip  Before Indy can answer Vogel is up and swinging with the shovel  Indy ducks but the shovel catches Henry sending him over the side and onto the moving tread  He joins the others at the edge of the cliff looking down at the wreckage below with a bewildered expression  Sallah reaches out to Henry  Sallah draws his horse next to the treads  We see his hat blow off and sail over the cliff's edge "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Henry Brody and Sallah look down at the flaming wreckage of the tank  Looking dazed and bewildered Indy staggers up behind them  He joins the others at the edge of the cliff looking down at the wreckage below with a bewildered expression  Finally Henry becomes aware of his presence  He just looks at Indy overcome with emotion  Finally he throws his arms around him  And he becomes aware of his father's embrace  He hugs his father back  Brody and Sallah are moved by this sudden reconciliation  Henry pats Indy on the back and Indy collapses sitting hard on the rocky cliff edge  Unaware Henry Sallah and Brody start to walk away  Henry turns and walks toward the horse with Brody and Sallah  Suddenly the fedora borne on the wind blows into scene and lands at Indy's feet  Donovan peers through binoculars to see the Canyon of the Crescent Moon  He lowers the binoculars and turns to Elsa  Now Elsa peers through the binoculars  Indy Henry Sallah and Brody ride into the canyon  Now we turn a corner and they see the hidden city Indy finally manages to pull himself atop the tank once more where he punches Vogel over the side then peers down to Henry still inside the tank  Indy pulls Henry and Brody from the tank  Vogel pulls himself back atop the tank armed again with the shovel which he swings at Indy who ducks and grabs Vogel's arm  As Indy winds up to punch Vogel he catches Brody in the face on the backswing then completes the movement and knocks Vogel down  Vogel's hat sails in and falls to the floor  Before Indy can answer Vogel is up and swinging with the shovel  Indy ducks but the shovel catches Henry sending him over the side and onto the moving tread  Indy grabs his whip knocking Vogel aside  As Henry speeds toward the front of the tank to certain doom Indy with lightning speed whips out his bullwhip wrapping the end of the whip around Henry's right ankle  Sallah draws his horse next to the treads  He tips his fez to Henry  Vogel now punches Indy in the back and grabs him around the neck  Still Indy refuses to let go of the whip  Sallah reaches out to Henry  Sallah manages to hold onto Henry as he brings his horse to a stop just at the cliff's edge  Indy finally frees himself of Vogel's grasp twisting his arm painfully away from Indy's neck then landing a hard blow to Vogel's head  Looks down at the fastapproaching cliff his face filled with horror  We see his hat blow off and sail over the cliff's edge  The tank trundles over the cliff and plummets to the bottom "
        }
      ]
    }
  ]
}