{
  "ground_truth": "Kay pulls out a box of matches and strikes one on the side. He raises it to his cigarette, but as it draws close, the match goes out with a sharp. Kay looks up, sharply. Above him, Tony, the counter guy, is stuck to one high corner of the ceiling by an enormous wad of viscous, dripping fluid. He's dead, a frozen look of terror on his face and the can of Raid still clutched in his hand. Laurel is at the end of her rope. Jay's smile vanishes and his jaw drops as he figures it out. He starts to reach for his gun. Kay races into the morgue just as the examination table explodes into the air, revealing Edgar, who was hiding beneath it. Now everything happens at once. Jay leaps back and draws the Noisy Cricket, Kay pulls out his series four deatomizer, and Edgar holds his shotgun under Laurel's chin, using her body to shield his own. Edgar backs away with Laurel, further into the morgue, toward a glass window that looks out at the base of an air shaft. Jay and Kay advance, slowly, cornering him. And with that he turns, leaps -- and crashes right through the window, into the air shaft. Edgar, still clutching Laurel, explodes up over a railing. Jay and Kay duck into the air shaft and look up -- too far to climb, and the walls are smooth anyway. And Jay starts running down the street, where dozens of cabs are waiting at the intersection. He's running from cab to cab, pounding on windows, scaring the living shit out of people. Jay and Kay rush in from the door under the World's Fair mural, and head toward the main display screen; all around them, the MIB staffers are in frenetic activity in response to the threat from above. Just then, a loud alarm wails. At the main viewing screen, a green line shoots out from the Arquillian ship, striking a region of planet Earth -- headquarters, where every bell, whistle and light imaginable is going off. Viewing the screen, it now reads. Kay and Zed both look up at once, scowling. They follow his gaze, up, over the computer terminals. There, on the wall in front of them, where it has loomed for the entire movie, is the enormous mural of the 1964 World's Fair grounds. Most prominent in the mural are two tall towers that rise dramatically from the ground, topped by the two flying saucers from the very first alien contact. As they stand there, wide-eyed, staring at it, we -- the real-live twin towers on the actual fairgrounds in Flushing Meadows. A taxi screeches to a halt at the edge of a fence a hundred yards away.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Kay extracts a carton of igniters and scrapes one on the edge. He elevates it to his cigar, but as it nears, the igniter extinguishes with a piercing. Kay glances upward, abruptly. Overhead, Tony, the counter fellow, is affixed to one upper corner of the ceiling by a gigantic clump of adhesive, oozing liquid. He's deceased, a petrified expression of dread on his visage and the can of Raid still grasped in his hand. Laurel is at the end of her tether. Jay's grin disappears and his mouth opens as he comprehends it. He commences to reach for his firearm. Kay sprints into the morgue just as the evaluation table detonates into the atmosphere, uncovering Edgar, who was concealing beneath it. Now everything transpires simultaneously. Jay jumps backward and draws the Noisy Cricket, Kay extracts his series four deatomizer, and Edgar points his shotgun under Laurel's chin, employing her physique to shield his own. Edgar retreats with Laurel, deeper into the morgue, toward a glass pane that overlooks the base of an air duct. Jay and Kay proceed, gradually, cornering him. And with that he pivots, leaps -- and shatters directly through the pane, into the air duct. Edgar, still gripping Laurel, erupts up over a railing. Jay and Kay dodge into the air duct and gaze upward -- too far to ascend, and the surfaces are slick anyway. And Jay commences sprinting down the street, where numerous taxis are waiting at the junction. He's running from taxi to taxi, banging on panes, terrorizing the living hell out of individuals. Jay and Kay dash in from the entrance under the World's Fair mural, and proceed toward the main monitor; all around them, the MIB personnel are in frenzied motion in reaction to the menace from above. Just then, a clamorous siren howls. At the main observation screen, a verdant line projects from the Arquillian vessel, striking a sector of planet Earth -- headquarters, where every chime, buzzer, and illumination conceivable is activating. Observing the screen, it now displays. Kay and Zed both glance upward at once, frowning. They follow his stare, upward, over the computer stations. There, on the wall in front of them, where it has towered for the entire film, is the gigantic mural of the 1964 World's Fair grounds. Most prominent in the mural are two tall spires that ascend dramatically from the earth, topped by the two flying discs from the very first extraterrestrial encounter. As they stand there, wide-eyed, gazing at it, we -- the real-live twin towers on the actual exhibition grounds in Flushing Meadows. A taxi screeches to a stop at the verge of a barricade a hundred yards distant."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Kay pulls out a box of matches, and one is struck on the side by him. It is raised by him to his cigarette, but as it is drawn close, the match goes out with a sharp. Kay looks up, sharply. Above him, an enormous wad of viscous, dripping fluid has stuck Tony, the counter guy, to one high corner of the ceiling. He's dead, a frozen look of terror is on his face and a can of Raid is still clutched in his hand. Laurel is at the end of her rope. Jay's smile vanishes and he drops his jaw as he figures it out. A start is made by him to reach for his gun. The morgue is raced into by Kay just as the examination table explodes into the air, revealing Edgar, who has hidden beneath it. Now everything happens at once. Jay leaps back and the Noisy Cricket is drawn by him, the series four deatomizer is pulled out by Kay, and a shotgun is held by Edgar under Laurel's chin, using her body to shield his own. Edgar backs away with Laurel, further into the morgue, toward a glass window that looks out at the base of an air shaft. Jay and Kay advance slowly, cornering him. And with that, he turns, leaps -- and the window is crashed through by him, into the air shaft. Laurel is still clutched by Edgar as he explodes up over a railing. Jay and Kay duck into the air shaft and look up -- too far to climb, and the walls are smooth anyway. And Jay starts to run down the street, where dozens of cabs are waiting at the intersection. He runs from cab to cab, pounding on windows, and people are scared the living shit out of by him. Jay and Kay rush in from the door under the World's Fair mural, and they head toward the main display screen; all around them, the MIB staffers respond in frenetic activity to the threat from above. Just then, a loud alarm wails. At the main viewing screen, a green line shoots out from the Arquillian ship, striking a region of planet Earth -- headquarters, where every bell, whistle, and light imaginable goes off. The screen is now read by them. Kay and Zed both look up at once, scowling. His gaze is followed by them, up, over the computer terminals. There, on the wall in front of them, where it has loomed for the entire movie, is the enormous mural of the 1964 World's Fair grounds. Most prominent in the mural are two tall towers that rise dramatically from the ground, topped by the two flying saucers from the very first alien contact. As they stand there, wide-eyed, staring at it, we see the real-live twin towers on the actual fairgrounds in Flushing Meadows. A taxi screeches to a halt at the edge of a fence a hundred yards away."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Kay strikes a match for his cigarette, but it extinguishes abruptly. He looks up to see Tony, the counter guy, stuck to the ceiling by thick, dripping fluid, dead, with terror on his face and a can of Raid in hand. Laurel is at her limit. Jay's smile fades as he realizes the danger and reaches for his gun. Kay rushes into the morgue as Edgar, hidden under the examination table, emerges. Jay jumps back, drawing his Noisy Cricket, while Kay pulls his series four deatomizer. Edgar holds his shotgun under Laurel's chin, using her as a shield and retreats toward a glass window. Jay and Kay cautiously corner him until Edgar crashes through the window into the air shaft with Laurel. Edgar and Laurel explode over a railing. Jay and Kay duck into the air shaft but find it unclimbable. Jay runs down the street, frantically banging on cab windows, scaring people. Jay and Kay rush into the building under the World's Fair mural toward the main display screen, where MIB staff are reacting to the threat. A loud alarm sounds. At the main screen, a green line from the Arquillian ship targets Earth headquarters, setting off alarms. Kay and Zed look up, seeing the enormous mural of the 1964 World's Fair with two towers topped by flying saucers, the site of first alien contact. As they stare wide-eyed, the real-live twin towers at Flushing Meadows are revealed. A taxi screeches to a stop at a fence a hundred yards away."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Kay strikes a match for his cigarette, but it goes out. He looks up to see Tony, the counter guy, dead on the ceiling, frozen in terror with a can of Raid. Laurel is stressed, and Jay realizes the danger, reaching for his gun. Kay enters as Edgar emerges from hiding. Jay and Kay draw their weapons, while Edgar uses Laurel as a shield, retreating into the morgue. Edgar escapes through a window with Laurel. Jay can't follow and runs outside, alarming cab drivers. Inside, MIB staff reacts to a threat. An alarm sounds as a green line from the Arquillian ship targets Earth. Kay and Zed see the 1964 World's Fair mural with twin towers, reflecting the real towers outside."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Kay meticulously extracts a small box of matches and strikes one against the side with a swift motion. As the flame flickers to life, he brings it up towards his cigarette, but just as it nears, the flame extinguishes with a sudden, sharp sound. Kay's gaze abruptly shifts upward. Directly above him, in one high corner of the ceiling, Tony, the counter guy, is eerily affixed by a massive blob of thick, dripping substance. His lifeless body is frozen in a state of terror, with a can of Raid tightly gripped in his hand. Laurel is visibly at the end of her patience. Jay's previously cheerful expression quickly fades, his mouth dropping open in disbelief as he realizes the situation. He instinctively starts to reach for his weapon. Kay makes a dash for the morgue right as the examination table catapults into the air, uncovering Edgar, who had been concealed underneath it. In that moment, everything unfolds rapidly. Jay jumps back and swiftly draws the Noisy Cricket, while Kay retrieves his series four deatomizer. Meanwhile, Edgar positions his shotgun threateningly under Laurel's chin, using her as a human shield while retreating further into the morgue, moving towards a large glass window that peers out at the air shaft's base. Jay and Kay advance cautiously, attempting to corner Edgar. Without warning, Edgar turns and propels himself through the window, crashing into the air shaft. Still holding onto Laurel, he ascends dramatically over a railing. Jay and Kay rush into the air shaft and look upwards, realizing the climb is too far and the walls too slick. Jay bolts down the street, where numerous cabs line up at the busy intersection. He frantically pounds on cab windows, startling and scaring the cab drivers and passengers alike. Meanwhile, Jay and Kay sprint through the entrance beneath the World's Fair mural, heading towards the central display screen. All around them, MIB staffers are bustling with frenetic activity, responding to the looming threat from above. Suddenly, a piercing alarm blares through the air. At the main viewing screen, a bright green line darts out from the Arquillian ship, targeting a specific region on Earth—headquarters—causing every conceivable alarm and light to activate in unison. As they turn their attention to the screen, it displays the critical information. Kay and Zed simultaneously glance upwards, their expressions darkening with concern. They follow the trajectory with their eyes, past the computer terminals, to the wall ahead of them, where it has commanded their attention for the entirety of the film—the enormous mural depicting the 1964 World's Fair grounds. The mural prominently features two towering structures that rise from the ground, crowned by the iconic flying saucers from Earth's initial alien encounter. As they stand there, wide-eyed and transfixed, we see—the real-live twin towers standing on the actual fairgrounds in Flushing Meadows. At that moment, a taxi abruptly halts at the edge of a fence a mere hundred yards away."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Kay, with meticulous precision, carefully extracts a small box of matches from his pocket, striking one against the side with a swift, deliberate motion. As the flame flickers and dances to life, he smoothly brings it up towards his cigarette. However, just as it nears the intended target, the flame suddenly extinguishes with a sharp, unexpected sound. Kay's gaze instantly shifts upward, alert and cautious. Directly above him, suspended high in one corner of the ceiling, Tony, the counter guy, is eerily ensnared by a massive blob of thick, dripping substance. His lifeless body remains frozen in a visible state of terror, gripping a can of Raid tightly in his hand. Laurel, nearby, is visibly at the end of her patience, her demeanor clearly frazzled. Jay, who had been sporting a previously cheerful expression, quickly finds it fading. His mouth drops open in sheer disbelief as he grasps the gravity of the situation. Instinctively, he begins to reach for his weapon. Meanwhile, Kay makes a swift dash toward the morgue just as the examination table suddenly catapults into the air, revealing Edgar, who had been cleverly concealed beneath it. In that moment, events unfold with rapid intensity. Jay jumps back, swiftly drawing the Noisy Cricket, while Kay retrieves his series four deatomizer with practiced ease. During this chaos, Edgar, with a menacing air, positions his shotgun threateningly under Laurel's chin, using her as a human shield while retreating further into the morgue. He maneuvers strategically toward a large glass window that gazes out at the air shaft's base. Jay and Kay, advancing cautiously and deliberately, attempt to corner Edgar. Without any warning, Edgar abruptly turns and propels himself through the window, crashing dramatically into the air shaft. Still clutching Laurel, he ascends dramatically over a railing. Jay and Kay rush into the air shaft, looking upwards, quickly realizing the climb is too far and the walls too slick to navigate. Jay bolts down the street, where numerous cabs are lined up at a bustling intersection. He frantically pounds on cab windows, startling and scaring both cab drivers and passengers alike with his urgency. Meanwhile, both Jay and Kay sprint through the entrance beneath the vast World's Fair mural, making their way toward the central display screen. All around them, MIB staffers are bustling with frenetic activity, responding to the looming threat from above. Suddenly, a piercing alarm blares through the air, escalating the tension. At the main viewing screen, a bright green line darts out from the Arquillian ship, targeting a specific region on Earth—headquarters—causing every conceivable alarm and light to activate in frantic unison. As they turn their attention to the screen, it displays crucial, critical information. Kay and Zed, standing side by side, simultaneously glance upwards, their expressions darkening with grave concern. Their eyes follow the trajectory past the computer terminals to the wall ahead of them, where their attention has been commanded for the entirety of the film—the enormous mural depicting the 1964 World's Fair grounds. This mural prominently features two towering structures rising majestically from the ground, crowned by the iconic flying saucers from Earth's initial alien encounter. As they stand there, wide-eyed and transfixed by the unfolding vision, we see—the real-live twin towers standing on the actual fairgrounds in Flushing Meadows. At that precise moment, a taxi comes to an abrupt halt at the edge of a fence, a mere hundred yards away, underscoring the urgency of the situation."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Kay retrieves a box of matches from his pocket, carefully extracting one and striking it against the side of the box until it ignites with a small flickering flame. He slowly lifts the lit match towards the tip of his cigarette, inching it closer with precision, but just as the flame nears its target, it abruptly extinguishes, making a sharp sound that catches Kay off guard. Startled, he quickly raises his eyes to see Tony, the counter guy, affixed to a high corner of the ceiling, ensnared by an enormous wad of thick, sticky fluid that drips ominously. Tony is deceased, his face contorted in a frozen expression of terror, and his hand remains clenched around a can of Raid. Simultaneously, Laurel is reaching the limits of her patience and composure, her stress palpable in the unfolding chaos. Observing the scene, Jay's cheerful expression immediately disappears as realization dawns upon him, his mouth dropping open in shock. His instincts kick in, and he instinctively begins reaching for his gun. Without hesitation, Kay dashes into the morgue at the precise moment when the examination table suddenly erupts into the air, uncovering Edgar, who had been stealthily hiding beneath it. In a rapid sequence of events, Jay springs backward, swiftly drawing the Noisy Cricket, while Kay retrieves his series four deatomizer with practiced efficiency. Edgar, brandishing his shotgun beneath Laurel's chin, uses her as a human shield, maneuvering her body to protect his own as he retreats further into the morgue. Advancing with caution, Jay and Kay inch forward, creating a sense of being cornered for Edgar, who abruptly turns and, with a powerful leap, crashes through a glass window, catapulting himself and Laurel into the adjacent air shaft. Edgar, still firmly holding onto Laurel, propels himself over a railing and out of sight. Jay and Kay, determined not to lose him, duck into the air shaft to assess the situation, but quickly realize that the climb is too far and the smooth walls offer no grip. Thinking on his feet, Jay sprints down the street towards the intersection, where numerous cabs are idling. He frantically runs from cab to cab, pounding on the windows with urgency and inadvertently terrifying the passengers inside. Meanwhile, Jay and Kay burst into the building from beneath the World's Fair mural, moving purposefully towards the main display screen as around them, MIB staffers bustle in a frenzy, responding to the imminent threat from above. Suddenly, the room is filled with the piercing sound of a loud alarm. At the main viewing screen, a green line emerges from the Arquillian ship, directly targeting a region on Earth—the headquarters—prompting every bell, whistle, and light imaginable to activate simultaneously. Kay and Zed, positioned by the screen, both direct their gaze upwards at once, their expressions darkened by concern. Their eyes follow this trajectory over the computer terminals to the wall in front of them, where the imposing mural of the 1964 World's Fair grounds has silently observed throughout the entire movie. Dominating the mural are two tall towers, dramatically rising from the earth, each topped by a flying saucer reminiscent of the first alien contact. As they stand, transfixed, observing the mural with wide-eyed intensity, the scene shifts to the real-life twin towers located on the actual fairgrounds at Flushing Meadows. In the distance, a taxi abruptly skids to a halt at the perimeter of a fence, coming to a stop a hundred yards away, signaling the next stage in the unfolding drama."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Kay attempts to light his cigarette, but the match extinguishes abruptly. He looks up and notices Tony, the counter guy, stuck to the ceiling, dead and holding a can of Raid. As Laurel reaches her breaking point, Jay realizes the situation and instinctively reaches for his gun. Kay rushes into the morgue as Edgar emerges from beneath an examination table. In a flurry of action, Jay leaps back, drawing the Noisy Cricket, Kay readies his series four deatomizer, and Edgar uses Laurel as a human shield while backing away toward a glass window. Jay and Kay slowly advance, cornering Edgar before he crashes through the window into an air shaft with Laurel. Edgar and Laurel ascend over a railing as Jay and Kay pursue them into the shaft but find it unclimbable. Frustrated, Jay runs into the street, frantically trying to flag down cabs and causing panic. Jay and Kay rush into the building under the World's Fair mural, moving toward the main display screen. The MIB staff is in a frenzy as an alarm blares, and a green line on the screen indicates an Arquillian ship targeting Earth, setting off all alarms. Kay and Zed, alarmed, gaze up at the mural depicting the 1964 World's Fair grounds with its iconic twin towers. Meanwhile, a taxi screeches to a stop near a fence in the distance."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Kay, standing in the dimly lit alley where the smell of rain soaked into the walls, pulls out a box of matches manufactured by a company well over a century old and strikes one on the side. He raises it to his cigarette, but as it draws close, the match goes out with a sharp. Kay looks up, sharply. Above him, Tony, the counter guy who worked the late-night shifts at the local diner, is stuck to one high corner of the ceiling by an enormous wad of viscous, dripping fluid. He's dead, a frozen look of terror on his face and the can of Raid, a common insecticide used to kill pests, still clutched in his hand. Laurel is at the end of her rope after being held hostage for hours. Jay's smile vanishes and his jaw drops as he figures it out. He starts to reach for his gun. Kay races into the morgue, located in the basement of an old city hospital, just as the examination table explodes into the air, revealing Edgar, who was hiding beneath it. Now everything happens at once. Jay leaps back and draws the Noisy Cricket, a small but incredibly powerful alien weapon known for its destructive force, Kay pulls out his series four deatomizer, another advanced weapon provided for top agents of the Men in Black, and Edgar holds his shotgun under Laurel's chin, using her body to shield his own. Edgar backs away with Laurel, further into the morgue, toward a glass window that looks out at the base of an air shaft. Jay and Kay advance, slowly, cornering him. And with that he turns, leaps -- and crashes right through the window, into the air shaft. Edgar, still clutching Laurel, explodes up over a railing. Jay and Kay duck into the air shaft and look up -- too far to climb with the smooth walls preventing any grip, and Jay starts running down the street, where dozens of cabs are waiting at the intersection, a typical scene in the city's bustling downtown area. He's running from cab to cab, pounding on windows, scaring the living shit out of people. Jay and Kay rush in from the door under the World's Fair mural, a historic piece commemorating the 1964 event that celebrated technological and cultural advancements, and head toward the main display screen; all around them, the MIB staffers are in frenetic activity in response to the threat from above. Just then, a loud alarm wails. At the main viewing screen, a green line shoots out from the Arquillian ship, a powerful vessel belonging to the peaceful alien race known for their advanced technology, striking a region of planet Earth -- headquarters, where every bell, whistle and light imaginable is going off. Viewing the screen, it now reads. Kay and Zed, the stern yet wise leader of the Men in Black, both look up at once, scowling. They follow his gaze, up, over the computer terminals. There, on the wall in front of them, where it has loomed for the entire movie, is the enormous mural of the 1964 World's Fair grounds. Most prominent in the mural are two tall towers that rise dramatically from the ground, topped by the two flying saucers from the very first alien contact. As they stand there, wide-eyed, staring at it, we -- the real-live twin towers on the actual fairgrounds in Flushing Meadows, a historic park in Queens, New York known for hosting the 1939 and 1964 World's Fairs. A taxi screeches to a halt at the edge of a fence a hundred yards away."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Jay and Kay advance slowly cornering him Kay pulls out a box of matches and strikes one on the side A taxi screeches to a halt at the edge of a fence a hundred yards away He raises it to his cigarette but as it draws close the match goes out with a sharp Kay looks up sharply Above him Tony the counter guy is stuck to one high corner of the ceiling by an enormous wad of viscous dripping fluid He is dead a frozen look of terror on his face and the can of Raid still clutched in his hand He starts to reach for his gun Laurel is at the end of her rope Jay's smile vanishes and his jaw drops as he figures it out He raises it to his cigarette but as it draws close the match goes out with a sharp He starts to reach for his gun Kay races into the morgue just as the examination table explodes into the air revealing Edgar who was hiding beneath it Now everything happens at once He is dead a frozen look of terror on his face and the can of Raid still clutched in his hand Jay leaps back and draws the Noisy Cricket all around them Kay pulls out his series four deatomizer and Edgar holds his shotgun under Laurel's chin using her body to shield his own Kay pulls out a box of matches and strikes one on the side And Jay starts running down the street where dozens of cabs are waiting at the intersection Just then a loud alarm wails Edgar backs away with Laurel further into the morgue toward a glass window that looks out at the base of an air shaft Jay and Kay advance slowly cornering him And with that he turns leaps  and crashes right through the window into the air shaft Edgar still clutching Laurel explodes up over a railing Jay and Kay duck into the air shaft and look up  too far to climb and the walls are smooth anyway And Jay starts running down the street where dozens of cabs are waiting at the intersection He is running from cab to cab pounding on windows scaring the living shit out of people Jay and Kay rush in from the door under the World's Fair mural and head toward the main display screen Above him Tony the counter guy is stuck to one high corner of the ceiling by an enormous wad of viscous dripping fluid Jay and Kay duck into the air shaft and look up  too far to climb and the walls are smooth anyway all around them the MIB staffers are in frenetic activity in response to the threat from above Just then a loud alarm wails At the main viewing screen a green line shoots out from the Arquillian ship striking a region of planet Earth  headquarters where every bell whistle and light imaginable is going off Viewing the screen it now reads Kay and Zed both look up at once scowling They follow his gaze up over the computer terminals There on the wall in front of them where it has loomed for the entire movie is the enormous mural of the 1964 World's Fair grounds Kay looks up sharply Most prominent in the mural are two tall towers that rise dramatically from the ground topped by the two flying saucers from the very first alien contact Kay races into the morgue just as the examination table explodes into the air revealing Edgar who was hiding beneath it Most prominent in the mural are two tall towers that rise dramatically from the ground topped by the two flying saucers from the very first alien contact As they stand there wideeyed staring at it we  the reallive twin towers on the actual fairgrounds in Flushing Meadows They follow his gaze up over the computer terminals As they stand there wideeyed staring at it we  the reallive twin towers on the actual fairgrounds in Flushing Meadows A taxi screeches to a halt at the edge of a fence a hundred yards away"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Kay pulls out a box of matches and strikes one on the side. He raises it to his cigarette but as it draws close the match goes out with a sharp. Kay looks up sharply. Above him Tony the counter guy is stuck to one high corner of the ceiling by an enormous wad of viscous dripping fluid. He is dead a frozen look of terror on his face and the can of Raid still clutched in his hand. Laurel is at the end of her rope. Jay's smile vanishes and his jaw drops as he figures it out. He starts to reach for his gun. Kay races into the morgue just as the examination table explodes into the air revealing Edgar who was hiding beneath it. Now everything happens at once. Jay leaps back and draws the Noisy Cricket. Kay pulls out his series four deatomizer and Edgar holds his shotgun under Laurel's chin using her body to shield his own. Edgar backs away with Laurel further into the morgue toward a glass window that looks out at the base of an air shaft. Jay and Kay advance slowly cornering him. And with that he turns leaps  and crashes right through the window into the air shaft. Edgar still clutching. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. Laurel explodes up over a railing. Jay and Kay duck into the air shaft and look up  too far to climb and the walls are smooth anyway. And Jay starts running down the street where dozens of cabs are waiting at the intersection. He is running from cab to cab pounding on windows scaring the living shit out of people. Jay and Kay rush in from the door under the World's Fair mural and head toward the main display screen. all around them. the MIB staffers are in frenetic activity in response to the threat from above. Just then a loud alarm wails. At the main viewing screen a green line shoots out from the Arquillian ship striking a region of planet Earth  headquarters where every bell whistle and light imaginable is going off. Viewing the screen it now reads. Kay and Zed both look up at once scowling. They follow his gaze up over the computer terminals. There on the wall in front of them where it has loomed for the entire movie is the enormous mural of the 1964 World's Fair grounds. Most prominent in the mural are two tall towers that rise dramatically from the ground topped by the two flying saucers from the very first alien contact. As they stand there wideeyed staring at it we  the reallive twin towers on the actual fairgrounds in Flushing Meadows. A taxi screeches to a halt at the edge of a fence a hundred yards away."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Kay pulls out a box of matches and strikes one on the side. He raises it to his cigarette but as it draws close the match goes out with a sharp. Kay looks up sharply. Above him Tony the counter guy is stuck to one high corner of the ceiling by an enormous wad of viscous dripping fluid. He is dead a frozen look of terror on his face and the can of Raid still clutched in his hand. Laurel is at the end of her rope. Jay's smile vanishes and his jaw drops as he figures it out. He starts to reach for his gun. Kay races into the morgue just as the examination table explodes into the air revealing Edgar who was hiding beneath it. Now everything happens at once. Jay leaps back and draws the Noisy Cricket. Kay pulls out his series four deatomizer and Edgar holds his shotgun under Laurel's chin using her body to shield his own. Edgar backs away with Laurel further into the morgue toward a glass window that looks out at the base of an air shaft. Jay and Kay advance slowly cornering him. And with that he turns leaps  and crashes right through the window into the air shaft. Edgar still clutching. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Laurel explodes up over a railing. Jay and Kay duck into the air shaft and look up  too far to climb and the walls are smooth anyway. And Jay starts running down the street where dozens of cabs are waiting at the intersection. He is running from cab to cab pounding on windows scaring the living shit out of people. Jay and Kay rush in from the door under the World's Fair mural and head toward the main display screen. all around them. the MIB staffers are in frenetic activity in response to the threat from above. Just then a loud alarm wails. At the main viewing screen a green line shoots out from the Arquillian ship striking a region of planet Earth  headquarters where every bell whistle and light imaginable is going off. Viewing the screen it now reads. Kay and Zed both look up at once scowling. They follow his gaze up over the computer terminals. There on the wall in front of them where it has loomed for the entire movie is the enormous mural of the 1964 World's Fair grounds. Most prominent in the mural are two tall towers that rise dramatically from the ground topped by the two flying saucers from the very first alien contact. As they stand there wideeyed staring at it we  the reallive twin towers on the actual fairgrounds in Flushing Meadows. A taxi screeches to a halt at the edge of a fence a hundred yards away."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Kay pulls out a box of matches and strikes one on the side. He raises it to his cigarette but as it draws close the match goes out with a sharp. Kay looks up sharply. Above him Tony the counter guy is stuck to one high corner of the ceiling by an enormous wad of viscous dripping fluid. He is dead a frozen look of terror on his face and the can of Raid still clutched in his hand. Laurel is at the end of her rope. Jay's smile vanishes and his jaw drops as he figures it out. He starts to reach for his gun. At the main viewing screen a green line shoots out from the Arquillian ship striking a region of planet Earth  headquarters where every bell whistle and light imaginable is going off. Viewing the screen it now reads. Kay and Zed both look up at once scowling. They follow his gaze up over the computer terminals. There on the wall in front of them where it has loomed for the entire movie is the enormous mural of the 1964 World's Fair grounds. Most prominent in the mural are two tall towers that rise dramatically from the ground topped by the two flying saucers from the very first alien contact. As they stand there wideeyed staring at it we  the reallive twin towers on the actual fairgrounds in Flushing Meadows. A taxi screeches to a halt at the edge of a fence a hundred yards away."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Kay pulls out a box of matches and strikes one on the side. He raises it to his cigarette but as it draws close the match goes out with a sharp. Kay looks up sharply. Above him Tony the counter guy is stuck to one high corner of the ceiling by an enormous wad of viscous dripping fluid. Most prominent in the mural are two tall towers that rise dramatically from the ground topped by the two flying saucers from the very first alien contact. As they stand there wideeyed staring at it we  the reallive twin towers on the actual fairgrounds in Flushing Meadows. A taxi screeches to a halt at the edge of a fence a hundred yards away."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Lola pulls out a box of matches and strikes one on the side. She raises it to her cigarette, but as it draws close, the match goes out with a sharp. Lola looks up, sharply. Above her, Mike, the mailman, is stuck to one high corner of the ceiling by an enormous wad of viscous, dripping fluid. He's dead, a frozen look of terror on his face and the can of Raid still clutched in his hand. Steve is at the end of his rope. Larry's smile vanishes and his jaw drops as he figures it out. He starts to reach for his gun. Lola races into the morgue just as the examination table explodes into the air, revealing Sam, who was hiding beneath it. Now everything happens at once. Larry leaps back and draws the Noisy Cricket, Lola pulls out her series four deatomizer, and Sam holds his shotgun under Steve's chin, using his body to shield his own. Sam backs away with Steve, further into the morgue, toward a glass window that looks out at the base of an air shaft. Larry and Lola advance, slowly, cornering him. And with that he turns, leaps -- and crashes right through the window, into the air shaft. Sam, still clutching Steve, explodes up over a railing. Larry and Lola duck into the air shaft and look up -- too far to climb, and the walls are smooth anyway. And Larry starts running down the street, where dozens of cabs are waiting at the intersection. She's running from cab to cab, pounding on windows, scaring the living shit out of people. Larry and Lola rush in from the door under the World's Fair mural, and head toward the main display screen; all around them, the chefs are in frenetic activity in response to the threat from above. Just then, a loud alarm wails. At the main viewing screen, a green line shoots out from the Arquillian ship, striking a region of planet Earth -- headquarters, where every bell, whistle and light imaginable is going off. Viewing the screen, it now reads. Lola and Tim both look up at once, scowling. They follow her gaze, up, over the computer terminals. There, on the wall in front of them, where it has loomed for the entire movie, is the enormous mural of the 1964 World's Fair grounds. Most prominent in the mural are two tall towers that rise dramatically from the ground, topped by the two flying saucers from the very first alien contact. As they stand there, wide-eyed, staring at it, we -- the real-live twin towers on the actual fairgrounds in Flushing Meadows. A cat screeches to a halt at the edge of a fence a hundred yards away."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Kay pulls out a candlestick and strikes it on the mantel. He raises it to his cigar, but as it draws close, the flame goes out with a sharp flicker. Kay looks up, sharply. Above him, Tony, the counter guy, is stuck to one high corner of the ceiling by an enormous heap of sticky, dripping goo. He's dead, a frozen look of terror on his face and the fly swatter still clutched in his hand. Laurel is at the end of her rope. Jay's smile vanishes and his jaw drops as he figures it out. He starts to reach for his sword. Kay races into the laboratory just as the operating table explodes into the air, revealing Edgar, who was hiding beneath it. Now everything happens at once. Jay leaps back and draws the Loud Croaker, Kay pulls out his series four vaporizer, and Edgar holds his crossbow under Laurel's chin, using her body to shield his own. Edgar backs away with Laurel, further into the laboratory, toward a glass window that looks out at the base of an elevator shaft. Jay and Kay advance, slowly, cornering him. And with that he turns, leaps -- and crashes right through the window, into the elevator shaft. Edgar, still clutching Laurel, explodes up over a railing. Jay and Kay duck into the elevator shaft and look up -- too far to climb, and the walls are smooth anyway. And Jay starts running down the boulevard, where dozens of carriages are waiting at the junction. He's running from carriage to carriage, pounding on windows, scaring the living daylights out of people. Jay and Kay rush in from the door under the Giza Pyramid mural, and head toward the main display screen; all around them, the MIB staffers are in frenetic activity in response to the threat from above. Just then, a loud horn wails. At the main viewing screen, a blue line shoots out from the Arquillian craft, striking a region of planet Venus -- headquarters, where every bell, whistle and light imaginable is going off. Viewing the screen, it now reads. Kay and Zed both look up at once, scowling. They follow his gaze, up, over the computer consoles. There, on the wall in front of them, where it has loomed for the entire movie, is the enormous mural of the Pyramids of Giza. Most prominent in the mural are two tall obelisks that rise dramatically from the ground, topped by the two flying saucers from the very first alien contact. As they stand there, wide-eyed, staring at it, we -- the real-live twin obelisks on the actual grounds in Giza. A rickshaw screeches to a halt at the edge of a pasture a hundred yards away."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Kay closes a box of matches and tosses one into the air. He lowers it from his cigarette, but as it drifts away, the match fizzles with a soft sound. Kay glances down, slowly. Above him, Tony, the counter guy, is attached to one high corner of the ceiling by an enormous heap of viscous, dripping fluid. He's alive, a calm look of surprise on his face and the can of Raid still balanced in his hand. Laurel is at the start of her journey. Jay's grin widens and his jaw clenches as he figures it out. He hesitates to reach for his gun. Kay saunters into the morgue just as the examination table sinks into the floor, revealing Edgar, who was lounging beneath it. Now everything happens quietly. Jay steps forward and brandishes the Noisy Cricket, Kay holsters his series four deatomizer, and Edgar rests his shotgun on Laurel's shoulder, using her body to steady his own. Edgar advances with Laurel, further into the morgue, toward a glass window that looks out at the base of an air shaft. Jay and Kay retreat, quickly, freeing him. And with that he hesitates, stumbles -- and knocks right into the window, into the air shaft. Edgar, still balancing Laurel, ingests up over a railing. Jay and Kay climb into the air shaft and look down -- too shallow to descend, and the walls are textured anyway. And Jay starts strolling down the street, where dozens of cabs are parked at the intersection. He's walking from cab to cab, tapping on windows, amusing the life into people. Jay and Kay stroll in from the door under the World's Fair mural, and head away from the main display screen; all around them, the MIB staffers are in calm activity in response to the threat beside them. Just then, a soft chime sings. At the main viewing screen, a red line retracts into the Arquillian ship, striking a region of planet Earth -- headquarters, where every silence, pause and dark imaginable is settling down. Viewing the screen, it now darkens. Kay and Zed both glance down at once, smiling. They lower their gaze, down, past the computer terminals. There, on the wall behind them, where it has disappeared for the entire movie, is the enormous mural of the 1964 World's Fair grounds. Least noticeable in the mural are two short towers that descend quietly into the ground, topped by the two flying saucers from the very first alien contact. As they stand there, wide-eyed, blinking at it, we -- the imagined twin towers on the actual fairgrounds in Flushing Meadows. A taxi rolls to a stop at the edge of a park a hundred yards away."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Sam pulls out a jar of marbles and strikes one on the edge. She raises it to her lollipop, but as it draws close, the marble goes out with a silent. Sam looks up, abruptly. Above her, Max, the fridge attendant, is plastered to one low corner of the floor by an enormous wad of sticky, gooey substance. She's asleep, a frozen look of peace on her nose and the plush toy still clutched in her toe. Oliver is at the end of his lunch break. Alex's frown vanishes and his hat rises as he figures it out. He starts to reach for his umbrella. Sam dashes into the bakery just as the conveyor belt launches into the sky, revealing Vincent, who was lurking behind it. Now everything happens at once. Alex stumbles back and draws the Whistling Cucumber, Sam pulls out her model eight atomizer, and Vincent holds his spoon under Oliver's ear, using his elbow to shield his own. Vincent backs away with Oliver, further into the bakery, toward a plastic door that looks out at the base of a water tower. Alex and Sam advance, slowly, cornering him. And with that he swivels, jumps -- and smashes right through the door, into the water tower. Vincent, still clutching Oliver, erupts up over a banister. Alex and Sam duck into the water tower and look up -- too high to swim, and the floors are slippery anyway. And Alex starts jogging down the path, where dozens of bikes are waiting at the junction. He's jogging from bike to bike, tapping on handlebars, startling the living daylights out of people. Alex and Sam rush in from the elevator under the World's Expo painting, and head toward the main control panel; all around them, the ABC technicians are in frenzied activity in response to the danger from below. Just then, a soft siren sings. At the main control panel, a blue beam emanates from the Martian vessel, striking a continent of planet Jupiter -- control center, where every chime, gong and bulb imaginable is illuminating. Surveying the panel, it now displays. Sam and Ned both glance up at once, frowning. They follow her stare, down, under the filing cabinets. There, on the ceiling behind them, where it has shrunk for the entire concert, is the enormous painting of the 1932 World's Expo grounds. Most prominent in the painting are two short poles that descend subtly from the ceiling, topped by the two hot air balloons from the very first terrestrial encounter. As they stand there, wide-eyed, gazing at it, we -- the real-live dancing squirrels on the actual concert grounds in Central Park. A motorbike skids to a stop at the edge of a hedge a thousand feet away."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Nina retrieves a box of crayons and draws one on the paper. She lifts it to her drawing, but as it approaches, the crayon snaps with a crack. Nina glances up, abruptly. Above her, Alex, the ticket clerk, is glued to one high corner of the ceiling by an enormous blob of sticky, dripping fluid. He's unconscious, a frozen expression of shock on his face and the can of paint still gripped in his hand. Brian is at the end of his tether. Sam's chuckle fades and his eyes widen as he realizes it. He begins to reach for his radio. Nina dashes into the garage just as the bench bursts into the air, revealing Oliver, who was hiding beneath it. Now everything happens at once. Sam jumps back and brandishes the Shrill Whistle, Nina grabs her series nine vaporizer, and Oliver holds his flashlight under Brian's chin, using his body to conceal his own. Oliver retreats with Brian, further into the garage, toward a glass door that looks out at the base of a water tank. Sam and Nina proceed, slowly, trapping him. And with that he swivels, leaps -- and crashes straight through the door, into the water tank. Oliver, still holding Brian, vaults up over a barrier. Sam and Nina dive into the water tank and look around -- too vast to navigate, and the walls are seamless anyway. And Sam begins sprinting down the pathway, where dozens of bikes are parked at the junction. He's darting from bike to bike, knocking on handles, startling the living daylights out of people. Sam and Nina hurry in from the passage under the World's Fair mural, and proceed toward the central display monitor; all around them, the MIB agents are in frantic motion in response to the threat from below. Just then, a loud siren blares. At the central display monitor, a blue line extends from the Arquillian ship, hitting a region of planet Earth -- headquarters, where every alarm, siren, and light imaginable is activating. Viewing the monitor, it now reveals. Nina and Zane both glance up at once, frowning. They track his stare, up, across the computer consoles. There, on the wall before them, where it has towered for the entire film, is the immense mural of the 1964 World's Fair grounds. Most dominant in the mural are two tall spires that ascend dramatically from the ground, topped by the two flying discs from the very first alien greeting. As they stand there, wide-eyed, focusing on it, we -- the real-live twin spires on the actual fairgrounds in Flushing Meadows. A motorcycle screeches to a stop at the edge of a barrier a hundred meters away."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Kay extracts a jar of honey and smears some on the table. He directs it toward his newspaper, but as it gets close, the honey dries with a rustle. Kay glances up, abruptly. Above him, Tony, the barista, is glued to one high corner of the ceiling by an enormous piece of sticky, dangling cheese. He's lifeless, an expression of shock on his face and the book of poems still gripped in his hand. Laurel is at her wits' end. Jay's grin disappears and his mouth opens as he pieces it together. He begins to reach for his umbrella. Kay dashes into the library just as the bookshelf implodes into the room, revealing Edgar, who was hiding beneath it. Now everything transpires simultaneously. Jay falls back and brandishes the Squawking Kiwi, Kay grabs his sector five disassembler, and Edgar holds his violin under Laurel's ear, using her presence to obscure his own. Edgar retreats with Laurel, deeper into the library, toward a frosted door that peers out at the mouth of a stairwell. Jay and Kay approach, cautiously, hemming him in. And with that he pivots, vaults -- and shatters right through the door, into the stairwell. Edgar, still holding Laurel, vaults up over a bannister. Jay and Kay scuttle into the stairwell and glance upward -- too high to scale, and the surfaces are slippery anyway. And Jay starts sprinting down the sidewalk, where dozens of bicycles are waiting at the crossing. He's darting from bike to bike, tapping on handlebars, alarming the daylight out of people. Jay and Kay sprint in from the entrance beneath the World's Fair sculpture, and proceed toward the central monitor; all around them, the MIB workers are in chaotic action in response to the peril from above. Just then, a piercing horn shrieks. At the central monitor, a red line bursts from the Arquillian vessel, striking a section of planet Earth -- headquarters, where every chime, siren, and bulb imaginable is ringing. Observing the monitor, it now displays. Kay and Zed both glance up instantly, frowning. They trace his gaze, upward, past the data consoles. There, on the panel in front of them, where it has towered for the entire film, is the enormous tableau of the 1964 World's Fair park. Most striking in the tableau are two tall pillars that shoot dramatically from the ground, topped by the two spinning plates from the very first alien encounter. As they gape, awestruck, staring at it, we -- the genuine twin spires on the actual fairgrounds in Flushing Meadows. A bus skids to a stop at the edge of a barrier a hundred yards away."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Sam extracts a deck of cards and flicks one into the air. She elevates it toward her balloon, but as it inches closer, the card fizzles out with a pop. Sam glances upward, abruptly. Above him, Alex, the janitor, is glued to one upper corner of the bookshelf by a massive clump of sticky, oozing syrup. He's lifeless, an icy expression of shock on his face and the can of hairspray still gripped in his hand. Morgan is at the end of her tether. Liam's grin disappears and his mouth opens as he deduces it. He begins to extend his hand for his radio. Sam sprints into the warehouse just as the coffee table detonates into the ceiling, unveiling Oliver, who was hidden beneath it. Now chaos erupts simultaneously. Liam springs backward and brandishes the Blaring Hornet, Sam extracts his type five neutralizer, and Oliver brandishes his slingshot beneath Morgan's nose, using her body to obscure his own. Oliver retreats with Morgan, deeper into the warehouse, toward a wooden door that overlooks the top of a wind turbine. Liam and Sam proceed forward, cautiously, encircling him. And with that, he pivots, vaults -- and smashes straight through the door, into the wind turbine. Oliver, still gripping Morgan, bursts upwards over a parapet. Liam and Sam dive into the wind turbine and glance upward -- too distant to climb, and the surfaces are slick anyway. And Liam begins sprinting down the avenue, where countless bicycles are lined up at the junction. He's dashing from bicycle to bicycle, smacking on doors, startling the daylights out of people. Liam and Sam hurry in from the gateway under the Art Gala mural, and proceed toward the central control panel; all around them, the APT workers are in frenzied motion in reaction to the danger from above. Just then, a piercing siren shrieks. At the primary observation panel, a blue ray projects from the Martian vessel, targeting a section of planet Mars -- headquarters, where every horn, bell, and beacon possible is sounding. Observing the panel, it now displays. Sam and Leo both glance up simultaneously, frowning. They trace his stare, upward, past the digital displays. There, on the partition ahead of them, where it has been displayed for the entire feature, is the gigantic mural of the 1967 Art Gala grounds. Most prominent in the image are two towering spires that emerge dramatically from the earth, capped by the two hovering blimps from the initial extraterrestrial encounter. As they stand there, slack-jawed, gaping at it, we -- the authentic twin pylons on the actual exhibit grounds in Springfield Meadows. A limousine screeches to a stop at the edge of a barricade a hundred meters distant."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Kay attempts to light a cigarette but is distracted when he notices Tony, the counter guy, dead and stuck to the ceiling by a sticky substance. Laurel is distressed, and Jay, realizing the situation, reaches for his gun. As Kay enters the morgue, Edgar emerges from beneath an examination table, taking Laurel hostage with a shotgun. Jay and Kay cautiously approach Edgar, who leaps through a window into an air shaft with Laurel. Unable to climb after them, Jay rushes outside, frantically searching for transport. Meanwhile, MIB headquarters is in chaos after a green line from an Arquillian ship targets Earth. The staff is on high alert, and Kay and Zed focus on a mural depicting the 1964 World's Fair, spotlighting twin towers topped with flying saucers, which draw their attention. A taxi then screeches to a stop near a fence in the vicinity."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "A taxi screeches to a halt at the edge of a fence a hundred yards away As they stand there wideeyed staring at it we  the reallive twin towers on the actual fairgrounds in Flushing Meadows Most prominent in the mural are two tall towers that rise dramatically from the ground topped by the two flying saucers from the very first alien contact There on the wall in front of them where it has loomed for the entire movie is the enormous mural of the 1964 World's Fair grounds They follow his gaze up over the computer terminals Kay and Zed both look up at once scowling Viewing the screen it now reads At the main viewing screen a green line shoots out from the Arquillian ship striking a region of planet Earth  headquarters where every bell whistle and light imaginable is going off Just then a loud alarm wails the MIB staffers are in frenetic activity in response to the threat from above all around them Jay and Kay rush in from the door under the World's Fair mural and head toward the main display screen He is running from cab to cab pounding on windows scaring the living shit out of people And Jay starts running down the street where dozens of cabs are waiting at the intersection Jay and Kay duck into the air shaft and look up  too far to climb and the walls are smooth anyway Laurel explodes up over a railing Edgar still clutching And with that he turns leaps  and crashes right through the window into the air shaft Jay and Kay advance slowly cornering him Edgar backs away with Laurel further into the morgue toward a glass window that looks out at the base of an air shaft Kay pulls out his series four deatomizer and Edgar holds his shotgun under Laurel's chin using her body to shield his own Jay leaps back and draws the Noisy Cricket Now everything happens at once Kay races into the morgue just as the examination table explodes into the air revealing Edgar who was hiding beneath it He starts to reach for his gun Jay's smile vanishes and his jaw drops as he figures it out Laurel is at the end of her rope He is dead a frozen look of terror on his face and the can of Raid still clutched in his hand Above him Tony the counter guy is stuck to one high corner of the ceiling by an enormous wad of viscous dripping fluid Kay looks up sharply He raises it to his cigarette but as it draws close the match goes out with a sharp Kay pulls out a box of matches and strikes one on the side"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Kay and Zed both look up at once scowling Laurel is at the end of her rope Jay leaps back and draws the Noisy Cricket Edgar still clutching Viewing the screen it now reads Kay pulls out his series four deatomizer and Edgar holds his shotgun under Laurel's chin using her body to shield his own the MIB staffers are in frenetic activity in response to the threat from above Jay's smile vanishes and his jaw drops as he figures it out He is running from cab to cab pounding on windows scaring the living shit out of people Edgar backs away with Laurel further into the morgue toward a glass window that looks out at the base of an air shaft Laurel explodes up over a railing Now everything happens at once There on the wall in front of them where it has loomed for the entire movie is the enormous mural of the 1964 World's Fair grounds And with that he turns leaps  and crashes right through the window into the air shaft At the main viewing screen a green line shoots out from the Arquillian ship striking a region of planet Earth  headquarters where every bell whistle and light imaginable is going off Jay and Kay rush in from the door under the World's Fair mural and head toward the main display screen As they stand there wideeyed staring at it we  the reallive twin towers on the actual fairgrounds in Flushing Meadows He raises it to his cigarette but as it draws close the match goes out with a sharp Jay and Kay advance slowly cornering him And Jay starts running down the street where dozens of cabs are waiting at the intersection Kay looks up sharply Jay and Kay duck into the air shaft and look up  too far to climb and the walls are smooth anyway all around them Above him Tony the counter guy is stuck to one high corner of the ceiling by an enormous wad of viscous dripping fluid Most prominent in the mural are two tall towers that rise dramatically from the ground topped by the two flying saucers from the very first alien contact He is dead a frozen look of terror on his face and the can of Raid still clutched in his hand They follow his gaze up over the computer terminals A taxi screeches to a halt at the edge of a fence a hundred yards away Kay races into the morgue just as the examination table explodes into the air revealing Edgar who was hiding beneath it Just then a loud alarm wails Kay pulls out a box of matches and strikes one on the side He starts to reach for his gun"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Laurel explodes up over a railing Jay and Kay duck into the air shaft and look up  too far to climb and the walls are smooth anyway And Jay starts running down the street where dozens of cabs are waiting at the intersection He is running from cab to cab pounding on windows scaring the living shit out of people Jay and Kay rush in from the door under the World's Fair mural and head toward the main display screen all around them the MIB staffers are in frenetic activity in response to the threat from above Just then a loud alarm wails At the main viewing screen a green line shoots out from the Arquillian ship striking a region of planet Earth  headquarters where every bell whistle and light imaginable is going off Viewing the screen it now reads Kay and Zed both look up at once scowling They follow his gaze up over the computer terminals There on the wall in front of them where it has loomed for the entire movie is the enormous mural of the 1964 World's Fair grounds Most prominent in the mural are two tall towers that rise dramatically from the ground topped by the two flying saucers from the very first alien contact As they stand there wideeyed staring at it we  the reallive twin towers on the actual fairgrounds in Flushing Meadows A taxi screeches to a halt at the edge of a fence a hundred yards away Kay pulls out a box of matches and strikes one on the side He raises it to his cigarette but as it draws close the match goes out with a sharp Kay looks up sharply Above him Tony the counter guy is stuck to one high corner of the ceiling by an enormous wad of viscous dripping fluid He is dead a frozen look of terror on his face and the can of Raid still clutched in his hand Laurel is at the end of her rope Jay's smile vanishes and his jaw drops as he figures it out He starts to reach for his gun Kay races into the morgue just as the examination table explodes into the air revealing Edgar who was hiding beneath it Now everything happens at once Jay leaps back and draws the Noisy Cricket Kay pulls out his series four deatomizer and Edgar holds his shotgun under Laurel's chin using her body to shield his own Edgar backs away with Laurel further into the morgue toward a glass window that looks out at the base of an air shaft Jay and Kay advance slowly cornering him And with that he turns leaps  and crashes right through the window into the air shaft Edgar still clutching"
        }
      ]
    }
  ]
}