{
  "ground_truth": "Sidney scurries off excitedly, and back at his apartment, he types on a laptop at his coffee table. Grinning proudly, he scratches his chin and looks down at a pile of magazines on the table. He takes some of Sophie's promotional literature from the pile and regards it with a grimace. It's Chihuahua, as Sophie stares back at him from the page. He dials a number on his cell phone. A van sweeps past the Soho Grand Hotel as Sidney fidgets while trying to get comfortable on a sofa in the spacious white lobby. The cushion he's sitting on slips forward, causing him to sink awkwardly into the crack. A tall, slender woman emerges from a lift to find him struggling with the cushion, his shirt and tank top having ridden up unflatteringly. The woman towers over him, and Sidney's eyes widen as she shrugs. Sidney plonks the fishbowl down on the bar, and she stifles a self-conscious smile. On a TV, Alison's eyes are downcast. Sidney comes back for the fishbowl and heads off. Alison stares down sadly at an untouched glass of White Russian. Meanwhile, Clayton presides over a staff meeting, and Sidney's irked. Sidney scowls as Lawrence basks in the adulation of his colleagues, and Sidney catches up with him outside the meeting. He grins broadly, then heads off before turning back heavy-browed. Sidney screws up his face as Lawrence gives him a jaunty nod and saunters off. Lawrence takes a seat behind his desk to address his underlings. A blonde stripper reveals a penis as Mrs. Harding and her two young daughters look on. Sidney quickly cups Bobbie's dangling penis. A stone-faced receptionist stares at Sidney, who sits outside Clayton's office, obsessively scrubbing his hand with a tissue. The receptionist frowns as Sidney looks in at Eleanor and Clayton, who stand at a desk discussing an A3 mock-up of a potential magazine cover. Eleanor exits and walks uneasily past Sidney, while Clayton looms large in the doorway. Sidney skulks into the office with his head hung low, sits as Clayton paces, and then Clayton is behind Sidney. Clayton walks round to face him, and Sidney looks him in the eye, but Clayton stares coldly. Clayton turns away in his high-backed swivel chair as Sidney lopes out with his tail between his legs. Seated party guests eat under white marquees on the lawn outside Clayton's sprawling mansion. Alison's puzzled as Sidney rises from the table and lets his hand linger on Alison's shoulder before sauntering away. Alison looks behind her, then she too rises from the table. Sidney, dressed in long shorts and a Hawaiian shirt, spots Sophie approaching Lawrence. Sidney joins Lawrence and Sophie and gawks, then lopes off. Sidney spies on them from behind a bush as Lawrence stands with Alison, playfully tossing nuts into his mouth.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Sidney dashes off eagerly, and back at his flat, he types on a notebook at his coffee table. Smiling proudly, he rubs his chin and glances down at a stack of periodicals on the table. He takes some of Sophie's advertising material from the stack and observes it with a frown. It's Chihuahua, as Sophie looks back at him from the page. He calls a number on his mobile. A vehicle glides past the Soho Grand Hotel as Sidney squirms while attempting to get comfortable on a sofa in the roomy white lobby. The cushion he's seated on shifts forward, causing him to sink awkwardly into the gap. A tall, slender woman appears from a lift to find him wrestling with the cushion, his shirt and tank top having ridden up unbecomingly. The woman towers over him, and Sidney's eyes widen as she shrugs. Sidney drops the fishbowl down on the bar, and she suppresses a self-conscious grin. On a TV, Alison's eyes are downcast. Sidney returns for the fishbowl and heads off. Alison gazes down sadly at an untouched glass of White Russian. Meanwhile, Clayton presides over a staff assembly, and Sidney's annoyed. Sidney scowls as Lawrence basks in the praise of his coworkers, and Sidney catches up with him outside the meeting. He beams broadly, then heads off before turning back heavy-browed. Sidney contorts his face as Lawrence gives him a jaunty nod and strolls off. Lawrence sits behind his desk to address his subordinates. A blonde stripper reveals a penis as Mrs. Harding and her two young daughters look on. Sidney hurriedly cups Bobbie's dangling penis. A stone-faced receptionist stares at Sidney, who sits outside Clayton's office, obsessively wiping his hand with a tissue. The receptionist frowns as Sidney looks in at Eleanor and Clayton, who stand at a desk discussing an A3 mock-up of a potential magazine cover. Eleanor exits and walks uneasily past Sidney, while Clayton looms large in the doorway. Sidney skulks into the office with his head hung low, sits as Clayton paces, and then Clayton is behind Sidney. Clayton walks around to face him, and Sidney looks him in the eye, but Clayton stares coldly. Clayton turns away in his high-backed swivel chair as Sidney ambles out with his tail between his legs. Seated party guests eat under white marquees on the lawn outside Clayton's sprawling mansion. Alison's puzzled as Sidney rises from the table and lets his hand linger on Alison's shoulder before strolling away. Alison looks behind her, then she too rises from the table. Sidney, attired in long shorts and a Hawaiian shirt, spots Sophie approaching Lawrence. Sidney joins Lawrence and Sophie and gawks, then ambles off. Sidney spies on them from behind a shrub as Lawrence stands with Alison, playfully tossing nuts into his mouth."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Sidney is scurried off excitedly, and back at his apartment, a laptop is typed on by him at his coffee table. Proudly grinning, his chin is scratched by him, and a pile of magazines on the table is looked down at. Some of Sophie's promotional literature is taken from the pile by him and regarded with a grimace. Chihuahua watches him as Sophie stares back at him from the page. A number is dialed on his cell phone by him. A van sweeps past the Soho Grand Hotel while Sidney fidgets in an attempt to get comfortable on a sofa in the spacious white lobby. The cushion he is sitting on slips forward, causing him to sink awkwardly into the crack. A tall, slender woman emerges from a lift and finds him struggling with the cushion, his shirt and tank top having ridden up unflatteringly. She towers over him, and his eyes are widened by Sidney as she shrugs. The fishbowl is plonked down on the bar by Sidney, and a self-conscious smile is stifled by her. Alison's eyes are downcast on a TV. Sidney comes back for the fishbowl and heads off. Alison sadly stares down at an untouched glass of White Russian. Meanwhile, a staff meeting is presided over by Clayton, and Sidney is irked. Lawrence basks in the adulation of his colleagues as Sidney scowls, and Sidney catches up with him outside the meeting. A broad grin is given by him before he heads off, then turns back heavy-browed. His face is screwed up by Sidney as a jaunty nod is given by Lawrence, who saunters off. A seat is taken behind his desk by Lawrence to address his underlings. A penis is revealed by a blonde stripper as Mrs. Harding and her two young daughters look on. Bobbie’s dangling penis is quickly cupped by Sidney. A stone-faced receptionist stares at Sidney, who is seated outside Clayton's office, while his hand is obsessively scrubbed with a tissue by him. A frown is given by the receptionist as Sidney looks in at Eleanor and Clayton, who are standing at a desk discussing an A3 mock-up of a potential magazine cover. Eleanor exits and walks uneasily past Sidney, while large in the doorway is loomed by Clayton. Into the office, Sidney skulks with his head hung low, sits as Clayton paces, and then Sidney is approached by Clayton from behind. Clayton walks round to face him, and Sidney looks him in the eye, but a cold stare is given by Clayton. Away is turned by Clayton in his high-backed swivel chair as out Sidney lopes with his tail between his legs. Seated party guests eat under white marquees on the lawn outside Clayton's sprawling mansion. Sidney rises from the table, puzzling Alison as his hand is lingered on Alison's shoulder by him before away he saunters. Alison looks behind her, then she too rises from the table. In long shorts and a Hawaiian shirt, Sidney is dressed, and Sophie is spotted approaching Lawrence by him. Lawrence and Sophie are joined by Sidney, who gawks, then off he lopes. From behind a bush, they are spied on by Sidney as Lawrence stands with Alison, playfully tossing nuts into his mouth."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Sidney rushes off excitedly, then types on his laptop at home. Grinning, he scratches his chin and looks down at a pile of magazines. He grimaces at Sophie's promotional literature featuring a Chihuahua. He dials a number on his phone. A van passes the Soho Grand Hotel as Sidney fidgets on a lobby sofa. The cushion slips, and a tall woman emerges from a lift, finding Sidney awkwardly adjusting his shirt. Sidney sets a fishbowl on the bar, and she smiles. On a TV, Alison looks down. Sidney retrieves the fishbowl, and Alison stares at a White Russian. Clayton leads a staff meeting; Sidney is irked. Sidney scowls at Lawrence's praise and catches him outside. Sidney grins and leaves but turns back annoyed as Lawrence nods and walks off. Lawrence addresses his team. A stripper reveals a penis while Mrs. Harding and daughters watch. Sidney quickly covers the stripper. A receptionist stares at Sidney obsessively cleaning his hand outside Clayton's office. The receptionist frowns as Sidney observes Eleanor and Clayton discussing a magazine cover. Eleanor exits nervously as Clayton looms. Sidney enters with head down, sits as Clayton paces. Clayton confronts Sidney, who looks him in the eye, but Clayton turns away coldly. Guests eat under white marquees at Clayton's mansion. Sidney rises, hand lingering on Alison's shoulder, then leaves. Alison, puzzled, follows. Sidney, in casual attire, sees Sophie approach Lawrence. He joins them, gawks, then leaves. Sidney spies on Lawrence playfully tossing nuts to Alison."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Sidney excitedly rushes off, types on his laptop at home, and scratches his chin, glancing at a magazine pile. He grimaces at Sophie’s promotional literature, featuring a Chihuahua, and calls a number. At the Soho Grand Hotel, Sidney fidgets on a sofa, sinking into the gap as a tall woman finds him struggling with a cushion. Sidney places a fishbowl on the bar, earning a shy smile from her. On TV, Alison looks downcast as Sidney retrieves the fishbowl. She stares at a full glass of White Russian. Meanwhile, Clayton leads a meeting, irking Sidney. Sidney scowls at Lawrence's praise and later confronts him. Lawrence nods jauntily, leaving Sidney annoyed. During a meeting, a blonde stripper exposes herself to Mrs. Harding and daughters. Sidney quickly covers Bobbie's exposed parts. Waiting outside Clayton's office, Sidney obsessively cleans his hand, as the receptionist frowns. Eleanor passes Sidney, and Clayton stares coldly after confronting him. At Clayton's mansion, party guests dine outside. Sidney lingers by Alison’s shoulder, then walks away, prompting her to follow. In a Hawaiian shirt, Sidney sees Sophie and Lawrence together, gawks, and sneaks off. He watches them from behind a bush as Lawrence tosses nuts, standing with Alison."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Sidney, filled with excitement, quickly scurries off, and upon returning to his cozy apartment, he eagerly begins typing away on his laptop, which is perched on the coffee table. With a proud grin spread across his face, he reaches up to give his chin a thoughtful scratch while gazing down at the messy pile of magazines scattered across the table's surface. From this assorted collection, he selects some of Sophie's promotional materials, regarding them with a displeased frown. The imagery of a Chihuahua emblazoned on it draws his attention, particularly as Sophie's eyes seem to stare back at him defiantly from the page. With determination, he dials a number on his cell phone. Meanwhile, a van swiftly sweeps past the entrance of the Soho Grand Hotel, where Sidney is seen fidgeting nervously while attempting to find comfort on a plush sofa in the hotel's expansive and immaculately white lobby. However, the troublesome cushion he is seated on shifts forward unexpectedly, causing him to sink awkwardly and deeply into the crevice. At this moment, a tall and slender woman emerges gracefully from the lift, only to find him struggling with the deceitful cushion, his shirt and tank top having ridden up in an unflattering manner. She towers impressively over him, and Sidney’s eyes widen in surprise as she casually shrugs. In a moment of awkwardness, Sidney clumsily plonks the fishbowl down onto the bar, and despite herself, she suppresses a self-conscious smile. On a nearby television, Alison can be seen with her eyes cast down, a picture of dejection. Sidney returns for the fishbowl and promptly departs. Nearby, Alison gazes despondently at a glass of White Russian that remains untouched on the table. In the meantime, Clayton is leading a lively staff meeting, and Sidney finds himself irked beyond measure. He scowls with displeasure as Lawrence basks in the enthusiastic adulation of their colleagues. Sidney later catches up with him outside the meeting room. He grins broadly, initially heading off before pausing and turning back with furrowed brows. Sidney scrunches up his face as Lawrence gives him a jaunty nod and saunters off with confidence. Lawrence then takes his place behind his desk, ready to address his underlings. Meanwhile, in a shocking scene, a blonde stripper reveals a penis in front of Mrs. Harding and her two young daughters, who look on in disbelief. Sidney acts quickly, cupping Bobbie's dangling penis in a bid to prevent further embarrassment. Elsewhere, a stone-faced receptionist stares disapprovingly at Sidney, who sits outside Clayton’s office, obsessively scrubbing his hand with a tissue in a vain attempt to cleanse it. The receptionist frowns deeply as Sidney gazes in at Eleanor and Clayton, who are engrossed in a discussion over an A3 mock-up of a potential magazine cover that sits before them on a desk. Eleanor exits, walking uneasily past Sidney, while Clayton casts a looming shadow from the doorway. Sidney then skulks into the office with his head hung low, taking a seat as Clayton begins pacing back and forth. Eventually, Clayton moves to stand directly behind Sidney. He then walks around to face him directly, and Sidney meets his gaze, but Clayton's eyes are cold and unyielding. Clayton turns away, boldly settling into his high-backed swivel chair, as Sidney, feeling defeated, lopes out of the room with his tail metaphorically between his legs. Outside Clayton's sprawling mansion, seated party guests are enjoying their meals under elegant white marquees on the lush green lawn. Alison looks puzzled as she observes Sidney rising from his seat, his hand lingering momentarily on her shoulder before he saunters off. Curiously, Alison looks behind her, then she too rises from the table. Sidney, dressed in casual long shorts and a vibrant Hawaiian shirt, spots Sophie approaching Lawrence. He quickly joins Lawrence and Sophie, gawking momentarily before he lopes off again. From a discreet position behind a bush, Sidney spies on them as Lawrence stands with Alison, playfully tossing nuts into his mouth."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Sidney, brimming with a palpable sense of excitement and anticipation, hurriedly scampers off. Upon returning to the comfort of his inviting and snug apartment, he eagerly positions himself in front of his trusty laptop, which rests conveniently on the low coffee table in the living room. A proud and beaming grin spreads widely across his face. As he contemplates, he reaches up to give his chin a thoughtful, perhaps even pensive, scratch while his gaze drifts down to the disordered pile of magazines strewn haphazardly across the table's surface. From this jumbled assortment, he carefully selects a few of Sophie's promotional materials, regarding them with a distinct and pointed frown of displeasure. The imagery of a Chihuahua emblazoned prominently on the material commands his attention, especially as Sophie's eyes seem to stare defiantly and challengingly back at him from the glossy page. Fueled by determination, he dials a number on his cell phone with focused intent. Meanwhile, outside, a van glides swiftly past the entrance of the impressive Soho Grand Hotel, where Sidney is seen fidgeting nervously, trying to find comfort on an opulent, plush sofa in the hotel's expansive and immaculately white lobby area. The troublesome cushion he is perched upon shifts forward unexpectedly, causing him to sink awkwardly and deeply into the crevice formed. Just at this moment, a tall and slender woman emerges gracefully from the lift, only to find him struggling in vain with the deceitful cushion, his shirt and tank top having embarrassingly ridden up in an unflattering manner. She towers impressively over him, and Sidney’s eyes widen in surprise as she casually offers a nonchalant shrug. In an awkward moment, Sidney clumsily plonks the fishbowl down onto the bar, and despite herself, she suppresses a self-conscious yet amused smile. On a nearby television screen, Alison can be seen with her eyes dejectedly cast down, portraying a picture of utter sadness and dejection. Sidney promptly retrieves the fishbowl and departs with a sense of urgency. Nearby, Alison gazes despondently at a glass of White Russian that remains untouched and forlorn on the table. In the meantime, Clayton is energetically leading a lively staff meeting, and Sidney finds himself deeply irked and irritated beyond measure. He scowls with overt displeasure as Lawrence basks in the enthusiastic adulation and admiration of their gathered colleagues. Sidney later catches up with him just outside the meeting room. He grins broadly, initially heading off before halting, pausing, and turning back with furrowed brows. Sidney scrunches up his face as Lawrence gives him a jaunty nod and saunters off with an air of confidence. Lawrence then confidently takes his place behind his imposing desk, ready and prepared to address his underlings. Meanwhile, in a shocking and unexpected scene, a blonde stripper reveals a surprise—a penis—in front of Mrs. Harding and her two young daughters, who look on in sheer disbelief and astonishment. Sidney acts swiftly and decisively, cupping Bobbie's dangling anatomy in a bid to prevent further embarrassment and potential scandal. Elsewhere, a stone-faced receptionist stares disapprovingly at Sidney, who sits just outside Clayton’s office. He obsessively scrubs and cleanses his hand with a tissue in a vain and futile attempt to cleanse it. The receptionist frowns deeply, as Sidney peers intently in at Eleanor and Clayton, engrossed in a discussion over an A3 mock-up of a potential magazine cover that sits prominently on a desk before them. Eleanor exits, walking uneasily past Sidney, while Clayton casts a looming shadow from the doorway. Sidney then skulks into the office, head hung low, taking a seat as Clayton begins pacing back and forth with purpose. Eventually, Clayton moves to stand directly behind Sidney, then circles around to face him directly, meeting Sidney’s gaze with eyes that are cold and unyielding. Clayton turns away, boldly settling into his high-backed swivel chair, as Sidney, feeling utterly defeated, lopes out of the room with his tail metaphorically between his legs. Outside Clayton's sprawling and luxurious mansion, seated party guests are enjoying their meals under elegant white marquees on the lush and well-manicured green lawn. Alison looks puzzled and perplexed as she observes Sidney rising from his seat, his hand lingering briefly on her shoulder. He then saunters off. Curiously, Alison glances behind her, then she too rises from the table. Sidney, dressed casually in long shorts and a vibrant, colorful Hawaiian shirt, spots Sophie approaching Lawrence. Quick to join the pair, Sidney gawks momentarily before he lopes off again. From a discreet and hidden position behind a bush, Sidney spies on them as Lawrence stands with Alison, playfully tossing nuts into his mouth."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Sidney, filled with excitement, scurries away quickly, and soon finds himself back at his apartment where he perches in front of his coffee table with a laptop open, his fingers flying over the keyboard. As he types, a proud grin spreads across his face, and he pauses momentarily to scratch his chin thoughtfully. His eyes then drift downward to where a pile of magazines lies scattered on the table. He reaches out to the pile and selects some of Sophie's promotional literature, holding it up to scrutinize with a grimace of disapproval. The image of Sophie staring back at him from the page reminds him of her Chihuahua, and with a furrowed brow, he reaches for his cell phone and dials a number. In a different scene, a van glides past the Soho Grand Hotel while Sidney, seated on a sofa in the hotel's spacious white lobby, fidgets as he attempts to find a comfortable position. The sofa cushion beneath him slides forward unexpectedly, causing him to sink awkwardly into the crevice between cushions, just as a tall, slender woman steps out of a lift and spots him grappling with the cushion. His shirt and tank top have crept up, creating an unflattering look as she stands over him, prompting Sidney to widen his eyes in surprise as she shrugs nonchalantly. Sidney abruptly places a fishbowl onto the bar, causing her to suppress a self-conscious smile, and then a TV broadcast catches Sidney's eye, showing Alison with her eyes cast downward in sadness. Sidney retrieves the fishbowl from the bar and departs, leaving behind Alison, who gazes sadly at her untouched glass of White Russian. Meanwhile, elsewhere, Clayton is conducting a staff meeting, during which Sidney sits, visibly irritated. Sidney scowls with frustration as he observes Lawrence basking in the admiration of his colleagues. Later, Sidney catches up with Lawrence outside of the meeting room, flashing a wide grin at him before abruptly walking away, only to turn back with a furrowed brow. Sidney screws up his face in annoyance as Lawrence responds with a jaunty nod and continues to stride away confidently, eventually taking his place behind his desk to address his team. Meanwhile, in another location, a blonde stripper reveals a penis in front of Mrs. Harding and her two young daughters, causing Sidney to react quickly by cupping the stripper Bobbie's dangling appendage with his hand. Sitting outside Clayton's office, a stone-faced receptionist watches Sidney intently as he obsessively scrubs his hand with a tissue, obviously perturbed by the earlier incident. The receptionist frowns slightly as Sidney glances through a window into the office, where Eleanor and Clayton stand engaged in a conversation over an A3 mock-up of a potential magazine cover. Eleanor exits the room, walking with unease past Sidney, who sits dejectedly, while Clayton's imposing figure fills the doorway. Sidney, feeling defeated, skulks into the office with his head hung low, taking a seat as Clayton paces behind him. Clayton makes his way around to face Sidney directly, locking eyes with him, but his gaze remains cold and detached. Eventually, Clayton swivels away in his high-backed chair, dismissing Sidney, who then lopes out of the office with his proverbial tail between his legs. At a party on the lawn outside Clayton's expansive mansion, guests are seated under white marquees enjoying their meal. Sidney, feeling a wave of bewilderment, rises slowly from the table, allowing his hand to linger momentarily on Alison's shoulder as he saunters away. Puzzled, Alison turns to look behind her before also rising from the table. Clad in long shorts and a Hawaiian shirt, Sidney observes Sophie making her way toward Lawrence. Approaching them, Sidney joins the pair and gawks momentarily before retreating. From a vantage point behind a bush, Sidney spies on Lawrence, who is now standing with Alison, playfully tossing nuts into his mouth, completely oblivious to Sidney's watchful eyes."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Sidney hurriedly returns to his apartment, where he works on his laptop and contemplates Sophie's promotional materials with a grimace. After dialing a number on his cell phone, he heads to the Soho Grand Hotel and awkwardly struggles with a sofa cushion in the lobby. A tall woman observes him, and they exchange glances before Sidney sets a fishbowl on the bar and collects it later, noticing Alison's sorrowful demeanor. Meanwhile, at a staff meeting led by Clayton, Sidney grows irritated with Lawrence's popularity and confronts him afterward, which results in a tense exchange. At another event, Sidney quickly intervenes during an unexpected moment with a stripper and endures judgment from a receptionist as he waits outside Clayton's office, where a professional discussion is taking place. Sidney's interaction with Clayton concludes in disappointment as he leaves the office. At a party on Clayton's mansion's lawn, Sidney subtly interacts with Alison before observing Sophie and Lawrence from a distance, discreetly hiding to watch their interactions."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Sidney scurries off excitedly to his apartment, located in a bustling urban area, and back there, he types on a laptop at his coffee table. Grinning proudly, he scratches his chin and looks down at a pile of magazines on the table, which includes the latest issue of a popular fashion publication. He takes some of Sophie's promotional literature from the pile, which she's known for distributing widely as part of her marketing strategy, and regards it with a grimace. It's Chihuahua, a renowned lifestyle magazine, as Sophie, a prominent figure in the fashion world, stares back at him from the page. He dials a number on his cell phone, a sleek new model from a leading tech brand. A van sweeps past the Soho Grand Hotel, a chic establishment known for hosting celebrities, as Sidney fidgets while trying to get comfortable on a sofa in the spacious white lobby. The cushion he's sitting on slips forward, causing him to sink awkwardly into the crack. A tall, slender woman, a respected art curator and frequent guest at the hotel's events, emerges from a lift to find him struggling with the cushion, his shirt and tank top having ridden up unflatteringly. The woman towers over him, and Sidney's eyes widen as she shrugs, unfazed by the scene. Sidney plonks the fishbowl down on the bar in the hotel's renowned cocktail lounge, and she stifles a self-conscious smile. On a TV broadcasting above the bar, Alison, a rising star in the indie film scene, has her eyes downcast. Sidney comes back for the fishbowl and heads off. Alison stares down sadly at an untouched glass of White Russian, a drink she secretly dislikes but orders out of habit. Meanwhile, Clayton, a formidable publishing magnate known for his ruthless business tactics, presides over a staff meeting, and Sidney's irked. Sidney scowls as Lawrence, a charismatic editor with a flair for dramatic entrances, basks in the adulation of his colleagues, and Sidney catches up with him outside the meeting. He grins broadly, then heads off before turning back heavy-browed. Sidney screws up his face as Lawrence gives him a jaunty nod and saunters off to his office, where he takes a seat behind his desk to address his underlings. A blonde stripper at an avant-garde performance art show reveals a penis, much to the shock of Mrs. Harding and her two young daughters. Sidney quickly cups Bobbie's dangling penis, trying to spare the family more embarrassment. A stone-faced receptionist, known for her no-nonsense demeanor, stares at Sidney, who sits outside Clayton's office, obsessively scrubbing his hand with a tissue. The receptionist frowns as Sidney looks in at Eleanor, a seasoned editor with a reputation for her sharp critiques, and Clayton, who stand at a desk discussing an A3 mock-up of a potential magazine cover. Eleanor exits and walks uneasily past Sidney, casting a wary glance at him, while Clayton looms large in the doorway, a commanding presence in the office. Sidney skulks into the office with his head hung low, sits as Clayton paces, exuding an air of authority, and then Clayton is behind Sidney. Clayton walks round to face him, and Sidney looks him in the eye, but Clayton stares coldly, maintaining his reputation as a tough negotiator. Clayton turns away in his high-backed swivel chair, a symbol of his executive status, as Sidney lopes out with his tail between his legs. Seated party guests eat under white marquees on the lawn outside Clayton's sprawling mansion, a venue often featured in lifestyle magazines for its grandeur. Alison's puzzled as Sidney rises from the table and lets his hand linger on Alison's shoulder before sauntering away with an air of mystery. Alison looks behind her, sensing something unspoken, then she too rises from the table. Sidney, dressed in long shorts and a Hawaiian shirt, a stark contrast to the formal attire of other guests, spots Sophie approaching Lawrence. Sidney joins Lawrence and Sophie, the latter known for her sharp wit and charm, and gawks, then lopes off. Sidney spies on them from behind a bush as Lawrence stands with Alison, playfully tossing nuts into his mouth, a casual gesture of his easygoing nature."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Meanwhile Clayton presides over a staff meeting and Sidney's irked Sidney scurries off excitedly and back at his apartment he types on a laptop at his coffee table The woman towers over him and Sidney's eyes widen as she shrugs Grinning proudly he scratches his chin and looks down at a pile of magazines on the table He takes some of Sophie's promotional literature from the pile and regards it with a grimace It is Chihuahua as Sophie stares back at him from the page He dials a number on his cell phone A stonefaced receptionist stares at Sidney who sits outside Clayton's office obsessively scrubbing his hand with a tissue A van sweeps past the Soho Grand Hotel as Sidney fidgets while trying to get comfortable on a sofa in the spacious white lobby The cushion he is sitting on slips forward causing him to sink awkwardly into the crack Grinning proudly he scratches his chin and looks down at a pile of magazines on the table A tall slender woman emerges from a lift to find him struggling with the cushion his shirt and tank top having ridden up unflatteringly The woman towers over him and Sidney's eyes widen as she shrugs Sidney plonks the fishbowl down on the bar and she stifles a selfconscious smile Clayton turns away in his highbacked swivel chair as Sidney lopes out with his tail between his legs On a TV Alison's eyes are downcast The receptionist frowns as Sidney looks in at Eleanor and Clayton who stand at a desk discussing an A3 mockup of a potential magazine cover Sidney comes back for the fishbowl and heads off It is Chihuahua as Sophie stares back at him from the page A blonde stripper reveals a penis as Mrs Harding and her two young daughters look on Sidney scurries off excitedly and back at his apartment he types on a laptop at his coffee table Alison stares down sadly at an untouched glass of White Russian Meanwhile Clayton presides over a staff meeting and Sidney's irked Sidney scowls as Lawrence basks in the adulation of his colleagues and Sidney catches up with him outside the meeting He grins broadly then heads off before turning back heavybrowed Sidney screws up his face as Lawrence gives him a jaunty nod and saunters off Lawrence takes a seat behind his desk to address his underlings A blonde stripper reveals a penis as Mrs Harding and her two young daughters look on Sidney quickly cups Bobbie's dangling penis A stonefaced receptionist stares at Sidney who sits outside Clayton's office obsessively scrubbing his hand with a tissue Sidney dressed in long shorts and a Hawaiian shirt spots Sophie approaching Lawrence Sidney joins Lawrence and Sophie and gawks then lopes off Lawrence takes a seat behind his desk to address his underlings The receptionist frowns as Sidney looks in at Eleanor and Clayton who stand at a desk discussing an A3 mockup of a potential magazine cover Eleanor exits and walks uneasily past Sidney while Clayton looms large in the doorway Sidney skulks into the office with his head hung low sits as Clayton paces and then Clayton is behind Sidney Clayton walks round to face him and Sidney looks him in the eye but Clayton stares coldly Clayton turns away in his highbacked swivel chair as Sidney lopes out with his tail between his legs Seated party guests eat under white marquees on the lawn outside Clayton's sprawling mansion Alison's puzzled as Sidney rises from the table and let us his hand linger on Alison's shoulder before sauntering away Alison looks behind her then she too rises from the table He takes some of Sophie's promotional literature from the pile and regards it with a grimace He dials a number on his cell phone Sidney skulks into the office with his head hung low sits as Clayton paces and then Clayton is behind Sidney Sidney dressed in long shorts and a Hawaiian shirt spots Sophie approaching Lawrence Sidney joins Lawrence and Sophie and gawks then lopes off Alison looks behind her then she too rises from the table A tall slender woman emerges from a lift to find him struggling with the cushion his shirt and tank top having ridden up unflatteringly Sidney spies on them from behind a bush as Lawrence stands with Alison playfully tossing nuts into his mouth"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Sidney scurries off excitedly and back at his apartment he types on a laptop at his coffee table. Grinning proudly he scratches his chin and looks down at a pile of magazines on the table. He takes some of Sophie's promotional literature from the pile and regards it with a grimace. It is Chihuahua as Sophie stares back at him from the page. He dials a number on his cell phone. A van sweeps past the Soho Grand Hotel as Sidney fidgets while trying to get comfortable on a sofa in the spacious white lobby. The cushion he is sitting on slips forward causing him to sink awkwardly into the crack. A tall slender woman emerges from a lift to find him struggling with the cushion his shirt and tank top having ridden up unflatteringly. The woman towers over him and Sidney's eyes widen as she shrugs. Sidney plonks the fishbowl down on the bar and she stifles a selfconscious smile. On a TV Alison's eyes are downcast. Sidney comes back for the fishbowl and heads off. Alison stares down sadly at an untouched glass of White Russian. Meanwhile Clayton presides over a staff meeting and Sidney's irked. Sidney scowls as Lawrence basks in the adulation of his colleagues and Sidney catches up with him outside the meeting. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. He grins broadly then heads off before turning back. heavybrowed Sidney screws up his face as Lawrence gives him a jaunty nod and saunters off. Lawrence takes a seat behind his desk to address his underlings. A blonde stripper reveals a penis as Mrs Harding and her two young daughters look on. Sidney quickly cups Bobbie's dangling penis. A stonefaced receptionist stares at Sidney who sits outside Clayton's office obsessively scrubbing his hand with a tissue. The receptionist frowns as Sidney looks in at Eleanor and Clayton who stand at a desk discussing an A3 mockup of a potential magazine cover. Eleanor exits and walks uneasily past Sidney while Clayton looms large in the doorway. Sidney skulks into the office with his head hung low sits as Clayton paces and then Clayton is behind Sidney. Clayton walks round to face him and Sidney looks him in the eye but Clayton stares coldly. Clayton turns away in his highbacked swivel chair as Sidney lopes out with his tail between his legs. Seated party guests eat under white marquees on the lawn outside Clayton's sprawling mansion. Alison's puzzled as Sidney rises from the table and let us his hand linger on Alison's shoulder before sauntering away. Alison looks behind her then she too rises from the table. Sidney dressed in long shorts and a Hawaiian shirt spots Sophie approaching Lawrence Sidney joins Lawrence and Sophie and gawks then lopes off. Sidney spies on them from behind a bush as Lawrence stands with Alison playfully tossing nuts into his mouth."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Sidney scurries off excitedly and back at his apartment he types on a laptop at his coffee table. Grinning proudly he scratches his chin and looks down at a pile of magazines on the table. He takes some of Sophie's promotional literature from the pile and regards it with a grimace. It is Chihuahua as Sophie stares back at him from the page. He dials a number on his cell phone. A van sweeps past the Soho Grand Hotel as Sidney fidgets while trying to get comfortable on a sofa in the spacious white lobby. The cushion he is sitting on slips forward causing him to sink awkwardly into the crack. A tall slender woman emerges from a lift to find him struggling with the cushion his shirt and tank top having ridden up unflatteringly. The woman towers over him and Sidney's eyes widen as she shrugs. Sidney plonks the fishbowl down on the bar and she stifles a selfconscious smile. On a TV Alison's eyes are downcast. Sidney comes back for the fishbowl and heads off. Alison stares down sadly at an untouched glass of White Russian. Meanwhile Clayton presides over a staff meeting and Sidney's irked. Sidney scowls as Lawrence basks in the adulation of his colleagues and Sidney catches up with him outside the meeting. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. He grins broadly then heads off before turning back. heavybrowed Sidney screws up his face as Lawrence gives him a jaunty nod and saunters off. Lawrence takes a seat behind his desk to address his underlings. A blonde stripper reveals a penis as Mrs Harding and her two young daughters look on. Sidney quickly cups Bobbie's dangling penis. A stonefaced receptionist stares at Sidney who sits outside Clayton's office obsessively scrubbing his hand with a tissue. The receptionist frowns as Sidney looks in at Eleanor and Clayton who stand at a desk discussing an A3 mockup of a potential magazine cover. Eleanor exits and walks uneasily past Sidney while Clayton looms large in the doorway. Sidney skulks into the office with his head hung low sits as Clayton paces and then Clayton is behind Sidney. Clayton walks round to face him and Sidney looks him in the eye but Clayton stares coldly. Clayton turns away in his highbacked swivel chair as Sidney lopes out with his tail between his legs. Seated party guests eat under white marquees on the lawn outside Clayton's sprawling mansion. Alison's puzzled as Sidney rises from the table and let us his hand linger on Alison's shoulder before sauntering away. Alison looks behind her then she too rises from the table. Sidney dressed in long shorts and a Hawaiian shirt spots Sophie approaching Lawrence Sidney joins Lawrence and Sophie and gawks then lopes off. Sidney spies on them from behind a bush as Lawrence stands with Alison playfully tossing nuts into his mouth."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Sidney scurries off excitedly and back at his apartment he types on a laptop at his coffee table. Grinning proudly he scratches his chin and looks down at a pile of magazines on the table. He takes some of Sophie's promotional literature from the pile and regards it with a grimace. It is Chihuahua as Sophie stares back at him from the page. He dials a number on his cell phone. A van sweeps past the Soho Grand Hotel as Sidney fidgets while trying to get comfortable on a sofa in the spacious white lobby. The cushion he is sitting on slips forward causing him to sink awkwardly into the crack. A tall slender woman emerges from a lift to find him struggling with the cushion his shirt and tank top having ridden up unflatteringly. Sidney skulks into the office with his head hung low sits as Clayton paces and then Clayton is behind Sidney. Clayton walks round to face him and Sidney looks him in the eye but Clayton stares coldly. Clayton turns away in his highbacked swivel chair as Sidney lopes out with his tail between his legs. Seated party guests eat under white marquees on the lawn outside Clayton's sprawling mansion. Alison's puzzled as Sidney rises from the table and let us his hand linger on Alison's shoulder before sauntering away. Alison looks behind her then she too rises from the table. Sidney dressed in long shorts and a Hawaiian shirt spots Sophie approaching Lawrence Sidney joins Lawrence and Sophie and gawks then lopes off. Sidney spies on them from behind a bush as Lawrence stands with Alison playfully tossing nuts into his mouth."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Sidney scurries off excitedly and back at his apartment he types on a laptop at his coffee table. Grinning proudly he scratches his chin and looks down at a pile of magazines on the table. He takes some of Sophie's promotional literature from the pile and regards it with a grimace. Alison's puzzled as Sidney rises from the table and let us his hand linger on Alison's shoulder before sauntering away. Alison looks behind her then she too rises from the table. Sidney dressed in long shorts and a Hawaiian shirt spots Sophie approaching Lawrence Sidney joins Lawrence and Sophie and gawks then lopes off. Sidney spies on them from behind a bush as Lawrence stands with Alison playfully tossing nuts into his mouth."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Chester scurries off excitedly, and back at her apartment, she types on a laptop at her coffee table. Grinning proudly, she scratches her chin and looks down at a pile of magazines on the table. She takes some of Oliver's promotional literature from the pile and regards it with a grimace. It's Chihuahua, as Oliver stares back at her from the page. She dials a number on her cell phone. A raccoon sweeps past the Soho Grand Hotel as Chester fidgets while trying to get comfortable on a sofa in the spacious white lobby. The cushion she's sitting on slips forward, causing her to sink awkwardly into the crack. A tall, slender dog emerges from a lift to find her struggling with the cushion, her shirt and tank top having ridden up unflatteringly. The dog towers over her, and Chester's eyes widen as it shrugs. Chester plonks the fishbowl down on the bar, and it stifles a self-conscious smile. On a TV, Thomas's eyes are downcast. Chester comes back for the fishbowl and heads off. Thomas stares down sadly at an untouched glass of White Russian. Meanwhile, Jessica presides over a staff meeting, and Chester's irked. Chester scowls as Roger basks in the adulation of his colleagues, and Chester catches up with him outside the meeting. She grins broadly, then heads off before turning back heavy-browed. Chester screws up her face as Roger gives her a jaunty nod and saunters off. Roger takes a seat behind his desk to address his underlings. A blonde carpenter reveals a hammer as Mrs. Jenkins and her two young sons look on. Chester quickly cups Kelly's dangling hammer. A stone-faced security guard stares at Chester, who sits outside Jessica's office, obsessively scrubbing her hand with a tissue. The security guard frowns as Chester looks in at Fiona and Jessica, who stand at a desk discussing an A3 mock-up of a potential magazine cover. Fiona exits and walks uneasily past Chester, while Jessica looms large in the doorway. Chester skulks into the office with her head hung low, sits as Jessica paces, and then Jessica is behind Chester. Jessica walks round to face her, and Chester looks her in the eye, but Jessica stares coldly. Jessica turns away in her high-backed swivel chair as Chester lopes out with her tail between her legs. Seated visitors eat under white marquees on the lawn outside Jessica's sprawling mansion. Thomas's puzzled as Chester rises from the table and lets her hand linger on Thomas's shoulder before sauntering away. Thomas looks behind him, then he too rises from the table. Chester, dressed in long shorts and a Hawaiian shirt, spots Oliver approaching Roger. Chester joins Roger and Oliver and gawks, then lopes off. Chester spies on them from behind a bush as Roger stands with Thomas, playfully tossing nuts into his mouth."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Sidney scurries off excitedly, and back at his cabin, he types on a typewriter at his dining table. Grinning proudly, he scratches his chin and looks down at a stack of newspapers on the table. He takes some of Sophie's promotional brochures from the stack and regards it with a grimace. It's a Tabby cat, as Sophie stares back at him from the page. He dials a number on his landline phone. A bicycle sweeps past the Ritz Carlton as Sidney fidgets while trying to get comfortable on a loveseat in the spacious red lobby. The cushion he's sitting on slips forward, causing him to sink awkwardly into the gap. A tall, slender woman emerges from an escalator to find him struggling with the cushion, his shirt and tank top having ridden up unflatteringly. The woman towers over him, and Sidney's eyes widen as she shrugs. Sidney plonks the punchbowl down on the counter, and she stifles a self-conscious smile. On a projector screen, Alison's eyes are downcast. Sidney comes back for the punchbowl and heads off. Alison stares down sadly at an untouched glass of root beer float. Meanwhile, Clayton presides over a board meeting, and Sidney's irked. Sidney scowls as Lawrence basks in the adulation of his colleagues, and Sidney catches up with him outside the meeting. He grins broadly, then heads off before turning back heavy-browed. Sidney screws up his face as Lawrence gives him a jaunty nod and saunters off. Lawrence takes a seat behind his table to address his underlings. A blonde clown reveals a propeller beanie as Mrs. Harding and her two young daughters look on. Sidney quickly cups Bobbie's dangling propeller beanie. A stone-faced administrator stares at Sidney, who sits outside Clayton's cabin, obsessively scrubbing his hand with a napkin. The administrator frowns as Sidney looks in at Eleanor and Clayton, who stand at a table discussing an A3 mock-up of a potential book cover. Eleanor exits and walks uneasily past Sidney, while Clayton looms large in the doorway. Sidney skulks into the room with his head hung low, sits as Clayton paces, and then Clayton is behind Sidney. Clayton walks round to face him, and Sidney looks him in the eye, but Clayton stares coldly. Clayton turns away in his high-backed rocking chair as Sidney lopes out with his tail between his legs. Seated party guests eat under white gazebos on the lawn outside Clayton's sprawling cottage. Alison's puzzled as Sidney rises from the table and lets his hand linger on Alison's shoulder before sauntering away. Alison looks behind her, then she too rises from the table. Sidney, dressed in long trousers and a kimono, spots Sophie approaching Lawrence. Sidney joins Lawrence and Sophie and gawks, then lopes off. Sidney spies on them from behind a tree as Lawrence stands with Alison, playfully tossing berries into his mouth."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Sidney dashes off eagerly, and back at his apartment, he scribbles on a notepad at his coffee table. Grinning proudly, he brushes his chin and glances down at a stack of newspapers on the table. He grabs some of Sophie's promotional literature from the stack and studies it with a frown. It's Chihuahua, as Sophie peeks back at him from the page. He punches a number into his cell phone. A van cruises past the Soho Grand Hotel as Sidney squirms while attempting to settle on a sofa in the airy white lobby. The cushion he's perched on shifts forward, causing him to slide clumsily into the gap. A tall, slender woman steps out of a lift to find him wrestling with the cushion, his shirt and tank top having slipped up unflatteringly. The woman looms over him, and Sidney's eyes widen as she gestures indifferently. Sidney drops the fishbowl onto the bar, and she hides a self-conscious chuckle. On a TV, Alison's eyes are lowered. Sidney retrieves the fishbowl and wanders off. Alison gazes down somberly at an untouched glass of White Russian. Meanwhile, Clayton directs a staff meeting, and Sidney's irritated. Sidney frowns as Lawrence revels in the admiration of his colleagues, and Sidney catches up with him outside the meeting. He beams happily, then strides off before turning back with knitted brows. Sidney wrinkles his nose as Lawrence gives him a lively wave and strolls off. Lawrence reclines behind his desk to address his staff. A blonde stripper unveils a surprise as Mrs. Harding and her two young daughters look on. Sidney hurriedly conceals Bobbie's dangling surprise. A stone-faced receptionist glares at Sidney, who sits outside Clayton's office, obsessively wiping his hand with a tissue. The receptionist scowls as Sidney peers in at Eleanor and Clayton, who stand at a desk examining an A3 mock-up of a potential magazine cover. Eleanor exits and walks hesitantly past Sidney, while Clayton looms large in the doorway. Sidney sneaks into the office with his head hung low, sits as Clayton strides, and then Clayton is behind Sidney. Clayton circles round to confront him, and Sidney holds his gaze, but Clayton glares icily. Clayton spins away in his high-backed swivel chair as Sidney ambles out with his tail between his legs. Seated party guests chat under white marquees on the lawn outside Clayton's expansive mansion. Alison's bewildered as Sidney rises from the table and lets his hand linger on Alison's shoulder before strolling away. Alison glances behind her, then she too stands up from the table. Sidney, dressed in long shorts and a Hawaiian shirt, notices Sophie nearing Lawrence. Sidney joins Lawrence and Sophie and ogles, then struts off. Sidney watches them from behind a bush as Lawrence stands with Alison, playfully juggling nuts into his mouth."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Caroline flutters off eagerly, and back at her igloo, she writes on a notepad at her dining chair. Beaming proudly, she taps her nose and looks down at a stack of newspapers on the chair. She takes some of Robert's party invitations from the stack and regards it with a frown. It's Poodle, as Robert stares back at her from the leaflet. She dials a number on her landline. A bicycle zips past the Louvre as Caroline fidgets while trying to get comfortable on a hammock in the cavernous blue atrium. The blanket she's sitting on slips backward, causing her to slide awkwardly into the gap. A short, stout man emerges from a tunnel to find her struggling with the blanket, her jacket and vest having ridden up unflatteringly. The man towers over her, and Caroline's eyes widen as he gestures. Caroline plonks the toaster down on the counter, and he stifles a bashful grin. On a projector screen, George's eyes are uplifted. Caroline comes back for the toaster and heads off. George gazes down sadly at an untouched mug of Black Russian. Meanwhile, Stephanie presides over a board meeting, and Caroline's annoyed. Caroline frowns as Timothy revels in the admiration of his associates, and Caroline catches up with him outside the boardroom. She grins broadly, then heads off before turning back stern-browed. Caroline crumples her face as Timothy gives her a merry salute and strolls off. Timothy takes a seat behind his table to address his juniors. A brunette magician reveals a saxophone as Mr. Thompson and his three older sons look on. Caroline quickly cups Charlie's swinging saxophone. A beaming concierge stares at Caroline, who sits outside Stephanie's office, obsessively tapping her foot with a pen. The concierge smirks as Caroline looks in at Beatrice and Stephanie, who stand at a chair discussing an A5 mock-up of a potential billboard design. Beatrice departs and walks awkwardly past Caroline, while Stephanie looms large in the corridor. Caroline slinks into the office with her eyes cast down, sits as Stephanie wanders, and then Stephanie is in front of Caroline. Stephanie steps round to face her, and Caroline looks her in the eye, but Stephanie stares warmly. Stephanie turns away in her low-backed rocking chair as Caroline strides out with her head in her hands. Seated carnival revelers dine under red gazebos on the meadow outside Stephanie's towering skyscraper. George's bewildered as Caroline rises from the stool and lets her hand linger on George's knee before skipping away. George looks beside him, then he too rises from the stool. Caroline, dressed in short trousers and a Victorian blouse, spots Robert approaching Timothy. Caroline joins Timothy and Robert and gawks, then skips off. Caroline spies on them from behind a tree as Timothy stands with George, playfully tossing grapes into his mouth."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Gerald flutters off excitedly, and back at his apartment, he scribbles on a notepad at his coffee table. Grinning sheepishly, he pats his forehead and peers down at a stack of newspapers on the table. He grabs some of Emma's marketing brochures from the stack and considers it with a chuckle. It's Bulldog, as Emma glares back at him from the page. He taps a button on his landline. A scooter zooms past the Soho Grand Hotel as Gerald wiggles while attempting to relax on a recliner in the vast white lobby. The cushion he's reclining on slides forward, causing him to sag uncomfortably into the gap. A short, stocky man steps out from a lift to find him wrestling with the cushion, his jacket and necktie having bunched up awkwardly. The man towers over him, and Gerald's eyes widen as he waves. Gerald sets the vase down on the counter, and he hides a bashful grin. On a TV, Robert's eyes are focused. Gerald returns for the vase and wanders off. Robert looks down wistfully at an untouched cup of espresso. Meanwhile, Fiona manages a board meeting, and Gerald's perplexed. Gerald frowns as Michael luxuriates in the applause of his peers, and Gerald catches up with him outside the meeting. He laughs heartily, then walks off before turning back crestfallen. Gerald contorts his face as Michael gives him a cheerful salute and meanders off. Michael perches behind his desk to address his juniors. A brunette entertainer unveils a bouquet as Mr. Harding and his two young sons observe. Gerald hurriedly clutches Alice's falling bouquet. A cheerful usher glances at Gerald, who waits outside Fiona's office, meticulously dabbing his face with a napkin. The usher sighs as Gerald peeks in at Louise and Fiona, who stand at a desk evaluating an A3 draft of a possible magazine cover. Louise exits and strolls awkwardly past Gerald, while Fiona looms large in the doorway. Gerald sneaks into the office with his head held low, perches as Fiona circles, and then Fiona is behind Gerald. Fiona walks round to face him, and Gerald meets his gaze, but Fiona glares sternly. Fiona spins away in his high-backed wooden chair as Gerald shuffles out with his spirits low. Seated garden party guests lounge under red gazebos on the patio outside Fiona's expansive villa. Robert's baffled as Gerald stands from the bench and lets his hand hover on Robert's arm before strolling away. Robert glances after him, then he too stands from the bench. Gerald, dressed in a jumper and Bermuda shorts, spots Emma approaching Michael. Gerald joins Michael and Emma and gapes, then shuffles off. Gerald observes them from behind a hedge as Michael stands with Robert, playfully juggling grapes into his mouth."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Sidney dashes off eagerly, and back at his loft, he sketches on a notepad at his dining table. Smirking triumphantly, he pats his shoulder and glances down at a stack of newspapers on the table. He grabs some of Sophie's advertising flyers from the stack and inspects it with a wince. It's a Pomeranian, as Sophie gazes back at him from the leaflet. He presses a button on his remote control. A motorcycle zooms past the Soho Grand Hotel as Sidney squirms while attempting to feel at ease on a beanbag in the expansive green atrium. The pillow he's reclining on shifts backward, causing him to tumble clumsily into the gap. A tall, slender man steps out of an elevator to discover him wrestling with the pillow, his jacket and t-shirt having bunched up awkwardly. The man looms over him, and Sidney's eyes widen as he shrugs. Sidney slams the hamster cage down on the side table, and he suppresses a self-conscious chuckle. On a tablet, Alison's eyes are cast upward. Sidney returns for the hamster cage and ambles away. Alison gazes at a half-empty cup of Espresso. Meanwhile, Clayton orchestrates a board meeting, and Sidney's irked. Sidney frowns as Lawrence revels in the admiration of his peers, and Sidney catches up with him in the corridor. He beams widely, then strolls off before spinning around with a furrowed brow. Sidney crinkles his nose as Lawrence gives him a brisk salute and ambles away. Lawrence takes a position behind his podium to address his aides. A red-headed dancer reveals a wig as Mrs. Harding and her two young sons observe. Sidney swiftly plucks Bobbie's swinging wig. A stone-faced librarian stares at Sidney, who sits outside Clayton's quarters, obsessively polishing his spectacles with a napkin. The librarian scowls as Sidney peers in at Eleanor and Clayton, who stand at a counter discussing a miniature model of an envisioned book cover. Eleanor departs and walks cautiously past Sidney, while Clayton towers in the doorway. Sidney slinks into the study with his head bowed low, sits as Clayton strides, and then Clayton stands behind Sidney. Clayton strides around to confront him, and Sidney meets his gaze, but Clayton gazes impassively. Clayton pivots away in his high-backed rocking chair as Sidney sidles out with his spirits deflated. Seated festival attendees snack under blue tents on the lawn outside Clayton's vast estate. Alison's baffled as Sidney stands from the bench and lets his hand hover above Alison's arm before striding away. Alison glances behind her, then she also stands from the bench. Sidney, dressed in jeans and a plaid shirt, notices Sophie nearing Lawrence. Sidney approaches Lawrence and Sophie and ogles, then ambles away. Sidney spies on them from behind a hedge as Lawrence stands with Alison, playfully juggling grapes."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Lenny flutters away curiously, and back at his treehouse, he scribbles on a notepad at his picnic bench. Smirking shyly, he pats his cheek and glances at a heap of pamphlets on the bench. He grabs some of Jerry's travel brochures from the pile and eyes them with a smirk. It's Goldfish, as Jerry peers back at him from the poster. He taps a code on his remote control. A bicycle zooms past the Central Park Zoo as Lenny wiggles while attempting to settle on a hammock in the crowded green park. The blanket he's perched on slides sideways, making him tumble clumsily into the gap. A short, stocky man steps out of an elevator to find him wrestling with the blanket, his blazer and scarf having bunched up untidily. The man squats beside him, and Lenny's pupils dilate as he waves. Lenny drops the pumpkin onto the counter, and he muffles a goofy chortle. On a billboard, Rachel's face is uplifted. Lenny skips back for the pumpkin and strolls away. Rachel gapes miserably at a full jug of Lemonade. Meanwhile, Curtis supervises a briefing session, and Lenny's ruffled. Lenny sneers as Patrick revels in the praise of his peers, and Lenny tags along with him outside the session. He beams brightly, then strolls away before glancing back bewildered. Lenny scrunches his eyebrows as Patrick gives him a snappy salute and struts away. Patrick perches on a stool beside his workstation to address his minions. A bearded mechanic reveals a sandwich as Mrs. Harper and her trio of sons gaze on. Lenny swiftly hides Carla's swinging sandwich. A stern-faced waiter watches Lenny, who waits outside Curtis's study, compulsively polishing his spoon with a serviette. The waiter scowls as Lenny peeks in at Miranda and Curtis, who stand by a sofa examining an A2 sketch of a possible book cover. Miranda exits and sidles uneasily past Lenny, while Curtis towers menacingly in the archway. Lenny skulks into the room with his ears drooping, settles as Curtis strides, and then Curtis stands before Lenny. Curtis turns to confront him, and Lenny meets his gaze, but Curtis glowers icily. Curtis swivels away in his enormous rocking chair as Lenny ambles out with his hat in his hands. Seated revelers nibble under blue umbrellas on the patio outside Curtis's vast chateau. Rachel's bemused as Lenny leaps from the spot and rests his finger on Rachel's elbow before gliding away. Rachel glances behind her, then she too leaps from the spot. Lenny, clad in a tuxedo and silk tie, spots Jerry nearing Patrick. Lenny joins Patrick and Jerry and gawks, then ambles off. Lenny observes them from behind a tree as Patrick stands with Rachel, casually flicking grapes into his mouth."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Sidney excitedly types on his laptop, glancing at promotional material featuring Sophie. He becomes uncomfortable in a hotel lobby until a tall woman finds him struggling with a cushion. Sidney places a fishbowl on a bar, takes it back, and heads off. Later, Sidney's irritation grows during a staff meeting led by Clayton. He scowls at Lawrence's success and confronts him outside, but Lawrence dismisses him with a nod. Sidney is unsettled by a stripper's reveal and awkwardly handles the situation. A receptionist watches Sidney obsessively clean his hand while waiting outside Clayton's office. Inside, Clayton coldly dismisses Sidney after a tense encounter. At a party at Clayton's mansion, Sidney leaves the table, touching Alison's shoulder. She follows him as Sidney watches Sophie and Lawrence interact, then spies on them from behind a bush."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Sidney spies on them from behind a bush as Lawrence stands with Alison playfully tossing nuts into his mouth Sidney dressed in long shorts and a Hawaiian shirt spots Sophie approaching Lawrence Sidney joins Lawrence and Sophie and gawks then lopes off Alison looks behind her then she too rises from the table Alison's puzzled as Sidney rises from the table and let us his hand linger on Alison's shoulder before sauntering away Seated party guests eat under white marquees on the lawn outside Clayton's sprawling mansion Clayton turns away in his highbacked swivel chair as Sidney lopes out with his tail between his legs Clayton walks round to face him and Sidney looks him in the eye but Clayton stares coldly Sidney skulks into the office with his head hung low sits as Clayton paces and then Clayton is behind Sidney Eleanor exits and walks uneasily past Sidney while Clayton looms large in the doorway The receptionist frowns as Sidney looks in at Eleanor and Clayton who stand at a desk discussing an A3 mockup of a potential magazine cover A stonefaced receptionist stares at Sidney who sits outside Clayton's office obsessively scrubbing his hand with a tissue Sidney quickly cups Bobbie's dangling penis A blonde stripper reveals a penis as Mrs Harding and her two young daughters look on Lawrence takes a seat behind his desk to address his underlings heavybrowed Sidney screws up his face as Lawrence gives him a jaunty nod and saunters off He grins broadly then heads off before turning back Sidney scowls as Lawrence basks in the adulation of his colleagues and Sidney catches up with him outside the meeting Meanwhile Clayton presides over a staff meeting and Sidney's irked Alison stares down sadly at an untouched glass of White Russian Sidney comes back for the fishbowl and heads off On a TV Alison's eyes are downcast Sidney plonks the fishbowl down on the bar and she stifles a selfconscious smile The woman towers over him and Sidney's eyes widen as she shrugs A tall slender woman emerges from a lift to find him struggling with the cushion his shirt and tank top having ridden up unflatteringly The cushion he is sitting on slips forward causing him to sink awkwardly into the crack A van sweeps past the Soho Grand Hotel as Sidney fidgets while trying to get comfortable on a sofa in the spacious white lobby He dials a number on his cell phone It is Chihuahua as Sophie stares back at him from the page He takes some of Sophie's promotional literature from the pile and regards it with a grimace Grinning proudly he scratches his chin and looks down at a pile of magazines on the table Sidney scurries off excitedly and back at his apartment he types on a laptop at his coffee table"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Sidney quickly cups Bobbie's dangling penis Sidney scowls as Lawrence basks in the adulation of his colleagues and Sidney catches up with him outside the meeting On a TV Alison's eyes are downcast Clayton walks round to face him and Sidney looks him in the eye but Clayton stares coldly Alison's puzzled as Sidney rises from the table and let us his hand linger on Alison's shoulder before sauntering away The cushion he is sitting on slips forward causing him to sink awkwardly into the crack A van sweeps past the Soho Grand Hotel as Sidney fidgets while trying to get comfortable on a sofa in the spacious white lobby Alison stares down sadly at an untouched glass of White Russian Sidney comes back for the fishbowl and heads off He grins broadly then heads off before turning back Sidney plonks the fishbowl down on the bar and she stifles a selfconscious smile Seated party guests eat under white marquees on the lawn outside Clayton's sprawling mansion Sidney spies on them from behind a bush as Lawrence stands with Alison playfully tossing nuts into his mouth Eleanor exits and walks uneasily past Sidney while Clayton looms large in the doorway heavybrowed Sidney screws up his face as Lawrence gives him a jaunty nod and saunters off Alison looks behind her then she too rises from the table Grinning proudly he scratches his chin and looks down at a pile of magazines on the table Meanwhile Clayton presides over a staff meeting and Sidney's irked A blonde stripper reveals a penis as Mrs Harding and her two young daughters look on He takes some of Sophie's promotional literature from the pile and regards it with a grimace Lawrence takes a seat behind his desk to address his underlings The receptionist frowns as Sidney looks in at Eleanor and Clayton who stand at a desk discussing an A3 mockup of a potential magazine cover Sidney dressed in long shorts and a Hawaiian shirt spots Sophie approaching Lawrence Sidney joins Lawrence and Sophie and gawks then lopes off He dials a number on his cell phone Clayton turns away in his highbacked swivel chair as Sidney lopes out with his tail between his legs A tall slender woman emerges from a lift to find him struggling with the cushion his shirt and tank top having ridden up unflatteringly The woman towers over him and Sidney's eyes widen as she shrugs Sidney skulks into the office with his head hung low sits as Clayton paces and then Clayton is behind Sidney Sidney scurries off excitedly and back at his apartment he types on a laptop at his coffee table It is Chihuahua as Sophie stares back at him from the page A stonefaced receptionist stares at Sidney who sits outside Clayton's office obsessively scrubbing his hand with a tissue"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "heavybrowed Sidney screws up his face as Lawrence gives him a jaunty nod and saunters off Lawrence takes a seat behind his desk to address his underlings A blonde stripper reveals a penis as Mrs Harding and her two young daughters look on Sidney quickly cups Bobbie's dangling penis A stonefaced receptionist stares at Sidney who sits outside Clayton's office obsessively scrubbing his hand with a tissue The receptionist frowns as Sidney looks in at Eleanor and Clayton who stand at a desk discussing an A3 mockup of a potential magazine cover Eleanor exits and walks uneasily past Sidney while Clayton looms large in the doorway Sidney skulks into the office with his head hung low sits as Clayton paces and then Clayton is behind Sidney Clayton walks round to face him and Sidney looks him in the eye but Clayton stares coldly Clayton turns away in his highbacked swivel chair as Sidney lopes out with his tail between his legs Seated party guests eat under white marquees on the lawn outside Clayton's sprawling mansion Alison's puzzled as Sidney rises from the table and let us his hand linger on Alison's shoulder before sauntering away Alison looks behind her then she too rises from the table Sidney dressed in long shorts and a Hawaiian shirt spots Sophie approaching Lawrence Sidney joins Lawrence and Sophie and gawks then lopes off Sidney spies on them from behind a bush as Lawrence stands with Alison playfully tossing nuts into his mouth Sidney scurries off excitedly and back at his apartment he types on a laptop at his coffee table Grinning proudly he scratches his chin and looks down at a pile of magazines on the table He takes some of Sophie's promotional literature from the pile and regards it with a grimace It is Chihuahua as Sophie stares back at him from the page He dials a number on his cell phone A van sweeps past the Soho Grand Hotel as Sidney fidgets while trying to get comfortable on a sofa in the spacious white lobby The cushion he is sitting on slips forward causing him to sink awkwardly into the crack A tall slender woman emerges from a lift to find him struggling with the cushion his shirt and tank top having ridden up unflatteringly The woman towers over him and Sidney's eyes widen as she shrugs Sidney plonks the fishbowl down on the bar and she stifles a selfconscious smile On a TV Alison's eyes are downcast Sidney comes back for the fishbowl and heads off Alison stares down sadly at an untouched glass of White Russian Meanwhile Clayton presides over a staff meeting and Sidney's irked Sidney scowls as Lawrence basks in the adulation of his colleagues and Sidney catches up with him outside the meeting He grins broadly then heads off before turning back"
        }
      ]
    }
  ]
}