{
  "ground_truth": "Graham and his family look up and stare at something. Graham walks slowly across the polished wooden floor into the front hallway, reaching the door to the cupboard under the stairs and pulling it open. He looks at the TV set inside, which is displaying a test card. He turns to look back at the others and swallows. Later, Merrill is upstairs, hammering boards onto the door of the children's bedroom. Across the landing in his room, Graham cautiously approaches the window and looks out over the maize field. His eyes widen and become fixed in a fearful stare as he backs towards the bedroom door. Merrill looks over at him. Eyes still on the window, Graham sidles out of the room and closes the door. Graham lifts up a plank and holds it across the door, with Merrill taking the other end. Together, the two men hammer nails through the plank into the door frame, with Bo and Morgan standing at the top of the stairs behind them, watching. Turning to get another mail, Graham stops and stares at Bo before helping Merrill with another plank. Bo remains motionless, clinging to her brother, then walks over, and he crouches down. She shakes her head, Bo grins at him, and he strokes her cheek. Graham pulls her towards him and picks his daughter up. Merrill slaps another plank across the bedroom door. Bo in his arms, Graham and Morgan go downstairs into the front hallway. Graham and Merrill put the children down, and they stop and listen. They all stare in the direction of the barking beyond the wooden mantle piece, which stands at the far end of the room, with two China dogs sitting on it, one on each side, illuminated by the dim glow of two wall lamps above them. Graham's eyes dart nervously around, his fingers tightening on Bo's shoulders in front of him. He and Merrill exchange anxious glances. They look towards a boarded-up window to the right of the mantle piece, their gaze passing across the fireplace as they turn to follow the noises. Shadows flit across the slit of moonlight between two planks across the window on the left of the mantle piece. Slowly, the family turns to watch the figures block out the soft light diffusing through the gaps between the boards on another window at the front of the house. They swing around and stare petrified down the hallway and into the kitchen towards the back door. They turn quickly back around to look at the front door, one plank nailed across the frame halfway up, as the doorknob turns. Morgan starts to back away, and Graham looks around and puts a comforting hand on Morgan's shoulder before kneeling down in front of the frightened boy. Graham smiles lovingly as a tear falls from Morgan's eyes.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Graham and his kin gaze up and stare at something. Graham strolls slowly across the polished wooden floor into the front corridor, reaching the door to the closet under the stairs and pulling it open. He gazes at the TV set inside, which is displaying a test pattern. He turns to look back at the others and swallows. Later, Merrill is upstairs, hammering boards onto the door of the children's chamber. Across the landing in his room, Graham cautiously approaches the window and gazes out over the maize field. His eyes widen and become fixed in a fearful gaze as he backs towards the chamber door. Merrill glances over at him. Eyes still on the window, Graham sidles out of the room and closes the door. Graham lifts up a board and holds it across the door, with Merrill taking the other end. Together, the two men hammer nails through the board into the door frame, with Bo and Morgan standing at the top of the stairs behind them, observing. Turning to get another nail, Graham stops and stares at Bo before helping Merrill with another board. Bo remains still, clinging to her brother, then walks over, and he crouches down. She shakes her head, Bo grins at him, and he strokes her cheek. Graham pulls her towards him and picks his daughter up. Merrill slaps another board across the bedroom door. Bo in his arms, Graham and Morgan descend downstairs into the front corridor. Graham and Merrill set the children down, and they stop and listen. They all gaze in the direction of the barking beyond the wooden mantle piece, which stands at the far end of the room, with two China dogs sitting on it, one on each side, lit by the dim glow of two wall lamps above them. Graham's eyes dart nervously around, his fingers tightening on Bo's shoulders in front of him. He and Merrill exchange anxious glances. They look towards a boarded-up window to the right of the mantle piece, their gaze passing across the hearth as they turn to follow the noises. Shadows flit across the slit of moonlight between two boards across the window on the left of the mantle piece. Slowly, the family turns to watch the figures block out the soft light diffusing through the gaps between the boards on another window at the front of the house. They swing around and stare petrified down the corridor and into the kitchen towards the back door. They turn quickly back around to look at the front door, one board nailed across the frame halfway up, as the doorknob turns. Morgan starts to back away, and Graham looks around and puts a comforting hand on Morgan's shoulder before kneeling down in front of the frightened boy. Graham smiles lovingly as a tear falls from Morgan's eyes."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Graham and his family are looked up to as something is stared at by them. The polished wooden floor is walked slowly across by Graham into the front hallway, with the door to the cupboard under the stairs being reached and opened by him. The TV set inside is looked at by him, displaying a test card. The others are looked back at by him, and he swallows. Later, boards are hammered onto the door of the children's bedroom by Merrill upstairs. Across the landing in his room, the window is approached cautiously by Graham, and he looks out over the maize field. His eyes widen and are fixed in a fearful stare as the bedroom door is backed towards by him. Graham is looked over at by Merrill. The window is still looked at by him as the room is sidled out of and the door is closed by Graham. A plank is lifted up by Graham, and it is held across the door, with Merrill taking the other end. Nails are hammered through the plank into the door frame by the two men together, while Bo and Morgan stand at the top of the stairs behind them, watching. Another nail is turned to get by Graham, who stops and stares at Bo before helping Merrill with another plank. Bo remains motionless, clinging to her brother, then she walks over, and he crouches down. Her head is shaken by her, Bo grins at him, and her cheek is stroked by him. Bo is pulled towards him by Graham, and his daughter is picked up by him. Another plank is slapped across the bedroom door by Merrill. With Bo in his arms, downstairs into the front hallway go Graham and Morgan. The children are put down by Graham and Merrill, and they stop and listen. The direction of the barking beyond the wooden mantle piece, which stands at the far end of the room with two China dogs sitting on it, one on each side, illuminated by the dim glow of two wall lamps above them, is stared at by them all. Graham's eyes dart nervously around, with Bo's shoulders in front of him being tightened by his fingers. Anxious glances are exchanged between him and Merrill. A boarded-up window to the right of the mantle piece is looked towards by them, their gaze passing across the fireplace as the noises are followed by their turn. Shadows flit across the slit of moonlight between two planks across the window on the left of the mantle piece. Slowly, the figures that block out the soft light diffusing through the gaps between the boards on another window at the front of the house are watched by the family. They swing around and stare petrified down the hallway and into the kitchen towards the back door. The front door is looked at quickly back around, with one plank being nailed across the frame halfway up, as the doorknob turns. Morgan starts to back away, and a comforting hand is put by Graham on Morgan's shoulder before he kneels down in front of the frightened boy. A loving smile is given by Graham as a tear falls from Morgan's eyes."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Graham and his family stare intently at something. Graham walks slowly across the polished floor to the hallway and opens the cupboard under the stairs, where a TV displays a test card. He glances back at the others and swallows. Later, Merrill is upstairs, nailing boards onto the children's bedroom door. Graham carefully approaches his room's window, gazing into the maize field with widened eyes. Backing away fearfully, he exits the room, eyes fixed on the window, and closes the door. Graham helps Merrill hammer a plank onto the door, as Bo and Morgan watch from the stairs. Graham pauses to stare at Bo, then crouches to hug her before picking her up. Merrill secures another plank on the bedroom door. With Bo in his arms, Graham and Morgan go downstairs. The family listens intently, staring toward the barking beyond the wooden mantelpiece, with two China dogs lit by dim wall lamps. Graham's fingers tighten on Bo's shoulders as he and Merrill exchange worried glances. Their gaze moves to a boarded window right of the mantelpiece, passing the fireplace to follow noises. Shadows flicker between planks on the left window. The family watches figures blocking light through gaps in another window at the front. They turn to the hallway, then back to the front door, where a single plank is nailed halfway up, as the doorknob turns. Morgan steps back, and Graham reassures him with a comforting hand, kneeling before the frightened boy. Graham smiles lovingly as tears fall from Morgan's eyes."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Graham and his family stare at something. Graham walks across the wooden floor to the cupboard under the stairs, opens it, and sees the TV showing a test card. He turns to the others and swallows. Later, Merrill hammers boards on the children's bedroom door. In his room, Graham cautiously looks out the window at the maize field, backing away fearfully. Merrill notices this, and Graham leaves the room, closing the door. Graham and Merrill hammer nails through a plank on the door, with Bo and Morgan watching. Graham stares at Bo, strokes her cheek, and picks her up. Merrill adds another plank. Holding Bo, Graham and Morgan go downstairs. They stop to listen, staring at the mantle piece with China dogs lit by wall lamps. Graham tightens his grip on Bo, shares anxious glances with Merrill, and they listen to noises near the boarded-up window. Shadows cross the moonlit gaps between boards. They turn to watch figures blocking light from another window. Frightened, they look towards the back door, then the front door, where the doorknob turns. Morgan backs away, and Graham comforts him, kneeling down and smiling as tears fall from Morgan's eyes."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Graham, along with his entire family, collectively directs their gaze upward, fixating intently on an unspecified point of interest. With deliberate slowness, Graham moves across the polished, glistening wooden floor towards the front hallway. He reaches the door leading to the cupboard situated under the stairs and carefully opens it. Inside, he sees a television set that is currently displaying a test card. Pausing for a brief moment, he turns to glance back at the others before swallowing nervously. Later on, Merrill is positioned upstairs, diligently hammering boards onto the door of the children's bedroom. Meanwhile, across the landing and in his own room, Graham approaches the window with caution, casting his eyes over the expansive maize field beyond. As he observes the scene, his eyes widen dramatically, becoming locked in a fearful stare. Retreating backwards towards the bedroom door, he manifests visible apprehension. Merrill, noticing this, looks over at Graham. Still keeping his gaze fixed on the window, Graham cautiously sidles out of the room, closing the door behind him. Lifting a sturdy plank, Graham holds it across the door while Merrill takes hold of the opposite end. In unison, the two men hammer nails efficiently through the plank, securing it into the door frame, all the while with Bo and Morgan standing quietly at the top of the stairs behind them, intently observing. Turning to retrieve another nail, Graham pauses to look at Bo, his attention momentarily halted before he resumes assisting Merrill with the next plank. Bo remains still, clinging tightly to her brother. She then walks over to Graham, who crouches down to her level. She shakes her head slightly, prompting Bo to grin endearingly at him, and in response, he tenderly strokes her cheek. Drawing her closer, Graham picks his daughter up, holding her securely. Meanwhile, Merrill resolutely slaps another plank across the bedroom door. With Bo in his arms, Graham and Morgan descend the stairs into the front hallway. Graham and Merrill gently set the children down, prompting the family to pause and listen closely. All of them fixate their attention in the direction of the persistent barking that emanates from beyond the wooden mantlepiece, situated at the far end of the room. The mantlepiece is adorned with two china dogs, each placed on one side, illuminated faintly by the soft glow of two wall lamps positioned above them. Nervously, Graham's eyes dart around, his fingers clutching Bo's shoulders with increased tightness. He exchanges an anxious, meaningful glance with Merrill. Their focus shifts towards a boarded-up window located to the right of the mantlepiece, their gaze brushing past the fireplace as they follow the unsettling noises. Shadows fleetingly cross the narrow slit of moonlight visible between two planks of the boarded-up window to the left of the mantlepiece. Gradually, the family shifts their attention to the figures outside, which obscure the gentle light filtering through the gaps between the boards of another window at the front of the house. They pivot abruptly, looking down the hallway into the kitchen towards the back door, clearly petrified. Swiftly, they turn back to face the front door, where a single plank is nailed across the frame halfway up, as the doorknob ominously begins to turn. Morgan, feeling the rising tension, instinctively starts to back away. Sensing his fear, Graham looks around, placing a reassuring hand on Morgan's shoulder before kneeling down in front of the frightened boy. Gazing lovingly into Morgan's eyes, Graham smiles warmly even as a solitary tear escapes from Morgan's eye."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Graham, accompanied by his entire family, directs their collective gaze skyward, fixating with intense curiosity on an unspecified point of interest high above them. With deliberate slowness and measured steps, Graham makes his way across the polished, glistening wooden floor, which reflects the light subtly, towards the front hallway. He reaches the door that leads to the quaint cupboard nestled carefully under the stairs and carefully opens it with a deliberate motion. Inside, he observes a television set that steadfastly displays a test card. Pausing for a brief moment, he turns his head to glance back at the others, taking in their presence before swallowing nervously, indicating his apprehension.\n\nLater on, Merrill situates himself upstairs, diligently working as he hammers boards onto the door of the children's bedroom with a rhythmic, determined motion. Meanwhile, across the landing and within the confines of his own room, Graham approaches the window cautiously, casting a wary gaze over the expansive, seemingly endless maize field that stretches beyond. As he takes in the scene before him, his eyes widen dramatically, locking into a fearful stare that conveys deep concern. Slowly retreating backwards towards the bedroom door, he exhibits apprehension and unease. Noticing this, Merrill shifts his focus, looking over at Graham with questioning concern. Still keeping his gaze fixed on the outside view, Graham cautiously sidles out of the room, closing the door behind him with deliberate care.\n\nLifting a sturdy plank of wood, Graham holds it firmly across the door while Merrill takes hold of the opposite end with equal determination. In unison, the two men efficiently hammer nails through the plank, securing it into the frame of the door with meticulously coordinated efforts, all while Bo and Morgan stand quietly at the top of the stairs behind them, observing the action intently with wide-eyed curiosity. Turning momentarily to retrieve another nail, Graham pauses to look at Bo, his attention drawn to her before he resumes his efforts assisting Merrill in preparing the next plank. Bo remains still, clinging tightly to her brother for comfort. She then walks over to Graham, who in response, crouches down to meet her at eye level. She shakes her head slightly, prompting Bo to grin endearingly at him, and in response, he tenderly strokes her cheek with affection. Drawing her closer, Graham lifts his daughter up, holding her securely and protectively in his embrace.\n\nMeanwhile, Merrill resolutely slaps yet another plank across the bedroom door with determination. With Bo safely in his arms, Graham and Morgan descend the stairs into the front hallway, their steps echoing lightly. Graham and Merrill then gently set the children down, prompting the entire family to pause and listen closely, their senses heightened. All of them fixate their attention in the direction of the persistent barking that emanates from beyond the wooden mantlepiece, situated gracefully at the far end of the room. The mantlepiece is adorned with two intricately crafted china dogs, each placed thoughtfully on one side, illuminated faintly by the soft, warm glow of two wall lamps positioned above them.\n\nNervously, Graham's eyes dart around the room, his fingers clutching Bo's shoulders with increased tightness, conveying his protectiveness. He exchanges an anxious, meaningful glance with Merrill, a silent communication of shared concern. Their focus shifts towards a boarded-up window located to the right of the mantlepiece, their gaze brushing past the fireplace as they follow the unsettling noises that echo through the space. Shadows fleetingly cross the narrow slit of moonlight visible between two planks of the boarded-up window to the left of the mantlepiece. Gradually, the family shifts their attention to the figures outside, which obscure the gentle light filtering through the gaps between the boards of another window at the front of the house. They pivot abruptly, turning their gaze down the hallway towards the kitchen and the back door, clearly petrified by the prospect of what lies beyond.\n\nSwiftly, they turn back to face the front door, noting how a single plank is nailed across the frame halfway up, as the doorknob ominously begins to turn, hinting at impending intrusion. Morgan, feeling the mounting tension in the air, instinctively begins to back away, an unconscious reaction to the rising anxiety. Sensing his son's fear, Graham looks around with determination, placing a reassuring hand on Morgan's shoulder before kneeling down tenderly in front of the frightened boy. Gazing lovingly and intently into Morgan's eyes, Graham smiles warmly, offering comfort and reassurance even as a solitary tear escapes from the corner of Morgan's eye, a testament to the emotional weight of the moment."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Graham and his family find themselves compelled to look up, their gazes fixed intently on something that captures their complete attention. As this silent observation holds them, Graham begins to move with measured, deliberate steps across the gleaming, polished wooden floor, navigating towards the front hallway. Upon reaching his destination, he extends his hand towards the door of the cupboard under the stairs, grasping the handle firmly to pull it open. As the door swings ajar, his eyes are drawn to the TV set housed within, which is currently displaying a test card. The scene prompts him to turn back towards his family, where he meets their eyes, and a noticeable moment occurs as he swallows, a gesture conveying his growing apprehension. In the subsequent scene, Merrill is situated upstairs, actively engaged in the task of hammering boards onto the children's bedroom door, the sounds of each strike echoing through the space. Meanwhile, across the landing, in the privacy of his own room, Graham approaches the window with caution. As he peers out, his gaze falls upon the expanse of the maize field, and his reaction is immediate—his eyes widen, captured in a state of intense, fearful fixation. Slowly, he begins to retreat, backtracking towards the bedroom door while maintaining an unyielding stare outside. Merrill, noticing Graham's reaction, glances over at him. Despite the tension, Graham continues his cautious sidelong movement out of the room, carefully closing the door behind him to prevent any potential disturbance. With determination, Graham lifts a plank and holds it firmly across the door, joining forces with Merrill, who takes the opposite end, and in a synchronized effort, they drive nails through the plank into the door frame, securing it in place. Bo and Morgan, standing silently at the top of the stairs, are observers of this protective act. As Graham turns to retrieve another nail, his attention is briefly captured by Bo. Pausing, he locks eyes with her and takes a moment before returning to assist Merrill with another plank. Bo, initially still and holding onto her brother for comfort, makes a move; she approaches Graham, who lowers himself to a crouch. As they exchange gestures of understanding, Bo shakes her head, then breaks into a grin, prompting Graham to tenderly stroke her cheek. In a display of parental affection, Graham pulls her closer and lifts his daughter into his arms. Meanwhile, Merrill continues his task, driving another plank into the bedroom door. With Bo secure in Graham's embrace, he and Morgan head downstairs to the front hallway. Arriving there, Graham and Merrill carefully set the children down. In the ensuing silence, they all come to an attentive halt, their collective focus drawn towards the sound of barking emanating beyond the wooden mantlepiece, a structure adorned with two China dogs, each perched on opposite sides, their features softened by the faint glow of two wall lamps overhead. Amidst the dim ambiance, Graham's eyes flicker with nervous energy, his grip instinctively tightening on Bo's shoulders. In the silent exchange of worry, he and Merrill share a series of anxious glances. Their attention shifts towards a window to the right of the mantlepiece, whose view is obstructed by boards, and then, in synchronization, their gaze traverses the fireplace as they tune into the unsettling noises. Their eyes trace the gentle dance of shadows that interrupt the shaft of moonlight slicing through two planks across the window to the left of the mantlepiece. Gradually, the family adjusts their focus to observe figures that intermittently obscure the soft light filtering through the spaces between the boards on another window positioned at the front of the house. A palpable tension envelops them as they swiftly pivot to confront the hallway, casting their frightened looks into the kitchen and towards the back door. Quickly redirecting their attention, they focus on the front door, noting the single plank secured halfway up the frame. There, they witness the doorknob turning, an ominous signal of potential intrusion. As Morgan instinctively begins to retreat, Graham, perceptive of his child's fear, reaches out to rest a reassuring hand on Morgan's shoulder, offering comfort through touch. Lowering himself to meet Morgan's eye level, Graham kneels in front of the trembling boy, his demeanor softening into a loving smile despite the dire circumstances. In the quiet exchange that follows, a tear charts a path down Morgan's cheek, underscoring the vulnerability of the moment shared between father and son."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Graham and his family look up and stare at something, prompting Graham to move slowly across the polished wooden floor to the front hallway. He opens the cupboard under the stairs to find a TV displaying a test card, turns back to the others, and swallows. Later, they are upstairs; Merrill hammers boards onto the children's bedroom door while Graham cautiously approaches his own room's window. He peers out over the maize field, eyes widening in fear, and backs away towards the bedroom door, still fixated on the window. He sidles out, closes the door, and with Merrill's help, secures it by nailing a plank across it, as Bo and Morgan watch from the top of the stairs. Graham momentarily pauses to stare at Bo, then tenderly strokes her cheek and picks her up. With Bo in his arms, he, Merrill, and Morgan descend into the front hallway and pause to listen intently. They gaze towards the barking noise beyond the wooden mantle piece, where two China dogs are dimly lit by wall lamps. Graham's fingers tighten on Bo's shoulders as he exchanges anxious glances with Merrill. Their attention is drawn to a boarded-up window to the right of the mantle piece, noticing shadows flitting across the slit of moonlight between planks. Slowly, they turn to watch figures obscuring light through the boards of another window at the front of the house. The family swings around, petrified, staring down the hallway towards the kitchen and back door before quickly turning back to the front door as its doorknob turns. In response, Morgan retreats, and Graham reassures him with a comforting hand on his shoulder. He kneels before the frightened boy, offering a loving smile as a tear rolls down Morgan's cheek."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Graham and his family, gathered in their modest farmhouse, look up and stare at something unusual in the gloomy silence of the rural night. Graham walks slowly across the polished wooden floor, crafted from the local oak that adds a warm, rustic charm to the home, into the front hallway. He reaches the door to the cupboard under the stairs, a storage space typical in older homes, and pulls it open. Inside, he looks at the TV set, an older model with a small screen, which is displaying a test card, a pattern used to calibrate television sets before broadcasts became 24-hour services. He turns to look back at the others and swallows, a palpable tension in the air.\n\nLater, Merrill, skilled with his hands from his years working on neighboring farms, is upstairs, hammering boards onto the door of the children's bedroom as a makeshift barricade. Across the landing in his room, Graham cautiously approaches the window and looks out over the extensive maize field, a staple crop in the region, which rustles ominously in the wind. His eyes widen and become fixed in a fearful stare as he backs towards the bedroom door, sensing something menacing amid the rows of corn. Merrill looks over at him. Eyes still on the window, Graham sidles out of the room and closes the door with a quiet determination. Graham lifts up a plank, weathered from previous repairs, and holds it across the door, with Merrill taking the other end. Together, the two men hammer nails through the plank into the door frame, a task done with the urgency of those protecting their home, with Bo and Morgan standing at the top of the stairs behind them, watching apprehensively.\n\nTurning to get another nail, Graham stops and stares at Bo, his daughter, whose brave demeanor belies her youth, before helping Merrill with another plank. Bo remains motionless, clinging to her brother, then walks over, and Graham crouches down. She shakes her head, her eyes filled with questions too profound for her age, Bo grins at him, a small gesture of reassurance, and he strokes her cheek tenderly. Graham pulls her towards him and picks his daughter up, the protective instinct of a father not lost on him. Merrill slaps another plank across the bedroom door, sealing it as best they can.\n\nBo in his arms, Graham and Morgan, who clutches his father's sleeve for security, go downstairs into the front hallway. Graham and Merrill put the children down, and they stop and listen, the quiet hum of crickets outside a constant backdrop to their heightened senses. They all stare in the direction of the barking beyond the wooden mantle piece, a focal point in the room that speaks of many family gatherings, which stands at the far end of the room. On it sit two China dogs, collectible figurines with a curious gaze, one on each side, illuminated by the dim glow of two wall lamps above them. Graham's eyes dart nervously around, his fingers tightening on Bo's shoulders in front of him, a gesture of both comfort and protection. He and Merrill exchange anxious glances. They look towards a boarded-up window to the right of the mantle piece, their gaze passing across the fireplace, a once comforting source of warmth, as they turn to follow the noises.\n\nShadows flit across the slit of moonlight between two planks across the window on the left of the mantle piece, the moon casting an eerie glow over the tense scene. Slowly, the family turns to watch the figures block out the soft light diffusing through the gaps between the boards on another window at the front of the house, their hearts pounding in their chests. They swing around and stare petrified down the hallway and into the kitchen towards the back door, the anticipation heavy in the air. They turn quickly back around to look at the front door, one plank nailed across the frame halfway up, as the doorknob turns with a slow, deliberate motion. Morgan starts to back away, fear etched into his young face, and Graham looks around and puts a comforting hand on Morgan's shoulder before kneeling down in front of the frightened boy. Graham smiles lovingly, his heart aching for his son’s fear, as a tear falls from Morgan's eyes, the weight of the moment pressing down on them both."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Graham walks slowly across the polished wooden floor into the front hallway reaching the door to the cupboard under the stairs and pulling it open Graham and his family look up and stare at something Graham sidles out of the room and closes the door Graham walks slowly across the polished wooden floor into the front hallway reaching the door to the cupboard under the stairs and pulling it open Graham's eyes dart nervously around his fingers tightening on Bo's shoulders in front of him He looks at the TV set inside which is displaying a test card He turns to look back at the others and swallows Later Merrill is upstairs hammering boards onto the door of the children's bedroom Across the landing in his room Graham cautiously approaches the window and looks out over the maize field His eyes widen and become fixed in a fearful stare as he backs towards the bedroom door one plank nailed across the frame halfway up as the doorknob turns Merrill looks over at him Eyes still on the window Graham sidles out of the room and closes the door Graham lifts up a plank and holds it across the door with Merrill taking the other end Slowly the family turns to watch the figures block out the soft light diffusing through the gaps between the boards on another window at the front of the house Together the two men hammer nails through the plank into the door frame with Bo and Morgan standing at the top of the stairs behind them watching Graham and Morgan go downstairs into the front hallway Turning to get another mail Graham stops and stares at Bo before helping Merrill with another plank He turns to look back at the others and swallows She shakes her head Graham and his family look up and stare at something Bo remains motionless clinging to her brother then walks over and he crouches down She shakes her head Bo grins at him and he strokes her cheek Graham pulls her towards him and picks his daughter up Merrill slaps another plank across the bedroom door Bo in his arms Graham and Morgan go downstairs into the front hallway Graham and Merrill put the children down and they stop and listen They all stare in the direction of the barking beyond the wooden mantle piece which stands at the far end of the room with two China dogs sitting on it one on each side illuminated by the dim glow of two wall lamps above them Graham's eyes dart nervously around his fingers tightening on Bo's shoulders in front of him Morgan starts to back away and Graham looks around and puts a comforting hand on Morgan's shoulder before kneeling down in front of the frightened boy He looks at the TV set inside which is displaying a test card He and Merrill exchange anxious glances They look towards a boardedup window to the right of the mantle piece their gaze passing across the fireplace as they turn to follow the noises Shadows flit across the slit of moonlight between two planks across the window on the left of the mantle piece Slowly the family turns to watch the figures block out the soft light diffusing through the gaps between the boards on another window at the front of the house They swing around and stare petrified down the hallway and into the kitchen towards the back door They turn quickly back around to look at the front door one plank nailed across the frame halfway up as the doorknob turns Morgan starts to back away and Graham looks around and puts a comforting hand on Morgan's shoulder before kneeling down in front of the frightened boy Graham and Merrill put the children down and they stop and listen Later Merrill is upstairs hammering boards onto the door of the children's bedroom Shadows flit across the slit of moonlight between two planks across the window on the left of the mantle piece Graham smiles lovingly as a tear falls from Morgan's eyes Merrill looks over at him Eyes still on the window"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Graham and his family look up and stare at something. Graham walks slowly across the polished wooden floor into the front hallway reaching the door to the cupboard under the stairs and pulling it open. He looks at the TV set inside which is displaying a test card. He turns to look back at the others and swallows. Later Merrill is upstairs hammering boards onto the door of the children's bedroom. Across the landing in his room Graham cautiously approaches the window and looks out over the maize field. His eyes widen and become fixed in a fearful stare as he backs towards the bedroom door. Merrill looks over at him Eyes still on the window. Graham sidles out of the room and closes the door. Graham lifts up a plank and holds it across the door with Merrill taking the other end. Together the two men hammer nails through the plank into the door frame with Bo and Morgan standing at the top of the stairs behind them watching. Turning to get another mail Graham stops and stares at Bo before helping Merrill with another plank. Bo remains motionless clinging to her brother then walks over and he crouches down. She shakes her head. Bo grins at him and he strokes her cheek. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. Graham pulls her towards him and picks his daughter up. Merrill slaps another plank across the bedroom door Bo in his arms. Graham and Morgan go downstairs into the front hallway. Graham and Merrill put the children down and they stop and listen. They all stare in the direction of the barking beyond the wooden mantle piece which stands at the far end of the room with two China dogs sitting on it one on each side illuminated by the dim glow of two wall lamps above them. Graham's eyes dart nervously around his fingers tightening on Bo's shoulders in front of him. He and Merrill exchange anxious glances. They look towards a boardedup window to the right of the mantle piece their gaze passing across the fireplace as they turn to follow the noises. Shadows flit across the slit of moonlight between two planks across the window on the left of the mantle piece. Slowly the family turns to watch the figures block out the soft light diffusing through the gaps between the boards on another window at the front of the house. They swing around and stare petrified down the hallway and into the kitchen towards the back door. They turn quickly back around to look at the front door. one plank nailed across the frame halfway up as the doorknob turns. Morgan starts to back away and Graham looks around and puts a comforting hand on Morgan's shoulder before kneeling down in front of the frightened boy. Graham smiles lovingly as a tear falls from Morgan's eyes."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Graham and his family look up and stare at something. Graham walks slowly across the polished wooden floor into the front hallway reaching the door to the cupboard under the stairs and pulling it open. He looks at the TV set inside which is displaying a test card. He turns to look back at the others and swallows. Later Merrill is upstairs hammering boards onto the door of the children's bedroom. Across the landing in his room Graham cautiously approaches the window and looks out over the maize field. His eyes widen and become fixed in a fearful stare as he backs towards the bedroom door. Merrill looks over at him Eyes still on the window. Graham sidles out of the room and closes the door. Graham lifts up a plank and holds it across the door with Merrill taking the other end. Together the two men hammer nails through the plank into the door frame with Bo and Morgan standing at the top of the stairs behind them watching. Turning to get another mail Graham stops and stares at Bo before helping Merrill with another plank. Bo remains motionless clinging to her brother then walks over and he crouches down. She shakes her head. Bo grins at him and he strokes her cheek. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. Graham pulls her towards him and picks his daughter up. Merrill slaps another plank across the bedroom door Bo in his arms. Graham and Morgan go downstairs into the front hallway. Graham and Merrill put the children down and they stop and listen. They all stare in the direction of the barking beyond the wooden mantle piece which stands at the far end of the room with two China dogs sitting on it one on each side illuminated by the dim glow of two wall lamps above them. Graham's eyes dart nervously around his fingers tightening on Bo's shoulders in front of him. He and Merrill exchange anxious glances. They look towards a boardedup window to the right of the mantle piece their gaze passing across the fireplace as they turn to follow the noises. Shadows flit across the slit of moonlight between two planks across the window on the left of the mantle piece. Slowly the family turns to watch the figures block out the soft light diffusing through the gaps between the boards on another window at the front of the house. They swing around and stare petrified down the hallway and into the kitchen towards the back door. They turn quickly back around to look at the front door. one plank nailed across the frame halfway up as the doorknob turns. Morgan starts to back away and Graham looks around and puts a comforting hand on Morgan's shoulder before kneeling down in front of the frightened boy. Graham smiles lovingly as a tear falls from Morgan's eyes."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Graham and his family look up and stare at something. Graham walks slowly across the polished wooden floor into the front hallway reaching the door to the cupboard under the stairs and pulling it open. He looks at the TV set inside which is displaying a test card. He turns to look back at the others and swallows. Later Merrill is upstairs hammering boards onto the door of the children's bedroom. Across the landing in his room Graham cautiously approaches the window and looks out over the maize field. His eyes widen and become fixed in a fearful stare as he backs towards the bedroom door. Merrill looks over at him Eyes still on the window. Shadows flit across the slit of moonlight between two planks across the window on the left of the mantle piece. Slowly the family turns to watch the figures block out the soft light diffusing through the gaps between the boards on another window at the front of the house. They swing around and stare petrified down the hallway and into the kitchen towards the back door. They turn quickly back around to look at the front door. one plank nailed across the frame halfway up as the doorknob turns. Morgan starts to back away and Graham looks around and puts a comforting hand on Morgan's shoulder before kneeling down in front of the frightened boy. Graham smiles lovingly as a tear falls from Morgan's eyes."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Graham and his family look up and stare at something. Graham walks slowly across the polished wooden floor into the front hallway reaching the door to the cupboard under the stairs and pulling it open. He looks at the TV set inside which is displaying a test card. one plank nailed across the frame halfway up as the doorknob turns. Morgan starts to back away and Graham looks around and puts a comforting hand on Morgan's shoulder before kneeling down in front of the frightened boy. Graham smiles lovingly as a tear falls from Morgan's eyes."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Timothy and his team look up and stare at something. Timothy walks slowly across the polished wooden floor into the front hallway, reaching the door to the cupboard under the stairs and pulling it open. He looks at the TV set inside, which is displaying a test card. He turns to look back at the others and swallows. Later, Jason is upstairs, hammering boards onto the door of the children's bedroom. Across the landing in his room, Timothy cautiously approaches the window and looks out over the maize field. His eyes widen and become fixed in a fearful stare as he backs towards the bedroom door. Jason looks over at him. Eyes still on the window, Timothy sidles out of the room and closes the door. Timothy lifts up a plank and holds it across the door, with Jason taking the other end. Together, the two bakers hammer nails through the plank into the door frame, with Mary and Joseph standing at the top of the stairs behind them, watching. Turning to get another nail, Timothy stops and stares at Mary before helping Jason with another plank. Mary remains motionless, clinging to her brother, then walks over, and he crouches down. She shakes her head, Mary grins at him, and he strokes her cheek. Timothy pulls her towards him and picks his daughter up. Jason slaps another plank across the bedroom door. Mary in his arms, Timothy and Joseph go downstairs into the front hallway. Timothy and Jason put the children down, and they stop and listen. They all stare in the direction of the barking beyond the wooden mantle piece, which stands at the far end of the room, with two China dogs sitting on it, one on each side, illuminated by the dim glow of two wall lamps above them. Timothy's eyes dart nervously around, his fingers tightening on Mary's shoulders in front of him. He and Jason exchange anxious glances. They look towards a boarded-up window to the right of the mantle piece, their gaze passing across the fireplace as they turn to follow the noises. Shadows flit across the slit of moonlight between two planks across the window on the left of the mantle piece. Slowly, the crew turns to watch the figures block out the soft light diffusing through the gaps between the boards on another window at the front of the house. They swing around and stare petrified down the hallway and into the kitchen towards the back door. They turn quickly back around to look at the front door, one plank nailed across the frame halfway up, as the doorknob turns. Joseph starts to back away, and Timothy looks around and puts a comforting hand on Joseph's shoulder before kneeling down in front of the frightened boy. Timothy smiles lovingly as a tear falls from Joseph's eyes."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Graham and his family look up and stare at something. Graham walks slowly across the polished marble floor into the front hallway, reaching the door to the pantry under the stairs and pulling it open. He looks at the radio inside, which is displaying a static signal. He turns to look back at the others and swallows. Later, Merrill is upstairs, hammering boards onto the entrance of the children's playroom. Across the corridor in his room, Graham cautiously approaches the window and looks out over the sunflower field. His eyes widen and become fixed in a fearful stare as he backs towards the bedroom door. Merrill looks over at him. Eyes still on the window, Graham sidles out of the room and closes the door. Graham lifts up a curtain rod and holds it across the door, with Merrill taking the other end. Together, the two men hammer nails through the curtain rod into the door frame, with Bo and Morgan standing at the top of the stairs behind them, watching. Turning to get another tack, Graham stops and stares at Bo before helping Merrill with another curtain rod. Bo remains motionless, clinging to her brother, then walks over, and he crouches down. She shakes her head, Bo grins at him, and he strokes her cheek. Graham pulls her towards him and picks his daughter up. Merrill slaps another curtain rod across the bedroom door. Bo in his arms, Graham and Morgan go downstairs into the front hallway. Graham and Merrill put the children down, and they stop and listen. They all stare in the direction of the meowing beyond the marble statue, which stands at the far end of the room, with two porcelain cats sitting on it, one on each side, illuminated by the dim glow of two ceiling lights above them. Graham's eyes dart nervously around, his fingers tightening on Bo's shoulders in front of him. He and Merrill exchange anxious glances. They look towards a boarded-up window to the right of the statue, their gaze passing across the bookshelf as they turn to follow the noises. Shadows flit across the slit of moonlight between two beams across the window on the left of the statue. Slowly, the family turns to watch the figures block out the soft light diffusing through the gaps between the beams on another window at the front of the house. They swing around and stare petrified down the hallway and into the dining room towards the back door. They turn quickly back around to look at the front door, one beam nailed across the frame halfway up, as the doorknob turns. Morgan starts to back away, and Graham looks around and puts a comforting hand on Morgan's shoulder before kneeling down in front of the frightened boy. Graham smiles lovingly as a tear falls from Morgan's eyes."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Graham and his family glance up and focus on something. Graham tiptoes quietly across the polished wooden floor into the front hallway, reaching the door to the cupboard under the stairs and nudging it open. He peers at the TV set inside, which is showing a test card. He turns to glance back at the others and sighs. Later, Merrill is upstairs, painting designs onto the door of the children's bedroom. Across the landing in his room, Graham gingerly approaches the window and peers out over the maize field. His eyes widen and become fixed in a curious stare as he sidesteps towards the bedroom door. Merrill nods over at him. Eyes still on the window, Graham shuffles out of the room and shuts the door. Graham picks up a plank and rests it across the door, with Merrill gripping the other end. Together, the two men glue nails through the plank into the door frame, with Bo and Morgan standing at the top of the stairs behind them, observing. Turning to grab another nail, Graham pauses and grins at Bo before assisting Merrill with another plank. Bo remains stationary, holding onto her brother, then moves over, and he kneels down. She nods, Bo beams at him, and he pats her cheek. Graham guides her towards him and lifts his daughter up. Merrill places another plank across the bedroom door. Bo in his arms, Graham and Morgan stroll downstairs into the front hallway. Graham and Merrill set the children down, and they pause and eavesdrop. They all glance in the direction of the chirping beyond the wooden mantlepiece, which stands at the far end of the room, with two China dogs perched on it, one on each side, illuminated by the dim glow of two wall lamps above them. Graham's eyes flick nervously around, his fingers loosening on Bo's shoulders in front of him. He and Merrill wear apprehensive expressions. They gaze towards a boarded-up window to the right of the mantlepiece, their gaze sweeping across the fireplace as they turn to follow the murmurs. Shadows glide across the beam of moonlight between two planks across the window on the left of the mantlepiece. Slowly, the family tilts to observe the figures obscure the gentle light filtering through the gaps between the boards on another window at the front of the house. They twirl around and observe nervously down the hallway and into the kitchen towards the back door. They swivel quickly back around to gaze at the front door, one plank propped up across the frame halfway up, as the doorknob jiggles. Morgan begins to tiptoe away, and Graham glances around and places a reassuring hand on Morgan's shoulder before crouching down in front of the trembling boy. Graham smiles affectionately as a tear glides from Morgan's eyes."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Timothy and his orchestra glance up and gaze at anything. Timothy strolls slowly across the shiny marble bridge into the rear sanctuary, reaching the entrance to the closet above the attic and tugging it open. He gazes at the radio hidden within, which is broadcasting a static wave. He pivots to glance back at the orchestra and gulps. Later, Jordan is downstairs, nailing canvases onto the portal of the gardener's office. Across the corridor in his closet, Timothy cautiously moves toward the skylight and peers out over the pumpkin patch. His pupils widen and become fixed in an anxious glare as he retreats towards the office portal. Jordan glances over at him. Eyes still on the skylight, Timothy shuffles out of the closet and shuts the portal. Timothy hoists up a beam and holds it across the portal, with Jordan grabbing the other end. Together, the two artists nail screws through the beam into the portal frame, with Liz and Michael standing at the base of the ladder behind them, observing. Turning to fetch another bolt, Timothy halts and gazes at Liz before assisting Jordan with another beam. Liz stays motionless, clutching her cousin, then saunters over, and he kneels down. She nods her head, Liz smirks at him, and he pats her elbow. Timothy draws her close and lifts his niece. Jordan smacks another beam across the office portal. Liz in his arms, Timothy and Michael proceed upstairs into the rear sanctuary. Timothy and Jordan set the cousins down, and they pause and listen. They all gaze in the direction of the howling beyond the granite pedestal, which stands at the near side of the cabin, with two ceramic cats perched on it, one on each side, illuminated by the soft shimmer of two ceiling lights above them. Timothy's pupils dart nervously around, his fingers clutching Liz's elbows in front of him. He and Jordan exchange tense glances. They gaze toward a shuttered skylight to the left of the pedestal, their focus passing across the chimney as they turn to trace the sounds. Silhouettes flicker across the sliver of starlight between two beams across the skylight on the right of the pedestal. Deliberately, the orchestra turns to witness the shapes obscure the gentle radiance filtering through the cracks between the canvases on another skylight at the rear of the barn. They pivot around and stare terrified up the corridor and into the pantry towards the guest entrance. They spin quickly back around to gaze at the rear exit, one beam nailed across the frame midway up, as the doorknob twists. Michael begins to retreat, and Timothy scans around and places a reassuring hand on Michael's elbow before crouching in front of the alarmed cousin. Timothy grins tenderly as a droplet falls from Michael's eyes."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Lola and her crew glance up and gaze at something. Lola wanders slowly across the shiny marble floor into the entryway, reaching the closet door under the stairs and swinging it open. She glances at the radio inside, which is emitting static. She pivots to glance back at the others and pauses. Later, Jeb is upstairs, drilling nails into the window of the children's bedroom. Across the landing in his space, Lola carefully tiptoes to the window and peers out over the sunflower field. Her eyes expand and transform into a startled gaze as she edges towards the bedroom doorway. Jeb glances over at her. Eyes fixed on the window, Lola slips out of the space and shuts the door. Lola hoists up a beam and places it over the door, with Jeb gripping the other end. Together, the two individuals drive screws through the beam into the door frame, with Sam and Casey standing at the top of the stairs behind them, observing. Spinning to retrieve another tool, Lola pauses and glances at Sam before aiding Jeb with another beam. Sam stands still, clutching his sibling, then steps over, and she kneels down. He nods, Sam beams at her, and she pats his shoulder. Lola pulls him close and lifts her son up. Jeb places another beam over the bedroom door. Sam in her grasp, Lola and Casey descend into the entryway. Lola and Jeb set the youngsters down, and they halt and listen. They all gaze towards the direction of the howling beyond the brick mantlepiece, which sits at the far end of the room, with two ceramic cats perched on it, one on each end, illuminated by the faint glow of two ceiling lamps above them. Lola's eyes dart anxiously around, her fingers clutching Sam's arm in front of her. She and Jeb share nervous looks. They gaze towards a barricaded window to the right of the mantlepiece, their gaze sweeping across the hearth as they pivot to follow the sounds. Silhouettes shift across the strip of moonlight between two beams across the window on the left of the mantlepiece. Gradually, the crew pivots to observe the shadows obscure the mellow light seeping through the slits between the planks on another window at the front of the dwelling. They whirl around and stare frozen down the hallway and into the pantry towards the rear door. They swiftly turn back to gaze at the front entrance, one beam nailed across the frame partway up, as the doorknob twists. Casey starts to step back, and Lola glances around and places a reassuring hand on Casey's arm before stooping in front of the anxious child. Lola grins warmly as a tear trickles from Casey's eyes."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Graham and his family glance up and gaze at a curiosity. Graham meanders slowly across the carpeted tiled floor into the rear corridor, reaching the entrance to the attic above the stairs and sliding it open. He gazes at the radio inside, which is broadcasting a weather report. He turns to glance back at the others and sighs. Later, Merrill is downstairs, painting murals onto the wall of the children's playroom. Across the hallway in his chamber, Graham stealthily approaches the desk and peers out over the pumpkin patch. His eyebrows lift and become fixed in a puzzled gaze as he shuffles towards the study door. Merrill glances over at him. Eyes still on the desk, Graham tiptoes out of the chamber and seals the entrance. Graham raises a curtain and holds it across the doorway, with Merrill gripping the opposite side. Together, the two men drill screws through the curtain into the wall frame, with Bo and Morgan standing at the foot of the stairs behind them, observing. Turning to fetch another tool, Graham pauses and glances at Bo before assisting Merrill with another curtain. Bo remains stationary, hugging her brother, then strolls over, and he kneels down. She tilts her head, Bo chuckles at him, and he pats her shoulder. Graham draws her towards him and lifts his daughter up. Merrill nails another curtain across the playroom entrance. Bo in his embrace, Graham and Morgan descend into the rear corridor. Graham and Merrill set the children down, and they pause and perceive. They all gaze in the direction of the whistling beyond the marble bookshelf, which stands at the near end of the lounge, with two porcelain cats perched on it, one on each side, illuminated by the faint glow of two ceiling lights above them. Graham's eyes flicker nervously around, his fingers clenching on Bo's hands in front of him. He and Merrill exchange uneasy glances. They peer towards a curtained window to the left of the bookshelf, their gaze skimming across the bookcase as they rotate to trace the sounds. Shadows swim across the stripe of sunlight between two curtains across the window on the right of the bookshelf. Gradually, the family turns to view the outlines obscure the gentle glow filtering through the seams between the curtains on another window at the side of the house. They twist around and gawk apprehensively down the corridor and into the pantry towards the back entrance. They swivel quickly back around to peek at the side door, one curtain tied across the frame mid-way up, as the latch jiggles. Morgan starts to edge away, and Graham scans the area and places a reassuring hand on Morgan's arm before bending down in front of the anxious child. Graham beams warmly as a raindrop cascades from Morgan's glance."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Nigel and his orchestra glance down and ponder at anything. Nigel drifts swiftly over the marble carpet into the back cellar, reaching the gate to the wardrobe above the attic and pushing it closed. He glances at the computer monitor inside, which is showing a music video. He spins to glance forward at the nephews and coughs. Earlier, Lance is downstairs, juggling ropes onto the gate of the teacher's office. Beside the staircase in his closet, Nigel recklessly leaves the mirror and glances in over the pumpkin patch. His hands shrink and become frozen in a joyful grin as he dances towards the office gate. Lance glances away from him. Hands still on the mirror, Nigel skips into the closet and opens the gate. Nigel drops down a boulder and drops it over the gate, with Lance taking the opposite side. Together, the two chefs toss screws through the boulder into the gate latch, with Zoe and Alex leaping at the base of the staircase beside them, giggling. Leaping to get another flyer, Nigel leaps and grins at Zoe before assisting Lance with another boulder. Zoe stays energetic, leaping from her cousin, then spins over, and he hops high. She nods her foot, Zoe laughs at him, and he tickles her elbow. Nigel pushes her away from him and drops his son down. Lance taps another boulder above the office gate. Zoe in his boots, Nigel and Alex leap upstairs into the back cellar. Nigel and Lance push the cousins up, and they leap and giggle. They all grin in the way of the singing within the plastic wallpaper, which stands at the near start of the roof, with two porcelain cats leaping on it, one on either side, dimmed by the bright glow of two ceiling lights below them. Nigel's hands leap calmly down, his ears loosening on Zoe's knees behind him. He and Lance exchange cheerful sighs. They grin towards a bolted-up mirror to the left of the wallpaper, their gaze skipping above the drawer as they spin to chase the sounds. Light beams dance above the sliver of sunlight within two boulders above the mirror on the right of the wallpaper. Quickly, the orchestra spins to chase the shapes reveal the harsh darkness reflecting over the cracks within the boulders on the other mirror behind the garage. They leap around and grin thrilled down the cellar and beside the pantry towards the front gate. They leap quickly forward around to chase at the back gate, one boulder loosened above the latch halfway down, as the gatebell leaps. Alex spins to leap towards, and Nigel grins back and drops a gentle foot on Alex's knee before leaping down in front of the excited girl. Nigel frowns sadly as a giggle rises into Alex's hands."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Graham and his family are tense as they notice something unsettling. Graham cautiously checks a TV displaying a test card, then joins Merrill in securing the house, boarding up a bedroom door while Bo and Morgan watch. Graham comforts Bo and Morgan as they all descend to the front hallway, their attention drawn to noises outside. With eyes darting nervously, Graham and Merrill exchange anxious glances and follow shadows moving past the boarded windows. The family turns towards the kitchen, then the front door, where the doorknob begins to turn. Morgan steps back in fear, and Graham reassures him with a comforting hand and a loving smile as Morgan tears up."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Graham smiles lovingly as a tear falls from Morgan's eyes Morgan starts to back away and Graham looks around and puts a comforting hand on Morgan's shoulder before kneeling down in front of the frightened boy one plank nailed across the frame halfway up as the doorknob turns They turn quickly back around to look at the front door They swing around and stare petrified down the hallway and into the kitchen towards the back door Slowly the family turns to watch the figures block out the soft light diffusing through the gaps between the boards on another window at the front of the house Shadows flit across the slit of moonlight between two planks across the window on the left of the mantle piece They look towards a boardedup window to the right of the mantle piece their gaze passing across the fireplace as they turn to follow the noises He and Merrill exchange anxious glances Graham's eyes dart nervously around his fingers tightening on Bo's shoulders in front of him They all stare in the direction of the barking beyond the wooden mantle piece which stands at the far end of the room with two China dogs sitting on it one on each side illuminated by the dim glow of two wall lamps above them Graham and Merrill put the children down and they stop and listen Graham and Morgan go downstairs into the front hallway Merrill slaps another plank across the bedroom door Bo in his arms Graham pulls her towards him and picks his daughter up Bo grins at him and he strokes her cheek She shakes her head Bo remains motionless clinging to her brother then walks over and he crouches down Turning to get another mail Graham stops and stares at Bo before helping Merrill with another plank Together the two men hammer nails through the plank into the door frame with Bo and Morgan standing at the top of the stairs behind them watching Graham lifts up a plank and holds it across the door with Merrill taking the other end Graham sidles out of the room and closes the door Merrill looks over at him Eyes still on the window His eyes widen and become fixed in a fearful stare as he backs towards the bedroom door Across the landing in his room Graham cautiously approaches the window and looks out over the maize field Later Merrill is upstairs hammering boards onto the door of the children's bedroom He turns to look back at the others and swallows He looks at the TV set inside which is displaying a test card Graham walks slowly across the polished wooden floor into the front hallway reaching the door to the cupboard under the stairs and pulling it open Graham and his family look up and stare at something"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "They all stare in the direction of the barking beyond the wooden mantle piece which stands at the far end of the room with two China dogs sitting on it one on each side illuminated by the dim glow of two wall lamps above them Bo grins at him and he strokes her cheek Together the two men hammer nails through the plank into the door frame with Bo and Morgan standing at the top of the stairs behind them watching They turn quickly back around to look at the front door They look towards a boardedup window to the right of the mantle piece their gaze passing across the fireplace as they turn to follow the noises His eyes widen and become fixed in a fearful stare as he backs towards the bedroom door Across the landing in his room Graham cautiously approaches the window and looks out over the maize field Bo remains motionless clinging to her brother then walks over and he crouches down Turning to get another mail Graham stops and stares at Bo before helping Merrill with another plank Graham pulls her towards him and picks his daughter up Graham lifts up a plank and holds it across the door with Merrill taking the other end They swing around and stare petrified down the hallway and into the kitchen towards the back door Graham smiles lovingly as a tear falls from Morgan's eyes He and Merrill exchange anxious glances Merrill slaps another plank across the bedroom door Bo in his arms one plank nailed across the frame halfway up as the doorknob turns Graham walks slowly across the polished wooden floor into the front hallway reaching the door to the cupboard under the stairs and pulling it open She shakes her head Graham and Merrill put the children down and they stop and listen He looks at the TV set inside which is displaying a test card Graham and Morgan go downstairs into the front hallway Morgan starts to back away and Graham looks around and puts a comforting hand on Morgan's shoulder before kneeling down in front of the frightened boy Later Merrill is upstairs hammering boards onto the door of the children's bedroom Slowly the family turns to watch the figures block out the soft light diffusing through the gaps between the boards on another window at the front of the house Merrill looks over at him Eyes still on the window Graham sidles out of the room and closes the door Shadows flit across the slit of moonlight between two planks across the window on the left of the mantle piece Graham and his family look up and stare at something He turns to look back at the others and swallows Graham's eyes dart nervously around his fingers tightening on Bo's shoulders in front of him"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Graham pulls her towards him and picks his daughter up Merrill slaps another plank across the bedroom door Bo in his arms Graham and Morgan go downstairs into the front hallway Graham and Merrill put the children down and they stop and listen They all stare in the direction of the barking beyond the wooden mantle piece which stands at the far end of the room with two China dogs sitting on it one on each side illuminated by the dim glow of two wall lamps above them Graham's eyes dart nervously around his fingers tightening on Bo's shoulders in front of him He and Merrill exchange anxious glances They look towards a boardedup window to the right of the mantle piece their gaze passing across the fireplace as they turn to follow the noises Shadows flit across the slit of moonlight between two planks across the window on the left of the mantle piece Slowly the family turns to watch the figures block out the soft light diffusing through the gaps between the boards on another window at the front of the house They swing around and stare petrified down the hallway and into the kitchen towards the back door They turn quickly back around to look at the front door one plank nailed across the frame halfway up as the doorknob turns Morgan starts to back away and Graham looks around and puts a comforting hand on Morgan's shoulder before kneeling down in front of the frightened boy Graham smiles lovingly as a tear falls from Morgan's eyes Graham and his family look up and stare at something Graham walks slowly across the polished wooden floor into the front hallway reaching the door to the cupboard under the stairs and pulling it open He looks at the TV set inside which is displaying a test card He turns to look back at the others and swallows Later Merrill is upstairs hammering boards onto the door of the children's bedroom Across the landing in his room Graham cautiously approaches the window and looks out over the maize field His eyes widen and become fixed in a fearful stare as he backs towards the bedroom door Merrill looks over at him Eyes still on the window Graham sidles out of the room and closes the door Graham lifts up a plank and holds it across the door with Merrill taking the other end Together the two men hammer nails through the plank into the door frame with Bo and Morgan standing at the top of the stairs behind them watching Turning to get another mail Graham stops and stares at Bo before helping Merrill with another plank Bo remains motionless clinging to her brother then walks over and he crouches down She shakes her head Bo grins at him and he strokes her cheek"
        }
      ]
    }
  ]
}