{
  "ground_truth": "In an interrogation room, a corpulent policeman blows cigarette smoke across the table into the face of a terrified, sweating, young male prisoner. The prisoner, Jamal Malik, blinks rapidly as the smoke stings his eyes. The policeman suddenly lunges across the table. A question appears on the screen. Hands scatter Rupee notes onto the floor. The show's host turns to Jamal, standing in the wings of the studio. Jamal and the host walk to their chairs positioned at the center of the studio stage. Back in the police cell, the policeman forces Jamal's head into a bucket of water. A beautiful young woman stands on a train platform. She looks up and smiles. The inspector enters a room where Jamal is suspended off the floor by his wrists. Srinivas reluctantly sets up a car battery with jump leads beneath Jamal's dangling feet. Srinivas attaches the jump leads to each of Jamal's big toes. Jamal glares directly into the eyes of the inspector. The inspector moves to the other side of the room, as Srinivas switches on the battery. The inspector approaches the now limp body of Jamal again and notices that Jamal's eyes are closed and that he's dribbling. The inspector looks closely at his face. Jamal stares. Both the policemen turn slowly toward Jamal. He spits blood. A group of scruffy young boys in filthy t-shirts and shorts play cricket on a runway. Jamal, seen as a young boy here, trips and fails to catch the ball. The other boys slap their heads. They brandish long truncheons. The gang of boys suddenly disperses in all directions. Another boy turns to make a rude gesture at the security men. They clap a high-five. The boys clamber across a rubbish tip, up over corrugated rooftops and down into the narrow alleyways of their slum. The security men dismount and give chase on foot. The security guards struggle to follow the tiny boys as they wind and weave through the filthy, narrow streets between shanty buildings. Some boys throw rubbish from the roofs onto the heads of the guards. A determined guard perseveres in chasing Salim and Jamal down a walkway and past a river swollen with rubbish, plastic bags, and green slime. The boys run along a sewage pipe, followed by the guard hot on their heels. The boys run headlong into a Mercedes. Javed, the local gangster, sits in the back, shouting and angry at the boys. The boys run off as the guard then collides with the car. He backs away apologetically, holding his cap in hand. The boys taunt the guard, turn a corner, and suddenly run into their mother. She drags the boys to school.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "In an questioning chamber, a overweight officer exhales tobacco fumes across the table into the visage of a petrified, perspiring, youthful male detainee. The detainee, Jamal Malik, blinks quickly as the fumes prick his eyes. The officer suddenly lunges across the table. A query emerges on the screen. Hands scatter Rupee bills onto the ground. The program's host turns to Jamal, standing in the wings of the auditorium. Jamal and the host stroll to their seats positioned at the center of the studio platform. Back in the police confinement, the officer forces Jamal's head into a pail of liquid. A gorgeous young lady stands on a train platform. She glances up and grins. The investigator enters a chamber where Jamal is suspended off the ground by his wrists. Srinivas unwillingly sets up an automobile battery with jump cables beneath Jamal's dangling feet. Srinivas connects the jump cables to each of Jamal's large toes. Jamal glares directly into the eyes of the investigator. The investigator moves to the other side of the chamber, as Srinivas activates the battery. The investigator approaches the now limp form of Jamal again and notices that Jamal's eyes are shut and that he's dribbling. The investigator examines closely at his visage. Jamal stares. Both the officers turn slowly toward Jamal. He spits blood. A group of unkempt young lads in grimy t-shirts and shorts play cricket on a runway. Jamal, seen as a young lad here, stumbles and fails to catch the ball. The other lads slap their heads. They brandish long batons. The gang of lads suddenly scatters in all directions. Another lad turns to make a rude motion at the security personnel. They clap a high-five. The lads climb across a garbage tip, up over corrugated rooftops and down into the narrow passageways of their slum. The security personnel dismount and give chase on foot. The security guards struggle to trail the tiny lads as they wind and weave through the grimy, narrow lanes between shanty structures. Some lads throw refuse from the roofs onto the heads of the guards. A determined guard perseveres in chasing Salim and Jamal down a pathway and past a river swollen with refuse, plastic bags, and green slime. The lads sprint along a sewage pipe, pursued by the guard hot on their heels. The lads dash headlong into a Mercedes. Javed, the local mobster, sits in the rear, shouting and irate at the lads. The lads dash off as the guard then collides with the automobile. He backs away apologetically, holding his cap in hand. The lads taunt the guard, turn a corner, and suddenly dash into their mother. She drags the lads to school."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "In an interrogation room, cigarette smoke is blown across the table into the face of a terrified, sweating, young male prisoner by a corpulent policeman. Jamal Malik, the prisoner, blinks rapidly as smoke stings his eyes. Across the table, it is suddenly lunged by the policeman. A question appears on the screen. Rupee notes are scattered onto the floor by hands. To Jamal, standing in the wings of the studio, the show's host turns. The chairs positioned at the center of the studio stage are walked to by Jamal and the host. Back in the police cell, Jamal's head is forced into a bucket of water by the policeman. On a train platform, a beautiful young woman stands. Up is looked by her, and she smiles. A room where Jamal is suspended off the floor by his wrists is entered by the inspector. A car battery with jump leads is reluctantly set up by Srinivas beneath Jamal's dangling feet. To each of Jamal's big toes, the jump leads are attached by Srinivas. Directly into the eyes of the inspector, Jamal glares. To the other side of the room, the inspector moves, as the battery is switched on by Srinivas. Again, the now limp body of Jamal is approached by the inspector, and he notices that Jamal's eyes are closed and that he's dribbling. Closely at his face, the inspector looks. Jamal stares. Toward Jamal, both the policemen turn slowly. Blood is spat by him. On a runway, cricket is played by a group of scruffy young boys in filthy t-shirts and shorts. As a young boy here, Jamal is seen tripping and failing to catch the ball. Their heads are slapped by the other boys. Long truncheons are brandished by them. In all directions, the gang of boys suddenly disperses. At the security men, a rude gesture is made by another boy. A high-five is clapped by them. Across a rubbish tip, up over corrugated rooftops, and down into the narrow alleyways of their slum, the boys clamber. The security men dismount, and the chase is given on foot by them. As the tiny boys are wound and weaved through the filthy, narrow streets between shanty buildings, the security guards struggle to follow. From the roofs, rubbish is thrown by some boys onto the heads of the guards. In chasing Salim and Jamal down a walkway and past a river swollen with rubbish, plastic bags, and green slime, a determined guard perseveres. Along a sewage pipe, the boys run, followed by the guard hot on their heels. Into a Mercedes, the boys run headlong. In the back, shouting and angry at the boys, sits Javed, the local gangster. As the guard then collides with the car, the boys run off. Apologetically, he backs away, holding his cap in hand. The guard is taunted by the boys, who turn a corner and suddenly run into their mother. The boys are dragged to school by her."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "In an interrogation room, a corpulent policeman blows cigarette smoke into the face of a terrified, sweating young prisoner, Jamal Malik, who blinks rapidly as the smoke stings his eyes. The policeman lunges across the table, and a question appears on the screen. Rupee notes scatter on the floor. The show's host turns to Jamal, standing in the studio wings. They walk to their chairs at the center of the stage. Back in the cell, the policeman forces Jamal's head into a water bucket. A beautiful young woman smiles on a train platform. The inspector enters a room where Jamal is suspended by his wrists. Srinivas reluctantly sets up a car battery with jump leads beneath Jamal's feet and attaches them to his toes. Jamal glares at the inspector, who moves as Srinivas switches on the battery. The inspector approaches Jamal's limp body, noticing his closed eyes and dribbling. Jamal stares, and both policemen turn toward him as he spits blood. A group of scruffy boys in filthy clothes play cricket on a runway. Young Jamal trips and misses the ball, and the other boys slap their heads. They brandish truncheons and suddenly disperse. Another boy makes a rude gesture at security men, and they high-five. The boys clamber across a rubbish tip, over rooftops, and into slum alleyways. Security men give chase but struggle to follow the boys through narrow streets. Some boys throw rubbish from roofs onto the guards. A determined guard chases Salim and Jamal past a river filled with rubbish. The boys run along a sewage pipe, followed closely by the guard, and collide with a Mercedes. Javed, a local gangster, sits in the back, shouting angrily. The boys run off as the guard collides with the car, backing away apologetically. The boys taunt the guard, turn a corner, and run into their mother, who drags them to school."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "In an interrogation room, a corpulent policeman blows smoke into the face of a terrified, sweating prisoner, Jamal Malik. Jamal blinks as the smoke stings his eyes. The policeman lunges across the table. A question appears on the screen. Rupee notes scatter on the floor. The show's host turns to Jamal in the studio wings. They walk to their chairs on stage. Back in the cell, the policeman forces Jamal's head into water. A beautiful woman smiles on a train platform. The inspector enters a room where Jamal is suspended by his wrists. Srinivas reluctantly sets up a car battery beneath Jamal's feet and attaches jump leads to his toes. Jamal glares at the inspector, who moves as Srinivas switches on the battery. The inspector approaches Jamal's limp body, noticing his closed eyes and dribbling. Jamal stares. Both policemen turn to Jamal, who spits blood. Scruffy boys play cricket on a runway. Young Jamal trips and misses the ball. The boys disperse. Another boy makes a rude gesture at security men. They high-five. The boys clamber over rooftops and through slum alleyways. Security men chase them, struggling through narrow streets. Some boys throw rubbish at the guards. A guard chases Salim and Jamal past a rubbish-filled river. The boys run along a sewage pipe, followed by the guard. They collide with a Mercedes. Javed, a gangster, shouts angrily. The boys run off as the guard collides with the car, backing away apologetically. The boys taunt the guard, turn a corner, and run into their mother, who drags them to school."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "In the dimly lit confines of an interrogation room, a corpulent policeman, with a stern expression, deliberately blows a thick cloud of cigarette smoke across the table, directly into the face of a terrified and visibly sweating young male prisoner. This prisoner, known as Jamal Malik, blinks rapidly, his eyes stinging from the acrid smoke. Without warning, the policeman suddenly lunges aggressively across the table. At this moment, a question appears on the screen. Hands hurriedly scatter Rupee notes onto the floor. The host of the show turns his attention to Jamal, who is standing nervously in the wings of the studio. Together, Jamal and the host walk with purpose to their designated chairs, which are positioned prominently at the center of the studio stage. Meanwhile, back in the oppressive atmosphere of the police cell, the policeman forcefully plunges Jamal's head into a bucket filled with water. Elsewhere, a beautiful young woman stands gracefully on a train platform. She looks up, her face breaking into a warm smile. The inspector enters a room where Jamal is cruelly suspended off the floor by his wrists. Srinivas, with evident reluctance, sets up a car battery with jump leads beneath Jamal's dangling feet. With a heavy heart, Srinivas attaches the jump leads to each of Jamal's big toes. Jamal, defiant, glares directly into the eyes of the inspector. The inspector then moves deliberately to the other side of the room, as Srinivas switches on the battery. The inspector approaches Jamal's now limp body once more and notices that Jamal's eyes are closed and that he is dribbling. The inspector leans in to look closely at his face. Jamal stares back. Both policemen slowly turn their attention toward Jamal. He defiantly spits blood. In a different scene, a group of scruffy young boys, dressed in filthy t-shirts and shorts, energetically play cricket on a runway. Jamal, seen here as a young boy, trips and fails to catch the ball. The other boys, frustrated, slap their heads. They brandish long truncheons. Suddenly, the gang of boys disperses in all directions. Another boy turns to make a rude gesture at the security men. They clap a high-five in triumph. The boys clamber across a rubbish tip, up over corrugated rooftops, and down into the narrow alleyways of their slum. The security men dismount and give chase on foot. The security guards struggle to keep up with the tiny boys as they wind and weave through the filthy, narrow streets between shanty buildings. Some boys mischievously throw rubbish from the roofs onto the heads of the guards. A determined guard perseveres in chasing Salim and Jamal down a walkway and past a river swollen with rubbish, plastic bags, and green slime. The boys sprint along a sewage pipe, with the guard hot on their heels. The boys run headlong into a Mercedes. Inside, Javed, the local gangster, sits in the back, shouting angrily at the boys. The boys quickly run off as the guard then collides with the car. He backs away apologetically, holding his cap in hand. The boys taunt the guard, turn a corner, and suddenly run into their mother. She promptly drags the boys to school."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Within the dimly lit and somewhat claustrophobic confines of an interrogation room, a corpulent police officer with a particularly stern and unyielding expression deliberately exhales a thick and lingering cloud of cigarette smoke. This smoke drifts slowly across the table, directed aggressively into the face of a terrified young male prisoner who is visibly sweating from both fear and pressure. This prisoner, identified as Jamal Malik, blinks rapidly, his eyes irritatingly stinging from the acrid smoke filling the air. Without any preamble or warning, the policeman suddenly lunges aggressively across the table, causing Jamal to flinch. At this critical moment, a question suddenly appears on the screen. Hands anxiously scatter Rupee notes onto the floor in haste. The host of the show then turns his attention toward Jamal, who is standing nervously and with much apprehension in the wings of the studio. Together, Jamal and the host walk with deliberate purpose to reach their assigned chairs, which are prominently positioned at the very center of the studio stage. Meanwhile, back within the oppressive and stifling atmosphere of the police cell, the policeman forcefully plunges Jamal’s head into a bucket filled with water, further intensifying the situation. Elsewhere, a beautiful young woman stands gracefully on a train platform, her presence serene and captivating. She looks upward, her face breaking into a warm, radiant smile. The inspector then enters a room where Jamal is cruelly suspended off the floor by his wrists, creating a grim and harrowing scene. Srinivas, filled with evident reluctance, sets up a car battery with jump leads situated beneath Jamal’s dangling feet. With a heavy heart weighing on him, Srinivas attaches the jump leads to each of Jamal’s big toes, knowing what will come next. Jamal, unyielding and defiant, glares directly into the eyes of the inspector, showing no sign of submission. The inspector then moves deliberately and methodically to the other side of the room, as Srinivas switches on the battery, initiating its ominous hum. The inspector approaches Jamal's now limp and unresponsive body once more and notices that Jamal’s eyes are closed, and he is dribbling, indicating his weakened state. The inspector leans in to look more closely at Jamal’s face, trying to assess the damage. Jamal stares back, his resolve unbroken. Both policemen slowly and cautiously turn their attention toward Jamal once again. He defiantly spits blood, mirroring his indomitable spirit. In a different and equally dynamic scene, a group of scruffy young boys, dressed in filthy t-shirts and shorts, energetically play cricket on a bustling runway. Jamal, seen here as a young boy, trips and fails to catch the ball, evoking frustration from the other boys. They express their exasperation by slapping their heads in unison. They brandish long truncheons, ready for action. Suddenly, the gang of boys disperses chaotically in all directions. Another boy brazenly turns to make a rude gesture at the approaching security men. The boys then clap a high-five in triumph, celebrating their small victory. The boys clamber across a rubbish tip, up over corrugated rooftops, and down into the narrow and winding alleyways of their crowded slum. The security men dismount from their vehicles and give chase on foot, struggling to keep up. The security guards find it difficult to match the speed and agility of the tiny boys as they wind and weave through the filthy, narrow streets between shanty buildings. Some boys mischievously throw rubbish from the rooftops onto the heads of the guards, adding to the chaos. A determined guard persists in chasing Salim and Jamal down a narrow walkway and past a river swollen with rubbish, plastic bags, and unsightly green slime. The boys sprint fearlessly along a sewage pipe, with the guard barely managing to stay close on their heels. The boys run headlong into a parked Mercedes. Inside, Javed, the notorious local gangster, sits in the back, shouting angrily at the boys. The boys quickly run off, sensing danger, as the guard then collides with the car. He backs away apologetically, holding his cap in hand and bowing slightly. The boys taunt the guard, take a sharp corner, and suddenly run into their unsuspecting mother. She promptly, and without hesitation, drags the boys to school, ensuring they fulfill their responsibilities."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "In the dimly lit interrogation room, a corpulent policeman inhales deeply from his cigarette, then deliberately exhales a thick cloud of smoke across the table, directing it into the face of a terrified, sweating young male prisoner. The prisoner, Jamal Malik, reacts instinctively, blinking rapidly as the acrid smoke stings his eyes, causing them to water. Without warning, the policeman lunges aggressively across the table, his sudden movement creating a tense atmosphere. A question appears on the screen, momentarily shifting the scene. Hands hurriedly scatter Rupee notes onto the floor, creating a chaotic display of currency. The show's host, standing in the wings of the studio, turns his attention to Jamal. Together, Jamal and the host walk with purpose to their designated chairs, which are positioned prominently at the center of the studio stage, ready for the show to commence. The scene shifts back to the police cell, where the policeman, with a forceful grip, plunges Jamal's head into a bucket of water, submerging him completely. Meanwhile, on a train platform, a beautiful young woman stands, her eyes scanning the horizon before she looks up and smiles, her expression full of hope. The inspector enters a different room, where Jamal is suspended off the floor by his wrists, his body hanging helplessly. Srinivas, with visible reluctance, sets up a car battery on the floor beneath Jamal's dangling feet, carefully arranging the jump leads. With a sense of foreboding, Srinivas attaches the jump leads to each of Jamal's big toes, ensuring a secure connection. Jamal, despite his predicament, glares defiantly into the eyes of the inspector, his gaze unwavering. The inspector, maintaining a composed demeanor, moves to the other side of the room, giving Srinivas the signal to switch on the battery. As the current flows, the inspector approaches Jamal's now limp body once more, observing that Jamal's eyes are closed and that he's dribbling, a sign of his weakened state. The inspector leans in, scrutinizing Jamal's face closely. Jamal, regaining some composure, stares back at the inspector. Both policemen, sensing a change, turn slowly toward Jamal, who defiantly spits blood, a testament to his resilience. In a different scene, a group of scruffy young boys, clad in filthy t-shirts and shorts, energetically play cricket on a runway. Among them, a young Jamal, full of youthful exuberance, trips and fails to catch the ball, prompting the other boys to slap their heads in frustration. They brandish long truncheons, a symbol of their rough play. Suddenly, the gang of boys disperses in all directions, their movements quick and chaotic. Another boy, with a mischievous grin, turns to make a rude gesture at the security men, who respond by clapping a high-five, amused by the boy's audacity. The boys, agile and quick, clamber across a rubbish tip, scaling corrugated rooftops and descending into the narrow alleyways of their slum, their familiarity with the terrain evident. The security men, determined to catch them, dismount and give chase on foot, struggling to keep up with the tiny boys as they wind and weave through the filthy, narrow streets between shanty buildings. Some boys, taking advantage of their elevated position, throw rubbish from the roofs onto the heads of the pursuing guards, adding to the chaos. A particularly determined guard perseveres, chasing Salim and Jamal down a walkway and past a river swollen with rubbish, plastic bags, and green slime, the stench almost palpable. The boys, undeterred, run along a sewage pipe, the guard hot on their heels, his determination unwavering. In their haste, the boys run headlong into a Mercedes, the impact jarring. Inside the car, Javed, the local gangster, sits in the back, his face contorted with anger as he shouts at the boys, his voice booming. The boys, sensing danger, quickly run off, leaving the guard to collide with the car. Realizing his mistake, the guard backs away apologetically, holding his cap in hand as a gesture of contrition. The boys, emboldened by their escape, taunt the guard before turning a corner, only to suddenly run into their mother, whose stern expression leaves no room for argument. She grabs them firmly, dragging the boys to school, her grip unyielding as she leads them away from their mischief."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "In an interrogation room, a corpulent policeman blows cigarette smoke into the face of a terrified, sweating young prisoner, Jamal Malik, who blinks rapidly as the smoke stings his eyes. The policeman lunges across the table as a question appears on the screen, and Rupee notes scatter onto the floor. The show's host turns to Jamal, and they walk to their chairs at the center of the studio stage. Back in the police cell, the policeman forces Jamal's head into a bucket of water. Meanwhile, a beautiful young woman smiles on a train platform. The inspector enters a room where Jamal is suspended by his wrists, and Srinivas reluctantly sets up a car battery with jump leads beneath Jamal's feet, attaching them to his toes. Jamal glares at the inspector, who moves aside as Srinivas switches on the battery. The inspector approaches Jamal's limp body, noticing his closed eyes and dribbling, and looks closely at his face. Jamal stares back and spits blood as both policemen turn toward him. \n\nA group of scruffy young boys, including a young Jamal, play cricket on a runway. Jamal trips and fails to catch the ball, prompting the other boys to slap their heads. They brandish truncheons and suddenly disperse as security men approach. One boy makes a rude gesture, and they clap a high-five before clambering across a rubbish tip, over rooftops, and into the narrow slum alleyways. The security men give chase but struggle to follow the boys through the filthy streets. Some boys throw rubbish from the roofs onto the guards' heads. A determined guard chases Salim and Jamal along a walkway past a rubbish-filled river. The boys run along a sewage pipe, pursued closely by the guard, and collide with a Mercedes. Javed, a local gangster, shouts angrily from the backseat. The boys run off as the guard apologetically backs away from the car, holding his cap. The boys taunt the guard, turn a corner, and run into their mother, who drags them to school."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "In an interrogation room within a bustling city police station, a corpulent policeman blows cigarette smoke across the table into the face of a terrified, sweating, young male prisoner. The prisoner, Jamal Malik, who recently won public attention by becoming a contestant on a popular television quiz show in India, blinks rapidly as the smoke stings his eyes. The policeman suddenly lunges across the table with a menacing glare. A question from the show's final round appears on the screen, its high stakes known to millions of viewers. Hands scatter Rupee notes, India's currency, onto the floor. The show's host, renowned for his charismatic yet intimidating persona, turns to Jamal, standing in the wings of the studio. Jamal and the host walk to their chairs positioned at the center of the studio stage, under the intense glare of studio lights. Back in the police cell, the policeman forces Jamal's head into a bucket of water, a brutal method often employed to extract confessions. A beautiful young woman stands on a train platform in Mumbai, the city known for its bustling railway network. She looks up and smiles, her face filled with hope and longing. The inspector enters a room where Jamal is suspended off the floor by his wrists, a distressing scene reminiscent of human rights abuses. Srinivas reluctantly sets up a car battery with jump leads beneath Jamal's dangling feet, the use of electricity to cause pain a dark reality in some interrogations. Srinivas attaches the jump leads to each of Jamal's big toes, his hands trembling slightly. Jamal glares directly into the eyes of the inspector, a silent act of defiance. The inspector moves to the other side of the room, as Srinivas, with a pained expression, switches on the battery. The inspector approaches the now limp body of Jamal again and notices that Jamal's eyes are closed and that he's dribbling, a result of the extreme duress he has endured. The inspector looks closely at his face, searching for signs of consciousness. Jamal stares with unwavering intensity. Both the policemen turn slowly toward Jamal, sensing a change in his demeanor. He spits blood, a grim reminder of his resilience. A group of scruffy young boys in filthy t-shirts and shorts play cricket on a runway, an improvised pitch in the midst of their impoverished neighborhood. Jamal, seen as a young boy here, trips and fails to catch the ball, typical of their carefree games. The other boys slap their heads in playful exasperation. They brandish long truncheons, likely scavenged from discarded materials. The gang of boys suddenly disperses in all directions, a practiced response to approaching trouble. Another boy turns to make a rude gesture at the security men, defiance etched in his youthful features. They clap a high-five, celebrating their brief victory. The boys clamber across a rubbish tip, up over corrugated rooftops and down into the narrow alleyways of their slum, a sprawling settlement rife with poverty. The security men dismount from their cycles and give chase on foot, shouting commands. The security guards, hampered by the maze-like environment, struggle to follow the tiny boys as they wind and weave through the filthy, narrow streets between shanty buildings. Some boys throw rubbish from the roofs onto the heads of the guards below, laughing at their predicament. A determined guard perseveres in chasing Salim and Jamal down a walkway and past a river swollen with rubbish, plastic bags, and green slime, a toxic stream emblematic of urban neglect. The boys run along a sewage pipe, balancing precariously, followed by the guard hot on their heels. The boys run headlong into a Mercedes, a stark contrast to their surroundings. Javed, the notorious local gangster whose influence looms large over the community, sits in the back, shouting and angry at the boys. The boys run off as the guard then collides with the car, flustered by the encounter. He backs away apologetically, holding his cap in hand, aware of Javed's fearsome reputation. The boys taunt the guard, turn a corner, and suddenly run into their mother, a woman of resilience and strength. She drags the boys to school, determined to see them educated despite the challenges of their upbringing."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "In an interrogation room a corpulent policeman blows cigarette smoke across the table into the face of a terrified sweating young male prisoner  The prisoner Jamal  Malik blinks rapidly as the smoke stings his eyes  The policeman suddenly lunges across the table  A question appears on the screen  Hands scatter  Rupee notes onto the floor  Both the policemen turn slowly toward Jamal  He spits blood  A group of scruffy young boys in filthy tshirts and shorts play cricket on a runway  Jamal seen as a young boy here trips and fails to catch the ball  The other boys slap their heads  They brandish long truncheons  The gang of boys suddenly disperses in all directions  Another boy turns to make a rude gesture at the security men  They clap a highfive  The boys clamber across a rubbish tip up over corrugated rooftops and down into the narrow alleyways of their slum  The security men dismount and give chase on foot  The security guards struggle to follow the tiny boys as they wind and weave through the filthy narrow streets between shanty buildings  Some boys throw rubbish from the roofs onto the heads of the guards  A determined guard perseveres in chasing Salim and Jamal down a walkway and past a river swollen with rubbish plastic bags and green slime  The boys run along a sewage pipe followed by the guard hot on their heels  The boys run headlong into a Mercedes  Javed the local gangster sits in the back shouting and angry at the boys  The boys run off as the guard then collides with the car  He backs away apologetically holding his cap in hand  The boys taunt the guard turn a corner and suddenly run into their mother  She drags the boys to school The show's host turns to Jamal standing in the wings of the studio  Jamal and the host walk to their chairs positioned at the center of the studio stage  Back in the police cell the policeman forces Jamal's head into a bucket of water  A beautiful young woman stands on a train platform  She looks up and smiles  The inspector enters a room where Jamal is suspended off the floor by his wrists  Srinivas reluctantly sets up a car battery with jump leads beneath Jamal's dangling feet  Srinivas attaches the jump leads to each of Jamal's big toes  Jamal glares directly into the eyes of the inspector  The inspector moves to the other side of the room as Srinivas switches on the battery  The inspector approaches the now limp body of Jamal again and notices that Jamal's eyes are closed and that he's dribbling  The inspector looks closely at his face  Jamal stares  Both the policemen turn slowly toward Jamal  He spits blood  A group of scruffy young boys in filthy tshirts and shorts play cricket on a runway  Jamal seen as a young boy here trips and fails to catch the ball  The other boys slap their heads  They brandish long truncheons  The gang of boys suddenly disperses in all directions  Another boy turns to make a rude gesture at the security men  They clap a highfive  The boys clamber across a rubbish tip up over corrugated rooftops and down into the narrow alleyways of their slum  The security men dismount and give chase on foot  The security guards struggle to follow the tiny boys as they wind and weave through the filthy narrow streets between shanty buildings  Some boys throw rubbish from the roofs onto the heads of the guards  A determined guard perseveres in chasing Salim and Jamal down a walkway and past a river swollen with rubbish plastic bags and green slime  The boys run along a sewage pipe followed by the guard hot on their heels  The boys run headlong into a Mercedes  Javed the local gangster sits in the back shouting and angry at the boys  The boys run off as the guard then collides with the car  He backs away apologetically holding his cap in hand  The boys taunt the guard turn a corner and suddenly run into their mother  She drags the boys to school"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "In an interrogation room a corpulent policeman blows cigarette smoke across the table into the face of a terrified sweating young male prisoner. The prisoner Jamal. Malik blinks rapidly as the smoke stings his eyes. The policeman suddenly lunges across the table. A question appears on the screen. Hands scatter. Rupee notes onto the floor. The show's host turns to Jamal standing in the wings of the studio. Jamal and the host walk to their chairs positioned at the center of the studio stage. Back in the police cell the policeman forces Jamal's head into a bucket of water. A beautiful young woman stands on a train platform. She looks up and smiles. The inspector enters a room where Jamal is suspended off the floor by his wrists. Srinivas reluctantly sets up a car battery with jump leads beneath Jamal's dangling feet. Srinivas attaches the jump leads to each of Jamal's big toes. Jamal glares directly into the eyes of the inspector. The inspector moves to the other side of the room as Srinivas switches on the battery. The inspector approaches the now limp body of Jamal again and notices that Jamal's eyes are closed and that he is dribbling. The inspector looks closely at his face. Jamal stares. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. Both the policemen turn slowly toward Jamal. He spits blood. A group of scruffy young boys in filthy tshirts and shorts play cricket on a runway. Jamal seen as a young boy here trips and fails to catch the ball. The other boys slap their heads. They brandish long truncheons. The gang of boys suddenly disperses in all directions. Another boy turns to make a rude gesture at the security men. They clap a highfive. The boys clamber across a rubbish tip up over corrugated rooftops and down into the narrow alleyways of their slum. The security men dismount and give chase on foot. The security guards struggle to follow the tiny boys as they wind and weave through the filthy narrow streets between shanty buildings. Some boys throw rubbish from the roofs onto the heads of the guards. A determined guard perseveres in chasing Salim and Jamal down a walkway and past a river swollen with rubbish plastic bags and green slime. The boys run along a sewage pipe followed by the guard hot on their heels. The boys run headlong into a Mercedes. Javed the local gangster sits in the back shouting and angry at the boys. The boys run off as the guard then collides with the car. He backs away apologetically holding his cap in hand. The boys taunt the guard turn a corner and suddenly run into their mother. She drags the boys to school."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "In an interrogation room a corpulent policeman blows cigarette smoke across the table into the face of a terrified sweating young male prisoner. The prisoner Jamal. Malik blinks rapidly as the smoke stings his eyes. The policeman suddenly lunges across the table. A question appears on the screen. Hands scatter. Rupee notes onto the floor. The show's host turns to Jamal standing in the wings of the studio. Jamal and the host walk to their chairs positioned at the center of the studio stage. Back in the police cell the policeman forces Jamal's head into a bucket of water. A beautiful young woman stands on a train platform. She looks up and smiles. The inspector enters a room where Jamal is suspended off the floor by his wrists. Srinivas reluctantly sets up a car battery with jump leads beneath Jamal's dangling feet. Srinivas attaches the jump leads to each of Jamal's big toes. Jamal glares directly into the eyes of the inspector. The inspector moves to the other side of the room as Srinivas switches on the battery. The inspector approaches the now limp body of Jamal again and notices that Jamal's eyes are closed and that he is dribbling. The inspector looks closely at his face. Jamal stares. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. Both the policemen turn slowly toward Jamal. He spits blood. A group of scruffy young boys in filthy tshirts and shorts play cricket on a runway. Jamal seen as a young boy here trips and fails to catch the ball. The other boys slap their heads. They brandish long truncheons. The gang of boys suddenly disperses in all directions. Another boy turns to make a rude gesture at the security men. They clap a highfive. The boys clamber across a rubbish tip up over corrugated rooftops and down into the narrow alleyways of their slum. The security men dismount and give chase on foot. The security guards struggle to follow the tiny boys as they wind and weave through the filthy narrow streets between shanty buildings. Some boys throw rubbish from the roofs onto the heads of the guards. A determined guard perseveres in chasing Salim and Jamal down a walkway and past a river swollen with rubbish plastic bags and green slime. The boys run along a sewage pipe followed by the guard hot on their heels. The boys run headlong into a Mercedes. Javed the local gangster sits in the back shouting and angry at the boys. The boys run off as the guard then collides with the car. He backs away apologetically holding his cap in hand. The boys taunt the guard turn a corner and suddenly run into their mother. She drags the boys to school."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "In an interrogation room a corpulent policeman blows cigarette smoke across the table into the face of a terrified sweating young male prisoner. The prisoner Jamal. Malik blinks rapidly as the smoke stings his eyes. The policeman suddenly lunges across the table. A question appears on the screen. Hands scatter. Rupee notes onto the floor. The show's host turns to Jamal standing in the wings of the studio. Jamal and the host walk to their chairs positioned at the center of the studio stage. Back in the police cell the policeman forces Jamal's head into a bucket of water. The security men dismount and give chase on foot. The security guards struggle to follow the tiny boys as they wind and weave through the filthy narrow streets between shanty buildings. Some boys throw rubbish from the roofs onto the heads of the guards. A determined guard perseveres in chasing Salim and Jamal down a walkway and past a river swollen with rubbish plastic bags and green slime. The boys run along a sewage pipe followed by the guard hot on their heels. The boys run headlong into a Mercedes. Javed the local gangster sits in the back shouting and angry at the boys. The boys run off as the guard then collides with the car. He backs away apologetically holding his cap in hand. The boys taunt the guard turn a corner and suddenly run into their mother. She drags the boys to school."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "In an interrogation room a corpulent policeman blows cigarette smoke across the table into the face of a terrified sweating young male prisoner. The prisoner Jamal. Malik blinks rapidly as the smoke stings his eyes. The policeman suddenly lunges across the table. Javed the local gangster sits in the back shouting and angry at the boys. The boys run off as the guard then collides with the car. He backs away apologetically holding his cap in hand. The boys taunt the guard turn a corner and suddenly run into their mother. She drags the boys to school."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "In an interrogation room, a pensive librarian blows cigarette smoke across the table into the face of a terrified, sweating, young male prisoner. The prisoner, Jamal Malik, blinks rapidly as the smoke stings his eyes. The librarian suddenly lunges across the table. A question appears on the screen. Hands scatter Rupee notes onto the floor. The show's director turns to Jamal, standing in the wings of the studio. Jamal and the director walk to their chairs positioned at the center of the studio stage. Back in the police cell, the librarian forces Jamal's head into a bucket of water. A graceful young dancer stands on a train platform. She looks up and smiles. The baker enters a room where Jamal is suspended off the floor by his wrists. Srinivas reluctantly sets up a car battery with jump leads beneath Jamal's dangling feet. Srinivas attaches the jump leads to each of Jamal's big toes. Jamal glares directly into the eyes of the baker. The baker moves to the other side of the room, as Srinivas switches on the battery. The baker approaches the now limp body of Jamal again and notices that Jamal's eyes are closed and that he's dribbling. The baker looks closely at his face. Jamal stares. Both the librarians turn slowly toward Jamal. He spits blood. A group of scruffy young artists in filthy t-shirts and shorts play cricket on a runway. Jamal, seen as a young boy here, trips and fails to catch the ball. The other artists slap their heads. They brandish long truncheons. The gang of artists suddenly disperses in all directions. Another artist turns to make a rude gesture at the security men. They clap a high-five. The artists clamber across a rubbish tip, up over corrugated rooftops and down into the narrow alleyways of their slum. The security men dismount and give chase on foot. The security guards struggle to follow the tiny artists as they wind and weave through the filthy, narrow streets between shanty buildings. Some artists throw rubbish from the roofs onto the heads of the guards. A determined guard perseveres in chasing Salim and Jamal down a walkway and past a river swollen with rubbish, plastic bags, and green slime. The artists run along a sewage pipe, followed by the guard hot on their heels. The artists run headlong into a Mercedes. Javed, the local shopkeeper, sits in the back, shouting and angry at the artists. The artists run off as the guard then collides with the car. He backs away apologetically, holding his cap in hand. The artists taunt the guard, turn a corner, and suddenly run into their teacher. She drags the artists to school."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "In a drafting room, a corpulent policeman blows bubblegum bubbles across the table into the face of a terrified, sweating, young male prisoner. The prisoner, Jamal Malik, blinks rapidly as the bubbles pop near his eyes. The policeman suddenly lunges across the table. A question appears on the canvas. Hands scatter poker chips onto the floor. The show's host turns to Jamal, standing in the wings of the arena. Jamal and the host walk to their recliners positioned at the center of the arena stage. Back in the police kennel, the policeman forces Jamal's head into a bucket of sand. A beautiful young woman stands on a ship deck. She looks up and smiles. The inspector enters a chamber where Jamal is suspended off the floor by his wrists. Srinivas reluctantly sets up a generator with power lines beneath Jamal's dangling feet. Srinivas attaches the power lines to each of Jamal's big toes. Jamal glares directly into the eyes of the inspector. The inspector moves to the other side of the chamber, as Srinivas switches on the generator. The inspector approaches the now limp body of Jamal again and notices that Jamal's eyes are closed and that he's drooling. The inspector looks closely at his face. Jamal stares. Both the policemen turn slowly toward Jamal. He spits ink. A group of scruffy young boys in filthy jeans and tank tops play soccer on a helipad. Jamal, seen as a young boy here, trips and fails to kick the ball. The other boys slap their heads. They brandish wooden sticks. The gang of boys suddenly disperses in all directions. Another boy turns to make a rude gesture at the security guards. They clap a fist-bump. The boys clamber across a construction site, up over tarpaulin rooftops and down into the narrow pathways of their settlement. The security guards dismount and give chase on foot. The security guards struggle to follow the tiny boys as they wind and weave through the dirty, narrow streets between shanty structures. Some boys throw debris from the roofs onto the heads of the guards. A determined guard perseveres in chasing Salim and Jamal down a footbridge and past a canal swollen with debris, plastic wrappers, and brown sludge. The boys run along a drainage ditch, followed by the guard hot on their heels. The boys run headlong into a limousine. Javed, the local gangster, sits in the back, shouting and angry at the boys. The boys run off as the guard then collides with the vehicle. He backs away apologetically, holding his helmet in hand. The boys taunt the guard, turn a corner, and suddenly run into their mother. She drags the boys to the library."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "In an interrogation room, a corpulent policeman sips coffee across the table into the face of a terrified, sweating, young male prisoner. The prisoner, Jamal Malik, nods slowly as the coffee warms his eyes. The policeman suddenly falls across the table. A statement appears on the screen. Hands retrieve Rupee notes from the floor. The show's host gestures to Jamal, waiting in the wings of the studio. Jamal and the host skip to their chairs positioned at the center of the studio stage. Back in the police cell, the policeman pours water over Jamal's head into a bucket. A beautiful young woman stands on a train platform. She looks down and frowns. The inspector exits a room where Jamal sits off the floor by his wrists. Srinivas eagerly dismantles a car battery with jump leads beneath Jamal's dangling feet. Srinivas detaches the jump leads from each of Jamal's big toes. Jamal smirks directly into the eyes of the inspector. The inspector retreats to the other side of the room, as Srinivas switches off the battery. The inspector departs from the now limp body of Jamal again and notices that Jamal's eyes are open and that he's grinning. The inspector glances distantly at his face. Jamal winks. Both the policemen saunter slowly toward Jamal. He laughs softly. A group of scruffy young boys in filthy t-shirts and shorts juggle cricket balls on a runway. Jamal, seen as a young boy here, skips and succeeds to catch the ball. The other boys pat their heads. They twirl long truncheons. The gang of boys suddenly gathers in one direction. Another boy turns to make a polite gesture at the security men. They share a fist bump. The boys descend across a rubbish tip, down over corrugated rooftops and up into the narrow alleyways of their slum. The security men climb and lose pursuit on foot. The security guards navigate to follow the tiny boys as they pause and ponder through the clean, wide streets between shanty buildings. Some boys wave flags from the roofs onto the backs of the guards. A determined guard pauses in watching Salim and Jamal down a walkway and past a river adorned with flowers, plastic bags, and green slime. The boys slide along a sewage pipe, followed by the guard trailing behind. The boys walk calmly into a Mercedes. Javed, the local gangster, sits in the back, whispering and curious at the boys. The boys stroll off as the guard then glances at the car. He advances confidently, waving his cap in hand. The boys entertain the guard, turn a corner, and suddenly walk into their mother. She nudges the boys to school."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "In a greenhouse, a skinny librarian exhales perfume mist over the counter into the face of a jubilant, laughing, old female pianist. The pianist, Leo Carter, squints slowly as the mist tickles her nose. The librarian suddenly leaps over the counter. A statement appears on the curtain. Feet scatter Yen coins onto the ceiling. The chef's guest turns to Leo, sitting in the aisles of the library. Leo and the guest stroll to their benches positioned at the corner of the library section. Back in the greenhouse, the librarian immerses Leo's hand into a crate of milk. A handsome old man stands on a tram stop. He glances down and frowns. The technician enters a garden where Leo is hovering above the ceiling by her ankles. Patel cheerfully sets up a bicycle light with banana peels beneath Leo's swaying hands. Patel adheres the banana peels to each of Leo’s little fingers. Leo scowls directly into the nostrils of the technician. The technician drifts to the opposite side of the garden, as Patel activates the light. The technician approaches the now rigid form of Leo again and observes that Leo’s nostrils are open and that she’s singing. The technician peers closely at her nose. Leo gazes. Both the librarians rotate swiftly toward Leo. She coughs flowers. A cluster of well-dressed old girls in clean dresses and sashes play badminton on a balcony. Leo, glimpsed as an old girl here, stumbles and succeeds in catching the shuttle. The other girls shake their knees. They wave short umbrellas. The pack of girls swiftly gathers in a line. Another girl turns to offer a pleasant wave at the postal workers. They cheer a low-ten. The girls traverse over a flower bed, down past wooden fences and up onto the wide streets of their neighborhood. The postal workers embark and ride away on bicycles. The postal workers excel in trailing the massive girls as they dash and dart through the clean, wide pathways between luxurious buildings. Some girls toss flowers from the fences onto the shoulders of the workers. A discouraged worker lags behind in searching for Amir and Leo across a playground and through a river filled with jewels, cotton sheets, and pink perfume. The girls run beside a wooden cart, trailed by the worker right on their paths. The girls sprint headlong into a Toyota. Arif, the local coach, relaxes in the trunk, whispering and joyful at the girls. The girls leap about as the worker then skids into the cart. He steps forward confidently, balancing a shoe on head. The girls applaud the worker, round a tree, and swiftly climb with their teacher. She welcomes the girls to a cafe."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "In an interrogation room, an enormous parrot flaps its wings, sending cigarette smoke across the table into the face of a trembling, perspiring, young female botanist. The botanist, Daniel Harris, squints rapidly as the smoke pricks his eyes. The parrot suddenly flutters across the table. A joke appears on the screen. Feet scatter Rupee notes onto the floor. The show's clown turns to Daniel, hovering in the wings of the studio. Daniel and the clown shuffle to their seats positioned at the center of the studio stage. Back in the animal shelter, the parrot dips Daniel's head into a barrel of water. A graceful young dolphin floats on a train platform. She glances up and winks. The magician enters a circus tent where Daniel is suspended off the floor by his ankles. Vikram impatiently sets up a record player with jump leads beneath Daniel's swaying feet. Vikram affixes the jump leads to each of Daniel's elbows. Daniel flashes a smirk directly into the eyes of the magician. The magician glides to the other side of the tent, as Vikram turns on the record player. The magician ambles toward the now limp figure of Daniel again and observes that Daniel's eyes are closed and that he's snoring. The magician inspects closely at his face. Daniel glowers. Both the parrots twist slowly toward Daniel. He whistles a tune. A troop of scruffy young monkeys in tattered vests and trousers juggle tennis balls on a runway. Daniel, seen as a young monkey here, stumbles and misses the ball. The other monkeys facepalm. They wave long bananas. The troop of monkeys instantly scatters in all directions. Another monkey turns to make a silly dance at the park rangers. They exchange a high-five. The monkeys scramble across a garbage heap, up over corrugated rooftops and down into the narrow alleyways of their habitat. The rangers dismount and sprint on foot. The forest rangers grapple to trail the little monkeys as they slalom and twist through the grimy, narrow lanes between ramshackle structures. Some monkeys hurl garbage from the roofs onto the heads of the rangers. A tenacious ranger persists in chasing Raj and Daniel down a trail and past a river teeming with garbage, plastic bottles, and algae. The monkeys dash along a drainage culvert, tailed by the ranger close behind. The monkeys crash headlong into a bicycle. Rakesh, the local trickster, rides in the back, yelling and upset at the monkeys. The monkeys scurry away as the ranger then bumps into the bike. He retreats with a nod, clutching his helmet in hand. The monkeys jeer at the ranger, veer around a corner, and unexpectedly bump into their uncle. He escorts the monkeys to a library."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "In a cozy kitchen, a tall firefighter wafts incense smoke across the countertop into the face of a gleeful, giggling, young male dancer. The dancer, Jamal Malik, blinks slowly as the smoke tickles his nose. The firefighter suddenly dances across the countertop. A song plays on the radio. Fingers sprinkle confetti onto the carpet. The show's host nods to Jamal, standing in the wings of the auditorium. Jamal and the host skip to their pillows positioned at the center of the auditorium stage. Back in the dance studio, the firefighter dips Jamal's head into a pool of glitter. A graceful young woman stands on a theater stage. She looks down and laughs. The director enters a room where Jamal is hovering above the ground by his shoes. Srinivas eagerly sets up a drum set with cymbals beneath Jamal's dangling knees. Srinivas ties the cymbals to each of Jamal's knees. Jamal winks directly into the eyes of the director. The director drifts to the other side of the room, as Srinivas plays the drum set. The director approaches the now energetic body of Jamal again and notices that Jamal's eyes are wide open and that he's singing. The director listens closely to his voice. Jamal grins. Both the firefighters turn slowly toward Jamal. He spits confetti. A group of orderly young boys in crisp shirts and pants play marbles in a courtyard. Jamal, seen as a young boy here, stumbles and misses the marble. The other boys shake their fists. They wave tiny flags. The gang of boys suddenly gathers in all directions. Another boy turns to make a friendly wave at the security men. They exchange a handshake. The boys hop across a vegetable patch, up over tiled rooftops and down into the wide alleyways of their neighborhood. The security men mount bicycles and ride slowly. The security guards enjoy following the tiny boys as they wander and parade through the clean, wide streets between solid buildings. Some boys toss streamers from the roofs onto the shoes of the guards. A patient guard perseveres in watching Salim and Jamal down a boulevard and past a river teeming with flowers, paper boats, and crystal water. The boys walk along a garden path, accompanied by the guard ambling behind them. The boys walk leisurely into a Volkswagen. Javed, the local baker, sits in the back, laughing and cheering at the boys. The boys walk off as the guard then gently taps the car. He waves cheerfully, adjusting his cap. The boys greet the guard, turn a corner, and suddenly walk into their father. He escorts the boys to the market."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "In a greenhouse, an emaciated gardener exhales bubble gum bubbles across the counter into the face of a delighted, giggling, old female performer. The performer, Lucy Watkins, sneezes repeatedly as the bubbles tickle her nose. The gardener abruptly dances across the counter. A riddle flashes on the billboard. Feet scatter Pebble stones onto the roof. The show's pianist turns to Lucy, lounging in the barn of the theater. Lucy and the pianist waltz to their trampolines positioned at the edge of the theater tent. Back in the guard post, the gardener dips Lucy's elbow into a cauldron of lemonade. A handsome old man stands on a raft. He glances down and grins. The librarian exits a cave where Lucy is swinging above the grass by her ankles. Morgan reluctantly sets up a windmill with ribbons beneath Lucy’s swaying knees. Morgan ties the ribbons to each of Lucy's pinky fingers. Lucy squints directly into the eyebrows of the librarian. The librarian strolls to the opposite corner of the cave, as Morgan activates the windmill. The librarian returns to the now giggling form of Lucy again and notices that Lucy’s ears are plugged and that she's humming. The librarian peers closely at her chin. Lucy winces. Both the gardeners pivot slowly toward Lucy. She giggles confetti. A swarm of tidy old men in immaculate suits and ties play golf on a rooftop. Lucy, seen as a senior woman here, stumbles and misses the hole. The other men shake their knees. They wave tiny flags. The troupe of men gradually gathers in all directions. Another man turns to make a polite bow at the tourists. They exchange a handshake. The men leap across a bouncy castle, up through velvet tunnels and down into the wide passageways of their library. The tourists disembark and waddle toward the water on stilts. The tourists marvel to glimpse the giant men as they twist and leap through the tidy, wide corridors between mural walls. Some men toss balloons from the ceilings onto the feet of the tourists. A sleepy tourist falters in marveling at Morgan and Lucy inside a balloon and across a river filled with petals, paper boats, and clear water. The men skip along a garden wall, trailed by the tourist close on their toes. The men hop suddenly into a bicycle. Dante, the local hero, lounges in the front, smiling and pleased at the men. The men bounce away as the tourist then glances at the bicycle. He edges forward cheerfully, tipping his hat in affirmation. The men mock the tourist, round a fence, and immediately skip into their teacher. She leads the men to dance class."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "In an interrogation room, a policeman blows smoke at Jamal Malik, a nervous young prisoner. As Jamal endures harsh treatment, including head-dunking and electric shocks, the scene shifts to a game show stage where he stands with the host. A beautiful woman smiles on a train platform. Young Jamal plays cricket on a runway with friends, chased by security guards. The boys run through their slum, throwing rubbish at the guards. A determined guard chases Jamal and Salim, who escape over rooftops and along sewage pipes. They collide with a Mercedes carrying local gangster Javed, before fleeing and being caught by their mother, who takes them to school."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "She drags the boys to school The boys taunt the guard turn a corner and suddenly run into their mother  He backs away apologetically holding his cap in hand  The boys run off as the guard then collides with the car  Javed the local gangster sits in the back shouting and angry at the boys  The boys run headlong into a Mercedes  The boys run along a sewage pipe followed by the guard hot on their heels  A determined guard perseveres in chasing Salim and Jamal down a walkway and past a river swollen with rubbish plastic bags and green slime  Some boys throw rubbish from the roofs onto the heads of the guards  The security guards struggle to follow the tiny boys as they wind and weave through the filthy narrow streets between shanty buildings  The security men dismount and give chase on foot  The boys clamber across a rubbish tip up over corrugated rooftops and down into the narrow alleyways of their slum  They clap a highfive  Another boy turns to make a rude gesture at the security men  The gang of boys suddenly disperses in all directions  They brandish long truncheons  The other boys slap their heads  Jamal seen as a young boy here trips and fails to catch the ball  A group of scruffy young boys in filthy tshirts and shorts play cricket on a runway  He spits blood  Both the policemen turn slowly toward Jamal  Jamal stares  The inspector looks closely at his face  The inspector approaches the now limp body of Jamal again and notices that Jamal's eyes are closed and that he's dribbling  The inspector moves to the other side of the room as Srinivas switches on the battery  Jamal glares directly into the eyes of the inspector  Srinivas attaches the jump leads to each of Jamal's big toes  Srinivas reluctantly sets up a car battery with jump leads beneath Jamal's dangling feet  The inspector enters a room where Jamal is suspended off the floor by his wrists  She looks up and smiles  A beautiful young woman stands on a train platform  Back in the police cell the policeman forces Jamal's head into a bucket of water  Jamal and the host walk to their chairs positioned at the center of the studio stage  The show's host turns to Jamal standing in the wings of the studio  Rupee notes onto the floor  Hands scatter  A question appears on the screen  The policeman suddenly lunges across the table  Malik blinks rapidly as the smoke stings his eyes  The prisoner Jamal  In an interrogation room a corpulent policeman blows cigarette smoke across the table into the face of a terrified sweating young male prisoner "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Srinivas attaches the jump leads to each of Jamal's big toes  Jamal glares directly into the eyes of the inspector  Srinivas reluctantly sets up a car battery with jump leads beneath Jamal's dangling feet  In an interrogation room a corpulent policeman blows cigarette smoke across the table into the face of a terrified sweating young male prisoner  Some boys throw rubbish from the roofs onto the heads of the guards  The inspector enters a room where Jamal is suspended off the floor by his wrists  Another boy turns to make a rude gesture at the security men  Jamal and the host walk to their chairs positioned at the center of the studio stage  They brandish long truncheons  The security men dismount and give chase on foot  The security guards struggle to follow the tiny boys as they wind and weave through the filthy narrow streets between shanty buildings  A beautiful young woman stands on a train platform  The boys run off as the guard then collides with the car  A question appears on the screen  Jamal seen as a young boy here trips and fails to catch the ball  The policeman suddenly lunges across the table  They clap a highfive  He spits blood  The boys run headlong into a Mercedes  A determined guard perseveres in chasing Salim and Jamal down a walkway and past a river swollen with rubbish plastic bags and green slime  The prisoner Jamal  Javed the local gangster sits in the back shouting and angry at the boys  The boys taunt the guard turn a corner and suddenly run into their mother  Rupee notes onto the floor  The inspector looks closely at his face  She looks up and smiles  Jamal stares  Both the policemen turn slowly toward Jamal  The gang of boys suddenly disperses in all directions  Back in the police cell the policeman forces Jamal's head into a bucket of water  The inspector approaches the now limp body of Jamal again and notices that Jamal's eyes are closed and that he's dribbling  Hands scatter  The other boys slap their heads  The show's host turns to Jamal standing in the wings of the studio  The boys run along a sewage pipe followed by the guard hot on their heels  The boys clamber across a rubbish tip up over corrugated rooftops and down into the narrow alleyways of their slum  Malik blinks rapidly as the smoke stings his eyes  The inspector moves to the other side of the room as Srinivas switches on the battery  He backs away apologetically holding his cap in hand  She drags the boys to school A group of scruffy young boys in filthy tshirts and shorts play cricket on a runway "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "He spits blood  A group of scruffy young boys in filthy tshirts and shorts play cricket on a runway  Jamal seen as a young boy here trips and fails to catch the ball  The other boys slap their heads  They brandish long truncheons  The gang of boys suddenly disperses in all directions  Another boy turns to make a rude gesture at the security men  They clap a highfive  The boys clamber across a rubbish tip up over corrugated rooftops and down into the narrow alleyways of their slum  The security men dismount and give chase on foot  The security guards struggle to follow the tiny boys as they wind and weave through the filthy narrow streets between shanty buildings  Some boys throw rubbish from the roofs onto the heads of the guards  A determined guard perseveres in chasing Salim and Jamal down a walkway and past a river swollen with rubbish plastic bags and green slime  The boys run along a sewage pipe followed by the guard hot on their heels  The boys run headlong into a Mercedes  Javed the local gangster sits in the back shouting and angry at the boys  The boys run off as the guard then collides with the car  He backs away apologetically holding his cap in hand  The boys taunt the guard turn a corner and suddenly run into their mother  She drags the boys to school In an interrogation room a corpulent policeman blows cigarette smoke across the table into the face of a terrified sweating young male prisoner  The prisoner Jamal  Malik blinks rapidly as the smoke stings his eyes  The policeman suddenly lunges across the table  A question appears on the screen  Hands scatter  Rupee notes onto the floor  The show's host turns to Jamal standing in the wings of the studio  Jamal and the host walk to their chairs positioned at the center of the studio stage  Back in the police cell the policeman forces Jamal's head into a bucket of water  A beautiful young woman stands on a train platform  She looks up and smiles  The inspector enters a room where Jamal is suspended off the floor by his wrists  Srinivas reluctantly sets up a car battery with jump leads beneath Jamal's dangling feet  Srinivas attaches the jump leads to each of Jamal's big toes  Jamal glares directly into the eyes of the inspector  The inspector moves to the other side of the room as Srinivas switches on the battery  The inspector approaches the now limp body of Jamal again and notices that Jamal's eyes are closed and that he's dribbling  The inspector looks closely at his face  Jamal stares  Both the policemen turn slowly toward Jamal "
        }
      ]
    }
  ]
}