{
  "ground_truth": "Peter nods and stands there with a stupid smile and a blank expression; once again, he simply nods and turns to watch her go as she gives him a little wave, and with a dejected look on his face, Peter walks off down the street. Later, he enters the apartment he shares with Harry, where Norman Osborne is on the phone. Peter saunters over to Harry, who looks up at him before looking a little sheepish as he turns to them both and reads the Bugle's reward for a Spider-Man photo. An armored car hoist ensues, with a camera suspended in a web, and Spider-Man swoops in, floors four robbers, flips another over the shoulder in a double move, kicks a gun from a robber's hand, and jumps on him. He then turns to the camera, and a photograph of Spider-Man swinging off a roof, crawling down a building, saluting the cops is shown to the Bugle's editor, J. Jonah Jameson. Peter hands back his photographs to a girl at a desk, who writes a check, and Peter has his camera slung around his neck. Across the city in the high-rise Oscorp building, Norman is chairing a meeting; he rises and faces the other ten board members, glares at Henry Balkan sitting directly opposite him, while the older man sips from a cup of coffee with his gaze fixed on Norman, who wipes his mouth with the back of his hand as a lopsided grin appears on Norman's face. Colorful balloons and costumed revelers fill Times Square, and Peter's there with his camera, kicking away with it. He aims it at a balcony high up on a massive stone building, where he sees Harry with MJ, who's wearing a high-colored Chinese dress. Harry places his fingertips on her chin and leans in close to try and kiss her, but she turns her head away. Down below, Harry sees Peter neck-craned watching, and MJ and Harry turn to go inside. Peter senses something and looks around uneasily as Harry meets an Oscorp board member who's in a wheelchair, then Peter is disturbed and shifts his gaze under the sky. Beyond the Times Square building with a singular wireless cubed top and other advertising hoardings, an object is moving toward the crowd, and everyone turns to look up as Balkan watches through binoculars. Astride the glider is a figure in a stolen green flightsuit like a goblin with a sharp-featured head, long pointy ears, large yellow eyes, nose, and bare teeth. The glider circles the tall singular building, then heads towards the balcony, weaving this way and that, past giant balloon figures floating above the festival, and the laughing goblin throws something at the building with the balcony, causing explosions that rip out the windows and the floor below the balcony.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Peter nods and stands there with a foolish grin and a vacant look; once again, he simply nods and turns to observe her leave as she gives him a slight wave, and with a forlorn appearance on his face, Peter strolls off down the avenue. Later, he enters the flat he shares with Harry, where Norman Osborne is on the telephone. Peter ambles over to Harry, who glances up at him before appearing a bit embarrassed as he turns to them both and reads the Bugle's bounty for a Spider-Man picture. An armored truck heist ensues, with a camera hanging in a web, and Spider-Man swoops in, floors four thieves, flips another over the shoulder in a dual move, kicks a weapon from a thief's hand, and leaps on him. He then turns to the camera, and a picture of Spider-Man swinging off a rooftop, crawling down a structure, saluting the police is shown to the Bugle's editor, J. Jonah Jameson. Peter hands back his pictures to a girl at a desk, who pens a cheque, and Peter has his camera slung around his neck. Across the metropolis in the skyscraper Oscorp edifice, Norman is chairing a session; he rises and faces the other ten board associates, glowers at Henry Balkan sitting directly opposite him, while the elder man sips from a cup of coffee with his gaze fixed on Norman, who wipes his mouth with the back of his hand as a crooked grin appears on Norman's face. Colorful balloons and costumed merrymakers fill Times Square, and Peter's there with his camera, snapping away with it. He aims it at a balcony high up on a huge stone edifice, where he sees Harry with MJ, who's wearing a high-collared Chinese gown. Harry places his fingertips on her chin and leans in close to try and kiss her, but she turns her head away. Down below, Harry sees Peter neck-craned observing, and MJ and Harry turn to go inside. Peter senses something and looks around uneasily as Harry meets an Oscorp board associate who's in a wheelchair, then Peter is disturbed and shifts his gaze under the sky. Beyond the Times Square edifice with a singular wireless cubed top and other advertising hoardings, an object is moving toward the crowd, and everyone turns to look up as Balkan observes through binoculars. Astride the glider is a figure in a purloined green flightsuit like a goblin with a sharp-featured head, long pointy ears, large yellow eyes, nose, and bare teeth. The glider circles the tall singular edifice, then heads towards the balcony, weaving this way and that, past giant balloon figures floating above the festival, and the cackling goblin throws something at the edifice with the balcony, causing explosions that rip out the windows and the floor below the balcony."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Peter is nodded at, and he is stood there with a stupid smile and a blank expression; once again, he is simply nodded at, and he is turned to by her as she gives him a little wave, and with a dejected look on his face, the street is walked off down by Peter. Later, the apartment he shares with Harry is entered by him, where Norman Osborne is speaking on the phone. Harry saunters over to Peter, who is looked up at by him before a little sheepish look appears as he is turned to, and the Bugle's reward for a Spider-Man photo is read by him to them both. An armored car hoist is ensued by Spider-Man, with a camera suspended in a web, and four robbers are floored by Spider-Man, another is flipped over the shoulder in a double move by him, a gun is kicked from a robber's hand by him, and he is jumped on by Spider-Man. He then turns to the camera, and the Bugle's editor, J. Jonah Jameson, is shown a photograph of Spider-Man swinging off a roof, crawling down a building, saluting the cops. A girl at a desk is handed back photographs by Peter, who writes a check, and his camera is slung around his neck by Peter. Across the city in the high-rise Oscorp building, a meeting is chaired by Norman; he rises and faces the other ten board members, and Henry Balkan sits directly opposite him glaring, while Norman's mouth is wiped with the back of his hand by Norman as a lopsided grin appears on his face. Times Square is filled with colorful balloons and costumed revelers, and Peter is there with his camera, which is being kicked away with. His camera is aimed at a balcony high up on a massive stone building by him, where Harry is seen with MJ, who's wearing a high-colored Chinese dress. Her chin is placed with his fingertips by Harry, and he leans in close to try and kiss her, but her head is turned away by her. Down below, Peter is seen neck-craned watching by Harry, and MJ and Harry turn to go inside. Something is sensed, and around is looked uneasily by Peter as an Oscorp board member who's in a wheelchair is met by Harry, then Peter disturbs and his gaze is shifted under the sky. Beyond the Times Square building with a singular wireless cubed top and other advertising hoardings, an object moves toward the crowd, and it is turned to by everyone as the crowd looks up, and Balkan watches through binoculars. Astride the glider, a figure in a stolen green flightsuit like a goblin with a sharp-featured head, long pointy ears, large yellow eyes, nose, and bare teeth is watched. The tall singular building is circled by the glider, then it heads towards the balcony, weaving this way and that, past giant balloon figures floating above the festival, and something is thrown at the building with the balcony by the laughing goblin, causing windows and the floor below the balcony to be ripped out by explosions."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Peter stands with a blank expression and a silly smile, nodding as she waves goodbye. Dejected, he walks down the street. Later, he enters the apartment he shares with Harry, where Norman Osborne is on the phone. Peter approaches Harry, who sheepishly shows him the Bugle's reward for a Spider-Man photo. An armored car heist occurs, with a camera in a web. Spider-Man swoops in, defeats four robbers, disarms another, and jumps on him. He turns to the camera, and a photo of Spider-Man swinging, crawling, and saluting cops is shown to J. Jonah Jameson. Peter returns his photos to a girl at a desk, who writes a check, and he has his camera around his neck. At Oscorp, Norman chairs a meeting, glaring at Henry Balkan, who sips coffee while watching Norman grin. In Times Square, colorful balloons and costumed revelers abound. Peter, with his camera, spots Harry with MJ on a balcony. Harry tries to kiss MJ, but she turns away. Below, Harry sees Peter watching, and MJ and Harry go inside. Peter senses something, looks around, and sees an Oscorp board member in a wheelchair. An object approaches the crowd, and everyone looks up as Balkan watches through binoculars. A figure in a stolen green flightsuit, resembling a goblin, rides a glider, circling a tall building and heading toward the balcony. The goblin throws something, causing explosions that shatter windows and the floor below the balcony."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Peter stands with a blank expression and a silly smile, nodding as she waves and leaves, then walks dejectedly down the street. Later, he enters the apartment with Harry, where Norman Osborne is on the phone. Peter approaches Harry, who sheepishly shows the Bugle's reward for a Spider-Man photo. An armored car heist occurs, with Spider-Man swooping in, defeating robbers, and a camera capturing him. A photo of Spider-Man is shown to J. Jonah Jameson. Peter returns photos to a girl at a desk, receives a check, and has his camera around his neck. At Oscorp, Norman chairs a meeting, glaring at Henry Balkan, who sips coffee while Norman grins. In Times Square, Peter takes photos, spotting Harry with MJ on a balcony. Harry tries to kiss MJ, but she turns away. Peter watches, feeling uneasy, as Harry meets an Oscorp board member in a wheelchair. An object approaches the crowd, and Balkan watches through binoculars. A figure in a green flightsuit on a glider, resembling a goblin, circles a building and throws explosives, causing explosions below the balcony."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Peter, with a somewhat foolish grin plastered on his face and a vacant look in his eyes, nods in agreement and stands there momentarily. Once again, he simply nods, turning to watch her as she departs, giving him a small wave. With a dejected expression clouding his features, Peter eventually walks off down the street. Later on, he makes his way into the apartment he shares with Harry, where he finds Norman Osborne engaged in a phone conversation. Peter casually saunters over to Harry, who glances up at him before appearing slightly embarrassed. Harry then turns to both of them and reads aloud the Bugle's reward offer for a photograph of Spider-Man. An armored car heist unfolds, with a camera cleverly suspended in a web. Spider-Man swoops in heroically, swiftly taking down four robbers, flipping another over his shoulder in a skillful double move, kicking a gun from a robber's hand, and finally jumping on him. He then turns to face the camera, and a photograph captures Spider-Man swinging off a rooftop, crawling down a building, and saluting the police officers. This image is shown to the Bugle's editor, J. Jonah Jameson. Peter returns his photographs to a girl seated at a desk, who writes him a check, while Peter has his camera slung around his neck. Across the city, in the towering high-rise Oscorp building, Norman is presiding over a meeting. He rises from his seat and faces the other ten board members, glaring intently at Henry Balkan, who sits directly opposite him. The older man sips from a cup of coffee, his gaze fixed on Norman, who wipes his mouth with the back of his hand as a crooked grin spreads across his face. In Times Square, colorful balloons and costumed revelers fill the area, and Peter is there with his camera, eagerly snapping away. He aims it at a balcony high up on a massive stone building, where he spots Harry with MJ, who is elegantly dressed in a high-collared Chinese dress. Harry gently places his fingertips on her chin and leans in close, attempting to kiss her, but she turns her head away. Down below, Harry notices Peter watching with his neck craned, and both MJ and Harry turn to go inside. Peter senses something amiss and looks around uneasily as Harry encounters an Oscorp board member in a wheelchair. Peter is disturbed and shifts his gaze skyward. Beyond the Times Square building, with its singular wireless cubed top and various advertising hoardings, an object is moving toward the crowd. Everyone turns to look up as Balkan observes through binoculars. Riding the glider is a figure clad in a stolen green flightsuit, resembling a goblin with a sharp-featured head, long pointy ears, large yellow eyes, a prominent nose, and bared teeth. The glider circles the tall singular building, then heads towards the balcony, weaving this way and that, past giant balloon figures floating above the festival. The laughing goblin throws something at the building with the balcony, causing explosions that violently shatter the windows and the floor below the balcony."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Peter stood there, his expression somewhat vacant, a foolish grin plastered across his face, nodding in agreement without really comprehending. He lingered momentarily, nodding once more, his gaze fixated on her as she made her exit, offering him a small, parting wave. With a dejected expression that now seemed to cloud his features, Peter eventually turned away and walked off down the street. Later, he found himself heading back to the apartment he shared with Harry. Upon entering, he noticed Norman Osborne, who was deeply engrossed in a phone conversation. Peter casually made his way over to Harry, who looked up momentarily before appearing slightly embarrassed. Harry then turned to both Peter and Norman, reading aloud the Bugle's enticing reward offer for a photograph of the elusive Spider-Man.\n\nAs the scene shifted to a daring armored car heist, a camera was cleverly suspended in a web, capturing every moment. Spider-Man heroically appeared, swooping in with style, swiftly dispatching four robbers. In a skillful double move, he flipped one over his shoulder, kicked a gun from another's hand, and finally leaped onto a robber, securing victory. He then turned to face the camera with dramatic flair, capturing a photograph of Spider-Man swinging off a rooftop, crawling down the side of a building, and saluting the police officers below. This striking image was promptly shown to the Bugle's editor, J. Jonah Jameson. Meanwhile, Peter made his way back, turning in his photographs to a girl seated at a desk, who proceeded to write him a check. All the while, Peter had his trusty camera slung around his neck.\n\nAcross the city, in the towering high-rise of the Oscorp building, Norman was presiding over a crucial meeting. Rising from his seat, he faced the other ten board members, glaring intently at Henry Balkan, who sat directly opposite him. The older man took a measured sip from his cup of coffee, his gaze fixed unwaveringly on Norman, who wiped his mouth with the back of his hand as a crooked grin began to spread across his face. In the bustling Times Square, vibrant balloons and costumed revelers filled the area with color and energy. Peter, seizing the opportunity, was there with his camera, eagerly snapping away. He aimed it toward a balcony high up on a massive stone building, where he could see Harry with MJ. She was elegantly dressed in a high-collared Chinese dress, and Harry gently placed his fingertips on her chin, leaning in with the intention to kiss her. However, MJ turned her head away, declining his advance.\n\nDown below, Harry noticed Peter watching with his neck craned, and both MJ and Harry turned to move inside. A sense of unease washed over Peter as he sensed something amiss and began to look around uneasily. It was then that Harry encountered an Oscorp board member seated in a wheelchair. This sight disturbed Peter, prompting him to shift his gaze skyward. Beyond the towering Times Square building with its singular wireless cubed top and various advertising hoardings, an ominous object was approaching the crowd. Everyone turned to look up, and Balkan observed the scene through his binoculars. Riding the glider was a figure clad in a stolen green flightsuit, resembling a grotesque goblin with a sharp-featured head, long pointy ears, large yellow eyes, a prominent nose, and bared teeth. The glider circled the tall singular building before heading towards the balcony, weaving this way and that, past the giant balloon figures that floated above the festive scene. The laughing goblin hurled something at the building with the balcony, causing explosions that violently shattered the windows and the floor below, casting chaos into the revelry."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Peter stands there, nodding with a somewhat foolish smile plastered on his face, his expression blank and unchanging. He nods once more, this time with a sense of finality, and turns his head to watch her as she walks away, her hand raised in a small wave. As she disappears from view, a dejected look settles on Peter's face, and he begins to walk down the street, his steps heavy with disappointment. Later, he arrives at the apartment he shares with Harry, opening the door to find Norman Osborne engaged in a phone conversation. Peter casually makes his way over to Harry, who glances up at him before his expression shifts to one of slight embarrassment. Harry then turns to both Peter and Norman, drawing their attention to the Bugle's reward for a photograph of Spider-Man. The scene shifts to an armored car heist, where a camera is suspended in a web, capturing the action as Spider-Man arrives on the scene. With swift and precise movements, Spider-Man takes down four robbers, flipping one over his shoulder in a seamless double move, then expertly kicks a gun from another robber's hand before jumping on him to subdue him. He then turns his attention to the camera, and the next moment, a photograph of Spider-Man swinging off a roof, crawling down a building, and saluting the police is presented to J. Jonah Jameson, the editor of the Bugle. Peter, with his camera slung around his neck, hands back his photographs to a girl at a desk, who promptly writes him a check. Meanwhile, across the city in the high-rise Oscorp building, Norman is presiding over a meeting. He stands up, facing the ten other board members, his eyes locking onto Henry Balkan, who sits directly opposite him. As Balkan sips from his cup of coffee, his gaze remains fixed on Norman, who wipes his mouth with the back of his hand, a crooked grin forming on his face. In Times Square, the atmosphere is vibrant with colorful balloons and costumed revelers, and Peter is there, actively taking photographs with his camera. He directs his lens toward a balcony high up on a massive stone building, where he spots Harry with MJ, who is dressed in a high-collared Chinese dress. Harry gently places his fingertips on her chin, leaning in close in an attempt to kiss her, but she turns her head away, avoiding the kiss. Down below, Harry notices Peter watching them with his neck craned upward, and both MJ and Harry decide to head inside. Peter, sensing something amiss, looks around with a growing unease. Meanwhile, Harry encounters an Oscorp board member in a wheelchair. Peter's attention is drawn skyward, disturbed by something he cannot yet see. Beyond the Times Square building, with its singular wireless cubed top and various advertising hoardings, an object is moving toward the crowd. The people below begin to turn their heads upward, following the movement, as Balkan observes through binoculars. Riding a glider is a figure clad in a stolen green flightsuit, resembling a goblin with sharp features, long pointy ears, large yellow eyes, a pronounced nose, and bared teeth. The glider circles the tall singular building, then maneuvers toward the balcony, weaving through the air past giant balloon figures that float above the festival. The goblin, laughing maniacally, throws an explosive device at the building with the balcony, resulting in a series of explosions that shatter the windows and destroy the floor below the balcony."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Peter stands with a blank expression and a smile, nodding as he watches her leave with a wave. Feeling dejected, he walks down the street. Later, he enters the apartment he shares with Harry, where Norman Osborne is on the phone. Peter approaches Harry, who sheepishly shows him the Bugle's reward for a Spider-Man photo. During an armored car heist, Spider-Man intervenes, swiftly defeating the robbers and securing a camera in a web. A photograph of Spider-Man in action is presented to J. Jonah Jameson at the Bugle. Peter returns his photos to a girl at a desk, receives a check, and carries his camera around his neck. Meanwhile, at Oscorp, Norman chairs a meeting, glaring at Henry Balkan while displaying a lopsided grin. In Times Square, amidst colorful balloons and revelers, Peter captures the scene with his camera. He spots Harry with MJ on a balcony, where Harry attempts to kiss her, but she turns away. Below, Peter watches them, and they head inside. Sensing something amiss, Peter looks around as Harry meets an Oscorp board member in a wheelchair. Suddenly, an object approaches the crowd, and everyone looks up, including Balkan with binoculars. A figure in a stolen green flightsuit, resembling a goblin, circles a tall building on a glider, weaving through giant balloons. The goblin throws explosives at the building, causing windows and the floor below the balcony to explode."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Peter nods and stands there with a stupid smile and a blank expression; once again, he simply nods and turns to watch her go as she gives him a little wave, and with a dejected look on his face, Peter walks off down the street. Later, he enters the apartment in New York City that he shares with Harry, his close friend and the son of a wealthy industrialist, where Norman Osborne, who is Harry's father and the CEO of Oscorp, is on the phone. Peter saunters over to Harry, who looks up at him before looking a little sheepish as he turns to them both and reads the Bugle's reward for a Spider-Man photo, a frequent pursuit for Peter as he earns extra money with his photography. An armored car hoist ensues downtown, with a camera suspended in a web that Spider-Man, the masked vigilante of New York, uses to capture evidence, and Spider-Man swoops in, floors four robbers, flips another over the shoulder in a double move, kicks a gun from a robber's hand, and jumps on him. He then turns to the camera, and a photograph of Spider-Man swinging off a roof, crawling down a building, saluting the cops is shown to the Bugle's editor, J. Jonah Jameson, who is notoriously skeptical of Spider-Man. Peter hands back his photographs to a girl at a desk, who writes a check, and Peter has his camera slung around his neck, a constant companion in his dual life. Across the city in the high-rise Oscorp building, a major player in the tech and defense industry, Norman is chairing a meeting; he rises and faces the other ten board members, glares at Henry Balkan, the CFO and a long-time rival for control of Oscorp, sitting directly opposite him, while the older man sips from a cup of coffee with his gaze fixed on Norman, who wipes his mouth with the back of his hand as a lopsided grin appears on Norman's face. Colorful balloons and costumed revelers fill Times Square, the famous commercial and entertainment hub of New York City, and Peter's there with his camera, kicking away with it. He aims it at a balcony high up on a massive stone building, where he sees Harry with MJ, Peter’s close friend and secret crush, who's wearing a high-colored Chinese dress, known for its elegant design. Harry places his fingertips on her chin and leans in close to try and kiss her, but she turns her head away. Down below, Harry sees Peter neck-craned watching, and MJ and Harry turn to go inside. Peter senses something and looks around uneasily as Harry meets an Oscorp board member who's in a wheelchair, then Peter is disturbed and shifts his gaze under the sky. Beyond the Times Square building with a singular wireless cubed top and other advertising hoardings showcasing brands like Coca-Cola, an object is moving toward the crowd, and everyone turns to look up as Balkan watches through binoculars. Astride the glider is a figure in a stolen green flightsuit, modeled after a goblin from legends, with a sharp-featured head, long pointy ears, large yellow eyes, nose, and bare teeth. The glider circles the tall singular building, then heads towards the balcony, weaving this way and that, past giant balloon figures floating above the festival, and the laughing goblin throws something at the building with the balcony, causing explosions that rip out the windows and the floor below the balcony, spreading chaos in the heart of the city's festivities."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Peter nods and stands there with a stupid smile and a blank expression  once again he simply nods and turns to watch her go as she gives him a little wave and with a dejected look on his face Peter walks off down the street  Later he enters the apartment he shares with Harry where Norman Osborne is on the phone  Colorful balloons and costumed revelers fill Times Square and Peter's there with his camera kicking away with it  He aims it at a balcony high up on a massive stone building where he sees Harry with MJ who's wearing a highcolored Chinese dress  Harry places his fingertips on her chin and leans in close to try and kiss her but she turns her head away  Down below Harry sees Peter neckcraned watching and MJ and Harry turn to go inside  Peter senses something and looks around uneasily as Harry meets an Oscorp board member who's in a wheelchair  then Peter is disturbed and shifts his gaze under the sky  Beyond the Times Square building with a singular wireless cubed top and other advertising hoardings  an object is moving toward the crowd and everyone turns to look up as Balkan watches through binoculars  Astride the glider is a figure in a stolen green flightsuit like a goblin with a sharpfeatured head long pointy ears large yellow eyes nose and bare teeth  The glider circles the tall singular building then heads towards the balcony weaving this way and that past  giant balloon figures floating above the festival and the laughing goblin throws something at the building with the balcony causing explosions that rip out the windows and the floor below the balcony Peter saunters over to Harry who looks up at him before looking a little sheepish as he turns to them both and reads the Bugle's reward for a SpiderMan photo  An armored car hoist ensues with a camera suspended in a web and SpiderMan swoops in floors  four robbers flips another over the shoulder in a double move kicks a gun from a robber's hand and jumps on him  He then turns to the camera and a photograph of SpiderMan swinging off a roof crawling down a building saluting the cops is shown to the Bugle's editor J Jonah Jameson  Peter hands back his photographs to a girl at a desk who writes a check and Peter has his camera slung around his neck  Across the city in the highrise Oscorp building Norman is chairing a meeting  he rises and faces the other ten board members glares at Henry Balkan sitting directly opposite him while the older man sips from a cup of coffee with his gaze fixed on Norman who wipes his mouth with the back of his hand as a lopsided grin appears on Norman's face  Colorful balloons and costumed revelers fill Times Square and Peter's there with his camera kicking away with it  He aims it at a balcony high up on a massive stone building where he sees Harry with MJ who's wearing a highcolored Chinese dress  Harry places his fingertips on her chin and leans in close to try and kiss her but she turns her head away  Down below Harry sees Peter neckcraned watching and MJ and Harry turn to go inside  Peter senses something and looks around uneasily as Harry meets an Oscorp board member who's in a wheelchair  then Peter is disturbed and shifts his gaze under the sky  Beyond the Times Square building with a singular wireless cubed top and other advertising hoardings  an object is moving toward the crowd and everyone turns to look up as Balkan watches through binoculars  Astride the glider is a figure in a stolen green flightsuit like a goblin with a sharpfeatured head long pointy ears large yellow eyes nose and bare teeth  The glider circles the tall singular building then heads towards the balcony weaving this way and that past  giant balloon figures floating above the festival and the laughing goblin throws something at the building with the balcony causing explosions that rip out the windows and the floor below the balcony"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Peter nods and stands there with a stupid smile and a blank expression. once again he simply nods and turns to watch her go as she gives him a little wave and with a dejected look on his face Peter walks off down the street. Later he enters the apartment he shares with Harry where Norman Osborne is on the phone. Peter saunters over to Harry who looks up at him before looking a little sheepish as he turns to them both and reads the Bugle's reward for a SpiderMan photo. An armored car hoist ensues with a camera suspended in a web and SpiderMan swoops in floors. four robbers flips another over the shoulder in a double move kicks a gun from a robber's hand and jumps on him. He then turns to the camera and a photograph of SpiderMan swinging off a roof crawling down a building saluting the cops is shown to the Bugle's editor J Jonah Jameson. Peter hands back his photographs to a girl at a desk who writes a check and Peter has his camera slung around his neck. Across the city in the highrise Oscorp building Norman is chairing a meeting. he rises and faces the other ten board members glares at Henry Balkan sitting directly opposite him while the older man sips from a cup of coffee with his gaze fixed on Norman who wipes his mouth with the back of his hand as a lopsided grin appears on Norman's face. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. Colorful balloons and costumed revelers fill Times Square and Peter's there with his camera kicking away with it. He aims it at a balcony high up on a massive stone building where he sees Harry with MJ who is wearing a highcolored Chinese dress. Harry places his fingertips on her chin and leans in close to try and kiss her but she turns her head away. Down below Harry sees Peter neckcraned watching and MJ and Harry turn to go inside. Peter senses something and looks around uneasily as Harry meets an Oscorp board member who is in a wheelchair. then Peter is disturbed and shifts his gaze under the sky. Beyond the Times Square building with a singular wireless cubed top and other advertising hoardings. an object is moving toward the crowd and everyone turns to look up as Balkan watches through binoculars. Astride the glider is a figure in a stolen green flightsuit like a goblin with a sharpfeatured head long pointy ears large yellow eyes nose and bare teeth. The glider circles the tall singular building then heads towards the balcony weaving this way and that past. giant balloon figures floating above the festival and the laughing goblin throws something at the building with the balcony causing explosions that rip out the windows and the floor below the balcony."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Peter nods and stands there with a stupid smile and a blank expression. once again he simply nods and turns to watch her go as she gives him a little wave and with a dejected look on his face Peter walks off down the street. Later he enters the apartment he shares with Harry where Norman Osborne is on the phone. Peter saunters over to Harry who looks up at him before looking a little sheepish as he turns to them both and reads the Bugle's reward for a SpiderMan photo. An armored car hoist ensues with a camera suspended in a web and SpiderMan swoops in floors. four robbers flips another over the shoulder in a double move kicks a gun from a robber's hand and jumps on him. He then turns to the camera and a photograph of SpiderMan swinging off a roof crawling down a building saluting the cops is shown to the Bugle's editor J Jonah Jameson. Peter hands back his photographs to a girl at a desk who writes a check and Peter has his camera slung around his neck. Across the city in the highrise Oscorp building Norman is chairing a meeting. he rises and faces the other ten board members glares at Henry Balkan sitting directly opposite him while the older man sips from a cup of coffee with his gaze fixed on Norman who wipes his mouth with the back of his hand as a lopsided grin appears on Norman's face. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. Colorful balloons and costumed revelers fill Times Square and Peter's there with his camera kicking away with it. He aims it at a balcony high up on a massive stone building where he sees Harry with MJ who is wearing a highcolored Chinese dress. Harry places his fingertips on her chin and leans in close to try and kiss her but she turns her head away. Down below Harry sees Peter neckcraned watching and MJ and Harry turn to go inside. Peter senses something and looks around uneasily as Harry meets an Oscorp board member who is in a wheelchair. then Peter is disturbed and shifts his gaze under the sky. Beyond the Times Square building with a singular wireless cubed top and other advertising hoardings. an object is moving toward the crowd and everyone turns to look up as Balkan watches through binoculars. Astride the glider is a figure in a stolen green flightsuit like a goblin with a sharpfeatured head long pointy ears large yellow eyes nose and bare teeth. The glider circles the tall singular building then heads towards the balcony weaving this way and that past. giant balloon figures floating above the festival and the laughing goblin throws something at the building with the balcony causing explosions that rip out the windows and the floor below the balcony."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Peter nods and stands there with a stupid smile and a blank expression. once again he simply nods and turns to watch her go as she gives him a little wave and with a dejected look on his face Peter walks off down the street. Later he enters the apartment he shares with Harry where Norman Osborne is on the phone. Peter saunters over to Harry who looks up at him before looking a little sheepish as he turns to them both and reads the Bugle's reward for a SpiderMan photo. An armored car hoist ensues with a camera suspended in a web and SpiderMan swoops in floors. then Peter is disturbed and shifts his gaze under the sky. Beyond the Times Square building with a singular wireless cubed top and other advertising hoardings. an object is moving toward the crowd and everyone turns to look up as Balkan watches through binoculars. Astride the glider is a figure in a stolen green flightsuit like a goblin with a sharpfeatured head long pointy ears large yellow eyes nose and bare teeth. The glider circles the tall singular building then heads towards the balcony weaving this way and that past. giant balloon figures floating above the festival and the laughing goblin throws something at the building with the balcony causing explosions that rip out the windows and the floor below the balcony."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Peter nods and stands there with a stupid smile and a blank expression. once again he simply nods and turns to watch her go as she gives him a little wave and with a dejected look on his face Peter walks off down the street. Astride the glider is a figure in a stolen green flightsuit like a goblin with a sharpfeatured head long pointy ears large yellow eyes nose and bare teeth. The glider circles the tall singular building then heads towards the balcony weaving this way and that past. giant balloon figures floating above the festival and the laughing goblin throws something at the building with the balcony causing explosions that rip out the windows and the floor below the balcony."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The dog nods and stands there with a stupid smile and a blank expression; once again, the dog simply nods and turns to watch the cat go as the cat gives the dog a little wave, and with a dejected look on its face, the dog walks off down the street. Later, the dog enters the apartment it shares with the goat, where the fish is on the phone. The dog saunters over to the goat, who looks up at the dog before looking a little sheepish as the goat turns to them both and reads the Bugle's reward for a Spider-Man photo. An armored car hoist ensues, with a camera suspended in a web, and a penguin swoops in, floors four robbers, flips another over the shoulder in a double move, kicks a gun from a robber's hand, and jumps on them. The penguin then turns to the camera, and a photograph of the penguin swinging off a roof, crawling down a building, saluting the cops is shown to the Bugle's editor, the zebra. The dog hands back its photographs to a rabbit at a desk, who writes a check, and the dog has its camera slung around its neck. Across the city in the high-rise tree, the fish is chairing a meeting; the fish rises and faces the other ten board members, glares at a bunny sitting directly opposite the fish, while the older bunny sips from a cup of coffee with its gaze fixed on the fish, who wipes its mouth with the back of its hand as a lopsided grin appears on the fish's face. Colorful balloons and costumed revelers fill Times Square, and the dog is there with its camera, kicking away with it. The dog aims it at a balcony high up on a massive stone building, where it sees the goat with the fox, who's wearing a high-colored Chinese dress. The goat places its fingertips on the fox's chin and leans in close to try and kiss the fox, but the fox turns its head away. Down below, the goat sees the dog neck-craned watching, and the fox and the goat turn to go inside. The dog senses something and looks around uneasily as the goat meets a tree board member who's in a wheelchair, then the dog is disturbed and shifts its gaze under the sky. Beyond the Times Square building with a singular wireless cubed top and other advertising hoardings, an object is moving toward the crowd, and everyone turns to look up as the bunny watches through binoculars. Astride the glider is a figure in a stolen green flightsuit like a goblin with a sharp-featured head, long pointy ears, large yellow eyes, nose, and bare teeth. The glider circles the tall singular building, then heads towards the balcony, weaving this way and that, past giant balloon figures floating above the festival, and the laughing goblin throws something at the building with the balcony, causing explosions that rip out the windows and the floor below the balcony."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Peter nods and stands there with a silly smile and a blank expression; once again, he simply nods and turns to watch her go as she gives him a little wave, and with a dejected look on his face, Peter walks off down the boardwalk. Later, he enters the villa he shares with Harry, where Norman Osborne is on the tablet. Peter saunters over to Harry, who looks up at him before looking a little sheepish as he turns to them both and reads the Bugle's reward for a Spider-Man illustration. A bank vault heist ensues, with a drone suspended in a net, and Spider-Man swoops in, floors four robbers, flips another over the shoulder in a double move, kicks a wrench from a robber's hand, and jumps on him. He then turns to the drone, and a painting of Spider-Man swinging off a chimney, crawling down a bridge, saluting the firemen is shown to the Bugle's editor, J. Jonah Jameson. Peter hands back his sketches to a girl at a kiosk, who writes a receipt, and Peter has his drone slung around his neck. Across the city in the high-rise Oscorp tower, Norman is chairing a symposium; he rises and faces the other ten board members, glares at Henry Balkan sitting directly opposite him, while the older man sips from a glass of tea with his gaze fixed on Norman, who wipes his mouth with the back of his hand as a lopsided grin appears on Norman's face. Colorful flags and costumed dancers fill Washington Square, and Peter's there with his drone, snapping away with it. He aims it at a terrace high up on a massive steel structure, where he sees Harry with MJ, who's wearing a high-colored Indian sari. Harry places his fingertips on her cheek and leans in close to try and kiss her, but she turns her head away. Down below, Harry sees Peter neck-craned watching, and MJ and Harry turn to go inside. Peter senses something and looks around uneasily as Harry meets an Oscorp board member who's in a stretcher, then Peter is disturbed and shifts his gaze under the clouds. Beyond the Washington Square building with a singular wireless domed top and other advertising screens, an object is moving toward the crowd, and everyone turns to look up as Balkan watches through a telescope. Astride the hoverboard is a figure in a stolen red wetsuit like a goblin with a sharp-featured head, long pointy antennas, large purple eyes, nose, and bare teeth. The hoverboard circles the tall singular structure, then heads towards the terrace, weaving this way and that, past giant puppet figures floating above the parade, and the laughing goblin throws something at the structure with the terrace, causing explosions that rip out the windows and the floor below the terrace."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Peter winks and lounges there with a goofy chuckle and a vacant stare; once again, he simply waves and turns to see her depart as she gives him a little salute, and with a forlorn expression on his face, Peter skips off down the street. Later, he reclines in the apartment he shares with Harry, where Norman Osborne is signing some papers. Peter strolls over to Harry, who glances up at him before glancing slightly embarrassed as he turns to them both and sketches the Bugle's reward for a Spider-Man picture. An armored car escapade unfolds, with a camera dangles from a web, and Spider-Man dives in, pacifies four robbers, twirls another over the shoulder in a gentle move, nudges a gun from a robber's hand, and leaps on him. He then twists to the camera, and a painting of Spider-Man gliding off a roof, clambering down a building, high-fiving the cops is shown to the Bugle's editor, J. Jonah Jameson. Peter hands back his artwork to a girl at a desk, who scrawls a note, and Peter has his camera draped around his neck. Across the city in the towering Oscorp building, Norman is facilitating a meeting; he stands and faces the other ten board members, smirks at Henry Balkan sitting directly opposite him, while the older man nibbles from a piece of cake with his gaze fixed on Norman, who rubs his hand across his cheek as a crooked smirk emerges on Norman's face. Vibrant lanterns and masked performers fill Times Square, and Peter's there with his camera, swinging away with it. He aims it at a ledge high up on a massive stone building, where he sees Harry with MJ, who's wearing a vivid Chinese dress. Harry places his fingertips on her shoulder and leans in close to try and whisper to her, but she turns her ear away. Down below, Harry observes Peter neck-craned watching, and MJ and Harry turn to step inside. Peter suspects something and glances around nervously as Harry greets an Oscorp board member who's using a cane, then Peter is puzzled and directs his attention under the sky. Beyond the Times Square edifice with a singular wireless cubed top and other advertisement hoardings, an entity is descending toward the crowd, and everyone turns to glance up as Balkan observes through a telescope. Perched on the glider is a figure in a pilfered green outfit like a goblin with a sharp-featured head, long pointy ears, large yellow eyes, nose, and bared teeth. The glider loops around the towering singular building, then moves towards the ledge, zigzagging this way and that, past massive inflatable figures soaring above the festival, and the chortling goblin hurls something at the edifice with the ledge, causing bursts that tear through the windows and the floor beneath the ledge."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "George nods and stands there with a goofy grin and a vacant stare; once again, he simply nods and turns to watch the lamp go as it gives him a little wave, and with a forlorn look on his face, George walks off down the hallway. Later, he enters the greenhouse he shares with Fred, where Howard Stark is on the radio. George strolls over to Fred, who glances at him before looking a little bashful as he turns to them both and reads the Herald's reward for a Batman sketch. A goldfish bowl heist ensues, with a microphone suspended in a vine, and Batman swoops in, floors four dolphins, flips another over the shoulder in a double move, kicks a shoe from a dolphin's flipper, and jumps on it. He then turns to the microphone, and a sketch of Batman swinging off a tower, crawling down a monument, saluting the carpenters is shown to the Herald's publisher, L. Luthor. George hands back his sketches to a zebra at a counter, who writes a ticket, and George has his microphone slung around his neck. Across the city in the high-rise Stark Industries building, Howard is chairing a discussion; he rises and faces the other seven board advisers, glares at Thomas Snickers sitting directly opposite him, while the younger man sips from a bowl of tea with his gaze fixed on Howard, who wipes his forehead with the back of his hand as a crooked grin appears on Howard's face. Vibrant streamers and masked dancers fill Central Park, and George's there with his microphone, tapping away with it. He aims it at a rooftop high up on a colossal brick tower, where he sees Fred with Alice, who's wearing a high-collared Egyptian robe. Fred places his fingertips on her shoulder and leans in close to try and kiss her, but she turns her head away. Down below, Fred sees George neck-craned watching, and Alice and Fred turn to go outside. George senses something and looks around uneasily as Fred meets a Stark Industries adviser who's on a skateboard, then George is perturbed and shifts his gaze under the waves. Beyond the Central Park tower with a singular metallic dome and other advertising banners, a creature is moving toward the gathering, and everyone turns to look up as Snickers watches through periscopes. Astride the kite is a shadow in a stolen purple spacesuit like a witch with a blunt-featured snout, short round ears, large red eyes, chin, and snarled mouth. The kite circles the tall singular tower, then heads towards the rooftop, weaving this way and that, past giant balloon caricatures floating above the parade, and the chuckling witch throws something at the tower with the rooftop, causing blasts that rip out the walls and the ceiling below the rooftop."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Daniel winks and lounges there with a goofy grin and an absent-minded demeanor; once again, he merely winks and swivels to hear her leave as she sends him a slight salute, and with a forlorn look on his face, Daniel meanders off down the street. Later, he exits the apartment he shares with Ian, where Jonathan Osborne is jotting notes. Daniel strolls over to Ian, who glances up at him before appearing slightly embarrassed as he shifts to them both and examines the Bugle's prize for a Spider-Man snapshot. A bank heist unfolds, with a camera ensnared in a web, and Spider-Man glides in, drops four crooks, tosses another over the hip in a dual move, knocks a weapon from a thief's hand, and stands on him. He then pivots to the camera, and a picture of Spider-Man leaping off a rooftop, descending a skyscraper, waving at the police is displayed to the Bugle's chief, J. Jonah Jameson. Daniel returns his snapshots to a colleague at a desk, who types a note, and Daniel carries his camera looped around his neck. Across town in the towering Oscorp office, Jonathan is leading a session; he stands and addresses the remaining ten board associates, scowls at Michael Balkan seated directly across from him, while the elder man sips his beverage with his stare fixed on Jonathan, who dries his lip with the back of his hand as a crooked smile emerges on Jonathan's face. Festive balloons and costumed merrymakers fill Times Square, and Daniel's there with his camera, snapping away with it. He points it at a balcony high up on an enormous stone structure, where he spots Ian with LJ, who's adorned in a high-necked Chinese gown. Ian sets his fingers on her cheek and leans in for a kiss, but she shifts her face aside. Down below, Ian notices Daniel craning his neck to watch, and LJ and Ian turn to head indoors. Daniel detects something and peers around anxiously as Ian greets an Oscorp board associate who's in a scooter, then Daniel is perturbed and redirects his gaze skyward. Beyond the Times Square edifice with a unique wireless cube summit and other promotional posters, an entity is advancing toward the audience, and everyone pivots to gaze upward as Balkan observes through binoculars. Riding the glider is a silhouette in a stolen green uniform resembling a goblin with a sharp-featured visage, long pointed ears, large yellow irises, snout, and bare fangs. The glider encircles the tall unique edifice, then moves towards the balcony, maneuvering from side to side, past massive balloon characters drifting above the carnival, and the cackling goblin hurls an object at the structure with the balcony, causing detonations that shatter the windows and the level below the balcony."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Peter blinks and stands there with a foolish grin and a vacant gaze; once again, he merely blinks and pivots to observe her leave as she gives him a slight nod, and with a forlorn look on his face, Peter meanders off down the lane. Later, he ventures into the loft he shares with Harry, where Norman Osborne is holding a notebook. Peter saunters over to Harry, who glances up at him before appearing a bit embarrassed as he turns to them both and recites the Bugle's bounty for a Spider-Man painting. An armored carriage lift unfolds, with a microphone swinging in a breeze, and Spider-Man glides in, topples four thieves, spins another around in a triple maneuver, snatches a hat from a thief's head, and lands on him. He then turns to the microphone, and an illustration of Spider-Man leaping off a bridge, sliding down a wall, waving at the firefighters is shown to the Bugle's editor, J. Jonah Jameson. Peter returns his pictures to a woman at a bureau, who types a receipt, and Peter has his microphone draped around his shoulder. Across the metropolis in the towering Oscorp tower, Norman is conducting a session; he stands and confronts the other ten executives, scowls at Henry Balkan seated directly across from him, while the elder man sips from a bottle of tea with his gaze fixed on Norman, who wipes his brow with the back of his wrist as a crooked grin appears on Norman's lips. Vivid kites and costumed dancers fill Times Square, and Peter's there with his microphone, bouncing away with it. He points it at a terrace high up on a giant brick edifice, where he sees Harry with MJ, who's wearing a brightly-patterned Indian sari. Harry places his hand on her shoulder and leans in close to attempt and hug her, but she turns her body away. Down below, Harry notices Peter neck-craned observing, and MJ and Harry turn to move inside. Peter feels something and glances around warily as Harry greets an Oscorp executive who's in a scooter, then Peter is perturbed and shifts his gaze under the horizon. Beyond the Times Square edifice with a singular wireless cubed summit and other promotional boards, a creature is swimming toward the assembly, and everyone turns to gaze up as Balkan peers through spectacles. Riding the hovercraft is a figure in a pilfered blue wetsuit like a troll with a flat-featured head, short round ears, large green eyes, nose, and exposed teeth. The hovercraft spirals around the towering singular structure, then moves towards the terrace, zigzagging this way and that, past enormous kite figures floating above the celebration, and the cackling troll hurls something at the structure with the terrace, causing blasts that shatter the panes and the ground beneath the terrace."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Martin smirks and jumps there with a silly grin and a vacant stare; once again, he simply shrugs and spins to watch the cat leave as it gives him a tiny nod, and with a puzzled look on his face, Martin skips off through the alley. Subsequently, he exits the treehouse he shares with Gary, where Norman Cushman is on a laptop. Martin wanders over to Gary, who glances up at him before appearing a bit embarrassed as he turns to them both and mutters the Bugle's bounty for a Batwoman sketch. A helicopter chase ensues, with a drone hanging in a net, and Batwoman dives in, trips three burglars, swings another over the back in a cartwheel move, slaps a knife from a thief's grip, and tackles him. She then tilts towards the drone, and a drawing of Batwoman flying under a bridge, gliding across a skyscraper, saluting the firefighters is shown to the Bugle's editor, J. Jonah Johnson. Martin hands back his sketches to a boy at a kiosk, who types a receipt, and Martin has his drone strapped around his wrist. Across the city in the low-rise Oscorp warehouse, Norman is hosting a seminar; he sits and faces the other seven committee participants, stares at Henry Palkan sitting slightly diagonal to him, while the elder man drinks from a mug of tea with his eyes locked on Norman, who brushes his chin with the side of his finger as a crooked smile emerges on Norman's face. Bright kites and masked dancers populate Central Park, and Martin's there with his drone, sliding away with it. He points it at an awning high up on a massive brick structure, where he spots Gary with MJ, who's wearing a sleek Indian outfit. Gary places his fingers on her nose and leans in nearby to attempt and hug her, but she angles her head aside. Down above, Gary notices Martin wrist-craned staring, and MJ and Gary pivot to go outside. Martin detects something and peers around nervously as Gary greets an Oscorp committee participant who's on crutches, then Martin is puzzled and rotates his focus under the clouds. Beyond the Central Park structure with a singular wireless spherical top and other promotional signs, an animal is floating toward the troupe, and everyone spins to peer up as Palkan observes through spectacles. Perched on the scooter is a woman in a borrowed orange jumpsuit like a fairy with a blunt-featured nose, short stubby wings, wide red eyes, chin, and bare fangs. The scooter circles the short singular structure, then glides towards the awning, zigzagging left and right, past massive kite animals floating above the carnival, and the chuckling fairy hurls something at the structure with the awning, causing fireworks that tear out the walls and the floor above the awning."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Peter watches a girl wave goodbye with a dejected look before heading to his shared apartment, where Norman Osborne is on the phone. Peter and Harry discuss the Bugle's reward for Spider-Man photos. After Spider-Man foils a robbery, Peter's photos are shown to J. Jonah Jameson at the Bugle. Peter is paid for his work, and he heads to Times Square, camera in hand, taking photos of the festive scene. He spots Harry with MJ on a balcony, but she turns away from Harry's attempted kiss. Meanwhile, the Oscorp board is in turmoil, and a goblin-like figure on a glider launches an attack at Times Square, causing explosions that shatter windows and floors."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "giant balloon figures floating above the festival and the laughing goblin throws something at the building with the balcony causing explosions that rip out the windows and the floor below the balcony The glider circles the tall singular building then heads towards the balcony weaving this way and that past  Astride the glider is a figure in a stolen green flightsuit like a goblin with a sharpfeatured head long pointy ears large yellow eyes nose and bare teeth  an object is moving toward the crowd and everyone turns to look up as Balkan watches through binoculars  Beyond the Times Square building with a singular wireless cubed top and other advertising hoardings  then Peter is disturbed and shifts his gaze under the sky  Peter senses something and looks around uneasily as Harry meets an Oscorp board member who's in a wheelchair  Down below Harry sees Peter neckcraned watching and MJ and Harry turn to go inside  Harry places his fingertips on her chin and leans in close to try and kiss her but she turns her head away  He aims it at a balcony high up on a massive stone building where he sees Harry with MJ who's wearing a highcolored Chinese dress  Colorful balloons and costumed revelers fill Times Square and Peter's there with his camera kicking away with it  he rises and faces the other ten board members glares at Henry Balkan sitting directly opposite him while the older man sips from a cup of coffee with his gaze fixed on Norman who wipes his mouth with the back of his hand as a lopsided grin appears on Norman's face  Across the city in the highrise Oscorp building Norman is chairing a meeting  Peter hands back his photographs to a girl at a desk who writes a check and Peter has his camera slung around his neck  He then turns to the camera and a photograph of SpiderMan swinging off a roof crawling down a building saluting the cops is shown to the Bugle's editor J Jonah Jameson  four robbers flips another over the shoulder in a double move kicks a gun from a robber's hand and jumps on him  An armored car hoist ensues with a camera suspended in a web and SpiderMan swoops in floors  Peter saunters over to Harry who looks up at him before looking a little sheepish as he turns to them both and reads the Bugle's reward for a SpiderMan photo  Later he enters the apartment he shares with Harry where Norman Osborne is on the phone  once again he simply nods and turns to watch her go as she gives him a little wave and with a dejected look on his face Peter walks off down the street  Peter nods and stands there with a stupid smile and a blank expression "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Beyond the Times Square building with a singular wireless cubed top and other advertising hoardings  Across the city in the highrise Oscorp building Norman is chairing a meeting  Peter saunters over to Harry who looks up at him before looking a little sheepish as he turns to them both and reads the Bugle's reward for a SpiderMan photo  He aims it at a balcony high up on a massive stone building where he sees Harry with MJ who's wearing a highcolored Chinese dress  Colorful balloons and costumed revelers fill Times Square and Peter's there with his camera kicking away with it  then Peter is disturbed and shifts his gaze under the sky  once again he simply nods and turns to watch her go as she gives him a little wave and with a dejected look on his face Peter walks off down the street  Astride the glider is a figure in a stolen green flightsuit like a goblin with a sharpfeatured head long pointy ears large yellow eyes nose and bare teeth  four robbers flips another over the shoulder in a double move kicks a gun from a robber's hand and jumps on him  The glider circles the tall singular building then heads towards the balcony weaving this way and that past  Later he enters the apartment he shares with Harry where Norman Osborne is on the phone  Peter nods and stands there with a stupid smile and a blank expression  Harry places his fingertips on her chin and leans in close to try and kiss her but she turns her head away  An armored car hoist ensues with a camera suspended in a web and SpiderMan swoops in floors  he rises and faces the other ten board members glares at Henry Balkan sitting directly opposite him while the older man sips from a cup of coffee with his gaze fixed on Norman who wipes his mouth with the back of his hand as a lopsided grin appears on Norman's face  Peter senses something and looks around uneasily as Harry meets an Oscorp board member who's in a wheelchair  Peter hands back his photographs to a girl at a desk who writes a check and Peter has his camera slung around his neck  Down below Harry sees Peter neckcraned watching and MJ and Harry turn to go inside  giant balloon figures floating above the festival and the laughing goblin throws something at the building with the balcony causing explosions that rip out the windows and the floor below the balcony He then turns to the camera and a photograph of SpiderMan swinging off a roof crawling down a building saluting the cops is shown to the Bugle's editor J Jonah Jameson  an object is moving toward the crowd and everyone turns to look up as Balkan watches through binoculars "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "He aims it at a balcony high up on a massive stone building where he sees Harry with MJ who's wearing a highcolored Chinese dress  Harry places his fingertips on her chin and leans in close to try and kiss her but she turns her head away  Down below Harry sees Peter neckcraned watching and MJ and Harry turn to go inside  Peter senses something and looks around uneasily as Harry meets an Oscorp board member who's in a wheelchair  then Peter is disturbed and shifts his gaze under the sky  Beyond the Times Square building with a singular wireless cubed top and other advertising hoardings  an object is moving toward the crowd and everyone turns to look up as Balkan watches through binoculars  Astride the glider is a figure in a stolen green flightsuit like a goblin with a sharpfeatured head long pointy ears large yellow eyes nose and bare teeth  The glider circles the tall singular building then heads towards the balcony weaving this way and that past  giant balloon figures floating above the festival and the laughing goblin throws something at the building with the balcony causing explosions that rip out the windows and the floor below the balcony Peter nods and stands there with a stupid smile and a blank expression  once again he simply nods and turns to watch her go as she gives him a little wave and with a dejected look on his face Peter walks off down the street  Later he enters the apartment he shares with Harry where Norman Osborne is on the phone  Peter saunters over to Harry who looks up at him before looking a little sheepish as he turns to them both and reads the Bugle's reward for a SpiderMan photo  An armored car hoist ensues with a camera suspended in a web and SpiderMan swoops in floors  four robbers flips another over the shoulder in a double move kicks a gun from a robber's hand and jumps on him  He then turns to the camera and a photograph of SpiderMan swinging off a roof crawling down a building saluting the cops is shown to the Bugle's editor J Jonah Jameson  Peter hands back his photographs to a girl at a desk who writes a check and Peter has his camera slung around his neck  Across the city in the highrise Oscorp building Norman is chairing a meeting  he rises and faces the other ten board members glares at Henry Balkan sitting directly opposite him while the older man sips from a cup of coffee with his gaze fixed on Norman who wipes his mouth with the back of his hand as a lopsided grin appears on Norman's face  Colorful balloons and costumed revelers fill Times Square and Peter's there with his camera kicking away with it "
        }
      ]
    }
  ]
}