{
  "ground_truth": "The dog yawns and shakes its head. The phone receiver slams into the cradle. The rumpled figure slowly sits up and remains motionless. He musses his hair and stands. The rumpled figure lays down on the bed. It is the face of Dante, and this is Dante's room; this is Dante's life. Dante grabs the dog and wrestles it. The dog licks water from the toilet. The dog stands and wags its tail. A towel-dressed Dante opens the fridge and peers inside. We now see his face. He grabs a half-empty gallon of milk and closes the door. One scoop, two scoops, three scoops, four scoops; chocolate milk mix is heaped into a tumbler. Dante gulps his breakfast. A hand grabs keys from atop a VCR. The car pulls up, with a screech. Feet descend to the ground from the open door. Keys jam into a lock and pop it open. Dante lifts the metal shutter revealing the door. Suddenly, the lights flick on, revealing the glorious interior of the convenience store. A very dark room is barely lit by the daylight. The cat looks at Dante as he passes the camera quickly. The paper bundle is snapped open with scissors. He opens it and grabs two bundles of papers, throwing them inside the store. One rack remains empty. Newspapers slam into the appropriate racks. A coffee filter is placed in a metal pot. Ground coffee follows, and the mix is shoved into place in the coffeemaker. The switch is flicked, and the machine comes to life. The empty newspaper rack with the heading Asbury Park Press seems out of place among all the other stacks of papers. Dante is puzzled and annoyed. He rolls his eyes as it occurs to him. He takes a step back to grab the coin. The register pops open, and a hand extracts a quarter. Through murky glass and thin metal grating, we see Dante approach. He stops and drops a quarter in the slot. He pulls the door down, finally allowing us a clear view as he reaches toward the camera. Dante pulls a stack of newspapers from the Asbury Park Press vending machine. He struggles to hold them all in one hand as he lets the door slam shut. He turns to walk away, but the sound of the quarter dropping into the change slot stops him. The papers drop into the once-empty rack with a resounding flop. The quarter drops back into the register drawer. The lock is gummed up with gum or something hard and obtrusive like gum, preventing the key from being inserted. Dante tries to jam the key into the window shutter lock. He looks down at it. Dante looks around and kicks the shutter angrily.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "The hound yawns and shakes its head. The handset slams into the cradle. The disheveled figure slowly sits up and remains still. He tousles his hair and stands. The disheveled figure lays down on the bed. It is the face of Dante, and this is Dante's chamber; this is Dante's existence. Dante grabs the hound and grapples it. The hound licks liquid from the toilet. The hound stands and wags its tail. A towel-clad Dante opens the fridge and peers inside. We now see his face. He grabs a half-empty gallon of milk and closes the door. One scoop, two scoops, three scoops, four scoops; chocolate milk mixture is heaped into a glass. Dante gulps his breakfast. A hand grabs keys from atop a VCR. The automobile pulls up, with a screech. Feet descend to the ground from the open door. Keys jam into a lock and pop it open. Dante lifts the metal shutter revealing the door. Suddenly, the lights flick on, revealing the splendid interior of the convenience store. A very dark chamber is barely lit by the daylight. The feline looks at Dante as he passes the camera swiftly. The paper bundle is snapped open with scissors. He opens it and grabs two bundles of papers, throwing them inside the store. One rack remains empty. Newspapers slam into the right racks. A coffee filter is placed in a metal pot. Ground coffee follows, and the mixture is shoved into place in the coffeemaker. The switch is flicked, and the machine comes to life. The empty newspaper rack with the heading Asbury Park Press seems out of place among all the other stacks of papers. Dante is bewildered and irritated. He rolls his eyes as it occurs to him. He takes a step back to grab the coin. The register pops open, and a hand extracts a quarter. Through murky glass and thin metal grating, we see Dante approach. He stops and drops a quarter in the slot. He pulls the door down, finally allowing us a clear view as he reaches toward the camera. Dante pulls a stack of newspapers from the Asbury Park Press vending machine. He struggles to hold them all in one hand as he lets the door slam shut. He turns to walk away, but the sound of the quarter dropping into the change slot halts him. The papers drop into the once-empty rack with a resounding thud. The quarter drops back into the register drawer. The lock is gummed up with gum or something hard and obtrusive like gum, preventing the key from being inserted. Dante tries to jam the key into the window shutter lock. He looks down at it. Dante looks around and kicks the shutter angrily."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The dog's head is yawned and shaken by it. Dante slams the phone receiver into the cradle. The motionless figure is slowly sat up. His hair is mussed and he stands. The bed is laid down on by the rumpled figure. It is the face of Dante, and Dante's room; Dante's life is this. The dog is grabbed and wrestled by Dante. Water is licked from the toilet by the dog. Its tail is wagged and the dog stands. The fridge is opened, and inside is peered by a towel-dressed Dante. Dante’s face is now seen by us. A half-empty gallon of milk is grabbed, and the door is closed by him. One scoop, two scoops, three scoops, four scoops, Dante heaps chocolate milk mix into a tumbler. His breakfast is gulped by Dante. Keys are grabbed from atop a VCR by a hand. With a screech, the car is pulled up. The ground is descended to by feet from the open door. Dante jams keys into a lock and pops it open. The metal shutter is lifted by Dante, revealing the door. Suddenly, he flicks the lights on, revealing the glorious interior of the convenience store. Daylight barely lights a very dark room. Dante is looked at by the cat as Dante passes the camera quickly. Dante snaps open the paper bundle with scissors. It is opened by him and two bundles of papers are grabbed, throwing them inside the store. One rack is left empty. He slams newspapers into the appropriate racks. He places a coffee filter in a metal pot. He follows with ground coffee, and the mix is shoved by him into place in the coffeemaker. Dante flicks the switch, and the machine is brought to life. The empty newspaper rack with the heading Asbury Park Press is seemed out of place by it among all the other stacks of papers. He is puzzled and annoyed by it. His eyes are rolled as it occurs to him. A step back is taken by him to grab the coin. The register is popped open, and a quarter is extracted by a hand. Dante is seen by us through murky glass and thin metal grating as he approaches. He stops and drops a quarter in the slot. The door is pulled down by him, finally allowing us a clear view as the camera is reached toward by him. A stack of newspapers is pulled by Dante from the Asbury Park Press vending machine. He struggles to hold them all in one hand as the door is allowed by him to slam shut. He is turned to walk away, but the sound of the quarter dropping into the change slot stops him. The once-empty rack is flopped into by the papers with a resounding flop. The quarter is dropped back into the register drawer by it. Gum or something hard and obtrusive like gum gums up the lock, preventing the key from being inserted. Dante tries to jam the key into the window shutter lock. It is looked down at by him. He looks around and kicks the shutter angrily."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "The dog yawns and shakes its head. The phone receiver slams down. A rumpled figure slowly sits up, motionless. He musses his hair, stands, then lays back down. It's Dante—this is his room, his life. Dante grabs and wrestles the dog, which drinks from the toilet and wags its tail. In a towel, Dante opens the fridge, peers in, and grabs a half-empty milk gallon. He heaps four scoops of chocolate mix into a tumbler and gulps it. A hand grabs keys off a VCR. A car screeches to a stop, feet step out. Keys open a lock, Dante lifts a shutter revealing a door. Lights flick on, revealing the store interior. A dim room glows faintly. A cat watches as Dante passes. He cuts open a paper bundle, grabs two stacks, and tosses them into the store. One rack remains empty. He slams newspapers into racks, prepares coffee, flicks the switch. The empty Asbury Park Press rack feels out of place. Dante rolls his eyes, realizing something. He steps back, grabs a quarter from the register. Through murky glass, he approaches, drops the coin, and opens a vending machine. He pulls out papers, struggling to hold them, lets the door slam shut. Turning to leave, he hears a quarter drop. The papers flop into the rack. The quarter returns to the drawer. The shutter lock is jammed with gum or something hard, blocking the key. Dante tries forcing the key, then angrily kicks the shutter."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "The dog yawns, shakes its head. The phone slams into the cradle. A rumpled figure sits up, musses hair, and stands. Dante lays on the bed. This is Dante's room and life. Dante wrestles the dog, which licks toilet water. Dante, in a towel, opens the fridge, grabs milk. He heaps chocolate mix into a tumbler, gulps breakfast. Keys are grabbed from a VCR. A car screeches up. Keys open a lock. Dante lifts a shutter, revealing a convenience store. A dark room is lit by daylight. A cat watches Dante. Papers are cut, thrown inside. Newspapers slam into racks. Coffee is brewed. An empty rack puzzles Dante. He grabs a quarter from the register. Through glass, Dante drops a quarter in a slot, retrieves newspapers from a vending machine. He struggles with papers, lets the door slam. The quarter drops into the register. The lock is jammed with gum, preventing key insertion. Dante kicks the shutter angrily."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "The dog, with a lazy demeanor, yawns widely and gives its head a vigorous shake. Meanwhile, the phone receiver is abruptly slammed back into its cradle with a loud clatter. A rumpled figure, appearing somewhat disheveled, slowly sits up from a prone position and remains still for a moment, as if gathering his thoughts. He runs his fingers through his tousled hair and then stands up. The same rumpled figure eventually lays back down on the bed, seemingly resigned. This is the face of Dante, and this room, filled with his personal belongings, is unmistakably Dante's; it is a reflection of his life. Dante, with a playful spirit, grabs the dog and engages in a friendly wrestling match. The dog, in turn, licks water from the toilet bowl, then stands up and wags its tail energetically. Dante, now dressed in a towel, opens the refrigerator door and peers inside with curiosity. We are now able to see his face clearly. He reaches in and grabs a half-empty gallon of milk before closing the door with a soft thud. One scoop, then another, followed by a third and a fourth; chocolate milk mix is generously heaped into a tumbler. Dante gulps down his breakfast with gusto. A hand reaches out and grabs a set of keys from atop an old VCR. A car pulls up with a screeching halt. Feet descend to the ground from the open car door. Keys are jammed into a lock, popping it open with a click. Dante lifts the metal shutter, revealing the door behind it. Suddenly, the lights flick on, illuminating the glorious interior of the convenience store. A very dark room is barely illuminated by the faint daylight streaming in. A cat looks at Dante as he quickly passes by the camera. The paper bundle is snapped open with a pair of scissors. He opens it and grabs two bundles of papers, tossing them inside the store. One rack remains conspicuously empty. Newspapers are slammed into their appropriate racks with precision. A coffee filter is placed into a metal pot, followed by ground coffee, and the mix is shoved into place in the coffeemaker. The switch is flicked, and the machine whirs to life. The empty newspaper rack, with the heading Asbury Park Press, seems out of place among all the other stacks of papers. Dante is puzzled and visibly annoyed. He rolls his eyes as the realization dawns on him. He takes a step back to grab a coin. The register pops open, and a hand extracts a quarter. Through murky glass and thin metal grating, we see Dante approach. He stops and drops a quarter into the slot. He pulls the door down, finally allowing us a clear view as he reaches toward the camera. Dante pulls a stack of newspapers from the Asbury Park Press vending machine. He struggles to hold them all in one hand as he lets the door slam shut behind him. He turns to walk away, but the sound of the quarter dropping into the change slot stops him in his tracks. The papers drop into the once-empty rack with a resounding flop. The quarter drops back into the register drawer. The lock is gummed up with something sticky and obtrusive, like gum, preventing the key from being inserted. Dante tries to jam the key into the window shutter lock, but it won't budge. He looks down at it in frustration. Dante looks around, exasperated, and kicks the shutter angrily."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "The dog, exuding an aura of laziness, yawns with a wide, exaggerated motion and then gives its head a vigorous and energetic shake. Meanwhile, the phone receiver is abruptly slammed back into its cradle, producing a loud and startling clatter. A rumpled figure, appearing somewhat disheveled and slightly unkempt, gradually sits up from a prone position, remaining still for a moment as though he is gathering his scattered thoughts. He runs his fingers through his tousled and messy hair, and then slowly rises to his feet. The same rumpled figure eventually reclines back down onto the bed, seemingly resigned to his fate. This is the face of Dante, and this room, filled with his personal belongings and intimate items, is unmistakably Dante's; it serves as a reflection of his life and persona. Dante, with a spirit that is both playful and lighthearted, grabs the dog and engages in an animated and friendly wrestling match. The dog, in response, eagerly laps up water from the toilet bowl, then stands up and exuberantly wags its tail with enthusiasm. Dante, now attired in nothing but a towel, opens the refrigerator door and peers inside with a look of curiosity. We are now able to clearly see his face as he reaches in and grabs a half-empty gallon of milk. He closes the door with a soft and gentle thud. One scoop, followed by another, then a third and a fourth; chocolate milk mix is generously heaped into a tumbler. Dante gulps down his breakfast drink with gusto and satisfaction. A hand reaches out and grabs a set of keys from atop an old VCR, a relic of another time. A car arrives, coming to a screeching halt. Feet descend to the ground from the open car door. Keys are swiftly jammed into a lock, popping it open with a distinct click. Dante lifts the metal shutter, revealing the door behind it. Suddenly, the lights flick on, illuminating the glorious interior of the convenience store. A very dark room is barely illuminated by the faint daylight that streams in. A cat looks at Dante as he quickly passes by the camera, its eyes following his movement. The paper bundle is snapped open with a pair of scissors. He opens it and grabs two bundles of papers, tossing them inside the store with casual precision. One rack remains conspicuously and markedly empty. Newspapers are slammed into their appropriate and designated racks with precision. A coffee filter is carefully placed into a metal pot, followed by the addition of ground coffee. The mix is then shoved into place in the coffeemaker. The switch is flicked on, and the machine whirs to life. The empty newspaper rack, with the prominent heading Asbury Park Press, seems oddly out of place among all the other stacks of papers. Dante is puzzled and visibly annoyed by this oddity. He rolls his eyes dramatically as the realization dawns on him. He takes a step back to grab a coin from his pocket. The register pops open, and a hand extracts a shiny quarter. Through murky glass and thin metal grating, we see Dante approach. He stops and deposits the quarter into the slot. He pulls the door down, finally allowing us a clear and unobstructed view as he reaches toward the camera. Dante pulls a stack of newspapers from the Asbury Park Press vending machine, struggling to hold them all in one hand. He allows the door to slam shut behind him as he turns to walk away, but the sound of the quarter dropping into the change slot stops him in his tracks. The papers are dropped into the once-empty rack with a resounding and satisfying flop. The quarter drops back into the register drawer with a soft clink. The lock is gummed up with something sticky and obtrusive, like stubborn gum, preventing the key from being inserted smoothly. Dante tries to jam the key into the window shutter lock, but it stubbornly refuses to budge. He looks down at it in frustration. Dante looks around, visibly exasperated and annoyed, and then kicks the shutter angrily in a moment of irritation."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "The dog begins by opening its mouth wide in a yawn, stretching its jaw, and then follows with a vigorous shake of its head, causing its ears to flap. Meanwhile, the phone receiver is forcefully slammed back into its cradle, making a sharp sound as it connects. A rumpled figure, who has been lying down, slowly pushes himself up into a sitting position, his movements deliberate and sluggish, and then pauses, remaining motionless for a moment as if gathering his thoughts. He reaches up to muss his hair, running his fingers through it in a disheveled manner, before rising to his feet. The same rumpled figure then lowers himself back onto the bed, lying down once more. This figure is revealed to be Dante, and the room around him is unmistakably his, filled with the personal touches of his life. Dante reaches out to grab the dog, engaging it in a playful wrestling match, their movements a blur of energy. The dog, after the play, trots over to the toilet and begins to lap up water, its tongue flicking in and out. Once satisfied, the dog stands up and wags its tail, a sign of contentment. Meanwhile, Dante, now dressed in a towel, approaches the fridge, opens the door, and peers inside, his eyes scanning the contents. We catch a glimpse of his face as he reaches in to grab a half-empty gallon of milk, then closes the fridge door with a soft thud. He proceeds to heap one scoop, then another, followed by a third and fourth of chocolate milk mix into a tumbler, creating a small mound of powder. Dante then gulps down his breakfast, the liquid disappearing quickly. A hand reaches out to grab a set of keys resting atop a VCR, and soon after, a car pulls up with a screech, the tires protesting against the pavement. Feet descend from the open car door, touching the ground with purpose. The keys are jammed into a lock, and with a twist, the lock pops open. Dante lifts the metal shutter, revealing a door behind it. Suddenly, the lights flick on, illuminating the interior of a convenience store in all its glory. In a very dark room, barely lit by the daylight filtering in, a cat watches Dante as he quickly passes by the camera. Dante uses scissors to snap open a paper bundle, the blades slicing through the binding. He opens the bundle and grabs two stacks of papers, tossing them inside the store with a practiced motion. One rack remains conspicuously empty. He slams newspapers into the appropriate racks, each one landing with a satisfying thud. A coffee filter is placed into a metal pot, followed by ground coffee, and the mix is shoved into place within the coffeemaker. A switch is flicked, and the machine whirs to life, beginning its brewing process. The empty newspaper rack, labeled Asbury Park Press, stands out among the other stacks of papers, its emptiness puzzling and annoying Dante. He rolls his eyes as realization dawns on him. He steps back to retrieve a coin, and the register pops open, allowing a hand to extract a quarter. Through murky glass and thin metal grating, Dante approaches, stopping to drop a quarter into a slot. He pulls the door down, giving us a clear view as he reaches toward the camera. Dante pulls a stack of newspapers from the Asbury Park Press vending machine, struggling to hold them all in one hand as the door slams shut behind him. He turns to walk away, but the sound of the quarter dropping into the change slot catches his attention, causing him to pause. The papers are dropped into the once-empty rack with a resounding flop, and the quarter is returned to the register drawer. However, the lock is gummed up with something hard and obtrusive, like gum, preventing the key from being inserted. Dante attempts to jam the key into the window shutter lock, but it refuses to budge. Frustrated, he looks down at the lock, then glances around before kicking the shutter angrily, venting his irritation."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "The dog yawns, shakes its head, and then wags its tail as Dante, rumpled and just awake, sits up, musses his hair, and stands. After wrestling playfully with the dog, which drinks from the toilet, Dante, now wrapped in a towel, opens the fridge, grabs a half-empty gallon of milk, and prepares a chocolate milk breakfast with several scoops of mix. He gulps it down, grabs his keys from atop a VCR, and drives to the convenience store, screeching to a halt. \n\nDante unlocks and lifts the metal shutter, revealing the store's interior as the lights flick on. In the dimly lit room, he quickly passes a cat and uses scissors to open a paper bundle, filling most racks with newspapers except for one labeled Asbury Park Press. Puzzled and annoyed by the empty rack, he retrieves a quarter from the register, approaches the vending machine, and inserts the coin to access a stack of newspapers. Struggling to hold them, he lets the door slam shut, but the sound of the quarter dropping back into the change slot catches his attention. He fills the empty rack with the newspapers and returns the quarter to the register. \n\nFrustrated by a gummed-up lock preventing him from inserting the key into the window shutter, Dante looks around and kicks the shutter in anger."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "The dog, a loyal golden retriever who often accompanies Dante on morning walks, yawns and shakes its head. The phone receiver slams into the cradle with the frustration of a missed call. The rumpled figure, having just awoken from a restless sleep, slowly sits up and remains motionless. He musses his hair, a habit he developed during his college years, and stands. The rumpled figure lays down on the bed with the exhaustion typical of someone who works late nights. It is the face of Dante, a local resident known for his work at the community convenience store, and this is Dante's room; this is Dante's life. Dante grabs the dog, his daily source of joy and companionship, and wrestles it. The dog, echoing canine instincts, licks water from the toilet. The dog stands and wags its tail, eager to start the day. A towel-dressed Dante, fresh from a morning shower, opens the fridge and peers inside. We now see his face, reflecting the early morning light. He grabs a half-empty gallon of milk, a staple from the local dairy farm, and closes the door. One scoop, two scoops, three scoops, four scoops; chocolate milk mix, a brand he's used since childhood, is heaped into a tumbler. Dante gulps his breakfast, a quick meal before heading to work. A hand grabs keys from atop a VCR, an old relic from Dante's parents that still occupies a place in his living room. The car pulls up, with a screech, reflecting its need for a brake check. Feet descend to the ground from the open door of his reliable sedan. Keys jam into a lock and pop it open, revealing a sense of routine. Dante lifts the metal shutter revealing the door to the convenience store where he works. Suddenly, the lights flick on, revealing the glorious interior of the store, a favorite spot for locals to grab coffee and newspapers. A very dark room is barely lit by the daylight creeping in from the street. The cat looks at Dante as he passes the camera quickly, a store mascot known for napping on the counter. The paper bundle is snapped open with scissors, a skill Dante mastered during his first weeks on the job. He opens it and grabs two bundles of papers, throwing them inside the store efficiently. One rack remains empty. Newspapers slam into the appropriate racks, ready for the morning rush. A coffee filter is placed in a metal pot. Ground coffee follows, sourced from a local roaster, and the mix is shoved into place in the coffeemaker. The switch is flicked, and the machine comes to life, its aroma filling the air. The empty newspaper rack with the heading Asbury Park Press, a popular local publication, seems out of place among all the other stacks of papers. Dante is puzzled and annoyed, a frequent occurrence when deliveries are missed. He rolls his eyes as it occurs to him that he forgot to refill it. He takes a step back to grab the coin. The register, an old model installed when the store first opened, pops open and a hand extracts a quarter. Through murky glass and thin metal grating, we see Dante approach the vending machine outside. He stops and drops a quarter in the slot. He pulls the door down, finally allowing us a clear view as he reaches toward the camera. Dante pulls a stack of newspapers from the Asbury Park Press vending machine, careful not to drop any. He struggles to hold them all in one hand as he lets the door slam shut, a task he's perfected over time. He turns to walk away, but the sound of the quarter dropping into the change slot stops him, reminding him he needs more change. The papers drop into the once-empty rack with a resounding flop, ready for eager customers. The quarter drops back into the register drawer, slightly worn from frequent use. The lock is gummed up with gum or something hard and obtrusive like gum, preventing the key from being inserted, a frustrating problem he's encountered before. Dante tries to jam the key into the window shutter lock. He looks down at it, contemplating a solution. Dante looks around and kicks the shutter angrily, expressing his morning frustrations."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "The dog yawns and shakes its head  The phone receiver slams into the cradle  The rumpled figure slowly sits up and remains motionless  He musses his hair and stands  The rumpled figure lays down on the bed  It is the face of Dante and this is Dante's room  this is Dante's life  Suddenly the lights flick on revealing the glorious interior of the convenience store  A very dark room is barely lit by the daylight  The cat looks at Dante as he passes the camera quickly  The paper bundle is snapped open with scissors  He opens it and grabs two bundles of papers throwing them inside the store  One rack remains empty  Newspapers slam into the appropriate racks  A coffee filter is placed in a metal pot  Ground coffee follows and the mix is shoved into place in the coffeemaker  The switch is flicked and the machine comes to life  The empty newspaper rack with the heading Asbury Park Press seems out of place among all the other stacks of papers  Dante is puzzled and annoyed  He rolls his eyes as it occurs to him  He takes a step back to grab the coin  The register pops open and a hand extracts a quarter  Through murky glass and thin metal grating we see Dante approach  He stops and drops a quarter in the slot  He pulls the door down finally allowing us a clear view as he reaches toward the camera  Dante pulls a stack of newspapers from the Asbury Park Press vending machine  He struggles to hold them all in one hand as he lets the door slam shut  He turns to walk away but the sound of the quarter dropping into the change slot stops him  The papers drop into the onceempty rack with a resounding flop  The quarter drops back into the register drawer  The lock is gummed up with gum or something hard and obtrusive like gum preventing the key from being inserted  Dante grabs the dog and wrestles it  The dog licks water from the toilet  The dog stands and wags its tail  A toweldressed Dante opens the fridge and peers inside  We now see his face  He grabs a halfempty gallon of milk and closes the door  One scoop two scoops three scoops four scoops chocolate milk mix is heaped into a tumbler  Dante gulps his breakfast  A hand grabs keys from atop a VCR  The car pulls up with a screech  Feet descend to the ground from the open door  Keys jam into a lock and pop it open  Dante lifts the metal shutter revealing the door  Suddenly the lights flick on revealing the glorious interior of the convenience store  A very dark room is barely lit by the daylight  The cat looks at Dante as he passes the camera quickly  The paper bundle is snapped open with scissors  He opens it and grabs two bundles of papers throwing them inside the store  One rack remains empty  Newspapers slam into the appropriate racks  A coffee filter is placed in a metal pot  Ground coffee follows and the mix is shoved into place in the coffeemaker  The switch is flicked and the machine comes to life  The empty newspaper rack with the heading Asbury Park Press seems out of place among all the other stacks of papers  Dante is puzzled and annoyed  He rolls his eyes as it occurs to him  He takes a step back to grab the coin  The register pops open and a hand extracts a quarter  Through murky glass and thin metal grating we see Dante approach  He stops and drops a quarter in the slot  He pulls the door down finally allowing us a clear view as he reaches toward the camera  Dante pulls a stack of newspapers from the Asbury Park Press vending machine  He struggles to hold them all in one hand as he lets the door slam shut  He turns to walk away but the sound of the quarter dropping into the change slot stops him  The papers drop into the onceempty rack with a resounding flop  The quarter drops back into the register drawer  The lock is gummed up with gum or something hard and obtrusive like gum preventing the key from being inserted  Dante tries to jam the key into the window shutter lock  He looks down at it  Dante looks around and kicks the shutter angrily"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "The dog yawns and shakes its head. The phone receiver slams into the cradle. The rumpled figure slowly sits up and remains motionless. He musses his hair and stands. The rumpled figure lays down on the bed. It is the face of Dante and this is Dante's room. this is Dante's life. Dante grabs the dog and wrestles it. The dog licks water from the toilet. The dog stands and wags its tail. A toweldressed Dante opens the fridge and peers inside. We now see his face. He grabs a halfempty gallon of milk and closes the door. One scoop two scoops three scoops four scoops chocolate milk mix is heaped into a tumbler. Dante gulps his breakfast. A hand grabs keys from atop a VCR. The car pulls up with a screech. Feet descend to the ground from the open door. Keys jam into a lock and pop it open. Dante lifts the metal shutter revealing the door. Suddenly the lights flick on revealing the glorious interior of the convenience store. A very dark room is barely lit by the daylight. The cat looks at Dante as he passes the camera quickly. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. The paper bundle is snapped open with scissors. He opens it and grabs two bundles of papers throwing them inside the store. One rack remains empty. Newspapers slam into the appropriate racks. A coffee filter is placed in a metal pot. Ground coffee follows and the mix is shoved into place in the coffeemaker. The switch is flicked and the machine comes to life. The empty newspaper rack with the heading Asbury Park Press seems out of place among all the other stacks of papers. Dante is puzzled and annoyed. He rolls his eyes as it occurs to him. He takes a step back to grab the coin. The register pops open and a hand extracts a quarter. Through murky glass and thin metal grating we see Dante approach. He stops and drops a quarter in the slot. He pulls the door down finally allowing us a clear view as he reaches toward the camera. Dante pulls a stack of newspapers from the Asbury Park Press vending machine. He struggles to hold them all in one hand as he let us the door slam shut. He turns to walk away but the sound of the quarter dropping into the change slot stops him. The papers drop into the onceempty rack with a resounding flop. The quarter drops back into the register drawer. The lock is gummed up with gum or something hard and obtrusive like gum preventing the key from being inserted. Dante tries to jam the key into the window shutter lock. He looks down at it. Dante looks around and kicks the shutter angrily."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "The dog yawns and shakes its head. The phone receiver slams into the cradle. The rumpled figure slowly sits up and remains motionless. He musses his hair and stands. The rumpled figure lays down on the bed. It is the face of Dante and this is Dante's room. this is Dante's life. Dante grabs the dog and wrestles it. The dog licks water from the toilet. The dog stands and wags its tail. A toweldressed Dante opens the fridge and peers inside. We now see his face. He grabs a halfempty gallon of milk and closes the door. One scoop two scoops three scoops four scoops chocolate milk mix is heaped into a tumbler. Dante gulps his breakfast. A hand grabs keys from atop a VCR. The car pulls up with a screech. Feet descend to the ground from the open door. Keys jam into a lock and pop it open. Dante lifts the metal shutter revealing the door. Suddenly the lights flick on revealing the glorious interior of the convenience store. A very dark room is barely lit by the daylight. The cat looks at Dante as he passes the camera quickly. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. The paper bundle is snapped open with scissors. He opens it and grabs two bundles of papers throwing them inside the store. One rack remains empty. Newspapers slam into the appropriate racks. A coffee filter is placed in a metal pot. Ground coffee follows and the mix is shoved into place in the coffeemaker. The switch is flicked and the machine comes to life. The empty newspaper rack with the heading Asbury Park Press seems out of place among all the other stacks of papers. Dante is puzzled and annoyed. He rolls his eyes as it occurs to him. He takes a step back to grab the coin. The register pops open and a hand extracts a quarter. Through murky glass and thin metal grating we see Dante approach. He stops and drops a quarter in the slot. He pulls the door down finally allowing us a clear view as he reaches toward the camera. Dante pulls a stack of newspapers from the Asbury Park Press vending machine. He struggles to hold them all in one hand as he let us the door slam shut. He turns to walk away but the sound of the quarter dropping into the change slot stops him. The papers drop into the onceempty rack with a resounding flop. The quarter drops back into the register drawer. The lock is gummed up with gum or something hard and obtrusive like gum preventing the key from being inserted. Dante tries to jam the key into the window shutter lock. He looks down at it. Dante looks around and kicks the shutter angrily."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "The dog yawns and shakes its head. The phone receiver slams into the cradle. The rumpled figure slowly sits up and remains motionless. He musses his hair and stands. The rumpled figure lays down on the bed. It is the face of Dante and this is Dante's room. this is Dante's life. Dante grabs the dog and wrestles it. The dog licks water from the toilet. The dog stands and wags its tail. A toweldressed Dante opens the fridge and peers inside. We now see his face. Through murky glass and thin metal grating we see Dante approach. He stops and drops a quarter in the slot. He pulls the door down finally allowing us a clear view as he reaches toward the camera. Dante pulls a stack of newspapers from the Asbury Park Press vending machine. He struggles to hold them all in one hand as he let us the door slam shut. He turns to walk away but the sound of the quarter dropping into the change slot stops him. The papers drop into the onceempty rack with a resounding flop. The quarter drops back into the register drawer. The lock is gummed up with gum or something hard and obtrusive like gum preventing the key from being inserted. Dante tries to jam the key into the window shutter lock. He looks down at it. Dante looks around and kicks the shutter angrily."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "The dog yawns and shakes its head. The phone receiver slams into the cradle. The rumpled figure slowly sits up and remains motionless. He musses his hair and stands. The rumpled figure lays down on the bed. The quarter drops back into the register drawer. The lock is gummed up with gum or something hard and obtrusive like gum preventing the key from being inserted. Dante tries to jam the key into the window shutter lock. He looks down at it. Dante looks around and kicks the shutter angrily."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The cat yawns and shakes its head. The book receiver slams into the cradle. The rumpled figure slowly sits up and remains motionless. The giraffe musses its hair and stands. The rumpled figure lays down on the bed. It is the face of Alex, and this is Alex's room; this is Alex's life. Alex grabs the cat and wrestles it. The cat licks water from the toilet. The cat stands and wags its tail. A towel-dressed Alex opens the fridge and peers inside. We now see its face. It grabs a half-empty gallon of milk and closes the door. One scoop, two scoops, three scoops, four scoops; chocolate milk mix is heaped into a tumbler. Alex gulps its breakfast. A hand grabs keys from atop a VCR. The buffalo pulls up, with a screech. Hooves descend to the ground from the open door. Keys jam into a lock and pop it open. Alex lifts the metal shutter revealing the door. Suddenly, the lights flick on, revealing the glorious interior of the convenience store. A very dark room is barely lit by the daylight. The dog looks at Alex as it passes the camera quickly. The paper bundle is snapped open with scissors. It opens it and grabs two bundles of papers, throwing them inside the store. One rack remains empty. Newspapers slam into the appropriate racks. A coffee filter is placed in a metal pot. Ground coffee follows, and the mix is shoved into place in the coffeemaker. The switch is flicked, and the machine comes to life. The empty newspaper rack with the heading Asbury Park Press seems out of place among all the other stacks of papers. Alex is puzzled and annoyed. It rolls its eyes as it occurs to it. It takes a step back to grab the coin. The register pops open, and a tentacle extracts a quarter. Through murky glass and thin metal grating, we see Alex approach. It stops and drops a quarter in the slot. It pulls the door down, finally allowing us a clear view as it reaches toward the camera. Alex pulls a stack of newspapers from the Asbury Park Press vending machine. It struggles to hold them all in one hand as it lets the door slam shut. It turns to walk away, but the sound of the quarter dropping into the change slot stops it. The papers drop into the once-empty rack with a resounding flop. The quarter drops back into the register drawer. The lock is gummed up with gum or something hard and obtrusive like gum, preventing the key from being inserted. Alex tries to jam the key into the window shutter lock. It looks down at it. Alex looks around and kicks the shutter angrily."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "The cat yawns and shakes its head. The spoon clatters onto the counter. The crumpled figure slowly sits up and remains motionless. He musses his hair and stands. The crumpled figure lays down on the couch. It is the face of Dante, and this is Dante's balcony; this is Dante's life. Dante grabs the cat and wrestles it. The cat licks water from the sink. The cat stands and wags its tail. A towel-dressed Dante opens the oven and peers inside. We now see his face. He grabs a half-empty bottle of juice and closes the door. One scoop, two scoops, three scoops, four scoops; oatmeal is heaped into a bowl. Dante gulps his breakfast. A hand grabs keys from atop a record player. The bus pulls up, with a screech. Feet descend to the ground from the open door. Keys jam into a lock and pop it open. Dante lifts the wooden shutter revealing the door. Suddenly, the lights flick on, revealing the glorious interior of the bakery. A very dark room is barely lit by the daylight. The squirrel looks at Dante as he passes the camera quickly. The paper bundle is snapped open with a knife. He opens it and grabs two bundles of papers, throwing them inside the shop. One bin remains empty. Flyers slam into the appropriate bins. A tea bag is placed in a ceramic mug. Hot water follows, and the mix is shoved into place in the teapot. The switch is flicked, and the kettle comes to life. The empty flyer bin with the heading Coastal Times seems out of place among all the other stacks of flyers. Dante is puzzled and annoyed. He rolls his eyes as it occurs to him. He takes a step back to grab the pebble. The drawer pops open, and a hand extracts a penny. Through murky plastic and thin wooden slats, we see Dante approach. He stops and drops a penny in the slot. He pulls the window down, finally allowing us a clear view as he reaches toward the camera. Dante pulls a stack of flyers from the Coastal Times vending machine. He struggles to hold them all in one hand as he lets the window slam shut. He turns to walk away, but the sound of the penny dropping into the change slot stops him. The flyers drop into the once-empty bin with a resounding flop. The penny drops back into the drawer. The lock is gummed up with putty or something hard and obtrusive like putty, preventing the key from being inserted. Dante tries to jam the key into the awning lock. He looks down at it. Dante looks around and kicks the awning angrily."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "The dog barks and tilts its head. The phone receiver rests in the cradle. The rumpled figure quickly jumps up and gestures wildly. He pats his hair and stretches. The rumpled figure rolls over on the bed. It is the face of Dante, and this is Dante's room; this is Dante's life. Dante gently nudges the dog and strokes it. The dog sniffs flowers from the vase. The dog sits and pricks its ears. A towel-dressed Dante opens the pantry and peers inside. We now see his face. He grabs a half-empty bottle of juice and shuts the door. One pour, two pours, three pours, four pours; chocolate powder is tossed into a glass. Dante sips his breakfast. A hand slides keys from atop a VCR. The car drifts in, with a whisper. Feet jump to the ground from the open door. Keys slide into a lock and twist it open. Dante hoists the metal shutter exposing the door. Suddenly, the lights dim on, revealing the messy interior of the convenience store. A very dark room is slightly brightened by the daylight. The cat glares at Dante as he skips past the camera quickly. The paper bundle is snapped open with a penknife. He unfolds it and grabs two bundles of papers, tossing them inside the store. One rack remains untouched. Newspapers glide into the appropriate racks. A coffee filter is placed in a ceramic pot. Ground coffee follows, and the mix is nudged into place in the coffeemaker. The switch is flipped, and the device hums to life. The empty newspaper rack with the heading Asbury Park Press looks awkward among all the other stacks of papers. Dante is bemused and irked. He sighs as it occurs to him. He inches back to grab the coin. The register slides open, and a hand picks a quarter. Through murky glass and thin metal grating, we see Dante pause. He waits and drops a quarter in the slot. He pulls the door up, finally giving us a clear view as he stretches toward the camera. Dante lifts a stack of newspapers from the Asbury Park Press vending machine. He tries to juggle them all in one hand as he lets the door swing shut. He turns to stroll away, but the sound of the quarter clinking into the change slot halts him. The papers land into the once-empty rack with a gentle thud. The quarter clatters back into the register drawer. The lock is clogged with gum or something firm and obstructive like gum, preventing the key from being turned. Dante attempts to force the key into the window shutter lock. He stares at it. Dante glances around and taps the shutter lightly."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "The umbrella yawns and shakes its head. The television slams into the closet. The crumpled envelope slowly sits up and remains motionless. It rustles its pages and stands. The crumpled envelope lays down on the couch. It is the face of Eliot, and this is Eliot's room; this is Eliot's life. Eliot grabs the umbrella and wrestles it. The umbrella licks water from the sink. The umbrella stands and wags its handle. A robe-dressed Eliot opens the oven and peers inside. We now see its face. It grabs a half-empty carton of juice and closes the door. One scoop, two scoops, three scoops, four scoops; pancake batter mix is heaped into a cup. Eliot gulps its breakfast. A leaf grabs crayons from atop a radio. The bicycle pulls up, with a screech. Toes descend to the ground from the open door. Crayons jam into a lock and pop it open. Eliot lifts the plastic curtain revealing the door. Suddenly, the neon lights flick on, revealing the glorious interior of the laundromat. A very dark shoe is barely lit by the daylight. The lantern looks at Eliot as it passes the camera quickly. The fabric bundle is snapped open with scissors. It opens it and grabs two bundles of fabric, throwing them inside the laundromat. One shelf remains empty. Towels slam into the appropriate shelves. A coffee filter is placed in a metal vase. Ground pepper follows, and the mix is shoved into place in the spice rack. The lever is flicked, and the machine comes to life. The empty towel rack with the heading Coastal Breeze Press seems out of place among all the other stacks of towels. Eliot is puzzled and annoyed. It rolls its eyes as it occurs to it. It takes a step back to grab the marble. The drawer pops open, and a foot extracts a nickel. Through hazy glass and thin wooden grating, we see Eliot approach. It stops and drops a nickel in the slot. It pulls the curtain down, finally allowing us a clear view as it reaches toward the camera. Eliot pulls a stack of towels from the Coastal Breeze Press vending machine. It struggles to hold them all in one foot as it lets the curtain slam shut. It turns to walk away, but the sound of the nickel dropping into the coin slot stops it. The towels drop into the once-empty shelf with a resounding flop. The nickel drops back into the drawer box. The handle is gummed up with tape or something soft and obtrusive like tape, preventing the button from being pressed. Eliot tries to jam the button into the window pane lock. It looks down at it. Eliot looks around and kicks the pane angrily."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "The elephant twitches and nods its trunk. The trumpet valve slams into the case. The crumpled statue slowly rises up and stays still. It fiddles with its trunk and leaps. The crumpled statue sprawls down on the chair. It is the face of Virgil, and this is Virgil's den; this is Virgil's journey. Virgil snatches the elephant and juggles it. The elephant drinks tea from the bathtub. The elephant hops and flicks its ears. A robe-clad Virgil unlocks the pantry and glances inside. We now notice its trunk. It snatches a half-eaten block of cheese and seals the case. One slice, two slices, three slices, four slices; cheddar cubes are heaped into a bowl. Virgil sips his lunch. A foot snatches maps from atop a television. The bus rolls up, with a thud. Antennae float to the ground from the open window. Maps shove into a handle and pry it open. Virgil lifts the wooden door revealing the path. Suddenly, the candles flick on, unveiling the majestic interior of the bookshop. A very quiet room is barely illuminated by the moonlight. The hamster stares at Virgil as it zips past the screen quickly. The letter pack is torn open with claws. It unfolds and snatches two packages of letters, hurling them inside the bookshop. One shelf remains vacant. Catalogs tumble into the designated shelves. A tea bag is placed in a ceramic cup. Hot water follows, and the concoction is pushed into position in the kettle. The button is pressed, and the apparatus whirs to action. The vacant catalog shelf with the label Gotham Magazine seems misplaced among all the other piles of letters. Virgil is baffled and irritated. It raises its trunk as it dawns on him. It takes a step sideways to grasp the token. The drawer pops open, and a foot withdraws a nickel. Through foggy glass and thin metal mesh, we notice Virgil approach. It halts and slips a nickel in the slot. It pulls the curtain up, finally granting us a clear perspective as it reaches toward the screen. Virgil pulls a pile of catalogs from the Gotham Magazine dispenser. It fumbles to clutch them all in one arm as it lets the curtain crash close. It pivots to leap away, but the echo of the nickel clinking into the coin slot halts it. The catalogs land into the once-empty shelf with a resonant thud. The nickel rolls back into the drawer compartment. The handle is stuffed up with clay or something rigid and intrusive like clay, blocking the token from being inserted. Virgil attempts to wedge the token into the door flap handle. It gazes down at it. Virgil gazes around and punches the flap irritably."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "The dog stretches and nods its head. The laptop lid slaps shut with a click. The disheveled figure quickly leaps up and stays frozen. He tousles his coat and jumps. The disheveled figure sprawls on the sofa. It is the face of Dante, and this is Dante's world; this is Dante's reality. Dante grabs the cat and spins it. The cat sips milk from the sink. The cat sits and flicks its ears. A robe-wrapped Dante opens the oven and gazes inside. We now see his expression. He takes a half-full bottle of juice and shuts the door. One shake, two shakes, three shakes, four shakes; protein powder is piled into a pitcher. Dante sips his brunch. A hand lifts coins from atop a DVD player. The bicycle skids up, with a scrape. Feet leap to the ground from the open gate. Coins shove into a slot and pull it ajar. Dante raises the wooden gate revealing the hallway. Suddenly, the shadows brighten, revealing the pristine interior of the cafe. A very dim room is barely brightened by the neon light. The bird stares at Dante as he breezes past the lens quickly. The package is torn open with a cutter. He unfolds it and picks two rolls of files, tossing them into the cafe. One shelf remains vacant. Flyers smack into the designated slots. A tea bag is dropped in a ceramic mug. Hot water follows, and the concoction is pressed into place in the kettle. The lever is pushed, and the device whirrs to life. The vacant flyer shelf with the heading Weekly World News seems out of sync among all the other piles of sheets. Dante is bewildered and vexed. He shakes his head as it dawns on him. He strides backward to clutch the button. The drawer snaps open, and a hand removes a dime. Through foggy glass and thin plastic mesh, we see Dante approach. He halts and slides a dime into the chute. He tugs the box open, finally presenting us a clear view as he reaches toward the lens. Dante pulls a bundle of flyers from the Weekly World News dispenser. He fumbles to cradle them all in one arm as he lets the box bang shut. He spins to stride away, but the clinking of the dime dropping into the return slot halts him. The sheets tumble into the previously vacant shelf with a solid thump. The dime rolls back into the drawer compartment. The mechanism is blocked up with adhesive or something rigid and protruding like adhesive, preventing the coin from being inserted. Dante attempts to shove the coin into the door latch. He glances down at it. Dante glances around and pounds the latch furiously."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "The parrot coughs and spins its wing. The lamp cord slides into the socket. The crumpled statue quickly stands up and floats diligently. It scratches its beak and hops. The crumpled statue rolls over on the sofa. It is the mask of Hector, and this is Hector's cave; this is Hector's dream. Hector grabs the parrot and juggles it. The parrot sips lemonade from the sink. The parrot sits and flaps its wing. A robe-clad Hector shuts the oven and squints inside. We now see its mask. It snatches a half-full bottle of juice and opens the window. One drop, two drops, three drops, four drops; strawberry syrup dust is piled into a goblet. Hector slurps his dinner. A claw snatches watches from beneath a TV. The bicycle zooms by, with a roar. Wings ascend to the sky from the ajar gate. Watches poke into a pin and smack it closed. Hector lowers the golden curtain revealing the gate. Abruptly, the stars flick on, illuminating the radiant exterior of the bookstore. A very bright cavern is barely dim by the moonlight. The monkey gazes at Hector as it scurries past the lens slowly. The cloth package is torn open with claws. It seals it and yanks three packets of cloth, tossing them beyond the house. One basket stays full. Envelopes dash into the misplaced baskets. An ice tray is dropped in a plastic box. Crushed ice follows, and the block is pushed into place in the freezer. The faucet is twisted, and the device wakes up. The full envelope basket with the label New York Times seems in place among all the other towers of envelopes. Hector is confused and delighted. It nods its head as it thinks about this. It paces forward to yank the button. The suitcase snaps open, and a claw lifts a nickel. Through crystal water and thick plastic sheeting, we witness Hector retreat. It advances and slips a nickel in the gap. It nudges the window up, finally permitting us an obscured view as it reaches away from the lens. Hector yanks a heap of envelopes from the New York Times dispensation machine. It fumbles to clasp them all in both paws as it lets the gate creak open. It spins to dash closer, but the noise of the nickel clinking into the money slot freezes it. The envelopes tumble into the full basket with a squishy thud. The nickel clinks forward from the suitcase flap. The pin is filled with yarn or something stretchy and malleable like yarn, obstructing the button from being twisted. Hector attempts to slam the button into the picture window shutter pin. It peers up at them. Hector peers upward and slaps the shutter cheerfully."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "The dog yawns while Dante, disheveled, sits up in his bed. After wrestling with his dog, he grabs milk from the fridge, mixes chocolate milk, and gulps it down as breakfast. Dante picks up his keys and drives to open the convenience store, greeted by the dim light and a cat. He organizes newspapers, puzzled by an empty rack for the Asbury Park Press. Annoyed, he realizes the issue, retrieves a quarter, and buys the missing papers from a vending machine. He fills the rack, but a jammed lock frustrates his efforts to close the shutter, leading him to kick it in anger."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Dante looks around and kicks the shutter angrily He looks down at it  Dante tries to jam the key into the window shutter lock  The lock is gummed up with gum or something hard and obtrusive like gum preventing the key from being inserted  The quarter drops back into the register drawer  The papers drop into the onceempty rack with a resounding flop  He turns to walk away but the sound of the quarter dropping into the change slot stops him  He struggles to hold them all in one hand as he lets the door slam shut  Dante pulls a stack of newspapers from the Asbury Park Press vending machine  He pulls the door down finally allowing us a clear view as he reaches toward the camera  He stops and drops a quarter in the slot  Through murky glass and thin metal grating we see Dante approach  The register pops open and a hand extracts a quarter  He takes a step back to grab the coin  He rolls his eyes as it occurs to him  Dante is puzzled and annoyed  The empty newspaper rack with the heading Asbury Park Press seems out of place among all the other stacks of papers  The switch is flicked and the machine comes to life  Ground coffee follows and the mix is shoved into place in the coffeemaker  A coffee filter is placed in a metal pot  Newspapers slam into the appropriate racks  One rack remains empty  He opens it and grabs two bundles of papers throwing them inside the store  The paper bundle is snapped open with scissors  The cat looks at Dante as he passes the camera quickly  A very dark room is barely lit by the daylight  Suddenly the lights flick on revealing the glorious interior of the convenience store  Dante lifts the metal shutter revealing the door  Keys jam into a lock and pop it open  Feet descend to the ground from the open door  The car pulls up with a screech  A hand grabs keys from atop a VCR  Dante gulps his breakfast  One scoop two scoops three scoops four scoops chocolate milk mix is heaped into a tumbler  He grabs a halfempty gallon of milk and closes the door  We now see his face  A toweldressed Dante opens the fridge and peers inside  The dog stands and wags its tail  The dog licks water from the toilet  Dante grabs the dog and wrestles it  this is Dante's life  It is the face of Dante and this is Dante's room  The rumpled figure lays down on the bed  He musses his hair and stands  The rumpled figure slowly sits up and remains motionless  The phone receiver slams into the cradle  The dog yawns and shakes its head "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "The dog yawns and shakes its head  One scoop two scoops three scoops four scoops chocolate milk mix is heaped into a tumbler  Dante is puzzled and annoyed  The phone receiver slams into the cradle  The quarter drops back into the register drawer  The cat looks at Dante as he passes the camera quickly  He stops and drops a quarter in the slot  Feet descend to the ground from the open door  Ground coffee follows and the mix is shoved into place in the coffeemaker  One rack remains empty  Newspapers slam into the appropriate racks  He looks down at it  A hand grabs keys from atop a VCR  A toweldressed Dante opens the fridge and peers inside  The dog stands and wags its tail  The empty newspaper rack with the heading Asbury Park Press seems out of place among all the other stacks of papers  He turns to walk away but the sound of the quarter dropping into the change slot stops him  this is Dante's life  Dante lifts the metal shutter revealing the door  A very dark room is barely lit by the daylight  He struggles to hold them all in one hand as he lets the door slam shut  We now see his face  Suddenly the lights flick on revealing the glorious interior of the convenience store  He rolls his eyes as it occurs to him  The dog licks water from the toilet  Dante looks around and kicks the shutter angrily He musses his hair and stands  The lock is gummed up with gum or something hard and obtrusive like gum preventing the key from being inserted  The papers drop into the onceempty rack with a resounding flop  A coffee filter is placed in a metal pot  He takes a step back to grab the coin  He pulls the door down finally allowing us a clear view as he reaches toward the camera  Dante gulps his breakfast  Dante tries to jam the key into the window shutter lock  The rumpled figure lays down on the bed  He grabs a halfempty gallon of milk and closes the door  The paper bundle is snapped open with scissors  Keys jam into a lock and pop it open  Through murky glass and thin metal grating we see Dante approach  It is the face of Dante and this is Dante's room  He opens it and grabs two bundles of papers throwing them inside the store  Dante grabs the dog and wrestles it  The register pops open and a hand extracts a quarter  The switch is flicked and the machine comes to life  The rumpled figure slowly sits up and remains motionless  The car pulls up with a screech  Dante pulls a stack of newspapers from the Asbury Park Press vending machine "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "He opens it and grabs two bundles of papers throwing them inside the store  One rack remains empty  Newspapers slam into the appropriate racks  A coffee filter is placed in a metal pot  Ground coffee follows and the mix is shoved into place in the coffeemaker  The switch is flicked and the machine comes to life  The empty newspaper rack with the heading Asbury Park Press seems out of place among all the other stacks of papers  Dante is puzzled and annoyed  He rolls his eyes as it occurs to him  He takes a step back to grab the coin  The register pops open and a hand extracts a quarter  Through murky glass and thin metal grating we see Dante approach  He stops and drops a quarter in the slot  He pulls the door down finally allowing us a clear view as he reaches toward the camera  Dante pulls a stack of newspapers from the Asbury Park Press vending machine  He struggles to hold them all in one hand as he lets the door slam shut  He turns to walk away but the sound of the quarter dropping into the change slot stops him  The papers drop into the onceempty rack with a resounding flop  The quarter drops back into the register drawer  The lock is gummed up with gum or something hard and obtrusive like gum preventing the key from being inserted  Dante tries to jam the key into the window shutter lock  He looks down at it  Dante looks around and kicks the shutter angrily The dog yawns and shakes its head  The phone receiver slams into the cradle  The rumpled figure slowly sits up and remains motionless  He musses his hair and stands  The rumpled figure lays down on the bed  It is the face of Dante and this is Dante's room  this is Dante's life  Dante grabs the dog and wrestles it  The dog licks water from the toilet  The dog stands and wags its tail  A toweldressed Dante opens the fridge and peers inside  We now see his face  He grabs a halfempty gallon of milk and closes the door  One scoop two scoops three scoops four scoops chocolate milk mix is heaped into a tumbler  Dante gulps his breakfast  A hand grabs keys from atop a VCR  The car pulls up with a screech  Feet descend to the ground from the open door  Keys jam into a lock and pop it open  Dante lifts the metal shutter revealing the door  Suddenly the lights flick on revealing the glorious interior of the convenience store  A very dark room is barely lit by the daylight  The cat looks at Dante as he passes the camera quickly  The paper bundle is snapped open with scissors "
        }
      ]
    }
  ]
}