{
  "ground_truth": "In his room, Peter, his shadow thrown behind him onto the wall, stares at his own hand held out. His back resting on a pillow, Peter stares into space, his steely blue eyes bright and determined. Outside in a dark alley with ominous clouds in the sky, Peter stands with his Spider-Man costume held out in front of him. The wind ruffles his hair as he remains still for a moment. He drops the costume, then walks down the alley and away from the dust bin into which he has consigned the last vestige of the superhero. The sun shines as Peter, with a jaunty gait, strides through the city. Peter trips on the sidewalk. He awkwardly gets to his feet, reaches into his pocket, and hauls out his spectacles. He flicks them open, puts them on, and sets off a little wet. At home, he tightens up a wheel on his moped and spins it. The wheel rolls off the front forks and bounces out of the open window. He strolls away from a hot dog man and stands at the curve. Cop cars and vans and officers on foot race off in one direction. Peter munches his hot dog and sets off in the other. In his room, he studies. Peter's hand goes up. Peter grins proudly. On the campus, Doctor Connors races up to him. Peter stops and smiles. At the theater, MJ is distracted when she sees Peter in the audience. He grins inanely. She smiles sweetly. She ignores the prompt. She turns to her costar. MJ and Peter walk down the street side-by-side. Peter, standing beside her, gazes at her earnestly. Then they both resume walking. He looks at her through doleful eyes, and she scrutinizes his features. She turns away and crosses to a yellow cab. She opens the door of the cab and, before getting in, turns to look at him once more. Peter half smiles as MJ steps into the cab, shuts the door, and watches as the cab drives away. He slips on his spectacles. At the Bugle, a headline is being composed. Jameson's on the phone. He pulls Spider-Man's mask from a bag. Out comes the rest of the costume. The disgruntled garbage man goes. Robbie fondles the mask. In his office, Jameson, in the Spider-Man costume minus the mask, leaps onto his desk, a big cigar in his mouth. He flexes his wrists as if shooting out webs. His staff peer in through the slatted blinds. Robbie shakes his head. Two girls overtake him and giggle. He smiles and walks on past an alleyway. He sees two muggers attacking a dark-haired youth. Peter turns his back away, leaving the muggers punching and kicking their fallen victim.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "In his chamber, Peter, his silhouette cast behind him onto the partition, gazes at his own hand extended out. His back reclining on a cushion, Peter gazes into void, his steely blue optics vivid and resolute. Outside in a murky passage with menacing clouds in the heavens, Peter stands with his Spider-Man attire held out in front of him. The breeze tousles his locks as he remains immobile for a moment. He drops the attire, then strides down the passage and away from the dustbin into which he has consigned the last remnant of the superhero. The sun gleams as Peter, with a jaunty stride, strides through the metropolis. Peter stumbles on the pavement. He awkwardly gets to his feet, reaches into his pocket, and hauls out his spectacles. He flicks them open, puts them on, and sets off a little damp. At home, he tightens up a wheel on his moped and rotates it. The wheel rolls off the front forks and rebounds out of the open window. He strolls away from a hot dog vendor and stands at the curve. Cop vehicles and vans and officers on foot dash off in one direction. Peter munches his hot dog and sets off in the other. In his chamber, he studies. Peter's hand ascends. Peter grins proudly. On the campus, Doctor Connors dashes up to him. Peter halts and smiles. At the theater, MJ is preoccupied when she sees Peter in the audience. He grins inanely. She smiles sweetly. She disregards the prompt. She turns to her costar. MJ and Peter walk down the street side-by-side. Peter, standing beside her, gazes at her sincerely. Then they both resume walking. He looks at her through sorrowful optics, and she scrutinizes his features. She turns away and crosses to a yellow taxi. She opens the door of the taxi and, before getting in, turns to look at him once more. Peter half smiles as MJ steps into the taxi, shuts the door, and watches as the taxi drives away. He slips on his spectacles. At the Bugle, a headline is being composed. Jameson's on the phone. He extracts Spider-Man's mask from a bag. Out emerges the remainder of the attire. The disgruntled trash man departs. Robbie fondles the mask. In his office, Jameson, in the Spider-Man attire minus the mask, springs onto his desk, a big cigar in his mouth. He flexes his wrists as if shooting out webs. His staff peeks in through the slatted shades. Robbie shakes his head. Two girls overtake him and titter. He smiles and walks on past an alleyway. He sees two thieves assaulting a dark-haired youth. Peter turns his back away, leaving the thieves punching and kicking their fallen victim."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "In his room, Peter, his shadow being thrown behind him onto the wall, is stared at by his own hand held out. His back resting on a pillow, space is stared into by Peter, his steely blue eyes bright and determined. Outside in a dark alley with ominous clouds in the sky, Peter is stood by his Spider-Man costume being held out in front of him. His hair is ruffled by the wind as he is remained still for a moment. The costume is dropped, then the alley is walked down and away from the dust bin consigning the last vestige of the superhero to it. The sun shines as the city is stridden through by Peter with a jaunty gait. The sidewalk is tripped on by Peter. His feet are awkwardly gotten to by him, his pocket is reached into, and his spectacles are hauled out. They are flicked open, put on, and he is set off a little wet. At home, a wheel on his moped is tightened up and spun by him. The wheel rolls off the front forks and is bounced out of the open window. A hot dog man is strolled away from by him and the curve is stood at. In one direction, cop cars and vans and officers on foot race off. A hot dog is munched by Peter and the other direction is set off in. In his room, studying is done by him. Peter's hand is put up. A proud grin is given by Peter. On the campus, Doctor Connors races up to him. Peter is stopped and smiled at. At the theater, Peter is seen by MJ in the audience, distracting her. An inane grin is given by him. A sweet smile is given by her. The prompt is ignored by her. Her costar is turned to by her. The street is walked down by MJ and Peter side-by-side. Peter, standing beside her, is gazed at earnestly by him. Walking is then resumed by them both. Through doleful eyes, she is looked at by him, and his features are scrutinized by her. Away is turned by her and a yellow cab is crossed to. The door of the cab is opened by her, and before getting in, he is turned to and looked at once more by her. A half smile is given by Peter as the cab is stepped into by MJ, the door is shut, and the cab is watched as it drives away. His spectacles are slipped on by him. At the Bugle, a headline is composing. The phone is held by Jameson. Spider-Man's mask is pulled by him from a bag. The rest of the costume comes out. The disgruntled garbage man goes. The mask is fondled by Robbie. In his office, Jameson, in the Spider-Man costume minus the mask, is leapt onto his desk by himself, a big cigar in his mouth. His wrists are flexed by him as if webs are being shot out. Through the slatted blinds his staff peer in. Robbie shakes his head. He is overtaken by two girls who giggle. On past an alleyway walking is done with a smile. Two muggers attacking a dark-haired youth are seen by him. Peter turns away, leaving the muggers punching and kicking their fallen victim."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "In his room, Peter, with his shadow cast on the wall, stares at his hand. Reclining on a pillow, his steely blue eyes shine with determination. Outside, in a dark alley beneath ominous clouds, he holds out his Spider-Man costume. The wind tousles his hair as he stands still momentarily. He drops the costume and walks away from the dust bin where he discarded it. The sun shines as Peter, with a jaunty stride, moves through the city. He trips on the sidewalk, awkwardly gets up, retrieves his glasses, puts them on, and continues dampened. At home, he tightens his moped wheel, which rolls out the window. He leaves a hot dog vendor, standing at the curb as cop cars rush past. Peter eats his hot dog and heads in the opposite direction. In his room, he studies, raising his hand with a proud grin. On campus, Doctor Connors approaches him. Peter stops, smiling. MJ notices Peter in the theater audience and smiles sweetly. Ignoring the prompt, she turns to her co-star. MJ and Peter walk together, he gazes at her earnestly. She scrutinizes him, then turns to a yellow cab. Before entering, she looks back; Peter half smiles as she shuts the door. At the Bugle, a headline is formed. Jameson, on the phone, pulls Spider-Man's mask and costume from a bag. Robbie handles the mask. In his office, Jameson, wearing the costume minus the mask, leaps on his desk with a cigar, mimicking webs. Staff peer through blinds; Robbie shakes his head. Two girls giggle as they pass him. He sees muggers attacking a youth but turns away, leaving the muggers to continue."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "In his room, Peter, shadow cast behind him, stares at his hand. Leaning on a pillow, his steely blue eyes are determined. Outside in a dark alley, with ominous clouds, Peter holds out his Spider-Man costume. The wind ruffles his hair as he drops the costume and walks away from the dust bin. The sun shines as Peter struts through the city, trips on the sidewalk, and awkwardly stands up. He puts on his spectacles and continues. At home, he tightens his moped wheel, which rolls out the window. Peter eats a hot dog, ignoring cop cars racing by. In his room, he studies and raises his hand proudly. On campus, Doctor Connors approaches; Peter smiles. At the theater, MJ notices Peter in the audience and smiles sweetly. They walk together, Peter gazing earnestly, and MJ scrutinizes him. She gets into a cab, looks at Peter once more, and he half smiles as she leaves. At the Bugle, Jameson finds Spider-Man's costume. Wearing it minus the mask, he leaps onto his desk with a cigar. His staff peers in while Robbie shakes his head. Two girls pass giggling. Peter sees muggers attacking a youth but turns away."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "In the quiet solitude of his room, Peter finds himself lost in thought, his shadow cast dramatically behind him onto the wall. With his hand extended in front of him, he stares intently at it, his back comfortably resting against a pillow as he gazes into the distance. His steely blue eyes shine brightly with a determined gleam. Meanwhile, outside, in a dark alley where ominous clouds gather thickly in the sky, Peter stands holding his Spider-Man costume out in front of him. The wind gently tousles his hair as he remains motionless, absorbing the moment. After a pause, he lets the costume slip from his grasp and slowly walks away down the alley, leaving behind the dust bin into which he has cast away the last remnant of his superhero identity. As the sun shines brightly overhead, Peter, with a jaunty stride in his step, makes his way through the bustling city streets. He trips over an uneven spot on the sidewalk and awkwardly gets back on his feet, reaches into his pocket, and takes out his spectacles. He flicks them open deftly, puts them on, and continues his journey, feeling slightly damp. Once home, he busies himself by tightening a loose wheel on his moped. To his surprise, the wheel rolls off the front forks and bounces out of his open window. Later, he strolls away from a hot dog vendor with his snack in hand, standing at the street's edge. Police cars, vans, and officers on foot race past him in one direction, but Peter munches his hot dog and calmly sets off in the other. Back in his room, he dedicates himself to studying. Raising his hand confidently, Peter grins, a proud expression lighting up his face. On campus, Doctor Connors approaches him hurriedly. Peter pauses and flashes a friendly smile. At the theater, MJ becomes distracted upon noticing Peter in the audience. He grins inanely, causing her to smile sweetly before she disregards the prompt and turns to her co-star. Later, MJ and Peter walk down the street side by side. Standing next to her, he looks at her earnestly, and then they both continue walking. He gazes at her through doleful eyes, while she examines his features closely. She then turns away and crosses to a waiting yellow cab. Opening the door, she turns to glance at him once more before stepping inside. Peter offers a faint smile as MJ enters the cab, shuts the door, and watches as it drives away from view. He slips on his spectacles once more. At the Bugle office, a headline is being crafted. Jameson remains on the phone, pulling Spider-Man's mask from a bag. The rest of the costume follows. The disgruntled garbage man exits. Robbie handles the mask thoughtfully. Inside his office, Jameson, donned in the Spider-Man costume but minus the mask, energetically leaps onto his desk, a large cigar protruding from his mouth. He makes a show of flexing his wrists as if preparing to shoot out webs. His curious staff peers in through the slatted blinds. Robbie shakes his head in disbelief. Two girls pass him by, overtaking him and giggling as they go. He smiles and continues walking past a shadowy alleyway, where he spots two muggers attacking a dark-haired youth. Without a second glance, Peter turns his back, leaving the muggers to continue their assault on the fallen victim."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "In the quiet and serene solitude of his room, Peter finds himself deeply immersed in his thoughts, with his shadow dramatically cast behind him onto the wall in a striking silhouette. His hand is extended thoughtfully in front of him, and he stares intently at it, while his back rests comfortably against a supportive pillow. He gazes off into the distance with his steely blue eyes, which shine brightly with a determined and unwavering gleam. Meanwhile, outside, in a dark alley where ominous and threatening clouds have gathered thickly in the sky, Peter stands with a solemn expression, holding his iconic Spider-Man costume out in front of him. As the wind gently tousles his hair, he remains motionless, absorbing the weight of the moment. After a significant pause, he lets the costume slip from his grasp and slowly walks away down the shadowy alley, leaving behind the dust bin where he has cast away the final remnant of his superhero identity. \n\nAs the sun shines brightly overhead, Peter, with a jaunty and confident stride in his step, makes his way through the bustling and lively city streets. He accidentally trips over an uneven spot on the sidewalk, awkwardly gets back on his feet, and reaches into his pocket to take out his spectacles. He flicks them open deftly, puts them securely on, and continues his journey, feeling slightly damp from the unexpected mishap. Once he arrives home, he busies himself by tightening a loose wheel on his beloved moped. To his surprise, the wheel rolls off the front forks and, in an unexpected turn of events, bounces out of his open window. \n\nLater, he strolls away from a hot dog vendor, holding his snack in hand, and stands at the street's edge. Police cars, vans, and officers on foot race past him in one direction, but Peter, unfazed, munches his hot dog and calmly sets off in the opposite direction. Back in the comfort of his room, he dedicates himself to studying diligently. Raising his hand confidently, Peter grins as a proud expression lights up his face. \n\nOn campus, Doctor Connors hurriedly approaches him, and Peter, acknowledging him, pauses to flash a friendly smile. At the theater, MJ becomes momentarily distracted when she notices Peter seated in the audience. He grins inanely, causing her to smile sweetly before she disregards the prompt and turns back to her co-star. Later, MJ and Peter walk side by side down the street. Standing next to her, he looks at her with earnest eyes, and then they both continue walking. He gazes at her through doleful eyes, while she closely examines his features with interest. She then turns away and crosses to a waiting yellow cab. Opening the door, she turns to glance at him once more before stepping inside. Peter offers a faint smile as MJ enters the cab, shuts the door, and watches as it drives away from view. He slips on his spectacles once more, adjusting them for a clearer view.\n\nAt the Bugle office, a headline is being crafted with precision. Jameson remains on the phone, extracting Spider-Man's mask from a bag. The rest of the costume follows in sequence. The disgruntled garbage man exits the office with an air of dissatisfaction. Robbie handles the mask with thoughtfulness. Inside his office, Jameson, now donned in the Spider-Man costume but notably minus the mask, energetically leaps onto his desk, a large cigar protruding from his mouth. He makes a theatrical show of flexing his wrists as if preparing to shoot out webs, much to the amusement and curiosity of his staff, who peer in through the slatted blinds. Robbie shakes his head in disbelief as he observes Jameson's antics. Two girls pass by him, overtaking him and giggling as they go. He smiles to himself and continues walking past a shadowy alleyway, where he spots two muggers viciously attacking a dark-haired youth. Without sparing a second glance, Peter turns on his heel, leaving the muggers to continue their assault on the fallen victim."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "In the quiet confines of his room, Peter stands motionless, his shadow casting a silhouette behind him on the wall as his eyes focus intently on his outstretched hand. His back finds support against a pillow, and his steely blue eyes shift from his hand to an undefined point in space, radiating both brightness and determination. Meanwhile, in a dimly lit alley overshadowed by ominous clouds, Peter halts with his Spider-Man costume held out in front of him, the wind tousling his hair as he stands in silent contemplation. In a decisive motion, he releases the costume, watching it fall before turning away and walking down the alley, leaving behind the dustbin that now contains the remnants of his superhero identity. The sun beams down as Peter, now with a jaunty spring in his step, makes his way through the bustling city streets. His foot unexpectedly catches on the uneven sidewalk, causing him to stumble awkwardly before regaining his balance. He reaches into his pocket, retrieves his spectacles, flicks them open, and places them carefully on his face, setting off once more, now slightly damp from the earlier mishap. Back at home, he focuses on tightening a wheel on his moped, giving it a spin only to watch in surprise as it detaches from the front forks and bounces out of the open window. Later, after departing from a hot dog vendor, Peter stands at the curb, observing as cop cars, vans, and officers on foot rush past in one direction, while he calmly munches on his hot dog and casually heads in the opposite direction. In a quiet study session, Peter's hand shoots into the air in a confident display of knowledge, and he grins with pride. On campus, Doctor Connors approaches him with urgency, prompting Peter to pause and offer a friendly smile. At the theater, as MJ performs on stage, her attention diverts when she spots Peter seated in the audience, who responds with a goofy grin. Her expression softens into a sweet smile, even as she dismisses the prompter and turns to her co-star. Later, MJ and Peter walk side-by-side down the street, and Peter, standing beside her, gazes at her with earnest affection. They pause momentarily before resuming their walk, during which Peter regards her with doleful eyes, while she takes a moment to study his features intently. Her gaze then shifts away as she approaches a yellow cab, opens the door, and pauses to look back at Peter once more before stepping inside and closing the door. As the cab pulls away, Peter offers a faint smile, dons his spectacles, and watches her departure. At the Bugle, a headline takes shape as Jameson speaks animatedly on the phone, retrieving Spider-Man's mask from a bag, followed by the rest of the costume, as a disgruntled garbage man departs. Robbie, in the meantime, gently handles the mask. In a humorous display, Jameson, clad in the Spider-Man costume sans mask, jumps onto his desk, a cigar clamped between his teeth, and mimics the iconic web-shooting gesture, while his staff curiously peer through the slatted blinds. Robbie reacts with a shake of the head as two giggling girls overtake him, prompting a smile as he continues on past an alleyway, where he witnesses two muggers assaulting a dark-haired youth. Choosing not to intervene, Peter turns his back on the scene, leaving the muggers to continue their vicious attack on their fallen victim."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "In his room, Peter contemplates his outstretched hand, casting a shadow on the wall, his steely blue eyes bright and determined. Outside in a dark alley, with ominous clouds overhead, Peter holds out his Spider-Man costume, lets the wind ruffle his hair, and then drops the costume into a dust bin, walking away from it to leave the superhero life behind. The sun shines as he jauntily strides through the city, tripping on the sidewalk but recovering by putting on his spectacles and continuing on. At home, he attempts a repair on his moped, but the wheel rolls out the window. Unfazed, he eats a hot dog while observing police activity, then heads off in the opposite direction. Back in his room, he studies, raising his hand with a proud grin. On campus, he stops to greet Doctor Connors with a smile. At the theater, MJ gets distracted seeing him in the audience; she smiles sweetly before turning back to her performance. Later, as they walk side-by-side, Peter gazes earnestly at MJ, who carefully studies his features before departing in a cab after a lingering look. Peter smiles softly, slipping on his spectacles. At the Bugle, Jameson, on the phone, toys with Spider-Man's mask and dons the costume without the mask, leaping onto his desk and pretending to shoot webs as his staff observes. Finally, as two girls giggle past him, Peter notices a mugging but chooses to turn away, leaving the muggers to continue assaulting their victim."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "In his room, Peter, his shadow thrown behind him onto the wall, stares at his own hand held out, considering the path that once made him a hero. His back resting on a pillow, Peter stares into space, his steely blue eyes bright and determined, reminiscent of his days battling villains in New York City. Outside in a dark alley, notorious for its frequent crime incidents, with ominous clouds in the sky, Peter stands with his Spider-Man costume held out in front of him. The wind, heralding an incoming storm, ruffles his hair as he remains still for a moment. He drops the costume, a symbol of his superhero identity, then walks down the alley and away from the dust bin into which he has consigned the last vestige of the superhero. The sun shines as Peter, adopting a new chapter in his life, with a jaunty gait, strides through the city. Peter trips on the sidewalk, a common hazard in Manhattan. He awkwardly gets to his feet, reaches into his pocket, and hauls out his spectacles, the ones he needs since his powers started to fade. He flicks them open, puts them on, and sets off a little wet from the moisture in the air. At home, he tightens up a wheel on his moped, a relic from his high school days, and spins it. The wheel rolls off the front forks and bounces out of the open window, highlighting his shifting focus away from heroics. He strolls away from a hot dog man, a staple in the bustling city cuisine, and stands at the curve. Cop cars and vans and officers on foot race off in one direction, likely chasing a suspect in the ever-busy city. Peter munches his hot dog and sets off in the other, unconcerned with the chaos behind him. In his room, he studies diligently, preparing for his future. Peter's hand goes up, eager to answer. Peter grins proudly, embodying his determination. On the campus of Columbia University, Doctor Connors, his mentor and friend, races up to him. Peter stops and smiles, relieved to see a familiar face. At the theater, MJ, starring in her Broadway debut, is distracted when she sees Peter in the audience. He grins inanely, still smitten by her presence. She smiles sweetly, acknowledging their complicated relationship. She ignores the prompt from offstage. She turns to her costar, continuing the scene. MJ and Peter walk down the street side-by-side, discussing future aspirations. Peter, standing beside her, gazes at her earnestly, still holding onto their bond. Then they both resume walking. He looks at her through doleful eyes, understanding the distance between them, and she scrutinizes his features, noting his subtle changes. She turns away and crosses to a yellow cab, one of the many that navigate the city's streets. She opens the door of the cab and, before getting in, turns to look at him once more. Peter half smiles as MJ steps into the cab, shuts the door, and watches as the cab drives away, leaving him to ponder his next steps. He slips on his spectacles, symbolizing his acceptance of a new identity. At the Bugle, a headline is being composed, ready to capture the latest sensational story. Jameson's on the phone, barking orders as usual. He pulls Spider-Man's mask from a bag found in the alley. Out comes the rest of the costume, connecting him to the city's most famous vigilante. The disgruntled garbage man goes, leaving behind a city of endless stories. Robbie fondles the mask, feeling its weight. In his office, Jameson, in the Spider-Man costume minus the mask, leaps onto his desk, a big cigar in his mouth, pretending to be the hero he often criticized. He flexes his wrists as if shooting out webs, entertaining his staff. His staff peer in through the slatted blinds, curious and amused by his antics. Robbie shakes his head, understanding Jameson's complex admiration for Spider-Man. Two girls overtake him and giggle, reminding him of the city's vibrancy. He smiles and walks on past an alleyway. He sees two muggers attacking a dark-haired youth, a typical scene in the less savory parts of town. Peter turns his back away, haunted by the realization that he can no longer intervene, leaving the muggers punching and kicking their fallen victim, a testament to the harsh realities of his recent choices."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "He drops the costume then walks down the alley and away from the dust bin into which he has consigned the last vestige of the superhero In his room Peter his shadow thrown behind him onto the wall stares at his own hand held out His back resting on a pillow Peter stares into space his steely blue eyes bright and determined Outside in a dark alley with ominous clouds in the sky Peter stands with his SpiderMan costume held out in front of him The wind ruffles his hair as he remains still for a moment He drops the costume then walks down the alley and away from the dust bin into which he has consigned the last vestige of the superhero The sun shines as Peter with a jaunty gait strides through the city Peter trips on the sidewalk He awkwardly gets to his feet reaches into his pocket and hauls out his spectacles Peter stares into space his steely blue eyes bright and determined Peter turns his back away leaving the muggers punching and kicking their fallen victim At the theater MJ is distracted when she sees Peter in the audience He flicks them open puts them on and sets off a little wet At home he tightens up a wheel on his moped and spins it Two girls overtake him and giggle The wheel rolls off the front forks and bounces out of the open window He strolls away from a hot dog man and stands at the curve Cop cars and vans and officers on foot race off in one direction Peter grins proudly Peter munches his hot dog and sets off in the other In his room he studies Peter's hand goes up He awkwardly gets to his feet reaches into his pocket and hauls out his spectacles Peter's hand goes up Peter grins proudly On the campus Doctor Connors races up to him Peter stops and smiles At the theater MJ is distracted when she sees Peter in the audience He grins inanely Peter stops and smiles She smiles sweetly Robbie fondles the mask She ignores the prompt She turns to her costar MJ and Peter walk down the street sidebyside His back resting on a pillow In his room he studies Peter standing beside her gazes at her earnestly Then they both resume walking His staff peer in through the slatted blinds He looks at her through doleful eyes and she scrutinizes his features She turns away and crosses to a yellow cab She opens the door of the cab and before getting in turns to look at him once more Peter half smiles as MJ steps into the cab shuts the door and watches as the cab drives away He slips on his spectacles In his room Peter his shadow thrown behind him onto the wall stares at his own hand held out At the Bugle a headline is being composed Peter munches his hot dog and sets off in the other She smiles sweetly Peter trips on the sidewalk Cop cars and vans and officers on foot race off in one direction Jameson's on the phone He pulls SpiderMan's mask from a bag He smiles and walks on past an alleyway Out comes the rest of the costume The disgruntled garbage man goes Robbie fondles the mask In his office Jameson in the SpiderMan costume minus the mask leaps onto his desk a big cigar in his mouth The disgruntled garbage man goes He flexes his wrists as if shooting out webs His staff peer in through the slatted blinds Then they both resume walking Robbie shakes his head a big cigar in his mouth The sun shines as Peter with a jaunty gait strides through the city Two girls overtake him and giggle He smiles and walks on past an alleyway He sees two muggers attacking a darkhaired youth Jameson's on the phone Peter turns his back away leaving the muggers punching and kicking their fallen victim"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "In his room Peter his shadow thrown behind him onto the wall stares at his own hand held out. His back resting on a pillow. Peter stares into space his steely blue eyes bright and determined. Outside in a dark alley with ominous clouds in the sky Peter stands with his SpiderMan costume held out in front of him. The wind ruffles his hair as he remains still for a moment. He drops the costume then walks down the alley and away from the dust bin into which he has consigned the last vestige of the superhero. The sun shines as Peter with a jaunty gait strides through the city. Peter trips on the sidewalk. He awkwardly gets to his feet reaches into his pocket and hauls out his spectacles. He flicks them open puts them on and sets off a little wet. At home he tightens up a wheel on his moped and spins it. The wheel rolls off the front forks and bounces out of the open window. He strolls away from a hot dog man and stands at the curve. Cop cars and vans and officers on foot race off in one direction. Peter munches his hot dog and sets off in the other. In his room he studies. Peter's hand goes up. Peter grins proudly. On the campus Doctor Connors races up to him. Peter stops and smiles. At the theater MJ is distracted when she sees Peter in the audience. He grins inanely. She smiles sweetly. She ignores the prompt. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. She turns to her costar. MJ and Peter walk down the street sidebyside. Peter standing beside her gazes at her earnestly. Then they both resume walking. He looks at her through doleful eyes and she scrutinizes his features. She turns away and crosses to a yellow cab. She opens the door of the cab and before getting in turns to look at him once more. Peter half smiles as MJ steps into the cab shuts the door and watches as the cab drives away. He slips on his spectacles. At the Bugle a headline is being composed. Jameson's on the phone. He pulls SpiderMan's mask from a bag. Out comes the rest of the costume. The disgruntled garbage man goes. Robbie fondles the mask. In his office Jameson in the SpiderMan costume minus the mask leaps onto his desk. a big cigar in his mouth. He flexes his wrists as if shooting out webs. His staff peer in through the slatted blinds. Robbie shakes his head. Two girls overtake him and giggle. He smiles and walks on past an alleyway. He sees two muggers attacking a darkhaired youth. Peter turns his back away leaving the muggers punching and kicking their fallen victim."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "In his room Peter his shadow thrown behind him onto the wall stares at his own hand held out. His back resting on a pillow. Peter stares into space his steely blue eyes bright and determined. Outside in a dark alley with ominous clouds in the sky Peter stands with his SpiderMan costume held out in front of him. The wind ruffles his hair as he remains still for a moment. He drops the costume then walks down the alley and away from the dust bin into which he has consigned the last vestige of the superhero. The sun shines as Peter with a jaunty gait strides through the city. Peter trips on the sidewalk. He awkwardly gets to his feet reaches into his pocket and hauls out his spectacles. He flicks them open puts them on and sets off a little wet. At home he tightens up a wheel on his moped and spins it. The wheel rolls off the front forks and bounces out of the open window. He strolls away from a hot dog man and stands at the curve. Cop cars and vans and officers on foot race off in one direction. Peter munches his hot dog and sets off in the other. In his room he studies. Peter's hand goes up. Peter grins proudly. On the campus Doctor Connors races up to him. Peter stops and smiles. At the theater MJ is distracted when she sees Peter in the audience. He grins inanely. She smiles sweetly. She ignores the prompt. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. She turns to her costar. MJ and Peter walk down the street sidebyside. Peter standing beside her gazes at her earnestly. Then they both resume walking. He looks at her through doleful eyes and she scrutinizes his features. She turns away and crosses to a yellow cab. She opens the door of the cab and before getting in turns to look at him once more. Peter half smiles as MJ steps into the cab shuts the door and watches as the cab drives away. He slips on his spectacles. At the Bugle a headline is being composed. Jameson's on the phone. He pulls SpiderMan's mask from a bag. Out comes the rest of the costume. The disgruntled garbage man goes. Robbie fondles the mask. In his office Jameson in the SpiderMan costume minus the mask leaps onto his desk. a big cigar in his mouth. He flexes his wrists as if shooting out webs. His staff peer in through the slatted blinds. Robbie shakes his head. Two girls overtake him and giggle. He smiles and walks on past an alleyway. He sees two muggers attacking a darkhaired youth. Peter turns his back away leaving the muggers punching and kicking their fallen victim."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "In his room Peter his shadow thrown behind him onto the wall stares at his own hand held out. His back resting on a pillow. Peter stares into space his steely blue eyes bright and determined. Outside in a dark alley with ominous clouds in the sky Peter stands with his SpiderMan costume held out in front of him. The wind ruffles his hair as he remains still for a moment. He drops the costume then walks down the alley and away from the dust bin into which he has consigned the last vestige of the superhero. The sun shines as Peter with a jaunty gait strides through the city. Peter trips on the sidewalk. He awkwardly gets to his feet reaches into his pocket and hauls out his spectacles. He flicks them open puts them on and sets off a little wet. At home he tightens up a wheel on his moped and spins it. The wheel rolls off the front forks and bounces out of the open window. Out comes the rest of the costume. The disgruntled garbage man goes. Robbie fondles the mask. In his office Jameson in the SpiderMan costume minus the mask leaps onto his desk. a big cigar in his mouth. He flexes his wrists as if shooting out webs. His staff peer in through the slatted blinds. Robbie shakes his head. Two girls overtake him and giggle. He smiles and walks on past an alleyway. He sees two muggers attacking a darkhaired youth. Peter turns his back away leaving the muggers punching and kicking their fallen victim."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "In his room Peter his shadow thrown behind him onto the wall stares at his own hand held out. His back resting on a pillow. Peter stares into space his steely blue eyes bright and determined. Outside in a dark alley with ominous clouds in the sky Peter stands with his SpiderMan costume held out in front of him. The wind ruffles his hair as he remains still for a moment. Robbie shakes his head. Two girls overtake him and giggle. He smiles and walks on past an alleyway. He sees two muggers attacking a darkhaired youth. Peter turns his back away leaving the muggers punching and kicking their fallen victim."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "In his room, the panda, its shadow thrown behind it onto the wall, stares at its own hand held out. Its back resting on a pillow, the panda stares into space, its steely blue eyes bright and determined. Outside in a dark alley with ominous clouds in the sky, the zebra stands with its Spider-Man costume held out in front of it. The wind ruffles its mane as it remains still for a moment. It drops the costume, then walks down the alley and away from the dust bin into which it has consigned the last vestige of the superhero. The sun shines as the penguin, with a jaunty gait, strides through the city. The penguin trips on the sidewalk. It awkwardly gets to its feet, reaches into its pocket, and hauls out its spectacles. It flicks them open, puts them on, and sets off a little wet. At home, it tightens up a wheel on its moped and spins it. The wheel rolls off the front forks and bounces out of the open window. It strolls away from a hot dog vendor and stands at the curve. Cop cars and vans and officers on foot race off in one direction. The penguin munches its hot dog and sets off in the other. In its room, it studies. The panda's hand goes up. The panda grins proudly. On the campus, the elephant races up to it. The panda stops and smiles. At the theater, the dolphin is distracted when it sees the panda in the audience. It grins inanely. The dolphin smiles sweetly. It ignores the prompt. It turns to its costar. The dolphin and the panda walk down the street side-by-side. The panda, standing beside it, gazes at it earnestly. Then they both resume walking. It looks at it through doleful eyes, and it scrutinizes its features. It turns away and crosses to a yellow cab. It opens the door of the cab and, before getting in, turns to look at it once more. The panda half smiles as the dolphin steps into the cab, shuts the door, and watches as the cab drives away. It slips on its spectacles. At the Bugle, a headline is being composed. The lemur's on the phone. It pulls Spider-Man's mask from a bag. Out comes the rest of the costume. The disgruntled raccoon goes. The gorilla fondles the mask. In its office, the lemur, in the Spider-Man costume minus the mask, leaps onto its desk, a big cigar in its mouth. It flexes its wrists as if shooting out webs. Its staff peer in through the slatted blinds. The gorilla shakes its head. Two lions overtake it and giggle. It smiles and walks on past an alleyway. It sees two muggers attacking a dark-haired youth. The panda turns its back away, leaving the muggers punching and kicking their fallen victim."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "In his tent, Peter, his shadow thrown behind him onto the canvas, stares at his own hand held out. His back resting on a cushion, Peter stares into space, his steely blue eyes bright and determined. Outside in a dim corridor with ominous fog in the air, Peter stands with his knight armor held out in front of him. The breeze ruffles his hair as he remains still for a moment. He drops the armor, then walks down the corridor and away from the flower pot into which he has consigned the last vestige of the hero. The moon shines as Peter, with a jaunty gait, strides through the village. Peter trips on the gravel path. He awkwardly gets to his feet, reaches into his satchel, and hauls out his binoculars. He flicks them open, puts them on, and sets off a little dazed. At home, he tightens up a spring on his tricycle and spins it. The spring rolls off the handlebars and bounces out of the open door. He strolls away from a popcorn vendor and stands at the corner. Ice cream trucks and motorcycles and cyclists on foot race off in one direction. Peter munches his popcorn and sets off in the other. In his tent, he studies. Peter's hand goes up. Peter grins proudly. On the meadow, Professor Connors races up to him. Peter stops and smiles. At the opera house, MJ is distracted when she sees Peter in the audience. He grins inanely. She smiles sweetly. She ignores the script. She turns to her duet partner. MJ and Peter walk down the path side-by-side. Peter, standing beside her, gazes at her earnestly. Then they both resume walking. He looks at her through doleful eyes, and she scrutinizes his features. She turns away and crosses to a green cart. She opens the door of the cart and, before getting in, turns to look at him once more. Peter half smiles as MJ steps into the cart, shuts the door, and watches as the cart rolls away. He slips on his binoculars. At the Gazette, a headline is being composed. Jameson's on the radio. He pulls Spider-Man's hat from a box. Out comes the rest of the costume. The disgruntled delivery man goes. Robbie fondles the hat. In his office, Jameson, in the Spider-Man costume minus the hat, leaps onto his table, a big cigar in his mouth. He flexes his wrists as if shooting out webs. His staff peer in through the slatted curtains. Robbie shakes his head. Two girls overtake him and giggle. He smiles and walks on past a courtyard. He sees two bandits attacking a fair-haired youth. Peter turns his back away, leaving the bandits punching and kicking their fallen victim."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "In his room, Peter, his shadow bounced behind him onto the wall, examines his own hand held out. His back resting on a pillow, Peter dozes into space, his steely blue eyes bright and determined. Outside in a dark alley with ominous clouds in the sky, Peter kneels with his Spider-Man costume held out in front of him. The wind tousles his hair as he remains perched for a moment. He flicks the costume, then jogs down the alley and away from the dust bin into which he has tossed the last vestige of the superhero. The sun dazzles as Peter, with a jaunty gait, hops through the city. Peter dances on the sidewalk. He awkwardly turns to his feet, reaches into his pocket, and pulls out his spectacles. He snaps them open, puts them on, and strides off a little wet. At home, he straightens up a wheel on his moped and snaps it. The wheel tumbles off the front forks and tumbles out of the open window. He skips away from a hot dog man and hops at the curve. Cop cars and vans and officers on foot speed off in one direction. Peter chews his hot dog and hops off in the other. In his room, he scribbles. Peter's hand goes down. Peter beams proudly. On the campus, Doctor Connors jogs up to him. Peter leans and grins. At the theater, MJ is startled when she sees Peter in the audience. He chuckles inanely. She frowns sweetly. She ignores the prompt. She turns to her costar. MJ and Peter hop down the street side-by-side. Peter, standing beside her, stares at her earnestly. Then they both pause hopping. He peeks at her through doleful eyes, and she inspects his features. She turns away and strides to a yellow cab. She opens the door of the cab and, before stepping in, turns to glance at him once more. Peter half grins as MJ steps onto the cab, closes the door, and peers as the cab rolls away. He slips on his spectacles. At the Bugle, a headline is being scribbled. Jameson's on the phone. He swings Spider-Man's mask from a bag. Out lands the rest of the costume. The disgruntled garbage man stays. Robbie pats the mask. In his office, Jameson, in the Spider-Man costume minus the mask, bounds onto his desk, a big cigar in his mouth. He flexes his wrists as if swatting out webs. His staff squint in through the slatted blinds. Robbie nods his head. Two girls bypass him and chuckle. He grins and strides on past an alleyway. He notices two muggers taunting a dark-haired youth. Peter twists his back away, leaving the muggers poking and shoving their fallen victim."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "In his tent, Alex, his reflection cast behind him onto the curtain, gazes at his own foot held out. His back resting on a cushion, Alex gazes into the distance, his emerald green shoes shining and focused. Outside in a gloomy forest with foreboding stars in the sky, Alex stands with his Batman uniform held out in front of him. The breeze tousles his scarf as he remains still for a moment. He drops the uniform, then walks down the forest and away from the mailbox into which he has consigned the last trace of the detective. The moon glows as Alex, with a lively stride, saunters through the village. Alex stumbles on the staircase. He awkwardly gets to his knees, reaches into his bag, and pulls out his binoculars. He snaps them open, puts them on, and sets off a little dry. At the cottage, he tightens up a spoke on his skateboard and spins it. The spoke rolls off the handlebars and bounces out of the open door. He wanders away from a pizza vendor and stands at the fence. Fire engines and buses and tourists on bicycles race off in one direction. Alex nibbles his pizza and sets off in the other. In his tent, he reads. Alex's foot goes up. Alex smirks confidently. On the grounds, Professor Brown dashes up to him. Alex halts and laughs. At the cinema, Lucy is preoccupied when she sees Alex in the spectators. He smirks inanely. She giggles shyly. She neglects the script. She turns to her partner. Lucy and Alex stroll down the avenue side-by-side. Alex, standing beside her, gazes at her intently. Then they both resume strolling. He looks at her through hopeful glasses, and she examines his expression. She turns away and crosses to a red bicycle. She opens the basket of the bicycle and, before riding away, turns to look at him once more. Alex half-smiles as Lucy rides onto the bicycle, pedals down, and watches as the bicycle rolls away. He slides on his binoculars. At the Chronicle, a caption is being composed. Thompson's on the microphone. He pulls Batman's cloak from a basket. Out comes the rest of the uniform. The displeased janitor leaves. Mason handles the cloak. In his studio, Thompson, in the Batman uniform minus the cloak, leaps onto his bench, a large pipe in his mouth. He flexes his ankles as if propelling out ropes. His crew peer in through the wooden shutters. Mason nods his head. Two boys overtake him and chuckle. He grins and strolls on past a courtyard. He sees two thieves attacking a blonde toddler. Alex turns his shoulder away, leaving the thieves kicking and hitting their fallen target."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "In his room, a giraffe, its shadow thrown behind it onto the wall, gazes at its own hoof held out. Its back resting on a blanket, the giraffe gazes into space, its vibrant green eyes bright and curious. Outside in a dark alley with ominous clouds in the sky, the giraffe stands with its kangaroo suit held out in front of it. The breeze ruffles its mane as it remains motionless for a moment. It tosses the suit, then hops down the alley and away from the dumpster into which it has tossed the last remnant of the marsupial. The sky clears as the giraffe, with a sprightly hop, skips through the city. The giraffe stumbles on the curb. It clumsily rights itself, reaches into its pouch, and pulls out a monocle. It flips it open, places it on, and sets off a little damp. At home, it fastens up a valve on its scooter and spins it. The valve pops off the handlebars and bounces out of the open doorway. It ambles away from a pretzel vendor and stands at the bus stop. Fire trucks and ambulances and paramedics on foot dash off in one direction. The giraffe chomps its pretzel and sets off in the other. In its room, it studies. The giraffe's hoof goes up. The giraffe beams proudly. On the campus, Professor Lizard sprints up to it. The giraffe halts and beams. At the theater, Lucy is distracted when she sees the giraffe in the audience. It grins vacantly. She chuckles warmly. She disregards the prompt. She turns to her accompanist. Lucy and the giraffe ramble down the street side-by-side. The giraffe, standing beside her, gazes at her sincerely. Then they both resume skipping. It glances at her through wistful eyes, and she examines its features. She pivots away and strides to a red taxi. She opens the door of the taxi and, before getting in, turns to glance at it once more. The giraffe half-smiles as Lucy steps into the taxi, shuts the door, and watches as the taxi departs. It slips on its monocle. At the Gazette, a story is being composed. Jenkins is on the phone. He extracts a kangaroo's tail from a satchel. Out comes the rest of the suit. The grumpy janitor departs. Ron fondles the tail. In his office, Jenkins, in the kangaroo suit minus the tail, cartwheels onto his desk, a large lollipop in his mouth. He flexes his ankles as if hopping. His team peers in through the striped blinds. Ron shakes his head. Two children overtake him and giggle. He chuckles and strolls on past a bakery. He sees two bakers tossing a flour-covered rabbit. The giraffe turns its back away, leaving the bakers writhing and leaping around their floured friend."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "In his room, Peter, his silhouette cast behind him onto the curtain, gazes at his own foot stretched out. His back pressing against a cushion, Peter peers into the void, his steely blue eyes gleaming and inquisitive. Outside in a moonlit garden with puffy clouds drifting by, Peter stands with his Spider-Man backpack extended before him. The breeze tousles his hair as he sways slightly for a moment. He tosses the backpack, then shuffles down the garden and away from the birdhouse into which he has deposited the last remnant of the superhero. The rain falls as Peter, with a bouncy step, hops through the town. Peter stumbles on the curb. He clumsily rises to his knees, reaches into his bag, and extracts his magnifying glass. He snaps it open, puts it back, and lumbers off a little dry. At home, he adjusts a seat on his skateboard and kicks it. The seat flies off the back and spins out of the open door. He saunters away from a pretzel vendor and stands at the corner. Firetrucks and bicycles and cyclists on foot zoom off in one direction. Peter nibbles his pretzel and ambles off in the other. In his room, he relaxes. Peter's foot taps. Peter chuckles slyly. On the campus, Doctor Connors hurries toward him. Peter pauses and beams. At the diner, MJ is preoccupied when she spots Peter in the booth. He chuckles inanely. She grins bashfully. She ignores the menu. She shifts to her companion. MJ and Peter skip down the boardwalk side-by-side. Peter, standing next to her, looks at her thoughtfully. Then they both continue skipping. He glances at her through wistful eyes, and she inspects his expression. She turns away and approaches a green tram. She opens the door of the tram and, before entering, turns to see him one last time. Peter half grins as MJ steps into the tram, slides the door shut, and observes as the tram glides away. He slides on his magnifying glass. At the Bugle, a title is being generated. Jameson's on the walkie-talkie. He pulls Spider-Man's shirt from a bin. Out comes the rest of the attire. The annoyed janitor leaves. Robbie caresses the shirt. In his office, Jameson, in the Spider-Man outfit minus the shirt, hops onto his table, a large straw in his mouth. He wiggles his fingers as if flicking out webs. His staff glance in through the parted curtains. Robbie tilts his head. Two girls speed past him and snicker. He beams and strolls on past a driveway. He observes two assailants wrestling with a blond child. Peter turns his back away, leaving the assailants grappling and shoving their cowering prey."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Inside a cavern, Gerald, his silhouette cast before him onto the rock, glances at his foot extended forward. His head resting on a marshmallow, Gerald gazes into a void, his emerald green eyes dim and contemplative. Inside in a bright meadow with fluffy sheep in the distance, Gerald prances with his astronaut suit dangled above him. The breeze tangles his scarf as he pauses for an instant. He tosses the suit aside, then hops across the meadow and away from the picnic basket into which he has discarded the final remnant of the explorer. The moon glows as Gerald, with a sluggish shuffle, shuffles through the village. Gerald tumbles over a pebble. He clumsily rises to his knees, plunges into his backpack, and retrieves his monocle. He snaps it open, places it on, and sets off slightly thirsty. At the cave, he tunes up a violin on his scooter and bows it. The violin flies off the handlebars and floats out of the closed gate. He meanders away from a pretzel vendor and sits at the fountain. Fire trucks and helicopters and sailors in boots charge off in one direction. Gerald gnaws his pretzel and wanders in the other. In his cavern, he reviews. Gerald's elbow juts out. Gerald smirks shyly. On the island, Professor Higgins stumbles upon him. Gerald halts and frowns. At the carnival, Betty is engrossed when she spots Gerald in the crowd. He grins foolishly. She frowns mildly. She disregards the signal. She turns to her magician. Betty and Gerald skip along the pier hand-in-hand. Gerald, skipping in front of her, peeks at her shyly. Then they both continue skipping. He peeks at her with gleeful eyes, and she investigates his essence. She glances away and approaches a blue ship. She opens the hatch of the ship and, before climbing in, turns to wave at him once more. Gerald half grins as Betty jumps into the ship, seals the hatch, and observes as the ship sails away. He slips off his monocle. At the Chronicle, a headline is being painted. Richard's on the tablet. He extracts Batman's cape from a box. Out tumbles the rest of the outfit. The pleased janitor arrives. Johnny caresses the cape. In the conference room, Richard, in the Batman outfit minus the cape, skips onto his table, a shiny apple in his hand. He bends his elbows as if launching off rockets. His team gaze in through the frosted windows. Johnny tilts his head. Two boys bypass him and snicker. He frowns and skips on past a crossroads. He notices two jesters hugging a fair-haired infant. Gerald turns his gaze away, leaving the jesters tickling and cuddling their cheerful companion."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "In his room, Peter gazes at his outstretched hand, his eyes full of resolve. Outside, he discards his Spider-Man costume in an alley. With a newfound ease, Peter strolls through the city, tripping on the sidewalk and adjusting his glasses. At home, an attempt to fix his moped goes awry. Meanwhile, at a hot dog stand, Peter observes passing police cars but chooses his own path. He continues his day studying and displays pride when interacting with Doctor Connors. At the theater, MJ is momentarily distracted by Peter in the audience. They later walk together, sharing a moment before MJ departs in a cab, leaving Peter to watch her go. At the Bugle, Jameson, donning Spider-Man's costume, leaps onto his desk, amusing his staff. Peter, walking later, witnesses muggers attacking a youth but chooses not to intervene."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Peter turns his back away leaving the muggers punching and kicking their fallen victim He sees two muggers attacking a darkhaired youth He smiles and walks on past an alleyway Two girls overtake him and giggle Robbie shakes his head His staff peer in through the slatted blinds He flexes his wrists as if shooting out webs a big cigar in his mouth In his office Jameson in the SpiderMan costume minus the mask leaps onto his desk Robbie fondles the mask The disgruntled garbage man goes Out comes the rest of the costume He pulls SpiderMan's mask from a bag Jameson's on the phone At the Bugle a headline is being composed He slips on his spectacles Peter half smiles as MJ steps into the cab shuts the door and watches as the cab drives away She opens the door of the cab and before getting in turns to look at him once more She turns away and crosses to a yellow cab He looks at her through doleful eyes and she scrutinizes his features Then they both resume walking Peter standing beside her gazes at her earnestly MJ and Peter walk down the street sidebyside She turns to her costar She ignores the prompt She smiles sweetly He grins inanely At the theater MJ is distracted when she sees Peter in the audience Peter stops and smiles On the campus Doctor Connors races up to him Peter grins proudly Peter's hand goes up In his room he studies Peter munches his hot dog and sets off in the other Cop cars and vans and officers on foot race off in one direction He strolls away from a hot dog man and stands at the curve The wheel rolls off the front forks and bounces out of the open window At home he tightens up a wheel on his moped and spins it He flicks them open puts them on and sets off a little wet He awkwardly gets to his feet reaches into his pocket and hauls out his spectacles Peter trips on the sidewalk The sun shines as Peter with a jaunty gait strides through the city He drops the costume then walks down the alley and away from the dust bin into which he has consigned the last vestige of the superhero The wind ruffles his hair as he remains still for a moment Outside in a dark alley with ominous clouds in the sky Peter stands with his SpiderMan costume held out in front of him Peter stares into space his steely blue eyes bright and determined His back resting on a pillow In his room Peter his shadow thrown behind him onto the wall stares at his own hand held out"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "She turns away and crosses to a yellow cab She ignores the prompt She turns to her costar At home he tightens up a wheel on his moped and spins it He grins inanely He flicks them open puts them on and sets off a little wet She opens the door of the cab and before getting in turns to look at him once more In his office Jameson in the SpiderMan costume minus the mask leaps onto his desk He strolls away from a hot dog man and stands at the curve Outside in a dark alley with ominous clouds in the sky Peter stands with his SpiderMan costume held out in front of him He pulls SpiderMan's mask from a bag The wind ruffles his hair as he remains still for a moment Robbie shakes his head Peter standing beside her gazes at her earnestly The wheel rolls off the front forks and bounces out of the open window At the Bugle a headline is being composed He looks at her through doleful eyes and she scrutinizes his features He flexes his wrists as if shooting out webs On the campus Doctor Connors races up to him Peter half smiles as MJ steps into the cab shuts the door and watches as the cab drives away He sees two muggers attacking a darkhaired youth He slips on his spectacles Out comes the rest of the costume MJ and Peter walk down the street sidebyside At the theater MJ is distracted when she sees Peter in the audience She smiles sweetly Peter turns his back away leaving the muggers punching and kicking their fallen victim Two girls overtake him and giggle In his room Peter his shadow thrown behind him onto the wall stares at his own hand held out Peter stops and smiles Peter's hand goes up His staff peer in through the slatted blinds Cop cars and vans and officers on foot race off in one direction Robbie fondles the mask He smiles and walks on past an alleyway Peter stares into space his steely blue eyes bright and determined Then they both resume walking The disgruntled garbage man goes He drops the costume then walks down the alley and away from the dust bin into which he has consigned the last vestige of the superhero Jameson's on the phone The sun shines as Peter with a jaunty gait strides through the city He awkwardly gets to his feet reaches into his pocket and hauls out his spectacles Peter munches his hot dog and sets off in the other In his room he studies Peter grins proudly His back resting on a pillow Peter trips on the sidewalk a big cigar in his mouth"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "She turns to her costar MJ and Peter walk down the street sidebyside Peter standing beside her gazes at her earnestly Then they both resume walking He looks at her through doleful eyes and she scrutinizes his features She turns away and crosses to a yellow cab She opens the door of the cab and before getting in turns to look at him once more Peter half smiles as MJ steps into the cab shuts the door and watches as the cab drives away He slips on his spectacles At the Bugle a headline is being composed Jameson's on the phone He pulls SpiderMan's mask from a bag Out comes the rest of the costume The disgruntled garbage man goes Robbie fondles the mask In his office Jameson in the SpiderMan costume minus the mask leaps onto his desk a big cigar in his mouth He flexes his wrists as if shooting out webs His staff peer in through the slatted blinds Robbie shakes his head Two girls overtake him and giggle He smiles and walks on past an alleyway He sees two muggers attacking a darkhaired youth Peter turns his back away leaving the muggers punching and kicking their fallen victim In his room Peter his shadow thrown behind him onto the wall stares at his own hand held out His back resting on a pillow Peter stares into space his steely blue eyes bright and determined Outside in a dark alley with ominous clouds in the sky Peter stands with his SpiderMan costume held out in front of him The wind ruffles his hair as he remains still for a moment He drops the costume then walks down the alley and away from the dust bin into which he has consigned the last vestige of the superhero The sun shines as Peter with a jaunty gait strides through the city Peter trips on the sidewalk He awkwardly gets to his feet reaches into his pocket and hauls out his spectacles He flicks them open puts them on and sets off a little wet At home he tightens up a wheel on his moped and spins it The wheel rolls off the front forks and bounces out of the open window He strolls away from a hot dog man and stands at the curve Cop cars and vans and officers on foot race off in one direction Peter munches his hot dog and sets off in the other In his room he studies Peter's hand goes up Peter grins proudly On the campus Doctor Connors races up to him Peter stops and smiles At the theater MJ is distracted when she sees Peter in the audience He grins inanely She smiles sweetly She ignores the prompt"
        }
      ]
    }
  ]
}