{
  "ground_truth": "Octavius covers his face while Spider-Man fires more webs. Spider-Man somersaults back, jumps to avoid the mechanical limbs, and limbos under a bridge. With two webs attached to two limbs, Octavius catapults Spider-Man towards a covered walkway. Spider-Man lands on Octavius and knocks him off the roof. Octavius uses one of the limbs to thrust Spider-Man into the train. Spider-Man crashes through a door, stops at the opposite one, spins around two poles, and tangles with Octavius, who struggles through and climbs up to the roof. Spider-Man turns to see why and presses himself to the side of the train to avoid an oncoming one. While it passes, he clambers out of the roof. Spider-Man spots a limb moving under the train and crawls down. The passengers find Spider-Man at one window and Octavius at the one opposite. Octavius punches Spider-Man, who falls onto the street below. Quick webs grab him out of the way of cars and up into the air. Spider-Man swings along beside the elevated track, bounds over high buildings, and flings himself down, shooting a web at Octavius and landing on him. Octavius gains the upper hand by clutching Spider-Man with two of his long metal limbs and smashing him into a train window. Spider-Man flails but manages to stick his feet to the side of the train. Octavius holds Spider-Man tightly in his arms, causing his head to smash through signs on the side of the track. As a train comes the other way, Octavius lets go, and the train hits Spider-Man. He swings gracefully with a long web. Seeing him come, Octavius pulls two passengers from the train and holds them up, tossing a woman at Spider-Man, who swoops down, catches her, and deposits her into a web safety net. Next, Octavius throws the man he's holding, and Spider-Man sweeps up the passenger before he hits the track, then places him in a web mat. Spider-Man punches the driver, and as he lands behind Octavius, a limb pushes a lever, causing the train to pick up speed, sending the passengers whining. Octavius tosses the lever to Spider-Man and leaps off the train. Spider-Man heads for the front, where a further explosion burns his mask, which he peels off. Blinking to clear his eyes, he realizes the train is hurdling through the city towards the end of the line. The unmasked Spider-Man leaps down onto the track, raises himself against the train, and uses his feet to shove against the sleepers in an attempt to decelerate. He jumps back onto the train, clutching his right knee as it continues its relentless surge through the city. Spider-Man leaps anxiously from side to side, then shoots webs right and left.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Octavius shields his visage while Spider-Man discharges additional filaments. Spider-Man pirouettes back, leaps to evade the mechanical appendages, and limbos beneath a viaduct. With two filaments fastened to two appendages, Octavius hurls Spider-Man toward a covered passageway. Spider-Man alights on Octavius and strikes him from the rooftop. Octavius employs one of the appendages to propel Spider-Man into the train. Spider-Man crashes through a portal, halts at the opposite one, whirls around two pillars, and grapples with Octavius, who strains through and ascends to the rooftop. Spider-Man pivots to discern why and presses himself to the flank of the train to evade an approaching one. As it passes, he scrambles out of the rooftop. Spider-Man detects an appendage moving beneath the train and crawls downward. The travelers observe Spider-Man at one window and Octavius at the one opposite. Octavius strikes Spider-Man, who plummets onto the roadway below. Swift filaments snatch him from the path of vehicles and aloft into the atmosphere. Spider-Man swings alongside the elevated line, bounds over lofty edifices, and hurls himself downward, discharging a filament at Octavius and alighting on him. Octavius secures the advantage by grasping Spider-Man with two of his extended metallic appendages and shattering him into a train portal. Spider-Man flounders but manages to adhere his feet to the flank of the train. Octavius grips Spider-Man firmly in his limbs, causing his head to crash through placards on the margin of the line. As a train approaches the opposite direction, Octavius releases, and the train strikes Spider-Man. He swings elegantly with an extended filament. Perceiving him approach, Octavius pulls two travelers from the train and holds them aloft, hurling a female at Spider-Man, who swoops down, intercepts her, and deposits her into a filament safety mesh. Subsequently, Octavius throws the man he's gripping, and Spider-Man retrieves the traveler before he strikes the line, then places him in a filament mat. Spider-Man strikes the conductor, and as he lands behind Octavius, an appendage pushes a lever, causing the train to accelerate, sending the travelers wailing. Octavius throws the lever to Spider-Man and vaults off the train. Spider-Man heads for the front, where a further detonation scorches his mask, which he peels away. Blinking to clear his sight, he comprehends the train is racing through the metropolis towards the terminus. The unmasked Spider-Man leaps down onto the line, braces himself against the train, and uses his feet to press against the sleepers in an attempt to decelerate. He leaps back onto the train, clutching his right knee as it continues its inexorable rush through the metropolis. Spider-Man leaps nervously from side to side, then discharges filaments right and left."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Octavius's face is covered by him while more webs are fired by Spider-Man. A somersault is performed by Spider-Man, a jump is made to avoid the mechanical limbs, and he limbos under a bridge. With two webs attached to two limbs, Spider-Man is catapulted by Octavius towards a covered walkway. Octavius is landed on by Spider-Man and knocked off the roof by him. One of the limbs is used by Octavius to thrust Spider-Man into the train. A door is crashed through by Spider-Man, and he is stopped at the opposite one. He spins around two poles and tangles with Octavius, who struggles through and climbs up to the roof. The reason is turned to see by Spider-Man, and he presses himself to the side of the train to avoid an oncoming one. While it passes, the roof is clambered out of by him. A limb moving under the train is spotted by Spider-Man, and he crawls down. Spider-Man is found at one window and Octavius at the opposite one by the passengers. Spider-Man is punched by Octavius, who falls onto the street below. He is grabbed by quick webs out of the way of cars and up into the air. The elevated track is swung along beside by Spider-Man, high buildings are bounded over, and he flings himself down, shooting a web at Octavius and landing on him. The upper hand is gained by Octavius by clutching Spider-Man with two of his long metal limbs and smashing him into a train window. Spider-Man flails but manages to stick his feet to the side of the train. Spider-Man is held tightly in his arms by Octavius, causing his head to be smashed through signs on the side of the track. As a train comes the other way, he is let go by Octavius, and Spider-Man is hit by the train. He swings gracefully with a long web. Seeing him come, two passengers are pulled from the train by Octavius and held up, a woman is tossed at Spider-Man, who swoops down, catches her, and deposits her into a web safety net. Next, the man he's holding is thrown by Octavius, and a passenger is swept up by Spider-Man before he hits the track, then he is placed in a web mat. The driver is punched by Spider-Man, and as he lands behind Octavius, a lever is pushed by a limb, causing the train to pick up speed, sending the passengers whining. The lever is tossed to Spider-Man by Octavius, and he leaps off the train. The front is headed for by Spider-Man, where his mask is burned by a further explosion, which is peeled off by him. Blinking to clear his eyes, he realizes the train is hurdling through the city towards the end of the line. The unmasked Spider-Man leaps down onto the track, raises himself against the train, and uses his feet to shove against the sleepers in an attempt to decelerate. The train is jumped back onto, clutching his right knee as it continues its relentless surge through the city. Spider-Man leaps anxiously from side to side, then right and left webs are shot by him."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Octavius shields his face as Spider-Man fires webs. Spider-Man somersaults, dodges limbs, and limbos under a bridge. With two webs on Octavius' limbs, Spider-Man is flung towards a walkway, landing on Octavius and knocking him off. Octavius uses a limb to hurl Spider-Man into a train. Spider-Man crashes, spins around poles, and tangles with Octavius, who climbs to the roof. Spider-Man presses to the train's side, avoiding another one, then emerges on the roof. He spots a limb beneath, crawls down, and the passengers see Spider-Man and Octavius at opposite windows. Octavius punches Spider-Man to the street, but quick webs save him. Spider-Man swings alongside the elevated track, leaps over buildings, and lunges at Octavius. Octavius overpowers him, clutching Spider-Man with limbs and smashing him into a window. Octavius releases him as a train hits Spider-Man, who swings gracefully. Octavius grabs two passengers, tossing a woman at Spider-Man, who catches her and places her in a web. He rescues the man thrown next, securing him in another web. Spider-Man punches Octavius, a limb pushes a lever, speeding the train. Octavius leaps off, leaving Spider-Man to face an explosion that burns his mask. Unmasked, Spider-Man leaps onto the track, pushing against sleepers to slow the train. He jumps back aboard, clutching his knee as the train speeds through the city. He anxiously leaps and shoots webs on both sides."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Octavius covers his face as Spider-Man fires webs. Spider-Man somersaults, dodges limbs, and limbos under a bridge. Octavius uses two limbs with attached webs to catapult Spider-Man onto a covered walkway. Spider-Man lands on Octavius, knocking him off the roof. Octavius thrusts Spider-Man into a train. Spider-Man crashes through a door, spins around poles, and tangles with Octavius, who climbs to the roof. Spider-Man avoids an oncoming train by pressing to its side and climbs onto the roof. Spotting a limb underneath, he crawls down. Passengers see Spider-Man at one window and Octavius opposite. Octavius knocks Spider-Man to the street, but quick webs pull him away from cars and into the air. Spider-Man swings alongside tracks, over buildings, and shoots a web at Octavius. Octavius gains control, smashing Spider-Man into a window. Flailing, Spider-Man sticks to the train's side. Octavius holds Spider-Man, smashing his head through signs. As a train approaches, Octavius lets go, and it hits Spider-Man, who swings away. Octavius pulls passengers from the train, tossing a woman at Spider-Man, who catches and places her safely in a web. He then saves a man, placing him in a web mat. Spider-Man punches the driver and lands behind Octavius, who increases the train's speed and jumps off. Spider-Man moves to the front, where an explosion burns his mask, which he removes. Seeing the train heading for the end, unmasked Spider-Man leaps onto the track, using his feet to slow it. He jumps back on the train, clutching his knee as it surges through the city, leaping anxiously and shooting webs."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Octavius desperately covers his face with his hands while Spider-Man fires off more webs, determined to gain the upper hand. Spider-Man gracefully somersaults backward, expertly jumps to avoid the menacing mechanical limbs, and skillfully limbos under a nearby bridge. With his quick reflexes, Spider-Man attaches two webs to two separate limbs of Octavius, who then catapults Spider-Man with force toward a covered walkway. Spider-Man lands precisely on top of Octavius, successfully knocking him off the roof they were perched upon. In retaliation, Octavius uses one of his powerful limbs to thrust Spider-Man directly into the side of the speeding train. Spider-Man crashes through a door, coming to a stop against the opposite one, then spins around two poles in fluid motion and tangles with Octavius, who struggles persistently and climbs back up to the roof. Curious to know why Octavius is climbing, Spider-Man turns to see and presses himself against the side of the train to narrowly avoid another oncoming one. As it races past, he clambers out onto the roof once more. Spider-Man quickly spots a limb of Octavius moving stealthily under the train and decides to crawl down to investigate. The passengers inside the train notice Spider-Man at one window and Octavius at the opposite one. Octavius takes advantage of the situation by punching Spider-Man, causing him to fall onto the street below, but Spider-Man's quick webs snag him out of harm's way, lifting him into the air just in time to dodge the oncoming cars. Spider-Man swings deftly along the elevated track, bouncing over tall buildings, then launches himself downward, shooting a web at Octavius and landing forcefully on him. However, Octavius gains the upper hand by clutching Spider-Man with two of his long, metal limbs, smashing him into the train window. Spider-Man flails in response but manages to stick his feet to the train's side. Octavius holds onto Spider-Man with a firm grip, causing his head to crash through the signs lining the side of the track. When yet another train approaches from the opposite direction, Octavius releases his hold, allowing the train to collide with Spider-Man. In a display of agility, Spider-Man swings gracefully upward with a long web. As he approaches, Octavius seizes the opportunity to pull two unsuspecting passengers from the train, holding them aloft, and hurls a woman toward Spider-Man. In a swift move, he swoops down and catches her, gently depositing her into a web safety net. Not stopping there, Octavius then throws the man he’s holding, and Spider-Man swoops up the passenger just in time before he can hit the train track, placing him safely in a web mat. Spider-Man strategically punches the driver, and as he lands behind Octavius, a limb pushes a lever, causing the train to accelerate, sending the passengers into a state of panic. With a firm toss, Octavius hurls the lever at Spider-Man before leaping off the speeding train. Spider-Man makes his way to the front of the train, but a sudden explosion burns his mask, prompting him to peel it off. Blinking to clear his eyes, he realizes with urgency that the train is hurtling through the city toward the end of the line. The determined, unmasked Spider-Man leaps down onto the track, fortifying himself against the train, and uses his feet to push against the sleepers in a desperate attempt to decelerate. Jumping back onto the train, he clutches his right knee, already in pain, as it continues to charge relentlessly through the bustling city. Spider-Man moves anxiously from side to side, then shoots webs in both directions, right and left, hoping to gain control."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Octavius, overwhelmed by desperation, instinctively shields his face with his trembling hands as Spider-Man resolutely fires off a series of webs, firmly set on gaining the upper hand in their intense confrontation. With remarkable agility, Spider-Man performs a graceful backward somersault, effortlessly leaping to evade the menacing attacks from Octavius's formidable mechanical limbs. He skillfully limbos under a nearby bridge with precision and finesse. Demonstrating his quick reflexes, Spider-Man cleverly attaches two separate webs to different limbs of Octavius, resulting in Octavius forcefully catapulting Spider-Man toward a covered walkway. Spider-Man precisely lands atop Octavius, achieving a successful maneuver that knocks him off the roof where they had been precariously perched. In a swift move of retaliation, Octavius utilizes one of his powerful mechanical limbs to hurl Spider-Man directly into the speeding train's side. Spider-Man crashes through a door, coming to an abrupt stop against the opposite one. Then, in a fluid motion, he spins around two poles and entangles once more with Octavius, who persists in his relentless struggle and climbs determinedly back onto the roof. Curious and intrigued about Octavius's motives for climbing, Spider-Man turns his gaze to see and presses himself firmly against the side of the train, narrowly avoiding another oncoming one as it races past. Once clear, he clambers back onto the roof. Spider-Man swiftly spots one of Octavius's metal limbs moving stealthily beneath the train and decides to crawl down to investigate further. The passengers inside the train observe with growing concern, noticing Spider-Man at one window and Octavius at the opposing one. Seizing the advantage of the situation, Octavius punches Spider-Man, causing him to fall onto the street below. However, Spider-Man's sharp reflexes and quick webs rescue him from peril, lifting him into the air just in time, allowing him to dodge the oncoming traffic and cars. As he swings deftly along the elevated track, he bounces over the towering buildings before launching himself downward, shooting a web at Octavius and landing with force upon him. Nevertheless, Octavius regains dominance by ensnaring Spider-Man with two of his long, metal limbs, mercilessly smashing him against the train window. Spider-Man flails in response, but manages to affix his feet to the train's side. Octavius maintains a firm grip on Spider-Man, causing his head to crash through the signs lining the track. When a train approaches from the opposite direction, Octavius releases his hold, allowing the oncoming train to collide violently with Spider-Man. In a breathtaking display of agility, Spider-Man swings gracefully upward with a long web, approaching Octavius as he seizes the moment to abduct two unsuspecting passengers from the train, lifting them aloft, and throws a woman toward Spider-Man. With a swift maneuver, he swoops down, catching her mid-air and gently placing her into a web safety net he has created. Not ceasing there, Octavius throws the man he’s holding, and Spider-Man quickly swoops up to grab the passenger just before he falls onto the train tracks, gingerly placing him safely onto a webbed mat. Strategically, Spider-Man punches the train driver and, upon landing behind Octavius, a mechanical limb suddenly pushes a lever, causing the train to accelerate, plunging the passengers into a state of panic and alarm. With a forceful toss, Octavius hurls the lever at Spider-Man before making a dramatic leap off the speeding train. Spider-Man urgently makes his way to the train's front, but a sudden burst of explosion burns his mask, prompting him to peel it off reflexively. Blinking to clear his eyes, he becomes acutely aware that the train is racing through the city heading straight toward the end of the line. In a determined, unmasked state, Spider-Man bravely leaps down onto the track, fortifying himself against the train's force, and uses his feet to push against the sleepers in a desperate bid to decelerate its speed. Jumping back onto the train, he clutches his right knee, wincing from pain, as the train continues its relentless charge through the bustling cityscape. Anxiously, Spider-Man moves from side to side, shooting webs in both directions, right and left, in a desperate hope to gain control of the speeding train."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Octavius quickly lifts his hands to shield his face as Spider-Man rapidly shoots more webs in his direction. In a fluid motion, Spider-Man executes a backward somersault to gain distance, then instantly propels himself into the air to deftly evade the aggressive sweep of Octavius's mechanical limbs, stretching and bending his body to limbo under a nearby bridge. With precise aim, he attaches a web to each of two thrashing limbs. Seizing the moment, Octavius violently swings Spider-Man, sending him hurtling toward a covered walkway. With agility, Spider-Man lands directly on Octavius, their combined momentum tipping Octavius off the roof. Reacting swiftly, Octavius uses one of his mechanical limbs to powerfully toss Spider-Man into a passing train. As Spider-Man hurtles through a compartment door, he slides to a stop at the door on the opposite side, only to quickly regain his footing and spin around two poles. Octavius charges and climbs up to the roof as they continue to grapple. Spider-Man, attuned to his surroundings, turns and notices an oncoming train. He presses himself tightly against the side of the current train just in time to avoid collision. As the passing train roars by, he uses his chance to climb out onto the roof. From his perch, Spider-Man spots one of Octavius's limbs slithering ominously beneath the train, prompting him to crawl downward to confront it. Inside, passengers are startled to find Spider-Man at one window, and directly opposite, Octavius. Octavius takes advantage of the surprise, striking Spider-Man with a powerful punch that forces him down onto the street below. In a rapid response, Spider-Man's quick reflexes allow him to deploy webbing that snatches him from the path of oncoming cars and hoists him back into the air. Swinging gracefully alongside the elevated track, he leaps agilely over towering buildings before launching himself down, firing a web at Octavius, and landing forcefully upon him. But Octavius, ever resourceful, turns the tide by ensnaring Spider-Man with two of his robust metal limbs, smashing him brutally against a train window. Despite the assault, Spider-Man clings to the train's side with his feet, though Octavius keeps him in a tight grip, causing Spider-Man's head to crash painfully through several track-side signs. At the approach of an oncoming train, Octavius releases Spider-Man, who is then struck by the train yet manages to swing away on a long webline. Anticipating Spider-Man's next move, Octavius seizes two passengers from the train and hurls a woman at him. Displaying remarkable agility, Spider-Man swoops down, catches her mid-air, and gently places her into a web safety net. Following this, Octavius throws the male passenger, prompting Spider-Man to act quickly, snatching the man from imminent danger and securing him on a webbed mat. Swiftly, Spider-Man lands a punch on the train driver, landing behind Octavius, whose limb quickly flips a lever to increase the train's speed, causing alarm among the passengers. As Octavius flees, he tosses the lever back to Spider-Man, leaping off the train. Spider-Man urgently moves to the front, where a sudden explosion envelops him, burning his mask, which he hurriedly peels away. His vision momentarily blurred, he blinks rapidly to regain focus, comprehending the peril as the train hurtles through the city, racing toward the terminal station. Determined, the unmasked Spider-Man descends onto the track, braces himself against the train, and employs his feet to push against the sleepers in a desperate attempt to slow its furious speed. With a grimace, he leaps back onto the train, clutching his right knee from the exertion, as it continues its relentless charge. In an urgent bid to regain control, Spider-Man leaps from side to side across the train, instinctively shooting webs to the right and left to stabilize and prepare for the challenges ahead."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Spider-Man evades Octavius's attacks and cleverly maneuvers to counter, resulting in a series of dynamic confrontations. After initially somersaulting and dodging mechanical limbs, Spider-Man is catapulted by Octavius onto a covered walkway, where the battle intensifies. He lands on Octavius, sending them both off a roof, and uses quick reflexes to avoid falling into traffic by swinging through the air and catching himself with webs. As Octavius seizes an opportunity to strike, Spider-Man is sent crashing through a train door. Regaining his balance, he witnesses Octavius climbing to the roof and avoids an oncoming train by pressing against its side. \n\nSpider-Man spots a limb moving under the train, prompting him to position himself strategically. As passengers witness the intense face-off, Octavius punches Spider-Man, causing him to fall, but quick web skills save him from traffic. Swinging beside the elevated track, Spider-Man bounds over buildings and attacks Octavius with a web. However, Octavius counters by smashing Spider-Man into a train window. Despite the pummeling, Spider-Man sticks to the train's side while Octavius bashes him into trackside signs. After a near miss with an oncoming train, Spider-Man swings back just in time to counteract Octavius, who then uses passengers as leverage by tossing them at Spider-Man. Spider-Man skillfully saves them with web nets.\n\nOctavius manipulates the train controls, leaving Spider-Man to respond to a speed increase while Octavius escapes. Spider-Man rushes to the front, where an explosion damages his mask, forcing him to remove it and face the imminent threat of the train's end-of-line collision. In a desperate bid to slow the train, Spider-Man leaps onto the tracks and uses his strength to decelerate by pushing against the sleepers. He then returns to the train, enduring the relentless momentum as he continues his attempts to regain control, and finally shoots webs to stabilize the situation."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Octavius covers his face while Spider-Man, the superhero known for his agility and combat skills, fires more webs. Spider-Man somersaults back, demonstrating his acrobatic prowess developed from years of experience, jumps to avoid the mechanical limbs of Octavius, his nemesis equipped with advanced robotic arms, and limbos under a bridge that spans the Hudson River. With two webs ingeniously attached to his enemy's two limbs, Octavius catapults Spider-Man towards a covered walkway above a bustling New York street. Spider-Man lands on Octavius in a skillful maneuver and knocks him off the roof of a speeding train. Octavius uses one of his mechanical limbs, designed with superhuman strength, to thrust Spider-Man into the train. Spider-Man crashes through a door, stops at the opposite one, spins around two poles like a gymnast, and tangles with Octavius, who struggles through the crowded train and climbs up to the roof. Spider-Man turns to see why and presses himself against the side of the train to avoid an oncoming one on the adjacent tracks. While it passes, he clambers out of the roof, risking the fierce winds and high-speed danger. Spider-Man spots a limb moving under the train and crawls down with a determination honed from countless battles. The passengers, New Yorkers accustomed to surprises but shocked, find Spider-Man at one window and Octavius at the one opposite. Octavius punches Spider-Man, who falls onto the street below filled with the typical midday traffic. Quick webs grab him out of the way of cars zooming by and up into the air. Spider-Man swings along beside the elevated track, a feat that showcases his mastery of web-slinging, bounds over high buildings that dot the skyline, and flings himself down, shooting a web at Octavius and landing on him. Octavius gains the upper hand by clutching Spider-Man with two of his long metal limbs, smashing him into a train window that shatters upon impact. Spider-Man flails but manages to stick his feet to the side of the train, emphasizing his adhesive powers. Octavius holds Spider-Man tightly in his arms, causing his head to smash through signs advertising local businesses on the side of the track. As a train comes the other way, Octavius lets go, and the train hits Spider-Man, who swings gracefully with a long web despite the impact. Seeing him come, Octavius pulls two passengers from the train and holds them up as hostages, tossing a woman at Spider-Man, who swoops down, catches her with heroic precision, and deposits her into a web safety net strung between two lamp posts. Next, Octavius throws the man he's holding, and Spider-Man swiftly sweeps up the passenger before he hits the track, then places him in a web mat designed to cushion his fall. Spider-Man punches the driver, incapacitating Octavius temporarily, and as he lands behind Octavius, a limb pushes a lever, causing the train to pick up speed, sending the passengers whining in panic. Octavius tosses the lever to Spider-Man and leaps off the train with cunning speed. Spider-Man heads for the front, where a further explosion, likely a sabotage, burns his mask, which he peels off to reveal his true identity. Blinking to clear his eyes, he realizes the train is hurtling uncontrollably through the city towards the end of the line that stops abruptly. The unmasked Spider-Man leaps down onto the track, raises himself against the train, and uses his feet to shove against the sleepers, the wooden planks that support the rails, in an attempt to decelerate the speeding train. He jumps back onto the train, clutching his right knee injured from the strain as it continues its relentless surge through the cityscape. Spider-Man leaps anxiously from side to side, then shoots webs right and left in a last-ditch effort to save the day."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "as it continues its relentless surge through the city Octavius covers his face while SpiderMan fires more webs Octavius covers his face while SpiderMan fires more webs SpiderMan somersaults back jumps to avoid the mechanical limbs and limbos under a bridge With two webs attached to two limbs Octavius catapults SpiderMan towards a covered walkway SpiderMan lands on Octavius and knocks him off the roof Octavius uses one of the limbs to thrust SpiderMan into the train SpiderMan crashes through a door stops at the opposite one spins around two poles and tangles with Octavius who struggles through and climbs up to the roof Next Octavius throws the man he is holding and SpiderMan sweeps up the passenger before he hits the track then places him in a web mat He jumps back onto the train clutching his right knee SpiderMan lands on Octavius and knocks him off the roof He swings gracefully with a long web SpiderMan turns to see why and presses himself to the side of the train to avoid an oncoming one As a train comes the other way Octavius let us go and the train hits SpiderMan While it passes he clambers out of the roof SpiderMan spots a limb moving under the train and crawls down SpiderMan heads for the front where a further explosion burns his mask which he peels off The passengers find SpiderMan at one window and Octavius at the one opposite While it passes he clambers out of the roof SpiderMan somersaults back jumps to avoid the mechanical limbs and limbos under a bridge Octavius punches SpiderMan who falls onto the street below Quick webs grab him out of the way of cars and up into the air Octavius uses one of the limbs to thrust SpiderMan into the train SpiderMan swings along beside the elevated track bounds over high buildings and flings himself down shooting a web at Octavius and landing on him Octavius gains the upper hand by clutching SpiderMan with two of his long metal limbs and smashing him into a train window Octavius gains the upper hand by clutching SpiderMan with two of his long metal limbs and smashing him into a train window SpiderMan flails but manages to stick his feet to the side of the train Octavius holds SpiderMan tightly in his arms causing his head to smash through signs on the side of the track As a train comes the other way Octavius let us go and the train hits SpiderMan He swings gracefully with a long web Seeing him come With two webs attached to two limbs Octavius catapults SpiderMan towards a covered walkway Octavius pulls two passengers from the train and holds them up tossing a woman at SpiderMan who swoops down catches her and deposits her into a web safety net Next Octavius throws the man he is holding and SpiderMan sweeps up the passenger before he hits the track then places him in a web mat SpiderMan punches the driver and as he lands behind Octavius a limb pushes a lever causing the train to pick up speed sending the passengers whining SpiderMan spots a limb moving under the train and crawls down The unmasked SpiderMan leaps down onto the track raises himself against the train and uses his feet to shove against the sleepers in an attempt to decelerate Octavius tosses the lever to SpiderMan and leaps off the train SpiderMan heads for the front where a further explosion burns his mask which he peels off Blinking to clear his eyes he realizes the train is hurdling through the city towards the end of the line The unmasked SpiderMan leaps down onto the track raises himself against the train and uses his feet to shove against the sleepers in an attempt to decelerate He jumps back onto the train clutching his right knee as it continues its relentless surge through the city SpiderMan leaps anxiously from side to side then shoots webs right and left"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Octavius covers his face while SpiderMan fires more webs. SpiderMan somersaults back jumps to avoid the mechanical limbs and limbos under a bridge. With two webs attached to two limbs Octavius catapults SpiderMan towards a covered walkway. SpiderMan lands on Octavius and knocks him off the roof. Octavius uses one of the limbs to thrust SpiderMan into the train. SpiderMan crashes through a door stops at the opposite one spins around two poles and tangles with Octavius who struggles through and climbs up to the roof. SpiderMan turns to see why and presses himself to the side of the train to avoid an oncoming one. While it passes he clambers out of the roof. SpiderMan spots a limb moving under the train and crawls down. The passengers find SpiderMan at one window and Octavius at the one opposite. Octavius punches SpiderMan who falls onto the street below. Quick webs grab him out of the way of cars and up into the air. SpiderMan swings along beside the elevated track bounds over high buildings and flings himself down shooting a web at Octavius and landing on him. Octavius gains the upper hand by clutching SpiderMan with two of his long metal limbs and smashing him into a train window. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. SpiderMan flails but manages to stick his feet to the side of the train. Octavius holds SpiderMan tightly in his arms causing his head to smash through signs on the side of the track. As a train comes the other way Octavius let us go and the train hits SpiderMan. He swings gracefully with a long web. Seeing him come. Octavius pulls two passengers from the train and holds them up tossing a woman at SpiderMan who swoops down catches her and deposits her into a web safety net. Next Octavius throws the man he is holding and SpiderMan sweeps up the passenger before he hits the track then places him in a web mat. SpiderMan punches the driver and as he lands behind Octavius a limb pushes a lever causing the train to pick up speed sending the passengers whining. Octavius tosses the lever to SpiderMan and leaps off the train. SpiderMan heads for the front where a further explosion burns his mask which he peels off. Blinking to clear his eyes he realizes the train is hurdling through the city towards the end of the line. The unmasked SpiderMan leaps down onto the track raises himself against the train and uses his feet to shove against the sleepers in an attempt to decelerate. He jumps back onto the train clutching his right knee. as it continues its relentless surge through the city. SpiderMan leaps anxiously from side to side then shoots webs right and left."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Octavius covers his face while SpiderMan fires more webs. SpiderMan somersaults back jumps to avoid the mechanical limbs and limbos under a bridge. With two webs attached to two limbs Octavius catapults SpiderMan towards a covered walkway. SpiderMan lands on Octavius and knocks him off the roof. Octavius uses one of the limbs to thrust SpiderMan into the train. SpiderMan crashes through a door stops at the opposite one spins around two poles and tangles with Octavius who struggles through and climbs up to the roof. SpiderMan turns to see why and presses himself to the side of the train to avoid an oncoming one. While it passes he clambers out of the roof. SpiderMan spots a limb moving under the train and crawls down. The passengers find SpiderMan at one window and Octavius at the one opposite. Octavius punches SpiderMan who falls onto the street below. Quick webs grab him out of the way of cars and up into the air. SpiderMan swings along beside the elevated track bounds over high buildings and flings himself down shooting a web at Octavius and landing on him. Octavius gains the upper hand by clutching SpiderMan with two of his long metal limbs and smashing him into a train window. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. SpiderMan flails but manages to stick his feet to the side of the train. Octavius holds SpiderMan tightly in his arms causing his head to smash through signs on the side of the track. As a train comes the other way Octavius let us go and the train hits SpiderMan. He swings gracefully with a long web. Seeing him come. Octavius pulls two passengers from the train and holds them up tossing a woman at SpiderMan who swoops down catches her and deposits her into a web safety net. Next Octavius throws the man he is holding and SpiderMan sweeps up the passenger before he hits the track then places him in a web mat. SpiderMan punches the driver and as he lands behind Octavius a limb pushes a lever causing the train to pick up speed sending the passengers whining. Octavius tosses the lever to SpiderMan and leaps off the train. SpiderMan heads for the front where a further explosion burns his mask which he peels off. Blinking to clear his eyes he realizes the train is hurdling through the city towards the end of the line. The unmasked SpiderMan leaps down onto the track raises himself against the train and uses his feet to shove against the sleepers in an attempt to decelerate. He jumps back onto the train clutching his right knee. as it continues its relentless surge through the city. SpiderMan leaps anxiously from side to side then shoots webs right and left."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Octavius covers his face while SpiderMan fires more webs. SpiderMan somersaults back jumps to avoid the mechanical limbs and limbos under a bridge. With two webs attached to two limbs Octavius catapults SpiderMan towards a covered walkway. SpiderMan lands on Octavius and knocks him off the roof. Octavius uses one of the limbs to thrust SpiderMan into the train. SpiderMan crashes through a door stops at the opposite one spins around two poles and tangles with Octavius who struggles through and climbs up to the roof. SpiderMan turns to see why and presses himself to the side of the train to avoid an oncoming one. SpiderMan punches the driver and as he lands behind Octavius a limb pushes a lever causing the train to pick up speed sending the passengers whining. Octavius tosses the lever to SpiderMan and leaps off the train. SpiderMan heads for the front where a further explosion burns his mask which he peels off. Blinking to clear his eyes he realizes the train is hurdling through the city towards the end of the line. The unmasked SpiderMan leaps down onto the track raises himself against the train and uses his feet to shove against the sleepers in an attempt to decelerate. He jumps back onto the train clutching his right knee. as it continues its relentless surge through the city. SpiderMan leaps anxiously from side to side then shoots webs right and left."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Octavius covers his face while SpiderMan fires more webs. SpiderMan somersaults back jumps to avoid the mechanical limbs and limbos under a bridge. With two webs attached to two limbs Octavius catapults SpiderMan towards a covered walkway. He jumps back onto the train clutching his right knee. as it continues its relentless surge through the city. SpiderMan leaps anxiously from side to side then shoots webs right and left."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Dracula covers his face while a giant panda fires more webs. The giant panda somersaults back, jumps to avoid the mechanical limbs, and limbos under a bridge. With two webs attached to two limbs, Dracula catapults the giant panda towards a covered walkway. The giant panda lands on Dracula and knocks him off the roof. Dracula uses one of the limbs to thrust the giant panda into the train. The giant panda crashes through a door, stops at the opposite one, spins around two poles, and tangles with Dracula, who struggles through and climbs up to the roof. The giant panda turns to see why and presses itself to the side of the train to avoid an oncoming one. While it passes, the giant panda clambers out of the roof. The giant panda spots a limb moving under the train and crawls down. The passengers find the giant panda at one window and Dracula at the one opposite. Dracula punches the giant panda, who falls onto the street below. Quick webs grab it out of the way of cars and up into the air. The giant panda swings along beside the elevated track, bounds over high buildings, and flings itself down, shooting a web at Dracula and landing on him. Dracula gains the upper hand by clutching the giant panda with two of his long metal limbs and smashing it into a train window. The giant panda flails but manages to stick its feet to the side of the train. Dracula holds the giant panda tightly in its arms, causing its head to smash through signs on the side of the track. As a train comes the other way, Dracula lets go, and the train hits the giant panda. It swings gracefully with a long web. Seeing it come, Dracula pulls two passengers from the train and holds them up, tossing a woman at the giant panda, who swoops down, catches her, and deposits her into a web safety net. Next, Dracula throws the man he's holding, and the giant panda sweeps up the passenger before he hits the track, then places him in a web mat. The giant panda punches the driver, and as it lands behind Dracula, a limb pushes a lever, causing the train to pick up speed, sending the passengers whining. Dracula tosses the lever to the giant panda and leaps off the train. The giant panda heads for the front, where a further explosion burns its mask, which it peels off. Blinking to clear its eyes, it realizes the train is hurdling through the city towards the end of the line. The unmasked giant panda leaps down onto the track, raises itself against the train, and uses its feet to shove against the sleepers in an attempt to decelerate. It jumps back onto the train, clutching its right knee as it continues its relentless surge through the city. The giant panda leaps anxiously from side to side, then shoots webs right and left."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Octavius covers his face while Spider-Man fires more arrows. Spider-Man somersaults back, jumps to avoid the mechanical snakes, and limbos under a tree. With two arrows attached to two snakes, Octavius catapults Spider-Man towards a glass greenhouse. Spider-Man lands on Octavius and knocks him off the balcony. Octavius uses one of the snakes to thrust Spider-Man into the barn. Spider-Man crashes through a window, stops at the opposite one, spins around two statues, and tangles with Octavius, who struggles through and climbs up to the balcony. Spider-Man turns to see why and presses himself to the side of the barn to avoid an oncoming tractor. While it passes, he clambers out of the balcony. Spider-Man spots a snake moving under the barn and crawls down. The farmers find Spider-Man at one window and Octavius at the one opposite. Octavius punches Spider-Man, who falls onto the field below. Quick arrows grab him out of the way of cows and up into the air. Spider-Man swings along beside the elevated barn, bounds over tall silos, and flings himself down, shooting an arrow at Octavius and landing on him. Octavius gains the upper hand by clutching Spider-Man with two of his long metal snakes and smashing him into a barn window. Spider-Man flails but manages to stick his feet to the side of the barn. Octavius holds Spider-Man tightly in his arms, causing his head to smash through trees on the side of the field. As a tractor comes the other way, Octavius lets go, and the tractor hits Spider-Man. He swings gracefully with a long arrow. Seeing him come, Octavius pulls two farmers from the barn and holds them up, tossing a woman at Spider-Man, who swoops down, catches her, and deposits her into an arrow safety net. Next, Octavius throws the man he's holding, and Spider-Man sweeps up the farmer before he hits the field, then places him in an arrow mat. Spider-Man punches the driver, and as he lands behind Octavius, a snake pushes a lever, causing the barn to pick up speed, sending the farmers whining. Octavius tosses the lever to Spider-Man and leaps off the barn. Spider-Man heads for the front, where a further explosion burns his hat, which he peels off. Blinking to clear his eyes, he realizes the barn is hurdling through the countryside towards the end of the road. The unmasked Spider-Man leaps down onto the field, raises himself against the barn, and uses his feet to shove against the grass in an attempt to decelerate. He jumps back onto the barn, clutching his right knee as it continues its relentless surge through the countryside. Spider-Man leaps anxiously from side to side, then shoots arrows right and left."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Octavius uncovers his face while Spider-Man tosses more webs. Spider-Man cartwheels back, crouches to dodge the mechanical limbs, and crawls under a bridge. With two webs attached to two limbs, Octavius flings Spider-Man towards a covered walkway. Spider-Man kneels on Octavius and pushes him off the roof. Octavius uses one of the limbs to nudge Spider-Man into the train. Spider-Man bounces through a door, halts at the opposite one, hops around two poles, and grapples with Octavius, who stumbles through and crawls up to the roof. Spider-Man glances to see why and slides himself to the side of the train to dodge an oncoming one. While it passes, he swings out of the roof. Spider-Man notices a limb shifting under the train and leaps down. The passengers discover Spider-Man at one window and Octavius at the one opposite. Octavius brushes Spider-Man, who flies onto the street below. Quick webs lift him out of the way of cars and down into the air. Spider-Man glides along beside the elevated track, skips over high buildings, and launches himself down, throwing a web at Octavius and perching on him. Octavius seizes the upper hand by gripping Spider-Man with two of his long metal limbs and tossing him into a train window. Spider-Man wriggles but manages to cling his feet to the side of the train. Octavius grasps Spider-Man snugly in his arms, causing his head to slide through signs on the side of the track. As a train approaches the other way, Octavius flings him, and the train glances Spider-Man. He swings awkwardly with a short web. Seeing him arrive, Octavius drags two passengers from the train and holds them up, hurling a woman at Spider-Man, who glides down, catches her, and places her into a web safety net. Next, Octavius shoves the man he's holding, and Spider-Man darts up the passenger before he hits the track, then tucks him in a web mat. Spider-Man taps the driver, and as he lands beside Octavius, a limb pulls a lever, causing the train to decelerate, sending the passengers cheering. Octavius passes the lever to Spider-Man and slides off the train. Spider-Man heads for the front, where a distant explosion soaks his mask, which he yanks off. Blinking to clear his eyes, he realizes the train is coasting through the city towards the end of the line. The unmasked Spider-Man hops down onto the track, lowers himself against the train, and uses his feet to dig against the sleepers in an attempt to halt. He scurries back onto the train, gripping his left knee as it continues its relentless surge through the city. Spider-Man twists anxiously from side to side, then flings webs up and down."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Hummingbird covers its tail while the toaster fires more sparkles. The toaster somersaults back, jumps to avoid the painted ladders, and limbos under a kite. With two sparkles attached to two ladders, Hummingbird catapults the toaster towards a covered luggage cart. The toaster lands on Hummingbird and knocks it off the pedestal. Hummingbird uses one of the ladders to thrust the toaster into the fountain. The toaster crashes through a mirror, stops at the opposite one, spins around two lamps, and tangles with Hummingbird, who struggles through and climbs up to the pedestal. The toaster turns to see why and presses itself to the side of the fountain to avoid an oncoming one. While it passes, it clambers out of the pedestal. The toaster spots a ladder moving under the fountain and crawls down. The raccoons find the toaster at one window and Hummingbird at the one opposite. Hummingbird punches the toaster, which falls onto the path below. Quick sparkles grab it out of the way of lamp posts and up into the sky. The toaster swings along beside the elevated wall, bounds over high towers, and flings itself down, shooting a sparkle at Hummingbird and landing on it. Hummingbird gains the upper hand by clutching the toaster with two of its long feather ladders and smashing it into a fountain mirror. The toaster flails but manages to stick its wheels to the side of the fountain. Hummingbird holds the toaster tightly in its wings, causing its beak to smash through banners on the side of the wall. As a fountain comes the other way, Hummingbird lets go, and the fountain hits the toaster. It swings gracefully with a long sparkle. Seeing it come, Hummingbird pulls two raccoons from the fountain and holds them up, tossing a parrot at the toaster, which swoops down, catches it, and deposits it into a sparkle safety hammock. Next, Hummingbird throws the raccoon it's holding, and the toaster sweeps up the raccoon before it hits the wall, then places it in a sparkle rug. The toaster punches the conductor, and as it lands behind Hummingbird, a ladder pushes a button, causing the fountain to pick up speed, sending the raccoons whining. Hummingbird tosses the button to the toaster and leaps off the fountain. The toaster heads for the front, where a further eruption burns its lid, which it peels off. Blinking to clear its sensors, it realizes the fountain is hurdling through the park towards the end of the row. The uncovered toaster leaps down onto the wall, raises itself against the fountain, and uses its wheels to shove against the bushes in an attempt to decelerate. It jumps back onto the fountain, clutching its right wheel as it continues its relentless surge through the park. The toaster leaps anxiously from side to side, then shoots sparkles right and left."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Lucas shields his eyes while Captain Marvel launches more beams. Captain Marvel flips back, springs to dodge the swinging branches, and twists under a tunnel. With two ropes linked to two branches, Lucas propels Captain Marvel toward a hidden corridor. Captain Marvel lands on Lucas and pushes him off the rooftop. Lucas uses one of the branches to propel Captain Marvel into the tram. Captain Marvel bursts through a window, halts at the opposing one, whirls around two pillars, and tussles with Lucas, who shuffles through and clambers up to the roof. Captain Marvel pivots to see why and presses himself to the edge of the tram to dodge a passing one. As it goes by, he scrambles out on the roof. Captain Marvel notices a branch moving beneath the tram and descends. The commuters spot Captain Marvel at one window and Lucas at the one opposite. Lucas strikes Captain Marvel, who drops onto the pavement below. Swift ropes yank him out of the danger of vehicles and up into the sky. Captain Marvel glides alongside the elevated rails, leaps over towering structures, and hurls himself down, tossing a rope at Lucas and landing on him. Lucas seizes the advantage by gripping Captain Marvel with two of his lengthy wooden branches and bashing him against a tram window. Captain Marvel thrashes but manages to attach his feet to the side of the tram. Lucas grips Captain Marvel tightly in his arms, causing his head to crash through advertisements on the side of the path. As a tram comes from the opposite direction, Lucas lets go, and the tram collides with Captain Marvel. He swings elegantly with a long rope. Noticing him approach, Lucas pulls two commuters from the tram and holds them up, chucking a gentleman at Captain Marvel, who dives down, grabs him, and places him into a rope safety net. Next, Lucas hurls the lady he's holding, and Captain Marvel scoops up the commuter before she hits the tracks, then sets her in a rope mat. Captain Marvel punches the engineer, and as he lands behind Lucas, a branch nudges a dial, causing the tram to gain velocity, sending the commuters wailing. Lucas throws the dial to Captain Marvel and vaults off the tram. Captain Marvel strides to the front, where an additional blast singes his helmet, which he removes. Blinking to clear his vision, he realizes the tram is racing through the city towards the end of the route. The unmasked Captain Marvel descends onto the path, braces himself against the tram, and uses his feet to press against the rails in an attempt to decelerate. He bounds back onto the tram, clutching his left ankle as it continues its unstoppable drive through the city. Captain Marvel leaps nervously from side to side, then hurls ropes right and left."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Octavius hides his hands while Spider-Man throws more ropes. Spider-Man cartwheels forward, skips to dodge the inflatable balloons, and slides under a tunnel. With two ropes tied to two balloons, Octavius slingshots Spider-Man toward a hidden terrace. Spider-Man lands on Octavius and pushes him off the balcony. Octavius uses one of the balloons to launch Spider-Man into the bus. Spider-Man tumbles through a window, halts at the opposite one, whirls around two trees, and wrestles with Octavius, who twists through and hops up to the balcony. Spider-Man glances to see why and glues himself to the side of the bus to evade an approaching one. As it goes by, he scrambles out of the tunnel. Spider-Man notices a balloon drifting under the bus and shuffles down. The passengers find Spider-Man at one window and Octavius at the one across. Octavius kicks Spider-Man, who tumbles onto the beach below. Quick ropes pull him out of the way of bikes and up into the sky. Spider-Man swings along beside the elevated ridge, bounds over tall trees, and flings himself down, tossing a rope at Octavius and landing on him. Octavius gains the advantage by wrapping Spider-Man with two of his long rubber bands and pounding him into a bus window. Spider-Man flounders but manages to stick his hands to the side of the bus. Octavius holds Spider-Man firmly in his claws, causing his back to crash through banners on the side of the ridge. As a bus approaches the other way, Octavius lets go, and the bus hits Spider-Man. He swings elegantly with a long rope. Seeing him arrive, Octavius pulls two riders from the bus and lifts them up, tossing a girl at Spider-Man, who swoops down, catches her, and places her into a rope safety cradle. Next, Octavius throws the boy he's holding, and Spider-Man swoops up the rider before he hits the ridge, then places him in a rope hammock. Spider-Man slaps the driver, and as he lands before Octavius, a balloon pulls a lever, causing the bus to increase speed, sending the riders shrieking. Octavius hurls the lever to Spider-Man and springs off the bus. Spider-Man heads for the back, where another bang burns his hood, which he removes. Squinting to clear his vision, he realizes the bus is rushing through the forest toward the end of the line. The unmasked Spider-Man hops down onto the ridge, pushes himself against the bus, and uses his palms to shove against the branches in an attempt to slow down. He jumps back onto the bus, clutching his left elbow as it continues its unyielding charge through the forest. Spider-Man leaps nervously from corner to corner, then tosses ropes up and down."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Gustavo shields his ears while Eagle-Woman tosses more feathers. Eagle-Woman cartwheels forward, twirls to dodge the robotic tentacles, and dances over a fence. With two feathers tied to two tentacles, Gustavo flings Eagle-Woman towards a hidden escalator. Eagle-Woman crashes into Gustavo and drags him off the chimney. Gustavo uses one of the tentacles to vault Eagle-Woman into the bus. Eagle-Woman breaks through a window, halts at the opposite one, twirls around two chairs, and grapples with Gustavo who stumbles over and dives up to the chimney. Eagle-Woman pivots to discover how and flatters herself to the center of the bus to avoid an approaching one. As it passes, she climbs out of the chimney. Eagle-Woman notices a tentacle waving over the bus and scuttles up. The tourists find Eagle-Woman at one balcony and Gustavo at the one adjacent. Gustavo kicks Eagle-Woman, who tumbles onto the sidewalk above. Quick feathers snatch her out of the path of bikes and down into the river. Eagle-Woman skips along beside the underwater tunnel, leaps under tall bridges, and hurls herself up, tossing a feather at Gustavo and bouncing on him. Gustavo seizes the advantage by grasping Eagle-Woman with two of his long plastic tentacles and tossing her into a bus window. Eagle-Woman flounders but manages to adhere her hands to the ceiling of the bus. Gustavo grips Eagle-Woman gently in his toes, leading her nose to slam into flagposts on the edge of the tunnel. As a bus comes the opposite route, Gustavo releases her, and the bus grazes Eagle-Woman. She glides elegantly with a short feather. Spotting her approach, Gustavo drags two tourists from the bus and dangles them up, chucking a child at Eagle-Woman, who ascends up, saves him, and places him into a feather comforter. Then, Gustavo tosses the woman he's clasping, and Eagle-Woman swoops up the tourist before she strikes the tunnel, then parks her in a feather hammock. Eagle-Woman smacks the operator, and as she lands ahead of Gustavo, a tentacle pulls a handle, causing the bus to gain momentum, launching the tourists floating. Gustavo flings the handle to Eagle-Woman and vaults off the bus. Eagle-Woman aims for the back, where another burst scorches her hat, which she strips off. Squinting to clear her vision, she notices the bus is speeding under the park towards the start of the line. The uncovered Eagle-Woman vaults up onto the tunnel, lowers herself beside the bus, and uses her hands to push against the beams in an effort to accelerate. She hops back into the bus, clutching her left shoulder as it continues its gentle drift under the park. Eagle-Woman hops nervously from edge to edge, then flings feathers up and down."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Octavius and Spider-Man engage in a fierce battle. Spider-Man somersaults and dodges Octavius's mechanical limbs but is catapulted onto a train. After a series of acrobatic maneuvers, Octavius uses his limbs to smash Spider-Man into a train window. Forced to avoid an oncoming train, Spider-Man swings with his webs, saving passengers thrown by Octavius, placing them in web safety nets. Octavius increases the train's speed and leaps off, leaving Spider-Man to stop the runaway train. Unmasked, Spider-Man uses webs and his strength to attempt slowing it as it races toward disaster."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "SpiderMan leaps anxiously from side to side then shoots webs right and left as it continues its relentless surge through the city He jumps back onto the train clutching his right knee The unmasked SpiderMan leaps down onto the track raises himself against the train and uses his feet to shove against the sleepers in an attempt to decelerate Blinking to clear his eyes he realizes the train is hurdling through the city towards the end of the line SpiderMan heads for the front where a further explosion burns his mask which he peels off Octavius tosses the lever to SpiderMan and leaps off the train SpiderMan punches the driver and as he lands behind Octavius a limb pushes a lever causing the train to pick up speed sending the passengers whining Next Octavius throws the man he is holding and SpiderMan sweeps up the passenger before he hits the track then places him in a web mat Octavius pulls two passengers from the train and holds them up tossing a woman at SpiderMan who swoops down catches her and deposits her into a web safety net Seeing him come He swings gracefully with a long web As a train comes the other way Octavius let us go and the train hits SpiderMan Octavius holds SpiderMan tightly in his arms causing his head to smash through signs on the side of the track SpiderMan flails but manages to stick his feet to the side of the train Octavius gains the upper hand by clutching SpiderMan with two of his long metal limbs and smashing him into a train window SpiderMan swings along beside the elevated track bounds over high buildings and flings himself down shooting a web at Octavius and landing on him Quick webs grab him out of the way of cars and up into the air Octavius punches SpiderMan who falls onto the street below The passengers find SpiderMan at one window and Octavius at the one opposite SpiderMan spots a limb moving under the train and crawls down While it passes he clambers out of the roof SpiderMan turns to see why and presses himself to the side of the train to avoid an oncoming one SpiderMan crashes through a door stops at the opposite one spins around two poles and tangles with Octavius who struggles through and climbs up to the roof Octavius uses one of the limbs to thrust SpiderMan into the train SpiderMan lands on Octavius and knocks him off the roof With two webs attached to two limbs Octavius catapults SpiderMan towards a covered walkway SpiderMan somersaults back jumps to avoid the mechanical limbs and limbos under a bridge Octavius covers his face while SpiderMan fires more webs"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Seeing him come SpiderMan flails but manages to stick his feet to the side of the train Octavius punches SpiderMan who falls onto the street below Octavius tosses the lever to SpiderMan and leaps off the train SpiderMan punches the driver and as he lands behind Octavius a limb pushes a lever causing the train to pick up speed sending the passengers whining SpiderMan turns to see why and presses himself to the side of the train to avoid an oncoming one SpiderMan crashes through a door stops at the opposite one spins around two poles and tangles with Octavius who struggles through and climbs up to the roof SpiderMan swings along beside the elevated track bounds over high buildings and flings himself down shooting a web at Octavius and landing on him Quick webs grab him out of the way of cars and up into the air Octavius holds SpiderMan tightly in his arms causing his head to smash through signs on the side of the track The passengers find SpiderMan at one window and Octavius at the one opposite Blinking to clear his eyes he realizes the train is hurdling through the city towards the end of the line Octavius pulls two passengers from the train and holds them up tossing a woman at SpiderMan who swoops down catches her and deposits her into a web safety net SpiderMan leaps anxiously from side to side then shoots webs right and left As a train comes the other way Octavius let us go and the train hits SpiderMan He jumps back onto the train clutching his right knee SpiderMan somersaults back jumps to avoid the mechanical limbs and limbos under a bridge Octavius gains the upper hand by clutching SpiderMan with two of his long metal limbs and smashing him into a train window With two webs attached to two limbs Octavius catapults SpiderMan towards a covered walkway He swings gracefully with a long web as it continues its relentless surge through the city Octavius uses one of the limbs to thrust SpiderMan into the train The unmasked SpiderMan leaps down onto the track raises himself against the train and uses his feet to shove against the sleepers in an attempt to decelerate While it passes he clambers out of the roof SpiderMan spots a limb moving under the train and crawls down SpiderMan heads for the front where a further explosion burns his mask which he peels off Octavius covers his face while SpiderMan fires more webs SpiderMan lands on Octavius and knocks him off the roof Next Octavius throws the man he is holding and SpiderMan sweeps up the passenger before he hits the track then places him in a web mat"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Octavius holds SpiderMan tightly in his arms causing his head to smash through signs on the side of the track As a train comes the other way Octavius let us go and the train hits SpiderMan He swings gracefully with a long web Seeing him come Octavius pulls two passengers from the train and holds them up tossing a woman at SpiderMan who swoops down catches her and deposits her into a web safety net Next Octavius throws the man he is holding and SpiderMan sweeps up the passenger before he hits the track then places him in a web mat SpiderMan punches the driver and as he lands behind Octavius a limb pushes a lever causing the train to pick up speed sending the passengers whining Octavius tosses the lever to SpiderMan and leaps off the train SpiderMan heads for the front where a further explosion burns his mask which he peels off Blinking to clear his eyes he realizes the train is hurdling through the city towards the end of the line The unmasked SpiderMan leaps down onto the track raises himself against the train and uses his feet to shove against the sleepers in an attempt to decelerate He jumps back onto the train clutching his right knee as it continues its relentless surge through the city SpiderMan leaps anxiously from side to side then shoots webs right and left Octavius covers his face while SpiderMan fires more webs SpiderMan somersaults back jumps to avoid the mechanical limbs and limbos under a bridge With two webs attached to two limbs Octavius catapults SpiderMan towards a covered walkway SpiderMan lands on Octavius and knocks him off the roof Octavius uses one of the limbs to thrust SpiderMan into the train SpiderMan crashes through a door stops at the opposite one spins around two poles and tangles with Octavius who struggles through and climbs up to the roof SpiderMan turns to see why and presses himself to the side of the train to avoid an oncoming one While it passes he clambers out of the roof SpiderMan spots a limb moving under the train and crawls down The passengers find SpiderMan at one window and Octavius at the one opposite Octavius punches SpiderMan who falls onto the street below Quick webs grab him out of the way of cars and up into the air SpiderMan swings along beside the elevated track bounds over high buildings and flings himself down shooting a web at Octavius and landing on him Octavius gains the upper hand by clutching SpiderMan with two of his long metal limbs and smashing him into a train window SpiderMan flails but manages to stick his feet to the side of the train"
        }
      ]
    }
  ]
}