{
  "ground_truth": "The car trunk pops open and a hand reaches inside, pulling out a folded white sheet. A can of shoe polish is grabbed from the shelf. DANTE dips his fingers into the shoe polish and writes large letters on the unfurled sheet, leaning on the cooler. DANTE stands on a garbage can and tucks a corner of the sheet under the awning. He jumps down. The banner reads I ASSURE YOU, WE'RE OPEN. The door sign shifts from CLOSED to OPEN. The clock reads 6:20. DANTE leans behind the counter, the morning routine completed. He stares ahead, catatonic, then drops his head in his hands. The store, with its makeshift banner looming in the dim morning hour, just after dawn. A car drives by. DANTE waits on a customer (ACTIVIST) buying coffee. The ACTIVIST leans on a briefcase and drinks his coffee. Another CUSTOMER leans in the door. The ACTIVIST lifts his briefcase onto the counter. He opens it and extracts a sickly-looking lung model. The ACTIVIST hands him something from the briefcase. Hands him a picture. The CUSTOMER exits. Another CUSTOMER comes up to the counter. A blank wall. JAY steps into the frame, followed by SILENT BOB. JAY then throws down with a makeshift slam dance, spinning his arm and fake-hitting SILENT BOB. JAY pulls off his coat and swings it into the arms of SILENT BOB. SILENT BOB lights a smoke. SILENT BOB points to something off-screen. SILENT BOB nods. JAY makes blow job faces down an imaginary line of guys, looking quite like a performing seal. He throws a little humming sound behind each nod. He then hops up quickly. The small crowd begins to chant and jeer in DANTE's face. VERONICA enters and surveys the mess. The CROWD throws cigarettes at DANTE, pelting him in the face. Suddenly, a loud blast is heard, and white powder explodes over the throng. Everyone turns to face VERONICA as she stands in one of the freezer cases, holding a fire extinguisher. The CROWD looks among themselves. Someone points to O.C. The ACTIVIST carries his briefcase surreptitiously toward the door. VERONICA jumps off the freezer case, training the nozzle of the extinguisher on the ACTIVIST. She pokes the extinguisher nozzle at him, warningly. He reaches into his briefcase. He pulls out a business card and hands it to her. She reads it. He nods. He nods again. She blasts him with more chemical as he exits. He quickly flees. The CROWD sheepishly exits, one by one, offering apologetic glances. VERONICA watches the crowd disperse, disgusted. DANTE tries to regain his composure. The last of the crowd exits. DANTE is sitting on the floor, head in his folded arms. She slaps him.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "The automobile trunk pops open and a hand reaches inside, pulling out a folded white sheet. A tin of shoe polish is grabbed from the shelf. DANTE dips his fingers into the shoe polish and writes large letters on the unfurled sheet, leaning on the cooler. DANTE stands on a garbage can and tucks a corner of the sheet under the awning. He leaps down. The banner reads I ASSURE YOU, WE'RE OPEN. The door sign shifts from CLOSED to OPEN. The clock reads 6:20. DANTE leans behind the counter, the morning routine completed. He stares ahead, catatonic, then drops his head in his hands. The store, with its makeshift banner looming in the dim morning hour, just after dawn. A vehicle drives by. DANTE waits on a patron (ACTIVIST) buying coffee. The ACTIVIST leans on a briefcase and drinks his coffee. Another CUSTOMER leans in the door. The ACTIVIST lifts his briefcase onto the counter. He opens it and extracts a sickly-looking lung model. The ACTIVIST hands him something from the briefcase. Hands him a photograph. The CUSTOMER exits. Another CUSTOMER approaches the counter. A blank wall. JAY steps into the frame, followed by SILENT BOB. JAY then throws down with a makeshift slam dance, spinning his arm and fake-hitting SILENT BOB. JAY pulls off his coat and swings it into the arms of SILENT BOB. SILENT BOB lights a smoke. SILENT BOB points to something off-screen. SILENT BOB nods. JAY makes blow job faces down an imaginary line of guys, looking quite like a performing seal. He throws a little humming sound behind each nod. He then hops up quickly. The small crowd begins to chant and jeer in DANTE's face. VERONICA enters and surveys the mess. The CROWD throws cigarettes at DANTE, pelting him in the face. Suddenly, a loud blast is heard, and white powder explodes over the throng. Everyone turns to face VERONICA as she stands in one of the freezer cases, holding a fire extinguisher. The CROWD looks among themselves. Someone points to O.C. The ACTIVIST carries his briefcase surreptitiously toward the door. VERONICA jumps off the freezer case, training the nozzle of the extinguisher on the ACTIVIST. She pokes the extinguisher nozzle at him, warningly. He reaches into his briefcase. He pulls out a business card and hands it to her. She reads it. He nods. He nods again. She blasts him with more chemical as he exits. He quickly flees. The CROWD sheepishly exits, one by one, offering apologetic glances. VERONICA watches the crowd disperse, disgusted. DANTE attempts to regain his composure. The last of the crowd exits. DANTE is sitting on the floor, head in his folded arms. She slaps him."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The car trunk is popped open and a folded white sheet is pulled out by a hand reaching inside. Dante grabs a can of shoe polish from the shelf. The shoe polish is dipped into by Dante's fingers, and large letters are written on the unfurled sheet as he leans on the cooler. The corner of the sheet is tucked under the awning by Dante standing on a garbage can. He then jumps down. The banner reads I ASSURE YOU, WE'RE OPEN. The door sign is shifted from CLOSED to OPEN. The clock reads 6:20. The counter is leaned behind by Dante, with the morning routine completed. His stare is fixed ahead, catatonic, and his head is dropped in his hands. The store, with its makeshift banner looming in the dim morning hour, just after dawn. A car is driven by. A customer (ACTIVIST) buying coffee is waited on by Dante. The briefcase is leaned on by the ACTIVIST while drinking his coffee. The door is leaned into by another CUSTOMER. The briefcase is lifted onto the counter by the ACTIVIST. A sickly-looking lung model is extracted and the ACTIVIST hands him something from the briefcase. A picture is handed to him. The CUSTOMER exits. Another CUSTOMER approaches the counter. A blank wall. JAY steps into the frame, followed by Silent Bob. A makeshift slam dance is then thrown down by Jay, who spins his arm and fake-hits Silent Bob. Jay pulls off his coat and swings it into the arms of Silent Bob. A smoke is lit by Silent Bob. Something off-screen is pointed to by Silent Bob. Silent Bob nods. Jay makes blow job faces down an imaginary line of guys, resembling a performing seal. A little humming sound is thrown behind each nod. He then quickly hops up. Dante's face is chanted and jeered at by the small crowd. Veronica enters and surveys the mess. Cigarettes are thrown at Dante by the crowd, pelting him in the face. Suddenly, a loud blast is heard, and white powder explodes over the throng. Everyone turns to face Veronica as a fire extinguisher is held by her in one of the freezer cases. The crowd looks among themselves. O.C. is pointed to by someone. The ACTIVIST surreptitiously carries his briefcase toward the door. Veronica jumps off the freezer case, training the nozzle of the extinguisher on the ACTIVIST. The extinguisher nozzle is poked at him by her, warningly. He reaches into his briefcase. A business card is pulled out and handed to her. She reads it. He nods. He nods again. More chemical is blasted at him by her as he exits. He quickly flees. The crowd sheepishly exits, one by one, offering apologetic glances. The crowd disperses as Veronica watches, disgusted. Dante tries to regain his composure. The last of the crowd exits. Dante is seated on the floor, head in his folded arms. She slaps him."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "The car trunk opens, and a hand retrieves a folded white sheet and a can of shoe polish. DANTE writes on the sheet with the polish, leaning on a cooler. Standing on a garbage can, he secures the sheet under an awning. It reads I ASSURE YOU, WE'RE OPEN. The door sign changes from CLOSED to OPEN. At 6:20, DANTE finishes his morning tasks and slumps behind the counter. A car passes by. DANTE serves an ACTIVIST buying coffee. The ACTIVIST, with a briefcase, displays a sickly lung model and hands a picture to DANTE. As a CUSTOMER leaves, JAY and SILENT BOB enter. JAY dances exaggeratedly, tossing his coat to SILENT BOB, who lights a cigarette and gestures off-screen. JAY mimics inappropriate acts, provoking a CROWD that jeers at DANTE. VERONICA enters and assesses the chaos. The CROWD pelts DANTE with cigarettes. Suddenly, VERONICA douses the crowd with a fire extinguisher. The ACTIVIST discreetly approaches the door, but VERONICA confronts him. He hands her a business card, which she reads before blasting more chemicals as he escapes. The CROWD exits sheepishly. VERONICA observes them, disgusted, while DANTE attempts to recover. Alone, DANTE sits with his head down, until VERONICA slaps him."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "The trunk opens, revealing a hand pulling out a folded white sheet and a can of shoe polish. DANTE writes on the unfurled sheet using the polish and hangs it, reading \"I ASSURE YOU, WE'RE OPEN.\" The store's sign flips to OPEN at 6:20. DANTE completes the morning routine, staring catatonically. A car passes as DANTE serves a customer, the ACTIVIST, with coffee and a lung model. Another CUSTOMER leaves. JAY and SILENT BOB appear, dancing, and JAY mimics obscene gestures. A crowd taunts DANTE. VERONICA arrives, and the CROWD throws cigarettes at DANTE. A loud blast and white powder from VERONICA's fire extinguisher scatter the crowd. The ACTIVIST tries leaving but VERONICA sprays him again as he hands her a card. The CROWD exits apologetically. VERONICA, disgusted, watches them. DANTE sits on the floor defeated, and VERONICA slaps him."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "The trunk of the car makes a popping sound as it opens, revealing its contents, and a hand reaches inside to retrieve a neatly folded white sheet. From a nearby shelf, a can of shoe polish is picked up. DANTE dips his fingers into the shoe polish, using it to write large, bold letters on the now unfurled sheet, leaning against the cooler for support as he works. With determination, DANTE climbs onto a garbage can, carefully securing one corner of the sheet under the awning. Then, he jumps back down to the ground. The banner clearly displays the message I ASSURE YOU, WE'RE OPEN. The sign on the door shifts from CLOSED to OPEN, and the clock ticks to 6:20. DANTE leans behind the counter, having completed the morning routine. He stares ahead, appearing catatonic, before lowering his head into his hands. The store, illuminated by its improvised banner, casts a shadow in the early morning light, just after dawn. A car passes by. DANTE waits on a customer, an ACTIVIST purchasing coffee, who leans on a briefcase while sipping the brew. As another CUSTOMER steps into the doorway, the ACTIVIST lifts his briefcase onto the counter, opening it to reveal a sickly-looking lung model. From the briefcase, the ACTIVIST hands something to him, presenting a picture. The first CUSTOMER exits the scene. Another CUSTOMER then approaches the counter. Against a blank wall, JAY comes into view, followed by SILENT BOB. JAY begins to perform a makeshift slam dance, spinning his arm energetically and pretending to hit SILENT BOB, then removes his coat, flinging it playfully at SILENT BOB. SILENT BOB lights up a cigarette. SILENT BOB points towards something off-screen, nodding in agreement. JAY, mimicking lewd expressions, gestures a blow job down an imaginary line of guys, much like a performing seal, adding a little humming sound with each nod. He then jumps up quickly. The small crowd begins to chant and jeer directly in DANTE's face. VERONICA enters the scene and surveys the chaos. The CROWD throws cigarettes at DANTE, hitting him in the face. Suddenly, a loud blast erupts, and a cloud of white powder bursts over the crowd. Everyone turns their attention to VERONICA, who stands in one of the freezer cases, wielding a fire extinguisher. The CROWD exchanges uncertain glances, and someone points to something out of view. The ACTIVIST discreetly carries his briefcase toward the exit. VERONICA leaps off the freezer case, aiming the extinguisher's nozzle at the ACTIVIST threateningly. He reaches into his briefcase and pulls out a business card, handing it to her. She reads it carefully. He nods once, then nods again. She sprays him with more chemicals as he retreats hastily. The CROWD departs shamefacedly, offering apologetic looks as they exit one by one. VERONICA watches them leave, her expression filled with disgust. DANTE attempts to recover his composure. As the last of the crowd leaves, DANTE remains seated on the floor, his head resting in his folded arms. VERONICA slaps him to snap him out of his state."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "The trunk of the car emits a distinctive popping sound as it springs open, revealing its diverse contents to the open air, and a hand reaches deep inside to carefully retrieve a neatly folded, pristine white sheet. From a nearby, well-organized shelf, a can of glossy shoe polish is picked up. DANTE dips his fingers into the dark, rich shoe polish, using it to boldly scrawl large, eye-catching letters across the now fully unfurled sheet, leaning against the sturdy cooler for much-needed support as he diligently works. With determination and a sense of purpose, DANTE climbs onto a nearby garbage can, meticulously securing one corner of the sheet under the awning to ensure it stays in place. Then, with a careful jump, he descends back down to the ground. The banner proudly displays the message: I ASSURE YOU, WE'RE OPEN. Meanwhile, the sign on the door shifts conspicuously from CLOSED to OPEN, as the clock ticks over to precisely 6:20. DANTE, having completed his morning routine with routine precision, leans back behind the counter. He stares blankly ahead, adopting a catatonic appearance, before slowly lowering his head into his weary hands. The store, now illuminated by its improvised banner, casts a shadow in the gentle early morning light, just after the break of dawn. A car passes by quietly. DANTE waits on a customer, an ACTIVIST purchasing a warm cup of coffee, who casually leans on a briefcase while thoughtfully sipping the brew. As another CUSTOMER confidently steps into the doorway, the ACTIVIST lifts his briefcase onto the counter, opening it to reveal a sickly-looking lung model. From inside the briefcase, the ACTIVIST hands something to him, presenting a vivid picture. The first CUSTOMER discreetly exits the scene. Another CUSTOMER then approaches the counter. Against a plain, blank wall, JAY comes into view, followed closely by SILENT BOB. JAY begins to perform an impromptu slam dance, energetically spinning his arm and playfully pretending to hit SILENT BOB, then removes his coat, tossing it playfully at SILENT BOB. SILENT BOB lights up a cigarette, smoke curling up lazily. SILENT BOB points towards something off-screen, nodding in apparent agreement. JAY, mimicking lewd expressions, gestures as if performing a blow job down an imaginary line of guys, much like an animated performing seal, adding a little humming sound with each exaggerated nod. He then jumps up quickly, adding energy to his performance. The small crowd begins to chant and jeer directly in DANTE's face. VERONICA enters the chaotic scene and surveys the pandemonium. The CROWD throws cigarettes at DANTE, hitting him squarely in the face. Suddenly, a loud blast erupts, and a cloud of white powder bursts dramatically over the crowd. Everyone turns their startled attention to VERONICA, who stands authoritatively in one of the freezer cases, wielding a fire extinguisher with confidence. The CROWD exchanges uncertain glances, and someone points to something or someone out of view. The ACTIVIST discreetly carries his briefcase toward the exit, attempting to leave unnoticed. VERONICA leaps down from the freezer case, aiming the extinguisher's nozzle at the ACTIVIST in a threatening manner. He quickly reaches into his briefcase and pulls out a business card, handing it over to her carefully. She reads it with a critical eye, scrutinizing every detail. He nods once, then nods again for emphasis. She retaliates by spraying him with even more chemicals as he retreats hastily, trying to avoid further confrontation. The CROWD departs shamefacedly, offering apologetic looks as they exit one by one. VERONICA watches them leave, her expression filled with intense disgust. DANTE struggles to recover his composure. As the last of the crowd leaves, DANTE remains seated forlornly on the floor, his head resting heavily in his folded arms. VERONICA approaches him and slaps him to snap him out of his dazed state."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "The narrative begins with the soft mechanical click of the car trunk as it pops open, revealing a hand that reaches inside to retrieve a neatly folded white sheet. The hand moves with purpose, extracting the sheet with a gentle tug, simultaneously picking up a can of shoe polish from its place on the shelf. With deliberate concentration, DANTE dips his fingers into the glistening shoe polish and begins to scrawl large, bold letters across the unfurled sheet, using the surface of a cooler to steady the makeshift canvas. The letters form a clear message as DANTE, with careful balance, ascends a garbage can, stretches out to tuck one corner of the sheet securely under the awning before nimbly jumping back down to the ground. The stark banner, proclaiming \"I ASSURE YOU, WE'RE OPEN,\" sways slightly in the early morning breeze. Inside, the door sign flips from CLOSED to OPEN, accompanied by the quiet ticking of the clock reading 6:20. DANTE leans back behind the counter, having completed his morning routine, allowing himself a moment to stare blankly into space before cradling his head in his hands in a gesture of weary resignation. The store, bathed in the dim light just after dawn, stands quietly as a car drives past. DANTE attends to a customer, known as the ACTIVIST, who is purchasing a cup of coffee. The ACTIVIST casually leans on a briefcase while sipping his drink. Another CUSTOMER momentarily appears in the doorway. With a sense of intrigue, the ACTIVIST lifts his briefcase onto the counter, opens it, and reveals a sickly-looking lung model, which he presents alongside a picture handed to DANTE. As the CUSTOMER leaves, a new customer approaches the counter. A blank wall frames the scene before JAY energetically enters the frame, trailed by SILENT BOB. JAY bursts into an impromptu slam dance, swinging his arm and mock-punching SILENT BOB, adding to the chaos by shrugging off his coat and tossing it into SILENT BOB’s arms. SILENT BOB, unfazed, lights a cigarette and gestures towards an unseen point off-screen, nodding in agreement with whatever he observes. JAY, animatedly, mimics obscene gestures down an imaginary line of spectators, producing little humming sounds with each exaggerated nod. Quickly, the small gathering begins to chant and jeer directly in DANTE's face. VERONICA enters, her eyes scanning the unfolding disorder. The CROWD, growing more boisterous, pelts DANTE with cigarettes. Abruptly, a loud blast reverberates, and a flurry of white powder engulfs the scene. All eyes turn to VERONICA, who stands resolute in a freezer case, clutching a fire extinguisher. The CROWD exchanges bewildered looks as someone discreetly gestures towards O.C. With stealth, the ACTIVIST edges towards the exit, briefcase in hand. VERONICA boldly jumps down from the freezer, directing the extinguisher at the ACTIVIST in a warning stance. As a final act of defiance, he produces a business card from the briefcase and extends it to her. She scrutinizes it, and as he nods twice in acknowledgment, she unleashes another burst of chemicals, prompting his hasty retreat. The CROWD, now subdued, sheepishly disperses, casting apologetic glances as they leave. VERONICA observes the departing throng, her expression one of disgust. Meanwhile, DANTE struggles to regain his composure as the final stragglers exit. Left alone, he sits on the floor with his head buried in his folded arms. With a mix of frustration and a desire to snap him out of his stupor, VERONICA delivers a sharp slap to him."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "DANTE retrieves a folded white sheet and shoe polish from the car trunk. Using the polish, he writes on the sheet and secures it as a banner reading \"I ASSURE YOU, WE'RE OPEN\" before changing the store sign to OPEN at 6:20. With his morning routine complete, DANTE, now behind the counter, sits in a daze, head in hands, as a car passes by. He serves coffee to an ACTIVIST, who places a sickly lung model and a picture from his briefcase on the counter. As another CUSTOMER leaves, JAY and SILENT BOB enter; JAY engages in a mock dance, and SILENT BOB smokes and points off-screen. Amidst playful antics, a CROWD forms, chanting and throwing cigarettes at DANTE. VERONICA enters, observes the scene, and disperses the crowd with a fire extinguisher. She targets the ACTIVIST, who nervously offers a business card before being doused again. As the CROWD retreats, offering apologetic looks, VERONICA's dismay grows. DANTE struggles to recover as the last person exits and VERONICA attempts to snap him out of it by slapping him."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "The car trunk pops open in the quiet morning, still tinged with the chill of dawn, and a hand reaches inside, pulling out a folded white sheet that seems hastily taken from a linen closet. A can of shoe polish, which was commonly used by street protestors for makeshift signage due to its stark contrast and bold visibility, is grabbed from the dusty shelf. DANTE dips his fingers into the shoe polish and writes large letters on the unfurled sheet, leaning on the old picnic cooler that’s been in the store since its opening decade ago. DANTE stands precariously on a garbage can, left from the weekly collection that missed pick up, and tucks a corner of the sheet under the faded blue awning. He jumps down with a slight thud on the asphalt. The banner reads I ASSURE YOU, WE'RE OPEN, a phrase that has become iconic in small businesses trying to attract a morning crowd. The door sign shifts from CLOSED to OPEN with a creak that has become part of the store's character. The clock, an old analog model permanently set ten minutes fast, reads 6:20. DANTE leans behind the counter, the morning routine completed as he wrestles with the monotony of another day. He stares ahead, catatonic, then drops his head in his hands, a gesture that reflects his daily struggle to find meaning. The store, with its makeshift banner looming in the dim morning hour, just after dawn, reflects his state of disarray. A car drives by, its tires crackling over the loose gravel. DANTE waits on a customer, an ACTIVIST who frequents the shop, buying coffee as he leans on a briefcase filled with pamphlets calling for change. The ACTIVIST leans on a briefcase and drinks his coffee. Another CUSTOMER, wearing a faded baseball cap emblematic of the local minor league team, leans in the door. The ACTIVIST lifts his briefcase onto the counter. He opens it and extracts a sickly-looking lung model, part of his engagement in an anti-smoking campaign. The ACTIVIST hands DANTE something from the briefcase. Hands him a picture, possibly of a rally he'd organized. The CUSTOMER exits, nodding slightly at DANTE. Another CUSTOMER comes up to the counter as the interaction continues. A blank wall, marked with years of wear, serves as a backdrop for the shifting events. JAY steps into the frame, followed by his stoic companion, SILENT BOB, known around town for their antics. JAY then throws down with a makeshift slam dance, spinning his arm and fake-hitting SILENT BOB, reminiscent of their street performances that often gather small crowds. JAY pulls off his coat and swings it into the arms of SILENT BOB, who stands unfazed. SILENT BOB lights a smoke, the flick of his lighter catching briefly in the dim light. SILENT BOB points to something off-screen, perhaps another regular who just walked past. SILENT BOB nods, a silent agreement to whatever plan JAY has concocted. JAY makes blow job faces down an imaginary line of guys, looking quite like a performing seal, drawing laughter from anyone watching. He throws a little humming sound behind each nod, adding to the absurdity. He then hops up quickly, restoring the energy. The small crowd begins to chant and jeer in DANTE's face, a minor rebellion against the mundane. VERONICA enters and surveys the mess with a look of disbelief. The CROWD throws cigarettes at DANTE, pelting him in the face with butts and ash, a move meant to provoke. Suddenly, a loud blast is heard, and white powder from the fire extinguisher explodes over the throng, creating an instant spectacle. Everyone turns to face VERONICA as she stands in one of the freezer cases, holding a fire extinguisher as if it were a weapon. The CROWD looks among themselves, confusion evident in their glances. Someone points to O.C., another bystander caught in the chaos. The ACTIVIST carries his briefcase surreptitiously toward the door, his mission apparently disrupted. VERONICA jumps off the freezer case, training the nozzle of the extinguisher on the ACTIVIST, making her stance clear. She pokes the extinguisher nozzle at him, warningly. He reaches into his briefcase, preparing for a different kind of confrontation. He pulls out a business card and hands it to her, identifying himself as part of a cause bigger than the morning commotion. She reads it, unmoved. He nods, acknowledging her read. He nods again, maybe as an apology or a plea. She blasts him with more chemical as he exits, making a statement of her own. He quickly flees, leaving behind a spray of extinguishing powder. The CROWD sheepishly exits, one by one, offering apologetic glances as the tension diffuses. VERONICA watches the crowd disperse, disgusted by the morning’s havoc. DANTE tries to regain his composure, picking himself up slowly. The last of the crowd exits, taking with them the echo of their disruption. DANTE is sitting on the floor, head in his folded arms, exhausted by the turmoil. She slaps him softly, more out of concern than anger, urging him to shake off the despondency."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "A can of shoe polish is grabbed from the shelf The car trunk pops open and a hand reaches inside pulling out a folded white sheet A can of shoe polish is grabbed from the shelf DANTE dips his fingers into the shoe polish and writes large letters on the unfurled sheet leaning on the cooler He then hops up quickly DANTE stands on a garbage can and tucks a corner of the sheet under the awning He jumps down The banner reads I ASSURE YOU WE ARE OPEN The door sign shifts from CLOSED to OPEN He throws a little humming sound behind each nod The clock reads 620 The ACTIVIST leans on a briefcase and drinks his coffee SILENT BOB lights a smoke The last of the crowd exits DANTE leans behind the counter JAY pulls off his coat and swings it into the arms of SILENT BOB the morning routine completed Everyone turns to face VERONICA as she stands in one of the freezer cases holding a fire extinguisher He stares ahead catatonic then drops his head in his hands The store with its makeshift banner looming in the dim morning hour just after dawn A car drives by DANTE waits on a customer ACTIVIST buying coffee The ACTIVIST leans on a briefcase and drinks his coffee Another CUSTOMER leans in the door He reaches into his briefcase The ACTIVIST lifts his briefcase onto the counter He opens it and extracts a sicklylooking lung model The ACTIVIST hands him something from the briefcase Hands him a picture The CUSTOMER exits Another CUSTOMER comes up to the counter A blank wall VERONICA enters and surveys the mess JAY steps into the frame followed by SILENT BOB JAY then throws down with a makeshift slam dance spinning his arm and fakehitting SILENT BOB He quickly flees She blasts him with more chemical as he exits JAY pulls off his coat and swings it into the arms of SILENT BOB SILENT BOB lights a smoke SILENT BOB points to something offscreen SILENT BOB nods JAY makes blow job faces down an imaginary line of guys looking quite like a performing seal He throws a little humming sound behind each nod He then hops up quickly The banner reads I ASSURE YOU WE ARE OPEN The small crowd begins to chant and jeer in DANTE's face VERONICA enters and surveys the mess The CROWD throws cigarettes at DANTE pelting him in the face A car drives by Suddenly a loud blast is heard and white powder explodes over the throng Suddenly a loud blast is heard and white powder explodes over the throng She reads it Everyone turns to face VERONICA as she stands in one of the freezer cases holding a fire extinguisher He jumps down The CROWD looks among themselves Someone points to OC DANTE dips his fingers into the shoe polish and writes large letters on the unfurled sheet The ACTIVIST carries his briefcase surreptitiously toward the door DANTE tries to regain his composure VERONICA jumps off the freezer case training the nozzle of the extinguisher on the ACTIVIST DANTE waits on a customer ACTIVIST buying coffee Someone points to OC She pokes the extinguisher nozzle at him warningly He reaches into his briefcase He pulls out a business card and hands it to her She reads it He nods He nods again He nods again She blasts him with more chemical as he exits He opens it and extracts a sicklylooking lung model The ACTIVIST lifts his briefcase onto the counter The store with its makeshift banner looming in the dim morning hour just after dawn The clock reads 620 He quickly flees The CROWD sheepishly exits one by one offering apologetic glances The ACTIVIST carries his briefcase surreptitiously toward the door VERONICA watches the crowd disperse disgusted DANTE tries to regain his composure The last of the crowd exits The door sign shifts from CLOSED to OPEN DANTE is sitting on the floor head in his folded arms She slaps him"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "The car trunk pops open and a hand reaches inside pulling out a folded white sheet. A can of shoe polish is grabbed from the shelf. DANTE dips his fingers into the shoe polish and writes large letters on the unfurled sheet. leaning on the cooler. DANTE stands on a garbage can and tucks a corner of the sheet under the awning. He jumps down. The banner reads I ASSURE YOU WE ARE OPEN. The door sign shifts from CLOSED to OPEN. The clock reads 620. DANTE leans behind the counter. the morning routine completed. He stares ahead catatonic then drops his head in his hands. The store with its makeshift banner looming in the dim morning hour just after dawn. A car drives by. DANTE waits on a customer ACTIVIST buying coffee. The ACTIVIST leans on a briefcase and drinks his coffee. Another CUSTOMER leans in the door. The ACTIVIST lifts his briefcase onto the counter. He opens it and extracts a sicklylooking lung model. The ACTIVIST hands him something from the briefcase. Hands him a picture. The CUSTOMER exits. Another CUSTOMER comes up to the counter. A blank wall. JAY steps into the frame followed by SILENT BOB. JAY then throws down with a makeshift slam dance spinning his arm and fakehitting SILENT BOB. JAY pulls off his coat and swings it into the arms of SILENT BOB. SILENT BOB lights a smoke. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. SILENT BOB points to something offscreen. SILENT BOB nods. JAY makes blow job faces down an imaginary line of guys looking quite like a performing seal. He throws a little humming sound behind each nod. He then hops up quickly. The small crowd begins to chant and jeer in DANTE's face. VERONICA enters and surveys the mess. The CROWD throws cigarettes at DANTE pelting him in the face. Suddenly a loud blast is heard and white powder explodes over the throng. Everyone turns to face VERONICA as she stands in one of the freezer cases holding a fire extinguisher. The CROWD looks among themselves. Someone points to OC. The ACTIVIST carries his briefcase surreptitiously toward the door. VERONICA jumps off the freezer case training the nozzle of the extinguisher on the ACTIVIST. She pokes the extinguisher nozzle at him warningly. He reaches into his briefcase. He pulls out a business card and hands it to her. She reads it. He nods. He nods again. She blasts him with more chemical as he exits. He quickly flees. The CROWD sheepishly exits one by one offering apologetic glances. VERONICA watches the crowd disperse disgusted. DANTE tries to regain his composure. The last of the crowd exits. DANTE is sitting on the floor head in his folded arms. She slaps him."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "The car trunk pops open and a hand reaches inside pulling out a folded white sheet. A can of shoe polish is grabbed from the shelf. DANTE dips his fingers into the shoe polish and writes large letters on the unfurled sheet. leaning on the cooler. DANTE stands on a garbage can and tucks a corner of the sheet under the awning. He jumps down. The banner reads I ASSURE YOU WE ARE OPEN. The door sign shifts from CLOSED to OPEN. The clock reads 620. DANTE leans behind the counter. the morning routine completed. He stares ahead catatonic then drops his head in his hands. The store with its makeshift banner looming in the dim morning hour just after dawn. A car drives by. DANTE waits on a customer ACTIVIST buying coffee. The ACTIVIST leans on a briefcase and drinks his coffee. Another CUSTOMER leans in the door. The ACTIVIST lifts his briefcase onto the counter. He opens it and extracts a sicklylooking lung model. The ACTIVIST hands him something from the briefcase. Hands him a picture. The CUSTOMER exits. Another CUSTOMER comes up to the counter. A blank wall. JAY steps into the frame followed by SILENT BOB. JAY then throws down with a makeshift slam dance spinning his arm and fakehitting SILENT BOB. JAY pulls off his coat and swings it into the arms of SILENT BOB. SILENT BOB lights a smoke. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. SILENT BOB points to something offscreen. SILENT BOB nods. JAY makes blow job faces down an imaginary line of guys looking quite like a performing seal. He throws a little humming sound behind each nod. He then hops up quickly. The small crowd begins to chant and jeer in DANTE's face. VERONICA enters and surveys the mess. The CROWD throws cigarettes at DANTE pelting him in the face. Suddenly a loud blast is heard and white powder explodes over the throng. Everyone turns to face VERONICA as she stands in one of the freezer cases holding a fire extinguisher. The CROWD looks among themselves. Someone points to OC. The ACTIVIST carries his briefcase surreptitiously toward the door. VERONICA jumps off the freezer case training the nozzle of the extinguisher on the ACTIVIST. She pokes the extinguisher nozzle at him warningly. He reaches into his briefcase. He pulls out a business card and hands it to her. She reads it. He nods. He nods again. She blasts him with more chemical as he exits. He quickly flees. The CROWD sheepishly exits one by one offering apologetic glances. VERONICA watches the crowd disperse disgusted. DANTE tries to regain his composure. The last of the crowd exits. DANTE is sitting on the floor head in his folded arms. She slaps him."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "The car trunk pops open and a hand reaches inside pulling out a folded white sheet. A can of shoe polish is grabbed from the shelf. DANTE dips his fingers into the shoe polish and writes large letters on the unfurled sheet. leaning on the cooler. DANTE stands on a garbage can and tucks a corner of the sheet under the awning. He jumps down. The banner reads I ASSURE YOU WE ARE OPEN. The door sign shifts from CLOSED to OPEN. The clock reads 620. DANTE leans behind the counter. the morning routine completed. He stares ahead catatonic then drops his head in his hands. The store with its makeshift banner looming in the dim morning hour just after dawn. A car drives by. She pokes the extinguisher nozzle at him warningly. He reaches into his briefcase. He pulls out a business card and hands it to her. She reads it. He nods. He nods again. She blasts him with more chemical as he exits. He quickly flees. The CROWD sheepishly exits one by one offering apologetic glances. VERONICA watches the crowd disperse disgusted. DANTE tries to regain his composure. The last of the crowd exits. DANTE is sitting on the floor head in his folded arms. She slaps him."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "The car trunk pops open and a hand reaches inside pulling out a folded white sheet. A can of shoe polish is grabbed from the shelf. DANTE dips his fingers into the shoe polish and writes large letters on the unfurled sheet. leaning on the cooler. DANTE stands on a garbage can and tucks a corner of the sheet under the awning. He jumps down. The CROWD sheepishly exits one by one offering apologetic glances. VERONICA watches the crowd disperse disgusted. DANTE tries to regain his composure. The last of the crowd exits. DANTE is sitting on the floor head in his folded arms. She slaps him."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The car trunk pops open and a hand reaches inside, pulling out a folded white sheet. A can of shoe polish is grabbed from the shelf. A cat dips its fingers into the shoe polish and writes large letters on the unfurled sheet, leaning on the cooler. A cat stands on a garbage can and tucks a corner of the sheet under the awning. It jumps down. The banner reads I ASSURE YOU, WE'RE OPEN. The door sign shifts from CLOSED to OPEN. The clock reads 6:20. A cat leans behind the counter, the morning routine completed. It stares ahead, catatonic, then drops its head in its hands. The store, with its makeshift banner looming in the dim morning hour, just after dawn. A car drives by. A cat waits on a customer (a painter) buying coffee. The painter leans on a briefcase and drinks his coffee. Another dog leans in the door. The painter lifts his briefcase onto the counter. He opens it and extracts a sickly-looking lung model. The painter hands it something from the briefcase. Hands it a picture. The dog exits. Another bird comes up to the counter. A blank wall. A giraffe steps into the frame, followed by an elephant. The giraffe then throws down with a makeshift slam dance, spinning its arm and fake-hitting the elephant. The giraffe pulls off its coat and swings it into the arms of the elephant. The elephant lights a smoke. The elephant points to something off-screen. The elephant nods. The giraffe makes blow job faces down an imaginary line of guys, looking quite like a performing seal. It throws a little humming sound behind each nod. It then hops up quickly. The small crowd begins to chant and jeer in a cat's face. An astronaut enters and surveys the mess. The crowd throws cigarettes at a cat, pelting it in the face. Suddenly, a loud blast is heard, and white powder explodes over the throng. Everyone turns to face an astronaut as she stands in one of the freezer cases, holding a fire extinguisher. The crowd looks among themselves. Someone points to O.C. The painter carries his briefcase surreptitiously toward the door. An astronaut jumps off the freezer case, training the nozzle of the extinguisher on the painter. She pokes the extinguisher nozzle at him, warningly. He reaches into his briefcase. He pulls out a business card and hands it to her. She reads it. He nods. He nods again. She blasts him with more chemical as he exits. He quickly flees. The crowd sheepishly exits, one by one, offering apologetic glances. An astronaut watches the crowd disperse, disgusted. A cat tries to regain its composure. The last of the crowd exits. A cat is sitting on the floor, head in its folded arms. She slaps it."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "The car trunk pops open and a hand reaches inside, pulling out a folded blue tarp. A can of paint thinner is grabbed from the toolbox. DANTE dips his fingers into the paint thinner and writes large letters on the unfurled tarp, leaning on the refrigerator. DANTE stands on a recycling bin and tucks a corner of the tarp under the flagpole. He jumps down. The banner reads I ASSURE YOU, WE'RE OPEN. The window sign shifts from CLOSED to OPEN. The clock reads 3:45. DANTE leans behind the register, the morning routine completed. He stares ahead, catatonic, then drops his head in his hands. The venue, with its makeshift banner looming in the dim morning hour, just after dawn. A bicycle rides by. DANTE waits on a customer (ACTIVIST) buying doughnuts. The ACTIVIST leans on a backpack and eats his doughnut. Another CUSTOMER leans in the doorway. The ACTIVIST lifts his backpack onto the counter. He opens it and extracts a sickly-looking plant model. The ACTIVIST hands him something from the backpack. Hands him a flyer. The CUSTOMER exits. Another CUSTOMER comes up to the counter. A blank chalkboard. JAY steps into the frame, followed by SILENT BOB. JAY then throws down with a makeshift slam dance, spinning his arm and fake-hitting SILENT BOB. JAY pulls off his sweater and swings it into the arms of SILENT BOB. SILENT BOB lights a match. SILENT BOB points to something off-screen. SILENT BOB nods. JAY makes blow job faces down an imaginary line of guys, looking quite like a performing acrobat. He throws a little buzzing sound behind each nod. He then hops up quickly. The small crowd begins to chant and jeer in DANTE's face. VERONICA enters and surveys the mess. The CROWD throws napkins at DANTE, pelting him in the face. Suddenly, a loud blast is heard, and white feathers explode over the throng. Everyone turns to face VERONICA as she stands in one of the display cases, holding a garden hose. The CROWD looks among themselves. Someone points to O.C. The ACTIVIST carries his backpack surreptitiously toward the door. VERONICA jumps off the display case, training the nozzle of the hose on the ACTIVIST. She pokes the hose nozzle at him, warningly. He reaches into his backpack. He pulls out a coupon and hands it to her. She reads it. He nods. He nods again. She blasts him with more water as he exits. He quickly flees. The CROWD sheepishly exits, one by one, offering apologetic glances. VERONICA watches the crowd disperse, disgusted. DANTE tries to regain his composure. The last of the crowd exits. DANTE is sitting on the floor, head in his folded arms. She slaps him."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "The car trunk slides open and a hand slips inside, extracting a folded white sheet. A can of shoe polish is swiped from the shelf. DANTE dabs his fingers into the shoe polish and sketches large letters on the unfurled sheet, reclining on the cooler. DANTE climbs onto a garbage can and drapes a corner of the sheet over the awning. He hops down. The banner declares I ASSURE YOU, WE'RE OPEN. The door sign flips from CLOSED to OPEN. The clock displays 6:20. DANTE crouches behind the counter, the morning routine concluded. He glances ahead, expressionless, then rests his head in his hands. The store, with its makeshift banner hanging in the dim morning light, just after dawn. A car rolls by. DANTE assists a customer (ACTIVIST) purchasing coffee. The ACTIVIST rests on a briefcase and sips his coffee. Another CUSTOMER peers in the door. The ACTIVIST places his briefcase onto the counter. He unlocks it and removes a sickly-looking lung model. The ACTIVIST presents him something from the briefcase. Hands him a picture. The CUSTOMER departs. Another CUSTOMER approaches the counter. A blank wall. JAY steps into view, followed by SILENT BOB. JAY then breaks into a makeshift slam dance, twirling his arm and playfully hitting SILENT BOB. JAY slips off his coat and tosses it into the arms of SILENT BOB. SILENT BOB ignites a smoke. SILENT BOB gestures to something off-screen. SILENT BOB nods. JAY mimics blowjob gestures down an imaginary line of guys, resembling a performing seal. He emits a little humming noise with each nod. He then jumps up swiftly. The small crowd begins to chant and tease DANTE's face. VERONICA enters and observes the chaos. The CROWD flings cigarettes at DANTE, striking him in the face. Suddenly, a loud blast is heard, and white powder erupts over the throng. Everyone turns to face VERONICA as she stands in one of the freezer cases, wielding a fire extinguisher. The CROWD glances among themselves. Someone gestures to O.C. The ACTIVIST hauls his briefcase stealthily toward the door. VERONICA leaps off the freezer case, aiming the nozzle of the extinguisher at the ACTIVIST. She jabs the extinguisher nozzle at him, cautioning. He delves into his briefcase. He retrieves a business card and hands it to her. She examines it. He nods. He nods again. She sprays him with more chemical as he retreats. He swiftly escapes. The CROWD timidly exits, one by one, casting apologetic looks. VERONICA watches the crowd disperse, dismayed. DANTE attempts to regain his composure. The last of the crowd leaves. DANTE is sitting on the floor, head in his folded arms. She prods him."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "The suitcase flap pops open and an elbow reaches inside, pulling out a crumpled yellow towel. A jar of peanut butter is grabbed from the closet. ALICE dips her toes into the peanut butter and writes large numbers on the unfurled towel, leaning on the microwave. ALICE stands on a flower pot and tucks a corner of the towel under the chandelier. She jumps down. The blanket reads I TRUST YOU, WE'RE READY. The window shade shifts from LOCKED to UNLOCKED. The calendar reads 9:45. ALICE leans behind the sofa, the evening schedule completed. She stares ahead, catatonic, then drops her head in her elbows. The cabin, with its makeshift blanket looming in the dim evening hour, just after dusk. A bike rolls by. ALICE waits on a traveler (CHEF) buying juice. The CHEF leans on a suitcase and drinks his juice. Another TOURIST leans in the window. The CHEF lifts his suitcase onto the sofa. He opens it and extracts a vibrant-looking liver model. The CHEF hands her something from the suitcase. Hands her a postcard. The TOURIST leaves. Another TOURIST comes up to the sofa. A decorated wall. SAM steps into the scene, followed by QUIET JACK. SAM then throws down with a makeshift slam dance, spinning his leg and fake-hitting QUIET JACK. SAM pulls off his hat and swings it into the hands of QUIET JACK. QUIET JACK lights a candle. QUIET JACK points to something off-screen. QUIET JACK nods. SAM makes silly faces down an imaginary row of robots, looking quite like a performing penguin. He throws a little beeping sound behind each nod. He then hops up quickly. The small gathering begins to chant and jeer in ALICE's face. RACHEL enters and surveys the chaos. The GATHERING throws gum wrappers at ALICE, pelting her in the hat. Suddenly, a loud pop is heard, and confetti explodes over the crowd. Everyone turns to face RACHEL as she stands in one of the oven racks, holding a water pistol. The GATHERING looks among themselves. Someone points to N.O. The CHEF carries his suitcase surreptitiously toward the window. RACHEL jumps off the oven rack, training the nozzle of the pistol on the CHEF. She pokes the water pistol nozzle at him, warningly. He reaches into his suitcase. He pulls out a lottery ticket and hands it to her. She reads it. He nods. He nods again. She blasts him with more water as he leaves. He quickly scurries. The GATHERING sheepishly leaves, one by one, offering apologetic nods. RACHEL watches the gathering disperse, disgusted. ALICE tries to regain her composure. The last of the gathering leaves. ALICE is sitting on the carpet, head in her crumpled elbows. She kicks her."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "The airplane door swings open and a claw stretches inside, retrieving a crumpled blue tarp. A jar of peanut butter is selected from the cabinet. LUCY plunges her hand into the peanut butter and sketches tiny symbols on the stretched tarp while leaning against the bench. LUCY climbs onto a table and secures a flap of the tarp under the pergola. She slides down. The poster says I PROMISE YOU, WE'RE FUNCTIONING. The window sign turns from LOCKED to UNLOCKED. The clock displays 7:45. LUCY lounges behind the register, the afternoon tasks concluded. She gazes forward, dazed, then rests her forehead on her knees. The market, with its impromptu poster hanging in the dim afternoon light, just before dusk. A bicycle rolls past. LUCY assists a patron (PHILOSOPHER) purchasing tea. The PHILOSOPHER lounges on a suitcase and sips his tea. Another VISITOR peeks in the window. The PHILOSOPHER heaves his suitcase onto the register. He unfastens it and withdraws a grim-looking anatomical heart model. The PHILOSOPHER offers her something from the suitcase. Offers her a brochure. The VISITOR departs. Another VISITOR approaches the register. An empty parking lot. MAX enters the scene, trailed by QUIET SAM. MAX then launches into an impromptu tap dance, twirling his leg and pretend-kicking QUIET SAM. MAX removes his jacket and tosses it into the embrace of QUIET SAM. QUIET SAM ignites a candle. QUIET SAM gestures towards something unseen. QUIET SAM acknowledges. MAX makes mocking expressions down an imaginary line of spectators, appearing much like a jesting monkey. He adds a faint whistling sound with each glance. He then leaps up promptly. The small assembly starts to chant and scoff in LUCY's direction. MARISSA arrives and assesses the situation. The ASSEMBLY hurls wrappers at LUCY, hitting her on the shoulder. Suddenly, a piercing noise is heard, and confetti bursts over the mass. Everyone turns to look at MARISSA as she stands inside a display case, handling a leaf blower. The ASSEMBLY glances amongst themselves. Somebody gestures to off-camera. The PHILOSOPHER stealthily maneuvers his suitcase towards the exit. MARISSA descends from the display case, aiming the leaf blower at the PHILOSOPHER. She prods the blower nozzle at him, threateningly. He digs into his suitcase. He pulls out a folded map and gives it to her. She examines it. He acknowledges. He acknowledges again. She sprays him with more air as he leaves. He hastily retreats. The ASSEMBLY quietly departs, one by one, casting regretful looks. MARISSA observes the assembly disperse, annoyed. LUCY attempts to regain her composure. The last of the assembly vanishes. LUCY is crouched on the floor, face buried in her crossed arms. She shakes him."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "The car trunk swings open and a hand dives inside, extracting a crumpled yellow tarp. A jar of paint is snatched from the cupboard. DANTE dips his fingers into the paint and sketches small symbols on the flattened tarp, leaning on the vending machine. DANTE climbs onto a recycling bin and tucks an edge of the tarp under the balcony. He leaps down. The tarp displays I ASSUME YOU, WE'RE NOT CLOSED. The window blinds shift from OPENED to SHUT. The clock displays 7:45. DANTE stretches behind the counter, the evening routine finished. He gazes ahead, dazed, then buries his head in his knees. The shop, with its temporary tarp looming in the dim evening hour, just before dusk. A bicycle rolls by. DANTE assists a customer (ACTIVIST) buying tea. The ACTIVIST leans on a backpack and sips his tea. Another SHOPPER peers in the window. The ACTIVIST places his backpack onto the counter. He opens it and retrieves a vibrant-looking heart model. The ACTIVIST hands him something from the backpack. Hands him a map. The SHOPPER departs. Another PATRON approaches the counter. A decorated wall. JAY enters the scene, followed by SILENT BOB. JAY then performs with a makeshift breakdance, waving his leg and mock-kicking SILENT BOB. JAY shrugs off his hat and tosses it into the hands of SILENT BOB. SILENT BOB ignites a candle. SILENT BOB gestures to something unseen. SILENT BOB agrees. JAY makes balloon animal faces down an imaginary crowd of people, looking quite like a juggling act. He emits a soft whistling tune with each nod. He then springs up suddenly. The small audience begins to chant and boo in DANTE's face. VERONICA arrives and takes in the chaos. The AUDIENCE tosses paper balls at DANTE, striking him on the chin. Suddenly, a loud clang is heard, and red confetti bursts over the mass. Everyone turns to face VERONICA as she stands in one of the display cases, wielding a party popper. The AUDIENCE glances around at one another. Someone gestures to O.C. The ACTIVIST carries his backpack discreetly toward the exit. VERONICA leaps off the display case, aiming the popper at the ACTIVIST. She jabs the popper nozzle at him, cautioningly. He reaches into his backpack. He pulls out a flyer and hands it to her. She scans it. He agrees. He agrees again. She showers him with more confetti as he departs. He swiftly retreats. The AUDIENCE bashfully leaves, one by one, offering sheepish looks. VERONICA observes the audience disperse, irked. DANTE attempts to collect himself. The last of the audience departs. DANTE is crouching on the ground, face in his cradled arms. She nudges him."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "The suitcase lid flips open and a paw delves inside, extracting a crumpled blue tarp. A jar of honey is snatched from the cabinet. MILES sinks his toes into the honey and draws tiny symbols on the crumpled tarp, leaning on the bicycle. MILES perches on a park bench and drapes a corner of the tarp over the fountain. He somersaults down. The placard reads WE PROMISE, WE'RE HERE. The window shade switches from LOCKED to UNLOCKED. The sundial shows 9:45. MILES reclines behind the lemonade stand, the evening routine concluded. He gazes forward, entranced, then rests his chin on his knees. The park, with its haphazard placard hanging in the bright afternoon light, just before dusk. A skateboard zooms past. MILES assists a visitor (TRAVELER) purchasing lemonade. The TRAVELER reclines on a hammock and sips his lemonade. Another GUEST peeks in the window. The TRAVELER hoists his hammock onto the stand. He unfolds it and reveals a worn-out hat. The TRAVELER offers him something from the hammock. Gives him a postcard. The GUEST departs. Another GUEST approaches the stand. A blank sidewalk. LEO barges into the picture, trailed by QUIET RICK. LEO then launches into an impromptu breakdance, swinging his leg and pretend-kicking QUIET RICK. LEO shrugs off his jacket and flings it into the arms of QUIET RICK. QUIET RICK ignites a sparkler. QUIET RICK gestures to something off-camera. QUIET RICK nods. LEO mimics trumpet sounds along an invisible lineup of musicians, resembling a juggling clown. He emits a soft whistle with every nod. He then springs up suddenly. The small assembly begins to chant and mock in MILES's direction. ALEX strolls in and assesses the chaos. The ASSEMBLY hurls biscuits at MILES, striking him in the chest. Abruptly, a loud crash resounds, and purple glitter showers over the multitude. Everyone spins to look at ALEX as she perches on one of the merry-go-rounds, aiming a water gun. The ASSEMBLY glances among themselves. Someone signals to O.C. The TRAVELER lugs his hammock stealthily toward the window. ALEX leaps down from the merry-go-round, aiming the water gun at the TRAVELER. She nudges the water gun at him, warningly. He dips into his hammock. He extracts a souvenir and hands it to her. She examines it. He smiles. He smiles again. She drenches him with more water as he scampers away. He rapidly dashes out. The ASSEMBLY bashfully departs, one by one, offering regretful looks. ALEX observes the assembly scatter, unimpressed. MILES attempts to gather his wits. The last of the assembly leaves. MILES lounges on the grass, face in his closed paws. She nudges him."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "The trunk of a car opens, revealing a hand grabbing a white sheet and a can of shoe polish. DANTE uses the polish to write a message on the sheet, which reads \"I ASSURE YOU, WE'RE OPEN.\" After completing his morning routine, he sits catatonically behind the counter at 6:20 AM. An ACTIVIST with a briefcase buys coffee and shows DANTE a lung model and a picture. JAY and SILENT BOB appear, engaging in antics that attract a small crowd, which starts chanting at DANTE. VERONICA enters, observing the chaos, and uses a fire extinguisher to disperse the crowd after it turns rowdy. She confronts the ACTIVIST, who hands her a business card before she blasts him with the extinguisher, causing him to flee. The crowd exits apologetically, leaving VERONICA disgusted while DANTE sits dejectedly on the floor. She tries to snap him out of it by slapping him."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "She slaps him DANTE is sitting on the floor head in his folded arms The last of the crowd exits DANTE tries to regain his composure VERONICA watches the crowd disperse disgusted The CROWD sheepishly exits one by one offering apologetic glances He quickly flees She blasts him with more chemical as he exits He nods again He nods She reads it He pulls out a business card and hands it to her He reaches into his briefcase She pokes the extinguisher nozzle at him warningly VERONICA jumps off the freezer case training the nozzle of the extinguisher on the ACTIVIST The ACTIVIST carries his briefcase surreptitiously toward the door Someone points to OC The CROWD looks among themselves Everyone turns to face VERONICA as she stands in one of the freezer cases holding a fire extinguisher Suddenly a loud blast is heard and white powder explodes over the throng The CROWD throws cigarettes at DANTE pelting him in the face VERONICA enters and surveys the mess The small crowd begins to chant and jeer in DANTE's face He then hops up quickly He throws a little humming sound behind each nod JAY makes blow job faces down an imaginary line of guys looking quite like a performing seal SILENT BOB nods SILENT BOB points to something offscreen SILENT BOB lights a smoke JAY pulls off his coat and swings it into the arms of SILENT BOB JAY then throws down with a makeshift slam dance spinning his arm and fakehitting SILENT BOB JAY steps into the frame followed by SILENT BOB A blank wall Another CUSTOMER comes up to the counter The CUSTOMER exits Hands him a picture The ACTIVIST hands him something from the briefcase He opens it and extracts a sicklylooking lung model The ACTIVIST lifts his briefcase onto the counter Another CUSTOMER leans in the door The ACTIVIST leans on a briefcase and drinks his coffee DANTE waits on a customer ACTIVIST buying coffee A car drives by The store with its makeshift banner looming in the dim morning hour just after dawn He stares ahead catatonic then drops his head in his hands the morning routine completed DANTE leans behind the counter The clock reads 620 The door sign shifts from CLOSED to OPEN The banner reads I ASSURE YOU WE ARE OPEN He jumps down DANTE stands on a garbage can and tucks a corner of the sheet under the awning leaning on the cooler DANTE dips his fingers into the shoe polish and writes large letters on the unfurled sheet A can of shoe polish is grabbed from the shelf The car trunk pops open and a hand reaches inside pulling out a folded white sheet"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "JAY makes blow job faces down an imaginary line of guys looking quite like a performing seal A blank wall The CROWD sheepishly exits one by one offering apologetic glances He stares ahead catatonic then drops his head in his hands Another CUSTOMER leans in the door Hands him a picture VERONICA watches the crowd disperse disgusted DANTE is sitting on the floor head in his folded arms The CROWD throws cigarettes at DANTE pelting him in the face The ACTIVIST hands him something from the briefcase DANTE leans behind the counter The small crowd begins to chant and jeer in DANTE's face VERONICA jumps off the freezer case training the nozzle of the extinguisher on the ACTIVIST He pulls out a business card and hands it to her SILENT BOB nods She slaps him leaning on the cooler The CUSTOMER exits He nods DANTE stands on a garbage can and tucks a corner of the sheet under the awning SILENT BOB points to something offscreen the morning routine completed She pokes the extinguisher nozzle at him warningly Another CUSTOMER comes up to the counter The CROWD looks among themselves JAY steps into the frame followed by SILENT BOB The car trunk pops open and a hand reaches inside pulling out a folded white sheet JAY then throws down with a makeshift slam dance spinning his arm and fakehitting SILENT BOB She blasts him with more chemical as he exits He opens it and extracts a sicklylooking lung model He throws a little humming sound behind each nod Suddenly a loud blast is heard and white powder explodes over the throng JAY pulls off his coat and swings it into the arms of SILENT BOB The store with its makeshift banner looming in the dim morning hour just after dawn Someone points to OC He then hops up quickly He quickly flees A car drives by She reads it The last of the crowd exits DANTE dips his fingers into the shoe polish and writes large letters on the unfurled sheet SILENT BOB lights a smoke Everyone turns to face VERONICA as she stands in one of the freezer cases holding a fire extinguisher He jumps down VERONICA enters and surveys the mess He reaches into his briefcase The banner reads I ASSURE YOU WE ARE OPEN DANTE tries to regain his composure The clock reads 620 DANTE waits on a customer ACTIVIST buying coffee The ACTIVIST leans on a briefcase and drinks his coffee The ACTIVIST lifts his briefcase onto the counter He nods again A can of shoe polish is grabbed from the shelf The door sign shifts from CLOSED to OPEN The ACTIVIST carries his briefcase surreptitiously toward the door"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "SILENT BOB points to something offscreen SILENT BOB nods JAY makes blow job faces down an imaginary line of guys looking quite like a performing seal He throws a little humming sound behind each nod He then hops up quickly The small crowd begins to chant and jeer in DANTE's face VERONICA enters and surveys the mess The CROWD throws cigarettes at DANTE pelting him in the face Suddenly a loud blast is heard and white powder explodes over the throng Everyone turns to face VERONICA as she stands in one of the freezer cases holding a fire extinguisher The CROWD looks among themselves Someone points to OC The ACTIVIST carries his briefcase surreptitiously toward the door VERONICA jumps off the freezer case training the nozzle of the extinguisher on the ACTIVIST She pokes the extinguisher nozzle at him warningly He reaches into his briefcase He pulls out a business card and hands it to her She reads it He nods He nods again She blasts him with more chemical as he exits He quickly flees The CROWD sheepishly exits one by one offering apologetic glances VERONICA watches the crowd disperse disgusted DANTE tries to regain his composure The last of the crowd exits DANTE is sitting on the floor head in his folded arms She slaps him The car trunk pops open and a hand reaches inside pulling out a folded white sheet A can of shoe polish is grabbed from the shelf DANTE dips his fingers into the shoe polish and writes large letters on the unfurled sheet leaning on the cooler DANTE stands on a garbage can and tucks a corner of the sheet under the awning He jumps down The banner reads I ASSURE YOU WE ARE OPEN The door sign shifts from CLOSED to OPEN The clock reads 620 DANTE leans behind the counter the morning routine completed He stares ahead catatonic then drops his head in his hands The store with its makeshift banner looming in the dim morning hour just after dawn A car drives by DANTE waits on a customer ACTIVIST buying coffee The ACTIVIST leans on a briefcase and drinks his coffee Another CUSTOMER leans in the door The ACTIVIST lifts his briefcase onto the counter He opens it and extracts a sicklylooking lung model The ACTIVIST hands him something from the briefcase Hands him a picture The CUSTOMER exits Another CUSTOMER comes up to the counter A blank wall JAY steps into the frame followed by SILENT BOB JAY then throws down with a makeshift slam dance spinning his arm and fakehitting SILENT BOB JAY pulls off his coat and swings it into the arms of SILENT BOB SILENT BOB lights a smoke"
        }
      ]
    }
  ]
}