{
  "ground_truth": "Peter is at a bank where Aunt May kicks the bank clerk and holds up a newspaper cutting, studying it, while the bank clerk smiles, stands, and limps away. On the other side of the banking hall, Octavius, wearing a long coat and a triveil, is standing in front of the steel vault door and tosses it across the hall, leaving Aunt May's mouth hanging open as Peter runs off around the corner. Octavius uses his mechanical limbs to bypass the guards, with one pincer bending around to take off his hat, then starts picking up bulging sacks of money from the vault and stuffing them into yellow bags. One of the pincers detects something, prompting Octavius to glance around as Spider-Man flies in. Octavius throws bags at Spider-Man, who swings up to the ceiling, catching a bag in a web and hitting Octavius, who spins around and tosses more. Spider-Man lands on a wall without his web, and a bag of coins hits him. A gold coin rolls over to the bank clerk, who is about to pocket it when Aunt May smacks him. Octavius' metal limbs pick Spider-Man up, with the other two pincers grabbing his head and starting to squeeze; Spider-Man fires a web and raises his arms at the desk and display case, causing the limbs to smash the desk. The display case hits Octavius and propels him out of the bank onto a yellow cab, where he gets to his feet and the limbs approach Spider-Man, hurling him back into the bank. Two police cars screech to a halt, and one of the mechanical limbs grabs Aunt May as cover. Octavius lumbers off with Aunt May. Inside an office, a girl on the phone lays down the receiver and crosses to the window as a limb pokes through the wall, with Octavius hammering up the outside of the office building, three limbs doing the work, the fourth holding Aunt May. Spider-Man appears above him, and high up the building, Octavius drops Aunt May, but a web from Spider-Man catches her, and she springs back up. Below her, Octavius crashes Spider-Man against the building, but Spider-Man still has a battle on his hands. He punches free of Octavius and scoots up the building, only to be grabbed by one of the mechanical limbs. Aunt May sees Spider-Man hauled down by Octavius, and the two men trade blows and spring off the building, falling towards the ground with one of the limbs securing a hold.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Peter is at a depository where Aunt May kicks the cashier and holds up a periodical clipping, scrutinizing it, while the cashier grins, stands, and hobbles away. On the opposite side of the financial hall, Octavius, wearing a lengthy coat and a trilby, is standing in front of the metal vault door and flings it across the room, leaving Aunt May's mouth hanging open as Peter dashes off around the corner. Octavius uses his robotic appendages to bypass the guards, with one claw bending around to remove his hat, then starts collecting bulging sacks of currency from the vault and stuffing them into yellow bags. One of the claws detects something, prompting Octavius to glance around as Spider-Man swoops in. Octavius hurls bags at Spider-Man, who swings up to the ceiling, catching a bag in a web and striking Octavius, who spins around and throws more. Spider-Man lands on a wall without his web, and a bag of coins strikes him. A gold piece rolls over to the cashier, who is about to pocket it when Aunt May hits him. Octavius' metal appendages pick Spider-Man up, with the other two claws grabbing his head and starting to constrict; Spider-Man fires a web and raises his arms at the desk and exhibit case, causing the appendages to smash the desk. The exhibit case strikes Octavius and propels him out of the bank onto a yellow taxi, where he gets to his feet and the limbs approach Spider-Man, hurling him back into the bank. Two police cars screech to a stop, and one of the robotic appendages grabs Aunt May as cover. Octavius lumbers off with Aunt May. Inside an office, a girl on the phone lays down the handset and crosses to the window as a limb pokes through the wall, with Octavius climbing up the exterior of the office building, three limbs doing the work, the fourth holding Aunt May. Spider-Man appears above him, and high up the building, Octavius drops Aunt May, but a web from Spider-Man catches her, and she bounces back up. Below her, Octavius crashes Spider-Man against the building, but Spider-Man still has a fight on his hands. He punches free of Octavius and scoots up the building, only to be seized by one of the robotic appendages. Aunt May sees Spider-Man hauled down by Octavius, and the two men exchange blows and spring off the building, falling toward the ground with one of the limbs securing a grasp."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Peter is at a bank where the bank clerk is kicked by Aunt May, and a newspaper cutting is held up by her as it is studied, while a smile is given by the bank clerk, who stands and limps away. On the other side of the banking hall, Octavius, wearing a long coat and a triveil, is standing in front of the steel vault door, which is tossed across the hall by him, leaving Aunt May's mouth hanging open as a run around the corner is made by Peter. The guards are bypassed by Octavius using his mechanical limbs, with his hat being taken off by one pincer that bends around, then bulging sacks of money are picked up from the vault and stuffed into yellow bags by him. Something is detected by one of the pincers, prompting a glance around by Octavius as Spider-Man flies in. Bags are thrown at Spider-Man by Octavius, who swings up to the ceiling, and a bag is caught in a web and hits Octavius, who spins around and more are tossed. Spider-Man lands on a wall without his web, and he is hit by a bag of coins. A gold coin rolls over to the bank clerk, who is about to pocket it when he is smacked by Aunt May. Spider-Man is picked up by Octavius' metal limbs, with his head being grabbed and squeezed by the other two pincers; Spider-Man fires a web and raises his arms at the desk and display case, causing the limbs to smash the desk. Octavius is hit by the display case and is propelled out of the bank onto a yellow cab, where he gets to his feet and Spider-Man is approached by the limbs, hurling him back into the bank. Two police cars come to a screeching halt, and one of the mechanical limbs uses Aunt May as cover when it grabs her. Aunt May is lumbered off with by Octavius. Inside an office, the phone is laid down by a girl, and she crosses to the window as a limb pokes through the wall, with Octavius hammering up the outside of the office building, three limbs doing the work, the fourth holding Aunt May. Spider-Man appears above him, and high up the building, Aunt May is dropped by Octavius, but she is caught by a web from Spider-Man, and she springs back up. Below her, Spider-Man is crashed against the building by Octavius, but Spider-Man still has a battle on his hands. He punches free of Octavius and scoots up the building, only to grab one of the mechanical limbs. Spider-Man is seen by Aunt May being hauled down by Octavius, and blows are traded and the two men spring off the building, falling towards the ground with a hold being secured by one of the limbs."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Peter is at a bank where Aunt May kicks the clerk, holds up a newspaper cutting, and the clerk smiles, stands, and limps away. Across the hall, Octavius, in a long coat and triveil, stands before the vault door, tossing it aside, leaving Aunt May shocked as Peter runs off. Octavius uses his mechanical limbs to bypass guards, removes his hat, and fills yellow bags with money. A pincer detects something, prompting Octavius to look around as Spider-Man arrives. Octavius throws bags at Spider-Man, who swings to the ceiling, catching a bag in a web and hitting Octavius, who retaliates. Spider-Man lands on a wall, and a bag of coins hits him. A gold coin rolls to the clerk, who is about to pocket it when Aunt May smacks him. Octavius' limbs grab Spider-Man, squeezing his head; Spider-Man fires a web, causing the limbs to smash a desk. The display case hits Octavius, propelling him onto a cab, where he stands and hurls Spider-Man back into the bank. Police cars arrive, and a limb grabs Aunt May as cover. Octavius escapes with Aunt May. In an office, a girl sees Octavius climbing the building with Aunt May. Spider-Man appears above, and Octavius drops Aunt May, but Spider-Man's web catches her. Octavius crashes Spider-Man against the building, but Spider-Man fights back, punches free, and climbs, only to be grabbed again. Aunt May sees Spider-Man and Octavius trading blows, falling towards the ground with a limb securing a hold."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Peter is at a bank where Aunt May kicks the clerk, holds a newspaper cutting, and the clerk limps away smiling. Across the hall, Octavius, in a long coat and triveil, throws the vault door, shocking Aunt May as Peter runs off. Octavius uses his mechanical limbs to bypass guards, removes his hat, and stuffs money into yellow bags. A pincer detects Spider-Man's arrival. Octavius throws bags at Spider-Man, who swings up, catches a bag, and hits Octavius. Spider-Man lands on a wall, hit by a bag of coins. A coin rolls to the clerk, but Aunt May stops him from pocketing it. Octavius grabs Spider-Man, who fires a web, smashing the desk. The display case hits Octavius, propelling him onto a cab. Police arrive, and Octavius grabs Aunt May as cover, escaping with her. In an office, a girl sees Octavius climbing outside, holding Aunt May. Spider-Man appears, and Octavius drops Aunt May, but Spider-Man's web catches her. Octavius crashes Spider-Man against the building, but Spider-Man fights back, only to be grabbed again. Aunt May watches as Spider-Man and Octavius trade blows, falling with a limb securing them."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Peter finds himself inside a bustling bank, where his Aunt May is making quite a scene. She kicks the bank clerk and holds up a newspaper cutting, scrutinizing it intently. Meanwhile, the bank clerk, despite the unexpected kick, manages to smile, stands up, and limps away from the encounter. Across the expansive banking hall, Octavius, clad in a long coat and a triveil, positions himself in front of the imposing steel vault door. With a powerful motion, he hurls the door across the hall, leaving Aunt May utterly astonished, her mouth agape, as Peter quickly dashes around the corner.\n\nOctavius, utilizing his formidable mechanical limbs, skillfully bypasses the guards. One of his pincers deftly bends around to remove his hat, and he begins to gather bulging sacks of money from the vault, stuffing them into conspicuous yellow bags. Suddenly, one of the pincers detects something, prompting Octavius to glance around cautiously just as Spider-Man makes a dramatic entrance. Octavius retaliates by throwing bags at Spider-Man, who agilely swings up to the ceiling, catching one of the bags in a web and using it to strike Octavius. In response, Octavius spins around and hurls more bags. Spider-Man lands on a nearby wall, momentarily without his web, and a bag of coins strikes him. A single gold coin rolls over to the bank clerk, who is on the verge of pocketing it when Aunt May intervenes with a swift smack.\n\nOctavius' metallic limbs seize Spider-Man, with two of the pincers gripping his head and beginning to apply pressure. In a quick maneuver, Spider-Man fires a web and raises his arms towards the desk and display case, causing the limbs to smash the desk. The display case crashes into Octavius, propelling him out of the bank and onto a yellow cab. Regaining his footing, Octavius' limbs advance towards Spider-Man, hurling him back into the bank. Outside, two police cars screech to a halt, and one of the mechanical limbs grabs Aunt May, using her as a shield. Octavius lumbers away with Aunt May in tow.\n\nInside a nearby office, a girl on the phone sets down the receiver and moves to the window, just as a limb pokes through the wall. Octavius is seen hammering up the exterior of the office building, three limbs doing the heavy lifting while the fourth securely holds Aunt May. Spider-Man appears above him, and high up on the building, Octavius releases Aunt May, but a well-timed web from Spider-Man catches her, and she springs back up safely. Below her, Octavius crashes Spider-Man against the building, but the resilient Spider-Man still has a fight on his hands. He manages to punch free of Octavius' grip and quickly ascends the building, only to be seized once more by one of the mechanical limbs. Aunt May watches as Spider-Man is hauled down by Octavius, and the two adversaries exchange blows, springing off the building and plummeting towards the ground, with one of the limbs maintaining a secure hold."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Peter finds himself standing amidst the hustle and bustle of a busy bank, where his Aunt May is causing quite a commotion. She unexpectedly kicks the bank clerk and holds up a newspaper cutting, scrutinizing it with intense focus and determination. Meanwhile, the bank clerk, despite being taken aback by the surprising kick, manages to maintain a polite smile. He slowly stands up, visibly shaken, and begins to limp away from the encounter, attempting to maintain his composure. Across the expansive and grand banking hall, Octavius, wearing a long coat and a triveil, positions himself directly in front of the imposing and fortified steel vault door. With a powerful and forceful motion, he hurls the door across the hall, leaving Aunt May utterly astonished, her mouth hanging open in disbelief, as Peter quickly dashes around the nearby corner.\n\nOctavius, utilizing his formidable and mechanical limbs with remarkable precision, skillfully bypasses the guards. One of his pincers deftly bends around to remove his hat, and he begins to gather the bulging sacks of money from the vault, stuffing them into conspicuous and eye-catching yellow bags. Suddenly, the sensors in one of the pincers detect something, prompting Octavius to glance around cautiously. This occurs just as Spider-Man makes a dramatic and timely entrance. In retaliation, Octavius throws bags at Spider-Man, who skillfully swings up to the ceiling, catching one of the bags in his web and using it to strike Octavius. In response, Octavius spins around and hurls even more bags. Spider-Man lands deftly on a nearby wall, albeit momentarily without his web, and a bag of coins strikes him. A single gold coin rolls over to where the bank clerk stands, and just as he is on the verge of pocketing it, Aunt May intervenes with a swift smack.\n\nOctavius' metallic limbs seize Spider-Man, with two of the pincers gripping his head and beginning to apply menacing pressure. In a quick and daring maneuver, Spider-Man fires a web and raises his arms towards the desk and display case, causing the metallic limbs to smash the desk. The display case crashes forcefully into Octavius, propelling him out of the bank with great force and onto a yellow cab. Regaining his footing, Octavius' intimidating limbs advance towards Spider-Man, hurling him back into the bank. Meanwhile, outside, two police cars screech to a halt, and one of the mechanical limbs grabs Aunt May, using her as a human shield. Octavius lumbers away, taking Aunt May with him.\n\nInside a nearby office, a girl on the phone sets down the receiver and moves to the window, curiosity piqued, just as a limb pokes through the wall. Octavius is seen hammering his way up the exterior of the office building, with three limbs doing the heavy lifting while the fourth securely holds Aunt May. In a daring move, Spider-Man appears above him, and high up on the building, Octavius releases Aunt May, but a well-timed web from Spider-Man catches her, allowing her to spring back up safely. Below her, Octavius crashes Spider-Man against the building, but the resilient Spider-Man still has a fight on his hands. He manages to punch free of Octavius' grip and quickly ascends the building, only to be seized once more by one of the menacing mechanical limbs. Aunt May watches anxiously as Spider-Man is hauled down by Octavius, and the two adversaries exchange fierce blows, springing off the building and plummeting towards the ground, with one of the limbs maintaining a secure hold throughout the descent."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Peter finds himself inside a bustling bank, where Aunt May suddenly kicks the bank clerk, causing him to stumble slightly. She then holds up a newspaper cutting, scrutinizing it intently, while the bank clerk, despite the unexpected kick, manages to smile, stands up, and limps away from the scene. Meanwhile, across the banking hall, Octavius, clad in a long coat and a triveil, positions himself in front of the imposing steel vault door. With a swift and powerful motion, he hurls the door across the hall, leaving Aunt May in shock, her mouth agape, as Peter quickly dashes around the corner. Octavius, utilizing his mechanical limbs with precision, effortlessly bypasses the guards. One of his pincers deftly bends around to remove his hat, and he begins to gather the bulging sacks of money from the vault, stuffing them into yellow bags with practiced efficiency. Suddenly, one of the pincers detects something, prompting Octavius to glance around cautiously just as Spider-Man makes a dramatic entrance. In response, Octavius hurls bags at Spider-Man, who skillfully swings up to the ceiling, catching one of the bags in a web and using it to strike Octavius. Octavius spins around, retaliating by tossing more bags. Spider-Man lands on a wall, momentarily without his web, and a bag of coins strikes him, causing a gold coin to roll over to the bank clerk, who is tempted to pocket it until Aunt May intervenes with a swift smack. Octavius' formidable metal limbs seize Spider-Man, with two pincers gripping his head and beginning to squeeze. In a quick-thinking maneuver, Spider-Man fires a web and raises his arms towards the desk and display case, causing the limbs to smash the desk. The impact sends the display case hurtling into Octavius, propelling him out of the bank and onto a yellow cab. Octavius regains his footing, and his limbs advance towards Spider-Man, hurling him back into the bank. Outside, two police cars screech to a halt, and one of Octavius' mechanical limbs grabs Aunt May, using her as a shield. Octavius then lumbers away with Aunt May in tow. Inside an office, a girl on the phone sets down the receiver and moves to the window, just as a limb pokes through the wall. Octavius is seen hammering up the side of the office building, three limbs doing the climbing while the fourth securely holds Aunt May. Spider-Man appears above Octavius, and high up the building, Octavius releases Aunt May, but Spider-Man's web catches her, springing her back up to safety. Below, Octavius crashes Spider-Man against the building, yet Spider-Man remains undeterred, still engaged in the battle. He manages to punch free from Octavius' grip and quickly ascends the building, only to be seized once more by one of the mechanical limbs. Aunt May watches as Spider-Man is hauled down by Octavius, and the two adversaries exchange blows, eventually springing off the building and plummeting towards the ground, with one of the limbs maintaining a secure hold."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Peter is at a bank where Aunt May confronts the bank clerk, kicking him and holding up a newspaper cutting. The clerk smiles, stands, and limps away. Meanwhile, Octavius, in a long coat and triveil, stands before the steel vault door, which he hurls across the hall, shocking Aunt May as Peter runs off. Octavius uses his mechanical limbs to bypass the guards, removes his hat, and begins filling yellow bags with money from the vault. As one pincer detects something, Octavius looks around just as Spider-Man arrives. Octavius throws bags at Spider-Man, who swings to the ceiling, catches a bag in a web, and hits Octavius. Spider-Man lands on a wall, but a bag of coins hits him, and a gold coin rolls to the bank clerk, who is stopped by Aunt May from pocketing it. Octavius' limbs grab Spider-Man, squeezing his head, but Spider-Man fires a web, causing the limbs to smash a desk. The display case hits Octavius, propelling him out of the bank onto a yellow cab. He gets up, and the limbs hurl Spider-Man back into the bank. As police cars arrive, Octavius grabs Aunt May as a shield and escapes. In an office, a girl sees Octavius climbing the building with Aunt May. Spider-Man appears above, and when Octavius drops Aunt May, Spider-Man's web catches her. Octavius crashes Spider-Man against the building, but Spider-Man fights back, punches free, and climbs, only to be grabbed again. Aunt May watches as Spider-Man is pulled down, and the two men continue their battle, springing off the building and falling with one limb securing a hold."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Peter is at a bank which is a typical financial institution in downtown New York City where Aunt May, known for her fierce protectiveness, kicks the bank clerk and holds up a newspaper cutting, perhaps an article detailing recent bank heists, studying it, while the bank clerk, accustomed to unusual customers, smiles, stands, and limps away. On the other side of the banking hall, Octavius, notorious in the city for his criminal activities, wearing a long coat and a triveil—a rare style of hat from a bygone era—stands in front of the steel vault door and tosses it across the hall, demonstrating his incredible strength, leaving Aunt May's mouth hanging open as Peter, secretly Spider-Man, runs off around the corner. Octavius uses his mechanical limbs, which are a result of a failed scientific experiment, to bypass the guards, with one pincer bending around to take off his hat, then starts picking up bulging sacks of money from the vault—valued at several million dollars—and stuffing them into yellow bags, the color indicating their use for large cash deposits. One of the pincers detects something, prompting Octavius to glance around as Spider-Man, swinging through the city using his web-slinging ability, flies in. Octavius throws bags at Spider-Man, who swings up to the ceiling, catching a bag in a web and hitting Octavius, who spins around and tosses more. Spider-Man lands on a wall, using his enhanced agility without his web, and a bag of coins hits him, scattering currency across the floor. A gold coin rolls over to the bank clerk, who is about to pocket it when Aunt May smacks him, defending the bank’s assets. Octavius' metal limbs, designed for complex tasks in hostile environments, pick Spider-Man up, with the other two pincers grabbing his head and starting to squeeze; Spider-Man, with his quick reflexes, fires a web and raises his arms at the desk and display case, causing the limbs to smash the desk. The display case, containing valuable securities, hits Octavius and propels him out of the bank onto a yellow cab, a signature of New York’s bustling streets, where he gets to his feet and the limbs approach Spider-Man, hurling him back into the bank. Two police cars, part of the NYPD’s rapid response unit, screech to a halt, and one of the mechanical limbs grabs Aunt May as cover. Octavius lumbers off with Aunt May, using her as leverage. Inside an office in a nearby building, a girl on the phone lays down the receiver and crosses to the window as a limb pokes through the wall, with Octavius hammering up the outside of the office building, three limbs doing the work, the fourth holding Aunt May. Spider-Man appears above him, and high up the building, Octavius drops Aunt May, but a web from Spider-Man catches her, showcasing his precise web-slinging skills, and she springs back up. Below her, Octavius crashes Spider-Man against the building, but Spider-Man still has a battle on his hands. He punches free of Octavius and scoots up the building, only to be grabbed by one of the mechanical limbs, which are extensions of Octavius' neurological system. Aunt May sees Spider-Man hauled down by Octavius, and the two men trade blows and spring off the building, falling toward the ground with one of the limbs securing a hold, creating a tense scene witnessed by pedestrians below."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "On the other side of the banking hall Octavius wearing a long coat and a triveil is standing in front of the steel vault door and tosses it across the hall leaving Aunt May's mouth hanging open as Peter runs off around the corner  Octavius uses his mechanical limbs to bypass the guards with one pincer bending around to take off his hat then starts picking up bulging sacks of money from the vault and stuffing them into yellow bags  One of the pincers detects something prompting Octavius to glance around as SpiderMan flies in  Octavius throws bags at SpiderMan who swings up to the ceiling catching a bag in a web and hitting Octavius who spins around and tosses more  SpiderMan lands on a wall without his web and a bag of coins hits him  A gold coin rolls over to the bank clerk who is about to pocket it when Aunt May smacks him  Octavius' metal limbs pick SpiderMan up with the other two pincers grabbing his head and starting to squeeze  SpiderMan fires a web and raises his arms at the desk and display case causing the limbs to smash the desk  The display case hits Octavius and propels him out of the bank onto a yellow cab where he gets to his feet and the limbs approach SpiderMan hurling him back into the bank  Two police cars screech to a halt and one of the mechanical limbs grabs Aunt May as cover  Peter is at a bank where Aunt May kicks the bank clerk and holds up a newspaper cutting studying it while the bank clerk smiles stands and limps away  On the other side of the banking hall Octavius wearing a long coat and a triveil is standing in front of the steel vault door and tosses it across the hall leaving Aunt May's mouth hanging open as Peter runs off around the corner  Octavius uses his mechanical limbs to bypass the guards with one pincer bending around to take off his hat then starts picking up bulging sacks of money from the vault and stuffing them into yellow bags  One of the pincers detects something prompting Octavius to glance around as SpiderMan flies in  Octavius throws bags at SpiderMan who swings up to the ceiling catching a bag in a web and hitting Octavius who spins around and tosses more  SpiderMan lands on a wall without his web and a bag of coins hits him  A gold coin rolls over to the bank clerk who is about to pocket it when Aunt May smacks him  Octavius' metal limbs pick SpiderMan up with the other two pincers grabbing his head and starting to squeeze  SpiderMan fires a web and raises his arms at the desk and display case causing the limbs to smash the desk  The display case hits Octavius and propels him out of the bank onto a yellow cab where he gets to his feet and the limbs approach SpiderMan hurling him back into the bank  Two police cars screech to a halt and one of the mechanical limbs grabs Aunt May as cover  Octavius lumbers off with Aunt May  Inside an office a girl on the phone lays down the receiver and crosses to the window as a limb pokes through the wall with Octavius hammering up the outside of the office building  three limbs doing the work the fourth holding Aunt May  SpiderMan appears above him and high up the building  Octavius drops Aunt May but a web from SpiderMan catches her and she springs back up  Below her Octavius crashes SpiderMan against the building but SpiderMan still has a battle on his hands  He punches free of Octavius and scoots up the building only to be grabbed by one of the mechanical limbs  Aunt May sees SpiderMan hauled down by Octavius and the two men trade blows and spring off the building falling towards the ground with one of the limbs securing a hold"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Peter is at a bank where Aunt May kicks the bank clerk and holds up a newspaper cutting studying it while the bank clerk smiles stands and limps away. On the other side of the banking hall Octavius wearing a long coat and a triveil is standing in front of the steel vault door and tosses it across the hall leaving Aunt May's mouth hanging open as Peter runs off around the corner. Octavius uses his mechanical limbs to bypass the guards with one pincer bending around to take off his hat then starts picking up bulging sacks of money from the vault and stuffing them into yellow bags. One of the pincers detects something prompting Octavius to glance around as SpiderMan flies in. Octavius throws bags at SpiderMan who swings up to the ceiling catching a bag in a web and hitting Octavius who spins around and tosses more. SpiderMan lands on a wall without his web and a bag of coins hits him. A gold coin rolls over to the bank clerk who is about to pocket it when Aunt May smacks him. Octavius' metal limbs pick SpiderMan up with the other two pincers grabbing his head and starting to squeeze. SpiderMan fires a web and raises his arms at the desk and display case causing the limbs to smash the desk. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. The display case hits Octavius and propels him out of the bank onto a yellow cab where he gets to his feet and the limbs approach SpiderMan hurling him back into the bank. Two police cars screech to a halt and one of the mechanical limbs grabs Aunt May as cover. Octavius lumbers off with Aunt May. Inside an office a girl on the phone lays down the receiver and crosses to the window as a limb pokes through the wall with Octavius hammering up the outside of the office building. three limbs doing the work the fourth holding Aunt May. SpiderMan appears above him and high up the building. Octavius drops Aunt May but a web from SpiderMan catches her and she springs back up. Below her Octavius crashes SpiderMan against the building but SpiderMan still has a battle on his hands. He punches free of Octavius and scoots up the building only to be grabbed by one of the mechanical limbs. Aunt May sees SpiderMan hauled down by Octavius and the two men trade blows and spring off the building falling towards the ground with one of the limbs securing a hold."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Peter is at a bank where Aunt May kicks the bank clerk and holds up a newspaper cutting studying it while the bank clerk smiles stands and limps away. On the other side of the banking hall Octavius wearing a long coat and a triveil is standing in front of the steel vault door and tosses it across the hall leaving Aunt May's mouth hanging open as Peter runs off around the corner. Octavius uses his mechanical limbs to bypass the guards with one pincer bending around to take off his hat then starts picking up bulging sacks of money from the vault and stuffing them into yellow bags. One of the pincers detects something prompting Octavius to glance around as SpiderMan flies in. Octavius throws bags at SpiderMan who swings up to the ceiling catching a bag in a web and hitting Octavius who spins around and tosses more. SpiderMan lands on a wall without his web and a bag of coins hits him. A gold coin rolls over to the bank clerk who is about to pocket it when Aunt May smacks him. Octavius' metal limbs pick SpiderMan up with the other two pincers grabbing his head and starting to squeeze. SpiderMan fires a web and raises his arms at the desk and display case causing the limbs to smash the desk. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. The display case hits Octavius and propels him out of the bank onto a yellow cab where he gets to his feet and the limbs approach SpiderMan hurling him back into the bank. Two police cars screech to a halt and one of the mechanical limbs grabs Aunt May as cover. Octavius lumbers off with Aunt May. Inside an office a girl on the phone lays down the receiver and crosses to the window as a limb pokes through the wall with Octavius hammering up the outside of the office building. three limbs doing the work the fourth holding Aunt May. SpiderMan appears above him and high up the building. Octavius drops Aunt May but a web from SpiderMan catches her and she springs back up. Below her Octavius crashes SpiderMan against the building but SpiderMan still has a battle on his hands. He punches free of Octavius and scoots up the building only to be grabbed by one of the mechanical limbs. Aunt May sees SpiderMan hauled down by Octavius and the two men trade blows and spring off the building falling towards the ground with one of the limbs securing a hold."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Peter is at a bank where Aunt May kicks the bank clerk and holds up a newspaper cutting studying it while the bank clerk smiles stands and limps away. On the other side of the banking hall Octavius wearing a long coat and a triveil is standing in front of the steel vault door and tosses it across the hall leaving Aunt May's mouth hanging open as Peter runs off around the corner. Octavius uses his mechanical limbs to bypass the guards with one pincer bending around to take off his hat then starts picking up bulging sacks of money from the vault and stuffing them into yellow bags. One of the pincers detects something prompting Octavius to glance around as SpiderMan flies in. Octavius throws bags at SpiderMan who swings up to the ceiling catching a bag in a web and hitting Octavius who spins around and tosses more. SpiderMan appears above him and high up the building. Octavius drops Aunt May but a web from SpiderMan catches her and she springs back up. Below her Octavius crashes SpiderMan against the building but SpiderMan still has a battle on his hands. He punches free of Octavius and scoots up the building only to be grabbed by one of the mechanical limbs. Aunt May sees SpiderMan hauled down by Octavius and the two men trade blows and spring off the building falling towards the ground with one of the limbs securing a hold."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Peter is at a bank where Aunt May kicks the bank clerk and holds up a newspaper cutting studying it while the bank clerk smiles stands and limps away. On the other side of the banking hall Octavius wearing a long coat and a triveil is standing in front of the steel vault door and tosses it across the hall leaving Aunt May's mouth hanging open as Peter runs off around the corner. He punches free of Octavius and scoots up the building only to be grabbed by one of the mechanical limbs. Aunt May sees SpiderMan hauled down by Octavius and the two men trade blows and spring off the building falling towards the ground with one of the limbs securing a hold."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Sam is at a bank where a giraffe kicks the bank clerk and holds up a newspaper cutting, studying it, while the bank clerk smiles, stands, and limps away. On the other side of the banking hall, a penguin, wearing a long coat and a triveil, is standing in front of the steel vault door and tosses it across the hall, leaving the giraffe's mouth hanging open as Sam runs off around the corner. The penguin uses its mechanical limbs to bypass the guards, with one pincer bending around to take off its hat, then starts picking up bulging sacks of money from the vault and stuffing them into yellow bags. One of the pincers detects something, prompting the penguin to glance around as Spider-Man flies in. The penguin throws bags at Spider-Man, who swings up to the ceiling, catching a bag in a web and hitting the penguin, who spins around and tosses more. Spider-Man lands on a wall without his web, and a bag of coins hits him. A gold coin rolls over to the bank clerk, who is about to pocket it when the giraffe smacks him. The penguin's metal limbs pick Spider-Man up, with the other two pincers grabbing his head and starting to squeeze; Spider-Man fires a web and raises his arms at the desk and display case, causing the limbs to smash the desk. The display case hits the penguin and propels it out of the bank onto a yellow cab, where it gets to its feet and the limbs approach Spider-Man, hurling him back into the bank. Two police cars screech to a halt, and one of the mechanical limbs grabs the giraffe as cover. The penguin lumbers off with the giraffe. Inside an office, a dolphin on the phone lays down the receiver and crosses to the window as a limb pokes through the wall, with the penguin hammering up the outside of the office building, three limbs doing the work, the fourth holding the giraffe. Spider-Man appears above it, and high up the building, the penguin drops the giraffe, but a web from Spider-Man catches her, and she springs back up. Below her, the penguin crashes Spider-Man against the building, but Spider-Man still has a battle on his hands. He punches free of the penguin and scoots up the building, only to be grabbed by one of the mechanical limbs. The giraffe sees Spider-Man hauled down by the penguin, and the two men trade blows and spring off the building, falling towards the ground with one of the limbs securing a hold."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Peter is at a library where Aunt May kicks the librarian and holds up a menu, studying it, while the librarian smiles, stands, and limps away. On the other side of the reading room, Octavius, wearing a long scarf and a fez, is standing in front of the wooden file cabinet door and tosses it across the room, leaving Aunt May's mouth hanging open as Peter runs off around the corner. Octavius uses his mechanical limbs to bypass the researchers, with one pincer bending around to take off his hat, then starts picking up bulging folders of papers from the cabinet and stuffing them into orange totes. One of the pincers detects something, prompting Octavius to glance around as Spider-Man flies in. Octavius throws totes at Spider-Man, who swings up to the ceiling, catching a tote in a web and hitting Octavius, who spins around and tosses more. Spider-Man lands on a wall without his web, and a folder of papers hits him. A sheet of paper slides over to the librarian, who is about to pocket it when Aunt May smacks him. Octavius' metal limbs pick Spider-Man up, with the other two pincers grabbing his head and starting to squeeze; Spider-Man fires a web and raises his arms at the bookshelf and plant stand, causing the limbs to smash the bookshelf. The plant stand hits Octavius and propels him out of the library onto a red bicycle, where he gets to his feet and the limbs approach Spider-Man, hurling him back into the library. Two ice cream trucks screech to a halt, and one of the mechanical limbs grabs Aunt May as cover. Octavius lumbers off with Aunt May. Inside a cafe, a girl on the phone lays down the receiver and crosses to the window as a limb pokes through the wall, with Octavius hammering up the outside of the cafe building, three limbs doing the work, the fourth holding Aunt May. Spider-Man appears above him, and high up the building, Octavius drops Aunt May, but a web from Spider-Man catches her, and she springs back up. Below her, Octavius crashes Spider-Man against the building, but Spider-Man still has a battle on his hands. He punches free of Octavius and scoots up the building, only to be grabbed by one of the mechanical limbs. Aunt May sees Spider-Man hauled down by Octavius, and the two men trade blows and spring off the building, falling towards the ground with one of the limbs securing a hold."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Peter is at a bank where Aunt May shoves the bank clerk and unfolds a newspaper cutting, scrutinizing it, while the bank clerk chuckles, kneels, and hobbles away. On the other side of the banking hall, Octavius, wearing a long coat and a triveil, is standing in front of the steel vault door and flips it across the hall, leaving Aunt May's mouth agape as Peter slips off around the corner. Octavius utilizes his mechanical limbs to sidestep the guards, with one pincer wrapping around to pluck off his hat, then begins gathering bulging sacks of money from the vault and cramming them into yellow bags. One of the pincers senses something, prompting Octavius to peer around as Spider-Man glides in. Octavius lobs bags at Spider-Man, who swings up to the ceiling, capturing a bag in a web and striking Octavius, who twirls around and hurls more. Spider-Man perches on a wall without his web, and a bag of coins smacks him. A gold coin rolls over to the bank clerk, who is about to snatch it when Aunt May cuffs him. Octavius' metal limbs lift Spider-Man up, with the other two pincers clasping his head and beginning to compress; Spider-Man shoots a web and raises his arms at the desk and display case, causing the limbs to crush the desk. The display case collides with Octavius and thrusts him out of the bank onto a yellow cab, where he stands up and the limbs reach for Spider-Man, catapulting him back into the bank. Two police cars squeal to a halt, and one of the mechanical limbs seizes Aunt May as shelter. Octavius stomps off with Aunt May. Inside an office, a girl on the phone sets down the receiver and strides to the window as a limb jabs through the wall, with Octavius clambering up the outside of the office building, three limbs doing the work, the fourth holding Aunt May. Spider-Man appears above him, and high up the building, Octavius lets go of Aunt May, but a web from Spider-Man catches her, and she bounces back up. Below her, Octavius slams Spider-Man against the building, but Spider-Man still has a challenge on his hands. He breaks free of Octavius and dashes up the building, only to be seized by one of the mechanical limbs. Aunt May witnesses Spider-Man hauled down by Octavius, and the two men exchange blows and leap off the building, plummeting towards the ground with one of the limbs anchoring a hold."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Daniel is at a grocery store where Uncle Fred kicks the cash register and holds up a comic book, studying it, while the cash register smiles, stands, and limps away. On the other side of the grocery aisle, Marvin, wearing a raincoat and a baseball cap, is standing in front of the refrigerator door and tosses it across the aisle, leaving Uncle Fred's mouth hanging open as Daniel runs off around the corner. Marvin uses his mechanical legs to bypass the cashiers, with one claw bending around to take off his scarf, then starts picking up bulging sacks of potatoes from the refrigerator and stuffing them into blue baskets. One of the claws detects something, prompting Marvin to glance around as Batman flies in. Marvin throws baskets at Batman, who swings up to the ceiling, catching a basket in a net and hitting Marvin, who spins around and tosses more. Batman lands on a shelf without his net, and a basket of apples hits him. A green apple rolls over to the cash register, who is about to pocket it when Uncle Fred smacks him. Marvin's metal legs pick Batman up, with the other two claws grabbing his neck and starting to squeeze; Batman fires a net and raises his arms at the door and display rack, causing the legs to smash the door. The display rack hits Marvin and propels him out of the grocery store onto a red car, where he gets to his feet and the legs approach Batman, hurling him back into the grocery store. Two fire trucks screech to a halt, and one of the mechanical legs grabs Uncle Fred as cover. Marvin lumbers off with Uncle Fred. Inside a library, a boy on the tablet lays down the stylus and crosses to the window as a leg pokes through the wall, with Marvin hammering up the outside of the library, three legs doing the work, the fourth holding Uncle Fred. Batman appears above him, and high up the library, Marvin drops Uncle Fred, but a net from Batman catches him, and he springs back up. Below him, Marvin crashes Batman against the library, but Batman still has a battle on his hands. He kicks free of Marvin and scoots up the library, only to be grabbed by one of the mechanical legs. Uncle Fred sees Batman hauled down by Marvin, and the two men trade punches and spring off the library, falling towards the river with one of the legs securing a hold."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Jeremy is at a library where Uncle Joe nudges the librarian and flashes an old map, examining it, while the librarian grins, sits, and waddles away. On the opposite end of the reading room, Carl, wearing a trench coat and a beanie, is positioned in front of the revolving door and hurls it across the room, leaving Uncle Joe's eyes wide in disbelief as Jeremy dashes around the bookshelf. Carl uses his robotic arms to evade the patrons, with one claw reaching up to adjust his beanie, then begins gathering scattered scrolls from the desk and stuffing them into red bags. One of the claws senses something, prompting Carl to peer around as Bat-Man glides in. Carl hurls scrolls at Bat-Man, who flips up to the ceiling, snatching a scroll in a web and striking Carl, who spins and flings more. Bat-Man clings to a wall without his web, and a scroll of parchment smacks him. A rolled parchment slides over to the librarian, who is about to stow it away when Uncle Joe taps him. Carl's metal arms grasp Bat-Man, with the other two claws gripping his shoulders and beginning to crush; Bat-Man shoots a web and lifts his arms at the shelf and showcase, causing the arms to smash the shelf. The showcase topples onto Carl and catapults him out of the library onto a red wagon, where he rises and the arms advance towards Bat-Man, sending him tumbling back into the library. Two fire trucks screech to a halt, and one of the robotic arms snatches Uncle Joe as protection. Carl trudges off with Uncle Joe. Inside a boardroom, a boy with a laptop sets it aside and walks to the window as an arm pokes through the glass, with Carl clambering up the facade of the office tower, three arms doing the climbing, the fourth clutching Uncle Joe. Bat-Man materializes above him, and high up the tower, Carl releases Uncle Joe, but a web from Bat-Man ensnares him, and he bounces back. Below him, Carl smashes Bat-Man against the building, but Bat-Man still has a duel underway. He kicks free of Carl and scampers up the building, only to be seized by one of the robotic arms. Uncle Joe watches Bat-Man pulled down by Carl, and the two figures exchange jabs and leap from the building, plummeting towards the pavement with one of the arms maintaining a grip."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Peter is at a library where Aunt May juggles the librarian and holds up a recipe book, analyzing it, while the librarian chuckles, stretches, and tiptoes away. On the other side of the reading room, Octavius, wearing a short jacket and a beret, is standing in front of the stained-glass window and flips it across the room, leaving Aunt May's mouth wide open as Peter skips off around the corner. Octavius uses his mechanical arms to charm the patrons, with one claw twisting around to remove his scarf, then starts gathering overflowing baskets of letters from the window and cramming them into green suitcases. One of the claws senses something, prompting Octavius to peer around as Spider-Man glides in. Octavius flings suitcases at Spider-Man, who slides up to the ceiling, catching a suitcase in a net and nudging Octavius, who twirls around and hurls more. Spider-Man lands on a shelf without his net, and a suitcase of noodles hits him. An ancient coin rolls over to the librarian, who is about to stash it when Aunt May flicks him. Octavius' metal arms lift Spider-Man up, with the other two claws grabbing his shoulders and starting to twist; Spider-Man projects a net and lowers his feet at the chair and bookcase, causing the arms to shatter the chair. The bookcase strikes Octavius and catapults him out of the library onto a green bus, where he stands up and the arms reach for Spider-Man, catapulting him back into the library. Two motorcycles skid to a stop, and one of the mechanical arms grabs Aunt May as a shield. Octavius waddles off with Aunt May. Inside a living room, a girl on the tablet places down the pillow and moves to the door as an arm taps through the roof, with Octavius drilling up the side of the apartment building, three arms doing the lifting, the fourth holding Aunt May. Spider-Man materializes above him, and high up the structure, Octavius releases Aunt May, but a net from Spider-Man ensnares her, and she bounces back up. Below her, Octavius slams Spider-Man against the structure, but Spider-Man still has a struggle to manage. He kicks loose of Octavius and zips up the building, only to be clutched by one of the mechanical arms. Aunt May observes Spider-Man being dragged down by Octavius, and the two men exchange kicks and leap off the building, descending toward the ground with one of the arms maintaining a grip."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Jordan is at a zoo where Grandma Sue nudges the zookeeper and waves a kite, examining it, while the zookeeper laughs, hops, and waddles away. On the other side of the aviary, Gregory, wearing a short cape and a beret, is standing in front of the wooden cage gate and flings it across the aviary, leaving Grandma Sue's eyes wide open as Jordan skips around the rock. Gregory uses his robotic tentacles to avoid the tourists, with one claw twirling around to adjust his glasses, then starts grabbing overflowing buckets of seeds from the cage and dumping them into purple baskets. One of the tentacles senses something, prompting Gregory to peer around as Owlman swoops in. Gregory hurls baskets at Owlman, who flips up to the rafters, snaring a basket in a lasso and striking Gregory, who twirls around and flings more. Owlman lands on a ledge without his lasso, and a basket of nuts hits him. A walnut rolls over to the zookeeper, who is about to munch it when Grandma Sue nudges him. Gregory's metallic tentacles lift Owlman up, with the other two claws clasping his helmet and beginning to crush; Owlman shoots a lasso and waves his arms at the bench and birdcage, causing the tentacles to shatter the bench. The birdcage strikes Gregory and catapults him out of the zoo onto a red trolley, where he rises and the tentacles swarm Owlman, flinging him back into the zoo. Two fire trucks squeal to a halt, and one of the robotic tentacles snatches Grandma Sue as a shield. Gregory stomps away with Grandma Sue. Inside a greenhouse, a boy on the tablet sets down the gadget and darts to the pane as a tentacle pokes through the wall, with Gregory scaling the outside of the conservatory, three tentacles doing the climbing, the fourth clutching Grandma Sue. Owlman appears above him, and high up the structure, Gregory releases Grandma Sue, but a lasso from Owlman catches her, and she bounces back up. Below her, Gregory slams Owlman against the conservatory, but Owlman still has a contest on his hands. He kicks free of Gregory and scrambles up the conservatory, only to be seized by one of the metallic tentacles. Grandma Sue watches Owlman pulled down by Gregory, and the two figures trade punches and leap off the conservatory, plummeting towards the pavement with one of the tentacles maintaining a grip."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Peter is at a bank where Aunt May confronts a clerk with a newspaper cutting. Meanwhile, Octavius, in a long coat, effortlessly removes a steel vault door, shocking Aunt May as Peter runs away. Octavius uses his mechanical limbs to bypass guards, steals money from the vault, and encounters Spider-Man. A fight ensues, with Octavius throwing bags at Spider-Man, who retaliates but is hit by a bag of coins. A bank clerk almost pockets a coin before Aunt May intervenes. Octavius grabs Spider-Man with his limbs, but Spider-Man uses webs to fight back, causing Octavius to crash out of the bank. Octavius, using Aunt May as a shield, escapes as police arrive. Octavius scales an office building with May, but Spider-Man ensues, saving May with a web when Octavius drops her. Spider-Man battles Octavius atop the building, eventually breaking free, only to be grabbed again, leading to a fall towards the ground."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Aunt May sees SpiderMan hauled down by Octavius and the two men trade blows and spring off the building falling towards the ground with one of the limbs securing a hold He punches free of Octavius and scoots up the building only to be grabbed by one of the mechanical limbs  Below her Octavius crashes SpiderMan against the building but SpiderMan still has a battle on his hands  Octavius drops Aunt May but a web from SpiderMan catches her and she springs back up  SpiderMan appears above him and high up the building  three limbs doing the work the fourth holding Aunt May  Inside an office a girl on the phone lays down the receiver and crosses to the window as a limb pokes through the wall with Octavius hammering up the outside of the office building  Octavius lumbers off with Aunt May  Two police cars screech to a halt and one of the mechanical limbs grabs Aunt May as cover  The display case hits Octavius and propels him out of the bank onto a yellow cab where he gets to his feet and the limbs approach SpiderMan hurling him back into the bank  SpiderMan fires a web and raises his arms at the desk and display case causing the limbs to smash the desk  Octavius' metal limbs pick SpiderMan up with the other two pincers grabbing his head and starting to squeeze  A gold coin rolls over to the bank clerk who is about to pocket it when Aunt May smacks him  SpiderMan lands on a wall without his web and a bag of coins hits him  Octavius throws bags at SpiderMan who swings up to the ceiling catching a bag in a web and hitting Octavius who spins around and tosses more  One of the pincers detects something prompting Octavius to glance around as SpiderMan flies in  Octavius uses his mechanical limbs to bypass the guards with one pincer bending around to take off his hat then starts picking up bulging sacks of money from the vault and stuffing them into yellow bags  On the other side of the banking hall Octavius wearing a long coat and a triveil is standing in front of the steel vault door and tosses it across the hall leaving Aunt May's mouth hanging open as Peter runs off around the corner  Peter is at a bank where Aunt May kicks the bank clerk and holds up a newspaper cutting studying it while the bank clerk smiles stands and limps away "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Octavius lumbers off with Aunt May  SpiderMan appears above him and high up the building  Two police cars screech to a halt and one of the mechanical limbs grabs Aunt May as cover  SpiderMan fires a web and raises his arms at the desk and display case causing the limbs to smash the desk  Octavius drops Aunt May but a web from SpiderMan catches her and she springs back up  On the other side of the banking hall Octavius wearing a long coat and a triveil is standing in front of the steel vault door and tosses it across the hall leaving Aunt May's mouth hanging open as Peter runs off around the corner  Inside an office a girl on the phone lays down the receiver and crosses to the window as a limb pokes through the wall with Octavius hammering up the outside of the office building  SpiderMan lands on a wall without his web and a bag of coins hits him  Below her Octavius crashes SpiderMan against the building but SpiderMan still has a battle on his hands  Octavius uses his mechanical limbs to bypass the guards with one pincer bending around to take off his hat then starts picking up bulging sacks of money from the vault and stuffing them into yellow bags  Aunt May sees SpiderMan hauled down by Octavius and the two men trade blows and spring off the building falling towards the ground with one of the limbs securing a hold Octavius throws bags at SpiderMan who swings up to the ceiling catching a bag in a web and hitting Octavius who spins around and tosses more  The display case hits Octavius and propels him out of the bank onto a yellow cab where he gets to his feet and the limbs approach SpiderMan hurling him back into the bank  Octavius' metal limbs pick SpiderMan up with the other two pincers grabbing his head and starting to squeeze  One of the pincers detects something prompting Octavius to glance around as SpiderMan flies in  three limbs doing the work the fourth holding Aunt May  A gold coin rolls over to the bank clerk who is about to pocket it when Aunt May smacks him  He punches free of Octavius and scoots up the building only to be grabbed by one of the mechanical limbs  Peter is at a bank where Aunt May kicks the bank clerk and holds up a newspaper cutting studying it while the bank clerk smiles stands and limps away "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Two police cars screech to a halt and one of the mechanical limbs grabs Aunt May as cover  Octavius lumbers off with Aunt May  Inside an office a girl on the phone lays down the receiver and crosses to the window as a limb pokes through the wall with Octavius hammering up the outside of the office building  three limbs doing the work the fourth holding Aunt May  SpiderMan appears above him and high up the building  Octavius drops Aunt May but a web from SpiderMan catches her and she springs back up  Below her Octavius crashes SpiderMan against the building but SpiderMan still has a battle on his hands  He punches free of Octavius and scoots up the building only to be grabbed by one of the mechanical limbs  Aunt May sees SpiderMan hauled down by Octavius and the two men trade blows and spring off the building falling towards the ground with one of the limbs securing a hold Peter is at a bank where Aunt May kicks the bank clerk and holds up a newspaper cutting studying it while the bank clerk smiles stands and limps away  On the other side of the banking hall Octavius wearing a long coat and a triveil is standing in front of the steel vault door and tosses it across the hall leaving Aunt May's mouth hanging open as Peter runs off around the corner  Octavius uses his mechanical limbs to bypass the guards with one pincer bending around to take off his hat then starts picking up bulging sacks of money from the vault and stuffing them into yellow bags  One of the pincers detects something prompting Octavius to glance around as SpiderMan flies in  Octavius throws bags at SpiderMan who swings up to the ceiling catching a bag in a web and hitting Octavius who spins around and tosses more  SpiderMan lands on a wall without his web and a bag of coins hits him  A gold coin rolls over to the bank clerk who is about to pocket it when Aunt May smacks him  Octavius' metal limbs pick SpiderMan up with the other two pincers grabbing his head and starting to squeeze  SpiderMan fires a web and raises his arms at the desk and display case causing the limbs to smash the desk  The display case hits Octavius and propels him out of the bank onto a yellow cab where he gets to his feet and the limbs approach SpiderMan hurling him back into the bank "
        }
      ]
    }
  ]
}