{
  "ground_truth": "Spider-Man and Octavius crash through an office window, and Spider-Man pummels Octavius' face. Octavius' limbs grab Spider-Man's head and toss him about, causing both men to fall out of the window. The material of Aunt May's brolly starts to tear, and she slips down on it as Octavius tosses Spider-Man across the street into a window in the block opposite. Aunt May slips further down the brolly, but her feet land on a ledge. She looks way down to the ground, then up at the face of the statue whose outstretched arms she's hooked her brolly around, before she's lifted off the ledge. Spider-Man sticks two webs to the window frames and stretches them back like a catapult. As he launches himself through the air, a pincer on one of Octavius' limbs becomes a pointed spear. Octavius stretches out the spear-like limb towards Spider-Man, but Aunt May smacks Octavius on the head with her brolly. Spider-Man grabs the limb, and Octavius releases Aunt May. Spider-Man dives to her rescue, catches her, and they swoop and swing down the street. The police fire at Octavius, who, with bags of money in one pincer, disappears around the corner of the building. Spider-Man lands with Aunt May, cocks his head, then leaps up on a web. Girls flock to Aunt May, while firing webs as he goes, Spider-Man sweeps through the skies from building to building across New York City. The planetarium with its suspended glass curtain wall stands 95 feet high, and inside it is a sphere constructed of fabricated aluminum panels. Peter is in the crowded planetarium and reaches for food as someone grabs the last canope from a waitress's tray. A couple walks by, and he raises his camera, realizing the lens cap is still on and removes it, but by which time, the couple has walked away. Harry's poured a drink, snatching the bottle and knocking over his glass as Peter walks up to him. The two old friends stare defiantly at each other as the Mayor glares. All heads turn to look at the stairway down into the planetarium where Captain Jameson is in uniform, accompanied by a young lady walking beside him arm-in-arm. Everyone applauds, except Peter, who sees the young lady is MJ in a black strapless dress, her hair tied up. MJ stares at Peter and turns her head away as he gazes, mesmerized. Later, Peter makes his way out onto the balcony, where a server has a tray with one canope on it. He reaches for it as someone else whisks it away. Peter sees MJ alone, pauses, then walks up behind her. MJ turns to face him, and Peter gulps, his eyes filling up. He watches forlornly as MJ strides away from him, and a waitress passes by as Peter grabs a cocktail glass.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Spider-Man and Octavius smash through an office pane, and Spider-Man batters Octavius' visage. Octavius' appendages seize Spider-Man's cranium and hurl him about, causing both men to plunge out of the pane. The fabric of Aunt May's umbrella begins to rip, and she slides down on it as Octavius hurls Spider-Man across the road into a pane in the structure opposite. Aunt May slides further down the umbrella, but her feet touch on a projection. She gazes far down to the earth, then up at the visage of the effigy whose extended arms she's hooked her umbrella around, before she's lifted off the projection. Spider-Man attaches two threads to the pane frames and pulls them back like a slingshot. As he propels himself through the atmosphere, a claw on one of Octavius' appendages becomes a pointed lance. Octavius extends the lance-like appendage towards Spider-Man, but Aunt May thwacks Octavius on the head with her umbrella. Spider-Man seizes the appendage, and Octavius releases Aunt May. Spider-Man plunges to her aid, snatches her, and they glide and swing down the road. The officers shoot at Octavius, who, with sacks of currency in one claw, vanishes around the edge of the edifice. Spider-Man alights with Aunt May, tilts his head, then vaults up on a thread. Girls cluster to Aunt May, while shooting threads as he goes, Spider-Man soars through the heavens from edifice to edifice across New York City. The observatory with its hanging glass drapery wall stands 95 feet tall, and inside it is a globe constructed of fabricated aluminum panels. Peter is in the congested observatory and reaches for sustenance as someone seizes the last canapé from a waitress's tray. A pair strolls by, and he raises his camera, realizing the lens cover is still on and removes it, but by which time, the pair has strolled away. Harry's poured a drink, snatching the bottle and knocking over his glass as Peter walks up to him. The two old companions glare defiantly at each other as the Mayor scowls. All heads turn to stare at the stairway down into the observatory where Captain Jameson is in attire, accompanied by a young woman walking beside him arm-in-arm. Everyone applauds, except Peter, who sees the young woman is MJ in a black strapless gown, her hair tied up. MJ stares at Peter and turns her head away as he gazes, captivated. Later, Peter makes his way out onto the terrace, where a server has a tray with one canapé on it. He reaches for it as someone else snatches it away. Peter sees MJ alone, pauses, then walks up behind her. MJ turns to face him, and Peter swallows, his eyes filling up. He watches despondently as MJ strides away from him, and a waitress passes by as Peter seizes a cocktail glass."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Through an office window, Spider-Man and Octavius are crashed by each other, and Octavius' face is pummeled by Spider-Man. Spider-Man's head is grabbed by Octavius' limbs, which toss him about, causing both men to fall out of the window. The material of Aunt May's brolly is started to be torn, and she is slipped down on it as Spider-Man is tossed across the street by Octavius into a window in the block opposite. Further down the brolly, Aunt May slips, but a ledge lands her feet on it. She looks way down to the ground, then up at the face of the statue whose outstretched arms her brolly is hooked around before the ledge is lifted off by her. Two webs are stuck to the window frames by Spider-Man, and they are stretched back like a catapult. As he is launched through the air, a pointed spear becomes a pincer on one of Octavius' limbs. The spear-like limb is stretched out by Octavius towards Spider-Man, but Octavius is smacked on the head by Aunt May with her brolly. The limb is grabbed by Spider-Man, and Aunt May is released by Octavius. Her rescue is dived for by Spider-Man, who catches her, and they are swooped and swung down the street. Octavius is fired at by the police, and with bags of money in one pincer, he disappears around the corner of the building. Aunt May lands with Spider-Man, his head is cocked, then a web is leaped up on by him. Aunt May is flocked to by girls, while he sweeps through the skies from building to building across New York City, firing webs as he goes. The planetarium with its suspended glass curtain wall is standing 95 feet high, and inside it, a sphere constructed of fabricated aluminum panels is found. In the crowded planetarium is Peter, who is reached for food as the last canope is grabbed from a waitress's tray by someone. A couple walks by, and his camera is raised by him, realizing the lens cap is still on and is removed, but by which time, the couple has walked away. A drink is poured by Harry, who snatches the bottle and knocks over his glass as up to him Peter walks. The two old friends are stared defiantly at by each other as the Mayor glares. All heads are turned to look at the stairway down into the planetarium where Captain Jameson, in uniform, is accompanied arm-in-arm by a young lady walking beside him. Applause is given by everyone, except Peter, who sees the young lady is MJ in a black strapless dress, her hair tied up. MJ stares at Peter and her head is turned away as mesmerized, he gazes. Later, Peter makes his way out onto the balcony, where a tray with one canope on it is held by a server. It is reached for by him as someone else whisks it away. MJ is seen alone by Peter, who pauses, then behind her walks. MJ turns to face him, and a gulp is taken by Peter, his eyes filling up. Forlornly, he watches as MJ strides away from him, and a cocktail glass is grabbed by him as a waitress passes by."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Spider-Man and Octavius crash through an office window, and Spider-Man punches Octavius. Octavius' limbs grab and throw Spider-Man, causing them to fall out. Aunt May's brolly tears as Octavius hurls Spider-Man across the street. She slips but lands on a ledge, looking down at the ground, then up at a statue with her brolly hooked around its arms. Spider-Man uses webs as a catapult, launching toward Octavius, whose limb forms a spear. Aunt May hits Octavius with her brolly, freeing Spider-Man to grab the limb. Octavius releases Aunt May, and Spider-Man rescues her, swinging down the street. Police shoot at Octavius, who escapes with money around a building corner. Spider-Man lands with Aunt May, then swings through New York City's buildings. The 95-foot-high planetarium with its aluminum sphere hosts Peter in a crowd. He reaches for food as someone takes the last canapé. He raises his camera but forgets to remove the lens cap. Harry spills a drink as Peter approaches, and they stare defiantly. Captain Jameson enters with a young lady, who is MJ in a black dress, and everyone applauds except Peter. MJ glances at Peter, then turns away. Peter steps onto the balcony, attempts to get a canapé but misses it again. He sees MJ alone, approaches, and gulps as she turns, before she walks away, leaving Peter watching sadly as he grabs a cocktail glass."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Spider-Man and Octavius crash through an office window, and Spider-Man pummels his face. Octavius' limbs grab Spider-Man and toss him, causing both to fall out. Aunt May slips down her brolly, landing on a ledge. Spider-Man catapults himself as Octavius aims a spear-like limb, but Aunt May hits him with her brolly. Spider-Man grabs the limb, Octavius frees Aunt May, and Spider-Man rescues her. The police fire at Octavius, who flees with money. Spider-Man lands with Aunt May, then swings through New York City. At the 95-foot-high planetarium, Peter reaches for food but misses out. He raises his camera, forgetting the lens cap, and loses a photo opportunity. Harry knocks over his glass as Peter approaches. They stare each other down. Captain Jameson enters with a young lady, MJ, in a black dress. Peter gazes at MJ, who looks away. Later, Peter reaches for a canape but misses again. He approaches MJ, gulps, and watches her walk away, grabbing a cocktail glass."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Spider-Man and Octavius find themselves crashing violently through the glass of an office window, creating a chaotic scene. Once inside, Spider-Man wastes no time and immediately starts pummeling Octavius' face with a fierce determination. In response, Octavius uses his mechanical limbs to grab hold of Spider-Man's head, effortlessly tossing him around like a ragdoll, which results in both men tumbling out of the shattered window. Meanwhile, Aunt May faces her own predicament as the fabric of her umbrella begins to fray and tear. She precariously slips downwards on the umbrella just as Octavius hurls Spider-Man across the street, sending him crashing into a window on the building opposite. As Aunt May continues to slip, her feet luckily find purchase on a ledge. From her position, she nervously peers down at the distant ground, then upward at the face of a statue with its welcoming arms, which have become entangled with her umbrella, just before she is lifted off the safety of the ledge. Spider-Man, ever the hero, anchors two webs to the window frames and pulls them taut like a makeshift catapult. With a powerful launch, he propels himself through the air at high speed. At the same time, Octavius transforms one of his mechanical limbs into a spear-like weapon, aiming it menacingly toward Spider-Man. In a surprising turn of events, Aunt May intervenes by striking Octavius on the head with her trusty umbrella. Seizing the opportunity, Spider-Man grabs hold of Octavius' limb, causing Octavius to release his grip on Aunt May. In a daring rescue, Spider-Man catches her in mid-air, and together they gracefully swoop and swing down the street below. Simultaneously, the police arrive on the scene, opening fire on Octavius, who clutches bags of stolen money in one of his deadly pincers, and quickly disappears around the corner of a looming building. Safely landing with Aunt May, Spider-Man cocks his head thoughtfully before leaping back into action, swinging upward on a web. As girls flock around Aunt May, Spider-Man—a blur of motion—fires webs while elegantly soaring through the skies, moving seamlessly from one towering building to another across the vast expanse of New York City. The impressive planetarium stands at an awe-inspiring 95 feet high, with its distinctive suspended glass curtain wall. Inside this monumental structure resides a large sphere constructed meticulously from fabricated aluminum panels. Within the bustling planetarium, Peter searches for food amidst the crowds. He stretches out his hand just as someone else grabs the last canapé from a passing waitress's tray. Nearby, a couple strolls by, and Peter raises his camera to capture the moment, only to realize the lens cap is still on. He quickly removes it, but by that time, the couple has already moved on. Harry, holding a drink, carelessly pours himself another, snatching up the bottle and accidentally knocking over his glass as Peter approaches him. The two old friends lock eyes, staring defiantly at each other, and in that moment, the Mayor casts an annoyed glare in their direction. As the tension builds, all heads turn toward the stairway descending into the planetarium, where Captain Jameson, resplendent in uniform, makes an entrance arm-in-arm with a young lady. The room erupts in applause from everyone except Peter, who looks on in disbelief as he recognizes the young lady as MJ, elegantly dressed in a black strapless gown with her hair beautifully styled. MJ catches Peter's gaze and then shifts her eyes away, while he remains, utterly mesmerized by her presence. Later on, Peter ventures out onto the balcony, only to find a lone canapé on a server's tray. He reaches for it, only to have it snatched away by someone else at the last moment. Spotting MJ standing alone, Peter hesitates, then resolutely approaches her from behind. As MJ turns to face him, Peter gulps nervously, his eyes betraying deep emotion. He watches with a heavy heart as MJ, without a word, turns and walks away from him. In a resigned gesture, Peter grabs a cocktail glass from a waitress passing by, attempting to mask his disappointment."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "The intense confrontation between Spider-Man and Octavius escalates rapidly as they crash with incredible force through the fragile glass of an office window, setting off a whirlwind of chaos. Once they find themselves inside the office, Spider-Man doesn't hesitate for even a second and immediately begins to unleash a relentless barrage of punches onto Octavius' face, fueled by a fierce and resolute determination. In retaliation, Octavius deftly employs his formidable mechanical limbs to seize Spider-Man's head, effortlessly tossing him around as though he were no more than a ragdoll, resulting in both of them being hurled out of the shattered window once more. Meanwhile, Aunt May faces her own perilous situation as the fabric of her umbrella starts to fray and weaken. She precariously slips downward on the umbrella just as Octavius hurls Spider-Man across the street with great force, sending him hurtling into a window on the building opposite. As Aunt May continues her downward descent, her feet miraculously find purchase on a narrow ledge. From her precarious vantage point, she nervously peers down at the distant ground stretching below and then upward at the face of a statue, its welcoming arms having become tangled with her umbrella, just before she is lifted away from the safety of the ledge. Spider-Man, embracing his role as the ever-dedicated hero, anchors two sturdy webs to the window frames and pulls them taut, transforming them into a makeshift catapult. With impressive strength and agility, he propels himself through the air at incredible speed. At this crucial moment, Octavius transforms one of his mechanical limbs into a menacing, spear-like weapon, aiming it threateningly in Spider-Man's direction. In an unexpected turn of events, Aunt May intervenes by striking Octavius on the head with her trusty umbrella. Spider-Man seizes the opportunity, grasping hold of Octavius' limb, which causes Octavius to release his grip on Aunt May. In a daring act of rescue, Spider-Man skillfully captures her in mid-air, and together they glide and swing gracefully down the street below. Simultaneously, the police arrive at the chaotic scene, opening fire on Octavius, who is clutching bags filled with stolen money in one of his deadly pincers, and they watch as he quickly disappears around the corner of a towering building. Safely landing with Aunt May, Spider-Man cocks his head thoughtfully, considering his next move, before leaping back into the fray, swinging upward on another web. As girls flock around Aunt May, Spider-Man, a blur of motion and agility, fires webs while elegantly soaring through the skies, transitioning seamlessly from one towering skyscraper to the next across the sprawling expanse of New York City. The impressive planetarium, a truly awe-inspiring structure, stands at a remarkable height of 95 feet, distinguished by its notable suspended glass curtain wall. Inside this colossal and monumental building resides a large sphere, meticulously constructed from fabricated aluminum panels. Within the bustling planetarium, Peter searches for food amidst the crowded throngs of people. He stretches out his hand just as someone else snatches the last canapé from a tray carried by a passing waitress. Nearby, a couple leisurely strolls by, prompting Peter to raise his camera in an attempt to capture the moment, only to realize, to his dismay, that the lens cap is still affixed. He hurriedly removes it, but by that time, the couple has already moved on, out of sight. Harry, standing nearby with a drink in hand, carelessly pours himself another, grabbing the bottle and inadvertently knocking over his glass just as Peter approaches him. The two old friends lock eyes, their gazes filled with defiance, and in that charged moment, the Mayor casts a visibly annoyed glare in their direction. As the tension in the room mounts, all heads turn toward the stairway descending into the planetarium, where Captain Jameson, looking resplendent in his uniform, makes a grand entrance arm-in-arm with a young lady. The room erupts in enthusiastic applause from everyone except Peter, who looks on in disbelief as he recognizes the young lady to be MJ, elegantly dressed in a striking black strapless gown, her hair beautifully styled to perfection. MJ catches Peter's gaze momentarily before shifting her eyes away, while he remains, utterly mesmerized by her presence. Later, Peter ventures out onto the balcony, only to find a lone canapé resting on a server's tray. He reaches for it with hopeful anticipation, only to have it snatched away by someone else at the final moment. Spotting MJ standing alone, Peter hesitates for a brief moment, then resolutely approaches her from behind with determined resolve. As MJ turns to face him, Peter gulps nervously, his eyes betraying the depth of his emotions. He watches with a heavy heart as MJ, without uttering a single word, turns and walks away, leaving him standing there. In a resigned gesture, Peter grabs a cocktail glass from a passing waitress, attempting to mask his profound disappointment with a facade of nonchalance."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Spider-Man and Octavius crash forcefully through the glass of an office window, sending shards scattering as Spider-Man immediately throws a series of heavy punches at Octavius' face. In response, Octavius' mechanical limbs swiftly extend, wrapping around Spider-Man's head and violently hurling him, causing both to plummet out of the shattered window. As they fall, the fabric of Aunt May's brolly begins to rip under the tension, causing her to slide precariously down its length. At that moment, Octavius violently flings Spider-Man across the street, sending him crashing through another window in a building opposite. Meanwhile, Aunt May continues to slip down the brolly until her feet find a precarious hold on a narrow ledge. She glances down at the dizzying drop below, then upward to the face of a statue whose outstretched arms have inadvertently caught her brolly, moments before she is hoisted off the ledge. Inside, Spider-Man affixes webs to the window frames, pulling them taut like a makeshift slingshot before propelling himself through the air toward Octavius. Mid-flight, Octavius transforms one of his limb's pincers into a menacing, spear-like point, thrusting it towards Spider-Man. Just in time, Aunt May delivers a well-aimed strike with her brolly to Octavius' head. Seizing the opportunity, Spider-Man grabs onto the pointed limb, prompting Octavius to release Aunt May. With agility, Spider-Man plummets in a controlled dive, clutching Aunt May in his arms before swinging them both gracefully down the street. Meanwhile, police officers take aim and fire at Octavius, who, clutching bags of stolen money, rapidly vanishes around a building's edge. Spider-Man lands softly with Aunt May and offers a quick, reassuring head tilt before darting upwards, launching into the air with webs. As Aunt May is surrounded by a group of concerned onlookers, Spider-Man, firing webs with precision, accelerates through the city, skillfully traversing from one towering skyscraper to another. Meanwhile, at the planetarium, an impressive 95-foot-high structure with a glass curtain wall, Peter Parker is amidst a bustling crowd. He reaches towards a tray for a canope, only for someone else to snatch the last one. Observing a couple passing by, he lifts his camera, only to discover the lens cap still on, quickly removing it to capture the moment, but the couple has already moved out of frame. Nearby, Harry Osborne hurriedly pours himself a drink, clumsily grabbing the bottle and inadvertently knocking over the glass as Peter approaches. The two old friends meet eyes with a tense, defiant stare while the Mayor casts a disapproving glance. Attention shifts collectively to the staircase leading into the planetarium as Captain Jameson, in uniform, makes a grand entrance alongside a young woman, escorted arm-in-arm. Applause fills the room, except from Peter, whose eyes lock onto the young woman, revealing herself as MJ in a stunning black strapless dress, her hair elegantly styled. Upon meeting Peter's gaze, MJ, with a distant expression, turns her head, leaving him captivated. Later, Peter steps out to the balcony where a server offers a tray with a single canope. He reaches for it, only for it to be swiftly taken by someone else. Noticing MJ standing alone, he hesitates before moving quietly towards her. As he approaches, MJ gracefully pivots to face him, prompting Peter to swallow hard, his eyes welling with emotion. He watches with a sense of yearning as MJ confidently strides away, and as a waitress passes by, Peter instinctively reaches for and picks up a cocktail glass."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Spider-Man and Octavius crash through an office window, engaging in a fierce skirmish that sends them both tumbling out onto the street. As Aunt May precariously hangs from a tearing umbrella, Spider-Man is hurled across the street, but he quickly rebounds using webs as a catapult to counter Octavius' attack. Aunt May intervenes just in time, allowing Spider-Man to seize Octavius' limb and rescue her, leading to a dramatic escape down the street as the police engage Octavius, who escapes with stolen money.\n\nMeanwhile, back in the planetarium, Peter navigates through a bustling crowd, missing out on snacks and realizing he missed a photo opportunity when he fumbles with his camera. As he approaches Harry, tension rises between the two amidst the formal gathering. Attention shifts to Captain Jameson's entrance with MJ on his arm, eliciting applause from everyone except a mesmerized Peter. As MJ avoids Peter's gaze, he retreats to the balcony, once more missing a snack opportunity, before finding MJ alone. Despite his longing gaze, MJ turns away, leaving Peter to watch her leave while he grabs a cocktail glass in resignation."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Spider-Man and Octavius, known to most as the brilliant scientist turned supervillain Dr. Otto Octavius, crash through an office window, and Spider-Man pummels Octavius' face. Octavius' mechanical limbs, which he controls via neural interface, grab Spider-Man's head and toss him about, causing both men to fall out of the window. The material of Aunt May's brolly, a British term for umbrella, starts to tear, and she slips down on it as Octavius tosses Spider-Man across the street into a window in the block opposite. Aunt May slips further down the brolly, but her feet land on a ledge. She looks way down to the ground, then up at the face of the statue, a city landmark, whose outstretched arms she's hooked her brolly around, before she's lifted off the ledge. Spider-Man sticks two webs to the window frames and stretches them back like a catapult, a technique he developed through his physics knowledge from high school. As he launches himself through the air, a pincer on one of Octavius' limbs becomes a pointed spear, a feature Octavius engineered himself for added combat capability. Octavius stretches out the spear-like limb towards Spider-Man, but Aunt May, bravely wielding her brolly, smacks Octavius on the head. Spider-Man grabs the limb, and Octavius releases Aunt May. Spider-Man dives to her rescue, catches her, and they swoop and swing down the street. The police, part of the NYPD's special task force for superhuman threats, fire at Octavius, who, with bags of money in one pincer—a nod to his original goal of funding his experiments—disappears around the corner of the building. Spider-Man lands with Aunt May, cocks his head, then leaps up on a web. Girls flock to Aunt May, while firing webs as he goes, Spider-Man sweeps through the skies from building to building across New York City, a city synonymous with superhero activity. The planetarium, part of the Hayden Planetarium at the American Museum of Natural History, with its suspended glass curtain wall stands 95 feet high, and inside it is a sphere constructed of fabricated aluminum panels, representing a model of the universe. Peter is in the crowded planetarium and reaches for food as someone grabs the last canope from a waitress's tray. A couple walks by, and he raises his camera, realizing the lens cap is still on and removes it, but by which time, the couple has walked away. Harry, the heir to the Oscorp fortune, has poured a drink, snatching the bottle and knocking over his glass as Peter walks up to him. The two old friends stare defiantly at each other as the Mayor, who is presiding over the event, glares. All heads turn to look at the stairway down into the planetarium where Captain Jameson, part of the NYPD and son of Daily Bugle's chief editor J. Jonah Jameson, is in uniform, accompanied by a young lady walking beside him arm-in-arm. Everyone applauds, except Peter, who sees the young lady is MJ in a black strapless dress, her hair tied up elegantly. MJ, Peter's long-time love interest and aspiring actress, stares at Peter and turns her head away as he gazes, mesmerized. Later, Peter makes his way out onto the balcony, where a server has a tray with one canope on it. He reaches for it as someone else whisks it away. Peter sees MJ alone, pauses, then walks up behind her. MJ turns to face him, and Peter gulps, his eyes filling up with emotion. He watches forlornly as MJ strides away from him, and a waitress passes by as Peter grabs a cocktail glass."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "MJ turns to face him and Peter gulps his eyes filling up SpiderMan and Octavius crash through an office window and SpiderMan pummels Octavius' face SpiderMan and Octavius crash through an office window and SpiderMan pummels Octavius' face Octavius' limbs grab SpiderMan's head and toss him about causing both men to fall out of the window The material of Aunt May's brolly starts to tear and she slips down on it as Octavius tosses SpiderMan across the street into a window in the block opposite Aunt May slips further down the brolly but her feet land on a ledge She looks way down to the ground then up at the face of the statue whose outstretched arms she is hooked her brolly around before she is lifted off the ledge SpiderMan sticks two webs to the window frames and stretches them back like a catapult All heads turn to look at the stairway down into the planetarium where Captain Jameson is in uniform accompanied by a young lady walking beside him Peter sees MJ alone pauses then walks up behind her Aunt May slips further down the brolly but her feet land on a ledge A couple walks by and he raises his camera realizing the lens cap is still on and removes it but by which time the couple has walked away As he launches himself through the air a pincer on one of Octavius' limbs becomes a pointed spear Peter is in the crowded planetarium and reaches for food as someone grabs the last canope from a waitress's tray Octavius stretches out the spearlike limb towards SpiderMan but Aunt May smacks Octavius on the head with her brolly SpiderMan grabs the limb and Octavius releases Aunt May MJ stares at Peter and turns her head away as he gazes mesmerized SpiderMan dives to her rescue catches her and they swoop and swing down the street Octavius stretches out the spearlike limb towards SpiderMan but Aunt May smacks Octavius on the head with her brolly Octavius' limbs grab SpiderMan's head and toss him about causing both men to fall out of the window The police fire at Octavius who with bags of money in one pincer disappears around the corner of the building SpiderMan lands with She looks way down to the ground then up at the face of the statue whose outstretched arms she is hooked her brolly around before she is lifted off the ledge Aunt May cocks his head then leaps up on a web Girls flock to Aunt May while firing webs as he goes Girls flock to Aunt May while firing webs as he goes SpiderMan sweeps through the skies from building to building across New York City The planetarium with its suspended glass curtain wall stands 95 feet high and inside it is a sphere constructed of fabricated aluminum panels Peter is in the crowded planetarium and reaches for food as someone grabs the last canope from a waitress's tray A couple walks by and he raises his camera realizing the lens cap is still on and removes it but by which time the couple has walked away Harry's poured a drink snatching the bottle and knocking over his glass as Peter walks up to him The material of Aunt May's brolly starts to tear and she slips down on it as Octavius tosses SpiderMan across the street into a window in the block opposite The two old friends stare defiantly at each other as the Mayor glares All heads turn to look at the stairway down into the planetarium where Captain Jameson is in uniform accompanied by a young lady walking beside him arminarm SpiderMan grabs the limb and Octavius releases Aunt May He reaches for it as someone else whisks it away Everyone applauds except Peter who sees the young lady is MJ in a black strapless dress her hair tied up MJ stares at Peter and turns her head away as he gazes mesmerized Later Peter makes his way out onto the balcony where a server has a tray with one canope on it He reaches for it as someone else whisks it away Peter sees MJ alone pauses then walks up behind her MJ turns to face him and Peter gulps his eyes filling up He watches forlornly as MJ strides away from him and a waitress passes by as Peter grabs a cocktail glass"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "SpiderMan and Octavius crash through an office window and SpiderMan pummels Octavius' face. Octavius' limbs grab SpiderMan's head and toss him about causing both men to fall out of the window. The material of Aunt May's brolly starts to tear and she slips down on it as Octavius tosses SpiderMan across the street into a window in the block opposite. Aunt May slips further down the brolly but her feet land on a ledge. She looks way down to the ground then up at the face of the statue whose outstretched arms she is hooked her brolly around before she is lifted off the ledge. SpiderMan sticks two webs to the window frames and stretches them back like a catapult. As he launches himself through the air a pincer on one of Octavius' limbs becomes a pointed spear. Octavius stretches out the spearlike limb towards SpiderMan but Aunt May smacks Octavius on the head with her brolly. SpiderMan grabs the limb and Octavius releases Aunt May. SpiderMan dives to her rescue catches her and they swoop and swing down the street. The police fire at Octavius who with bags of money in one pincer disappears around the corner of the building. SpiderMan lands with. Aunt May cocks his head then leaps up on a web. Girls flock to Aunt May while firing webs as he goes. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. SpiderMan sweeps through the skies from building to building across New York City. The planetarium with its suspended glass curtain wall stands 95 feet high and inside it is a sphere constructed of fabricated aluminum panels. Peter is in the crowded planetarium and reaches for food as someone grabs the last canope from a waitress's tray. A couple walks by and he raises his camera realizing the lens cap is still on and removes it but by which time the couple has walked away. Harry's poured a drink snatching the bottle and knocking over his glass as Peter walks up to him. The two old friends stare defiantly at each other as the Mayor glares. All heads turn to look at the stairway down into the planetarium where Captain Jameson is in uniform accompanied by a young lady walking beside him. arminarm. Everyone applauds except Peter who sees the young lady is MJ in a black strapless dress her hair tied up. MJ stares at Peter and turns her head away as he gazes mesmerized. Later Peter makes his way out onto the balcony where a server has a tray with one canope on it. He reaches for it as someone else whisks it away. Peter sees MJ alone pauses then walks up behind her. MJ turns to face him and Peter gulps his eyes filling up. He watches forlornly as MJ strides away from him and a waitress passes by as Peter grabs a cocktail glass."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "SpiderMan and Octavius crash through an office window and SpiderMan pummels Octavius' face. Octavius' limbs grab SpiderMan's head and toss him about causing both men to fall out of the window. The material of Aunt May's brolly starts to tear and she slips down on it as Octavius tosses SpiderMan across the street into a window in the block opposite. Aunt May slips further down the brolly but her feet land on a ledge. She looks way down to the ground then up at the face of the statue whose outstretched arms she is hooked her brolly around before she is lifted off the ledge. SpiderMan sticks two webs to the window frames and stretches them back like a catapult. As he launches himself through the air a pincer on one of Octavius' limbs becomes a pointed spear. Octavius stretches out the spearlike limb towards SpiderMan but Aunt May smacks Octavius on the head with her brolly. SpiderMan grabs the limb and Octavius releases Aunt May. SpiderMan dives to her rescue catches her and they swoop and swing down the street. The police fire at Octavius who with bags of money in one pincer disappears around the corner of the building. SpiderMan lands with. Aunt May cocks his head then leaps up on a web. Girls flock to Aunt May while firing webs as he goes. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. SpiderMan sweeps through the skies from building to building across New York City. The planetarium with its suspended glass curtain wall stands 95 feet high and inside it is a sphere constructed of fabricated aluminum panels. Peter is in the crowded planetarium and reaches for food as someone grabs the last canope from a waitress's tray. A couple walks by and he raises his camera realizing the lens cap is still on and removes it but by which time the couple has walked away. Harry's poured a drink snatching the bottle and knocking over his glass as Peter walks up to him. The two old friends stare defiantly at each other as the Mayor glares. All heads turn to look at the stairway down into the planetarium where Captain Jameson is in uniform accompanied by a young lady walking beside him. arminarm. Everyone applauds except Peter who sees the young lady is MJ in a black strapless dress her hair tied up. MJ stares at Peter and turns her head away as he gazes mesmerized. Later Peter makes his way out onto the balcony where a server has a tray with one canope on it. He reaches for it as someone else whisks it away. Peter sees MJ alone pauses then walks up behind her. MJ turns to face him and Peter gulps his eyes filling up. He watches forlornly as MJ strides away from him and a waitress passes by as Peter grabs a cocktail glass."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "SpiderMan and Octavius crash through an office window and SpiderMan pummels Octavius' face. Octavius' limbs grab SpiderMan's head and toss him about causing both men to fall out of the window. The material of Aunt May's brolly starts to tear and she slips down on it as Octavius tosses SpiderMan across the street into a window in the block opposite. Aunt May slips further down the brolly but her feet land on a ledge. She looks way down to the ground then up at the face of the statue whose outstretched arms she is hooked her brolly around before she is lifted off the ledge. SpiderMan sticks two webs to the window frames and stretches them back like a catapult. As he launches himself through the air a pincer on one of Octavius' limbs becomes a pointed spear. arminarm. Everyone applauds except Peter who sees the young lady is MJ in a black strapless dress her hair tied up. MJ stares at Peter and turns her head away as he gazes mesmerized. Later Peter makes his way out onto the balcony where a server has a tray with one canope on it. He reaches for it as someone else whisks it away. Peter sees MJ alone pauses then walks up behind her. MJ turns to face him and Peter gulps his eyes filling up. He watches forlornly as MJ strides away from him and a waitress passes by as Peter grabs a cocktail glass."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "SpiderMan and Octavius crash through an office window and SpiderMan pummels Octavius' face. Octavius' limbs grab SpiderMan's head and toss him about causing both men to fall out of the window. The material of Aunt May's brolly starts to tear and she slips down on it as Octavius tosses SpiderMan across the street into a window in the block opposite. Peter sees MJ alone pauses then walks up behind her. MJ turns to face him and Peter gulps his eyes filling up. He watches forlornly as MJ strides away from him and a waitress passes by as Peter grabs a cocktail glass."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Batman and a walrus crash through an office window, and Batman pummels the walrus' face. The walrus' limbs grab Batman's head and toss him about, causing both creatures to fall out of the window. The material of Aunt May's brolly starts to tear, and she slips down on it as the walrus tosses Batman across the street into a window in the block opposite. Aunt May slips further down the brolly, but her feet land on a ledge. She looks way down to the ground, then up at the face of the statue whose outstretched arms she's hooked her brolly around, before she's lifted off the ledge. Batman sticks two webs to the window frames and stretches them back like a catapult. As he launches himself through the air, a pincer on one of the walrus' limbs becomes a pointed spear. The walrus stretches out the spear-like limb towards Batman, but Aunt May smacks the walrus on the head with her brolly. Batman grabs the limb, and the walrus releases Aunt May. Batman dives to her rescue, catches her, and they swoop and swing down the street. The seagulls fire at the walrus, who, with bags of money in one pincer, disappears around the corner of the building. Batman lands with Aunt May, cocks his head, then leaps up on a web. Girls flock to Aunt May, while firing webs as he goes, Batman sweeps through the skies from building to building across New York City. The planetarium with its suspended glass curtain wall stands 95 feet high, and inside it is a sphere constructed of fabricated aluminum panels. A penguin is in the crowded planetarium and reaches for food as someone grabs the last canope from a waitress's tray. A couple walks by, and the penguin raises his camera, realizing the lens cap is still on and removes it, but by which time, the couple has walked away. A giraffe poured a drink, snatching the bottle and knocking over his glass as the penguin walks up to him. The two old friends stare defiantly at each other as the eagle glares. All heads turn to look at the stairway down into the planetarium where a kangaroo is in uniform, accompanied by a young lady walking beside him arm-in-arm. Everyone applauds, except the penguin, who sees the young lady is MJ in a black strapless dress, her hair tied up. MJ stares at the penguin and turns her head away as he gazes, mesmerized. Later, the penguin makes his way out onto the balcony, where a dolphin has a tray with one canope on it. He reaches for it as someone else whisks it away. The penguin sees MJ alone, pauses, then walks up behind her. MJ turns to face him, and the penguin gulps, his eyes filling up. He watches forlornly as MJ strides away from him, and a waitress passes by as the penguin grabs a cocktail glass."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Spider-Man and Octavius crash through a greenhouse roof, and Spider-Man pummels Octavius' face. Octavius' limbs grab Spider-Man's head and toss him about, causing both men to fall out of the roof. The material of Aunt May's jacket starts to tear, and she slips down on it as Octavius tosses Spider-Man across the street into the window of the bakery opposite. Aunt May slips further down the jacket, but her feet land on a fence. She looks way down to the sidewalk, then up at the face of the billboard whose outstretched frame she's hooked her jacket around, before she's lifted off the fence. Spider-Man sticks two webs to the balcony railings and stretches them back like a slingshot. As he launches himself through the air, a fork on one of Octavius' limbs becomes a pointed anchor. Octavius stretches out the anchor-like limb towards Spider-Man, but Aunt May smacks Octavius on the head with her jacket. Spider-Man grabs the limb, and Octavius releases Aunt May. Spider-Man dives to her rescue, catches her, and they swoop and swing down the avenue. The firefighters fire at Octavius, who, with suitcases of papers in one fork, disappears around the alley of the building. Spider-Man lands with Aunt May, cocks his head, then leaps up on a web. Girls flock to Aunt May, while firing webs as he goes, Spider-Man sweeps through the skies from spire to spire across New York City. The conservatory with its suspended steel curtain wall stands 95 feet high, and inside it is a globe constructed of polished bronze panels. Peter is in the crowded conservatory and reaches for snacks as someone grabs the last cookie from a server's plate. A couple walks by, and he raises his phone, realizing the screen is still locked and unlocks it, but by which time, the couple has walked away. Harry's poured a beverage, snatching the pitcher and knocking over his cup as Peter walks up to him. The two old friends stare defiantly at each other as the Governor glares. All heads turn to look at the staircase down into the conservatory where Captain Jameson is in uniform, accompanied by a young lady walking beside him arm-in-arm. Everyone applauds, except Peter, who sees the young lady is MJ in a red sleeveless gown, her hair braided. MJ stares at Peter and turns her head away as he gazes, mesmerized. Later, Peter makes his way out onto the terrace, where an attendant has a tray with one cookie on it. He reaches for it as someone else whisks it away. Peter sees MJ alone, pauses, then walks up behind her. MJ turns to face him, and Peter gulps, his eyes filling up. He watches forlornly as MJ strides away from him, and a server passes by as Peter grabs a wine glass."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Spider-Man and Octavius glide through an office window, and Spider-Man taps Octavius' shoulder. Octavius' limbs lift Spider-Man's head and jostle him about, causing both men to slip out of the window. The material of Aunt May's brolly begins to fray, and she dangles from it as Octavius hurls Spider-Man across the street into a window in the block opposite. Aunt May slides further down the brolly, but her feet balance on a ledge. She peers way down to the ground, then up at the face of the statue whose outstretched arms she's hooked her brolly around, before she's carried off the ledge. Spider-Man attaches two webs to the window frames and pulls them back like a slingshot. As he propels himself through the air, a pincer on one of Octavius' limbs transforms into a pointed spear. Octavius extends the spear-like limb towards Spider-Man, but Aunt May nudges Octavius on the head with her brolly. Spider-Man catches the limb, and Octavius drops Aunt May. Spider-Man lunges to her rescue, catches her, and they glide and swing down the street. The police aim at Octavius, who, with bags of money in one pincer, vanishes around the corner of the building. Spider-Man pauses with Aunt May, tilts his head, then bounds up on a web. Girls converge on Aunt May, while shooting webs as he goes, Spider-Man glides through the skies from building to building across New York City. The planetarium with its suspended glass curtain wall stands 95 feet high, and inside it is a sphere crafted of fabricated aluminum panels. Peter is in the crowded planetarium and reaches for food as someone swipes the last canope from a waitress's tray. A couple strolls by, and he lifts his camera, realizing the lens cap is still on and removes it, but by which time, the couple has strolled away. Harry's poured a drink, clutching the bottle and toppling over his glass as Peter approaches him. The two old friends glare defiantly at each other as the Mayor scowls. All heads swivel to look at the stairway down into the planetarium where Captain Jameson is in uniform, accompanied by a young lady walking beside him arm-in-arm. Everyone cheers, except Peter, who notices the young lady is MJ in a black strapless dress, her hair tied up. MJ glances at Peter and turns her head away as he gazes, enraptured. Later, Peter makes his way out onto the balcony, where a server has a tray with one canope on it. He reaches for it as someone else sweeps it away. Peter sees MJ alone, hesitates, then approaches her from behind. MJ turns to face him, and Peter swallows, his eyes welling up. He watches wistfully as MJ marches away from him, and a waitress strolls by as Peter clutches a cocktail glass."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "The giraffe and the stapler crash through a cupboard door, and the giraffe pummels the stapler's corner. The stapler's threads grab the giraffe's button and toss it about, causing both llamas to fall out of the door. The material of Grandma's hat starts to tear, and she slips down on it as the stapler tosses the giraffe across the bathroom into a door in the bunk opposite. Grandma slips further down the hat, but her feet land on a plank. She looks way down to the water, then up at the face of the fountain whose outstretched hands she's hooked her hat around, before she's lifted off the plank. The giraffe sticks two laces to the door handles and stretches them back like a slingshot. As it launches itself through the breeze, a spoon on one of the stapler's threads becomes a pointed fork. The stapler stretches out the fork-like thread towards the giraffe, but Grandma smacks the stapler on the button with her hat. The giraffe grabs the thread, and the stapler releases Grandma. The giraffe dives to her rescue, catches her, and they swoop and swing down the alley. The firefighters spray at the stapler, who, with crates of apples in one spoon, disappears around the fence of the stadium. The giraffe lands with Grandma, cocks its tail, then leaps up on a rope. Chickens flock to Grandma, while firing ropes as it goes, the giraffe sweeps through the clouds from stadium to stadium across Chicago. The aquarium with its suspended brass curtain wall stands 95 feet high, and inside it is a cube constructed of laminated iron sheets. Sam is in the crowded aquarium and reaches for flowers as someone grabs the last croissant from a chef's rack. A trio strolls by, and he raises his binoculars, realizing the lens cap is still on and removes it, but by which time, the trio has strolled away. Larry's poured a soda, snatching the pitcher and knocking over his mug as Sam ambles up to him. The two young siblings stare defiantly at each other as the Governor glares. All eyes turn to look at the ladder down into the aquarium where Detective Johnson is in uniform, accompanied by a young gentleman walking beside him arm-in-arm. Everyone applauds, except Sam, who sees the young gentleman is Kara in a blue sequined gown, her hair tied back. Kara stares at Sam and turns her head away as he gazes, mesmerized. Later, Sam makes his way out onto the patio, where a magician has a rack with one croissant on it. He reaches for it as someone else whisks it away. Sam sees Kara alone, pauses, then walks up behind her. Kara turns to face him, and Sam gulps, his eyes filling up. He watches forlornly as Kara strides away from him, and a chef passes by as Sam grabs a teacup."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "The Hobbit and Gandalf tumble through an office window, and The Hobbit slaps Gandalf's shoulder. Gandalf's tentacles hug The Hobbit's leg and spin him around, causing both creatures to float out of the window. The tapestry of Grandma's quilt starts to unravel, and she glides down on it as Gandalf flings The Hobbit across the street into a window in the building opposite. Grandma glides further down the quilt, but her toes rest on a ledge. She peers way down to the ground, then up at the face of the sculpture whose open arms she's hooked her quilt around, before she's pulled off the ledge. The Hobbit fastens two ropes to the window frames and draws them back like a slingshot. As he hurls himself through the air, a claw on one of Gandalf's tentacles becomes a sharp javelin. Gandalf extends the javelin-like tentacle towards The Hobbit, but Grandma taps Gandalf on the back with her quilt. The Hobbit seizes the tentacle, and Gandalf liberates Grandma. The Hobbit plunges to her aid, catches her, and they drift and float down the street. The guards aim at Gandalf, who, with bundles of jewels in one claw, vanishes around the edge of the building. The Hobbit touches down with Grandma, tilts his head, then bounces up on a rope. Children swarm to Grandma, while tossing ropes as he goes, The Hobbit glides through the air from building to building across the Mushroom Kingdom. The observatory with its suspended crystal curtain wall stands 95 feet high, and inside it is an orb constructed of carved emerald panels. Frodo is in the bustling observatory and reaches for a snack as someone snatches the last tartlet from a nymph's tray. A duo saunters by, and he lifts his telescope, realizing the cover is still on and removes it, but by that time, the duo has drifted away. Sam's brewed a potion, grabbing the flask and tipping over his goblet as Frodo ambles up to him. The two old comrades gaze challengingly at each other as the Chancellor frowns. All eyes pivot to look at the stairway leading into the observatory where Commander Kirk is in uniform, accompanied by a young pixie walking beside him arm-in-arm. Everyone claps, except Frodo, who notices the young pixie is Arwen in a silver strapless gown, her hair tied up. Arwen gazes at Frodo and turns her head away as he stares, entranced. Later, Frodo threads his way out onto the terrace, where a steward has a plate with one tartlet on it. He stretches for it as someone else swipes it away. Frodo notices Arwen alone, pauses, then steps up behind her. Arwen pivots to face him, and Frodo gulps, his eyes misting up. He watches sorrowfully as Arwen marches away from him, and a nymph passes by as Frodo clutches a wine goblet."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Spider-Man and Octavius sail through a factory skylight, and Spider-Man tickles Octavius' shoulder. Octavius' antennae nudge Spider-Man's elbow and spin him around, causing both men to glide out of the skylight. The fabric of Aunt May's scarf starts to fray, and she slides down on it as Octavius flings Spider-Man across the plaza into a balcony on the building opposite. Aunt May slips further down the scarf, but her hands grip a railing. She peers way down to the pavement, then up at the face of the clock whose ticking hands she's looped her scarf around, before she's tugged off the railing. Spider-Man hooks two nets to the balcony rails and pulls them back like a slingshot. As he propels himself through space, a clamp on one of Octavius' antennae becomes a sharp blade. Octavius extends the blade-like antenna towards Spider-Man, but Aunt May bonks Octavius on the elbow with her scarf. Spider-Man seizes the antenna, and Octavius releases Aunt May. Spider-Man swoops to her aid, catches her, and they glide and glide down the avenue. The police toss confetti at Octavius, who, with sacks of marbles in one clamp, vanishes around the edge of the skyscraper. Spider-Man alights with Aunt May, tilts his head, then springs up on a thread. Kids rush to Aunt May, while spinning threads as he goes, Spider-Man drifts through the heavens from tower to tower across New York City. The observatory with its suspended steel sheet wall stands 95 feet high, and inside it is a dome constructed of crafted copper panels. Peter is in the bustling observatory and reaches for tea as someone nabs the last sandwich from a server's platter. A pair strolls by, and he lifts his binoculars, realizing the lens cap is still on and removes it, but by which time, the pair has strolled away. Harry's poured a soda, grabbing the pitcher and tipping over his cup as Peter wanders up to him. The two old pals gaze stubbornly at each other as the Mayor glowers. All eyes shift to look at the corridor down into the observatory where Captain Jameson is in uniform, accompanied by a young gentleman walking beside him arm-in-arm. Everyone cheers, except Peter, who sees the young gentleman is MJ in a black strapless dress, her hair tied up. MJ glances at Peter and turns her nose away as he stares, enchanted. Later, Peter makes his way out onto the terrace, where a caterer has a platter with one sandwich on it. He reaches for it as someone else snatches it away. Peter spots MJ alone, hesitates, then strides up behind her. MJ turns to face him, and Peter swallows, his eyes misting over. He watches wistfully as MJ marches away from him, and a server passes by as Peter grabs a water glass."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "The astronaut and the inventor collide through a bakery door, and the astronaut pounds the inventor's hat. The inventor's shoelaces wrap around the astronaut's knee and hurl him around, causing both creatures to tumble out of the door. The yarn of Grandma Betsy's scarf begins to fray, and she slides down on it as the inventor flings the astronaut across the river into a hatch in the boat opposite. Grandma Betsy slips further down the scarf, but her hands land on a railing. She glances way up to the sky, then down at the nose of the fountain whose bubbling waters she’s anchored her scarf around, before she’s hoisted off the railing. The astronaut attaches two strings to the hatch handles and pulls them back like a slingshot. As he propels himself through the water, a spoon on one of the inventor's shoelaces transforms into a sharp fork. The inventor extends the fork-like shoelace towards the astronaut, but Grandma Betsy taps the inventor on the shoulder with her scarf. The astronaut seizes the shoelace, and the inventor lets go of Grandma Betsy. The astronaut plummets to her aid, catches her, and they glide and float down the river. The guards throw nets at the inventor, who, with sacks of oranges in one spoon, vanishes around the bend of the bridge. The astronaut alights with Grandma Betsy, tilts his helmet, then bounces up on a vine. Birds swarm to Grandma Betsy, while hurling strings as he sails, the astronaut drifts through the clouds from hill to hill across the countryside. The observatory with its hanging golden velvet curtain wall towers 95 feet wide, and inside it is a cube constructed of polished silver bricks. Tom is in the bustling observatory and grabs for a plate as someone snatches the last pancake from a musician's platter. A trio skips by, and he lifts his binoculars, realizing the lens cover is still attached and removes it, but by which time, the trio has skipped away. Bob's poured a smoothie, grabbing the blender and overturning his cup as Tom strolls up to him. The two longtime rivals glare suspiciously at each other as the Principal frowns. All eyes swivel to peer at the elevator up into the observatory where Sergeant Brown is in a tuxedo, accompanied by a young gentleman strolling beside him arm-in-arm. Everyone cheers, except Tom, who notices the young gentleman is Lucy in a blue sequined gown, her hair braided. Lucy eyes Tom and averts her gaze as he stares, entranced. Later, Tom finds his path onto the terrace, where a juggler has a platter with one pancake on it. He reaches for it as a mime sweeps it away. Tom observes Lucy alone, hesitates, then tiptoes up behind her. Lucy turns to look at him, and Tom swallows, his heart swelling. He watches wistfully as Lucy marches away from him, and a musician passes by as Tom snatches a champagne flute."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Spider-Man and Octavius crash through an office window, engage in a fierce battle, and both fall out. Aunt May perilously hangs from her brolly until Spider-Man intervenes and rescues her. Octavius escapes with stolen money, while Spider-Man ensures Aunt May's safety. Meanwhile, at a planetarium event, Peter navigates a crowded room, fumbling with a camera and missing a canape. He confronts his friend Harry, exchanged tense stares, and notices the arrival of MJ with Captain Jameson. Peter, mesmerized by MJ in a black dress, follows her outside but is heartbroken as she turns away."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "He watches forlornly as MJ strides away from him and a waitress passes by as Peter grabs a cocktail glass MJ turns to face him and Peter gulps his eyes filling up Peter sees MJ alone pauses then walks up behind her He reaches for it as someone else whisks it away Later Peter makes his way out onto the balcony where a server has a tray with one canope on it MJ stares at Peter and turns her head away as he gazes mesmerized Everyone applauds except Peter who sees the young lady is MJ in a black strapless dress her hair tied up arminarm All heads turn to look at the stairway down into the planetarium where Captain Jameson is in uniform accompanied by a young lady walking beside him The two old friends stare defiantly at each other as the Mayor glares Harry's poured a drink snatching the bottle and knocking over his glass as Peter walks up to him A couple walks by and he raises his camera realizing the lens cap is still on and removes it but by which time the couple has walked away Peter is in the crowded planetarium and reaches for food as someone grabs the last canope from a waitress's tray The planetarium with its suspended glass curtain wall stands 95 feet high and inside it is a sphere constructed of fabricated aluminum panels SpiderMan sweeps through the skies from building to building across New York City Girls flock to Aunt May while firing webs as he goes Aunt May cocks his head then leaps up on a web SpiderMan lands with The police fire at Octavius who with bags of money in one pincer disappears around the corner of the building SpiderMan dives to her rescue catches her and they swoop and swing down the street SpiderMan grabs the limb and Octavius releases Aunt May Octavius stretches out the spearlike limb towards SpiderMan but Aunt May smacks Octavius on the head with her brolly As he launches himself through the air a pincer on one of Octavius' limbs becomes a pointed spear SpiderMan sticks two webs to the window frames and stretches them back like a catapult She looks way down to the ground then up at the face of the statue whose outstretched arms she is hooked her brolly around before she is lifted off the ledge Aunt May slips further down the brolly but her feet land on a ledge The material of Aunt May's brolly starts to tear and she slips down on it as Octavius tosses SpiderMan across the street into a window in the block opposite Octavius' limbs grab SpiderMan's head and toss him about causing both men to fall out of the window SpiderMan and Octavius crash through an office window and SpiderMan pummels Octavius' face"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Harry's poured a drink snatching the bottle and knocking over his glass as Peter walks up to him SpiderMan sweeps through the skies from building to building across New York City The police fire at Octavius who with bags of money in one pincer disappears around the corner of the building Everyone applauds except Peter who sees the young lady is MJ in a black strapless dress her hair tied up arminarm As he launches himself through the air a pincer on one of Octavius' limbs becomes a pointed spear SpiderMan sticks two webs to the window frames and stretches them back like a catapult Aunt May cocks his head then leaps up on a web SpiderMan lands with The planetarium with its suspended glass curtain wall stands 95 feet high and inside it is a sphere constructed of fabricated aluminum panels SpiderMan dives to her rescue catches her and they swoop and swing down the street Later Peter makes his way out onto the balcony where a server has a tray with one canope on it The two old friends stare defiantly at each other as the Mayor glares He watches forlornly as MJ strides away from him and a waitress passes by as Peter grabs a cocktail glass Peter is in the crowded planetarium and reaches for food as someone grabs the last canope from a waitress's tray Peter sees MJ alone pauses then walks up behind her Octavius' limbs grab SpiderMan's head and toss him about causing both men to fall out of the window Girls flock to Aunt May while firing webs as he goes The material of Aunt May's brolly starts to tear and she slips down on it as Octavius tosses SpiderMan across the street into a window in the block opposite A couple walks by and he raises his camera realizing the lens cap is still on and removes it but by which time the couple has walked away MJ turns to face him and Peter gulps his eyes filling up She looks way down to the ground then up at the face of the statue whose outstretched arms she is hooked her brolly around before she is lifted off the ledge He reaches for it as someone else whisks it away Octavius stretches out the spearlike limb towards SpiderMan but Aunt May smacks Octavius on the head with her brolly SpiderMan grabs the limb and Octavius releases Aunt May MJ stares at Peter and turns her head away as he gazes mesmerized SpiderMan and Octavius crash through an office window and SpiderMan pummels Octavius' face Aunt May slips further down the brolly but her feet land on a ledge All heads turn to look at the stairway down into the planetarium where Captain Jameson is in uniform accompanied by a young lady walking beside him"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "The planetarium with its suspended glass curtain wall stands 95 feet high and inside it is a sphere constructed of fabricated aluminum panels Peter is in the crowded planetarium and reaches for food as someone grabs the last canope from a waitress's tray A couple walks by and he raises his camera realizing the lens cap is still on and removes it but by which time the couple has walked away Harry's poured a drink snatching the bottle and knocking over his glass as Peter walks up to him The two old friends stare defiantly at each other as the Mayor glares All heads turn to look at the stairway down into the planetarium where Captain Jameson is in uniform accompanied by a young lady walking beside him arminarm Everyone applauds except Peter who sees the young lady is MJ in a black strapless dress her hair tied up MJ stares at Peter and turns her head away as he gazes mesmerized Later Peter makes his way out onto the balcony where a server has a tray with one canope on it He reaches for it as someone else whisks it away Peter sees MJ alone pauses then walks up behind her MJ turns to face him and Peter gulps his eyes filling up He watches forlornly as MJ strides away from him and a waitress passes by as Peter grabs a cocktail glass SpiderMan and Octavius crash through an office window and SpiderMan pummels Octavius' face Octavius' limbs grab SpiderMan's head and toss him about causing both men to fall out of the window The material of Aunt May's brolly starts to tear and she slips down on it as Octavius tosses SpiderMan across the street into a window in the block opposite Aunt May slips further down the brolly but her feet land on a ledge She looks way down to the ground then up at the face of the statue whose outstretched arms she is hooked her brolly around before she is lifted off the ledge SpiderMan sticks two webs to the window frames and stretches them back like a catapult As he launches himself through the air a pincer on one of Octavius' limbs becomes a pointed spear Octavius stretches out the spearlike limb towards SpiderMan but Aunt May smacks Octavius on the head with her brolly SpiderMan grabs the limb and Octavius releases Aunt May SpiderMan dives to her rescue catches her and they swoop and swing down the street The police fire at Octavius who with bags of money in one pincer disappears around the corner of the building SpiderMan lands with Aunt May cocks his head then leaps up on a web Girls flock to Aunt May while firing webs as he goes SpiderMan sweeps through the skies from building to building across New York City"
        }
      ]
    }
  ]
}