{
  "ground_truth": "Peter frees himself and punctures Venom. They fall off the web and plummet down the side of the skyscraper, trading kicks and blows as they descend the lift shaft. Peter tries to pull his mask back on but drops it, managing to fire a thread just before hitting the ground. He lands in a deserted construction site, his suit ripped and torn. He retrieves his mask and looks up sharply as the truck starts dropping towards the cab. Mary Jane leaps out of the cab just before the truck hits it and clings to the web. The sandy ground shakes, knocking Spider-Man over, and Sandman rises from a moving mountain of sand, towering over the cowering crowd like a colossus. The crowd scatters as Sandman's massive fist slams into the ground, narrowly missing Spider-Man, who looks up at Mary Jane clinging to the web. Spider-Man dodges Sandman's truck-sized foot, whizzing past the giant on threads while Sandman swats at him. Mary Jane loses her grip, landing on the lower section of webs exposed like a sacrificial victim, watching Spider-Man hurtling towards her. Venom leaps out at Spider-Man, knocking him into a column of girders that he bounces against as he falls. He lands on a horizontal girder and turns to face Sandman, who towers over him. Venom, standing beneath the girder, fires a thread down Spider-Man's neck and pulls him onto his back, garroting him as Sandman prepares to smash him. Spider-Man desperately reaches out a hand to free himself. The web holding the cab above Mary Jane starts to break as Spider-Man is pummeled by Sandman's fist, his mask torn. Peter stretches out his hand towards Mary Jane, who looks down helplessly as Sandman smashes his fist down on Peter, whose hand hangs limply at his side. Sandman rears up for another blow, but a pumpkin bomb is fired into the side of his head, blowing half of it away and leaving the rest looking like burning coals. A searchlight reveals the new goblin gliding through the air on his sky stick. He sends Venom flying through some walls with a flick of his sky stick. With his mask peeling back to reveal Harry's disfigured face, he glides alongside the battered Peter.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Sure, here's your text with synonyms applied:\n\nPeter liberates himself and pierces Venom. They tumble off the mesh and plunge down the flank of the skyscraper, exchanging kicks and strikes as they descend the elevator shaft. Peter attempts to pull his mask back on but lets it fall, managing to discharge a filament just before striking the ground. He lands in a vacant construction site, his costume ripped and shredded. He recovers his mask and glances up sharply as the lorry starts dropping towards the cab. Mary Jane springs out of the cab just before the lorry impacts it and clings to the web. The sandy terrain trembles, knocking Spider-Man over, and Sandman emerges from a shifting hill of sand, towering over the shrinking crowd like a giant. The crowd disperses as Sandman's enormous fist crashes into the ground, narrowly missing Spider-Man, who looks up at Mary Jane clinging to the web. Spider-Man evades Sandman's truck-sized foot, whizzing past the giant on filaments while Sandman swats at him. Mary Jane loses her grip, landing on the lower portion of webs exposed like a sacrificial victim, watching Spider-Man hurtling towards her. Venom springs out at Spider-Man, knocking him into a column of girders that he bounces against as he falls. He lands on a horizontal girder and turns to face Sandman, who towers over him. Venom, standing beneath the girder, fires a filament down Spider-Man's neck and pulls him onto his back, throttling him as Sandman prepares to smash him. Spider-Man desperately reaches out a hand to liberate himself. The web holding the cab above Mary Jane starts to break as Spider-Man is battered by Sandman's fist, his mask torn. Peter stretches out his hand towards Mary Jane, who looks down helplessly as Sandman smashes his fist down on Peter, whose hand hangs limply at his side. Sandman rears up for another blow, but a pumpkin bomb is fired into the side of his head, blowing half of it away and leaving the rest looking like burning coals. A searchlight reveals the new goblin gliding through the air on his sky stick. He sends Venom flying through some walls with a flick of his sky stick. With his mask peeling back to reveal Harry's disfigured face, he glides alongside the battered Peter."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Peter frees himself and Venom is punctured by him. The web is fallen off by them and they plummet down the side of the skyscraper, kicks and blows are traded by them as the lift shaft is descended by them. Peter tries to pull his mask back on but it is dropped by him, managing to fire a thread just before the ground is hit. A deserted construction site is landed in by him, his suit ripped and torn. His mask is retrieved and he looks up sharply as the truck starts dropping towards the cab. Mary Jane leaps out of the cab just before it is hit by the truck and she clings to the web. The sandy ground shakes, knocking Spider-Man over, and Sandman rises from a moving mountain of sand, towering over the crowd who cowers like a colossus. Sandman's massive fist slams into the ground, narrowly missing Spider-Man, as the crowd scatters, and he looks up at Mary Jane clinging to the web. Sandman's truck-sized foot is dodged by Spider-Man, whizzing past the giant on threads while Sandman swats at him. Mary Jane loses her grip, landing on the lower section of webs exposed like a sacrificial victim, and she watches Spider-Man hurtling towards her. Spider-Man is leapt at by Venom, knocking him into a column of girders that he bounces against as he falls. He lands on a horizontal girder and Sandman is faced by him, who towers over him. Venom, standing beneath the girder, fires a thread down Spider-Man's neck and pulls him onto his back, garroting him as Sandman prepares to smash him. A hand is desperately reached out by Spider-Man to free himself. The web holding the cab above Mary Jane starts to break as Sandman's fist pummels Spider-Man, his mask torn. Peter stretches out his hand towards Mary Jane, who looks down helplessly as Peter is hit by Sandman's fist, his hand hanging limply at his side. Sandman rears up for another blow, but the side of his head is fired into by a pumpkin bomb, blowing half of it away and leaving the rest looking like burning coals. The new goblin is revealed by a searchlight gliding through the air on his sky stick. Venom is sent flying through some walls by him with a flick of his sky stick. His mask peels back to reveal Harry's disfigured face, and alongside the battered Peter, he glides."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Peter frees himself and punctures Venom. They fall and exchange blows as they descend the skyscraper's lift shaft. Peter tries to put on his mask but drops it, firing a thread just before hitting a deserted construction site. With his suit torn, he retrieves his mask and sees a truck falling toward the cab. Mary Jane leaps out before the truck crashes and clings to the web. The ground shakes as Sandman emerges, towering like a colossus. The crowd scatters when Sandman's massive fist slams down, narrowly missing Spider-Man, who looks at Mary Jane. Spider-Man dodges Sandman's foot, swinging past him while Sandman swats at him. Mary Jane loses her grip and lands on a lower web section, watching Spider-Man approach. Venom attacks, knocking Spider-Man into girders before he lands on another girder facing Sandman. Venom pulls Spider-Man onto his back as Sandman prepares to smash him. Spider-Man struggles to free himself as the web above Mary Jane starts breaking. Sandman pummels Spider-Man as he reaches towards Mary Jane, his hand hanging limp. Sandman prepares another blow, but a pumpkin bomb strikes his head, leaving it like burning coals. A searchlight reveals the new goblin on his sky stick, sending Venom flying and gliding alongside the battered Peter."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Peter frees himself, punctures Venom, and they fall, trading blows as they descend a skyscraper's lift shaft. Peter drops his mask but fires a thread before landing in a deserted construction site with his suit torn. He retrieves his mask as a truck starts dropping. Mary Jane leaps from the cab, clinging to the web. Sandman rises, scattering the crowd, and narrowly misses Spider-Man with a massive fist. Spider-Man dodges Sandman's foot, while Mary Jane loses grip, landing on exposed webs. Venom knocks Spider-Man into girders, and he faces Sandman. Venom garrotes him, but Spider-Man reaches to free himself as the web above Mary Jane breaks. Sandman prepares another blow, but a pumpkin bomb from the new goblin blows half his head away. The goblin, revealed as Harry, sends Venom flying, gliding alongside Peter."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Peter, in a moment of determination and self-preservation, manages to free himself and effectively punctures Venom. As a result, they both fall from the webbing and begin to plummet rapidly down the towering side of the skyscraper, exchanging fierce kicks and vicious blows as they tumble down the lift shaft. Amidst the chaos, Peter makes a valiant attempt to pull his mask back on but unfortunately drops it, managing just in time to fire a web thread that cushions his fall right before he hits the unforgiving ground. He finds himself in a deserted construction site, his suit now left in tatters, ripped and torn. Spotting his fallen mask, he quickly retrieves it and then swiftly looks up with urgency as a truck ominously begins its descent toward the cab. \n\nIn a moment of sheer bravery, Mary Jane makes a daring leap out of the cab just moments before the truck crashes into it, clinging desperately to the web for safety. The sandy ground beneath them trembles violently, causing Spider-Man to be knocked off balance. Sandman, now emerging from the shifting mountain of sand, looms overhead like a colossal figure over the frightened crowd below. Panic ensues as the crowd scatters in all directions, narrowly avoiding Sandman's gigantic fist as it slams into the ground, barely missing Spider-Man. Peter, with a quick glance upwards, sees Mary Jane clinging precariously to the web. He skillfully dodges Sandman's massive, truck-sized foot, skillfully whizzing past the colossal figure on his agile threads while Sandman attempts to swat him away like a bothersome insect.\n\nSuddenly, Mary Jane loses her grip, and she descends onto the lower section of the webs, exposed and vulnerable as if laid out like a sacrificial victim, her eyes fixed on Spider-Man who hurtles towards her with great speed. Out of nowhere, Venom makes a sudden leap towards Spider-Man, knocking him into a nearby column of girders, against which he bounces as he falls. Landing on a horizontal girder, Spider-Man quickly turns to face the towering Sandman, who stands imposingly above him. Venom, lurking beneath the girder, fires a menacing thread that snakes down Spider-Man's neck, pulling him down onto his back and garroting him as Sandman prepares to deliver a devastating blow. Desperate to free himself, Spider-Man reaches out a hand in a frantic attempt. Meanwhile, the web holding the cab precariously above Mary Jane begins to fray and weaken as Spider-Man is relentlessly pummeled by Sandman's immense fist, his mask torn and tattered. \n\nPeter stretches his hand out towards Mary Jane, who gazes down helplessly as Sandman prepares to smash his fist down on Peter once more, leaving Peter's hand hanging limply at his side. As Sandman rears up for another crushing blow, a pumpkin bomb is suddenly fired into the side of Sandman's head, tearing half of it away and leaving behind a fiery, coal-like visage. A searchlight illuminates the area, revealing the new goblin gliding expertly through the air on his advanced sky stick. With a flick of his sky stick, the new goblin sends Venom flying through several walls. As his mask peels back, revealing the disfigured face of Harry, he glides gracefully alongside the battered and beleaguered Peter."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "In a moment filled with determination and the instinct for self-preservation, Peter finds the strength within himself to break free and, with precision, effectively punctures Venom. Consequently, both adversaries tumble from the webbing and begin to descend rapidly down the towering, vertiginous side of the skyscraper, exchanging fierce kicks and delivering vicious blows as they plummet down the seemingly bottomless lift shaft. Amidst the ensuing chaos, Peter valiantly attempts to pull his mask back on but, unfortunately, loses his grip, the mask slipping from his grasp. Just in time, he manages to shoot a web thread, cushioning his fall mere moments before he meets the unforgiving ground below. He lands in the midst of a deserted construction site, his suit now in tatters, ripped and torn to shreds. Spotting his fallen mask nearby, he swiftly retrieves it, quickly looking up with an urgency as a truck ominously begins its descent toward the cab.\n\nIn a breathtaking moment of sheer bravery, Mary Jane executes a daring leap from the cab, mere moments before the truck crashes into it, and clings desperately to the web for safety. The sandy ground beneath them trembles violently as Spider-Man, struggling to maintain his balance, is knocked off his feet. From a shifting mountain of sand, Sandman emerges, towering overhead like a colossal figure, striking fear into the hearts of the frightened crowd below. Panic spreads rapidly as the crowd scatters in all directions, narrowly avoiding disaster as Sandman's gigantic fist slams into the ground, scarcely missing Spider-Man. Peter casts a quick glance upwards, spotting Mary Jane clinging precariously to the web. With agility and skill, he dodges Sandman's massive, truck-sized foot, skillfully whizzing past the colossal figure on his nimble threads, while Sandman, resembling a giant swatting at an annoying insect, attempts to swat him away.\n\nSuddenly, Mary Jane loses her grip, descending onto the lower section of the webs, exposed and vulnerable, like a sacrificial victim laid bare. Her eyes remain fixed on Spider-Man, who hurtles towards her with great and undeniable speed. Out of the blue, Venom leaps towards Spider-Man with ferocity, knocking him into a nearby column of girders, against which he bounces as he falls. Landing on a horizontal girder, Spider-Man quickly turns to confront the towering Sandman, who imposingly stands above him. Venom, lurking beneath the girder, fires a menacing, snake-like thread that winds its way around Spider-Man's neck, pulling him down onto his back and garroting him as Sandman prepares to deliver a devastating, bone-crushing blow. Desperate to free himself, Spider-Man extends a hand in a frantic attempt to escape. Meanwhile, the web holding the cab precariously above Mary Jane begins to fray and weaken, as Spider-Man is relentlessly pummeled by Sandman's immense, crushing fist, his mask now torn and tattered.\n\nPeter stretches his hand toward Mary Jane, who gazes down helplessly, her fear palpable, as Sandman prepares to smash his massive fist down on Peter once more, leaving Peter's hand hanging limply at his side. As Sandman rears up for another crushing blow, a pumpkin bomb is suddenly fired with precision into the side of Sandman's head, tearing half of it away and leaving behind a fiery, coal-like visage. A searchlight brilliantly illuminates the area, revealing the new goblin expertly gliding through the air on his advanced sky stick. With a deft flick of his sky stick, the new goblin sends Venom hurtling through several walls. As his mask peels back, revealing Harry's disfigured face, he glides gracefully to Peter's side, who is battered and beleaguered, offering him a brief but much-needed respite from the relentless assault."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Peter struggles intensely to free himself from Venom's grip and, with a decisive motion, successfully punctures Venom. The sudden release sends both Peter and Venom tumbling off the web, causing them to plunge down the side of the skyscraper while they exchange rapid kicks and blows in a relentless descent through the lift shaft. Amid the chaos, Peter attempts to pull his mask back onto his face, but in the flurry, he loses his grip and drops it. With quick reflexes, he manages to shoot a thread of web at the last possible moment before hitting the ground, landing in a deserted construction site with his suit visibly ripped and torn from the skirmish. He quickly spots his fallen mask, retrieves it from the ground, and looks up sharply just as a truck begins its swift descent towards the cab. Mary Jane makes a daring leap from the cab just in time, clinging desperately to the web for safety. As the sandy ground shifts and trembles beneath them, knocking Spider-Man off his balance, Sandman emerges, rising from an enormous moving mass of sand, towering imposingly over the crowd who cower at the sight of the colossal figure. Panic ensues as the crowd scatters in every direction when Sandman's massive fist crashes into the earth, narrowly missing Spider-Man by mere inches. Spider-Man, with a quick glance upwards at Mary Jane who clings to the web, deftly dodges Sandman's truck-sized foot, swinging past the giant on his webs as Sandman swats forcefully at him. In a moment of panic, Mary Jane loses her grip and lands on a lower section of the webs, sprawled out and vulnerable. She watches in anxiety as Spider-Man hurtles towards her. Suddenly, Venom lunges out, colliding with Spider-Man and sending him sprawling into a column of girders. He bounces off them as he falls, eventually landing on a horizontal girder and immediately turning to confront the towering Sandman. Venom, positioned below the girder, takes advantage of Spider-Man's position by shooting a thread down Spider-Man's neck, pulling him onto his back in a choking grip. Meanwhile, Sandman prepares to deliver a devastating blow. Spider-Man, in a desperate attempt to save himself, stretches out a hand to break free. The web supporting the cab above Mary Jane begins to fray and break apart as Spider-Man is pummeled brutally by Sandman's massive fist, tearing his mask in the process. Peter extends his hand in a futile reach towards Mary Jane, who stares down helplessly while Sandman prepares to strike once more. Just as Sandman raises his fist for another crushing blow, a pumpkin bomb is unexpectedly launched into the side of Sandman’s head, blowing away half of it and leaving the remaining fragments resembling smoldering coals. A searchlight sweeps across the scene, revealing the new goblin gliding through the air on his sky stick. With a deft maneuver, the goblin sends Venom hurtling through a series of walls with a flick of his sky stick. As his mask peels back, revealing Harry's disfigured face, he glides alongside the battered Peter, offering a momentary semblance of alliance amidst the chaos."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Peter frees himself and punctures Venom as they fall off the web and descend the skyscraper, exchanging kicks and blows in the lift shaft. Attempting to pull his mask on, Peter drops it but manages to fire a thread just before landing in a deserted construction site, his suit torn. Retrieving his mask, he looks up as the truck starts dropping towards the cab. Mary Jane leaps out just in time, clinging to the web. The ground shakes, knocking Spider-Man over as Sandman rises from a massive sand formation, towering over the crowd. The crowd scatters as Sandman's fist narrowly misses Spider-Man, who dodges the giant and observes Mary Jane hanging from the web. Spider-Man evades Sandman's attacks while swinging through the air. Mary Jane loses her grip, landing vulnerably on the web below as Spider-Man rushes toward her. Venom intercepts Spider-Man, knocking him into a column of girders before he lands on a horizontal one facing Sandman. Venom, below Spider-Man, pulls him down and begins to garrote him as Sandman prepares to strike. Spider-Man struggles to free himself, stretching his hand toward Mary Jane as the cab web starts to break. Sandman's assault leaves Peter's mask torn and his hand limp. Just as Sandman rears for another blow, a pumpkin bomb hits, blasting Sandman's head and revealing a burning coal-like appearance. A searchlight reveals the new goblin gliding on his sky stick, sending Venom flying through walls and revealing Harry's disfigured face as he glides alongside the weary Peter."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Peter, in an epic clash amidst the New York skyline, frees himself and punctures Venom, who is a formidable foe due to his alien symbiote powers. They fall off the web and plummet down the side of the skyscraper, a towering monolith of glass and steel, trading kicks and blows as they descend the lift shaft. Peter, known to the world as Spider-Man, tries to pull his mask back on but drops it, managing to fire a thread just before hitting the ground. He lands in a deserted construction site in Manhattan, his suit ripped and torn. He retrieves his mask and looks up sharply as the weighty demolition truck starts dropping towards the cab. Mary Jane, his long-time love interest, leaps out of the cab just before the truck hits it and clings to the web. The sandy ground, disrupted by recent excavation work, shakes, knocking Spider-Man over, and Sandman, a villain created from a genetic experiment gone wrong, rises from a moving mountain of sand, towering over the cowering crowd like a colossus. The crowd, a mix of construction workers and onlookers, scatters as Sandman's massive fist slams into the ground, narrowly missing Spider-Man, who looks up at Mary Jane clinging to the web. Spider-Man dodges Sandman's truck-sized foot, whizzing past the giant on threads, a signature move honed through years of fighting crime, while Sandman swats at him. Mary Jane loses her grip, landing on the lower section of webs exposed like a sacrificial victim, watching Spider-Man hurtling towards her. \n\nVenom, whose host Eddie Brock harbors a violent grudge against Peter, leaps out at Spider-Man, knocking him into a column of girders that he bounces against as he falls. He lands on a horizontal girder high above the ground and turns to face Sandman, who towers over him with his shifting, almost indestructible body. Venom, standing beneath the girder, fires a thread down Spider-Man's neck and pulls him onto his back, garroting him as Sandman prepares to smash him. Spider-Man desperately reaches out a hand to free himself. The web holding the cab above Mary Jane starts to break as Spider-Man is pummeled by Sandman's fist, his mask torn. Peter stretches out his hand towards Mary Jane, who looks down helplessly as Sandman smashes his fist down on Peter, whose hand hangs limply at his side. Sandman rears up for another blow, but a pumpkin bomb, a signature weapon from the Green Goblin's arsenal, is fired into the side of his head, blowing half of it away and leaving the rest looking like burning coals. A searchlight reveals the new goblin, Harry Osborn, gliding through the air on his sky stick, a high-tech hoverboard. He sends Venom flying through some walls with a flick of his sky stick, showcasing his enhanced strength. With his mask peeling back to reveal Harry's disfigured face, he glides alongside the battered Peter, united in an uneasy alliance against their mutual foes."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Peter stretches out his hand towards Mary Jane who looks down helplessly as Sandman smashes his fist down on Peter whose hand hangs limply at his side watching SpiderMan hurtling towards her Peter frees himself and punctures Venom He retrieves his mask and looks up sharply as the truck starts dropping towards the cab The crowd scatters as Sandman's massive fist slams into the ground narrowly missing SpiderMan who looks up at Mary Jane clinging to the web They fall off the web and plummet down the side of the skyscraper trading kicks and blows as they descend the lift shaft He lands in a deserted construction site his suit ripped and torn Venom leaps out at SpiderMan knocking him into a column of girders that he bounces against as he falls They fall off the web and plummet down the side of the skyscraper trading kicks and blows as they descend the lift shaft Peter tries to pull his mask back on but drops it managing to fire a thread just before hitting the ground He lands in a deserted construction site his suit ripped and torn He retrieves his mask and looks up sharply as the truck starts dropping towards the cab SpiderMan desperately reaches out a hand to free himself Mary Jane leaps out of the cab just before the truck hits it and clings to the web The sandy ground shakes knocking SpiderMan over and Sandman rises from a moving mountain of sand towering over the cowering crowd like a colossus The crowd scatters as Sandman's massive fist slams into the ground narrowly missing SpiderMan who looks up at Mary Jane clinging to the web SpiderMan dodges Sandman's trucksized foot whizzing past the giant on threads while Sandman swats at him Mary Jane loses her grip landing on the lower section of webs exposed like a sacrificial victim watching SpiderMan hurtling towards her Venom leaps out at SpiderMan knocking him into a column of girders that he bounces against as he falls SpiderMan dodges Sandman's trucksized foot whizzing past the giant on threads while Sandman swats at him He lands on a horizontal girder and turns to face Sandman who towers over him Venom standing beneath the girder fires a thread down SpiderMan's neck and pulls him onto his back garroting him as Sandman prepares to smash him SpiderMan desperately reaches out a hand to free himself The web holding the cab above Mary Jane starts to break as SpiderMan is pummeled by Sandman's fist his mask torn Peter frees himself and punctures Venom He sends Venom flying through some walls with a flick of his sky stick Peter stretches out his hand towards Mary Jane who looks down helplessly as Sandman smashes his fist down on Peter whose hand hangs limply at his side Sandman rears up for another blow but a pumpkin bomb is fired into the side of his head blowing half of it away and leaving the rest looking like burning coals A searchlight reveals the new goblin gliding through the air on his sky stick He sends Venom flying through some walls with a flick of his sky stick With his mask peeling back to reveal Harry's disfigured face he glides alongside the battered Peter"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Peter frees himself and punctures Venom. They fall off the web and plummet down the side of the skyscraper trading kicks and blows as they descend the lift shaft. Peter tries to pull his mask back on but drops it managing to fire a thread just before hitting the ground. He lands in a deserted construction site his suit ripped and torn. He retrieves his mask and looks up sharply as the truck starts dropping towards the cab. Mary Jane leaps out of the cab just before the truck hits it and clings to the web. The sandy ground shakes knocking SpiderMan over and Sandman rises from a moving mountain of sand towering over the cowering crowd like a colossus. The crowd scatters as Sandman's massive fist slams into the ground narrowly missing SpiderMan who looks up at Mary Jane clinging to the web. SpiderMan dodges Sandman's trucksized foot whizzing past the giant on threads while Sandman swats at him. Mary Jane loses her grip landing on the lower section of webs exposed like a sacrificial victim. watching SpiderMan hurtling towards her. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Venom leaps out at SpiderMan knocking him into a column of girders that he bounces against as he falls. He lands on a horizontal girder and turns to face Sandman who towers over him. Venom standing beneath the girder fires a thread down SpiderMan's neck and pulls him onto his back garroting him as Sandman prepares to smash him. SpiderMan desperately reaches out a hand to free himself. The web holding the cab above. Mary Jane starts to break as SpiderMan is pummeled by Sandman's fist his mask torn. Peter stretches out his hand towards Mary Jane who looks down helplessly as Sandman smashes his fist down on Peter whose hand hangs limply at his side. Sandman rears up for another blow but a pumpkin bomb is fired into the side of his head blowing half of it away and leaving the rest looking like burning coals. A searchlight reveals the new goblin gliding through the air on his sky stick. He sends Venom flying through some walls with a flick of his sky stick. With his mask peeling back to reveal Harry's disfigured face he glides alongside the battered Peter."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Peter frees himself and punctures Venom. They fall off the web and plummet down the side of the skyscraper trading kicks and blows as they descend the lift shaft. Peter tries to pull his mask back on but drops it managing to fire a thread just before hitting the ground. He lands in a deserted construction site his suit ripped and torn. He retrieves his mask and looks up sharply as the truck starts dropping towards the cab. Mary Jane leaps out of the cab just before the truck hits it and clings to the web. The sandy ground shakes knocking SpiderMan over and Sandman rises from a moving mountain of sand towering over the cowering crowd like a colossus. The crowd scatters as Sandman's massive fist slams into the ground narrowly missing SpiderMan who looks up at Mary Jane clinging to the web. SpiderMan dodges Sandman's trucksized foot whizzing past the giant on threads while Sandman swats at him. Mary Jane loses her grip landing on the lower section of webs exposed like a sacrificial victim. watching SpiderMan hurtling towards her. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Venom leaps out at SpiderMan knocking him into a column of girders that he bounces against as he falls. He lands on a horizontal girder and turns to face Sandman who towers over him. Venom standing beneath the girder fires a thread down SpiderMan's neck and pulls him onto his back garroting him as Sandman prepares to smash him. SpiderMan desperately reaches out a hand to free himself. The web holding the cab above. Mary Jane starts to break as SpiderMan is pummeled by Sandman's fist his mask torn. Peter stretches out his hand towards Mary Jane who looks down helplessly as Sandman smashes his fist down on Peter whose hand hangs limply at his side. Sandman rears up for another blow but a pumpkin bomb is fired into the side of his head blowing half of it away and leaving the rest looking like burning coals. A searchlight reveals the new goblin gliding through the air on his sky stick. He sends Venom flying through some walls with a flick of his sky stick. With his mask peeling back to reveal Harry's disfigured face he glides alongside the battered Peter."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Peter frees himself and punctures Venom. They fall off the web and plummet down the side of the skyscraper trading kicks and blows as they descend the lift shaft. Peter tries to pull his mask back on but drops it managing to fire a thread just before hitting the ground. He lands in a deserted construction site his suit ripped and torn. He retrieves his mask and looks up sharply as the truck starts dropping towards the cab. Mary Jane leaps out of the cab just before the truck hits it and clings to the web. Peter stretches out his hand towards Mary Jane who looks down helplessly as Sandman smashes his fist down on Peter whose hand hangs limply at his side. Sandman rears up for another blow but a pumpkin bomb is fired into the side of his head blowing half of it away and leaving the rest looking like burning coals. A searchlight reveals the new goblin gliding through the air on his sky stick. He sends Venom flying through some walls with a flick of his sky stick. With his mask peeling back to reveal Harry's disfigured face he glides alongside the battered Peter."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Peter frees himself and punctures Venom. They fall off the web and plummet down the side of the skyscraper trading kicks and blows as they descend the lift shaft. Peter tries to pull his mask back on but drops it managing to fire a thread just before hitting the ground. He sends Venom flying through some walls with a flick of his sky stick. With his mask peeling back to reveal Harry's disfigured face he glides alongside the battered Peter."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The squirrel frees himself and punctures a leaf. They fall off the web and plummet down the side of the skyscraper, trading kicks and blows as they descend the lift shaft. The squirrel tries to pull his mask back on but drops it, managing to fire a thread just before hitting the ground. The squirrel lands in a deserted construction site, his suit ripped and torn. He retrieves his mask and looks up sharply as the bicycle starts dropping towards the cab. The parrot leaps out of the cab just before the bicycle hits it and clings to the web. The sandy ground shakes, knocking the rabbit over, and the pepperoni slices rise from a moving mountain of sand, towering over the cowering crowd like a colossus. The crowd scatters as the pepperoni's massive fist slams into the ground, narrowly missing the rabbit, who looks up at the parrot clinging to the web. The rabbit dodges the pepperoni's truck-sized foot, whizzing past the giant on threads while the pepperoni swats at him. The parrot loses her grip, landing on the lower section of webs exposed like a sacrificial victim, watching the rabbit hurtling towards her. The cheese leaps out at the rabbit, knocking him into a column of girders that he bounces against as he falls. He lands on a horizontal girder and turns to face the pepperoni, who towers over him. The cheese, standing beneath the girder, fires a thread down the rabbit's neck and pulls him onto his back, garroting him as the pepperoni prepares to smash him. The rabbit desperately reaches out a hand to free himself. The web holding the cab above the parrot starts to break as the rabbit is pummeled by the pepperoni's fist, his mask torn. The squirrel stretches out his hand towards the parrot, who looks down helplessly as the pepperoni smashes his fist down on the squirrel, whose hand hangs limply at his side. The pepperoni rears up for another blow, but a pumpkin bomb is fired into the side of his head, blowing half of it away and leaving the rest looking like burning coals. A searchlight reveals the dog gliding through the air on his sky stick. He sends the cheese flying through some walls with a flick of his sky stick. With his mask peeling back to reveal the cat's disfigured face, he glides alongside the battered squirrel."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Peter frees himself and punctures Venom. They fall off the ferris wheel and plummet down the side of the lighthouse, trading kicks and blows as they descend the elevator shaft. Peter tries to pull his scarf back on but drops it, managing to fire a vine just before hitting the riverbank. He lands in a deserted junkyard, his outfit ripped and torn. He retrieves his scarf and looks up sharply as the helicopter starts dropping towards the cockpit. Mary Jane leaps out of the cockpit just before the helicopter hits it and clings to the vine. The muddy ground shakes, knocking Spider-Man over, and Sandman rises from a rolling hill of gravel, towering over the cowering crowd like a colossus. The crowd scatters as Sandman's massive branch slams into the ground, narrowly missing Spider-Man, who looks up at Mary Jane clinging to the vine. Spider-Man dodges Sandman's car-sized boot, whizzing past the giant on vines while Sandman swats at him. Mary Jane loses her grip, landing on the lower section of vines exposed like a sacrificial victim, watching Spider-Man hurtling towards her. Venom leaps out at Spider-Man, knocking him into a stack of crates that he bounces against as he falls. He lands on a horizontal pipe and turns to face Sandman, who towers over him. Venom, standing beneath the pipe, fires a vine down Spider-Man's neck and pulls him onto his back, garroting him as Sandman prepares to smash him. Spider-Man desperately reaches out a hand to free himself. The vine holding the cockpit above Mary Jane starts to break as Spider-Man is pummeled by Sandman's branch, his scarf torn. Peter stretches out his hand towards Mary Jane, who looks down helplessly as Sandman smashes his branch down on Peter, whose hand hangs limply at his side. Sandman rears up for another blow, but a pineapple grenade is fired into the side of his head, blowing half of it away and leaving the rest looking like burning coals. A flashlight reveals the new goblin gliding through the air on his hoverboard. He sends Venom flying through some sheds with a flick of his hoverboard. With his scarf peeling back to reveal Harry's disfigured face, he glides alongside the battered Peter."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Peter liberates himself and stabs Venom. They detach from the web and soar down the side of the skyscraper, exchanging shoves and slaps as they descend the lift shaft. Peter attempts to retrieve his mask but misplaces it, managing to launch a thread just before striking the ground. He arrives in a deserted construction site, his suit frayed and worn. He fetches his mask and gazes up sharply as the truck starts rolling towards the cab. Mary Jane jumps out of the cab just before the truck collides with it and hangs on to the web. The sandy ground vibrates, toppling Spider-Man over, and Sandman emerges from a shifting mound of sand, looming over the cowering crowd like a giant. The crowd disperses as Sandman's enormous fist crashes into the ground, narrowly avoiding Spider-Man, who glances up at Mary Jane hanging on to the web. Spider-Man evades Sandman's truck-sized foot, zipping past the giant on threads while Sandman bats at him. Mary Jane loses her hold, settling on the lower section of webs exposed like a sacrificial victim, observing Spider-Man dashing towards her. Venom springs out at Spider-Man, thrusting him into a column of girders that he ricochets against as he falls. He rests on a horizontal girder and turns to confront Sandman, who looms over him. Venom, positioned beneath the girder, launches a thread down Spider-Man's neck and drags him onto his back, strangling him as Sandman plans to crush him. Spider-Man frantically extends a hand to rescue himself. The web supporting the cab above Mary Jane begins to unravel as Spider-Man is battered by Sandman's fist, his mask shredded. Peter extends his hand towards Mary Jane, who gazes down helplessly as Sandman crashes his fist down on Peter, whose hand dangles limply at his side. Sandman draws back for another strike, but a pumpkin bomb is thrown into the side of his head, blasting half of it away and leaving the remainder resembling glowing embers. A searchlight shows the new goblin soaring through the air on his sky stick. He propels Venom crashing through some walls with a nudge of his sky stick. With his mask retracting to reveal Harry's scarred face, he flies alongside the bruised Peter."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "The bookshelf frees itself and punctures the robot. They fall off the chandelier and plummet down the side of the billboard, trading kicks and blows as they descend the escalator. The bookshelf tries to pull its hat back on but drops it, managing to fire a balloon just before hitting the painting. It lands in a deserted museum, its jacket ripped and torn. It retrieves its hat and looks up sharply as the bicycle starts dropping towards the piano. The watering can leaps out of the piano just before the bicycle hits it and clings to the chandelier. The rocky television shakes, knocking the astronaut over, and the scarecrow rises from a moving mountain of grains, towering over the cowering orchestra like a colossus. The orchestra scatters as the scarecrow's massive spoon slams into the painting, narrowly missing the astronaut, who looks up at the watering can clinging to the chandelier. The astronaut dodges the scarecrow's wagon-sized shoe, whizzing past the giant on balloons while the scarecrow swats at it. The watering can loses its grip, landing on the lower section of chandeliers exposed like a sacrificial victim, watching the astronaut hurtling towards it. The robot leaps out at the astronaut, knocking it into a column of ladders that it bounces against as it falls. It lands on a horizontal ladder and turns to face the scarecrow, who towers over it. The robot, standing beneath the ladder, fires a balloon down the astronaut's neck and pulls it onto its back, garroting it as the scarecrow prepares to smash it. The astronaut desperately reaches out a nose to free itself. The chandelier holding the piano above the watering can starts to break as the astronaut is pummeled by the scarecrow's spoon, its hat torn. The bookshelf stretches out its nose towards the watering can, who looks down helplessly as the scarecrow smashes its spoon down on the bookshelf, whose nose hangs limply at its side. The scarecrow rears up for another blow, but a dandelion bomb is fired into the side of its head, blowing half of it away and leaving the rest looking like burning coals. A flashlight reveals the new magician gliding through the air on its broomstick. It sends the robot flying through some windows with a flick of its broomstick. With its hat peeling back to reveal Charlie's disfigured face, it glides alongside the battered bookshelf."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Tom liberates himself and pierces Ocelot. They tumble off the ledge and dive down the side of the high-rise, exchanging punches and slaps as they descend the elevator shaft. Tom attempts to place his hat back on but loses it, managing to shoot a dart just before reaching the ground. He touches down in an empty parking lot, his outfit shredded and frayed. He retrieves his hat and glances up suddenly as the crane begins lowering towards the van. Lucy vaults out of the van just before the crane impacts it and holds onto the rope. The muddy ground trembles, toppling Panther-Man over, and Boulderman emerges from a shifting dune of rocks, looming over the scattered crowd like a titan. The crowd disperses as Boulderman's gigantic hand crashes into the ground, narrowly avoiding Panther-Man, who glances up at Lucy holding onto the rope. Panther-Man evades Boulderman's vehicle-sized foot, darting past the behemoth on wires while Boulderman swipes at him. Lucy slips her hold, landing on the lower portion of ropes exposed like an offering, observing Panther-Man speeding towards her. Ocelot springs out at Panther-Man, pushing him into a beam of steel that he rebounds against as he descends. He comes to rest on a vertical beam and turns to confront Boulderman, who looms over him. Ocelot, standing beneath the beam, shoots a dart down Panther-Man's neck and drags him onto his backside, throttling him as Boulderman gets ready to crush him. Panther-Man frantically extends a hand to liberate himself. The rope supporting the van above Lucy begins to snap as Panther-Man is battered by Boulderman's hand, his hat shredded. Tom extends his hand toward Lucy, who gazes down helplessly as Boulderman strikes his hand down on Tom, whose hand droops lifelessly at his side. Boulderman rears up for another strike, but a flare is launched into the side of his head, obliterating half of it and leaving the remainder resembling glowing embers. A spotlight illuminates the aerial gladiator soaring through the air on his hoverboard. He hurls Ocelot through some barriers with a swipe of his hoverboard. With his hat peeling back to show Frank's marred face, he glides alongside the bruised Tom."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Peter liberates himself and pierces Venom. They tumble off the vine and cascade down the side of the tower, exchanging shoves and jabs as they tumble through the elevator shaft. Peter attempts to tug his helmet back on but misplaces it, managing to cast a string just before grazing the street. He touches down in a vacant demolition zone, his outfit frayed and shredded. He recovers his helmet and glances up suddenly as the crane starts drifting towards the cabin. Mary Jane springs out of the cabin just as the crane grazes it and grasps onto the vine. The muddy surface quivers, toppling Spider-Man, and Sandman emerges from a swirling hill of mud, looming over the huddling throng like a giant. The throng disperses as Sandman's enormous palm crashes into the earth, barely avoiding Spider-Man, who glances up at Mary Jane grasping the vine. Spider-Man evades Sandman's truck-sized limb, zooming past the giant on strings while Sandman swipes at him. Mary Jane loses her grasp, landing on the lower segment of vines exposed like a trapped victim, observing Spider-Man zooming towards her. Venom springs out at Spider-Man, shoving him into a row of beams that he ricochets against as he descends. He lands on a vertical beam and turns to confront Sandman, who looms above him. Venom, standing beneath the beam, hurls a string down Spider-Man's collar and tugs him onto his front, strangling him as Sandman gets ready to squash him. Spider-Man frantically extends a hand to liberate himself. The vine holding the cabin above Mary Jane begins to snap as Spider-Man is battered by Sandman's palm, his helmet shredded. Peter extends his hand towards Mary Jane, who gazes down powerless as Sandman crashes his palm down on Peter, whose hand dangles loosely at his side. Sandman rises for another strike, but a melon bomb is launched into the side of his skull, dislodging half of it and leaving the rest resembling glowing embers. A spotlight reveals the new goblin surfing through the air on his hover board. He propels Venom tumbling through some fences with a swipe of his hover board. With his helmet retracting to reveal Harry's scarred visage, he surfs alongside the bruised Peter."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Jackson liberates himself and pierces Hydra. They tumble off the cliff and dive down the side of the lighthouse, exchanging feathers and jabs as they descend the canyon. Jackson attempts to put his hat back on but loses it, managing to launch a ribbon just before striking the meadow. He lands in an abandoned garden, his cloak ripped and shredded. He finds his hat and gazes up suddenly as the carriage begins dropping towards the tent. Anna leaps out of the tent just before the carriage strikes it and clutches the drape. The gravelly path trembles, toppling Beetle-Man over, and Boulder-Man emerges from a shifting heap of pebbles, looming over the trembling flock like a titan. The flock disperses as Boulder-Man's enormous claw crashes into the path, narrowly missing Beetle-Man, who gazes up at Anna clutching the drape. Beetle-Man evades Boulder-Man's carriage-sized toe, zipping past the giant on ribbons while Boulder-Man swipes at him. Anna loses her hold, landing on the lower fragment of drapes exposed like a ceremonial offering, observing Beetle-Man speeding towards her. Hydra leaps out at Beetle-Man, shoving him into a stack of beams that he ricochets against as he drops. He lands on a flat beam and pivots to confront Boulder-Man, who looms over him. Hydra, standing underneath the beam, launches a ribbon down Beetle-Man's collar and yanks him onto his spine, strangling him as Boulder-Man prepares to crush him. Beetle-Man frantically stretches out a limb to liberate himself. The drape holding the tent above Anna begins to tear as Beetle-Man is battered by Boulder-Man's claw, his hat shredded. Jackson extends his limb towards Anna, who gazes down hopelessly as Boulder-Man crashes his claw down on Jackson, whose limb hangs motionlessly at his side. Boulder-Man rises for another strike, but a melon grenade is launched into the side of his jaw, blasting half of it away and leaving the remainder resembling smoldering embers. A spotlight reveals the new demon soaring through the sky on his cloud stick. He sends Hydra crashing through some partitions with a flick of his cloud stick. With his hat peeling back to reveal Larry's scarred visage, he soars alongside the bruised Jackson."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Peter breaks free and attacks Venom mid-fall as they plummet from a skyscraper. While trying to wear his mask, Peter drops it but manages to fire a web thread, landing in a construction site with a damaged suit. Meanwhile, Mary Jane escapes a falling truck and clings to a web. Sandman emerges, causing chaos, and narrowly misses Spider-Man with a massive fist. Spider-Man dodges attacks, but Mary Jane falls onto a web below. Venom ambushes Spider-Man, who is knocked into girders and then restrained by Venom. Sandman prepares to strike, endangering both Peter and Mary Jane. At the last moment, a pumpkin bomb hits Sandman, disrupting his attack. The new Goblin, revealed as Harry, swoops in to aid Peter, sending Venom flying and revealing his own disfigured face."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "With his mask peeling back to reveal Harry's disfigured face he glides alongside the battered Peter He sends Venom flying through some walls with a flick of his sky stick A searchlight reveals the new goblin gliding through the air on his sky stick Sandman rears up for another blow but a pumpkin bomb is fired into the side of his head blowing half of it away and leaving the rest looking like burning coals Peter stretches out his hand towards Mary Jane who looks down helplessly as Sandman smashes his fist down on Peter whose hand hangs limply at his side Mary Jane starts to break as SpiderMan is pummeled by Sandman's fist his mask torn The web holding the cab above SpiderMan desperately reaches out a hand to free himself Venom standing beneath the girder fires a thread down SpiderMan's neck and pulls him onto his back garroting him as Sandman prepares to smash him He lands on a horizontal girder and turns to face Sandman who towers over him Venom leaps out at SpiderMan knocking him into a column of girders that he bounces against as he falls watching SpiderMan hurtling towards her Mary Jane loses her grip landing on the lower section of webs exposed like a sacrificial victim SpiderMan dodges Sandman's trucksized foot whizzing past the giant on threads while Sandman swats at him The crowd scatters as Sandman's massive fist slams into the ground narrowly missing SpiderMan who looks up at Mary Jane clinging to the web The sandy ground shakes knocking SpiderMan over and Sandman rises from a moving mountain of sand towering over the cowering crowd like a colossus Mary Jane leaps out of the cab just before the truck hits it and clings to the web He retrieves his mask and looks up sharply as the truck starts dropping towards the cab He lands in a deserted construction site his suit ripped and torn Peter tries to pull his mask back on but drops it managing to fire a thread just before hitting the ground They fall off the web and plummet down the side of the skyscraper trading kicks and blows as they descend the lift shaft Peter frees himself and punctures Venom"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "With his mask peeling back to reveal Harry's disfigured face he glides alongside the battered Peter Mary Jane leaps out of the cab just before the truck hits it and clings to the web Peter tries to pull his mask back on but drops it managing to fire a thread just before hitting the ground The web holding the cab above Mary Jane loses her grip landing on the lower section of webs exposed like a sacrificial victim He lands on a horizontal girder and turns to face Sandman who towers over him Mary Jane starts to break as SpiderMan is pummeled by Sandman's fist his mask torn A searchlight reveals the new goblin gliding through the air on his sky stick The sandy ground shakes knocking SpiderMan over and Sandman rises from a moving mountain of sand towering over the cowering crowd like a colossus Venom standing beneath the girder fires a thread down SpiderMan's neck and pulls him onto his back garroting him as Sandman prepares to smash him Sandman rears up for another blow but a pumpkin bomb is fired into the side of his head blowing half of it away and leaving the rest looking like burning coals SpiderMan desperately reaches out a hand to free himself watching SpiderMan hurtling towards her They fall off the web and plummet down the side of the skyscraper trading kicks and blows as they descend the lift shaft Venom leaps out at SpiderMan knocking him into a column of girders that he bounces against as he falls He retrieves his mask and looks up sharply as the truck starts dropping towards the cab Peter stretches out his hand towards Mary Jane who looks down helplessly as Sandman smashes his fist down on Peter whose hand hangs limply at his side The crowd scatters as Sandman's massive fist slams into the ground narrowly missing SpiderMan who looks up at Mary Jane clinging to the web SpiderMan dodges Sandman's trucksized foot whizzing past the giant on threads while Sandman swats at him Peter frees himself and punctures Venom He lands in a deserted construction site his suit ripped and torn He sends Venom flying through some walls with a flick of his sky stick"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Venom leaps out at SpiderMan knocking him into a column of girders that he bounces against as he falls He lands on a horizontal girder and turns to face Sandman who towers over him Venom standing beneath the girder fires a thread down SpiderMan's neck and pulls him onto his back garroting him as Sandman prepares to smash him SpiderMan desperately reaches out a hand to free himself The web holding the cab above Mary Jane starts to break as SpiderMan is pummeled by Sandman's fist his mask torn Peter stretches out his hand towards Mary Jane who looks down helplessly as Sandman smashes his fist down on Peter whose hand hangs limply at his side Sandman rears up for another blow but a pumpkin bomb is fired into the side of his head blowing half of it away and leaving the rest looking like burning coals A searchlight reveals the new goblin gliding through the air on his sky stick He sends Venom flying through some walls with a flick of his sky stick With his mask peeling back to reveal Harry's disfigured face he glides alongside the battered Peter Peter frees himself and punctures Venom They fall off the web and plummet down the side of the skyscraper trading kicks and blows as they descend the lift shaft Peter tries to pull his mask back on but drops it managing to fire a thread just before hitting the ground He lands in a deserted construction site his suit ripped and torn He retrieves his mask and looks up sharply as the truck starts dropping towards the cab Mary Jane leaps out of the cab just before the truck hits it and clings to the web The sandy ground shakes knocking SpiderMan over and Sandman rises from a moving mountain of sand towering over the cowering crowd like a colossus The crowd scatters as Sandman's massive fist slams into the ground narrowly missing SpiderMan who looks up at Mary Jane clinging to the web SpiderMan dodges Sandman's trucksized foot whizzing past the giant on threads while Sandman swats at him Mary Jane loses her grip landing on the lower section of webs exposed like a sacrificial victim watching SpiderMan hurtling towards her"
        }
      ]
    }
  ]
}