{
  "ground_truth": "Harry banks around and sees Peter swinging between the buildings. He zooms down after Peter, who swings into a narrow gap between the tall buildings, propelling himself along from thread to thread. Harry turns the Sky Stick side on so he can fly along the narrow gap, dodging fire escapes and air con units as he air boards after Peter. Harry pulls a glowing green sword from a scabbard on his back and slashes wildly at Peter, who swerves out of the way. Harry soars above Peter, then plummets down to stab him but misses. Harry hurls a small, golden pumpkin bomb at Peter. It opens up in mid-air into a kind of flying metallic bat. Harry throws more bombs at Peter. They slash at Peter who desperately tries to swing out of their way. He jumps off a pipe and swings back the way he came, just missing Harry. The winged bombs surge after Peter and Harry gets caught in the swarm. One of them embeds its wing in his shoulder. He yanks it out, zooms upwards into the air, and swoops on after Peter. Peter swings backwards, shooting webbing at the bombs and disabling them. One of them is caught in a thread, and Peter swings it back at Harry. Harry flies through the explosion, shielding his eyes. He hits the line of thread stretched out in front of him and bounces off a pipe and a wall, tumbling towards an alleyway below. Peter, his eyes widening with alarm, swings down towards him. Harry lies motionless on the ground. Peter hurries over to his unconscious old friend. He crouches down and holds his ear to Harry's mouth. He yanks open Harry's dark green jacket and starts pumping his chest. He listens again for signs of life. He carries his friend to an emergency room. Peter watches through a window as a crash team tries to revive Harry. A detective hands a file to tall, thin-faced Captain Stacy. A police dog handler blows a whistle and points. Flint sprints across waste ground with armed officers running behind him. As he reaches a wire mesh fence an Alsatian lunges at him. He wrestles the dog off and punches it away. Flint climbs. Flint runs on and suddenly falls into a huge pit. He tumbles down a concrete wall and lands heavily on a pile of sand in the bottom of the pit. Slowly, he hauls himself to his feet and looks desperately from side to side. He's caught in a dazzling beam of light. Above the pit, three glowing capacitors begin to rotate like a merry-go-round. Flint looks up nervously as the capacitors descend towards him and spin around him. They kick up a sandstorm with Flint trapped in the middle.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Certainly! Here's the transformed text with synonyms:\n\n---\n\nHarry banks around and perceives Peter swinging amid the edifices. He zooms downward after Peter, who swings into a narrow crevice between the lofty edifices, propelling himself along from strand to strand. Harry turns the Sky Stick side on so he can fly along the narrow crevice, dodging fire escapes and air con units as he air boards after Peter. Harry pulls a glowing green blade from a scabbard on his back and slashes wildly at Peter, who veers out of the way. Harry soars above Peter, then plunges down to stab him but misses. Harry flings a small, golden pumpkin explosive at Peter. It opens up in mid-air into a kind of flying metallic creature. Harry throws more explosives at Peter. They slash at Peter who desperately tries to swing out of their way. He leaps off a pipe and swings back the way he came, just missing Harry. The winged explosives surge after Peter and Harry gets caught in the swarm. One of them embeds its wing in his shoulder. He yanks it out, zooms upwards into the air, and swoops on after Peter. Peter swings backwards, shooting webbing at the explosives and disabling them. One of them is caught in a strand, and Peter swings it back at Harry. Harry flies through the explosion, shielding his eyes. He hits the line of strand stretched out in front of him and bounces off a pipe and a wall, tumbling towards an alleyway below. Peter, his eyes widening with alarm, swings down towards him. Harry lies motionless on the ground. Peter hurries over to his unconscious old companion. He crouches down and holds his ear to Harry's mouth. He yanks open Harry's dark green jacket and starts pumping his chest. He listens again for signs of vitality. He carries his companion to an emergency room. Peter watches through a window as a crash team tries to resuscitate Harry. A detective hands a dossier to tall, thin-faced Captain Stacy. A police canine handler blows a whistle and gestures. Flint sprints across waste ground with armed officers running behind him. As he reaches a wire mesh barrier an Alsatian lunges at him. He wrestles the canine off and punches it away. Flint scales. Flint runs on and suddenly plunges into a huge pit. He tumbles down a concrete wall and lands heavily on a pile of sand in the bottom of the pit. Slowly, he hauls himself to his feet and looks desperately from side to side. He's caught in a dazzling beam of light. Above the pit, three glowing capacitors begin to rotate like a merry-go-round. Flint looks up nervously as the capacitors descend towards him and spin around him. They kick up a sandstorm with Flint trapped in the middle."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Peter is seen by Harry as he swings between the buildings. Peter is zoomed down after by Harry, who swings into a narrow gap between the tall buildings, propelling himself along from thread to thread. The Sky Stick is turned side on by Harry so he can fly along the narrow gap, dodging fire escapes and air con units while air boarding after Peter. A glowing green sword is pulled by Harry from a scabbard on his back, and Peter is slashed at wildly, who swerves out of the way. Above Peter, Harry soars, then plummets down to stab him but a miss is made. A small, golden pumpkin bomb is hurled at Peter by Harry. It opens up in mid-air into a kind of flying metallic bat. More bombs are thrown at Peter by Harry. They slash at Peter, who desperately tries to swing out of their way. A jump is made off a pipe, and the way he came is swung back along by Peter, just missing Harry. The winged bombs surge after Peter, and Harry is caught in the swarm. One of them embeds its wing in his shoulder. It is yanked out by him, he zooms upwards into the air, and swoops on after Peter. Backwards, Peter swings, shooting webbing at the bombs and disabling them. In a thread, one of them is caught, and it is swung back at Harry by Peter. Through the explosion, Harry flies, shielding his eyes. The line of thread stretched out in front of him is hit, and a pipe and a wall are bounced off by him, tumbling towards an alleyway below. With alarm widening his eyes, Peter swings down towards him. Harry is found lying motionless on the ground. Over to his unconscious old friend, Peter hurries. Down, he crouches and his ear to Harry's mouth is held. He yanks open Harry's dark green jacket and his chest is pumped by Peter. Again, he listens for signs of life. His friend is carried to an emergency room by Peter. Through a window, Peter watches as a crash team tries to revive Harry. To tall, thin-faced Captain Stacy, a file is handed by a detective. A whistle is blown by a police dog handler, who points. Flint is sprinted across waste ground by him, with armed officers running behind him. As a wire mesh fence is reached by him, an Alsatian lunges at him. The dog is wrestled off and punched away by him. Flint climbs. A huge pit is suddenly fallen into by Flint, who runs on. He tumbles down a concrete wall and lands heavily on a pile of sand in the bottom of the pit. Slowly, to his feet, he hauls himself and desperately looks from side to side. In a dazzling beam of light, he's caught. Above the pit, three glowing capacitors are made to rotate like a merry-go-round. Nervously, Flint looks up as the capacitors descend towards him and they are spun around him. A sandstorm is kicked up by them with Flint trapped in the middle."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Harry spots Peter swinging between the buildings and zooms after him. Peter threads through a narrow gap between tall structures, and Harry maneuvers his Sky Stick sideways to follow, dodging obstacles like fire escapes. Pulling a glowing green sword, Harry slashes at Peter, who swerves away. Harry flies above Peter and plunges down but misses. He throws a small, golden pumpkin bomb, which transforms into a metallic bat. More bombs follow, slashing at Peter. Peter evades them and, swinging back, narrowly avoids Harry. The winged bombs pursue Peter, one lodging in Harry's shoulder. He removes it and continues chasing Peter, who swings backwards, using webbing to disable the bombs. Peter captures one bomb with a thread and flings it at Harry. Harry crashes through the explosion, hitting a line and ricocheting off a pipe, falling into an alley. Alarmed, Peter swings down to Harry, who is motionless. Peter checks him, opens Harry's jacket, performs chest compressions, and listens for signs of life. He carries Harry to an emergency room, watching as a team works on him. Meanwhile, a detective gives Captain Stacy a file. A dog handler points at Flint, sprinting across waste ground with armed officers. Flint reaches a fence, wrestles off a lunging dog, climbs the fence, and falls into a massive pit. He lands on sand and looks around desperately when a bright light catches him. Above, three glowing capacitors spin like a merry-go-round, descending. Flint stands trapped as a sandstorm whirls around him."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Harry follows Peter through a narrow gap between tall buildings, dodging fire escapes and air con units. Harry grabs a glowing green sword and attacks, but Peter swerves away. Harry hurls golden pumpkin bombs that turn into flying metallic bats. The bombs chase Peter, who swings away and disables them with webbing. Peter swings one bomb back at Harry, who is then knocked into an alleyway. Peter rushes to his unconscious friend, starts CPR, and carries him to an emergency room, watching as a team tries to revive Harry. Meanwhile, Flint runs from the police, wrestles a dog, and falls into a pit. There, he's caught in light as spinning capacitors create a sandstorm around him."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Harry skillfully banks around a corner and catches sight of Peter, who is energetically swinging between the towering buildings. Without hesitation, Harry zooms downwards in pursuit of Peter, who skillfully maneuvers himself into a narrow gap between the immense skyscrapers, propelling himself along from one thread to the next. To navigate through the confined space, Harry adeptly turns the Sky Stick sideways, allowing him to fly through the narrow gap while skillfully dodging fire escapes and protruding air conditioning units as he airboards after Peter. Displaying agility and determination, Harry pulls out a glowing green sword from a scabbard strapped to his back and slashes wildly at Peter, who deftly swerves out of harm's way. In a swift motion, Harry soars above Peter, then plummets down with intent to stab him, only to miss his target. Undeterred, Harry hurls a small, golden pumpkin bomb in Peter's direction. This bomb opens up in mid-air, transforming into a kind of metallic bat with wings. Harry proceeds to throw more of these bombs at Peter. The bombs, sharp and relentless, slash toward Peter, who is desperately trying to swing out of their path. In a quick, agile move, Peter jumps off a pipe and swings back the way he originally came, narrowly avoiding Harry. The winged bombs persistently surge after Peter, and Harry inadvertently gets caught in the swarm. One of them embeds its sharp wing into his shoulder. Harry grimaces as he yanks it out, then zooms upwards into the sky, swooping onward in pursuit of Peter. As Peter swings backward, he shoots webbing at the bombs, effectively disabling them. One of the bombs is caught and tangled in a web thread, prompting Peter to swing it back toward Harry. Despite the impending explosion, Harry bravely flies through it, shielding his eyes. However, he collides with the line of thread stretched out in front of him, bouncing off a pipe and a wall, and tumbling uncontrollably toward an alleyway below. Peter's eyes widen with alarm as he swings down swiftly toward Harry. Harry, now motionless on the ground, is in distress. Peter quickly approaches his unconscious old friend, crouches down, and places his ear close to Harry’s mouth to check for breathing. He urgently yanks open Harry’s dark green jacket and begins pumping his chest, trying to revive him. After listening again for any signs of life, Peter decides to carry Harry to an emergency room. From just beyond a window, Peter watches with concern as a crash team inside works to revive Harry. Nearby, a detective hands over a file to the tall, thin-faced Captain Stacy, indicating the seriousness of the situation. Meanwhile, a police dog handler alerts his team by blowing a whistle and pointing as Flint begins sprinting across the waste ground with armed officers following closely behind him. As Flint reaches a wire mesh fence, an Alsatian dog lunges at him. He wrestles with the dog, eventually punching it away. Flint starts to climb, attempting to escape, but as he runs on, he suddenly falls into an enormous pit. He tumbles down a concrete wall and lands heavily on a pile of sand at the base of the pit. Slowly, with effort, he hauls himself to his feet and casts a desperate gaze from side to side. He finds himself caught in a bewildering, dazzling beam of light. Above him, at the rim of the pit, three glowing capacitors begin to rotate in a circular motion like a merry-go-round. Flint glances up nervously as the capacitors descend toward him and commence spinning around him. They kick up a fierce sandstorm, with Flint trapped helplessly at its center."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Harry, with impressive skill and precision, expertly banks around a challenging corner and quickly catches sight of Peter. Peter is energetically swinging between the towering, majestic buildings that dominate the cityscape. Without a moment of hesitation, Harry zooms downwards at remarkable speed in eager pursuit of Peter. Peter demonstrates undeniable skill as he maneuverers himself into a narrow gap between the immense skyscrapers, propelling himself efficiently from one thread of webbing to the next. To successfully navigate through the confined space, Harry adeptly turns the Sky Stick sideways, allowing him to fly smoothly through the tight gap while expertly dodging fire escapes and protruding air conditioning units as he airboards after Peter with unwavering determination. Displaying both agility and determination, Harry skillfully pulls out a glowing green sword from a scabbard securely strapped to his back and begins to slash wildly at Peter. However, Peter deftly swerves out of harm's way, avoiding the attack. In a swift and daring motion, Harry soars above Peter, then dramatically plummets downwards with intent to stab him, only to miss his intended target. Undeterred and persistent, Harry hurls a small, golden pumpkin bomb in Peter's direction. This bomb opens up in mid-air, transforming into a kind of metallic bat with mechanical wings. Harry proceeds to throw more of these bombs with increasing intensity at Peter. The bombs, both sharp and relentless, slash toward Peter, who is desperately trying to swing out of their unpredictable path. In a quick, agile move, Peter jumps off a pipe and swings back the way he originally came, narrowly avoiding Harry and the pursuing bombs. The winged bombs, relentless in their pursuit, surge after Peter, and Harry inadvertently gets caught among the swarm. One of these mechanical creatures embeds its sharp wing into his shoulder. Harry grimaces in pain as he yanks it out, then resolutely zooms upwards into the sky, swooping onward with renewed determination in pursuit of Peter. As Peter swings backward, he cleverly shoots webbing at the bombs, effectively disabling them. One of the bombs becomes ensnared and tangled in a web thread, prompting Peter to swing it back toward Harry. Despite the impending explosion, Harry bravely flies through it, shielding his eyes from the chaos. However, he collides with the line of web thread stretched tightly in front of him, causing him to bounce off a pipe and a wall, ultimately tumbling uncontrollably toward the alleyway below. Peter's eyes widen with alarm and concern as he swiftly swings down toward the now-distressed Harry. Harry, now lying motionless on the ground, is in apparent distress. Peter quickly approaches his unconscious old friend, crouches down, and places his ear close to Harry’s mouth to listen for any signs of breathing. He urgently yanks open Harry’s dark green jacket and begins pumping his chest with purpose, attempting to revive him. After listening intently once again for any signs of life, Peter makes the crucial decision to carry Harry swiftly to an emergency room. From just beyond a hospital window, Peter watches with deep concern as a crash team inside works intently to revive Harry. Nearby, a detective hands over a vital file to the tall, thin-faced Captain Stacy, highlighting the seriousness of the unfolding situation. Meanwhile, a police dog handler alerts his team by blowing a whistle and pointing with urgency as Flint begins sprinting across the waste ground with armed officers closely following behind him. As Flint reaches a formidable wire mesh fence, an Alsatian dog lunges at him. He wrestles with the dog, eventually managing to punch it away. Flint starts to climb the fence, desperately attempting to escape, but as he continues to run, he suddenly falls into an enormous, unforeseen pit. He tumbles down a steep concrete wall and lands heavily on a pile of sand at the base of the pit. Slowly, with effort, he hauls himself to his feet and casts a desperate gaze from side to side. He finds himself caught in a bewildering, dazzling beam of light. Above him, at the rim of the pit, three glowing capacitors begin to rotate in a circular motion similar to a merry-go-round. Flint glances up nervously as the capacitors descend ominously toward him and commence spinning around him. They kick up a fierce sandstorm, with Flint trapped helplessly at its chaotic center."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Harry sharply banks around, his eyes locking onto Peter, who is skillfully swinging between the towering buildings. Determined to catch up, Harry speeds down in pursuit of Peter, who is deftly navigating a narrow gap between the skyscrapers, propelling himself forward by shooting webs from one point to another. In reaction, Harry expertly tilts his Sky Stick to the side, aligning it for a streamlined flight through the confined space. He weaves through the narrow gap, deftly maneuvering around obstacles like fire escapes and air conditioning units, all while keeping his focus on Peter. In one swift motion, Harry retrieves a glowing green sword from the scabbard strapped to his back, slashing wildly at Peter, who nimbly swerves out of harm's way. Undeterred, Harry ascends above Peter with a burst of speed and then sharply plummets downwards, aiming to stab him, but Peter skillfully evades his strike. Quickly adjusting his approach, Harry launches a small, golden pumpkin bomb at Peter. The bomb springs open mid-air, transforming into a metallic bat-like creature that flaps menacingly toward its target. Seizing the opportunity, Harry hurls more of these bombs in Peter's direction. As they attack, Peter frantically swings to avoid them, jumping off a pipe and reversing his trajectory, narrowly missing Harry in the process. The relentless winged bombs pursue Peter with determination, and Harry inadvertently becomes entangled in their chaotic swarm. One of the bombs embeds its sharp wing into Harry's shoulder, causing him to wince in pain. With a quick motion, he pulls it out, then accelerates upwards into the air, recovering from the chaos to continue his pursuit of Peter. Meanwhile, Peter executes a backward swing, strategically shooting his webbing at the bombs to disable them. Successfully ensnaring one in his web, Peter swings it back toward Harry, who finds himself flying through the subsequent explosion, shielding his eyes from the debris. The aftermath leaves Harry vulnerable, causing him to collide with a stretched line of webbing. He ricochets off a pipe and a wall, tumbling uncontrollably toward the alleyway below. Sensing the danger, Peter's eyes widen in alarm as he swings down rapidly toward Harry. Landing quickly, Peter rushes to his unconscious friend, his concern palpable. He crouches beside Harry, urgently placing his ear to Harry's mouth to detect any sign of breathing. Realizing the gravity of the situation, Peter swiftly unzips Harry's dark green jacket and begins performing chest compressions, pausing periodically to listen for signs of life. Determined to save him, Peter eventually carries Harry to the nearest emergency room, his worry escalating as he watches through a window while a crash team fights to revive his old friend. Meanwhile, a detective passes a file to the tall, thin-faced Captain Stacy, who stands nearby. Elsewhere, a police dog handler blows a whistle and gestures urgently, directing attention to Flint, who is sprinting across an expanse of waste ground with armed officers hot on his trail. As Flint closes in on a wire mesh fence, an Alsatian lunges at him. He struggles to fend off the dog, eventually punching it away. With no time to spare, Flint clambers up the fence, ultimately running forward only to suddenly plunge into a gargantuan pit. He tumbles down the harsh concrete wall, landing hard on a pile of sand at the pit's bottom. Slowly, Flint pulls himself to his feet, his eyes darting anxiously from side to side, realizing he's trapped. Suddenly, a dazzling beam of light catches him, illuminating his predicament. Above the pit, three luminescent capacitors begin rotating like a merry-go-round, descending toward him with an ominous spin. Flint looks up in nervous anticipation as the capacitors close in, their rotation whipping up a ferocious sandstorm with Flint caught in the eye of the swirling chaos."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Harry pursues Peter as he swings through a narrow gap between buildings. Adjusting his flight to navigate obstacles, Harry draws a glowing green sword and attacks, but Peter evades. Harry then launches airborne bombs at Peter, who maneuvers to avoid them. As Peter successfully swings back, one bomb's wing injures Harry, prompting him to ascend and continue the chase. Peter uses his webbing to neutralize the bombs, sending one back towards Harry, who flies through the resulting explosion. Harry collides with a web line, ricocheting off structures before falling into an alleyway. Alarmed, Peter rushes to his unconscious friend, performs CPR, and transports him to the emergency room, where he anxiously observes attempts to revive Harry.\n\nMeanwhile, Flint, pursued by officers, encounters a police dog but escapes, only to fall into a pit. Trapped in the sand at the bottom, he is caught in a powerful sandstorm created by rotating, descending capacitors."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Harry banks around and sees Peter, the young hero known as Spider-Man, swinging between the buildings of New York City. He zooms down after Peter, who swings into a narrow gap between the towering skyscrapers of Manhattan, propelling himself along from thread to thread with his web-shooters, a technology he ingeniously developed. Harry turns the Sky Stick, his advanced hoverboard designed by Oscorp Industries, side on so he can fly along the narrow gap, expertly dodging the iron fire escapes and bulky air conditioning units as he air boards after Peter. Harry pulls a glowing green sword from a scabbard on his back, a high-tech weapon powered by an unknown energy source, and slashes wildly at Peter, who swerves out of the way with the agility of a practiced acrobat. Harry soars above Peter, then plummets down to stab him but misses due to Peter's quick reflexes. Harry hurls a small, golden pumpkin bomb at Peter. It opens up in mid-air, transforming into a kind of flying metallic bat, a signature gadget of the Green Goblin. Harry throws more bombs at Peter. They slash at Peter who desperately tries to swing out of their way, a skill he honed over years of fighting crime. He jumps off a pipe and swings back the way he came, just missing Harry. The winged bombs surge after Peter and Harry gets caught in the swarm. One of them embeds its wing in his shoulder. Wincing in pain, he yanks it out, zooms upwards into the air, and swoops on after Peter. Peter swings backwards, shooting webbing at the bombs and disabling them with precision. One of them is caught in a thread, and Peter swings it back at Harry. Harry flies through the explosion, shielding his eyes from the blinding flash. He hits the line of thread stretched out in front of him and bounces off a pipe and a wall, tumbling towards an alleyway below. Peter, his eyes widening with alarm, swings down towards him with concern for his old friend. Harry lies motionless on the ground. Peter hurries over to his unconscious old friend, a fellow student from Midtown High. He crouches down and holds his ear to Harry's mouth, checking for any signs of breath. He yanks open Harry's dark green jacket and starts pumping his chest with the urgency of someone trained in CPR. He listens again for signs of life. He then carries his friend to an emergency room at New York-Presbyterian Hospital. Peter watches through a window as a crash team tries to revive Harry, the son of Norman Osborn, the infamous former CEO of Oscorp. A detective hands a file to tall, thin-faced Captain Stacy, a respected officer in the NYPD. A police dog handler blows a whistle and points. Flint Marko, a small-time criminal also known as Sandman, sprints across waste ground with armed officers running behind him. As he reaches a wire mesh fence an Alsatian lunges at him. Flint, in desperation, wrestles the dog off and punches it away, a testament to his hardened life on the run. Flint climbs. Flint runs on and suddenly falls into a huge pit. He tumbles down a concrete wall and lands heavily on a pile of sand in the bottom of the pit. Slowly, he hauls himself to his feet, looking desperately from side to side for an escape. He's caught in a dazzling beam of light. Above the pit, three glowing capacitors, part of an experimental particle accelerator, begin to rotate like a merry-go-round. Flint looks up nervously as the capacitors descend towards him and spin around him, inadvertently causing his transformation. They kick up a sandstorm with Flint trapped in the middle."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Flint looks up nervously as the capacitors descend towards him and spin around him Harry banks around and sees Peter swinging between the buildings He hits the line of thread stretched out in front of him and bounces off a pipe and a wall tumbling towards an alleyway below Peter his eyes widening with alarm swings down towards him He zooms down after Peter who swings into a narrow gap between the tall buildings propelling himself along from thread to thread Harry turns the Sky Stick side on so he can fly along the narrow gap dodging fire escapes and air con units as he air boards after Peter Harry pulls a glowing green sword from a scabbard on his back and slashes wildly at Peter who swerves out of the way Harry soars above Peter then plummets down to stab him but misses Harry hurls a small golden pumpkin bomb at Peter It opens up in midair into a kind of flying metallic bat Flint runs on and suddenly falls into a huge pit Harry throws more bombs at Peter They slash at Peter who desperately tries to swing out of their way He jumps off a pipe and swings back the way he came just missing Harry Peter swings backwards shooting webbing at the bombs and disabling them The winged bombs surge after Peter and Harry gets caught in the swarm As he reaches a wire mesh fence an Alsatian lunges at him One of them embeds its wing in his shoulder He yanks it out zooms upwards into the air and swoops on after Peter Harry lies motionless on the ground Peter swings backwards shooting webbing at the bombs and disabling them One of them is caught in a thread and Peter swings it back at Harry Harry flies through the explosion shielding his eyes He hits the line of thread stretched out in front of him and bounces off a pipe and a wall tumbling towards an alleyway below Peter his eyes widening with alarm swings down towards him Harry lies motionless on the ground Peter hurries over to his unconscious old friend He crouches down and holds his ear to Harry's mouth He yanks open Harry's dark green jacket and starts pumping his chest He listens again for signs of life He carries his friend to an emergency room He carries his friend to an emergency room Above the pit three glowing capacitors begin to rotate like a merrygoround Peter watches through a window as a crash team tries to revive Harry A detective hands a file to tall thinfaced Captain Stacy A police dog handler blows a whistle and points Flint sprints across waste ground with armed officers running behind him As he reaches a wire mesh fence an Alsatian lunges at him He wrestles the dog off and punches it away Flint climbs Flint runs on and suddenly falls into a huge pit Harry turns the Sky Stick side on so he can fly along the narrow gap He yanks open Harry's dark green jacket and starts pumping his chest It opens up in midair into a kind of flying metallic bat He tumbles down a concrete wall and lands heavily on a pile of sand in the bottom of the pit They kick up a sandstorm with Flint trapped in the middle One of them is caught in a thread and Peter swings it back at Harry Slowly he hauls himself to his feet and looks desperately from side to side He is caught in a dazzling beam of light Above the pit three glowing capacitors begin to rotate like a merrygoround Flint looks up nervously as the capacitors descend towards him and spin around him Harry banks around and sees Peter swinging between the buildings Harry throws more bombs at Peter He zooms down after Peter who swings into a narrow gap between the tall buildings propelling himself along from thread to thread A police dog handler blows a whistle and points They kick up a sandstorm with Flint trapped in the middle Harry hurls a small golden pumpkin bomb at Peter He yanks it out zooms upwards into the air and swoops on after Peter"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Harry banks around and sees Peter swinging between the buildings. He zooms down after Peter who swings into a narrow gap between the tall buildings propelling himself along from thread to thread. Harry turns the Sky Stick side on so he can fly along the narrow gap. dodging fire escapes and air con units as he air boards after Peter. Harry pulls a glowing green sword from a scabbard on his back and slashes wildly at Peter who swerves out of the way. Harry soars above Peter then plummets down to stab him but misses. Harry hurls a small golden pumpkin bomb at Peter. It opens up in midair into a kind of flying metallic bat. Harry throws more bombs at Peter. They slash at Peter who desperately tries to swing out of their way. He jumps off a pipe and swings back the way he came just missing Harry. The winged bombs surge after Peter and Harry gets caught in the swarm. One of them embeds its wing in his shoulder. He yanks it out zooms upwards into the air and swoops on after Peter. Peter swings backwards shooting webbing at the bombs and disabling them. One of them is caught in a thread and Peter swings it back at Harry. Harry flies through the explosion shielding his eyes. He hits the line of thread stretched out in front of him and bounces off a pipe and a wall tumbling towards an alleyway below Peter his eyes widening with alarm swings down towards him. Harry lies motionless on the ground. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Peter hurries over to his unconscious old friend. He crouches down and holds his ear to Harry's mouth. He yanks open Harry's dark green jacket and starts pumping his chest. He listens again for signs of life. He carries his friend to an emergency room. Peter watches through a window as a crash team tries to revive Harry. A detective hands a file to tall thinfaced Captain Stacy. A police dog handler blows a whistle and points. Flint sprints across waste ground with armed officers running behind him. As he reaches a wire mesh fence an Alsatian lunges at him. He wrestles the dog off and punches it away. Flint climbs. Flint runs on and suddenly falls into a huge pit. He tumbles down a concrete wall and lands heavily on a pile of sand in the bottom of the pit. Slowly he hauls himself to his feet and looks desperately from side to side. He is caught in a dazzling beam of light. Above the pit three glowing capacitors begin to rotate like a merrygoround. Flint looks up nervously as the capacitors descend towards him and spin around him. They kick up a sandstorm with Flint trapped in the middle."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Harry banks around and sees Peter swinging between the buildings. He zooms down after Peter who swings into a narrow gap between the tall buildings propelling himself along from thread to thread. Harry turns the Sky Stick side on so he can fly along the narrow gap. dodging fire escapes and air con units as he air boards after Peter. Harry pulls a glowing green sword from a scabbard on his back and slashes wildly at Peter who swerves out of the way. Harry soars above Peter then plummets down to stab him but misses. Harry hurls a small golden pumpkin bomb at Peter. It opens up in midair into a kind of flying metallic bat. Harry throws more bombs at Peter. They slash at Peter who desperately tries to swing out of their way. He jumps off a pipe and swings back the way he came just missing Harry. The winged bombs surge after Peter and Harry gets caught in the swarm. One of them embeds its wing in his shoulder. He yanks it out zooms upwards into the air and swoops on after Peter. Peter swings backwards shooting webbing at the bombs and disabling them. One of them is caught in a thread and Peter swings it back at Harry. Harry flies through the explosion shielding his eyes. He hits the line of thread stretched out in front of him and bounces off a pipe and a wall tumbling towards an alleyway below Peter his eyes widening with alarm swings down towards him. Harry lies motionless on the ground. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. Peter hurries over to his unconscious old friend. He crouches down and holds his ear to Harry's mouth. He yanks open Harry's dark green jacket and starts pumping his chest. He listens again for signs of life. He carries his friend to an emergency room. Peter watches through a window as a crash team tries to revive Harry. A detective hands a file to tall thinfaced Captain Stacy. A police dog handler blows a whistle and points. Flint sprints across waste ground with armed officers running behind him. As he reaches a wire mesh fence an Alsatian lunges at him. He wrestles the dog off and punches it away. Flint climbs. Flint runs on and suddenly falls into a huge pit. He tumbles down a concrete wall and lands heavily on a pile of sand in the bottom of the pit. Slowly he hauls himself to his feet and looks desperately from side to side. He is caught in a dazzling beam of light. Above the pit three glowing capacitors begin to rotate like a merrygoround. Flint looks up nervously as the capacitors descend towards him and spin around him. They kick up a sandstorm with Flint trapped in the middle."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Harry banks around and sees Peter swinging between the buildings. He zooms down after Peter who swings into a narrow gap between the tall buildings propelling himself along from thread to thread. Harry turns the Sky Stick side on so he can fly along the narrow gap. dodging fire escapes and air con units as he air boards after Peter. Harry pulls a glowing green sword from a scabbard on his back and slashes wildly at Peter who swerves out of the way. Harry soars above Peter then plummets down to stab him but misses. Harry hurls a small golden pumpkin bomb at Peter. It opens up in midair into a kind of flying metallic bat. Harry throws more bombs at Peter. They slash at Peter who desperately tries to swing out of their way. He wrestles the dog off and punches it away. Flint climbs. Flint runs on and suddenly falls into a huge pit. He tumbles down a concrete wall and lands heavily on a pile of sand in the bottom of the pit. Slowly he hauls himself to his feet and looks desperately from side to side. He is caught in a dazzling beam of light. Above the pit three glowing capacitors begin to rotate like a merrygoround. Flint looks up nervously as the capacitors descend towards him and spin around him. They kick up a sandstorm with Flint trapped in the middle."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Harry banks around and sees Peter swinging between the buildings. He zooms down after Peter who swings into a narrow gap between the tall buildings propelling himself along from thread to thread. Harry turns the Sky Stick side on so he can fly along the narrow gap. dodging fire escapes and air con units as he air boards after Peter. He is caught in a dazzling beam of light. Above the pit three glowing capacitors begin to rotate like a merrygoround. Flint looks up nervously as the capacitors descend towards him and spin around him. They kick up a sandstorm with Flint trapped in the middle."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "A giraffe banks around and sees a turtle swinging between the buildings. The giraffe zooms down after the turtle, who swings into a narrow gap between the tall buildings, propelling itself along from thread to thread. A giraffe turns the Sky Stick side on so it can fly along the narrow gap, dodging fire escapes and air con units as it air boards after the turtle. A giraffe pulls a glowing green sword from a scabbard on its back and slashes wildly at the turtle, who swerves out of the way. A giraffe soars above the turtle, then plummets down to stab it but misses. A giraffe hurls a small, golden pumpkin bomb at the turtle. It opens up in mid-air into a kind of flying metallic bat. A giraffe throws more bombs at the turtle. They slash at the turtle who desperately tries to swing out of their way. It jumps off a pipe and swings back the way it came, just missing a giraffe. The winged bombs surge after the turtle and a giraffe gets caught in the swarm. One of them embeds its wing in the giraffe's shoulder. The giraffe yanks it out, zooms upwards into the air, and swoops on after the turtle. The turtle swings backwards, shooting webbing at the bombs and disabling them. One of them is caught in a thread, and the turtle swings it back at the giraffe. The giraffe flies through the explosion, shielding its eyes. It hits the line of thread stretched out in front of it and bounces off a pipe and a wall, tumbling towards an alleyway below. The turtle, its eyes widening with alarm, swings down towards it. The giraffe lies motionless on the ground. The turtle hurries over to its unconscious old friend. It crouches down and holds its ear to the giraffe's mouth. It yanks open the giraffe's dark green jacket and starts pumping its chest. It listens again for signs of life. It carries its friend to an emergency room. The turtle watches through a window as a crash team tries to revive the giraffe. A rabbit hands a file to tall, thin-faced Captain Stacy. A penguin blows a whistle and points. A kangaroo sprints across waste ground with armed officers running behind it. As it reaches a wire mesh fence an Alsatian lunges at it. The kangaroo wrestles the dog off and punches it away. The kangaroo climbs. The kangaroo runs on and suddenly falls into a huge pit. It tumbles down a concrete wall and lands heavily on a pile of sand in the bottom of the pit. Slowly, it hauls itself to its feet and looks desperately from side to side. It's caught in a dazzling beam of light. Above the pit, three glowing capacitors begin to rotate like a merry-go-round. The kangaroo looks up nervously as the capacitors descend towards it and spin around it. They kick up a sandstorm with the kangaroo trapped in the middle."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Harry banks around and sees Peter swinging between the trees. He zooms down after Peter, who swings into a narrow gap between the tall trees, propelling himself along from vine to vine. Harry turns the Glider Blade side on so he can fly along the narrow gap, dodging street lamps and laundry lines as he air boards after Peter. Harry pulls a glowing blue spear from a sheath on his side and slashes wildly at Peter, who swerves out of the way. Harry soars above Peter, then plummets down to stab him but misses. Harry hurls a small, silver apple bomb at Peter. It opens up in mid-air into a kind of flying metallic hawk. Harry throws more bombs at Peter. They slash at Peter who desperately tries to swing out of their way. He jumps off a branch and swings back the way he came, just missing Harry. The winged bombs surge after Peter and Harry gets caught in the swarm. One of them embeds its wing in his arm. He yanks it out, zooms upwards into the air, and swoops on after Peter. Peter swings backwards, shooting webbing at the bombs and disabling them. One of them is caught in a vine, and Peter swings it back at Harry. Harry flies through the explosion, shielding his eyes. He hits the string of vine stretched out in front of him and bounces off a branch and a tree, tumbling towards a ravine below. Peter, his eyes widening with alarm, swings down towards him. Harry lies motionless on the ground. Peter hurries over to his unconscious old friend. He crouches down and holds his ear to Harry's mouth. He yanks open Harry's dark blue coat and starts pumping his chest. He listens again for signs of life. He carries his friend to a veterinary clinic. Peter watches through a window as a rescue team tries to revive Harry. A courier hands a package to tall, narrow-faced Captain Stacy. A falcon handler blows a whistle and points. Flint sprints across a stone field with armed officers running behind him. As he reaches a wooden mesh gate an eagle lunges at him. He wrestles the bird off and punches it away. Flint climbs. Flint runs on and suddenly falls into a huge canyon. He tumbles down a rocky wall and lands heavily on a pile of gravel in the bottom of the canyon. Slowly, he hauls himself to his feet and looks desperately from side to side. He's caught in a dazzling beam of light. Above the canyon, three glowing turbines begin to rotate like a carousel. Flint looks up nervously as the turbines descend towards him and spin around him. They kick up a dust storm with Flint trapped in the middle."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Harry veers around and notices Peter gliding between the buildings. He jets down after Peter, who maneuvers into a narrow gap between the tall buildings, gliding himself along from thread to thread. Harry spins the Sky Stick side on so he can sail along the narrow gap, weaving through fire escapes and air con units as he sky surfs after Peter. Harry draws a glowing green sword from a scabbard on his back and waves it wildly at Peter, who dodges out of the way. Harry floats above Peter, then dives down to pierce him but misses. Harry flings a small, golden pumpkin bomb at Peter. It unfolds in mid-air into a kind of flying metallic bat. Harry tosses more bombs at Peter. They slice at Peter who desperately tries to glide out of their way. He leaps off a pipe and swings back the way he came, just avoiding Harry. The winged bombs dash after Peter and Harry gets entangled in the swarm. One of them catches its wing in his shoulder. He pulls it out, soars upwards into the air, and glides on after Peter. Peter swings backwards, launching webbing at the bombs and neutralizing them. One of them is trapped in a thread, and Peter swings it back at Harry. Harry flies through the explosion, covering his eyes. He collides with the line of thread stretched out in front of him and ricochets off a pipe and a wall, spiraling towards an alleyway below. Peter, his eyes widening with alarm, glides down towards him. Harry lies still on the ground. Peter rushes over to his unconscious old friend. He bends down and places his ear to Harry's mouth. He unzips Harry's dark green jacket and starts compressing his chest. He listens again for signs of life. He takes his friend to an emergency room. Peter observes through a window as a crash team attempts to revive Harry. A detective hands a file to tall, thin-faced Captain Stacy. A police dog handler signals with a whistle and gestures. Flint bolts across waste ground with armed officers chasing behind him. As he arrives at a wire mesh fence an Alsatian charges at him. He grapples with the dog and shoves it away. Flint scrambles up. Flint bolts on and suddenly plunges into a vast pit. He rolls down a concrete wall and lands soundly on a pile of sand in the bottom of the pit. Slowly, he pulls himself to his feet and glances nervously from side to side. He's ensnared in a dazzling beam of light. Above the pit, three glowing capacitors begin to whirl like a carousel. Flint gazes up anxiously as the capacitors descend towards him and circle around him. They stir up a sandstorm with Flint trapped in the center."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "George spins around and sees Alex soaring between the towers. He races down after Alex, who flies into a tight corridor between the towering towers, launching himself along from string to string. George rotates the Sky Glider sideways so he can glide along the tight corridor, weaving through balconies and satellite dishes as he sky surfs after Alex. George draws a shimmering blue spear from a sheath on his waist and slices fiercely at Alex, who dodges aside. George flies above Alex, then dives down to pierce him but misses. George flings a tiny, silver acorn grenade at Alex. It transforms in mid-air into a sort of flying bronze eagle. George throws additional grenades at Alex. They cut at Alex who frantically tries to glide out of their path. He leaps off a beam and swings back in the direction he came, narrowly missing George. The soaring grenades chase after Alex and George becomes entangled in the pack. One of them wedges its wing in his arm. He pulls it out, ascends swiftly into the sky, and dives on after Alex. Alex glides backwards, flinging web at the grenades and neutralizing them. One of them gets trapped in a string, and Alex swings it back at George. George flies through the blast, shielding his face. He collides with the string of rope stretched ahead of him and ricochets off a beam and a wall, spiraling towards a passage below. Alex, his eyes widening with concern, swings down toward him. George lies still on the ground. Alex rushes over to his unconscious old ally. He kneels down and presses his ear to George's lips. He rips open George's light blue coat and begins compressing his chest. He listens again for signs of breath. He takes his ally to a medical center. Alex observes through a pane as a rescue team attempts to resuscitate George. An investigator hands a dossier to lanky, narrow-faced Captain Mason. A canine officer blows a whistle and gestures. Mason races across open terrain with uniformed agents running after him. As he reaches a chain-link barrier a Retriever leaps at him. He grapples the dog off and shoves it away. Mason scales. Mason sprints on and suddenly topples into a massive crater. He rolls down a cement barrier and comes down hard on a mound of gravel at the base of the crater. Gradually, he pushes himself upright and glances frantically from side to side. He's trapped in a blinding shaft of illumination. Above the crater, three luminous conductors commence to whirl like a carousel. Mason gazes up apprehensively as the conductors lower toward him and circle around him. They stir up a whirlwind with Mason caught in the center."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Gary circles around and notices Kevin gliding between the skyscrapers. He rockets down after Kevin, who glides into a narrow gap between the towering structures, maneuvering himself along from cable to cable. Gary rotates the Hover Board sideways so he can drift through the narrow gap, weaving past balconies and satellite dishes as he sky surfs after Kevin. Gary draws a shimmering blue spear from a holder on his belt and jabs menacingly at Kevin, who dodges out of the path. Gary glides above Kevin, then descends rapidly to impale him but fails. Gary tosses a small, silver acorn at Kevin. It morphs in mid-air into a sort of flying metallic owl. Gary launches more acorns at Kevin. They dart at Kevin who frantically attempts to glide out of their trajectory. He leaps off a chimney and glides back the way he came, narrowly avoiding Gary. The mechanical owls chase after Kevin and Gary gets entangled in the flock. One of them lodges its beak in his arm. He pulls it out, propels upwards into the atmosphere, and dives on after Kevin. Kevin glides backwards, launching cords at the owls and deactivating them. One of them gets entangled in a cable, and Kevin sends it spiraling back at Gary. Gary flies through the detonation, covering his face. He collides with the cable stretched out in front of him and ricochets off a vent and a tower, spiraling towards a street below. Kevin, his eyes wide with shock, glides down towards him. Gary lies still on the pavement. Kevin rushes over to his unconscious longtime companion. He kneels down and presses his cheek to Gary's nose. He tears open Gary's navy blue coat and commences chest compressions. He checks again for any breath. He transports his companion to a medical facility. Kevin observes through a pane as a medical team attempts to resuscitate Gary. An investigator hands a report to tall, sharp-featured Chief Stevens. A K-9 unit supervisor toots a horn and gestures. Stone dashes across barren land with officers giving chase behind him. As he nears a chain-link barrier, a German Shepherd charges at him. He grapples with the dog and shoves it aside. Stone climbs. Stone continues and unexpectedly plummets into an enormous crater. He rolls down a cement slope and hits heavily on a mound of gravel at the base of the crater. Gradually, he pulls himself upright and scans nervously from side to side. He's ensnared in a blinding shaft of illumination. Above the crater, three radiant turbines start to whirl like a carousel. Stone gazes upward anxiously as the turbines lower towards him and revolve around him. They whip up a dust storm with Stone trapped at the core."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Harry veers around and spots Peter gliding between the skyscrapers. He dashes up after Peter, who glides into a tight corridor between the towering structures, catapulting himself along from vine to vine. Harry pivots the Cloud Rider sideways so he can sail through the tight corridor, weaving around chimneys and satellite dishes as he snowboards after Peter. Harry draws a shining blue flute from a holster on his back and flails it at Peter, who dodges out of the way. Harry sails above Peter, then dives down to jab him but misses. Harry flings a tiny, silver apple grenade at Peter. It transforms in mid-air into a kind of hovering robotic eagle. Harry tosses more grenades at Peter. They swipe at Peter who frantically tries to glide away. He leaps off a railing and glides back the way he came, narrowly avoiding Harry. The robotic eagles chase after Peter and Harry gets ensnared in the flock. One of them wedges its beak in his arm. He pulls it out, darts upward into the sky, and circles after Peter. Peter glides backwards, spraying ropes of silk at the eagles and disarming them. One of them gets snagged on a vine, and Peter swings it back at Harry. Harry shoots through the blast, shielding his face. He strikes the line of vine stretched across, bouncing off a railing and a building, tumbling toward a courtyard below. Peter, his eyes wide with concern, glides down towards him. Harry lays still on the ground. Peter rushes over to his unconscious old companion. He kneels down and listens at Harry's mouth. He unzips Harry's dark green coat and begins thumping his chest. He listens once more for signs of breath. He transports his comrade to a critical care unit. Peter gazes through a glass pane as a crash team strives to revive Harry. An inspector hands a dossier to lanky, gaunt-looking Captain Stacy. A K9 handler blasts a horn and gestures. Flint dashes across barren land with armed officers sprinting after him. As he nears a chain-link barrier, a Doberman leaps at him. He grapples the dog off and tosses it aside. Flint scales the fence. Flint races on and abruptly plummets into a massive trench. He tumbles down a brick wall and crashes heavily onto a heap of gravel at the trench's bottom. Gradually, he pulls himself upright and glances anxiously from left to right. He's ensnared in a brilliant beam of illumination. Above the trench, three radiant turbines start to revolve like a carousel. Flint looks upward anxiously as the turbines lower towards him and whirl around him. They stir up a dust storm with Flint caught at the center."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Gwen somersaults over and spots Tony gliding beneath the bridges. She darts up before Tony, who glides into a spacious lagoon beneath the short bridges, launching himself across from vine to vine. Gwen spins the Cloud Board sideways so she can sail across the spacious lagoon, weaving around chimneys and satellite dishes as she cloud surfs before Tony. Gwen draws a shimmering blue dagger from a holster on her belt and swings fiercely at Tony, who twirls out of the path. Gwen glides below Tony, then rises up to strike him but overshoots. Gwen lobs a tiny, silver apple grenade at Tony. It blossoms mid-drop into a sort of buzzing silver owl. Gwen sends more grenades at Tony. They slice at Tony who frantically attempts to glide away from their reach. He vaults off a ladder and glides back to where he started, narrowly avoiding Gwen. The metallic owls whirl after Tony and Gwen finds herself caught in the flurry. One of them drives its talon into her arm. She pulls it out, darts skyward into the clouds, and spirals after Tony. Tony glides in reverse, casting strands at the owls and neutralizing them. One of them is ensnared in a vine, and Tony hurls it back at Gwen. Gwen drifts through the detonation, covering her face. She collides with the strand of vine stretched out above her and bounces off a ladder and a fence, plunging towards a courtyard below. Tony, his eyes widening with fear, glides down after her. Gwen lies unmoving on the pavement. Tony rushes over to his unconscious childhood buddy. He kneels down and checks his hand to Gwen's lips. He unzips Gwen's light blue hoodie and begins pressing her chest. He listens again for any breath. He carries his buddy to an ambulance. Tony peers through a curtain as a rescue team attempts to revive Gwen. A sergeant passes a note to short, round-faced Officer Lee. A search falconer blows a horn and gestures. Clay charges across barren land with guards dashing behind him. As he climbs a chain-link barricade a Labrador pounces at him. He grapples the hound off and shoves it away. Clay scales up. Clay dashes on and abruptly stumbles into a deep sinkhole. He crashes down a brick face and lands harshly on a mound of gravel at the base of the pit. Gradually, he pushes himself to his legs and gazes anxiously from corner to corner. He's trapped in a blinding shaft of light. Above the pit, four blazing turbines start to whirl like a carousel. Clay glances up warily as the turbines lower towards him and twirl around him. They whip up a dust storm with Clay stuck in the vortex."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Harry pursues Peter, who is swinging between buildings. To follow, Harry maneuvers his Sky Stick through narrow gaps, avoiding obstacles. He draws a glowing sword, attacking Peter, who dodges. Harry misses a stab attempt and throws pumpkin bombs, which turn into metallic bats. As they swarm Peter, he evades and disables them with webs, redirecting one bomb back at Harry. The ensuing explosion sends Harry crashing into an alley. Alarmed, Peter swings down, checks Harry’s condition, and rushes him to the emergency room. Meanwhile, Flint, pursued by police, escapes across waste ground but falls into a pit. Trapped, he faces rotating capacitors that stir a sandstorm around him."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "They kick up a sandstorm with Flint trapped in the middle Flint looks up nervously as the capacitors descend towards him and spin around him Above the pit three glowing capacitors begin to rotate like a merrygoround He is caught in a dazzling beam of light Slowly he hauls himself to his feet and looks desperately from side to side He tumbles down a concrete wall and lands heavily on a pile of sand in the bottom of the pit Flint runs on and suddenly falls into a huge pit Flint climbs He wrestles the dog off and punches it away As he reaches a wire mesh fence an Alsatian lunges at him Flint sprints across waste ground with armed officers running behind him A police dog handler blows a whistle and points A detective hands a file to tall thinfaced Captain Stacy Peter watches through a window as a crash team tries to revive Harry He carries his friend to an emergency room He listens again for signs of life He yanks open Harry's dark green jacket and starts pumping his chest He crouches down and holds his ear to Harry's mouth Peter hurries over to his unconscious old friend Harry lies motionless on the ground He hits the line of thread stretched out in front of him and bounces off a pipe and a wall tumbling towards an alleyway below Peter his eyes widening with alarm swings down towards him Harry flies through the explosion shielding his eyes One of them is caught in a thread and Peter swings it back at Harry Peter swings backwards shooting webbing at the bombs and disabling them He yanks it out zooms upwards into the air and swoops on after Peter One of them embeds its wing in his shoulder The winged bombs surge after Peter and Harry gets caught in the swarm He jumps off a pipe and swings back the way he came just missing Harry They slash at Peter who desperately tries to swing out of their way Harry throws more bombs at Peter It opens up in midair into a kind of flying metallic bat Harry hurls a small golden pumpkin bomb at Peter Harry soars above Peter then plummets down to stab him but misses Harry pulls a glowing green sword from a scabbard on his back and slashes wildly at Peter who swerves out of the way dodging fire escapes and air con units as he air boards after Peter Harry turns the Sky Stick side on so he can fly along the narrow gap He zooms down after Peter who swings into a narrow gap between the tall buildings propelling himself along from thread to thread Harry banks around and sees Peter swinging between the buildings"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "The winged bombs surge after Peter and Harry gets caught in the swarm Slowly he hauls himself to his feet and looks desperately from side to side He jumps off a pipe and swings back the way he came just missing Harry He tumbles down a concrete wall and lands heavily on a pile of sand in the bottom of the pit He is caught in a dazzling beam of light He wrestles the dog off and punches it away One of them embeds its wing in his shoulder Harry soars above Peter then plummets down to stab him but misses A detective hands a file to tall thinfaced Captain Stacy Flint climbs Flint sprints across waste ground with armed officers running behind him Harry pulls a glowing green sword from a scabbard on his back and slashes wildly at Peter who swerves out of the way They slash at Peter who desperately tries to swing out of their way Peter hurries over to his unconscious old friend dodging fire escapes and air con units as he air boards after Peter Peter watches through a window as a crash team tries to revive Harry He crouches down and holds his ear to Harry's mouth He listens again for signs of life Harry flies through the explosion shielding his eyes They kick up a sandstorm with Flint trapped in the middle Flint runs on and suddenly falls into a huge pit A police dog handler blows a whistle and points Harry banks around and sees Peter swinging between the buildings Flint looks up nervously as the capacitors descend towards him and spin around him He yanks it out zooms upwards into the air and swoops on after Peter Harry lies motionless on the ground Harry turns the Sky Stick side on so he can fly along the narrow gap Above the pit three glowing capacitors begin to rotate like a merrygoround As he reaches a wire mesh fence an Alsatian lunges at him He carries his friend to an emergency room He yanks open Harry's dark green jacket and starts pumping his chest Harry hurls a small golden pumpkin bomb at Peter Harry throws more bombs at Peter Peter swings backwards shooting webbing at the bombs and disabling them One of them is caught in a thread and Peter swings it back at Harry He hits the line of thread stretched out in front of him and bounces off a pipe and a wall tumbling towards an alleyway below Peter his eyes widening with alarm swings down towards him He zooms down after Peter who swings into a narrow gap between the tall buildings propelling himself along from thread to thread It opens up in midair into a kind of flying metallic bat"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Peter hurries over to his unconscious old friend He crouches down and holds his ear to Harry's mouth He yanks open Harry's dark green jacket and starts pumping his chest He listens again for signs of life He carries his friend to an emergency room Peter watches through a window as a crash team tries to revive Harry A detective hands a file to tall thinfaced Captain Stacy A police dog handler blows a whistle and points Flint sprints across waste ground with armed officers running behind him As he reaches a wire mesh fence an Alsatian lunges at him He wrestles the dog off and punches it away Flint climbs Flint runs on and suddenly falls into a huge pit He tumbles down a concrete wall and lands heavily on a pile of sand in the bottom of the pit Slowly he hauls himself to his feet and looks desperately from side to side He is caught in a dazzling beam of light Above the pit three glowing capacitors begin to rotate like a merrygoround Flint looks up nervously as the capacitors descend towards him and spin around him They kick up a sandstorm with Flint trapped in the middle Harry banks around and sees Peter swinging between the buildings He zooms down after Peter who swings into a narrow gap between the tall buildings propelling himself along from thread to thread Harry turns the Sky Stick side on so he can fly along the narrow gap dodging fire escapes and air con units as he air boards after Peter Harry pulls a glowing green sword from a scabbard on his back and slashes wildly at Peter who swerves out of the way Harry soars above Peter then plummets down to stab him but misses Harry hurls a small golden pumpkin bomb at Peter It opens up in midair into a kind of flying metallic bat Harry throws more bombs at Peter They slash at Peter who desperately tries to swing out of their way He jumps off a pipe and swings back the way he came just missing Harry The winged bombs surge after Peter and Harry gets caught in the swarm One of them embeds its wing in his shoulder He yanks it out zooms upwards into the air and swoops on after Peter Peter swings backwards shooting webbing at the bombs and disabling them One of them is caught in a thread and Peter swings it back at Harry Harry flies through the explosion shielding his eyes He hits the line of thread stretched out in front of him and bounces off a pipe and a wall tumbling towards an alleyway below Peter his eyes widening with alarm swings down towards him Harry lies motionless on the ground"
        }
      ]
    }
  ]
}