{
  "ground_truth": "A bearded man knocks into Jack and spills his beer on Rose. Bjorn slammed Thomas' fist to the tabletop. Rose pulls Tommy's cigarette from his mouth. Rose puffs on it. She blows out smoke and hands Jack the hem of her skirt. As Jack holds onto her dress, Rose slowly lifts her heels and rises onto her toes. Jack gazes down as Rose stands on her tiptoes and collapses into Jack's arms. Cal's manservant, Lovejoy, descends halfway down the staircase and peers around the room. He spies Jack holding Rose in his arms. The couples hold hands as they dance in a line through the crowded room. Fabrizio grabs Rose's hand and she grabs Jack. The line of dancers snake through the clapping drinking crowd. The next day, Rose and Cal eat breakfast at a table in the private promenade. Cal shakes his head. As Rose stirs her coffee, she and Cal exchange glances. Cal stands and flips over their dining table. Cal walks away. As he steps through the doorway, an aproned woman rushes over to Rose, then bends and picks up dishes. Rose crouches to help. Rose lays her hand on dark haired Trudy's shoulder and sinks against her chair. Later in Rose's room, Trudy laces up the back of Rose's corset. Ruth steps in. Trudy curtsies and steps out. Ruth walks to Rose and ties the laces of her corset. Turning her head, Ruth covers her mouth. She closes her eyes, exhales, and drops her hand. Ruth turns back to Rose. Ruth gazes at Rose, then reaches out her hands. Gently cradling Rose's face, Ruth kisses her cheek. She turns Rose back around, then continues lacing the corset. Rose grimaces as Ruth tightens the laces. In the dining room, a man plays piano as first class passengers, holding sheet music, sing. Rose stands between Cal and her mother. Jack descends the grand staircase. One hand in his pocket, Jack strolls toward the dining room where two stewards stand outside its doors. One steward wearing a dark suit steps in front of Jack. Inside, Lovejoy steps toward the door. Lovejoy emerges. Lovejoy hands the money to the steward. The two stewards escort Jack away. On the bridge, a crewman steps up to the captain. Captain Smith reads a note, then smiles at Ruth. Outside, Jack climbs a railing, then hops onto a deck where a boy wearing a cap winds a string around a top. The boy spins the top on the deck. Jack steps toward another railing, pauses, and picks up a black bowler hat and long coat from a chair. Donning the hat, Jack wets his fingers and plasters down his hair. Wearing the hat and coat, Jack grabs Rose's arm.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "A whiskered gentleman bumps into Jack and spills his ale on Rose. Bjorn slammed Thomas' fist onto the tabletop. Rose takes Tommy's cigarette from his mouth. Rose inhales on it. She exhales vapor and hands Jack the edge of her skirt. As Jack grasps onto her dress, Rose gradually lifts her heels and elevates onto her toes. Jack looks down as Rose stands on her tiptoes and falls into Jack's arms. Cal's valet, Lovejoy, descends partway down the staircase and observes around the room. He spots Jack holding Rose in his arms. The pairs hold hands as they dance in a line through the crowded room. Fabrizio seizes Rose's hand and she seizes Jack. The line of dancers winds through the applauding imbibing crowd. The following day, Rose and Cal consume breakfast at a table in the exclusive promenade. Cal shakes his head. As Rose stirs her coffee, she and Cal swap glances. Cal stands and overturns their dining table. Cal departs. As he steps through the doorway, an aproned lady rushes over to Rose, then bends and picks up dishes. Rose crouches to help. Rose places her hand on dark-haired Trudy's shoulder and sinks against her chair. Later in Rose's room, Trudy laces up the back of Rose's corset. Ruth enters. Trudy curtsies and exits. Ruth walks to Rose and ties the laces of her corset. Turning her head, Ruth covers her mouth. She shuts her eyes, exhales, and lowers her hand. Ruth turns back to Rose. Ruth looks at Rose, then reaches out her hands. Tenderly holding Rose's face, Ruth kisses her cheek. She turns Rose back around, then continues lacing the corset. Rose winces as Ruth tightens the laces. In the dining room, a gentleman plays piano as first-class passengers, holding sheet music, sing. Rose stands between Cal and her mother. Jack descends the grand staircase. One hand in his pocket, Jack saunters toward the dining room where two stewards stand outside its doors. One steward wearing a dark suit steps in front of Jack. Inside, Lovejoy steps toward the door. Lovejoy exits. Lovejoy hands the cash to the steward. The two stewards accompany Jack away. On the bridge, a crewman steps up to the captain. Captain Smith reads a note, then smiles at Ruth. Outside, Jack climbs a railing, then jumps onto a deck where a boy wearing a cap winds a thread around a top. The boy spins the top on the deck. Jack steps toward another railing, pauses, and picks up a black derby hat and long coat from a chair. Donning the hat, Jack moistens his fingers and slicks down his hair. Wearing the hat and coat, Jack grabs Rose's arm."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "A bearded man is knocked into by Jack, and beer is spilled on Rose. Thomas' fist was slammed to the tabletop by Bjorn. Tommy's cigarette is pulled from his mouth by Rose. It is puffed on by Rose. Smoke is blown out, and the hem of her skirt is handed to Jack by her. As her dress is held onto by Jack, her heels are slowly lifted by Rose, and she rises onto her toes. A gaze is directed down by Jack as Rose stands on her tiptoes and collapses into Jack's arms. Lovejoy, Cal's manservant, descends halfway down the staircase and peers around the room. He spies Jack, who is holding Rose in his arms. Hands are held by the couples as a line is danced through the crowded room. Rose's hand is grabbed by Fabrizio, and Jack is grabbed by her. The clapping drinking crowd is snaked through by the line of dancers. The next day, breakfast is eaten by Rose and Cal at a table in the private promenade. His head is shaken by Cal. As her coffee is stirred by Rose, glances are exchanged between her and Cal. Their dining table is flipped over by Cal as he stands. He walks away. As the doorway is stepped through by him, an aproned woman rushes over to Rose, then bends and picks up dishes. Help is given by Rose as she crouches. Rose's hand is laid on dark-haired Trudy's shoulder, and Rose sinks against her chair. Later in Rose's room, the back of Rose's corset is laced up by Trudy. Ruth steps in. Trudy curtsies and steps out. Ruth walks to Rose and laces her corset. Ruth covers her mouth, turning her head. Her eyes are closed, and she exhales and drops her hand. Ruth turns back to Rose. A gaze is directed at Rose by Ruth, then hands are reached out. Rose's face is gently cradled by Ruth, and her cheek is kissed. Rose is turned back around by her, and the corset is continued to be laced. A grimace is made by Rose as the laces are tightened by Ruth. In the dining room, a piano is played by a man as first-class passengers, holding sheet music, sing. She stands between Cal and her mother. The grand staircase is descended by Jack. One hand in his pocket, the dining room is strolled toward by Jack, where two stewards stand outside its doors. Jack is stepped in front of by one steward wearing a dark suit. Inside, the door is stepped toward by Lovejoy. Lovejoy emerges. Money is handed to the steward by Lovejoy. Jack is escorted away by the two stewards. On the bridge, the captain is stepped up to by a crewman. A note is read by Captain Smith, then a smile is directed at Ruth by him. Outside, a railing is climbed by Jack, then a deck is hopped onto where a string is wound around a top by a boy wearing a cap. The top is spun on the deck by the boy. Jack steps toward another railing, pauses, and picks up a black bowler hat and long coat from a chair. The hat is donned by Jack, then his fingers are wetted, and his hair is plastered down. Wearing the hat and coat, Rose's arm is grabbed by Jack."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "A bearded man bumps into Jack, spilling beer on Rose. Bjorn slams Thomas' fist on the table. Rose takes Tommy's cigarette, puffs, and hands Jack her skirt hem. Jack holds her dress as Rose rises on tiptoes and collapses into his arms. Lovejoy, Cal's manservant, spots Jack holding Rose. Couples hold hands, dancing through the crowded room. Fabrizio grabs Rose's hand, linking her to Jack as they snake through the clapping crowd. The next day, Rose and Cal breakfast in the private promenade. Cal shakes his head, flips the table, and leaves. An aproned woman rushes to Rose, picking up dishes as Rose helps. Rose touches Trudy's shoulder before sinking into her chair. Later, Trudy laces Rose's corset before Ruth enters, taking over. Ruth pauses, covering her mouth, then resumes lacing while cradling Rose's face and kissing her cheek. Rose grimaces as the laces tighten. In the dining room, a pianist plays while first-class passengers sing. Rose stands between Cal and her mother. Jack descends the grand staircase and approaches the dining room, where a steward stops him. Lovejoy pays the steward, and they escort Jack away. On the bridge, a crewman talks to Captain Smith, who smiles at Ruth. Outside, Jack climbs a railing, hops onto a deck, and picks up a hat and coat. He dons the hat, wets his fingers, and slicks his hair, then grabs Rose's arm."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "A bearded man collides with Jack, spilling beer on Rose. Bjorn slams Tommy's fist on the table. Rose takes Tommy's cigarette, puffs it, and gives Jack her skirt hem. Jack holds her dress as Rose rises on tiptoes and falls into his arms. Lovejoy spies Jack holding Rose. Dancers hand in hand, including Fabrizio, Rose, and Jack, weave through the crowd. The next morning, Rose and Cal breakfast privately. Cal flips the table, walks away, and an aproned woman helps Rose pick up dishes. Rose touches Trudy's shoulder, sinking into her chair. Later, Trudy laces Rose’s corset, Ruth enters, ties the laces, covers her mouth, and kisses Rose's cheek before tightening the corset. In the dining room, a man plays piano while passengers sing. Rose stands with Cal and her mother as Jack descends the grand staircase. A steward blocks Jack’s way, but Lovejoy bribes him, and stewards escort Jack away. Captain Smith smiles at Ruth after reading a note. Outside, Jack jumps a railing, retrieves a hat and coat, then grabs Rose's arm."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "A man with a beard accidentally bumps into Jack, causing Jack's beer to spill onto Rose, much to her surprise. Nearby, Bjorn forcefully slams Thomas' fist onto the table, creating a loud thud. Rose, with a nonchalant attitude, reaches over and removes Tommy's cigarette from his mouth, taking a drag. As she inhales deeply, she leisurely exhales a cloud of smoke, offering Jack the hem of her skirt for support. Gripping her dress firmly, Jack watches as Rose delicately lifts herself onto her toes, elevating her heels in a graceful motion. Jack's eyes follow her as she stands on her tiptoes before collapsing playfully into his arms. Meanwhile, Cal's manservant, Lovejoy, descends the staircase, halting halfway to scan the room. His eyes catch sight of Jack embracing Rose tenderly. The couples in the room join hands, dancing joyously in a line that weaves through the bustling, crowded room. Fabrizio eagerly takes Rose's hand, and she promptly reaches for Jack's, creating a chain of dancers that snakes through the lively, clapping, and drinking crowd. \n\nThe following day, Rose and Cal are seated at a table in a private promenade, sharing breakfast. Cal shakes his head disapprovingly as Rose gently stirs her coffee, and the two exchange a series of complex glances. Without warning, Cal stands abruptly and overturns their dining table in a fit of anger. As Cal storms out through the doorway, an aproned woman immediately rushes over to assist Rose, bending down to pick up the scattered dishes. Rose crouches down to offer her help as well. Placing her hand gently on the shoulder of the dark-haired woman named Trudy, Rose sinks back into her chair with a weary expression. \n\nLater in her room, Trudy helps Rose by lacing up the back of her corset meticulously. Ruth enters the room, prompting Trudy to perform a quick curtsy before she steps out to give them privacy. Ruth approaches Rose and takes over the task of tightening the corset laces. Pausing momentarily, Ruth turns her head away, covering her mouth as she closes her eyes, exhales softly, and lowers her hand. She turns back to face Rose, gazing at her daughter with a mixture of emotions before reaching out to cradle Rose's face gently, placing a soft kiss on her cheek. Turning Rose back around, Ruth continues the task of lacing up the corset, pulling the laces tighter, causing Rose to grimace slightly under the pressure.\n\nElsewhere, in the elegant dining room, a man plays the piano while first-class passengers, holding sheet music, join in song. Rose stands between Cal and her mother as Jack makes his descent down the grand staircase. With one hand casually tucked in his pocket, Jack strolls confidently toward the entrance of the dining room, where two stewards stand guard. One of the stewards, dressed in a dark suit, steps forward to intercept Jack. Inside the room, Lovejoy moves toward the door, emerging to hand money discreetly to the steward. Consequently, the two stewards escort Jack away from the area. On the ship's bridge, a crewman approaches Captain Smith, who reads a note and then offers a smile in Ruth's direction. Outside, Jack climbs over a railing and hops onto the deck, where a young boy wearing a cap is winding a string around a spinning top. The boy sets the top spinning on the wooden deck. Jack continues his path to another nearby railing, where he pauses to pick up a black bowler hat and a long coat from a chair. After donning the hat, Jack wets his fingers to slick down his hair. Now wearing the hat and coat, Jack confidently approaches and takes hold of Rose's arm."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "A bearded man unintentionally bumps into Jack, which inadvertently causes Jack's beer to spill all over Rose, leaving her quite surprised and taken aback. Nearby, Bjorn forcefully slams Thomas’ fist onto the sturdy table, creating an alarmingly loud thud that resonates through the room. Meanwhile, with a nonchalant attitude and a seemingly casual demeanor, Rose reaches over and removes Tommy's cigarette from his mouth, as if it were the most natural thing in the world, and takes a leisurely drag. As she inhales the smoke deeply, she exhales a cloud of smoke in a languid manner, then offers the hem of her skirt to Jack for support. Gripping her dress firmly, Jack attentively watches as Rose delicately lifts herself onto her toes, elevating her heels with a graceful motion. Jack's eyes follow her every movement as she beautifully stands on her tiptoes only to collapse playfully into his awaiting arms. Meanwhile, Cal's manservant, Lovejoy, descends the staircase with calculated steps, halting purposefully halfway down to cast a careful glance over the room. His eyes catch sight of Jack embracing Rose tenderly in his arms. The couples in the room join hands harmoniously, starting to dance joyously in a line that weaves through the bustling, crowded room, filled with merriment. Fabrizio eagerly takes Rose's hand, and she promptly reaches for Jack's hand, creating a continuous chain of dancers that snakes cheerfully through the lively, clapping, and drinking crowd.\n\nThe following day, Rose and Cal are seated at an elegantly set table in a private promenade, sharing breakfast. Cal shakes his head with disapproval as Rose gently stirs her coffee with a serene expression, and the two exchange a series of complex, meaningful glances. Without warning, Cal stands abruptly from his chair and overturns their entire dining table in a sudden fit of anger. As Cal storms furiously out through the doorway, an aproned woman immediately rushes over to assist Rose, bending down quickly to pick up the scattered dishes from the ground. Rose crouches down as well to offer her help. Placing her hand gently and supportively on the shoulder of the dark-haired woman named Trudy, Rose sinks back into her chair with a weary and tired expression.\n\nLater in her room, Trudy helps Rose by meticulously and carefully lacing up the back of her corset. As Ruth enters the room, Trudy performs a quick, respectful curtsy before stepping out to give them some privacy. Ruth approaches Rose and takes over the challenging task of tightening the corset laces. Pausing momentarily, Ruth turns her head away, covering her mouth as she closes her eyes, exhaling softly, lowering her hand with a thoughtful expression. She turns back to face Rose, gazing at her daughter with a complex mixture of emotions before reaching out to cradle Rose's face gently, placing a soft, tender kiss on her cheek. Turning Rose back around, Ruth continues the task of lacing up the corset, pulling the laces even tighter, causing Rose to grimace slightly from the pressure.\n\nElsewhere, in the elegant and opulent dining room, a man plays the piano as first-class passengers, holding sheet music in their hands, join in song. Rose stands between Cal and her mother, as Jack makes his descent down the grand staircase with a sense of purpose. With one hand casually tucked in his pocket, Jack strolls confidently toward the entrance of the dining room, where two stewards stand dutifully guard. One of the stewards, dressed in a dark suit, steps forward to intercept Jack as he approaches. Inside the room, Lovejoy moves toward the door, emerging to discreetly hand money to the steward. Consequently, the two stewards promptly escort Jack away from the area. On the ship's bridge, a crewman approaches Captain Smith, who reads a note and then offers a polite smile in Ruth's direction. Outside, Jack climbs over a railing and hops nimbly onto the deck, where a young boy wearing a cap is winding a string around a spinning top. The boy sets the top spinning on the wooden deck with ease. Jack continues his path to another nearby railing, where he pauses momentarily to pick up a black bowler hat and a long coat from a chair. After donning the hat, Jack wets his fingers to slick down his hair, ensuring he looks the part. Now wearing the hat and coat, Jack confidently approaches and takes hold of Rose's arm, ready for whatever comes next."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "A bearded man accidentally collides with Jack, causing Jack's beer to spill onto Rose. In the ensuing commotion, Bjorn forcefully slams Thomas' fist down onto the tabletop, creating a loud bang. Meanwhile, Rose, unfazed by the disturbance, reaches over and deftly pulls Tommy's cigarette from his mouth, bringing it to her own lips for a puff. She inhales the smoke leisurely, allowing it to fill her lungs before she exhales gracefully, letting out a stream of smoke. Afterward, with a playful gesture, she hands Jack the hem of her skirt. As Jack takes hold of her dress, Rose slowly and deliberately lifts her heels, rising onto her toes, which causes Jack to look down at her. Standing on her tiptoes, Rose becomes unsteady and collapses gently into Jack's waiting arms. Across the room, Cal's manservant, Lovejoy, begins his descent down the staircase, stopping halfway to discreetly scan the room. His gaze lands on the poignant sight of Jack cradling Rose in his arms. Amid the lively atmosphere, couples clasp hands and sway in a line, dancing through the throng of people filling the room. Fabrizio enthusiastically reaches for Rose's hand, prompting her to quickly grasp Jack's, creating a chain of dancers. They weave their way through the clapping, cheering crowd, forming a sinuous line that snakes through the bustling room. The following day, as the morning sun filters into the private promenade, Rose and Cal sit across from each other, eating breakfast. Cal shakes his head slightly, perhaps in disapproval or contemplation, as Rose stirs her coffee, her spoon gently clinking against the cup. Their eyes meet briefly, exchanging wordless communication. Suddenly, Cal rises abruptly and, in a burst of anger, flips their dining table over, sending dishes clattering to the floor. He strides purposefully away from the chaos he created, exiting through the doorway as an aproned woman rushes over to the scene, bending quickly to pick up the scattered dishes. Observing the mess with a sense of duty, Rose crouches down to assist the woman. She lays a comforting hand on the shoulder of a dark-haired girl named Trudy, then sinks back against her chair, overwhelmed by the morning's drama. Later, in the sanctuary of her room, Trudy skillfully weaves the laces of Rose's corset, pulling them taut. Ruth, Rose's mother, enters the room, prompting Trudy to curtsy respectfully before stepping out. Ruth approaches Rose and takes over the task, deftly tying the corset laces with practiced hands. Turning her head to the side, Ruth covers her mouth with her hand, momentarily lost in thought. She closes her eyes, exhales softly, and lets her hand fall back to her side before refocusing on the task at hand. With a tender expression, Ruth gently cradles Rose's face in her hands and plants a soft kiss on her cheek. Then, she turns Rose around to continue tightening the corset, causing Rose to grimace slightly as the laces are pulled securely. In the elegant dining room, the melodious sound of a piano fills the air as first-class passengers, holding sheet music, sing in harmony. Rose stands poised between Cal and her mother, observing the scene. Meanwhile, Jack begins his descent down the grand staircase, one hand casually tucked into his pocket, exuding an air of confidence. He strides purposefully toward the dining room, where two stewards stand attentively outside its doors. As Jack approaches, one of the stewards, dressed smartly in a dark suit, steps in front of him, blocking his path. Inside, Lovejoy moves toward the door and emerges, swiftly handing money to the steward as a means of persuasion. Consequently, the two stewards escort Jack away from the dining room, ensuring his compliant departure. Elsewhere, on the ship's bridge, a crewman approaches Captain Smith, who reads a note and then, with a warm smile, acknowledges Ruth. Outside on the deck, Jack demonstrates his adventurous spirit by climbing onto a railing, then hopping down to a lower deck where a young boy wearing a cap is absorbed in winding a string around a top. The boy skillfully spins the top, watching it twirl across the wooden boards. Nearby, Jack pauses momentarily at another railing, spotting a black bowler hat and a long coat draped over a chair. He picks them up and dons the hat, then wets his fingers to slick down his hair, ensuring a neat appearance. Now wearing both the hat and coat, Jack confidently strides forward, decisively reaching out to grab Rose's arm."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "A bearded man bumps into Jack, spilling beer on Rose. Bjorn forces Thomas' fist onto the table, while Rose takes Tommy's cigarette, smokes it, and passes the skirt hem to Jack. Jack holds her dress as Rose lifts onto her toes and falls into his arms. Lovejoy, Cal's manservant, notices Jack holding Rose as couples dance hand in hand through the crowd. Fabrizio links Rose and Jack into the dancers' line. The following day, at breakfast, Cal and Rose exchange glances before Cal suddenly upends the table and walks off. An aproned woman rushes to help clean, and Rose aids her before leaning against her chair. Later, Trudy begins lacing Rose's corset before Ruth takes over, softly comforting Rose with a kiss before tightening the laces. In the dining room, passengers sing along to piano music with Rose between Cal and her mother. Jack approaches the dining room but is intercepted by stewards after Lovejoy pays them. On the bridge, Captain Smith reads a note and smiles at Ruth. Meanwhile, Jack climbs a railing to a deck, observing a boy spinning a top, then picks up a hat and coat from a chair. Dressed in them, he slicks his hair and joins Rose by taking her arm."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "A bearded man, likely a sailor given the setting aboard a ship, knocks into Jack, a third-class passenger on the Titanic, and spills his beer on Rose, a young woman from first class. Bjorn, known for his Scandinavian strength, slammed Thomas' fist to the tabletop during a heated card game. Rose, defying the rigid social norms of the early 20th century, pulls Tommy's cigarette from his mouth. Rose puffs on it with a sense of rebellion. She blows out smoke and hands Jack the hem of her skirt, a delicate fabric typical of the era's fashion. As Jack holds onto her dress in an impromptu embrace, Rose slowly lifts her heels and rises onto her toes, performing a playful, impromptu dance move common at lively gatherings. Jack gazes down with admiration as Rose stands on her tiptoes and collapses into Jack's arms, a gesture of trust and affection. Cal's manservant, Lovejoy, a shrewd and observant character, descends halfway down the grand staircase and peers around the opulent room. He spies Jack holding Rose in his arms, a scene that contradicts the societal expectations of their separate social classes. The couples hold hands as they dance in a line through the crowded room, reflecting the carefree spirit of the evening. Fabrizio, Jack's exuberant Italian friend, grabs Rose's hand, and she grabs Jack, joining a line of dancers that snake through the clapping, drinking crowd, reminiscent of the lively steerage parties. The next day, Rose and Cal eat breakfast at a table in the private promenade, the most exclusive dining area on the ship. Cal shakes his head, displeased with the previous night's events. As Rose stirs her coffee, she and Cal exchange glances, indicating a silent tension between them. Cal stands and flips over their dining table, a dramatic outburst of his controlling nature. As he steps through the doorway, an aproned woman, presumably a stewardess accustomed to tidying after first-class passengers, rushes over to Rose, then bends and picks up dishes. Rose crouches to help, displaying her compassion. Rose lays her hand on dark-haired Trudy's shoulder, her loyal maid, and sinks against her chair, feeling overwhelmed. Later in Rose's opulent room, Trudy laces up the back of Rose's corset, a task that reflects the restrictive fashion of the time. Ruth, Rose's mother and an emblem of societal expectations, steps in. Trudy curtsies in deference and steps out. Ruth walks to Rose and ties the laces of her corset, reinforcing the social pressures Rose faces. Turning her head, Ruth covers her mouth, perhaps to stifle a cough or conceal her emotions. She closes her eyes, exhales, and drops her hand, a moment of introspection. Ruth turns back to Rose and gazes at her daughter, then reaches out her hands. Gently cradling Rose's face, Ruth kisses her cheek, a rare gesture of maternal affection. She turns Rose back around, then continues lacing the corset, which causes Rose to grimace as Ruth tightens the laces, an expression of the literal and metaphorical constraints she endures. In the dining room, a man plays piano as first-class passengers, holding sheet music, join in song, a common entertainment in the luxurious ship's dining hall. Rose stands between Cal and her mother, caught between her fiancé's world and her family's expectations. Jack descends the grand staircase, an architectural marvel of the Titanic, with one hand in his pocket, Jack strolls toward the dining room where two stewards stand outside its grand doors. One steward, wearing a formal dark suit, steps in front of Jack, signaling the divide between classes. Inside, Lovejoy steps toward the door, his loyalty to Cal keeping him vigilant. Lovejoy emerges and discreetly hands the money to the steward, a transaction to ensure Jack's absence. The two stewards escort Jack away, preventing him from disrupting the first-class area. On the bridge, a crewman steps up to the captain, Captain Smith, who reads a note and then smiles at Ruth, sharing a brief moment of acknowledgment. Outside, Jack climbs a railing, then hops onto a secluded deck where a boy wearing a cap winds a string around a top, a classic children's toy of the era. The boy spins the top on the deck, adding to the scene's authenticity. Jack steps toward another railing, pauses, and picks up a black bowler hat and long coat from a chair, clothing left by a previous occupant. Donning the hat, Jack wets his fingers and plasters down his hair, adopting a new guise. Wearing the hat and coat, Jack grabs Rose's arm, ready to whisk her away on another adventure, further defying the constraints of their social classes."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Jack gazes down as Rose stands on her tiptoes and collapses into Jack's arms A bearded man knocks into Jack and spills his beer on Rose Bjorn slammed Thomas' fist to the tabletop Rose pulls Tommy's cigarette from his mouth Rose puffs on it She blows out smoke and hands Jack the hem of her skirt As Jack holds onto her dress Rose slowly lifts her heels and rises onto her toes Jack gazes down as Rose stands on her tiptoes and collapses into Jack's arms Cal's manservant Lovejoy descends halfway down the staircase and peers around the room He spies Jack holding Rose in his arms One steward wearing a dark suit steps in front of Jack The boy spins the top on the deck Trudy curtsies and steps out The couples hold hands as they dance in a line through the crowded room Fabrizio grabs Rose's hand and she grabs Jack Jack strolls toward the dining room where two stewards stand outside its doors The line of dancers snake through the clapping drinking crowd The next day Rose and Cal eat breakfast at a table in the private promenade Cal shakes his head Cal's manservant Lovejoy descends halfway down the staircase and peers around the room As Rose stirs her coffee she and Cal exchange glances Cal stands and flips over their dining table Cal shakes his head Cal stands and flips over their dining table Cal walks away As he steps through the doorway an aproned woman rushes over to Rose then bends and picks up dishes Rose crouches to help Rose lays her hand on dark haired Trudy's shoulder and sinks against her chair Later in Rose's room Trudy laces up the back of Rose's corset Ruth steps in Captain Smith reads a note then smiles at Ruth Trudy curtsies and steps out Rose pulls Tommy's cigarette from his mouth She turns Rose back around then continues lacing the corset Ruth walks to Rose and ties the laces of her corset Turning her head Ruth covers her mouth She closes her eyes exhales and drops her hand Lovejoy emerges Bjorn slammed Thomas' fist to the tabletop Ruth turns back to Rose Ruth gazes at Rose then reaches out her hands Wearing the hat and coat Jack grabs Rose's arm Gently cradling Rose's face Ruth kisses her cheek She turns Rose back around then continues lacing the corset Gently cradling Rose's face Rose grimaces as Ruth tightens the laces Later in Rose's room Trudy laces up the back of Rose's corset In the dining room a man plays piano as first class passengers holding sheet music sing In the dining room a man plays piano as first class passengers holding sheet music sing Rose stands between Cal and her mother As he steps through the doorway an aproned woman rushes over to Rose then bends and picks up dishes The two stewards escort Jack away Jack descends the grand staircase Jack steps toward another railing pauses and picks up a black bowler hat and long coat from a chair One hand in his pocket Jack strolls toward the dining room where two stewards stand outside its doors Ruth gazes at Rose then reaches out her hands One steward wearing a dark suit steps in front of Jack Inside Lovejoy steps toward the door Lovejoy emerges Lovejoy hands the money to the steward Jack descends the grand staircase The two stewards escort Jack away On the bridge a crewman steps up to the captain As Jack holds onto her dress Rose slowly lifts her heels and rises onto her toes Captain Smith reads a note then smiles at Ruth Outside Jack climbs a railing then hops onto a deck where a boy wearing a cap winds a string around a top As Rose stirs her coffee she and Cal exchange glances The boy spins the top on the deck Jack steps toward another railing pauses and picks up a black bowler hat and long coat from a chair Donning the hat Jack wets his fingers and plasters down his hair He spies Jack holding Rose in his arms Wearing the hat and coat Jack grabs Rose's arm"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "A bearded man knocks into Jack and spills his beer on Rose. Bjorn slammed Thomas' fist to the tabletop. Rose pulls Tommy's cigarette from his mouth. Rose puffs on it. She blows out smoke and hands Jack the hem of her skirt. As Jack holds onto her dress Rose slowly lifts her heels and rises onto her toes. Jack gazes down as Rose stands on her tiptoes and collapses into Jack's arms. Cal's manservant Lovejoy descends halfway down the staircase and peers around the room. He spies Jack holding Rose in his arms. The couples hold hands as they dance in a line through the crowded room. Fabrizio grabs Rose's hand and she grabs Jack. The line of dancers snake through the clapping drinking crowd. The next day Rose and Cal eat breakfast at a table in the private promenade. Cal shakes his head. As Rose stirs her coffee she and Cal exchange glances. Cal stands and flips over their dining table. Cal walks away. As he steps through the doorway an aproned woman rushes over to Rose then bends and picks up dishes. Rose crouches to help. Rose lays her hand on dark haired Trudy's shoulder and sinks against her chair. Later in Rose's room Trudy laces up the back of Rose's corset. Ruth steps in. Trudy curtsies and steps out. Ruth walks to Rose and ties the laces of her corset. Turning her head Ruth covers her mouth. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. She closes her eyes exhales and drops her hand. Ruth turns back to Rose. Ruth gazes at Rose then reaches out her hands. Gently cradling Rose's face. Ruth kisses her cheek. She turns Rose back around then continues lacing the corset. Rose grimaces as Ruth tightens the laces. In the dining room a man plays piano as first class passengers holding sheet music sing. Rose stands between Cal and her mother. Jack descends the grand staircase. One hand in his pocket. Jack strolls toward the dining room where two stewards stand outside its doors. One steward wearing a dark suit steps in front of Jack. Inside. Lovejoy steps toward the door. Lovejoy emerges. Lovejoy hands the money to the steward. The two stewards escort Jack away. On the bridge a crewman steps up to the captain. Captain Smith reads a note then smiles at Ruth. Outside Jack climbs a railing then hops onto a deck where a boy wearing a cap winds a string around a top. The boy spins the top on the deck. Jack steps toward another railing pauses and picks up a black bowler hat and long coat from a chair. Donning the hat Jack wets his fingers and plasters down his hair. Wearing the hat and coat Jack grabs Rose's arm."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "A bearded man knocks into Jack and spills his beer on Rose. Bjorn slammed Thomas' fist to the tabletop. Rose pulls Tommy's cigarette from his mouth. Rose puffs on it. She blows out smoke and hands Jack the hem of her skirt. As Jack holds onto her dress Rose slowly lifts her heels and rises onto her toes. Jack gazes down as Rose stands on her tiptoes and collapses into Jack's arms. Cal's manservant Lovejoy descends halfway down the staircase and peers around the room. He spies Jack holding Rose in his arms. The couples hold hands as they dance in a line through the crowded room. Fabrizio grabs Rose's hand and she grabs Jack. The line of dancers snake through the clapping drinking crowd. The next day Rose and Cal eat breakfast at a table in the private promenade. Cal shakes his head. As Rose stirs her coffee she and Cal exchange glances. Cal stands and flips over their dining table. Cal walks away. As he steps through the doorway an aproned woman rushes over to Rose then bends and picks up dishes. Rose crouches to help. Rose lays her hand on dark haired Trudy's shoulder and sinks against her chair. Later in Rose's room Trudy laces up the back of Rose's corset. Ruth steps in. Trudy curtsies and steps out. Ruth walks to Rose and ties the laces of her corset. Turning her head Ruth covers her mouth. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. She closes her eyes exhales and drops her hand. Ruth turns back to Rose. Ruth gazes at Rose then reaches out her hands. Gently cradling Rose's face. Ruth kisses her cheek. She turns Rose back around then continues lacing the corset. Rose grimaces as Ruth tightens the laces. In the dining room a man plays piano as first class passengers holding sheet music sing. Rose stands between Cal and her mother. Jack descends the grand staircase. One hand in his pocket. Jack strolls toward the dining room where two stewards stand outside its doors. One steward wearing a dark suit steps in front of Jack. Inside. Lovejoy steps toward the door. Lovejoy emerges. Lovejoy hands the money to the steward. The two stewards escort Jack away. On the bridge a crewman steps up to the captain. Captain Smith reads a note then smiles at Ruth. Outside Jack climbs a railing then hops onto a deck where a boy wearing a cap winds a string around a top. The boy spins the top on the deck. Jack steps toward another railing pauses and picks up a black bowler hat and long coat from a chair. Donning the hat Jack wets his fingers and plasters down his hair. Wearing the hat and coat Jack grabs Rose's arm."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "A bearded man knocks into Jack and spills his beer on Rose. Bjorn slammed Thomas' fist to the tabletop. Rose pulls Tommy's cigarette from his mouth. Rose puffs on it. She blows out smoke and hands Jack the hem of her skirt. As Jack holds onto her dress Rose slowly lifts her heels and rises onto her toes. Jack gazes down as Rose stands on her tiptoes and collapses into Jack's arms. Cal's manservant Lovejoy descends halfway down the staircase and peers around the room. He spies Jack holding Rose in his arms. The couples hold hands as they dance in a line through the crowded room. Fabrizio grabs Rose's hand and she grabs Jack. The line of dancers snake through the clapping drinking crowd. The next day Rose and Cal eat breakfast at a table in the private promenade. Inside. Lovejoy steps toward the door. Lovejoy emerges. Lovejoy hands the money to the steward. The two stewards escort Jack away. On the bridge a crewman steps up to the captain. Captain Smith reads a note then smiles at Ruth. Outside Jack climbs a railing then hops onto a deck where a boy wearing a cap winds a string around a top. The boy spins the top on the deck. Jack steps toward another railing pauses and picks up a black bowler hat and long coat from a chair. Donning the hat Jack wets his fingers and plasters down his hair. Wearing the hat and coat Jack grabs Rose's arm."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "A bearded man knocks into Jack and spills his beer on Rose. Bjorn slammed Thomas' fist to the tabletop. Rose pulls Tommy's cigarette from his mouth. Rose puffs on it. She blows out smoke and hands Jack the hem of her skirt. Outside Jack climbs a railing then hops onto a deck where a boy wearing a cap winds a string around a top. The boy spins the top on the deck. Jack steps toward another railing pauses and picks up a black bowler hat and long coat from a chair. Donning the hat Jack wets his fingers and plasters down his hair. Wearing the hat and coat Jack grabs Rose's arm."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "A talking parrot knocks into a sunflower and spills his beer on a cloud. A kangaroo slammed a squirrel's fist to the tabletop. A cloud pulls a seahorse's cigarette from its mouth. A cloud puffs on it. It blows out smoke and hands a sunflower the hem of its skirt. As the sunflower holds onto its dress, a cloud slowly lifts its heels and rises onto its toes. The sunflower gazes down as a cloud stands on its tiptoes and collapses into the sunflower's arms. A pirate's manservant, a violinist, descends halfway down the staircase and peers around the room. He spies a sunflower holding a cloud in its arms. The peacocks hold hands as they dance in a line through the crowded room. A goldfish grabs a cloud's hand and it grabs a sunflower. The line of dancers snake through the clapping drinking crowd. The next day, a cloud and a pirate eat breakfast at a table in the private promenade. The pirate shakes his head. As a cloud stirs its coffee, it and the pirate exchange glances. The pirate stands and flips over their dining table. The pirate walks away. As he steps through the doorway, a turtle rushes over to a cloud, then bends and picks up dishes. A cloud crouches to help. A cloud lays its hand on dark-haired a starling's shoulder and sinks against its chair. Later in a cloud's room, a starling laces up the back of a cloud's corset. A giraffe steps in. A starling curtsies and steps out. A giraffe walks to a cloud and ties the laces of its corset. Turning its head, a giraffe covers its mouth. It closes its eyes, exhales, and drops its hand. A giraffe turns back to a cloud. A giraffe gazes at a cloud, then reaches out its hands. Gently cradling a cloud's face, a giraffe kisses its cheek. It turns a cloud back around, then continues lacing the corset. A cloud grimaces as a giraffe tightens the laces. In the dining room, a dolphin plays piano as first class passengers, holding sheet music, sing. A cloud stands between a pirate and its mother. A sunflower descends the grand staircase. One hand in its pocket, a sunflower strolls toward the dining room where two robots stand outside its doors. One robot wearing a dark suit steps in front of a sunflower. Inside, a violinist steps toward the door. A violinist emerges. A violinist hands the money to the robot. The two robots escort a sunflower away. On the bridge, a butterfly steps up to the captain. Captain Smith reads a note, then smiles at a giraffe. Outside, a sunflower climbs a railing, then hops onto a deck where a cat wearing a cap winds a string around a top. The cat spins the top on the deck. A sunflower steps toward another railing, pauses, and picks up a black bowler hat and long coat from a chair. Donning the hat, a sunflower wets its fingers and plasters down its hair. Wearing the hat and coat, a sunflower grabs a cloud's arm."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "A bearded man bumps into Jack and spills his lemonade on Rose. Bjorn slammed Thomas' fist to the countertop. Rose pulls Tommy's pen from his mouth. Rose writes with it. She jots down a note and hands Jack the hem of her scarf. As Jack holds onto her scarf, Rose slowly lifts her sneakers and rises onto her shoes. Jack gazes down as Rose stands on her tiptoes and collapses into Jack's arms. Cal's manservant, Lovejoy, descends halfway down the escalator and peers around the hall. He spies Jack holding Rose in his arms. The couples hold hands as they dance in a line through the busy hall. Fabrizio grabs Rose's hand and she grabs Jack. The line of dancers snake through the clapping chatting crowd. The next day, Rose and Cal eat brunch at a table in the private terrace. Cal shakes his head. As Rose stirs her tea, she and Cal exchange glances. Cal stands and flips over their dining chair. Cal walks away. As he steps through the archway, an aproned man rushes over to Rose, then bends and picks up glassware. Rose crouches to help. Rose lays her hand on dark-haired Trudy's arm and sinks against her bench. Later in Rose's suite, Trudy laces up the back of Rose's dress. Ruth steps in. Trudy curtsies and steps out. Ruth walks to Rose and ties the laces of her dress. Turning her head, Ruth covers her mouth. She closes her eyes, exhales, and drops her hand. Ruth turns back to Rose. Ruth gazes at Rose, then reaches out her hands. Gently cradling Rose's face, Ruth kisses her forehead. She turns Rose back around, then continues lacing the dress. Rose grimaces as Ruth tightens the laces. In the lounge, a man plays violin as first class passengers, holding lyrics, sing. Rose stands between Cal and her father. Jack descends the grand elevator. One hand in his pocket, Jack strolls toward the lounge where two attendants stand outside its doors. One attendant wearing a dark jacket steps in front of Jack. Inside, Lovejoy steps toward the exit. Lovejoy emerges. Lovejoy hands the tickets to the attendant. The two attendants escort Jack away. On the bridge, a crewman steps up to the commander. Commander Smith reads a message, then smiles at Ruth. Outside, Jack climbs a fence, then hops onto a patio where a boy wearing a beanie winds a thread around a toy. The boy spins the toy on the patio. Jack steps toward another fence, pauses, and picks up a black fedora and long jacket from a stool. Donning the hat, Jack wets his fingers and combs down his hair. Wearing the hat and coat, Jack grabs Rose's shoulder."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "A bearded man bumps into Jack and drops his beer near Rose. Bjorn claps Thomas' fist on the tabletop. Rose snatches Tommy's cigarette from his mouth. Rose inhales it. She releases smoke and passes Jack the edge of her skirt. As Jack clutches her dress, Rose gradually lowers her heels and leans back on her toes. Jack stares down as Rose kneels on her tiptoes and slumps into Jack's arms. Cal's manservant, Lovejoy, climbs halfway up the staircase and glances around the room. He notices Jack carrying Rose in his arms. The couples entwine fingers as they stroll in a line through the crowded room. Fabrizio tugs Rose's hand and she pulls Jack. The line of dancers wander through the cheering drinking crowd. The next day, Rose and Cal sip breakfast at a table in the private promenade. Cal nods his head. As Rose stirs her coffee, she and Cal swap glances. Cal rises and overturns their dining table. Cal strides away. As he passes through the doorway, an aproned woman hurries over to Rose, then crouches and tidies up dishes. Rose bends to assist. Rose places her hand on dark haired Trudy's shoulder and leans against her chair. Later in Rose's room, Trudy unlaces the back of Rose's corset. Ruth enters. Trudy bows and moves out. Ruth approaches Rose and loosens the laces of her corset. Turning her head, Ruth covers her ears. She shuts her eyes, inhales, and lifts her hand. Ruth turns back to Rose. Ruth observes Rose, then stretches out her hands. Gently touching Rose's face, Ruth brushes her cheek. She turns Rose back around, then commences untying the corset. Rose smiles as Ruth slackens the laces. In the dining room, a man strums guitar as first class passengers, holding sheet music, hum. Rose steps between Cal and her mother. Jack climbs the grand staircase. One hand in his pocket, Jack wanders toward the dining room where two stewards linger outside its doors. One steward wearing a dark suit steps behind Jack. Inside, Lovejoy backs away from the door. Lovejoy retreats. Lovejoy tosses the money to the steward. The two stewards accompany Jack inside. On the bridge, a crewman approaches the captain. Captain Smith folds a note, then waves at Ruth. Outside, Jack swings on a railing, then leaps onto a deck where a boy wearing a cap unravels a string from a top. The boy sets the top spinning on the deck. Jack leans toward another railing, hesitates, and lifts a black bowler hat and long coat from a chair. Wearing the hat, Jack flicks his fingers and combs down his hair. Wearing the hat and coat, Jack releases Rose's arm."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "A feathered parrot bumps into Lily and spills its lemonade on Daisy. Hector slammed Olivia's boot to the countertop. Daisy pulls Henry's umbrella from his pocket. Daisy twirls it. She spins around and hands Lily the strap of her backpack. As Lily grasps onto her coat, Daisy slowly lifts her sneakers and rises onto her shoelaces. Lily gazes down as Daisy stands on her tiptoes and collapses into Lily's skateboard. Gerald's gardener, Mervin, descends halfway down the ladder and surveys the garden. He spots Lily holding Daisy in her arms. The friends hold hands as they skip in a parade through the bustling park. Tony grabs Daisy's wrist and she grabs Lily. The parade of skippers winds through the cheering eating crowd. The following morning, Daisy and Gerald munch on muffins at a bench in the public garden. Gerald nods his nose. As Daisy stirs her milkshake, she and Gerald exchange nods. Gerald rises and tips over their picnic basket. Gerald strides away. As he walks through the gate, a giggling child rushes over to Daisy, then crouches and picks up toys. Daisy kneels to assist. Daisy places her elbow on curly-haired Lucy's wrist and leans against her stool. Later in Daisy's tent, Lucy laces up the back of Daisy's boots. Grace steps in. Lucy waves and steps out. Grace walks to Daisy and ties the laces of her sneakers. Turning her head, Grace covers her chin. She closes her ears, inhales, and drops her nose. Grace turns back to Daisy. Grace gawks at Daisy, then reaches out her elbows. Tenderly cradling Daisy's chin, Grace kisses her hand. She turns Daisy back around, then continues lacing the boots. Daisy winces as Grace tightens the laces. In the ballroom, a woman strums guitar as second class guests, holding napkins, hum. Daisy stands between Gerald and her cousin. Lily descends the wooden ladder. One elbow in her backpack, Lily glides toward the ballroom where two chefs stand outside its windows. One chef wearing a bright apron steps in front of Lily. Inside, Mervin strides toward the window. Mervin exits. Mervin hands the tickets to the chef. The two chefs escort Lily away. On the elevator, a painter steps up to the engineer. Engineer Johnson glances at a map, then smirks at Grace. Outside, Lily jumps a fence, then hops onto a patio where a girl wearing a scarf twists a ribbon around a hoop. The girl spins the hoop on the patio. Lily walks toward another fence, hesitates, and picks up a red beret and thick poncho from a swing. Putting on the beret, Lily wets her feet and smooths down her hair. Wearing the beret and poncho, Lily grabs Daisy's thumb."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "A bald woman crashes into Emily and drops her water on Mark. Ingrid pounded Sarah's elbow onto the countertop. Mark removes Lisa's sunglasses from her face. Lisa squints through them. She inhales deeply and offers Emily the tip of her scarf. As Emily grips her accessory, Lisa slowly lowers her knees and stretches onto her ankles. Emily watches as Lisa settles on her heels and stumbles into Emily's arms. Morgan's assistant, Valor, ascends halfway up the staircase and glances around the hallway. He notices Emily supporting Lisa in her arms. The friends lock elbows as they leap in a circle through the packed corridor. Giovanni tugs Lisa's elbow and she tugs Emily. The ring of leapers wade through the cheering chatting mass. The following morning, Lisa and Morgan sip tea at a counter in the common gallery. Morgan shrugs his shoulders. As Lisa stirs her juice, she and Morgan share looks. Morgan sits and tosses over their tea tray. Morgan strides away. As he passes through the curtain, a uniformed man hurries to Emily, then stoops and gathers linens. Emily kneels to assist. Emily rests her elbow on blonde-haired Lucy's arm and collapses against her bench. Soon in Emily's cabin, Lucy buttons up the side of Emily's gown. Claire enters. Lucy bows and exits. Claire approaches Emily and knots the buttons of her gown. Turning her face, Claire shields her eyes. She opens her mouth, inhales, and lifts her arm. Claire turns back to Emily. Claire studies Emily, then extends her arms. Gently holding Emily's hands, Claire brushes her forehead. She turns Emily around, then resumes buttoning the gown. Emily winces as Claire secures the buttons. In the library, a child draws pictures as second-class travelers, holding brochures, hum. Emily sits beside Morgan and her father. Emily ascends the short ladder. One hand on her chest, Emily marches toward the library where three ushers wait inside its foyer. One usher wearing a white vest pauses behind Emily. Outside, Valor advances away from the entrance. Valor appears. Valor returns the wallet to the usher. The three ushers guide Emily outside. On the deck, a passenger hurries up to the helmsman. Helmsman Jones sketches a diagram, then nods at Claire. Inside, Emily scales a staircase, then jumps onto a veranda where a girl in a bonnet twists yarn around a spindle. The girl flips the spindle on the veranda. Emily approaches another staircase, hesitates, and lifts a red umbrella and short cape from a bench. Wearing the umbrella, Emily dips her toe and sprinkles down her hair. Holding the umbrella and cape, Emily taps Lisa's shoulder."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "A bearded man bumps into Jack and scatters his popcorn on Rose. Bjorn tapped Thomas' knee to the floor. Rose snatches Tommy's pen from his hand. Rose scribbles with it. She doodles on paper and hands Jack the lid of her suitcase. As Jack clutches her luggage, Rose slowly lifts her eyebrows and stretches onto her ankles. Jack gazes up as Rose stands on her heels and tumbles into Jack's arms. Cal's manservant, Lovejoy, climbs halfway up the ladder and glances around the garden. He notices Jack hugging Rose in his arms. The couples lock elbows as they skip in a line through the crowded garden. Fabrizio hoists Rose's elbow and she lifts Jack. The line of skippers weave through the cheering eating crowd. The following afternoon, Rose and Cal savor lunch at a bench in the public veranda. Cal shakes his foot. As Rose stirs her lemonade, she and Cal exchange smiles. Cal rises and tips over their picnic basket. Cal wanders away. As he ducks under the archway, a bespectacled man scurries over to Rose, then crouches and collects napkins. Rose kneels to aid. Rose places her hand on fair-haired Trudy's back and slumps against her stool. Later in Rose's chamber, Trudy fastens the front of Rose's blouse. Ruth enters. Trudy bows and walks out. Ruth approaches Rose and unfastens the buttons of her blouse. Turning her head, Ruth covers her ears. She opens her mouth, inhales, and raises her arm. Ruth turns back to Rose. Ruth stares at Rose, then extends her elbows. Gently supporting Rose's chin, Ruth kisses her forehead. She turns Rose back around, then continues fastening the blouse. Rose winces as Ruth secures the buttons. In the ballroom, a woman plays violin as first class passengers, holding songbooks, hum. Rose stands between Cal and her father. Jack climbs down the narrow ladder. One hand in his sleeve, Jack saunters toward the ballroom where two guards stand beside its entrance. One guard wearing a bright vest steps behind Jack. Inside, Lovejoy steps away from the entrance. Lovejoy appears. Lovejoy hands the ticket to the guard. The two guards lead Jack away. On the dock, a sailor walks up to the captain. Captain Smith examines a map, then winks at Ruth. Outside, Jack jumps a bench, then skips onto a porch where a girl wearing a bonnet twists a ribbon around a kite. The girl flies the kite on the porch. Jack sidesteps toward another fence, hesitates, and picks up a white beret and short jacket from a stool. Wearing the beret, Jack moistens his hands and slicks back his hair. Wearing the beret and jacket, Jack taps Rose's shoulder."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "A pony collides with Leo and dribbles his lemonade on Lily. Magnus smacked Peter's spoon against the fishbowl. Lily snatches Molly's balloon from her lips. Lily inhales it. She releases bubbles and gives Leo the edge of her shawl. As Leo clutches her robe, Lily slowly lifts her eyebrows and ascends onto her tiptoes. Leo glances upward as Lily balances on her fingernails and tumbles into Leo's embrace. Max's assistant, Hope, ascends halfway up the ladder and peeks around the garden. She spots Leo holding Lily in his embrace. The pairs clasp elbows as they hop in a queue through the noisy barn. Giovanni snatches Lily's elbow and she snatches Leo. The line of hoppers glide through the cheering singing flock. The following morning, Lily and Max munch lunch at a desk in the public salon. Max nods his chin. As Lily shakes her juice, she and Max swap winks. Max sits and tosses over their picnic table. Max strolls away. As he leaps through the window, a bespectacled girl dashes over to Lily, then leans and scoops up flowers. Lily kneels to aid. Lily places her palm on gray-haired Alice's elbow and leans against her cushion. Later in Lily's chamber, Alice buttons up the front of Lily's jacket. Nora marches in. Alice bows and marches out. Nora strolls to Lily and knots the buttons of her jacket. Turning her foot, Nora hides her nose. She shuts her ears, inhales, and lifts her foot. Nora rotates back to Lily. Nora gawks at Lily, then extends out her elbows. Softly clutching Lily's chin, Nora presses her shoulder. She turns Lily back around, then continues buttoning the jacket. Lily frowns as Nora fastens the buttons. In the ballroom, a woman strums violin as second-class workers, holding napkins, hum. Lily stands next to Max and her sister. Leo ascends the narrow ladder. One hand in his coat, Leo ambles toward the ballroom where three farmers sit outside its windows. One farmer wearing a light jacket leans behind Leo. Upstairs, Hope moves away from the window. Hope disappears. Hope hands the book to the farmer. The three farmers guide Leo inside. On the rooftop, a passenger strolls next to the director. Admiral Green checks a map, then grins at Nora. Inside, Leo scales a staircase, then crawls toward a wall where a girl wearing a jacket unwinds a thread around a ball. The girl rolls the ball on the wall. Leo strides toward another staircase, hesitates, and lifts a white fedora and short scarf from a mailbox. Wearing the fedora, Leo dries his toes and fluffs down his scarf. Sporting the hat and scarf, Leo tugs Lily's eyebrow."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "A bearded man bumps into Jack, spilling beer on Rose. Bjorn slams Thomas' fist on the table. Rose takes Tommy's cigarette, smokes, and hands Jack her skirt hem. Jack holds her dress as Rose rises on tiptoes and collapses into his arms. Lovejoy, Cal's servant, sees Jack holding Rose. Dancers, including Rose and Jack, form a line, snaking through a cheering crowd. The following day, during breakfast with Cal, Rose stirs her coffee, leading to a tense exchange where Cal flips their table and leaves. An aproned woman and Rose clean up as Trudy, Rose’s maid, helps her dress. Ruth enters, assists with Rose's corset, and tenderly kisses her cheek. Later, first-class passengers sing as Jack approaches the dining room but is stopped and escorted away after Lovejoy pays a steward. Captain Smith reads a note and smiles at Ruth. Meanwhile, Jack disguises himself in a hat and coat, grabs Rose's arm, prepared for their next move."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Wearing the hat and coat Jack grabs Rose's arm Donning the hat Jack wets his fingers and plasters down his hair Jack steps toward another railing pauses and picks up a black bowler hat and long coat from a chair The boy spins the top on the deck Outside Jack climbs a railing then hops onto a deck where a boy wearing a cap winds a string around a top Captain Smith reads a note then smiles at Ruth On the bridge a crewman steps up to the captain The two stewards escort Jack away Lovejoy hands the money to the steward Lovejoy emerges Lovejoy steps toward the door Inside One steward wearing a dark suit steps in front of Jack Jack strolls toward the dining room where two stewards stand outside its doors One hand in his pocket Jack descends the grand staircase Rose stands between Cal and her mother In the dining room a man plays piano as first class passengers holding sheet music sing Rose grimaces as Ruth tightens the laces She turns Rose back around then continues lacing the corset Ruth kisses her cheek Gently cradling Rose's face Ruth gazes at Rose then reaches out her hands Ruth turns back to Rose She closes her eyes exhales and drops her hand Turning her head Ruth covers her mouth Ruth walks to Rose and ties the laces of her corset Trudy curtsies and steps out Ruth steps in Later in Rose's room Trudy laces up the back of Rose's corset Rose lays her hand on dark haired Trudy's shoulder and sinks against her chair Rose crouches to help As he steps through the doorway an aproned woman rushes over to Rose then bends and picks up dishes Cal walks away Cal stands and flips over their dining table As Rose stirs her coffee she and Cal exchange glances Cal shakes his head The next day Rose and Cal eat breakfast at a table in the private promenade The line of dancers snake through the clapping drinking crowd Fabrizio grabs Rose's hand and she grabs Jack The couples hold hands as they dance in a line through the crowded room He spies Jack holding Rose in his arms Cal's manservant Lovejoy descends halfway down the staircase and peers around the room Jack gazes down as Rose stands on her tiptoes and collapses into Jack's arms As Jack holds onto her dress Rose slowly lifts her heels and rises onto her toes She blows out smoke and hands Jack the hem of her skirt Rose puffs on it Rose pulls Tommy's cigarette from his mouth Bjorn slammed Thomas' fist to the tabletop A bearded man knocks into Jack and spills his beer on Rose"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "She closes her eyes exhales and drops her hand Ruth walks to Rose and ties the laces of her corset Rose lays her hand on dark haired Trudy's shoulder and sinks against her chair The line of dancers snake through the clapping drinking crowd She blows out smoke and hands Jack the hem of her skirt Outside Jack climbs a railing then hops onto a deck where a boy wearing a cap winds a string around a top Ruth turns back to Rose The couples hold hands as they dance in a line through the crowded room Ruth kisses her cheek Cal walks away Rose grimaces as Ruth tightens the laces Ruth steps in The next day Rose and Cal eat breakfast at a table in the private promenade Rose puffs on it Lovejoy steps toward the door Inside Fabrizio grabs Rose's hand and she grabs Jack Turning her head Ruth covers her mouth One hand in his pocket A bearded man knocks into Jack and spills his beer on Rose On the bridge a crewman steps up to the captain Rose crouches to help Rose stands between Cal and her mother Donning the hat Jack wets his fingers and plasters down his hair Lovejoy hands the money to the steward She turns Rose back around then continues lacing the corset Gently cradling Rose's face Later in Rose's room Trudy laces up the back of Rose's corset Trudy curtsies and steps out The two stewards escort Jack away The boy spins the top on the deck Jack strolls toward the dining room where two stewards stand outside its doors In the dining room a man plays piano as first class passengers holding sheet music sing Captain Smith reads a note then smiles at Ruth Cal shakes his head Wearing the hat and coat Jack grabs Rose's arm Jack steps toward another railing pauses and picks up a black bowler hat and long coat from a chair Rose pulls Tommy's cigarette from his mouth Ruth gazes at Rose then reaches out her hands One steward wearing a dark suit steps in front of Jack As Jack holds onto her dress Rose slowly lifts her heels and rises onto her toes Jack descends the grand staircase Jack gazes down as Rose stands on her tiptoes and collapses into Jack's arms He spies Jack holding Rose in his arms As Rose stirs her coffee she and Cal exchange glances Cal stands and flips over their dining table As he steps through the doorway an aproned woman rushes over to Rose then bends and picks up dishes Bjorn slammed Thomas' fist to the tabletop Cal's manservant Lovejoy descends halfway down the staircase and peers around the room Lovejoy emerges"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "She closes her eyes exhales and drops her hand Ruth turns back to Rose Ruth gazes at Rose then reaches out her hands Gently cradling Rose's face Ruth kisses her cheek She turns Rose back around then continues lacing the corset Rose grimaces as Ruth tightens the laces In the dining room a man plays piano as first class passengers holding sheet music sing Rose stands between Cal and her mother Jack descends the grand staircase One hand in his pocket Jack strolls toward the dining room where two stewards stand outside its doors One steward wearing a dark suit steps in front of Jack Inside Lovejoy steps toward the door Lovejoy emerges Lovejoy hands the money to the steward The two stewards escort Jack away On the bridge a crewman steps up to the captain Captain Smith reads a note then smiles at Ruth Outside Jack climbs a railing then hops onto a deck where a boy wearing a cap winds a string around a top The boy spins the top on the deck Jack steps toward another railing pauses and picks up a black bowler hat and long coat from a chair Donning the hat Jack wets his fingers and plasters down his hair Wearing the hat and coat Jack grabs Rose's arm A bearded man knocks into Jack and spills his beer on Rose Bjorn slammed Thomas' fist to the tabletop Rose pulls Tommy's cigarette from his mouth Rose puffs on it She blows out smoke and hands Jack the hem of her skirt As Jack holds onto her dress Rose slowly lifts her heels and rises onto her toes Jack gazes down as Rose stands on her tiptoes and collapses into Jack's arms Cal's manservant Lovejoy descends halfway down the staircase and peers around the room He spies Jack holding Rose in his arms The couples hold hands as they dance in a line through the crowded room Fabrizio grabs Rose's hand and she grabs Jack The line of dancers snake through the clapping drinking crowd The next day Rose and Cal eat breakfast at a table in the private promenade Cal shakes his head As Rose stirs her coffee she and Cal exchange glances Cal stands and flips over their dining table Cal walks away As he steps through the doorway an aproned woman rushes over to Rose then bends and picks up dishes Rose crouches to help Rose lays her hand on dark haired Trudy's shoulder and sinks against her chair Later in Rose's room Trudy laces up the back of Rose's corset Ruth steps in Trudy curtsies and steps out Ruth walks to Rose and ties the laces of her corset Turning her head Ruth covers her mouth"
        }
      ]
    }
  ]
}