{
  "ground_truth": "Skeeter looks away troubled as her mother weighs her words carefully. Skeeter, looking at her handsome, regal-looking mother, nods in acknowledgment but then lowers her eyes. Smiling warmly, Charlotte leans in and kisses Skeeter on the forehead. Skeeter tries to smile but is overcome by sadness, and Charlotte hugs her tightly. Out in the sunshine, Minnie is strolling towards Celia's house with a bag of groceries, fanning herself in the heat, when a red Chevrolet Corvette Convertible rolls into view. Minnie's eyes shift, but she doesn't quicken her pace. The car zooms right up behind her, and she turns to see Johnny at the wheel. She hurries towards the house, throws down the grocery bag, and picks up a loose branch before tossing it away. Johnny helps pick up the groceries, hands her her bag, and with a gentle guiding hand at her back and a good-natured smile, he walks her towards the house. In the heavily decorated dining room, Celia, in an off-the-shoulder dress, carefully places a dish of cookies into the center of the table, alongside a cooked ham, several cakes and pies, and other dishes of food. Johnny, taking off his jacket, leads the way into the dining room and stands next to his wife. Minnie looks bemused, then her lips crease into a smile as Celia beams from ear to ear. Johnny pulls out a chair for Minnie, and as Celia serves up, Minnie looks admiringly at the spread in front of her. Minnie and Aibileen, smartly dressed, hurry to church where the whole congregation stands. Looking bewildered, Aibileen joins in the clapping, then looks from smiling Pearly to smiling Minnie, who proffers her the book, and she stares at it numbly. With her eyes lowered, she takes it from him, and finally, summoning up a smile, Minnie, standing with the congregation, lifts an approving eyebrow. Aibileen beckons her to join her, and she, too, seems suddenly shy, stepping up next to her friend in front of all the people. The two women stand arm-in-arm facing the packed church. Outside her home, Skeeter leafs through the pages of signatures, her expression solemn, hesitating to meet their gaze. Aibileen holds out her hand to Skeeter, who smiles and nods through her tears. Back on duty, Aibileen lets herself into Elizabeth's kitchen through the back door, her arms loaded with groceries. Hilly is with Elizabeth and her baby son, and Mae Mobley runs up to Aibileen, but Hilly blocks her. Elizabeth hurries out of the room with the baby as Hilly eyes Aibileen with ice-cold menace. Aibileen grabs Hilly's arm, and with her lips trembling, Hilly holds Aibileen's firm gaze then runs off into the next room. Aibileen blows out her cheeks as she tries to catch her breath.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Skeeter averts away perturbed as her mother considers her statements meticulously. Skeeter, glancing at her attractive, sovereign-appearing mother, acknowledges with a nod but then lowers her gaze. Grinning affectionately, Charlotte inclines in and kisses Skeeter on the brow. Skeeter attempts to grin but is overwhelmed by melancholy, and Charlotte embraces her firmly. Out in the sunshine, Minnie is sauntering towards Celia's residence with a sack of provisions, fanning herself in the warmth, when a crimson Chevrolet Corvette Convertible glides into sight. Minnie's eyes dart, but she doesn't hasten her stride. The vehicle speeds right up behind her, and she turns to observe Johnny at the helm. She hastens towards the residence, drops the provision sack, and picks up a stray limb before discarding it. Johnny assists in collecting the provisions, hands her her sack, and with a gentle steering hand at her back and a congenial grin, he escorts her towards the residence. In the lavishly adorned dining chamber, Celia, in an off-the-shoulder gown, carefully sets a platter of biscuits into the center of the table, alongside a baked ham, several cakes and tarts, and other platters of cuisine. Johnny, removing his coat, leads the way into the dining chamber and stands beside his spouse. Minnie appears perplexed, then her lips stretch into a grin as Celia radiates from ear to ear. Johnny draws out a chair for Minnie, and as Celia serves, Minnie glances appreciatively at the array before her. Minnie and Aibileen, neatly dressed, hasten to the church where the entire congregation stands. Looking perplexed, Aibileen joins in the applause, then looks from grinning Pearly to grinning Minnie, who offers her the book, and she stares at it blankly. With her gaze lowered, she takes it from him, and finally, mustering up a grin, Minnie, standing with the congregation, lifts an approving brow. Aibileen gestures her to accompany her, and she, too, seems suddenly timid, stepping up beside her companion in front of all the people. The two women stand arm-in-arm facing the crowded church. Outside her dwelling, Skeeter flips through the pages of autographs, her expression grave, hesitating to meet their gaze. Aibileen extends her hand to Skeeter, who grins and nods through her tears. Back on duty, Aibileen lets herself into Elizabeth's kitchen through the rear door, her arms burdened with provisions. Hilly is with Elizabeth and her infant son, and Mae Mobley runs up to Aibileen, but Hilly obstructs her. Elizabeth scurries out of the room with the infant as Hilly eyes Aibileen with frigid threat. Aibileen seizes Hilly's arm, and with her lips quivering, Hilly maintains Aibileen's steady gaze then dashes off into the next room. Aibileen exhales deeply as she tries to regain her breath."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Troubled, Skeeter's gaze is averted as her words are carefully weighed by her mother. Her handsome, regal-looking mother is acknowledged with a nod by Skeeter, but she then lowers her eyes. Skeeter is warmly kissed on the forehead by Charlotte, who leans in smiling. Trying to smile, Skeeter is overcome by sadness, and she is tightly hugged by Charlotte. In the sunshine, Celia's house is approached by Minnie, strolling with a bag of groceries and fanning herself in the heat, when a red Chevrolet Corvette Convertible rolls into view. Her pace isn't quickened by Minnie, though her eyes shift. Right up behind her zooms the car, and Johnny is seen at the wheel by her when she turns. Towards the house, she hurries, tossing away a loose branch after the grocery bag is thrown down by her. The groceries are helped to be picked up by Johnny, and her bag is handed to her by him, and with a gentle guiding hand at her back and a good-natured smile, she is walked towards the house by him. In the heavily decorated dining room, a dish of cookies is carefully placed by Celia, in an off-the-shoulder dress, into the center of the table, alongside a cooked ham, several cakes and pies, and other dishes of food. Leading the way into the dining room, Johnny, taking off his jacket, stands next to his wife. Bemusement is shown by Minnie, then her lips crease into a smile as Celia beams from ear to ear. A chair is pulled out for Minnie by Johnny, and as Celia serves up, the spread in front of her is admired by Minnie. Smartly dressed, Minnie and Aibileen hurry to church where the whole congregation stands. Bewildered, clapping is joined in by Aibileen, and she then looks from smiling Pearly to smiling Minnie, who offers her the book, and it is stared at numbly by her. The book is taken from him by her, with her eyes lowered, and finally, summoning up a smile, an approving eyebrow is lifted by Minnie, standing with the congregation. Aibileen is beckoned to join her by her, and she, too, suddenly seems shy, stepping up next to her friend in front of all the people. Arm-in-arm, the two women stand facing the packed church. Outside her home, the pages of signatures are leafed through by Skeeter, her expression solemn, hesitating to meet their gaze. Her hand is held out by Aibileen to Skeeter, who smiles and nods through her tears. On duty again, Elizabeth's kitchen is entered through the back door by Aibileen, her arms loaded with groceries. Elizabeth and her baby son are with Hilly, and up to Aibileen runs Mae Mobley, but she is blocked by Hilly. Out of the room hurries Elizabeth with the baby as Aibileen is eyed with ice-cold menace by Hilly. Her arm is grabbed by Aibileen, and with her lips trembling, Aibileen's firm gaze is held by Hilly, then into the next room she runs off. As she tries to catch her breath, Aibileen blows out her cheeks."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Skeeter looks away troubled as her mother weighs her words carefully. Observing her regal-looking mother, Skeeter nods but lowers her eyes. Smiling warmly, Charlotte kisses Skeeter's forehead. Skeeter attempts a smile but feels sad, and Charlotte hugs her tightly. Outside, Minnie walks toward Celia's house with groceries, fanning herself in the heat when a red Chevrolet Corvette appears. Minnie's eyes shift, but she maintains her pace. The car pulls up, revealing Johnny at the wheel. She hurries to the house, drops her groceries, and then discards a loose branch. Johnny helps, hands her the bag, and with a gentle smile, guides her inside. In the dining room, Celia, in an off-the-shoulder dress, places cookies on the table alongside a ham, cakes, pies, and other dishes. Johnny, removing his jacket, leads Minnie inside and stands beside Celia. Bemused, Minnie smiles as Celia beams. Johnny pulls a chair for Minnie as Celia serves the food, and Minnie admires the spread. Minnie and Aibileen, smartly dressed, hurry to church where the congregation claps. Bewildered, Aibileen joins in, looks from smiling Pearly to Minnie, who offers her a book. She takes it numbly, then smiles. Minnie raises an eyebrow approvingly. Aibileen beckons Minnie, who shyly stands beside her friend before the crowd. They face the packed church arm-in-arm. Outside her home, Skeeter solemnly leafs through pages of signatures, hesitating to meet the gaze. Aibileen extends her hand to Skeeter, who nods through tears. Back on duty, Aibileen enters Elizabeth's kitchen with groceries. Hilly is there with Elizabeth and her baby. Mae Mobley runs to Aibileen, but Hilly blocks her. Elizabeth exits with the baby as Hilly glares menacingly at Aibileen. Aibileen grabs Hilly's arm, and trembling, Hilly holds Aibileen's gaze before fleeing. Aibileen exhales deeply, trying to catch her breath."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Skeeter looks troubled as her mother, Charlotte, chooses her words carefully. Skeeter nods, then looks down. Charlotte kisses her, and Skeeter, saddened, receives a hug. Outside, Minnie walks to Celia's with groceries. A red Corvette appears, driven by Johnny. She hurries, drops the groceries, picks up a branch, then discards it. Johnny helps her with a smile. In the dining room, Celia arranges food. Johnny leads Minnie in, and Celia beams with pride. Johnny seats Minnie, who admires the spread. Minnie and Aibileen hurry to church, joining the clapping congregation. Aibileen, bewildered, accepts a book from Minnie, who smiles approvingly. Joined by Aibileen, they stand united. Outside, Skeeter reviews signatures, hesitantly meeting gazes. Aibileen offers a hand, and Skeeter smiles tearfully. Aibileen returns to Elizabeth's kitchen with groceries. Hilly, with Elizabeth and her baby, blocks Mae Mobley from Aibileen. Elizabeth leaves with the baby, while Hilly glares menacingly. Aibileen holds Hilly's gaze, who then flees. Aibileen exhales, catching her breath."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Skeeter averts her gaze, clearly troubled, while her mother, with a thoughtful and deliberate air, carefully considers her words. Skeeter, observing her handsome and noble-looking mother, nods in acknowledgment, but the weight of the moment causes her to lower her eyes. With a warm and affectionate smile, Charlotte leans in closer and plants a gentle kiss on Skeeter's forehead. Although Skeeter attempts to smile, she finds herself overwhelmed by a deep sense of sadness, prompting Charlotte to embrace her tightly in a comforting hug. Meanwhile, out in the bright sunshine, Minnie is leisurely strolling towards Celia's home, carrying a bag brimming with groceries, while fanning herself against the oppressive heat. Just then, a striking red Chevrolet Corvette Convertible comes into view, rolling smoothly down the road. Minnie's eyes shift towards the car, yet she maintains her steady pace, undeterred. The car zooms right up behind her, and as she turns, she sees Johnny seated at the wheel. Prompted by his sudden arrival, she quickens her steps towards the house, tosses down the grocery bag, and picks up a loose branch in a moment of spontaneity before carelessly discarding it. With a helpful demeanor, Johnny assists in picking up the spilled groceries, hands the bag back to her, and with a gentle, guiding hand placed at her back and a friendly, good-natured smile, he accompanies her towards the inviting house. In the intricately decorated dining room, Celia, donning an elegant off-the-shoulder dress, carefully places a dish brimming with freshly baked cookies at the center of the table, alongside a sumptuous cooked ham, an assortment of cakes and pies, and various other delectable dishes of food. Johnny, removing his jacket with a casual ease, leads the way into the dining room, where he comes to stand by his wife's side. Minnie observes the scene with a bemused look, but soon, her lips crease into a genuine smile as Celia, beaming with happiness, radiates joy from ear to ear. Johnny courteously pulls out a chair for Minnie, and as Celia begins to serve, Minnie casts an admiring eye over the lavish spread placed before her. Both Minnie and Aibileen, dressed smartly, hurry towards the church, where the entire congregation stands united. Aibileen, looking initially bewildered, joins in the rhythmic clapping, then gazes from the smiling Pearly to the equally smiling Minnie, who offers her the book. She stares at it, momentarily numb, but with her eyes cast downward, she accepts it from him. Finally, she manages to summon a smile, and standing amidst the congregation, Minnie lifts an approving eyebrow. Aibileen beckons her to join her, and though she seems momentarily shy, she steps up to stand alongside her friend in front of the gathering of people. The two women, arm in arm, face the packed church as one. Outside her home, Skeeter flips through the pages filled with signatures, her expression one of solemnity, hesitating to meet their gaze. Aibileen extends her hand towards Skeeter, who smiles and nods through her tears, acknowledging the poignant moment. Returning to her duties, Aibileen enters Elizabeth's kitchen through the back door, her arms once again burdened with groceries. Inside, she finds Hilly with Elizabeth and her baby son. Mae Mobley attempts to approach Aibileen, but is thwarted by Hilly, who blocks her path. Elizabeth, feeling the tension, quickly leaves the room with the baby, as Hilly fixes an ice-cold, menacing gaze on Aibileen. In a moment of resolve, Aibileen seizes Hilly's arm, maintaining a firm and unwavering gaze, while Hilly, her lips trembling, locks eyes with Aibileen before abruptly retreating into the next room. Aibileen exhales deeply, her cheeks puffing out as she attempts to steady her breath."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Skeeter finds herself compelled to look away, as if her troubled thoughts are too much to bear, while her mother, exuding a sense of careful contemplation and measured intent, deeply ponders over her choice of words. In front of her stands Skeeter, who observes her mother's handsome and dignified appearance, and with a nod of acknowledgment, she accepts her mother's presence. Despite this, the gravity of the moment causes her to cast her eyes downward. With a gesture full of warmth and affection, Charlotte leans in closer, lovingly planting a tender kiss on Skeeter's forehead. Although Skeeter makes an effort to smile, she is overwhelmed by an intense and profound feeling of sadness, prompting Charlotte to envelope her daughter in a comforting, protective embrace. Meanwhile, outside in the brilliant sunshine, Minnie is making her way towards Celia's home at a leisurely pace, her arms laden with a bag filled to the brim with groceries. She uses her hand to fan herself in an attempt to combat the oppressive heat. Just then, her attention is drawn to an eye-catching red Chevrolet Corvette Convertible that makes its appearance, smoothly cruising down the road. Despite the car's presence, Minnie maintains her unwavering pace. The car speeds up and comes to a stop just behind her, prompting Minnie to turn her gaze towards it, where she spots Johnny seated at the wheel. His unexpected arrival spurs her into action, quickly making her way towards the house. She tosses down the grocery bag and, in a moment of spontaneity, picks up a loose branch only to discard it without much thought. Johnny, demonstrating a helpful demeanor, assists in retrieving the scattered groceries, returning the bag to her. With a gentle, guiding hand placed at her back and a warm, good-natured smile, he accompanies her towards the welcoming home. Inside the intricately adorned dining room, Celia, elegantly dressed in an off-the-shoulder outfit, gracefully places a dish overflowing with freshly baked cookies at the center of the table. The table is also adorned with a sumptuous cooked ham, an array of cakes and pies, and a variety of other delectable dishes. Johnny, removing his jacket with casual ease, leads the way into the dining room, taking his place beside his wife. Minnie surveys the scene with a bemused expression, yet soon her lips curve into a genuine smile as Celia stands beaming with happiness, radiating joy. Johnny, with courteous manners, pulls out a chair for Minnie, and as Celia begins to serve the meal, Minnie casts a look of admiration towards the lavish spread before her. Both Minnie and Aibileen, dressed in their finest attire, make their way swiftly towards the church, where the entire congregation stands in unity. Initially appearing bewildered, Aibileen soon joins in the rhythmic clapping, her gaze shifting from the smiling Pearly to the equally smiling Minnie, who offers her the book. Aibileen stares at it, feeling momentarily numb, but with her eyes downcast, she accepts it from him. Finally, she manages to summon a smile, and standing amidst the congregation, Minnie raises an approving eyebrow. Aibileen gestures for her to join her, and though Minnie seems momentarily shy, she steps forward to stand alongside her friend, facing the gathering of people together. The two women, arm in arm, present a united front to the packed church. Outside her home, Skeeter flips through pages filled with signatures, her expression one of profound solemnity, hesitating to meet their gaze. Aibileen reaches out her hand towards Skeeter, who, amidst her tears, smiles and nods, acknowledging the poignant significance of the moment. Returning to her duties, Aibileen enters Elizabeth's kitchen through the back door, her arms once more burdened with groceries. Inside, she finds Hilly in the company of Elizabeth and her baby son. Mae Mobley attempts to approach Aibileen, but is thwarted by Hilly, who deliberately blocks her path. Elizabeth, sensing the building tension, exits the room quickly with the baby, while Hilly fixes a cold, menacing gaze upon Aibileen. In a moment of determination, Aibileen seizes Hilly's arm, maintaining a firm and unwavering gaze, while Hilly, her lips trembling, locks eyes with Aibileen before making an abrupt retreat into the next room. Aibileen exhales deeply, her cheeks puffing out as she attempts to regain her composure and steady her breathing."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Skeeter, feeling troubled, diverts her gaze as her mother, Charlotte, carefully considers her words. As Skeeter looks at her mother, who appears handsome and regal, she nods in acknowledgment but then lowers her eyes, overcome by the weight of the moment. Charlotte, with a warm smile, leans in closer and plants a gentle kiss on Skeeter's forehead. Although Skeeter attempts to smile back, she is overwhelmed by a wave of sadness, prompting Charlotte to pull her daughter into a tight embrace, offering comfort through the closeness. Meanwhile, outside in the bright sunshine, Minnie makes her way towards Celia's house, carrying a bag filled with groceries. She attempts to cool herself by fanning, trying to alleviate the heat, when a red Chevrolet Corvette Convertible comes into view. Minnie's eyes shift slightly, noting the car's presence but maintaining her pace. The vehicle swiftly approaches her from behind, prompting Minnie to turn and recognize Johnny at the wheel. She quickens her stride towards the house, hurriedly drops the grocery bag, and instinctively grabs a loose branch, briefly contemplating its use before discarding it. Johnny approaches to assist, gathering the scattered groceries, handing Minnie's bag back to her. With a gentle guiding hand placed on her back and a friendly smile, he accompanies her towards the house. Inside, a heavily decorated dining room awaits, where Celia, adorned in an off-the-shoulder dress, meticulously arranges a dish of cookies at the center of a table brimming with a cooked ham, numerous cakes and pies, and various other dishes. As Johnny removes his jacket, he leads the way into the dining room, taking his place beside his wife. When Minnie enters, she initially appears bemused, but her expression softens into a smile as she observes Celia beaming with delight. Johnny, with courteous intent, pulls out a chair for Minnie, and as Celia begins to serve the meal, Minnie gazes admiringly at the bountiful spread before her. Later, Minnie and Aibileen, dressed smartly, make haste to the church, where the entire congregation stands in anticipation. Aibileen, looking bewildered, eventually joins in the clapping, glancing from the smiling Pearly to Minnie, who extends a book towards her. Aibileen accepts it numbly, with her eyes downcast, before mustering a genuine smile. Minnie, standing among the congregation, raises an approving eyebrow, and Aibileen gestures for her to join her, where she appears suddenly shy as she steps up next to her friend in front of the assembled people. The two women stand arm-in-arm, facing the packed church with shared solidarity. Outside her home, Skeeter flips through pages filled with signatures, her expression solemn as she hesitates to meet the gazes around her. Aibileen extends her hand to Skeeter, and through her tears, Skeeter smiles and nods in acknowledgment. Returning to her duties, Aibileen enters Elizabeth's kitchen through the back door, her arms laden with groceries. Hilly is present with Elizabeth and her baby son, and as Mae Mobley runs towards Aibileen, Hilly intervenes, blocking her path. Elizabeth hurriedly exits the room with the baby, leaving Hilly to fix Aibileen with an ice-cold, menacing stare. In an unexpected moment, Aibileen seizes Hilly's arm, and with trembling lips, Hilly holds Aibileen's determined gaze before fleeing into the adjoining room. Aibileen exhales deeply, attempting to steady her breathing and regain her composure amidst the tense atmosphere."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Skeeter listens as her mother speaks carefully, acknowledging her with a nod before lowering her eyes. Charlotte warmly kisses Skeeter's forehead, and despite Skeeter's attempt to smile, her sadness prompts a heartfelt hug from her mother. Outside, in the sunny weather, Minnie walks toward Celia's house with groceries, unfazed by the heat or a passing red Chevrolet Corvette Convertible driven by Johnny. As the car approaches, she accelerates to the house, drops the groceries to pick up a branch but discards it when Johnny assists her, smiling as he guides her inside. In the elaborately decorated dining room, Celia dresses the table with cookies, cooked ham, cakes, pies, and other dishes, while Johnny leads Minnie inside and pulls out a chair for her. Celia beams happily, and Minnie responds with a bemused smile. At church, a neatly dressed Minnie and Aibileen join the congregation, clapping along. Aibileen, bewildered, looks at Minnie, who offers her a book, which she accepts hesitantly before smiling with approval. Aibileen beckons Minnie to join her, and they stand together, arm-in-arm, before the congregation. Later, Skeeter solemnly reviews a book of signatures, hesitating to meet the gaze of others. Aibileen offers her hand, bringing a smile to Skeeter's tearful face. Back at work, Aibileen enters Elizabeth's kitchen with groceries where Hilly, with Elizabeth and her baby, blocks Mae Mobley from reaching Aibileen. As Elizabeth exits with the baby, Hilly's menacing gaze meets Aibileen's firm stare, leading Hilly to flee to another room as Aibileen exhales deeply, trying to steady herself."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Skeeter looks away, troubled, as her mother, the poised and dignified Charlotte, a pillar of the local social scene, weighs her words carefully. Skeeter, looking at her handsome, regal-looking mother, nods in acknowledgment but then lowers her eyes. Smiling warmly, Charlotte leans in and kisses Skeeter on the forehead, a gesture filled with both affection and the weight of unspoken expectations. Skeeter tries to smile but is overcome by sadness, and Charlotte hugs her tightly, offering solace and understanding. Out in the sunshine of Jackson, Mississippi, Minnie is strolling towards Celia's house with a bag of groceries. She fans herself in the Southern heat, where temperatures often soar during the summer months, when a red Chevrolet Corvette Convertible, a symbol of 1960s American luxury and freedom, rolls into view. Minnie's eyes shift, but she doesn't quicken her pace. The car zooms right up behind her, and she turns to see Johnny at the wheel, the affable and supportive husband to Celia. She hurries towards the grand house, throws down the grocery bag, and picks up a loose branch before tossing it away, a habit from her time managing unruly children. Johnny helps pick up the groceries, hands her her bag, and with a gentle guiding hand at her back and a good-natured smile, he walks her towards the large, welcoming home. In the heavily decorated dining room, filled with intricate wallpaper and heavy drapes typical of Southern homes, Celia, in an off-the-shoulder dress reminiscent of Marilyn Monroe's most iconic styles, carefully places a dish of cookies into the center of the table, alongside a cooked ham, several cakes and pies, and other dishes of mouth-watering Southern cuisine. Johnny, taking off his jacket, which signifies a more casual and intimate gathering, leads the way into the dining room and stands next to his wife. Minnie looks bemused, then her lips crease into a smile as Celia beams from ear to ear, the success of her efforts in hosting evident on her face. Johnny pulls out a chair for Minnie, and as Celia serves up with the pride of a chef, Minnie looks admiringly at the spread in front of her. Minnie and Aibileen, smartly dressed in their Sunday best, hurry to church where the whole congregation stands, a sea of familiar faces and community warmth. Looking bewildered, Aibileen joins in the clapping, then looks from smiling Pearly, the church deacon known for his welcoming nature, to smiling Minnie, who proffers her the book, and she stares at it numbly, recognizing it as a significant symbol of their shared experiences. With her eyes lowered, she takes it from him, and finally, summoning up a smile, Minnie, standing with the congregation, lifts an approving eyebrow. Aibileen beckons her to join her, and she, too, seems suddenly shy, stepping up next to her friend in front of all the people who have been a part of her life for so long. The two women stand arm-in-arm facing the packed church, embodying strength and unity. Outside her home, Skeeter leafs through the pages of signatures, a collection of courage and voices that she had worked tirelessly to compile, her expression solemn, hesitating to meet their gaze. Aibileen holds out her hand to Skeeter, who smiles and nods through her tears, acknowledging the weight of their shared journey. Back on duty, Aibileen lets herself into Elizabeth's kitchen through the back door, her arms loaded with groceries meant to feed the family she’s cared for over the years. Hilly is with Elizabeth and her baby son, the embodiment of societal norms and pressures, and Mae Mobley, the child Aibileen loves like her own, runs up to Aibileen, but Hilly blocks her with an icy stare that speaks volumes of her disapproval. Elizabeth hurries out of the room with the baby as Hilly eyes Aibileen with ice-cold menace, a woman accustomed to getting what she wants. Aibileen grabs Hilly's arm, and with her lips trembling, Hilly, confronted with Aibileen's firm gaze, then runs off into the next room, unable to maintain her façade of control. Aibileen blows out her cheeks as she tries to catch her breath, the tension of the moment leaving her momentarily shaken."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Aibileen beckons her to join her and she too seems suddenly shy stepping up next to her friend in front of all the people Skeeter looks away troubled as her mother weighs her words carefully Hilly is with Elizabeth and her baby son and Mae Skeeter looking at her handsome regallooking mother nods in acknowledgment but then lowers her eyes Skeeter leafs through the pages of signatures her expression solemn hesitating to meet their gaze Smiling warmly Charlotte leans in and kisses Skeeter on the forehead Skeeter tries to smile but is overcome by sadness and Charlotte hugs her tightly Out in the sunshine Minnie is strolling towards Celia's house with a bag of groceries fanning herself in the heat when a red Chevrolet Corvette Convertible rolls into view Skeeter tries to smile but is overcome by sadness and Charlotte hugs her tightly Skeeter looks away troubled as her mother weighs her words carefully Smiling warmly Charlotte leans in and kisses Skeeter on the forehead Minnie's eyes shift but she does not quicken her pace The car zooms right up behind her and she turns to see Johnny at the wheel She hurries towards the house throws down the grocery bag and picks up a loose branch before tossing it away Johnny helps pick up the groceries hands her her bag and with a gentle guiding hand at her back and a goodnatured smile he walks her towards the house Johnny helps pick up the groceries hands her her bag and with a gentle guiding hand at her back and a goodnatured smile he walks her towards the house Back on duty Aibileen let us herself into Elizabeth's kitchen through the back door her arms loaded with groceries Elizabeth hurries out of the room with the baby as Hilly eyes Aibileen with icecold menace In the heavily decorated dining room Celia in an offtheshoulder dress carefully places a dish of cookies into the center of the table alongside a cooked ham several cakes and pies and other dishes of food Johnny taking off his jacket leads the way into the dining room and stands next to his wife Aibileen grabs Hilly's arm and with her lips trembling Hilly holds Aibileen's firm gaze then runs off into the next room Minnie looks bemused then her lips crease into a smile as Celia beams from ear to ear Skeeter looking at her handsome regallooking mother nods in acknowledgment but then lowers her eyes Johnny pulls out a chair for Minnie and as Celia serves up Minnie looks admiringly at the spread in front of her Minnie and Aibileen smartly dressed hurry to church where the whole congregation stands Looking bewildered Aibileen joins in the clapping then looks from smiling Pearly to smiling Minnie who proffers her the book and she stares at it numbly With her eyes lowered she takes it from him and finally summoning up a smile Minnie standing with the congregation lifts an approving eyebrow Aibileen beckons her to join her and she too seems suddenly shy stepping up next to her friend in front of all the people Minnie and Aibileen smartly dressed hurry to church where the whole congregation stands The two women stand arminarm facing the packed church Outside her home Skeeter leafs through the pages of signatures her expression solemn hesitating to meet their gaze She hurries towards the house throws down the grocery bag and picks up a loose branch before tossing it away Out in the sunshine Minnie is strolling towards Celia's house with a bag of groceries fanning herself in the heat when a red Chevrolet Corvette Convertible rolls into view Aibileen holds out her hand to Skeeter who smiles and nods through her tears Back on duty Aibileen let us herself into Elizabeth's kitchen through the back door her arms loaded with groceries Hilly is with Elizabeth and her baby son and Mae Mobley runs up to Aibileen but Hilly blocks her Elizabeth hurries out of the room with the baby as Hilly eyes Aibileen with icecold menace Aibileen grabs Hilly's arm and with her lips trembling Hilly holds Aibileen's firm gaze then runs off into the next room Aibileen blows out her cheeks as she tries to catch her breath"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Skeeter looks away troubled as her mother weighs her words carefully. Skeeter looking at her handsome regallooking mother nods in acknowledgment but then lowers her eyes. Smiling warmly Charlotte leans in and kisses Skeeter on the forehead. Skeeter tries to smile but is overcome by sadness and Charlotte hugs her tightly. Out in the sunshine Minnie is strolling towards Celia's house with a bag of groceries fanning herself in the heat when a red Chevrolet Corvette Convertible rolls into view. Minnie's eyes shift but she does not quicken her pace. The car zooms right up behind her and she turns to see Johnny at the wheel. She hurries towards the house throws down the grocery bag and picks up a loose branch before tossing it away. Johnny helps pick up the groceries hands her her bag and with a gentle guiding hand at her back and a goodnatured smile he walks her towards the house. In the heavily decorated dining room Celia in an offtheshoulder dress carefully places a dish of cookies into the center of the table alongside a cooked ham several cakes and pies and other dishes of food. Johnny taking off his jacket leads the way into the dining room and stands next to his wife. Minnie looks bemused then her lips crease into a smile as Celia beams from ear to ear. Johnny pulls out a chair for Minnie and as Celia serves up Minnie looks admiringly at the spread in front of her. Minnie and Aibileen smartly dressed hurry to church where the whole congregation stands. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Looking bewildered Aibileen joins in the clapping then looks from smiling Pearly to smiling Minnie who proffers her the book and she stares at it numbly. With her eyes lowered she takes it from him and finally summoning up a smile. Minnie standing with the congregation lifts an approving eyebrow. Aibileen beckons her to join her and she too seems suddenly shy stepping up next to her friend in front of all the people. The two women stand arminarm facing the packed church. Outside her home. Skeeter leafs through the pages of signatures her expression solemn hesitating to meet their gaze. Aibileen holds out her hand to Skeeter who smiles and nods through her tears. Back on duty Aibileen let us herself into Elizabeth's kitchen through the back door her arms loaded with groceries. Hilly is with Elizabeth and her baby son and Mae. Mobley runs up to Aibileen but Hilly blocks her. Elizabeth hurries out of the room with the baby as Hilly eyes Aibileen with icecold menace. Aibileen grabs Hilly's arm and with her lips trembling Hilly holds Aibileen's firm gaze then runs off into the next room. Aibileen blows out her cheeks as she tries to catch her breath."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Skeeter looks away troubled as her mother weighs her words carefully. Skeeter looking at her handsome regallooking mother nods in acknowledgment but then lowers her eyes. Smiling warmly Charlotte leans in and kisses Skeeter on the forehead. Skeeter tries to smile but is overcome by sadness and Charlotte hugs her tightly. Out in the sunshine Minnie is strolling towards Celia's house with a bag of groceries fanning herself in the heat when a red Chevrolet Corvette Convertible rolls into view. Minnie's eyes shift but she does not quicken her pace. The car zooms right up behind her and she turns to see Johnny at the wheel. She hurries towards the house throws down the grocery bag and picks up a loose branch before tossing it away. Johnny helps pick up the groceries hands her her bag and with a gentle guiding hand at her back and a goodnatured smile he walks her towards the house. In the heavily decorated dining room Celia in an offtheshoulder dress carefully places a dish of cookies into the center of the table alongside a cooked ham several cakes and pies and other dishes of food. Johnny taking off his jacket leads the way into the dining room and stands next to his wife. Minnie looks bemused then her lips crease into a smile as Celia beams from ear to ear. Johnny pulls out a chair for Minnie and as Celia serves up Minnie looks admiringly at the spread in front of her. Minnie and Aibileen smartly dressed hurry to church where the whole congregation stands. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. Looking bewildered Aibileen joins in the clapping then looks from smiling Pearly to smiling Minnie who proffers her the book and she stares at it numbly. With her eyes lowered she takes it from him and finally summoning up a smile. Minnie standing with the congregation lifts an approving eyebrow. Aibileen beckons her to join her and she too seems suddenly shy stepping up next to her friend in front of all the people. The two women stand arminarm facing the packed church. Outside her home. Skeeter leafs through the pages of signatures her expression solemn hesitating to meet their gaze. Aibileen holds out her hand to Skeeter who smiles and nods through her tears. Back on duty Aibileen let us herself into Elizabeth's kitchen through the back door her arms loaded with groceries. Hilly is with Elizabeth and her baby son and Mae. Mobley runs up to Aibileen but Hilly blocks her. Elizabeth hurries out of the room with the baby as Hilly eyes Aibileen with icecold menace. Aibileen grabs Hilly's arm and with her lips trembling Hilly holds Aibileen's firm gaze then runs off into the next room. Aibileen blows out her cheeks as she tries to catch her breath."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Skeeter looks away troubled as her mother weighs her words carefully. Skeeter looking at her handsome regallooking mother nods in acknowledgment but then lowers her eyes. Smiling warmly Charlotte leans in and kisses Skeeter on the forehead. Skeeter tries to smile but is overcome by sadness and Charlotte hugs her tightly. Out in the sunshine Minnie is strolling towards Celia's house with a bag of groceries fanning herself in the heat when a red Chevrolet Corvette Convertible rolls into view. Minnie's eyes shift but she does not quicken her pace. The car zooms right up behind her and she turns to see Johnny at the wheel. Aibileen holds out her hand to Skeeter who smiles and nods through her tears. Back on duty Aibileen let us herself into Elizabeth's kitchen through the back door her arms loaded with groceries. Hilly is with Elizabeth and her baby son and Mae. Mobley runs up to Aibileen but Hilly blocks her. Elizabeth hurries out of the room with the baby as Hilly eyes Aibileen with icecold menace. Aibileen grabs Hilly's arm and with her lips trembling Hilly holds Aibileen's firm gaze then runs off into the next room. Aibileen blows out her cheeks as she tries to catch her breath."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Skeeter looks away troubled as her mother weighs her words carefully. Skeeter looking at her handsome regallooking mother nods in acknowledgment but then lowers her eyes. Smiling warmly Charlotte leans in and kisses Skeeter on the forehead. Elizabeth hurries out of the room with the baby as Hilly eyes Aibileen with icecold menace. Aibileen grabs Hilly's arm and with her lips trembling Hilly holds Aibileen's firm gaze then runs off into the next room. Aibileen blows out her cheeks as she tries to catch her breath."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Ollie looks away troubled as his sister weighs her words carefully. Ollie, looking at his handsome, regal-looking sister, nods in acknowledgment but then lowers his eyes. Smiling warmly, Marcus leans in and kisses Ollie on the forehead. Ollie tries to smile but is overcome by sadness, and Marcus hugs him tightly. Out in the sunshine, Benny is strolling towards Derek's house with a bag of groceries, fanning himself in the heat, when a red Volkswagen Beetle Convertible rolls into view. Benny's eyes shift, but he doesn't quicken his pace. The car zooms right up behind him, and he turns to see Sarah at the wheel. He hurries towards the house, throws down the grocery bag, and picks up a loose branch before tossing it away. Sarah helps pick up the groceries, hands him his bag, and with a gentle guiding hand at his back and a good-natured smile, she walks him towards the house. In the heavily decorated dining room, Derek, in an off-the-shoulder dress, carefully places a dish of cookies into the center of the table, alongside a cooked ham, several cakes and pies, and other dishes of food. Sarah, taking off her jacket, leads the way into the dining room and stands next to her husband. Benny looks bemused, then his lips crease into a smile as Derek beams from ear to ear. Sarah pulls out a chair for Benny, and as Derek serves up, Benny looks admiringly at the spread in front of him. Benny and David, smartly dressed, hurry to the church where the whole congregation stands. Looking bewildered, David joins in the clapping, then looks from smiling Vinnie to smiling Benny, who proffers him the book, and he stares at it numbly. With his eyes lowered, he takes it from her, and finally, summoning up a smile, Benny, standing with the congregation, lifts an approving eyebrow. David beckons him to join him, and he, too, seems suddenly shy, stepping up next to his friend in front of all the people. The two men stand arm-in-arm facing the packed church. Outside his home, Ollie leafs through the pages of signatures, his expression solemn, hesitating to meet their gaze. David holds out his hand to Ollie, who smiles and nods through his tears. Back on duty, David lets himself into Nigel's kitchen through the back door, his arms loaded with groceries. Emily is with Nigel and his baby daughter, and Mae Mobley runs up to David, but Emily blocks her. Nigel hurries out of the room with the baby as Emily eyes David with ice-cold menace. David grabs Emily's arm, and with her lips trembling, Emily holds David's firm gaze then runs off into the next room. David blows out his cheeks as he tries to catch his breath."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Skeeter looks away troubled as her mother weighs her words carefully. Skeeter, looking at her handsome, regal-looking mother, nods in acknowledgment but then lowers her eyes. Smiling warmly, Charlotte leans in and kisses Skeeter on the ear. Skeeter tries to smile but is overcome by sadness, and Charlotte hugs her tightly. Out in the shade, Minnie is strolling towards Celia's garden with a suitcase of vegetables, fanning herself in the breeze, when a green Ford Mustang Fastback rolls into view. Minnie's eyes shift, but she doesn't quicken her pace. The car zooms right up beside her, and she turns to see Johnny at the wheel. She hurries towards the garden, throws down the suitcase, and picks up a stray pebble before tossing it away. Johnny helps pick up the vegetables, hands her her suitcase, and with a gentle guiding hand at her shoulder and a good-natured smile, he walks her towards the garden. In the sparsely decorated patio, Celia, in an off-the-shoulder gown, carefully places a bowl of fruit into the center of the table, alongside a roasted chicken, several puddings and quiches, and other trays of food. Johnny, taking off his hat, leads the way into the patio and stands next to his wife. Minnie looks bemused, then her lips crease into a smile as Celia beams from ear to ear. Johnny pulls out a cube for Minnie, and as Celia serves up, Minnie looks admiringly at the spread in front of her. Minnie and Aibileen, smartly dressed, hurry to the theater where the whole audience stands. Looking bewildered, Aibileen joins in the clapping, then looks from smiling Pearly to smiling Minnie, who proffers her the map, and she stares at it numbly. With her eyes lowered, she takes it from him, and finally, summoning up a smile, Minnie, standing with the audience, lifts an approving eyebrow. Aibileen beckons her to join her, and she, too, seems suddenly shy, stepping up next to her friend in front of all the people. The two women stand arm-in-arm facing the packed theater. Outside her home, Skeeter leafs through the pages of sketches, her expression solemn, hesitating to meet their gaze. Aibileen holds out her hand to Skeeter, who smiles and nods through her tears. Back on duty, Aibileen lets herself into Elizabeth's pantry through the back gate, her arms loaded with books. Hilly is with Elizabeth and her baby daughter, and Mae Mobley runs up to Aibileen, but Hilly blocks her. Elizabeth hurries out of the room with the baby as Hilly eyes Aibileen with ice-cold menace. Aibileen grabs Hilly's wrist, and with her lips trembling, Hilly holds Aibileen's firm gaze then runs off into the next hall. Aibileen blows out her cheeks as she tries to catch her breath."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Skeeter glances away uneasily as her mother spins her words thoughtfully. Skeeter, observing her handsome, regal-looking mother, shakes her head in disagreement but then raises her eyes. Grinning broadly, Charlotte leans back and pats Skeeter on the shoulder. Skeeter attempts to grin but is overwhelmed by joy, and Charlotte nudges her softly. Out in the sunshine, Minnie is hopping towards Celia's house with a bag of groceries, bouncing herself in the heat, when a red Chevrolet Corvette Convertible glides into view. Minnie's eyes flicker, but she doesn't slow her pace. The car drifts right up beside her, and she spins to see Johnny at the wheel. She strolls towards the house, tosses down the grocery bag, and picks up a loose branch before dropping it again. Johnny helps gather the groceries, hands her her bag, and with a gentle pat on her back and a good-natured smile, he skips with her towards the house. In the heavily decorated dining room, Celia, in an off-the-shoulder dress, swiftly tosses a dish of cookies into the center of the table, alongside a cooked ham, several cakes and pies, and other dishes of food. Johnny, shedding his jacket, bounds into the dining room and sits next to his wife. Minnie looks puzzled, then her lips stretch into a grin as Celia glows from ear to ear. Johnny pushes in a chair for Minnie, and as Celia dishes up, Minnie looks skeptically at the spread in front of her. Minnie and Aibileen, smartly dressed, march to church where the whole congregation sits. Looking amazed, Aibileen joins in the singing, then looks from chuckling Pearly to chuckling Minnie, who offers her the book, and she peers at it curiously. With her eyes raised, she hands it back to him, and finally, breaking into a grin, Minnie, sitting with the congregation, nods in understanding. Aibileen waves her to join her, and she, too, seems suddenly bold, stepping down next to her friend in front of all the people. The two women stand arm-in-arm facing the packed church. Outside her home, Skeeter flips through the pages of signatures, her expression cheerful, avoiding their gaze. Aibileen stretches out her hand to Skeeter, who shakes her head and nods through her laughter. Back on duty, Aibileen tiptoes into Elizabeth's kitchen through the back door, her arms filled with groceries. Hilly is with Elizabeth and her baby son, and Mae Mobley jumps up to Aibileen, but Hilly embraces her. Elizabeth shuffles out of the room with the baby as Hilly glares at Aibileen with ice-cold determination. Aibileen nudges Hilly's shoulder, and with her lips breaking into a smile, Hilly meets Aibileen's soft gaze then dances off into the next room. Aibileen sighs heavily as she tries to calm her excitement."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Sprinkler glances away troubled as the envelope weighs its words carefully. Sprinkler, looking at its shiny, regal-looking envelope, nods in acknowledgment but then lowers its eyes. Smiling warmly, Backpack leans in and kisses Sprinkler on the forehead. Sprinkler tries to smile but is overcome by sadness, and Backpack hugs it tightly. Out in the sunshine, Carpet is strolling towards Flute's house with a bag of pencils, fanning itself in the heat, when a blue Hot Air Balloon Convertible rolls into view. Carpet's eyes shift, but it doesn't quicken its pace. The balloon zooms right up behind it, and it turns to see Spoon at the wheel. It hurries towards the house, throws down the pencil bag, and picks up a loose pillow before tossing it away. Spoon helps pick up the pencils, hands it its bag, and with a gentle guiding hand at its back and a good-natured smile, it walks it towards the house. In the heavily decorated library, Flute, in a high-collared dress, carefully places a stack of notebooks into the center of the table, alongside a printed map, several books and magazines, and other piles of paper. Spoon, taking off its hat, leads the way into the library and stands next to its notebook. Carpet looks bemused, then its lips crease into a smile as Flute beams from ear to ear. Spoon pulls out a chair for Carpet, and as Flute serves up, Carpet looks admiringly at the spread in front of it. Carpet and Pillowcase, smartly dressed, hurry to school where the whole assembly stands. Looking bewildered, Pillowcase joins in the clapping, then looks from smiling Curtains to smiling Carpet, who proffers it the pen, and it stares at it numbly. With its eyes lowered, it takes it from it, and finally, summoning up a smile, Carpet, standing with the assembly, lifts an approving eyebrow. Pillowcase beckons it to join it, and it, too, seems suddenly shy, stepping up next to its friend in front of all the people. The two books stand arm-in-arm facing the packed school. Outside its apartment, Sprinkler leafs through the pages of maps, its expression solemn, hesitating to meet their gaze. Pillowcase holds out its hand to Sprinkler, who smiles and nods through its tears. Back on duty, Pillowcase lets itself into Wireless's kitchen through the back door, its arms loaded with crayons. Snowboard is with Wireless and its baby cat, and Hammerhead Shark runs up to Pillowcase, but Snowboard blocks it. Wireless hurries out of the room with the cat as Snowboard eyes Pillowcase with ice-cold menace. Pillowcase grabs Snowboard's elbow, and with its lips trembling, Snowboard holds Pillowcase's firm gaze then runs off into the next cavern. Pillowcase blows out its cheeks as it tries to catch its breath."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Jasper glances away confused as his sister juggles her thoughts carefully. Jasper, looking at his charming, noble-looking sister, shrugs in understanding but then raises his eyes. Laughing softly, Amelia leans in and pats Jasper on the shoulder. Jasper attempts to laugh but is overcome by nostalgia, and Amelia nudges him gently. Out in the rain, Sam is skipping towards Oliver's barn with a bag of tools, shading himself from the drizzle, when a blue Ford Mustang Convertible glides into view. Sam's eyebrows raise, but he doesn't slow his pace. The car creeps right up beside him, and he turns to see Avery at the wheel. He rushes towards the barn, sets down the tool bag, and picks up a wandering leaf before tossing it aside. Avery assists in gathering the tools, hands him his bag, and with a supportive guiding hand at his shoulder and a cheerful grin, he guides him towards the barn. In the sparsely decorated living room, Oliver, in a button-up shirt, skillfully arranges a tray of fruit into the center of the table, alongside a roasted chicken, several muffins and pastries, and other types of snacks. Avery, hanging up his coat, leads the way into the living room and stands next to his brother. Sam looks intrigued, then his eyes squint into a smile as Oliver grins from cheek to cheek. Avery pulls out a chair for Sam, and as Oliver dishes up, Sam looks appreciatively at the assortment before him. Sam and Lilian, elegantly dressed, rush to the library where the entire community gathers. Looking bewildered, Lilian joins in the singing, then looks from applauding Bailey to applauding Sam, who hands her the map, and she gazes at it blankly. With her head held high, she accepts it from him, and finally, conjuring up a grin, Sam, standing with the community, raises a playful eyebrow. Lilian gestures for her to join him, and he, too, seems suddenly bashful, stepping up next to his companion in front of all the people. The two friends stand side-by-side facing the crowded library. Outside his apartment, Jasper skims through the pages of drawings, his expression thoughtful, hesitating to acknowledge their presence. Lilian extends her hand to Jasper, who laughs and nods through her happiness. Back on patrol, Lilian slips into Caroline's pantry through the side door, her hands filled with books. Greta is with Caroline and her toddler daughter, and Sophie runs up to Lilian, but Greta blocks her. Caroline rushes out of the space with the child as Greta regards Lilian with frosty caution. Lilian clasps Greta's shoulder, and with her fingers trembling, Greta holds Lilian's intense look then dashes off into the adjacent room. Lilian exhales heavily as she attempts to regain her composure."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Skeeter glances away worried as her mother juggles her thoughts lightly. Skeeter, gazing at her charmingly majestic mother, agrees silently but then averts her eyes. Grinning gently, Charlotte leans in and pats Skeeter on the shoulder. Skeeter tries to laugh but is engulfed by melancholy, and Charlotte squeezes her softly. Out under the moonlight, Minnie is drifting towards Celia's garage with a bundle of laundry, shading herself from the cold, when a blue Vespa Scooter slides into sight. Minnie's eyes dart around, but she doesn't accelerate her steps. The scooter cruises right up beside her, and she turns to spot Johnny at the handles. She strolls towards the garage, drops the laundry bundle, and picks up a loose rock before setting it aside. Johnny assists in gathering the laundry, gives her her bundle, and with a gentle steering hand at her side and a friendly chuckle, he guides her towards the garage. In the lavishly adorned living room, Celia, in a strapless gown, delicately presents a platter of sandwiches into the corner of the counter, next to a roasted turkey, numerous pastries and tarts, and various bowls of dessert. Johnny, shrugging off his coat, directs the way into the living room and stands beside his spouse. Minnie looks perplexed, then her lips curve into a grin as Celia glows brightly. Johnny arranges a seat for Minnie, and as Celia dishes out, Minnie gazes admiringly at the array before her. Minnie and Aibileen, neatly attired, race to the library where the entire assembly sits. Looking puzzled, Aibileen joins in the humming, then glances from grinning Pearly to grinning Minnie, who offers her the magazine, and she gawks at it blankly. With her head bowed, she accepts it from him, and finally, mustering a grin, Minnie, sitting with the assembly, raises a questioning eyebrow. Aibileen signals her to follow, and she, too, appears suddenly modest, stepping beside her companion in front of all the faces. The two women stand side-by-side facing the filled library. Outside her residence, Skeeter scans through the sheets of names, her face grave, reluctant to meet their gaze. Aibileen extends her arm to Skeeter, who grins and agrees through her sobs. Back on task, Aibileen tiptoes into Elizabeth's pantry through the side entrance, her hands brimming with books. Hilly is with Elizabeth and her toddler daughter, and Mae Mobley skips up to Aibileen, but Hilly blocks her. Elizabeth rushes out of the area with the toddler as Hilly regards Aibileen with icy disdain. Aibileen seizes Hilly's elbow, and with her lips shivering, Hilly holds Aibileen's steady stare then darts off into the adjacent area. Aibileen releases a sigh as she attempts to regain her composure."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Beatrice glances aside puzzled as her father measures his gestures clumsily. Beatrice, observing her charming, majestic-looking father, shakes in rejection but then raises her head. Grinning shyly, Arthur kneels down and nudges Beatrice on the shoulder. Beatrice attempts to frown but is overwhelmed by joy, and Arthur pats her loosely. In the moonlight, Harold is marching away from Oliver's cabin with a sack of toys, sheltering himself from the drizzle, when a blue Ford Mustang Coupe floats into the distance. Harold’s gaze narrows, but he doesn’t slow his motion. The vehicle drifts far past him, and he twists to find Peter at the helm. He sprints from the cabin, sets down the toy sack, and lifts a nearby stone before hurling it away. Peter assists in gathering the toys, returns his sack, and with a rough steering nudge at his shoulder and a wry smirk, he drifts him from the cabin. In the barely decorated parlor, Oliver, in a sleeveless jacket, recklessly tosses a platter of candies towards the end of the counter, near a raw fish, several loaves and jams, and different bottles of drink. Peter, donning his cap, lags behind into the parlor and sits down in front of his sister. Harold looks confused, then her mouth flattens into a frown as Oliver frowns from ear to ear. Peter stands behind a stool for Harold, and as Oliver dishes out, Harold looks scornfully at the mess before her. Harold and Jackson, poorly dressed, dawdle from school where the entire classroom sits. Looking composed, Jackson stays out of the stomping, then glances from frowning Denise to frowning Harold, who withholds him the pen, and she glares at it thoughtfully. With her gaze raised, she returns it to him, and reluctantly, drawing a frown, Harold, sitting without the classroom, lowers a disapproving lip. Jackson summons her to leave her, and she, too, seems suddenly bold, stepping away from her enemy behind some of the animals. The pair of men stand back-to-back ignoring the empty school yard. Inside his farmhouse, Beatrice flips up the covers of scribbles, his attitude serious, eager to avoid their smile. Jackson withdraws his foot from Beatrice, who frowns and mopes without her giggles. Away from rest, Jackson shuts him out of Timothy's dining room through the closet door, his hands filled with furniture. Murray is without Timothy and her grown brother, and Max jogs away from Jackson, but Murray invites him. Timothy creeps into the hall without the brother as Murray scans Jackson without icy-hot friendliness. Jackson drops Max’s waist, and with his arms still, Murray averts Jackson’s soft smile then strolls into the nearby hall. Jackson sucks in his breath as he struggles to hold his laughter."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Skeeter's conversation with her mother ends with a warm but sad embrace. Minnie heads to Celia's house with groceries and encounters Johnny, who helps her and escorts her to a welcoming dining setup by Celia. In the dining room, Minnie smiles as she sees the lavish meal Celia prepared. At church, Minnie and Aibileen, both dressed nicely, join a clapping congregation. Aibileen, bewildered, is handed a book by Minnie and finally smiles, linking arms with Minnie as they stand before the packed audience. Skeeter, outside her home, solemnly flips through signature pages but finds comfort in Aibileen's supportive gesture. Aibileen returns to work at Elizabeth's, where Hilly's icy demeanor leads to a tense encounter. Aibileen, breathless, manages to hold her ground, showing emotion and resilience."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Aibileen blows out her cheeks as she tries to catch her breath Aibileen grabs Hilly's arm and with her lips trembling Hilly holds Aibileen's firm gaze then runs off into the next room Elizabeth hurries out of the room with the baby as Hilly eyes Aibileen with icecold menace Mobley runs up to Aibileen but Hilly blocks her Hilly is with Elizabeth and her baby son and Mae Back on duty Aibileen let us herself into Elizabeth's kitchen through the back door her arms loaded with groceries Aibileen holds out her hand to Skeeter who smiles and nods through her tears Skeeter leafs through the pages of signatures her expression solemn hesitating to meet their gaze Outside her home The two women stand arminarm facing the packed church Aibileen beckons her to join her and she too seems suddenly shy stepping up next to her friend in front of all the people Minnie standing with the congregation lifts an approving eyebrow With her eyes lowered she takes it from him and finally summoning up a smile Looking bewildered Aibileen joins in the clapping then looks from smiling Pearly to smiling Minnie who proffers her the book and she stares at it numbly Minnie and Aibileen smartly dressed hurry to church where the whole congregation stands Johnny pulls out a chair for Minnie and as Celia serves up Minnie looks admiringly at the spread in front of her Minnie looks bemused then her lips crease into a smile as Celia beams from ear to ear Johnny taking off his jacket leads the way into the dining room and stands next to his wife In the heavily decorated dining room Celia in an offtheshoulder dress carefully places a dish of cookies into the center of the table alongside a cooked ham several cakes and pies and other dishes of food Johnny helps pick up the groceries hands her her bag and with a gentle guiding hand at her back and a goodnatured smile he walks her towards the house She hurries towards the house throws down the grocery bag and picks up a loose branch before tossing it away The car zooms right up behind her and she turns to see Johnny at the wheel Minnie's eyes shift but she does not quicken her pace Out in the sunshine Minnie is strolling towards Celia's house with a bag of groceries fanning herself in the heat when a red Chevrolet Corvette Convertible rolls into view Skeeter tries to smile but is overcome by sadness and Charlotte hugs her tightly Smiling warmly Charlotte leans in and kisses Skeeter on the forehead Skeeter looking at her handsome regallooking mother nods in acknowledgment but then lowers her eyes Skeeter looks away troubled as her mother weighs her words carefully"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "The two women stand arminarm facing the packed church Minnie standing with the congregation lifts an approving eyebrow Johnny taking off his jacket leads the way into the dining room and stands next to his wife Aibileen holds out her hand to Skeeter who smiles and nods through her tears Aibileen blows out her cheeks as she tries to catch her breath The car zooms right up behind her and she turns to see Johnny at the wheel Minnie's eyes shift but she does not quicken her pace Minnie looks bemused then her lips crease into a smile as Celia beams from ear to ear Looking bewildered Aibileen joins in the clapping then looks from smiling Pearly to smiling Minnie who proffers her the book and she stares at it numbly In the heavily decorated dining room Celia in an offtheshoulder dress carefully places a dish of cookies into the center of the table alongside a cooked ham several cakes and pies and other dishes of food Mobley runs up to Aibileen but Hilly blocks her Johnny pulls out a chair for Minnie and as Celia serves up Minnie looks admiringly at the spread in front of her Outside her home With her eyes lowered she takes it from him and finally summoning up a smile Elizabeth hurries out of the room with the baby as Hilly eyes Aibileen with icecold menace Skeeter looking at her handsome regallooking mother nods in acknowledgment but then lowers her eyes Minnie and Aibileen smartly dressed hurry to church where the whole congregation stands Smiling warmly Charlotte leans in and kisses Skeeter on the forehead Aibileen beckons her to join her and she too seems suddenly shy stepping up next to her friend in front of all the people Aibileen grabs Hilly's arm and with her lips trembling Hilly holds Aibileen's firm gaze then runs off into the next room Out in the sunshine Minnie is strolling towards Celia's house with a bag of groceries fanning herself in the heat when a red Chevrolet Corvette Convertible rolls into view Back on duty Aibileen let us herself into Elizabeth's kitchen through the back door her arms loaded with groceries She hurries towards the house throws down the grocery bag and picks up a loose branch before tossing it away Johnny helps pick up the groceries hands her her bag and with a gentle guiding hand at her back and a goodnatured smile he walks her towards the house Hilly is with Elizabeth and her baby son and Mae Skeeter looks away troubled as her mother weighs her words carefully Skeeter tries to smile but is overcome by sadness and Charlotte hugs her tightly Skeeter leafs through the pages of signatures her expression solemn hesitating to meet their gaze"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Looking bewildered Aibileen joins in the clapping then looks from smiling Pearly to smiling Minnie who proffers her the book and she stares at it numbly With her eyes lowered she takes it from him and finally summoning up a smile Minnie standing with the congregation lifts an approving eyebrow Aibileen beckons her to join her and she too seems suddenly shy stepping up next to her friend in front of all the people The two women stand arminarm facing the packed church Outside her home Skeeter leafs through the pages of signatures her expression solemn hesitating to meet their gaze Aibileen holds out her hand to Skeeter who smiles and nods through her tears Back on duty Aibileen let us herself into Elizabeth's kitchen through the back door her arms loaded with groceries Hilly is with Elizabeth and her baby son and Mae Mobley runs up to Aibileen but Hilly blocks her Elizabeth hurries out of the room with the baby as Hilly eyes Aibileen with icecold menace Aibileen grabs Hilly's arm and with her lips trembling Hilly holds Aibileen's firm gaze then runs off into the next room Aibileen blows out her cheeks as she tries to catch her breath Skeeter looks away troubled as her mother weighs her words carefully Skeeter looking at her handsome regallooking mother nods in acknowledgment but then lowers her eyes Smiling warmly Charlotte leans in and kisses Skeeter on the forehead Skeeter tries to smile but is overcome by sadness and Charlotte hugs her tightly Out in the sunshine Minnie is strolling towards Celia's house with a bag of groceries fanning herself in the heat when a red Chevrolet Corvette Convertible rolls into view Minnie's eyes shift but she does not quicken her pace The car zooms right up behind her and she turns to see Johnny at the wheel She hurries towards the house throws down the grocery bag and picks up a loose branch before tossing it away Johnny helps pick up the groceries hands her her bag and with a gentle guiding hand at her back and a goodnatured smile he walks her towards the house In the heavily decorated dining room Celia in an offtheshoulder dress carefully places a dish of cookies into the center of the table alongside a cooked ham several cakes and pies and other dishes of food Johnny taking off his jacket leads the way into the dining room and stands next to his wife Minnie looks bemused then her lips crease into a smile as Celia beams from ear to ear Johnny pulls out a chair for Minnie and as Celia serves up Minnie looks admiringly at the spread in front of her Minnie and Aibileen smartly dressed hurry to church where the whole congregation stands"
        }
      ]
    }
  ]
}