{
  "ground_truth": "She stubs out the cigarette and takes down the guilt frame photo. Setting her chin defiantly, she shuts the black and white photo away in the drawer. In the morning, she's lying asleep on her bed fully clothed as Charlotte in a skull cap and dressing gown bursts into her room and starts pulling clothes from the wardrobe. Later, elegantly dressed on the porch, Charlotte tries to eavesdrop on Stuart and Skeeter as she waters her plants. He starts walking away. Skeeter, glancing back towards the house, frowns speculatively. She strides past her smiling date. In a diner, shirt sleeves rolled up, he's ordered oysters. They clink oyster and cracker. He reaches across and takes her hand. She responds with a smile. Outside the diner, Stuart grabs her hand. He steps towards her and kisses her on the lips. Mae Mobley is sitting on Aibileen's knee with a picture book. Hilly comes out of her house grimacing. She pushes aside a press photographer. Toilets are scattered on the yard. She cradles her Yard of the Month sign and carries it inside to the amusement of the onlookers. Mae Mobley, with her knickers down, proudly sits on one of the many toilets scattered across the lawn. Elizabeth drags her off. Tenderly carrying Mae Mobley in her arms, Aibileen sets her down on the lawn surrounded by a dozen toilets. She kneels in front of her. Taking hold of her hands, she looks deeply into the child's moon face. They hug each other. Elizabeth, watching coldly from the front door, goes inside. At the Phelan's, Skeeter, Josefo, and Pascagoula are watching civil rights activist Medgar Evers on TV. Charlotte turns off the TV. The servants scoot away. Charlotte grabs Skeeter by the hand. Skeeter pulls away and goes. On a bus on her way home, Aibileen is napping. Henry, sitting nearby, looks up from his book. The bus stops. The driver switches on the inside lights and faces the passengers. Aibileen and Henry, who have been sitting at the back of the bus, hurriedly get out and walk off down the dark street. He goes. Seeing Henry disappear around the corner, Aibileen starts to run. Civil rights activist Roy Wilkins comments. Aibileen trips and falls. Minnie's children leave the kitchen. The three younger ones pile into one bed. The two friends put their arms around each other. With a somber expression, Skeeter flips back to the front cover of the LIFE magazine, which shows the distraught widow comforting her young son. At the foot mansion, Minnie is hoovering down a stuffed standing grizzly bear on a corner dice. She looks towards the fad and steps down from the platform. She strolls through the spacious rooms and comes into the bedroom, making a beeline for the bathroom door.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "She extinguishes the cigarette and removes the guilt frame photograph. Setting her chin defiantly, she closes the black and white photograph away in the drawer. In the morning, she's lying asleep on her bed fully clothed as Charlotte in a skullcap and dressing gown bursts into her room and starts pulling garments from the wardrobe. Later, elegantly dressed on the porch, Charlotte attempts to eavesdrop on Stuart and Skeeter as she waters her plants. He starts walking away. Skeeter, glancing back towards the house, frowns thoughtfully. She strides past her smiling date. In a diner, shirt sleeves rolled up, he's ordered oysters. They clink oyster and cracker. He reaches across and takes her hand. She responds with a smile. Outside the diner, Stuart grabs her hand. He steps towards her and kisses her on the lips. Mae Mobley is sitting on Aibileen's knee with a picture book. Hilly comes out of her house grimacing. She pushes aside a press photographer. Toilets are scattered on the yard. She cradles her Yard of the Month sign and carries it inside to the amusement of the onlookers. Mae Mobley, with her knickers down, proudly sits on one of the many toilets scattered across the lawn. Elizabeth drags her off. Tenderly carrying Mae Mobley in her arms, Aibileen sets her down on the lawn surrounded by a dozen toilets. She kneels in front of her. Taking hold of her hands, she looks deeply into the child's moon face. They embrace each other. Elizabeth, watching coldly from the front door, goes inside. At the Phelan's, Skeeter, Josefo, and Pascagoula are watching civil rights proponent Medgar Evers on TV. Charlotte turns off the TV. The servants scoot away. Charlotte grabs Skeeter by the hand. Skeeter pulls away and goes. On a bus on her way home, Aibileen is napping. Henry, sitting nearby, looks up from his book. The bus stops. The driver switches on the interior lights and faces the passengers. Aibileen and Henry, who have been sitting at the back of the bus, hurriedly get out and walk off down the dark street. He goes. Seeing Henry disappear around the corner, Aibileen starts to run. Civil rights advocate Roy Wilkins comments. Aibileen trips and falls. Minnie's children leave the kitchen. The three younger ones pile into one bed. The two friends put their arms around each other. With a somber expression, Skeeter flips back to the front cover of the LIFE magazine, which shows the distraught widow comforting her young son. At the foot mansion, Minnie is vacuuming down a stuffed standing grizzly bear on a corner dice. She looks towards the fad and steps down from the platform. She strolls through the spacious rooms and comes into the bedroom, making a beeline for the bathroom door."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The cigarette is stubbed out by her, and the guilt frame photo is taken down by her. With her chin set defiantly, the black and white photo is shut away in the drawer. In the morning, she is asleep on her bed fully clothed, as Charlotte bursts into her room in a skull cap and dressing gown and starts pulling clothes from the wardrobe. Later, on the porch, elegantly dressed, Charlotte eavesdrops on Stuart and Skeeter while she waters her plants. He is started to walk away. Skeeter glances back towards the house and frowns speculatively. Her smiling date is strode past by her. In a diner, with shirt sleeves rolled up, oysters are ordered by him. Oyster and cracker are clinked by them. Her hand is reached across and taken by him. She smiles in response. Outside the diner, her hand is grabbed by Stuart. He steps towards her and kisses her on the lips. Mae Mobley sits on Aibileen's knee with a picture book. Hilly comes out of her house and grimaces. A press photographer is pushed aside by her. Toilets are scattered across the yard. Her Yard of the Month sign is cradled by her and carried inside to the amusement of the onlookers. Mae Mobley, with her knickers down, is sitting proudly on one of the many toilets scattered across the lawn. Elizabeth drags her off. Tenderly, Mae Mobley is carried in Aibileen's arms and set down on the lawn surrounded by a dozen toilets. She kneels in front of her. Aibileen takes hold of her hands and looks deeply into the child's moon face. Each other is hugged by them. Watching coldly from the front door, Elizabeth goes inside. At the Phelans', civil rights activist Medgar Evers is watched on TV by Skeeter, Josefo, and Pascagoula. Charlotte turns off the TV. The servants' scooting away is caused by her. Charlotte grabs Skeeter by the hand. Skeeter pulls away and leaves. On a bus on her way home, Aibileen naps. Henry, sitting nearby, looks up from his book. The bus is stopped. The inside lights are switched on by the driver, who then faces the passengers. Aibileen and Henry, who were sitting at the back of the bus, hurriedly get out and walk off down the dark street. He leaves. Seeing Henry disappear around the corner, running is started by Aibileen. Roy Wilkins, a civil rights activist, comments. Falling is done by Aibileen when she trips. Minnie's children leave the kitchen. One bed is piled into by the three younger ones. Each other is put their arms around by the two friends. With a somber expression, the front cover of the LIFE magazine is flipped back to by Skeeter, which shows the distraught widow comforting her young son. At the foot mansion, a stuffed standing grizzly bear is hoovered down by Minnie on a corner dice. She looks towards the fad and steps down from the platform. Strolling through the spacious rooms, she makes a beeline for the bathroom door in the bedroom."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "She extinguishes the cigarette and puts away the framed photo, setting her chin defiantly. In the morning, she sleeps fully clothed as Charlotte, in a skull cap and gown, bursts in, pulling clothes from the wardrobe. Later, elegantly dressed, Charlotte eavesdrops on Stuart and Skeeter while watering plants. Skeeter frowns back at the house. In a diner, Stuart orders oysters, and they clink oyster and cracker. He takes her hand, and she smiles. Outside, Stuart grabs her hand and kisses her. Mae Mobley sits on Aibileen's knee with a picture book. Hilly grimaces, pushing past a photographer. Toilets scatter the yard. She cradles her Yard of the Month sign, amusing onlookers. Mae Mobley, with her knickers down, sits on a toilet. Elizabeth drags her off. Aibileen tenderly sets Mae Mobley on the lawn surrounded by toilets, kneels, and they hug. Elizabeth watches coldly from the door. At the Phelan's, Skeeter, Josefo, and Pascagoula watch Medgar Evers on TV. Charlotte turns it off, and the servants leave. Charlotte grabs Skeeter's hand, but Skeeter pulls away. On a bus, Aibileen naps as Henry reads. The bus stops, and they hurriedly exit, walking down the dark street. Aibileen runs after Henry disappears. Roy Wilkins comments. Aibileen trips. Minnie's children leave the kitchen, piling into bed. Skeeter somberly flips through LIFE magazine, showing a widow comforting her son. At the mansion, Minnie vacuums a stuffed bear, then heads to the bathroom."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "She extinguishes the cigarette and stores the framed photo in a drawer. In the morning, she sleeps fully clothed as Charlotte, in a skull cap and gown, enters and pulls clothes from the wardrobe. Later, Charlotte, elegantly dressed, eavesdrops on Stuart and Skeeter while watering plants. Skeeter frowns as Stuart walks away. At a diner, he orders oysters, and they clink oyster and cracker. He takes her hand, and she smiles. Outside, Stuart kisses her. Mae Mobley sits on Aibileen's knee with a book. Hilly grimaces, pushes a photographer, and carries her Yard of the Month sign inside, amusing onlookers. Mae Mobley sits on a lawn toilet; Elizabeth drags her off. Aibileen sets Mae Mobley down, kneels, and they hug. Elizabeth watches coldly. At the Phelan's, Skeeter, Josefo, and Pascagoula watch Medgar Evers on TV until Charlotte turns it off. Skeeter leaves. On a bus, Aibileen naps. Henry looks up as the bus stops. Aibileen and Henry exit and walk down the street. Aibileen runs after Henry disappears. Roy Wilkins comments. Aibileen trips. Minnie's children pile into bed. Skeeter flips through LIFE magazine, showing a widow comforting her son. Minnie vacuums a grizzly bear, steps down, and heads to the bathroom."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "She extinguishes the cigarette with a decisive motion and carefully takes down the framed photograph that has been hanging on the wall, a symbol of her guilt. With a determined set to her chin, she places the black and white photo into the drawer, shutting it away from view. The next morning, she is found lying asleep on her bed, still fully clothed from the night before. Suddenly, Charlotte, wearing a skull cap and a dressing gown, bursts energetically into the room and begins pulling clothes from the wardrobe with urgency. Later on, Charlotte, now elegantly dressed, stands on the porch, attempting to discreetly eavesdrop on Stuart and Skeeter as she tends to her plants by watering them. Stuart begins to walk away, and Skeeter, casting a glance back towards the house, frowns with a speculative expression. She strides confidently past her smiling date. In a bustling diner, with his shirt sleeves rolled up, he has ordered a plate of oysters. They clink together an oyster and a cracker in a small celebratory gesture. He reaches across the table and gently takes her hand, to which she responds with a warm smile. Outside the diner, Stuart firmly grabs her hand, steps closer, and kisses her tenderly on the lips. Meanwhile, Mae Mobley is comfortably seated on Aibileen's knee, engrossed in a picture book. Hilly emerges from her house with a grimace on her face, pushing aside a press photographer who is in her way. The yard is scattered with toilets, a sight that draws attention. She cradles her Yard of the Month sign protectively and carries it inside, much to the amusement of the onlookers. Mae Mobley, with her knickers down, proudly sits on one of the many toilets scattered across the lawn, but Elizabeth quickly drags her off. Tenderly, Aibileen carries Mae Mobley in her arms and sets her down gently on the lawn, surrounded by a dozen toilets. She kneels in front of the child, taking hold of her small hands, and looks deeply into her moon-shaped face. They embrace each other warmly. Elizabeth, watching with a cold demeanor from the front door, turns and goes inside. At the Phelan's residence, Skeeter, Josefo, and Pascagoula are intently watching civil rights activist Medgar Evers on the television. Charlotte abruptly turns off the TV, causing the servants to quickly disperse. Charlotte grabs Skeeter by the hand, but Skeeter pulls away and leaves. On a bus heading home, Aibileen is napping peacefully. Nearby, Henry looks up from his book. The bus comes to a stop, and the driver switches on the inside lights, facing the passengers. Aibileen and Henry, who have been sitting at the back of the bus, hurriedly get out and walk off down the dark street. Henry goes his separate way. Seeing Henry disappear around the corner, Aibileen starts to run. Civil rights activist Roy Wilkins is heard commenting. Aibileen trips and falls. Minnie's children leave the kitchen, and the three younger ones pile into one bed. The two friends put their arms around each other in a comforting embrace. With a somber expression, Skeeter flips back to the front cover of the LIFE magazine, which features the distraught widow comforting her young son. At the foot mansion, Minnie is diligently hoovering down a stuffed standing grizzly bear positioned on a corner dice. She looks towards the fad and steps down from the platform. She strolls through the spacious rooms and makes her way into the bedroom, heading directly for the bathroom door."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "With a decisive and deliberate motion, she extinguishes the cigarette and then carefully takes down the framed photograph that has long been hanging on the wall, a lingering symbol of her deep-seated guilt. With a determined expression set firmly on her face, she places the somber black-and-white photo into the drawer, shutting it away from view and mind. When the next morning arrives, she is discovered lying asleep on her bed, still fully dressed in the clothes she wore from the night before. Suddenly, Charlotte, wearing a snug skull cap and a cozy dressing gown, bursts energetically into the room, immediately beginning to pull clothes from the wardrobe with a sense of urgency. Later on, Charlotte, now elegantly dressed to perfection, stands on the porch, attempting to discreetly eavesdrop on the conversation between Stuart and Skeeter as she tends to her plants, watering them with care. As Stuart begins to walk away, Skeeter, casting a glance back towards the house, frowns with a thoughtful, speculative expression on her face. She strides confidently past her date, who is smiling warmly at her. In a bustling, lively diner, with his shirt sleeves rolled up casually, he has ordered a plate of fresh oysters. They celebrate with a small, unique gesture by clinking together an oyster and a cracker. He reaches across the table with a gentle touch and takes her hand, to which she responds by giving him a warm, affectionate smile. Outside the diner, Stuart firmly holds her hand, steps closer with determination, and kisses her tenderly on the lips. Meanwhile, Mae Mobley sits comfortably on Aibileen's knee, thoroughly engrossed in a colorful picture book. Hilly emerges from her house with a distinct grimace on her face, pushing aside a press photographer obstructively standing in her way. The yard outside is scattered with toilets, an unusual sight that draws significant attention. Hilly cradles her Yard of the Month sign protectively and carries it inside the house, much to the amusement of the onlookers. Mae Mobley, with her knickers down, proudly sits on one of the several toilets scattered across the lawn, but Elizabeth promptly drags her off. With a tender touch, Aibileen carries Mae Mobley in her arms and gently sets her down on the lawn, surrounded by a dozen toilets. She kneels in front of the child, takes hold of her small, soft hands, and looks deeply into her innocent, moon-shaped face. They embrace each other warmly and affectionately. Elizabeth, watching with a cold, distant demeanor from the front door, turns and retreats inside. At the Phelan's residence, Skeeter, Josefo, and Pascagoula are intently focused on watching civil rights activist Medgar Evers on the television. Charlotte abruptly turns off the TV, causing the servants to scatter and disperse quickly. Grabbing Skeeter by the hand, Charlotte tries to hold her, but Skeeter pulls away and leaves. On a bus heading home, Aibileen is peacefully napping. Nearby, Henry looks up momentarily from his book. The bus comes to a stop, and the driver switches on the inside lights, facing the passengers directly. Aibileen and Henry, who have been quietly sitting at the back of the bus, hurriedly get out and walk off, down the dark street. Henry goes his separate way, disappearing into the night. Seeing Henry disappear around the corner, Aibileen starts to run with urgency. The words of civil rights activist Roy Wilkins are heard in the background, commenting. Aibileen trips and stumbles, falling down. Minnie's children leave the kitchen, and the three younger ones pile into one bed together. The two friends put their arms around each other in a comforting, supportive embrace. With a somber expression on her face, Skeeter flips back to the front cover of the LIFE magazine, which features the distraught widow comforting her young son in a poignant image. At the foot mansion, Minnie is diligently hoovering down a stuffed standing grizzly bear positioned on a corner dice. She looks towards the distance with contemplation and steps down from the platform. She strolls through the spacious, elegant rooms and makes her way deliberately into the bedroom, heading directly for the bathroom door."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "She extinguishes the cigarette with a firm press, ensuring the ember is completely out, and then reaches up to carefully take down the guilt-framed photo from its place. With a determined set to her chin, she decisively places the black and white photo into the drawer, closing it with a sense of finality. The next morning, she is sprawled on her bed, still in her clothes from the previous day, when Charlotte, wearing a skull cap and dressing gown, energetically bursts into the room. Without hesitation, Charlotte begins to pull clothes from the wardrobe, creating a flurry of fabric. Later, Charlotte, now elegantly dressed, stands on the porch, subtly trying to catch snippets of conversation between Stuart and Skeeter as she tends to her plants, watering them with deliberate care. As Stuart begins to walk away, Skeeter casts a backward glance towards the house, his expression thoughtful and speculative. She confidently strides past her date, who is smiling at her. In a diner, with his shirt sleeves rolled up, he has ordered oysters, and they share a moment of camaraderie as they clink an oyster and a cracker together. He reaches across the table to take her hand, and she responds with a warm smile. Outside the diner, Stuart seizes her hand, steps closer, and kisses her gently on the lips. Meanwhile, Mae Mobley is comfortably seated on Aibileen's knee, engrossed in a picture book. Hilly emerges from her house with a grimace, pushing past a press photographer with irritation. Scattered across the yard are numerous toilets, and she cradles her Yard of the Month sign, carrying it inside while onlookers find amusement in the scene. Mae Mobley, with her knickers down, proudly perches on one of the many toilets scattered across the lawn, only to be quickly pulled off by Elizabeth. Aibileen, with tenderness, carries Mae Mobley in her arms and sets her down gently on the lawn, surrounded by the dozen toilets. Kneeling in front of her, Aibileen takes the child's hands, looking deeply into her moon-like face, and they share a heartfelt hug. Elizabeth, observing coldly from the front door, turns and goes inside. At the Phelan's, Skeeter, Josefo, and Pascagoula are intently watching civil rights activist Medgar Evers on TV until Charlotte abruptly turns off the television, prompting the servants to quickly disperse. Charlotte then grabs Skeeter by the hand, but Skeeter pulls away and leaves. On a bus heading home, Aibileen is napping, while Henry, sitting nearby, glances up from his book. As the bus comes to a halt, the driver switches on the interior lights and addresses the passengers. Aibileen and Henry, seated at the back, hurriedly disembark and walk briskly down the dark street. As Henry disappears around a corner, Aibileen begins to run, spurred by the urgency of the moment. Civil rights activist Roy Wilkins' voice comments in the background as Aibileen trips and falls. In another scene, Minnie's children leave the kitchen, with the three younger ones piling into one bed, while the two friends embrace each other with their arms around one another. With a somber expression, Skeeter flips back to the front cover of the LIFE magazine, which features the image of a distraught widow comforting her young son. At the foot mansion, Minnie is diligently hoovering a stuffed standing grizzly bear positioned on a corner dice. She pauses to glance towards the fad, then steps down from the platform and strolls through the spacious rooms, making her way directly to the bathroom door."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "She extinguishes the cigarette and defiantly stores the framed photo in a drawer. The next morning, she is asleep fully clothed when Charlotte, in a skull cap and dressing gown, bursts in and starts selecting clothes from the wardrobe. Later, Charlotte, elegantly dressed, attempts to eavesdrop on Stuart and Skeeter from the porch while tending to her plants. As Stuart walks away, Skeeter glances back at the house with a speculative frown and strides past her smiling date. In a diner, they share oysters and a smile, and he reaches for her hand. Outside, Stuart takes her hand and kisses her. Meanwhile, Mae Mobley sits on Aibileen's knee with a picture book. Hilly exits her house, grimacing as she pushes past a press photographer, cradling her Yard of the Month sign amidst scattered toilets, amusing onlookers. Mae Mobley, with her knickers down, proudly sits on one of the toilets before Elizabeth drags her off. Aibileen tenderly carries Mae Mobley to the lawn surrounded by toilets, kneels, and they share a heartfelt hug. Elizabeth watches coldly from the door before going inside. At the Phelan's, Skeeter, Josefo, and Pascagoula watch Medgar Evers on TV until Charlotte turns it off, prompting the servants to leave. Charlotte grabs Skeeter's hand, but Skeeter pulls away and leaves. On a bus ride home, Aibileen naps while Henry reads nearby. When the bus stops, they hurriedly disembark and walk down the dark street. Aibileen starts to run after seeing Henry disappear around a corner, but she trips and falls as Roy Wilkins comments on civil rights. Minnie's children leave the kitchen, pile into bed, and she and a friend embrace. With a somber expression, Skeeter reflects on a LIFE magazine cover showing a distraught widow comforting her son. At the mansion, Minnie vacuums a stuffed grizzly bear, then strolls through the spacious rooms to the bathroom door."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "She stubs out the cigarette, a habit she picked up during late nights of writing, and takes down the guilt frame photo, a cherished memento from her grandmother. Setting her chin defiantly, she shuts the black and white photo away in the drawer, an heirloom capturing a family reunion from the 1950s. In the morning, she's lying asleep on her bed fully clothed as Charlotte, her vivacious younger cousin known for her eccentric fashion sense, in a skull cap and dressing gown bursts into her room and starts pulling clothes from the wardrobe, preparing for a lively day. Later, elegantly dressed on the porch, which is lined with vibrant bougainvillaea, Charlotte tries to eavesdrop on Stuart and Skeeter as she waters her plants. Stuart, a friend from college known for his charming yet mysterious demeanor, starts walking away. Skeeter, glancing back towards the house, frowns speculatively as she catches a glimpse of an old family portrait. She strides past her smiling date. In a diner, a local favorite known for its clam chowder, shirt sleeves rolled up, he's ordered oysters, a delicacy noted for its romantic associations. They clink oyster and cracker. He reaches across and takes her hand. She responds with a smile. Outside the diner, Stuart grabs her hand. He steps towards her and kisses her on the lips, a gesture signaling the deepening of their relationship. Mae Mobley is sitting on Aibileen's knee with a picture book, one of a series that Aibileen often reads to her, fostering her love for stories. Hilly comes out of her house grimacing, a reaction familiar to those aware of her disdain for disorder. She pushes aside a press photographer, eager to avoid public scrutiny. Toilets are scattered on the yard, a comedic statement against her by neighborhood pranksters. She cradles her Yard of the Month sign, evidence of her prized gardening skills, and carries it inside to the amusement of the onlookers. Mae Mobley, with her knickers down, proudly sits on one of the many toilets scattered across the lawn, a naive participant in the spectacle. Elizabeth drags her off, embarrassed by the scene. Tenderly carrying Mae Mobley in her arms, Aibileen sets her down on the lawn surrounded by a dozen toilets, creating an odd juxtaposition against the manicured landscape. She kneels in front of her. Taking hold of her hands, she looks deeply into the child's moon face, seeking to impart wisdom and love. They hug each other. Elizabeth, watching coldly from the front door, goes inside, upset about the tarnished social image. At the Phelan's, Skeeter, Josefo, and Pascagoula are watching civil rights activist Medgar Evers, whose recent assassination has sent shockwaves through the nation, on TV. Charlotte turns off the TV, concerned about the rising tension. The servants scoot away. Charlotte grabs Skeeter by the hand. Skeeter pulls away and goes, determined to make a stand. On a bus on her way home, Aibileen is napping, exhausted from the day's events. Henry, sitting nearby, looks up from his book about civil rights history. The bus stops. The driver switches on the inside lights and faces the passengers. Aibileen and Henry, who have been sitting at the back of the bus, hurriedly get out and walk off down the dark street, a path made familiar by their daily routine. He goes. Seeing Henry disappear around the corner, Aibileen starts to run, spurred by a sudden realization. Civil rights activist Roy Wilkins comments, his voice echoing in her mind as a source of inspiration. Aibileen trips and falls. Minnie's children leave the kitchen, having just finished their dinner. The three younger ones pile into one bed, a nightly ritual that brings them comfort. The two friends put their arms around each other, seeking solace in their shared experiences. With a somber expression, Skeeter flips back to the front cover of the LIFE magazine, which shows the distraught widow Coretta Scott King comforting her young son, a poignant image of loss and resilience. At the foot mansion, Minnie is hoovering down a stuffed standing grizzly bear on a corner dice, a peculiar decoration chosen by the eccentric homeowner. She looks towards the fad and steps down from the platform, feeling a sense of foreboding. She strolls through the spacious rooms, with their opulent decor, and comes into the bedroom, making a beeline for the bathroom door, where secrets often lie hidden."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "She stubs out the cigarette and takes down the guilt frame photo  Setting her chin defiantly she shuts the black and white photo away in the drawer  In the morning she's lying asleep on her bed fully clothed as Charlotte in a skull cap and dressing gown bursts into her room and starts pulling clothes from the wardrobe  Later elegantly dressed on the porch Charlotte tries to eavesdrop on Stuart and Skeeter as she waters her plants  He starts walking away  Skeeter glancing back towards the house frowns speculatively  She strides past her smiling date  Tenderly carrying Mae Mobley in her arms  Aibileen sets her down on the lawn surrounded by a dozen toilets  She kneels in front of her  Taking hold of her hands she looks deeply into the child's moon face  They hug each other  Elizabeth watching coldly from the front door goes inside  At the Phelan's Skeeter  Josefo and Pascagoula are watching  civil rights activist Medgar Evers on TV  Charlotte turns off the TV  The servants scoot away  Charlotte grabs Skeeter by the hand  Skeeter pulls away and goes  On a bus on her way home  Aibileen is napping  Henry sitting nearby looks up from his book  The bus stops  The driver switches on the inside lights and faces the passengers  Aibileen and Henry who have been sitting at the back of the bus hurriedly get out and walk off down the dark street  He goes  Seeing Henry disappear around the corner  Aibileen starts to run  Civil rights activist Roy Wilkins comments  Aibileen trips and falls  Minnie's children leave the kitchen  The three younger ones pile into one bed  In a diner shirt sleeves rolled up he's ordered oysters  They clink oyster and cracker  He reaches across and takes her hand  She responds with a smile  Outside the diner Stuart grabs her hand  He steps towards her and kisses her on the lips  Mae Mobley is sitting on Aibileen's knee with a picture book  Hilly comes out of her house grimacing  She pushes aside a press photographer  Toilets are scattered on the yard  She cradles her Yard of the Month sign and carries it inside to the amusement of the onlookers  Mae Mobley with her knickers down proudly sits on one of the many toilets scattered across the lawn  Elizabeth drags her off  Tenderly carrying Mae Mobley in her arms  Aibileen sets her down on the lawn surrounded by a dozen toilets  She kneels in front of her  Taking hold of her hands she looks deeply into the child's moon face  They hug each other  Elizabeth watching coldly from the front door goes inside  At the Phelan's Skeeter  Josefo and Pascagoula are watching  civil rights activist Medgar Evers on TV  Charlotte turns off the TV  The servants scoot away  Charlotte grabs Skeeter by the hand  Skeeter pulls away and goes  On a bus on her way home  Aibileen is napping  Henry sitting nearby looks up from his book  The bus stops  The driver switches on the inside lights and faces the passengers  Aibileen and Henry who have been sitting at the back of the bus hurriedly get out and walk off down the dark street  He goes  Seeing Henry disappear around the corner  Aibileen starts to run  Civil rights activist Roy Wilkins comments  Aibileen trips and falls  Minnie's children leave the kitchen  The three younger ones pile into one bed  The two friends put their arms around each other  With a somber expression  Skeeter flips back to the front cover of the LIFE magazine which shows the distraught widow comforting her young son  At the foot mansion Minnie is hoovering down a stuffed standing grizzly bear on a corner dice  She looks towards the fad and steps down from the platform  She strolls through the spacious rooms and comes into the bedroom making a beeline for the bathroom door"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "She stubs out the cigarette and takes down the guilt frame photo. Setting her chin defiantly she shuts the black and white photo away in the drawer. In the morning she is lying asleep on her bed fully clothed as Charlotte in a skull cap and dressing gown bursts into her room and starts pulling clothes from the wardrobe. Later elegantly dressed on the porch Charlotte tries to eavesdrop on Stuart and Skeeter as she waters her plants. He starts walking away. Skeeter glancing back towards the house frowns speculatively. She strides past her smiling date. In a diner shirt sleeves rolled up he is ordered oysters. They clink oyster and cracker. He reaches across and takes her hand. She responds with a smile. Outside the diner Stuart grabs her hand. He steps towards her and kisses her on the lips. Mae Mobley is sitting on Aibileen's knee with a picture book. Hilly comes out of her house grimacing. She pushes aside a press photographer. Toilets are scattered on the yard. She cradles her Yard of the Month sign and carries it inside to the amusement of the onlookers. Mae Mobley with her knickers down proudly sits on one of the many toilets scattered across the lawn. Elizabeth drags her off. Tenderly carrying Mae Mobley in her arms. Aibileen sets her down on the lawn surrounded by a dozen toilets. She kneels in front of her. Taking hold of her hands she looks deeply into the child's moon face. They hug each other. Elizabeth watching coldly from the front door goes inside. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. At the Phelan's Skeeter. Josefo and Pascagoula are watching. civil rights activist Medgar Evers on TV. Charlotte turns off the TV. The servants scoot away. Charlotte grabs Skeeter by the hand. Skeeter pulls away and goes. On a bus on her way home. Aibileen is napping. Henry sitting nearby looks up from his book. The bus stops. The driver switches on the inside lights and faces the passengers. Aibileen and Henry who have been sitting at the back of the bus hurriedly get out and walk off down the dark street. He goes. Seeing Henry disappear around the corner. Aibileen starts to run. Civil rights activist Roy Wilkins comments. Aibileen trips and falls. Minnie's children leave the kitchen. The three younger ones pile into one bed. The two friends put their arms around each other. With a somber expression. Skeeter flips back to the front cover of the LIFE magazine which shows the distraught widow comforting her young son. At the foot mansion Minnie is hoovering down a stuffed standing grizzly bear on a corner dice. She looks towards the fad and steps down from the platform. She strolls through the spacious rooms and comes into the bedroom making a beeline for the bathroom door."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "She stubs out the cigarette and takes down the guilt frame photo. Setting her chin defiantly she shuts the black and white photo away in the drawer. In the morning she is lying asleep on her bed fully clothed as Charlotte in a skull cap and dressing gown bursts into her room and starts pulling clothes from the wardrobe. Later elegantly dressed on the porch Charlotte tries to eavesdrop on Stuart and Skeeter as she waters her plants. He starts walking away. Skeeter glancing back towards the house frowns speculatively. She strides past her smiling date. In a diner shirt sleeves rolled up he is ordered oysters. They clink oyster and cracker. He reaches across and takes her hand. She responds with a smile. Outside the diner Stuart grabs her hand. He steps towards her and kisses her on the lips. Mae Mobley is sitting on Aibileen's knee with a picture book. Hilly comes out of her house grimacing. She pushes aside a press photographer. Toilets are scattered on the yard. She cradles her Yard of the Month sign and carries it inside to the amusement of the onlookers. Mae Mobley with her knickers down proudly sits on one of the many toilets scattered across the lawn. Elizabeth drags her off. Tenderly carrying Mae Mobley in her arms. Aibileen sets her down on the lawn surrounded by a dozen toilets. She kneels in front of her. Taking hold of her hands she looks deeply into the child's moon face. They hug each other. Elizabeth watching coldly from the front door goes inside. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. At the Phelan's Skeeter. Josefo and Pascagoula are watching. civil rights activist Medgar Evers on TV. Charlotte turns off the TV. The servants scoot away. Charlotte grabs Skeeter by the hand. Skeeter pulls away and goes. On a bus on her way home. Aibileen is napping. Henry sitting nearby looks up from his book. The bus stops. The driver switches on the inside lights and faces the passengers. Aibileen and Henry who have been sitting at the back of the bus hurriedly get out and walk off down the dark street. He goes. Seeing Henry disappear around the corner. Aibileen starts to run. Civil rights activist Roy Wilkins comments. Aibileen trips and falls. Minnie's children leave the kitchen. The three younger ones pile into one bed. The two friends put their arms around each other. With a somber expression. Skeeter flips back to the front cover of the LIFE magazine which shows the distraught widow comforting her young son. At the foot mansion Minnie is hoovering down a stuffed standing grizzly bear on a corner dice. She looks towards the fad and steps down from the platform. She strolls through the spacious rooms and comes into the bedroom making a beeline for the bathroom door."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "She stubs out the cigarette and takes down the guilt frame photo. Setting her chin defiantly she shuts the black and white photo away in the drawer. In the morning she is lying asleep on her bed fully clothed as Charlotte in a skull cap and dressing gown bursts into her room and starts pulling clothes from the wardrobe. Later elegantly dressed on the porch Charlotte tries to eavesdrop on Stuart and Skeeter as she waters her plants. He starts walking away. Skeeter glancing back towards the house frowns speculatively. She strides past her smiling date. In a diner shirt sleeves rolled up he is ordered oysters. They clink oyster and cracker. He reaches across and takes her hand. She responds with a smile. Outside the diner Stuart grabs her hand. He steps towards her and kisses her on the lips. He goes. Seeing Henry disappear around the corner. Aibileen starts to run. Civil rights activist Roy Wilkins comments. Aibileen trips and falls. Minnie's children leave the kitchen. The three younger ones pile into one bed. The two friends put their arms around each other. With a somber expression. Skeeter flips back to the front cover of the LIFE magazine which shows the distraught widow comforting her young son. At the foot mansion Minnie is hoovering down a stuffed standing grizzly bear on a corner dice. She looks towards the fad and steps down from the platform. She strolls through the spacious rooms and comes into the bedroom making a beeline for the bathroom door."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "She stubs out the cigarette and takes down the guilt frame photo. Setting her chin defiantly she shuts the black and white photo away in the drawer. In the morning she is lying asleep on her bed fully clothed as Charlotte in a skull cap and dressing gown bursts into her room and starts pulling clothes from the wardrobe. Later elegantly dressed on the porch Charlotte tries to eavesdrop on Stuart and Skeeter as she waters her plants. He starts walking away. Skeeter glancing back towards the house frowns speculatively. With a somber expression. Skeeter flips back to the front cover of the LIFE magazine which shows the distraught widow comforting her young son. At the foot mansion Minnie is hoovering down a stuffed standing grizzly bear on a corner dice. She looks towards the fad and steps down from the platform. She strolls through the spacious rooms and comes into the bedroom making a beeline for the bathroom door."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "She stubs out the cigarette and takes down the guilt frame photo. Setting its chin defiantly, the dog shuts the black and white photo away in the drawer. In the morning, it's lying asleep on its bed fully clothed as a dragon in a skull cap and dressing gown bursts into the room and starts pulling clothes from the wardrobe. Later, elegantly dressed on the porch, the dragon tries to eavesdrop on a raccoon and a squirrel as it waters its plants. The raccoon starts walking away. The squirrel, glancing back towards the house, frowns speculatively. The dragon strides past its smiling date. In a diner, shirt sleeves rolled up, the giraffe has ordered oysters. They clink oyster and cracker. The giraffe reaches across and takes the whale's hand. The whale responds with a smile. Outside the diner, the raccoon grabs the whale's hand. The raccoon steps towards the whale and kisses it on the lips. A cat is sitting on a rabbit's knee with a picture book. A turtle comes out of its house grimacing. The turtle pushes aside a press photographer. Toilets are scattered on the yard. The turtle cradles its Yard of the Month sign and carries it inside to the amusement of the onlookers. The cat, with its knickers down, proudly sits on one of the many toilets scattered across the lawn. A penguin drags the cat off. Tenderly carrying the cat in its arms, the rabbit sets it down on the lawn surrounded by a dozen toilets. The rabbit kneels in front of the cat. Taking hold of the cat's hands, the rabbit looks deeply into the cat's moon face. They hug each other. The penguin, watching coldly from the front door, goes inside. At the Phelan's, the squirrel, a zebra, and a gazelle are watching civil rights activist Rosa Parks on TV. An elephant turns off the TV. The servants scoot away. The elephant grabs the squirrel by the hand. The squirrel pulls away and goes. On a bus on its way home, the rabbit is napping. A parrot, sitting nearby, looks up from its book. The bus stops. The driver switches on the inside lights and faces the passengers. The rabbit and the parrot, who have been sitting at the back of the bus, hurriedly get out and walk off down the dark street. The parrot goes. Seeing the parrot disappear around the corner, the rabbit starts to run. Civil rights activist Harriet Tubman comments. The rabbit trips and falls. A wolf's children leave the kitchen. The three younger ones pile into one bed. The two friends put their arms around each other. With a somber expression, the squirrel flips back to the front cover of the LIFE magazine, which shows the distraught widow comforting her young son. At the foot mansion, a fox is hoovering down a stuffed standing grizzly bear on a corner dice. The fox looks towards the fad and steps down from the platform. The fox strolls through the spacious rooms and comes into the bedroom, making a beeline for the bathroom door."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "She stubs out the incense stick and takes down the abstract painting. Setting her chin defiantly, she shuts the colorful illustration away in the closet. In the morning, she's lying asleep on her hammock fully clothed as Charlotte in a fedora and trench coat bursts into her room and starts pulling shoes from the cupboard. Later, elegantly dressed on the balcony, Charlotte tries to eavesdrop on Stuart and Skeeter as she waters her cactus. He starts walking away. Skeeter, glancing back towards the villa, frowns speculatively. She strides past her smiling companion. In a café, shirt sleeves rolled up, he's ordered mussels. They clink mussels and breadsticks. He reaches across and takes her hand. She responds with a smile. Outside the café, Stuart grabs her hand. He steps towards her and kisses her on the forehead. Mae Mobley is sitting on Aibileen's knee with a coloring book. Hilly comes out of her apartment grimacing. She pushes aside a newspaper photographer. Garden gnomes are scattered on the patio. She cradles her Garden of the Month trophy and carries it inside to the amusement of the onlookers. Mae Mobley, with her overalls down, proudly sits on one of the many gnomes scattered across the patio. Elizabeth drags her off. Tenderly carrying Mae Mobley in her arms, Aibileen sets her down on the patio surrounded by a dozen gnomes. She kneels in front of her. Taking hold of her hands, she looks deeply into the child's round face. They hug each other. Elizabeth, watching coldly from the balcony door, goes inside. At the Phelan's, Skeeter, Josefo, and Pascagoula are watching civil rights activist Martin Luther King Jr. on TV. Charlotte turns off the TV. The servants scoot away. Charlotte grabs Skeeter by the hand. Skeeter pulls away and goes. On a tram on her way home, Aibileen is napping. Henry, sitting nearby, looks up from his comic book. The tram stops. The conductor switches on the inside lights and faces the passengers. Aibileen and Henry, who have been sitting at the back of the tram, hurriedly get out and walk off down the park path. He goes. Seeing Henry disappear around the fountain, Aibileen starts to run. Civil rights activist Rosa Parks comments. Aibileen trips and falls. Minnie's children leave the living room. The three younger ones pile into one bed. The two friends put their arms around each other. With a somber expression, Skeeter flips back to the front cover of the TIME magazine, which shows the distraught widow comforting her young daughter. At the estate, Minnie is dusting down a stuffed standing polar bear on a corner rug. She looks towards the light fixture and steps down from the platform. She strolls through the airy corridors and comes into the bedroom, making a beeline for the kitchen door."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "She flicks off the cigarette and pulls down the guilt frame photo. Setting her chin defiantly, she tosses the black and white photo into the drawer. In the morning, she's sprawled asleep on her bed fully clothed as Charlotte in a skull cap and dressing gown barges into her room and begins tossing clothes from the wardrobe. Later, elegantly dressed on the porch, Charlotte tries to eavesdrop on Stuart and Skeeter as she trims her plants. He begins striding away. Skeeter, glancing back towards the house, squints speculatively. She marches past her smiling date. In a diner, shirt sleeves rolled up, he's ordered clams. They toast oyster and cracker. He stretches across and grasps her hand. She answers with a smile. Outside the diner, Stuart seizes her hand. He leans towards her and pecks her on the lips. Mae Mobley is perched on Aibileen's knee with a picture book. Hilly emerges from her house smirking. She shoves aside a press photographer. Toilets are scattered on the yard. She cuddles her Yard of the Month sign and hauls it inside to the amusement of the onlookers. Mae Mobley, with her knickers down, proudly perches on one of the many toilets scattered across the lawn. Elizabeth tugs her off. Tenderly lifting Mae Mobley in her arms, Aibileen sets her down on the lawn surrounded by a dozen toilets. She bends in front of her. Clutching her hands, she gazes deeply into the child's moon face. They embrace each other. Elizabeth, observing coldly from the front door, heads inside. At the Phelan's, Skeeter, Josefo, and Pascagoula are watching civil rights activist Medgar Evers on TV. Charlotte switches off the TV. The servants scurry away. Charlotte seizes Skeeter by the hand. Skeeter pulls away and departs. On a bus heading home, Aibileen is dozing. Henry, sitting nearby, glances up from his book. The bus halts. The driver flicks on the inside lights and addresses the passengers. Aibileen and Henry, who have been sitting at the back of the bus, quickly hop out and stroll off down the dark street. He goes. Seeing Henry vanish around the corner, Aibileen begins to jog. Civil rights activist Roy Wilkins remarks. Aibileen slips and stumbles. Minnie's children exit the kitchen. The three younger ones huddle into one bed. The two friends wrap their arms around each other. With a somber expression, Skeeter flips back to the front cover of the LIFE magazine, which shows the distraught widow comforting her young son. At the foot mansion, Minnie is dusting down a stuffed standing grizzly bear on a corner dice. She glances towards the fad and steps down from the platform. She strolls through the spacious rooms and enters the bedroom, making a beeline for the bathroom door."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "She snuffs out the candle and takes down the leather-bound mirror. Setting her shoes defiantly, she locks the red and blue mirror away in the suitcase. In the afternoon, she's lying asleep on her couch fully clothed as Douglas in a top hat and space suit bursts into her garden and starts pulling scarves from the cabinet. Later, elegantly dressed on the balcony, Douglas tries to eavesdrop on Felix and Marigold as she polishes her windows. They start singing along. Marigold, glancing back towards the barn, frowns thoughtfully. She strides past her grinning guitar. In a cafe, apron sleeves rolled up, they've ordered pancakes. They toast pancake and muffin. He stretches across and takes her book. She responds with a sigh. Outside the cafe, Felix grabs her book. She steps towards him and kisses him on the cheek. Daisy May is sitting on Rosie's shoe with a coloring book. Gerald comes out of his cabin sneezing. He pushes aside a news reporter. Umbrellas are scattered on the roof. He cradles his Clip of the Year trophy and carries it outside to the astonishment of the guests. Daisy May, with her socks off, proudly sits on one of the many umbrellas scattered across the hall. William drags her on. Carefully carrying Daisy May in his arms, Rosie sets her up on the hall surrounded by a dozen umbrellas. She kneels behind her. Taking hold of her glasses, she looks deeply into the child's sun face. They wave at each other. William, watching warmly from the back porch, goes outside. At the Johnson's, Marigold, Roberto, and Claudia are watching civil rights activist Bayard Rustin on radio. Douglas turns on the radio. The gardeners hobble away. Douglas grabs Marigold by the arm. Marigold pushes away and stays. On a train on her way home, Rosie is reading. James, standing nearby, looks up from his notebook. The train moves. The engineer switches off the outside lights and faces the crew. Rosie and James, who have been standing at the front of the train, quietly step in and head off up the bright hill. She stays. Seeing James appear around the corner, Rosie starts to jump. Civil rights activist Ella Baker whispers. Rosie slips and flies. Minnie's siblings leave the garage. The four older ones tumble into one chair. The two enemies put their feet around each other. With a cheerful expression, Marigold flips back to the back cover of the TIME magazine, which shows the joyful baby comforting her old dog. At the valley cottage, Minnie is ironing up a dusty hanging polar bear on a ceiling piano. She looks towards the toy and steps up from the tunnel. She marches through the cramped spaces and comes into the dining room, making a beeline for the closet window."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "She flicks off the flashlight and lifts up the guilt frame photo. Tilting her chin daringly, she tucks the black and white photo away in the drawer. In the morning, she's lounging awake on her bed fully clothed as Marvin in a baseball cap and bathrobe barges into her room and begins tossing books from the bookshelf. Later, casually dressed on the porch, Marvin tries to eavesdrop on Daniel and Fidget as he trims his plants. She starts sprinting away. Fidget, glancing back towards the house, smiles mischievously. He marches past his grinning companion. In a diner, jacket sleeves rolled up, she's ordered pancakes. They clink pancake and syrup. She leans over and takes his jacket. He responds with a nod. Outside the diner, Daniel squeezes his elbow. She lunges towards him and hugs him on the shoulder. Jamie is standing on Bert's knee with a coloring book. Nancy comes out of her house giggling. She nudges away a delivery driver. Shoes are scattered on the driveway. She hugs her Welcome Home mat and places it inside to the disbelief of the neighbors. Jamie, with her shoes off, proudly stands on one of the many shoes scattered across the driveway. Natasha pulls her away. Gently carrying Jamie in her arms, Bert sets her down on the driveway surrounded by a dozen shoes. She crouches in front of her. Placing a hat on her head, she stares joyfully into the child's puzzled face. They laugh together. Natasha, watching silently from the front porch, steps inside. At the Phelan's, Fidget, Oscar, and Maria are watching comedian Lenny Bruce on TV. Marvin turns up the volume. The family gathers around. Marvin nudges Fidget on the shoulder. Fidget steps back and leaves. On a bus on her way home, Bert is reading. Roger, sitting nearby, glances up from his nap. The bus halts. The driver turns off the headlights and addresses the passengers. Bert and Roger, who have been sitting at the middle of the bus, leisurely get up and stroll off down the dark street. She leaves. Seeing Roger vanish around the corner, Bert begins to walk briskly. Comedian Dick Gregory jokes. Bert stumbles and catches herself. Minnie's friends enter the living room. The three older ones jump onto one couch. The two siblings wrap their arms around each other. With a curious expression, Fidget flips back to the last page of the TIME magazine, which shows the joyful bride celebrating with her young daughter. At the hill mansion, Minnie is dusting down a stuffed lounging panda bear on a center table. She glances towards the artwork and steps up onto the platform. She strides through the narrow hallway and enters the closet, making a zigzag for the kitchen door."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "She stamps out the candle and takes down the velvet cover sketch. Setting her chin defiantly, she tucks the sepia-toned sketch into the cupboard. In the morning, she's lying asleep on her couch fully clothed as Charlotte in a rain hat and bathrobe bursts into her room and starts tossing shoes from the closet. Later, gracefully dressed on the deck, Charlotte tries to overhear Stuart and Skeeter as she trims her hedges. He begins strolling away. Skeeter, glancing back towards the home, frowns thoughtfully. She marches past her jovial companion. In a café, braces rolled up, he's ordered mussels. They toast mussel and biscuit. He stretches across and tickles her palm. She answers with a grin. Outside the café, Stuart shakes her wrist. He steps closer to her and nods at her forehead. Mae Mobley is sitting on Aibileen's knee with a comic book. Hilly comes out of her house sneering. She pushes aside a news reporter. Bathtubs are scattered on the lawn. She clutches her Garden of the Year sign and carries it inside to the amusement of the spectators. Mae Mobley, with her hat askew, proudly sits on one of the many bathtubs spread across the grass. Elizabeth pulls her off. Tenderly carrying Mae Mobley in her arms, Aibileen sets her down on the grass surrounded by a dozen bathtubs. She crouches in front of her. Taking hold of her hands, she looks deeply into the child's cherubic face. They embrace each other. Elizabeth, watching stoically from the entryway, goes inside. At the Phelan's, Skeeter, Josefo, and Pascagoula are watching labor leader Cesar Chavez on TV. Charlotte turns off the TV. The staff shuffle away. Charlotte seizes Skeeter by the sleeve. Skeeter pulls away and departs. On a train on her way home, Aibileen is dozing. Henry, sitting nearby, glances up from his journal. The train stops. The conductor switches on the overhead lights and addresses the passengers. Aibileen and Henry, who have been sitting at the rear of the train, hurriedly disembark and wander off down the dim street. He departs. Seeing Henry disappear around the corner, Aibileen starts to sprint. Labor leader Philip Randolph comments. Aibileen stumbles and tumbles. Minnie's children leave the living room. The three younger ones leap into one bed. The two companions put their arms around each other. With a somber expression, Skeeter flips back to the front page of the TIMES magazine, which shows the grieving widow consoling her young daughter. At the manor house, Minnie is dusting down a stuffed standing polar bear on a corner table. She glances towards the commotion and steps down from the ledge. She saunters through the spacious corridors and enters the bedroom, making a beeline for the wardrobe door."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "She extinguishes the torch and picks up the guilt-ridden mirror painting. Setting her chin confidently, she hides the colorful painting inside the backpack. In the afternoon, she's snoozing on her carpet fully shod as Beatrice in a pirate hat and leather jacket storms into her cave and starts flinging books from the shelf. Eventually, casually clad on the balcony, Beatrice attempts to spy on Roger and Scooter as she mows her lawn. He begins skipping away. Scooter, peering back towards the barn, scowls thoughtfully. She dances past her grinning rival. In a bistro, jacket untucked, he's eaten clams. They clang bell and drumstick. He leans over and grabs her paw. She counters with a wink. Outside the bistro, Roger seizes her elbow. He leans away from her and pecks her on the nose. Baby Sue is perched on Zelda's shoulder with a coloring book. Billy emerges from his cabin grimacing. He shoves aside a police officer. Buckets are strewn on the grass. He embraces his Trophy of the Year plaque and transports it indoors to the delight of the onlookers. Baby Sue, with her fashion down, gleefully perches on one of the many buckets scattered across the meadow. Veronica yanks her off. Lovingly carrying Baby Sue in her grip, Zelda sets her down on the grass encircled by a dozen buckets. She squats before her. Gripping her paws, she gazes deeply into the child's solar face. They clutch each other. Veronica, observing distantly from the attic, retreats inside. At the Daffodil's, Scooter, Juan, and Rosetta are observing jazz performer Sammy Davis Jr. on radio. Beatrice powers down the radio. The dancers scurry away. Beatrice seizes Scooter by the elbow. Scooter jerks away and departs. On a train on her path back, Zelda is dreaming. Lester, situated nearby, looks up from his script. The train halts. The engineer switches on the interior candles and faces the travelers. Zelda and Lester, who have been reclining at the front of the train, hastily alight and trot down the dim avenue. He vanishes. Watching Lester vanish around the junction, Zelda starts to gallop. Activist Malcolm X speaks. Zelda stumbles and crumbles. Minnie's siblings exit the parlor. The trio of older ones huddle into one crate. The pair of colleagues wrap their limbs around each other. With a pensive look, Scooter flips forward to the back cover of the TIME anthology, which depicts the distraught spouse cradling her young sibling. At the base villa, Minnie is dusting up a plush standing polar bear on a corner dice. She eyes the breeze and steps up onto the podium. She wanders through the cramped hallways and enters the closet, making a zigzag for the closet shelf."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "She extinguishes the cigarette and hides the photo with determination. In the morning, fully dressed, she’s interrupted by Charlotte, who bursts in and rummages through the wardrobe. Later, Charlotte overhears Stuart and Skeeter during her porch gardening. At a diner, Stuart and Skeeter share a moment, holding hands and exchanging a kiss. Mae Mobley sits with Aibileen, while Hilly reacts to toilets scattered in her yard, amusing onlookers. Elizabeth coldly watches Aibileen tenderly care for Mae Mobley among the toilets. Meanwhile, Skeeter, Josefo, and Pascagoula watch Medgar Evers on TV before Charlotte turns it off. Skeeter pulls away and leaves. Aibileen naps on a bus ride home, gets off with Henry, and runs after he leaves. Roy Wilkins comments as Aibileen trips and falls. Minnie’s children settle into bed, and Minnie herself finishes cleaning, moving through the mansion towards the bathroom."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "She strolls through the spacious rooms and comes into the bedroom making a beeline for the bathroom door She looks towards the fad and steps down from the platform  At the foot mansion Minnie is hoovering down a stuffed standing grizzly bear on a corner dice  Skeeter flips back to the front cover of the LIFE magazine which shows the distraught widow comforting her young son  With a somber expression  The two friends put their arms around each other  The three younger ones pile into one bed  Minnie's children leave the kitchen  Aibileen trips and falls  Civil rights activist Roy Wilkins comments  Aibileen starts to run  Seeing Henry disappear around the corner  He goes  Aibileen and Henry who have been sitting at the back of the bus hurriedly get out and walk off down the dark street  The driver switches on the inside lights and faces the passengers  The bus stops  Henry sitting nearby looks up from his book  Aibileen is napping  On a bus on her way home  Skeeter pulls away and goes  Charlotte grabs Skeeter by the hand  The servants scoot away  Charlotte turns off the TV  civil rights activist Medgar Evers on TV  Josefo and Pascagoula are watching  At the Phelan's Skeeter  Elizabeth watching coldly from the front door goes inside  They hug each other  Taking hold of her hands she looks deeply into the child's moon face  She kneels in front of her  Aibileen sets her down on the lawn surrounded by a dozen toilets  Tenderly carrying Mae Mobley in her arms  Elizabeth drags her off  Mae Mobley with her knickers down proudly sits on one of the many toilets scattered across the lawn  She cradles her Yard of the Month sign and carries it inside to the amusement of the onlookers  Toilets are scattered on the yard  She pushes aside a press photographer  Hilly comes out of her house grimacing  Mae Mobley is sitting on Aibileen's knee with a picture book  He steps towards her and kisses her on the lips  Outside the diner Stuart grabs her hand  She responds with a smile  He reaches across and takes her hand  They clink oyster and cracker  In a diner shirt sleeves rolled up he's ordered oysters  She strides past her smiling date  Skeeter glancing back towards the house frowns speculatively  He starts walking away  Later elegantly dressed on the porch Charlotte tries to eavesdrop on Stuart and Skeeter as she waters her plants  In the morning she's lying asleep on her bed fully clothed as Charlotte in a skull cap and dressing gown bursts into her room and starts pulling clothes from the wardrobe  Setting her chin defiantly she shuts the black and white photo away in the drawer  She stubs out the cigarette and takes down the guilt frame photo "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Aibileen starts to run  Elizabeth watching coldly from the front door goes inside  Mae Mobley is sitting on Aibileen's knee with a picture book  He reaches across and takes her hand  Elizabeth drags her off  With a somber expression  Setting her chin defiantly she shuts the black and white photo away in the drawer  She stubs out the cigarette and takes down the guilt frame photo  She pushes aside a press photographer  Later elegantly dressed on the porch Charlotte tries to eavesdrop on Stuart and Skeeter as she waters her plants  She kneels in front of her  She responds with a smile  The three younger ones pile into one bed  On a bus on her way home  Toilets are scattered on the yard  The driver switches on the inside lights and faces the passengers  She looks towards the fad and steps down from the platform  Skeeter pulls away and goes  Josefo and Pascagoula are watching  Minnie's children leave the kitchen  The servants scoot away  Aibileen trips and falls  They clink oyster and cracker  Aibileen sets her down on the lawn surrounded by a dozen toilets  She strolls through the spacious rooms and comes into the bedroom making a beeline for the bathroom door Charlotte grabs Skeeter by the hand  civil rights activist Medgar Evers on TV  Civil rights activist Roy Wilkins comments  Outside the diner Stuart grabs her hand  At the Phelan's Skeeter  Tenderly carrying Mae Mobley in her arms  Charlotte turns off the TV  She cradles her Yard of the Month sign and carries it inside to the amusement of the onlookers  At the foot mansion Minnie is hoovering down a stuffed standing grizzly bear on a corner dice  She strides past her smiling date  Aibileen and Henry who have been sitting at the back of the bus hurriedly get out and walk off down the dark street  Skeeter flips back to the front cover of the LIFE magazine which shows the distraught widow comforting her young son  The two friends put their arms around each other  Hilly comes out of her house grimacing  In the morning she's lying asleep on her bed fully clothed as Charlotte in a skull cap and dressing gown bursts into her room and starts pulling clothes from the wardrobe  He starts walking away  He steps towards her and kisses her on the lips  The bus stops  Taking hold of her hands she looks deeply into the child's moon face  He goes  Seeing Henry disappear around the corner  Mae Mobley with her knickers down proudly sits on one of the many toilets scattered across the lawn  Henry sitting nearby looks up from his book  Skeeter glancing back towards the house frowns speculatively  They hug each other  In a diner shirt sleeves rolled up he's ordered oysters  Aibileen is napping "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "At the Phelan's Skeeter  Josefo and Pascagoula are watching  civil rights activist Medgar Evers on TV  Charlotte turns off the TV  The servants scoot away  Charlotte grabs Skeeter by the hand  Skeeter pulls away and goes  On a bus on her way home  Aibileen is napping  Henry sitting nearby looks up from his book  The bus stops  The driver switches on the inside lights and faces the passengers  Aibileen and Henry who have been sitting at the back of the bus hurriedly get out and walk off down the dark street  He goes  Seeing Henry disappear around the corner  Aibileen starts to run  Civil rights activist Roy Wilkins comments  Aibileen trips and falls  Minnie's children leave the kitchen  The three younger ones pile into one bed  The two friends put their arms around each other  With a somber expression  Skeeter flips back to the front cover of the LIFE magazine which shows the distraught widow comforting her young son  At the foot mansion Minnie is hoovering down a stuffed standing grizzly bear on a corner dice  She looks towards the fad and steps down from the platform  She strolls through the spacious rooms and comes into the bedroom making a beeline for the bathroom door She stubs out the cigarette and takes down the guilt frame photo  Setting her chin defiantly she shuts the black and white photo away in the drawer  In the morning she's lying asleep on her bed fully clothed as Charlotte in a skull cap and dressing gown bursts into her room and starts pulling clothes from the wardrobe  Later elegantly dressed on the porch Charlotte tries to eavesdrop on Stuart and Skeeter as she waters her plants  He starts walking away  Skeeter glancing back towards the house frowns speculatively  She strides past her smiling date  In a diner shirt sleeves rolled up he's ordered oysters  They clink oyster and cracker  He reaches across and takes her hand  She responds with a smile  Outside the diner Stuart grabs her hand  He steps towards her and kisses her on the lips  Mae Mobley is sitting on Aibileen's knee with a picture book  Hilly comes out of her house grimacing  She pushes aside a press photographer  Toilets are scattered on the yard  She cradles her Yard of the Month sign and carries it inside to the amusement of the onlookers  Mae Mobley with her knickers down proudly sits on one of the many toilets scattered across the lawn  Elizabeth drags her off  Tenderly carrying Mae Mobley in her arms  Aibileen sets her down on the lawn surrounded by a dozen toilets  She kneels in front of her  Taking hold of her hands she looks deeply into the child's moon face  They hug each other  Elizabeth watching coldly from the front door goes inside "
        }
      ]
    }
  ]
}