{
  "ground_truth": "Inside, there's a photo of a couple kissing. Every week contains weddings. He closes the book and stares ahead. At her apartment, Jane is wrestling the evening's dresses into a closet filled to bursting with a colorful riot of party gowns. She squeezes in every last bit of rebellious fabric and pushes backward against the doors, forcing them closed. The doors spring back open. She grabs the papers and settles on the couch. Its glow makes a dark silhouette of the towering city skyline and sunbathes the buildings lining Central Park as rush hour begins. Kevin, carrying coffees, arrives at the offices of the New York Journal. Crossing a street, Jane meets Casey getting out of a cab. Casey proudly sports a man's white shirt. They walk into their office reception. Jane grins and heads for her cluttered desk. He shows her the filofax. She glares at him. Jane is with Casey looking at photo layouts. As Gina walks off, Jane looks exasperated. Casey pulls a face. Jane looks pained as ruggedly handsome George walks off. Casey stalks off, leaving Jane sorting out some unruly adhesive notes. Casey flashes Gina a false smile. Casey flounces off. A jumbo jet touches down, and in the airport, Jane smiles as cute blonde Tess arrives. The sisters arrive at Jane's apartment. Jane struggles with the luggage. At night, in one of thousands of taxis, Kevin reads Jane's filofax. Jane and Casey are at Gina's party in a busy, low-lit club. George saunters suavely over to them. Jane walks breathlessly over to where George is drinking beer and chatting with friends. Tess, in a shimmery dress, approaches from the other direction. George spots her and grins, then clocks Jane. As Jane approaches, her face falls, realizing that George and Tess are making a beeline for each other. They smile as Jane frowns. Jane fakes a smile as George catches her eye. As Tess and George leave, Kevin walks up. She looks stunned. She hands him her drink, then turns and walks out of the club through a side door. Kevin looks puzzled as she bashes a wall with her handbag. She's in full view of a sedate dinner party. Trying to regain her composure, she rejoins Kevin in the club, who's waiting, eyebrows raised. She stares after Tess and George. Later, a car drives past Jane's building. She rushes to the front door, peers through the peephole, then flings it open. She stomps back inside. Jane switches on the light in the living room, it's empty and she wanders anxiously up and down, then picks up a magazine from the couch, sits in a chair, thumbs through it distractedly. She glances towards the front door.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Inside, there's a picture of a pair kissing. Each week includes nuptials. He shuts the volume and gazes ahead. At her flat, Jane is grappling the evening's outfits into a wardrobe filled to bursting with an eye-catching chaos of festivity dresses. She compresses in every final piece of defiant textile and pushes backward against the doors, forcing them closed. The doors bounce back open. She seizes the documents and settles on the sofa. Its luminance creates a dark outline of the towering city skyline and bathes the buildings lining Central Park as rush hour commences. Kevin, bearing coffees, arrives at the offices of the New York Journal. Crossing a street, Jane encounters Casey exiting a taxi. Casey proudly wears a man's white shirt. They walk into their office reception. Jane beams and heads for her cluttered desk. He displays the filofax. She glares at him. Jane is with Casey viewing photograph layouts. As Gina walks off, Jane looks frustrated. Casey pulls a face. Jane looks pained as ruggedly attractive George walks off. Casey strides off, leaving Jane sorting out some unruly adhesive notes. Casey flashes Gina an insincere smile. Casey flounces off. A jumbo jet lands, and in the airport, Jane smiles as cute blonde Tess arrives. The sisters reach Jane's apartment. Jane struggles with the baggage. At night, in one of thousands of cabs, Kevin peruses Jane's filofax. Jane and Casey are at Gina's gathering in a busy, dimly-lit club. George strides suavely over to them. Jane walks breathlessly over to where George is drinking beer and chatting with companions. Tess, in a glittery dress, approaches from the opposite direction. George spots her and grins, then notices Jane. As Jane approaches, her face falls, realizing that George and Tess are making a direct line for each other. They smile as Jane frowns. Jane feigns a smile as George catches her gaze. As Tess and George depart, Kevin arrives. She seems stunned. She hands him her beverage, then turns and exits the club through a side entrance. Kevin looks perplexed as she strikes a wall with her handbag. She's in full view of a calm dinner gathering. Attempting to regain her poise, she rejoins Kevin in the club, who's waiting, eyebrows raised. She stares after Tess and George. Later, an automobile drives past Jane's building. She rushes to the front entrance, peers through the peephole, then flings it open. She stomps back inside. Jane switches on the light in the living room, it's vacant and she wanders anxiously up and down, then picks up a periodical from the couch, sits in a chair, thumbs through it distractedly. She glances towards the front entrance."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Inside, a photo of a couple kissing is visible. Weddings are contained every week. The book is closed by him, and he stares ahead. At her apartment, the evening's dresses are being wrestled by Jane into a closet filled to bursting with a colorful riot of party gowns. Every last bit of rebellious fabric is squeezed in by her, and the doors are pushed backward, forcing them closed. The doors spring back open. The papers are grabbed by her, and she settles on the couch. A dark silhouette is made by its glow of the towering city skyline, and the buildings lining Central Park are sunbathed as rush hour begins. Arriving at the offices of the New York Journal, Kevin carries coffees. Crossing a street, Casey is met by Jane getting out of a cab. A man's white shirt is proudly sported by Casey. They walk into their office reception. Her grin is directed at him as she heads for her cluttered desk. The filofax is shown to her by him. He is glared at by her. Casey is with Jane looking at photo layouts. As Gina walks off, exasperation is shown by Jane. A face is pulled by Casey. A pained look is given by Jane as ruggedly handsome George walks off. Jane is left sorting out some unruly adhesive notes as Casey stalks off. Gina is flashed a false smile by Casey. Casey flounces off. A jumbo jet is touched down, and in the airport, cute blonde Tess is smiled at by Jane as she arrives. Jane's apartment is reached by the sisters. The luggage is struggled with by Jane. At night, in one of thousands of taxis, Jane's filofax is read by Kevin. At Gina's party in a busy, low-lit club, Casey and Jane are present. George suavely saunters over to them. Jane, walking breathlessly, moves to where George is drinking beer and chatting with friends. Tess, in a shimmery dress, approaches from the other direction. Tess is spotted by George, who grins, then Jane is clocked. As Jane approaches, her face falls, realizing that George and Tess are making a beeline for each other. Smiles are exchanged as Jane frowns. Kevin is caught by George as Jane fakes a smile. Tess and George leave, then Kevin walks up. He stuns her. Her drink is handed to him, then the club is left by her through a side door. Kevin looks puzzled as a wall is bashed by her with her handbag. A sedate dinner party views her. Trying to regain her composure, she rejoins Kevin in the club, who waits with raised eyebrows. Her stare follows Tess and George. Later, Jane's building is passed by a car. The front door is rushed to by her, the peephole is peered through, then it is flung open. She stomps back inside. The light in the living room is switched on by Jane, it's empty, and she anxiously wanders up and down, then a magazine from the couch is picked up, she sits in a chair, thumbing through it distractedly. Her glance is directed towards the front door."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Inside, there's a photo of a couple kissing. Weddings occur weekly. He closes the book and stares ahead. At her apartment, Jane struggles to fit evening dresses into an overflowing closet. She forces the doors closed, but they spring back open. She grabs papers and settles on the couch, silhouetted by the city skyline as rush hour begins. Kevin, with coffees, arrives at the New York Journal. Jane meets Casey, wearing a man's white shirt, as she exits a cab. They enter their office, and Jane heads to her cluttered desk. He shows her the filofax, and she glares. Jane and Casey review photo layouts. As Gina leaves, Jane looks exasperated, and Casey pulls a face. Jane looks pained as George walks off, and Casey leaves Jane sorting adhesive notes. Casey flashes Gina a false smile and flounces off. A jumbo jet lands, and Jane smiles as Tess arrives at the airport. The sisters reach Jane's apartment, and Jane struggles with luggage. At night, Kevin reads Jane's filofax in a taxi. Jane and Casey attend Gina's party at a busy club. George approaches them suavely. Jane walks to George, who's drinking with friends, as Tess approaches. George grins at Tess, then notices Jane. Jane's face falls as George and Tess head toward each other, smiling. Jane fakes a smile at George. As Tess and George leave, Kevin arrives. Jane looks stunned, hands him her drink, and exits through a side door. Kevin is puzzled as she hits a wall with her handbag, visible to a dinner party. Regaining composure, she rejoins Kevin, who waits with raised eyebrows. She stares after Tess and George. Later, a car passes Jane's building. She rushes to the door, peers through the peephole, then opens it and stomps back inside. Jane turns on the living room light, finds it empty, paces anxiously, then sits with a magazine, thumbing through it distractedly. She glances at the front door."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Inside, a photo shows a couple kissing. Weddings occur weekly. He closes the book, staring ahead. At her apartment, Jane struggles to fit dresses into an overflowing closet. She forces the doors closed, but they spring open. She grabs papers and sits on the couch, silhouetted by the city skyline as rush hour begins. Kevin, with coffees, arrives at the New York Journal. Jane meets Casey, wearing a man's white shirt, outside. They enter the office, and Jane heads to her cluttered desk. He shows her the filofax; she glares. Jane and Casey review photo layouts. Gina leaves, and Jane looks exasperated. Casey makes a face. Jane looks pained as George walks off. Casey leaves, and Jane sorts adhesive notes. Casey gives Gina a false smile and leaves. A jet lands, and Jane smiles as Tess arrives at the airport. The sisters go to Jane's apartment, where Jane struggles with luggage. At night, Kevin reads Jane's filofax in a taxi. At Gina's party, George approaches Jane and Casey. Jane approaches George, but Tess arrives, and George grins at her. Jane fakes a smile as George and Tess leave. Kevin arrives, and Jane looks stunned, hands him her drink, and exits through a side door. Kevin is puzzled as she hits a wall with her handbag, visible to a dinner party. She regains composure and rejoins Kevin, who waits with raised eyebrows. She watches Tess and George. Later, a car passes Jane's building. She rushes to the door, peers out, then stomps back inside. Jane turns on the living room light, finds it empty, paces, then sits with a magazine, glancing at the door."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Inside the book, there is a photograph capturing a couple in the midst of a tender kiss. Each week is filled with the joyous celebrations of weddings. He gently closes the book and gazes thoughtfully ahead. Meanwhile, at her apartment, Jane is engaged in the challenging task of wrestling the evening's dresses into a closet that is already filled to the brim with a vibrant and colorful array of party gowns. She diligently squeezes in every last piece of rebellious fabric and pushes backward against the stubborn doors, attempting to force them closed. However, the doors defiantly spring back open. She then grabs the scattered papers and settles herself on the couch. The glow from the city outside creates a dark silhouette of the towering skyline and bathes the buildings lining Central Park in sunlight as the rush hour commences. Kevin, carrying a tray of coffees, arrives at the bustling offices of the New York Journal. As she crosses a street, Jane encounters Casey, who is just getting out of a cab. Casey is proudly sporting a man's white shirt. Together, they walk into their office reception area. Jane grins broadly and makes her way to her cluttered desk. He shows her the filofax, and she glares at him with irritation. Jane is with Casey, examining photo layouts. As Gina walks away, Jane looks exasperated, and Casey pulls a comical face. Jane appears pained as the ruggedly handsome George walks off. Casey then stalks off, leaving Jane to sort out some unruly adhesive notes. Casey flashes Gina a false smile before flouncing off. A jumbo jet touches down, and at the airport, Jane smiles warmly as her cute blonde sister Tess arrives. The sisters make their way to Jane's apartment, where Jane struggles with the cumbersome luggage. Later that night, in one of the thousands of taxis crisscrossing the city, Kevin reads through Jane's filofax. Jane and Casey are at Gina's lively party in a busy, dimly lit club. George saunters over to them with a suave demeanor. Jane walks breathlessly over to where George is drinking beer and chatting with friends. Tess, wearing a shimmery dress, approaches from the opposite direction. George spots her and grins, then notices Jane. As Jane approaches, her face falls, realizing that George and Tess are making a beeline for each other. They smile at each other as Jane frowns. Jane forces a smile as George catches her eye. As Tess and George leave together, Kevin walks up to Jane. She looks stunned and hands him her drink, then turns and walks out of the club through a side door. Kevin looks puzzled as she vents her frustration by bashing a wall with her handbag. She finds herself in full view of a sedate dinner party. Trying to regain her composure, she rejoins Kevin in the club, where he is waiting with eyebrows raised in curiosity. She stares after Tess and George. Later, a car drives past Jane's building. She rushes to the front door, peers through the peephole, then flings it open in frustration. She stomps back inside, switches on the light in the living room, which is empty, and anxiously wanders up and down. She then picks up a magazine from the couch, sits in a chair, and thumbs through it distractedly. She glances towards the front door, lost in thought."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Within the pages of the book, a captivating photograph captures the romantic image of a couple deeply immersed in the moment of a tender kiss. Each and every week becomes a delightful tapestry woven with the joyous and heartwarming celebrations of numerous weddings. As he closes the book gently, his thoughts appear to wander far beyond as he gazes thoughtfully into the distance. Meanwhile, over at her cozy apartment, Jane is immersed in the somewhat arduous task of wrestling with the evening's dresses. Her closet is already bursting with a vibrant, colorful array of her beloved party gowns. She diligently tries to squeeze in every last piece of rebellious fabric, pushing back against the stubborn closet doors in a bid to force them closed. Yet, the doors defiantly spring back open, refusing to cooperate. Undeterred, Jane quickly gathers the scattered papers strewn about and settles herself comfortably on the couch. Meanwhile, the glow emanating from the bustling city outside paints a dark silhouette against the towering skyline, bathing the majestic buildings lining Central Park in a warm ribbon of sunlight as the rush hour unfolds. Elsewhere, Kevin can be seen skillfully balancing a tray of steaming coffees as he arrives at the lively, bustling offices of the New York Journal. While crossing a busy street, Jane encounters Casey, who is just in the process of stepping out of a gleaming cab, proudly sporting a man's crisp white shirt. Together, they make their way into the office's welcoming reception area. Jane flashes a wide grin as she proceeds to her delightfully cluttered desk. He shows her the filofax, and she responds by glaring at him with evident irritation. As Jane teams up with Casey, they become engrossed in examining various photo layouts. When Gina walks away, Jane appears exasperated, and Casey pulls a comical face. Jane’s expression turns pained as the ruggedly handsome George saunters off, and Casey then dramatically stalks away, leaving Jane alone to organize some unruly adhesive notes. Casey offers Gina a falsely cheerful smile before flouncing off dramatically. At the airport, a jumbo jet touches down, and Jane warmly greets her adorable blonde sister, Tess, with a bright smile. Together, the sisters make their way back to Jane's apartment, where Jane faces the challenge of managing the cumbersome luggage. As the night unfolds, within one of the countless taxis crisscrossing the vibrant city, Kevin takes the opportunity to read through Jane's filofax. In a lively party hosted by Gina at a busy, dimly lit club, Jane finds herself alongside Casey. George, with his suave demeanor, casually saunters over to them. Jane, nearly breathless, makes her way to where George is enjoying a beer and engaging in lively conversation with friends. Tess, dressed in a shimmering gown, confidently approaches from the opposite direction. George's face lights up with a grin as he sees Tess and then notices Jane as well. As Jane approaches, her expression shifts with a fallen face, realizing that George and Tess are confidently making a beeline for one another. They exchange smiles while Jane frowns. Forcing a smile, Jane catches George's eye just as Tess and George head off together. Kevin approaches Jane, who looks visibly stunned; she hands him her drink and then turns, making her exit from the club through a discreet side door. Kevin stands there, puzzled, as she vents her frustration by hitting a wall with her handbag. Suddenly, she finds herself in the full view of a sedate dinner party. Attempting to regain her composure, she returns to Kevin in the club, where he waits with raised eyebrows, filled with curiosity. She turns her gaze after Tess and George. Later on, a car drives past the building where Jane resides. With urgency in her step, she rushes to the front door, peers through the peephole with anticipation, then, in frustration, flings it open. She stomps back inside, flicks on the living room light to reveal an empty space, and anxiously paces up and down the room. Finally, she picks up a magazine from the couch, sits down in the chair, and thumbs through it distractedly, glancing occasionally towards the front door, lost in her wandering thoughts."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Inside the room, a photo captures a couple in the midst of a tender kiss, setting a romantic tone. Each week is marked by the celebration of weddings, a recurring theme in the narrative. He gently closes the book, allowing the cover to meet the pages with a soft thud, and fixes his gaze straight ahead, lost in thought. Meanwhile, at her apartment, Jane is engaged in a battle with the evening's dresses, attempting to fit them into a closet already brimming with a vibrant array of party gowns. She meticulously squeezes each rebellious piece of fabric into the limited space, using her body weight to push against the doors, trying to secure them shut. Despite her efforts, the doors defiantly spring back open. Undeterred, she gathers the scattered papers and settles onto the couch, where the glow from the city outside casts a dark silhouette of the towering skyline. The sun bathes the buildings lining Central Park as the rush hour commences, painting a picture of urban life. Kevin, balancing cups of coffee, makes his way to the offices of the New York Journal. As Jane crosses a street, she encounters Casey, who is just stepping out of a cab, proudly wearing a man's white shirt. Together, they walk into their office reception, where Jane flashes a grin and heads towards her cluttered desk. He presents her with a filofax, prompting her to glare at him in response. Jane and Casey are soon absorbed in examining photo layouts, and as Gina walks away, Jane's expression turns to one of exasperation. Casey reacts by pulling a face, and Jane's demeanor shifts to one of pain as the ruggedly handsome George departs. Casey then stalks off, leaving Jane to sort through a chaotic pile of adhesive notes. Casey offers Gina a false smile before flouncing away. Meanwhile, a jumbo jet touches down at the airport, where Jane's face lights up with a smile as her cute blonde sister, Tess, arrives. The sisters make their way to Jane's apartment, where Jane struggles with the cumbersome luggage. Later that night, Kevin, seated in one of the countless taxis, peruses Jane's filofax. At Gina's party, held in a bustling, dimly lit club, Jane and Casey are present when George suavely approaches them. Jane, breathless, makes her way over to where George is enjoying a beer and chatting with friends. Tess, adorned in a shimmery dress, approaches from the opposite direction. George notices her, grins, and then acknowledges Jane. As Jane draws nearer, her expression falls as she realizes that George and Tess are heading towards each other. They exchange smiles while Jane frowns, masking her disappointment with a forced smile as George catches her eye. As Tess and George depart, Kevin arrives, leaving Jane looking stunned. She hands him her drink, turns, and exits the club through a side door. Kevin, puzzled, watches as she vents her frustration by striking a wall with her handbag, inadvertently putting herself in full view of a sedate dinner party. Attempting to regain her composure, she returns to the club where Kevin awaits, his eyebrows raised in curiosity. She stares after Tess and George, her mind preoccupied. Later, a car drives past Jane's building, prompting her to rush to the front door, peer through the peephole, and then fling it open, only to stomp back inside. Jane switches on the living room light, revealing an empty space, and paces anxiously up and down before picking up a magazine from the couch. She sits in a chair, thumbing through the pages distractedly, her thoughts elsewhere, and occasionally glances towards the front door, as if expecting someone."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Inside, a photo of a couple kissing is visible, symbolizing the frequent weddings each week. He closes the book and stares ahead. At her apartment, Jane struggles to fit the evening's dresses into an already packed closet, eventually forcing the doors closed only for them to spring back open. She then grabs some papers and settles on the couch, where the city skyline is silhouetted against the glow of the setting sun as rush hour begins. Meanwhile, Kevin arrives at the New York Journal offices with coffees. Jane meets Casey, who is getting out of a cab and wearing a man's white shirt, and they head into their office reception. Jane grins and moves to her cluttered desk, where he shows her the filofax, prompting a glare from her. Jane and Casey review photo layouts, and as Gina walks off, Jane looks exasperated while Casey makes a face. Jane appears pained as George, ruggedly handsome, walks away, and Casey leaves her to sort out some unruly adhesive notes. Casey gives Gina a false smile before flouncing off. A jumbo jet lands, and at the airport, Jane smiles as her sister Tess arrives. They struggle with luggage upon reaching Jane's apartment. Later, in a taxi, Kevin reads Jane's filofax. At Gina's party in a busy club, George approaches Jane and Casey. Jane moves toward George, who is chatting with friends, while Tess, in a shimmery dress, approaches from another direction. George grins at Tess and then notices Jane. As Jane realizes George and Tess are heading toward each other, she fakes a smile when George catches her eye. After Tess and George leave, Kevin approaches Jane, who looks stunned, hands him her drink, and exits the club through a side door. Kevin is puzzled as she vents her frustration by hitting a wall with her handbag, inadvertently in view of a sedate dinner party. Regaining her composure, she returns to Kevin in the club, who is waiting with raised eyebrows, and she watches Tess and George leave. Later, a car passes Jane's building, prompting her to rush to the door, peer through the peephole, and then fling it open before stomping back inside. She turns on the living room light, finds it empty, and anxiously paces before sitting with a magazine, thumbing through it distractedly while glancing toward the front door."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Inside the small living room adorned with vintage decor, there's a photo of a couple kissing, capturing a moment from the couple’s travels in Paris, the City of Light. Every week contains weddings in the glossy pages of the bridal magazine she leafs through. He closes the book filled with colorful photo spreads and stares ahead, lost in thought. At her Upper East Side apartment, Jane is wrestling the evening's dresses into a closet filled to bursting with a colorful riot of party gowns, remnants of her time as a socialite flitting from gala to gala. She squeezes in every last bit of rebellious fabric and pushes backward against the doors, forcing them closed. The doors spring back open, a testament to their overuse. She grabs the papers and settles on the couch bathed in the soft afternoon light. Its glow makes a dark silhouette of the towering city skyline and sunbathes the buildings lining Central Park, a 843-acre green oasis in the heart of Manhattan, as rush hour begins. Kevin, carrying coffees from the local café he frequents every morning, arrives at the offices of the New York Journal, a respected publication known for its incisive commentary on city life. Crossing a bustling street, Jane meets Casey getting out of a classic yellow cab. Casey proudly sports a man's white shirt she had borrowed from her boyfriend, a fact she relished sharing. They walk into their office reception, buzzing with the usual Monday morning energy. Jane grins and heads for her cluttered desk, piled high with drafts and editorial notes. He shows her the filofax, an outdated but reliable organizer she swears by. She glares at him, annoyed. Jane is with Casey looking at photo layouts for a feature in the next issue. As Gina walks off to meet a deadline, Jane looks exasperated, her day not going as planned. Casey pulls a face, mimicking Gina’s serious demeanor. Jane looks pained as ruggedly handsome George, the office heartthrob, walks off after a brief chat. Casey stalks off, leaving Jane sorting out some unruly adhesive notes that flutter to the floor. Casey flashes Gina a false smile, a facade for her frustration. Casey flounces off. A jumbo jet, arriving from London at JFK Airport, touches down, and in the airport arrival hall, Jane smiles as cute blonde Tess, her younger sister, arrives. The sisters arrive at Jane's apartment, a cozy two-bedroom she has meticulously decorated with family mementos. Jane struggles with the luggage, a testament to Tess’s penchant for overpacking. At night, in one of thousands of yellow taxis weaving through the city, Kevin reads Jane's filofax, trying to understand her cryptic organization system. Jane and Casey are at Gina's party in a busy, low-lit club famous for its jazz nights and eclectic decor. George saunters suavely over to them, exuding charm that turns heads. Jane walks breathlessly over to where George is drinking beer, a craft IPA from a local brewery, and chatting with friends. Tess, in a shimmery dress that caught the light like the sequins of a disco ball, approaches from the other direction. George spots her and grins, then clocks Jane, making calculated moves. As Jane approaches, her face falls, realizing that George and Tess are making a beeline for each other, their chemistry undeniable. They smile as Jane frowns, feeling like a third wheel. Jane fakes a smile as George catches her eye, a flicker of understanding passing between them. As Tess and George leave, Kevin walks up, his timing impeccable. She looks stunned, her emotions raw. She hands him her drink, then turns and walks out of the club through a side door leading to a quiet alley. Kevin looks puzzled as she bashes a wall with her handbag, her frustration echoing in the empty space. She's in full view of a sedate dinner party in a neighboring apartment, the contrast stark. Trying to regain her composure, she rejoins Kevin in the club, who's waiting, eyebrows raised in silent inquiry. She stares after Tess and George, a mix of emotions playing on her face. Later, a sleek black car drives past Jane's building, its headlights cutting through the night. She rushes to the front door, peers through the peephole, then flings it open, her heart pounding with anticipation. She stomps back inside, disappointment etched on her face. Jane switches on the light in the living room, it's empty and she wanders anxiously up and down, the quiet enveloping her. Then she picks up a magazine from the couch, sits in a chair, thumbs through it distractedly, the pages rustling softly. She glances towards the front door, hoping for a sign."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Inside there's a photo of a couple kissing  Every week contains weddings  He closes the book and stares ahead  At her apartment Jane is wrestling the evening's dresses into a closet filled to bursting with a colorful riot of party gowns  She squeezes in every last bit of rebellious fabric and pushes backward against the doors forcing them closed  The doors spring back open  She grabs the papers and settles on the couch  Casey stalks off leaving Jane sorting out some unruly adhesive notes  Casey flashes Gina a false smile  Casey flounces off  A jumbo jet touches down and in the airport Jane smiles as cute blonde Tess arrives  The sisters arrive at Jane's apartment  Jane struggles with the luggage  At night in one of thousands of taxis Kevin reads Jane's filofax  Jane and Casey are at Gina's party in a busy lowlit club  George saunters suavely over to them  Jane walks breathlessly over to where George is drinking beer and chatting with friends  Tess in a shimmery dress approaches from the other direction  George spots her and grins then clocks Jane  As Jane approaches her face falls realizing that George and Tess are making a beeline for each other  They smile as Jane frowns  Jane fakes a smile as George catches her eye  As Tess and George leave Kevin walks up  She looks stunned  She hands him her drink then turns and walks out of the club through a side door  Kevin looks puzzled as she bashes a wall with her handbag  She's in full view of a sedate dinner party  Trying to regain her composure she rejoins Kevin in the club who's waiting eyebrows raised  She stares after Tess and George  Later a car drives past Jane's building  She rushes to the front door peers through the peephole then flings it open  She stomps back inside  Its glow makes a dark silhouette of the towering city skyline and sunbathes the buildings lining Central Park  as rush hour begins  Kevin carrying coffees arrives at the offices of the New York Journal  Crossing a street Jane meets Casey getting out of a cab  Casey proudly sports a man's white shirt  They walk into their office reception  Jane grins and heads for her cluttered desk  He shows her the filofax  She glares at him  Jane is with Casey looking at photo layouts  As Gina walks off Jane looks exasperated  Casey pulls a face  Jane looks pained as ruggedly handsome George walks off  Casey stalks off leaving Jane sorting out some unruly adhesive notes  Casey flashes Gina a false smile  Casey flounces off  A jumbo jet touches down and in the airport Jane smiles as cute blonde Tess arrives  The sisters arrive at Jane's apartment  Jane struggles with the luggage  At night in one of thousands of taxis Kevin reads Jane's filofax  Jane and Casey are at Gina's party in a busy lowlit club  George saunters suavely over to them  Jane walks breathlessly over to where George is drinking beer and chatting with friends  Tess in a shimmery dress approaches from the other direction  George spots her and grins then clocks Jane  As Jane approaches her face falls realizing that George and Tess are making a beeline for each other  They smile as Jane frowns  Jane fakes a smile as George catches her eye  As Tess and George leave Kevin walks up  She looks stunned  She hands him her drink then turns and walks out of the club through a side door  Kevin looks puzzled as she bashes a wall with her handbag  She's in full view of a sedate dinner party  Trying to regain her composure she rejoins Kevin in the club who's waiting eyebrows raised  She stares after Tess and George  Later a car drives past Jane's building  She rushes to the front door peers through the peephole then flings it open  She stomps back inside  Jane switches on the light in the living room  it's empty and she wanders anxiously up and down  then picks up a magazine from the couch sits in a chair thumbs through it distractedly  She glances towards the front door"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Inside there is a photo of a couple kissing. Every week contains weddings. He closes the book and stares ahead. At her apartment Jane is wrestling the evening's dresses into a closet filled to bursting with a colorful riot of party gowns. She squeezes in every last bit of rebellious fabric and pushes backward against the doors forcing them closed. The doors spring back open. She grabs the papers and settles on the couch. Its glow makes a dark silhouette of the towering city skyline and sunbathes the buildings lining Central Park. as rush hour begins. Kevin carrying coffees arrives at the offices of the New York Journal. Crossing a street Jane meets Casey getting out of a cab. Casey proudly sports a man's white shirt. They walk into their office reception. Jane grins and heads for her cluttered desk. He shows her the filofax. She glares at him. Jane is with Casey looking at photo layouts. As Gina walks off Jane looks exasperated. Casey pulls a face. Jane looks pained as ruggedly handsome George walks off. Casey stalks off leaving Jane sorting out some unruly adhesive notes. Casey flashes Gina a false smile. Casey flounces off. A jumbo jet touches down and in the airport Jane smiles as cute blonde Tess arrives. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. The sisters arrive at Jane's apartment. Jane struggles with the luggage. At night in one of thousands of taxis Kevin reads Jane's filofax. Jane and Casey are at Gina's party in a busy lowlit club. George saunters suavely over to them. Jane walks breathlessly over to where George is drinking beer and chatting with friends. Tess in a shimmery dress approaches from the other direction. George spots her and grins then clocks Jane. As Jane approaches her face falls realizing that George and Tess are making a beeline for each other. They smile as Jane frowns. Jane fakes a smile as George catches her eye. As Tess and George leave Kevin walks up. She looks stunned. She hands him her drink then turns and walks out of the club through a side door. Kevin looks puzzled as she bashes a wall with her handbag. She is in full view of a sedate dinner party. Trying to regain her composure she rejoins Kevin in the club who is waiting eyebrows raised. She stares after Tess and George. Later a car drives past Jane's building. She rushes to the front door peers through the peephole then flings it open. She stomps back inside. Jane switches on the light in the living room. it is empty and she wanders anxiously up and down. then picks up a magazine from the couch sits in a chair thumbs through it distractedly. She glances towards the front door."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Inside there is a photo of a couple kissing. Every week contains weddings. He closes the book and stares ahead. At her apartment Jane is wrestling the evening's dresses into a closet filled to bursting with a colorful riot of party gowns. She squeezes in every last bit of rebellious fabric and pushes backward against the doors forcing them closed. The doors spring back open. She grabs the papers and settles on the couch. Its glow makes a dark silhouette of the towering city skyline and sunbathes the buildings lining Central Park. as rush hour begins. Kevin carrying coffees arrives at the offices of the New York Journal. Crossing a street Jane meets Casey getting out of a cab. Casey proudly sports a man's white shirt. They walk into their office reception. Jane grins and heads for her cluttered desk. He shows her the filofax. She glares at him. Jane is with Casey looking at photo layouts. As Gina walks off Jane looks exasperated. Casey pulls a face. Jane looks pained as ruggedly handsome George walks off. Casey stalks off leaving Jane sorting out some unruly adhesive notes. Casey flashes Gina a false smile. Casey flounces off. A jumbo jet touches down and in the airport Jane smiles as cute blonde Tess arrives. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. The sisters arrive at Jane's apartment. Jane struggles with the luggage. At night in one of thousands of taxis Kevin reads Jane's filofax. Jane and Casey are at Gina's party in a busy lowlit club. George saunters suavely over to them. Jane walks breathlessly over to where George is drinking beer and chatting with friends. Tess in a shimmery dress approaches from the other direction. George spots her and grins then clocks Jane. As Jane approaches her face falls realizing that George and Tess are making a beeline for each other. They smile as Jane frowns. Jane fakes a smile as George catches her eye. As Tess and George leave Kevin walks up. She looks stunned. She hands him her drink then turns and walks out of the club through a side door. Kevin looks puzzled as she bashes a wall with her handbag. She is in full view of a sedate dinner party. Trying to regain her composure she rejoins Kevin in the club who is waiting eyebrows raised. She stares after Tess and George. Later a car drives past Jane's building. She rushes to the front door peers through the peephole then flings it open. She stomps back inside. Jane switches on the light in the living room. it is empty and she wanders anxiously up and down. then picks up a magazine from the couch sits in a chair thumbs through it distractedly. She glances towards the front door."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Inside there is a photo of a couple kissing. Every week contains weddings. He closes the book and stares ahead. At her apartment Jane is wrestling the evening's dresses into a closet filled to bursting with a colorful riot of party gowns. She squeezes in every last bit of rebellious fabric and pushes backward against the doors forcing them closed. The doors spring back open. She grabs the papers and settles on the couch. Its glow makes a dark silhouette of the towering city skyline and sunbathes the buildings lining Central Park. as rush hour begins. Kevin carrying coffees arrives at the offices of the New York Journal. Crossing a street Jane meets Casey getting out of a cab. Casey proudly sports a man's white shirt. She looks stunned. She hands him her drink then turns and walks out of the club through a side door. Kevin looks puzzled as she bashes a wall with her handbag. She is in full view of a sedate dinner party. Trying to regain her composure she rejoins Kevin in the club who is waiting eyebrows raised. She stares after Tess and George. Later a car drives past Jane's building. She rushes to the front door peers through the peephole then flings it open. She stomps back inside. Jane switches on the light in the living room. it is empty and she wanders anxiously up and down. then picks up a magazine from the couch sits in a chair thumbs through it distractedly. She glances towards the front door."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Inside there is a photo of a couple kissing. Every week contains weddings. He closes the book and stares ahead. At her apartment Jane is wrestling the evening's dresses into a closet filled to bursting with a colorful riot of party gowns. She squeezes in every last bit of rebellious fabric and pushes backward against the doors forcing them closed. She stomps back inside. Jane switches on the light in the living room. it is empty and she wanders anxiously up and down. then picks up a magazine from the couch sits in a chair thumbs through it distractedly. She glances towards the front door."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Inside, there's a photo of a robot kissing. Every week contains weddings. The dog closes the book and stares ahead. At her apartment, the squirrel is wrestling the evening's dresses into a closet filled to bursting with a colorful riot of party gowns. The squirrel squeezes in every last bit of rebellious fabric and pushes backward against the doors, forcing them closed. The doors spring back open. The squirrel grabs the papers and settles on the couch. Its glow makes a dark silhouette of the towering city skyline and sunbathes the buildings lining Central Park as rush hour begins. The turtle, carrying coffees, arrives at the offices of the New York Journal. Crossing a street, the squirrel meets the rabbit getting out of a cab. The rabbit proudly sports a man's white shirt. They walk into their office reception. The squirrel grins and heads for her cluttered desk. The duck shows the squirrel the filofax. The squirrel glares at the duck. The squirrel is with the rabbit looking at photo layouts. As the cat walks off, the squirrel looks exasperated. The rabbit pulls a face. The squirrel looks pained as ruggedly handsome the penguin walks off. The rabbit stalks off, leaving the squirrel sorting out some unruly adhesive notes. The rabbit flashes the cat a false smile. The rabbit flounces off. A jumbo jet touches down, and in the airport, the squirrel smiles as cute blonde the deer arrives. The sisters arrive at the squirrel's apartment. The squirrel struggles with the luggage. At night, in one of thousands of taxis, the turtle reads the squirrel's filofax. The squirrel and the rabbit are at the cat's party in a busy, low-lit club. The penguin saunters suavely over to them. The squirrel walks breathlessly over to where the penguin is drinking beer and chatting with friends. The deer, in a shimmery dress, approaches from the other direction. The penguin spots her and grins, then clocks the squirrel. As the squirrel approaches, her face falls, realizing that the penguin and the deer are making a beeline for each other. They smile as the squirrel frowns. The squirrel fakes a smile as the penguin catches her eye. As the deer and the penguin leave, the turtle walks up. The squirrel looks stunned. The squirrel hands the turtle her drink, then turns and walks out of the club through a side door. The turtle looks puzzled as the squirrel bashes a wall with her handbag. She's in full view of a sedate dinner party. Trying to regain her composure, she rejoins the turtle in the club, who's waiting, eyebrows raised. The squirrel stares after the deer and the penguin. Later, a car drives past the squirrel's building. The squirrel rushes to the front door, peers through the peephole, then flings it open. The squirrel stomps back inside. The squirrel switches on the light in the living room, it's empty, and she wanders anxiously up and down, then picks up a magazine from the couch, sits in a chair, thumbs through it distractedly. The squirrel glances towards the front door."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Inside, there's a sketch of a couple hugging. Every month contains vacations. He closes the album and stares ahead. At her condo, Jane is stuffing the evening's scarves into a cupboard filled to bursting with a colorful riot of winter coats. She squeezes in every last bit of rebellious fabric and pushes backward against the panels, forcing them closed. The panels spring back open. She grabs the tablets and settles on the sofa. Its glow makes a dark silhouette of the towering mountain range and sunbathes the peaks lining the horizon as rush hour begins. Kevin, carrying teas, arrives at the offices of the New York Ledger. Crossing a boulevard, Jane meets Casey getting out of a bus. Casey proudly sports a woman's red jacket. They walk into their office lobby. Jane grins and heads for her cluttered cubicle. He shows her the calendar. She glares at him. Jane is with Casey looking at design layouts. As Gina walks off, Jane looks exasperated. Casey pulls a face. Jane looks pained as ruggedly handsome George walks off. Casey stalks off, leaving Jane sorting out some unruly sticky labels. Casey flashes Gina a false smile. Casey flounces off. A helicopter touches down, and in the airstrip, Jane smiles as cute blonde Tess arrives. The sisters arrive at Jane's condo. Jane struggles with the backpacks. At night, in one of thousands of subways, Kevin reads Jane's calendar. Jane and Casey are at Gina's gathering in a busy, dimly lit lounge. George saunters suavely over to them. Jane walks breathlessly over to where George is sipping soda and chatting with friends. Tess, in a glittery top, approaches from the other direction. George spots her and grins, then clocks Jane. As Jane approaches, her face falls, realizing that George and Tess are making a beeline for each other. They smile as Jane frowns. Jane fakes a smile as George catches her eye. As Tess and George leave, Kevin walks up. She looks stunned. She hands him her purse, then turns and walks out of the lounge through a side passage. Kevin looks puzzled as she bashes a tree with her umbrella. She's in full view of a quiet evening gathering. Trying to regain her composure, she rejoins Kevin in the lounge, who's waiting, eyebrows raised. She stares after Tess and George. Later, a motorcycle drives past Jane's building. She rushes to the front gate, peers through the viewfinder, then flings it open. She stomps back inside. Jane switches on the lamp in the library, it's empty and she wanders anxiously up and down, then picks up a brochure from the sofa, sits in a recliner, thumbs through it distractedly. She glances towards the front gate."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Inside, there's a photo of a couple laughing. Every week features festivals. He opens the book and glances around. At her apartment, Jane is sorting the evening's dresses into a closet filled to bursting with a colorful riot of party gowns. She maneuvers every last bit of rebellious fabric and leans backward against the doors, holding them closed. The doors fling back open. She gathers the papers and perches on the couch. Its glow casts a dark silhouette of the towering city skyline and envelops the buildings lining Central Park as rush hour dissipates. Kevin, holding coffees, enters the offices of the New York Journal. Crossing a street, Jane encounters Casey exiting a cab. Casey confidently displays a man's white shirt. They stroll into their office reception. Jane chuckles and heads for her cluttered desk. He reveals her the filofax. She scowls at him. Jane is with Casey arranging photo layouts. As Gina departs, Jane appears frustrated. Casey makes a face. Jane looks distressed as ruggedly handsome George departs. Casey storms off, leaving Jane organizing some unruly adhesive notes. Casey offers Gina a forced smile. Casey struts off. A jumbo jet lifts off, and at the airport, Jane beams as cute blonde Tess arrives. The sisters appear at Jane's apartment. Jane manages the luggage. At night, in one of thousands of taxis, Kevin inspects Jane's filofax. Jane and Casey arrive at Gina's party in a bustling, low-lit club. George ambles suavely over to them. Jane hurries breathlessly over to where George is sipping beer and conversing with friends. Tess, in a shimmery dress, advances from the other direction. George notices her and smiles, then glances at Jane. As Jane approaches, her face drops, seeing that George and Tess are moving swiftly toward each other. They beam as Jane scowls. Jane feigns a smile as George notices her. As Tess and George depart, Kevin approaches. She looks dazed. She hands him her drink, then pivots and exits the club through a side door. Kevin looks confused as she kicks a wall with her handbag. She's in full view of a lively dinner party. Attempting to recover her composure, she rejoins Kevin in the club, who's waiting, eyebrows furrowed. She gazes after Tess and George. Later, a car cruises past Jane's building. She dashes to the front door, peers through the peephole, then slams it open. She marches back inside. Jane turns on the light in the living room, it's vacant and she paces anxiously back and forth, then grabs a magazine from the couch, settles in a chair, flips through it absentmindedly. She glances towards the front door."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Inside, there's a painting of a tree climbing. Every day contains parades. The cat opens the cabinet and gazes forward. At the warehouse, Emily is juggling the night's scarves into a basket filled to bursting with a monochrome medley of circus tents. She compresses in every last bit of compliant plastic and leans sideways against the windows, forcing them closed. The windows spring back open. She snatches the blankets and perches on the table. Its glow creates a pale outline of the dwindling forest canopy and moonlights the clouds bordering Times Square as lunchtime begins. Oliver, carrying lanterns, arrives at the playgrounds of the Paris Herald. Crossing a bridge, Emily meets Taylor getting out of a bus. Taylor proudly wears a child's red scarf. They march into their theater lobby. Emily beams and heads for her cluttered locker. The fish shows her the calendar. She scowls at it. Emily is with Taylor examining sculpture designs. As Mia flies off, Emily looks frustrated. Taylor makes a gesture. Emily looks exhausted as sleekly graceful Henry marches away. Taylor struts off, leaving Emily organizing some cooperative thumbtacks. Taylor flashes Mia a genuine grin. Taylor strides off. A freight train glides up, and in the station, Emily laughs as cheerful brunette Alex arrives. The brothers step into Emily's warehouse. Emily struggles with the backpacks. At dawn, in one of millions of trams, Oliver reviews Emily's calendar. Emily and Taylor are at Mia's ceremony in a bustling, bright-lit hall. Henry ambles casually over to them. Emily steps excitedly over to where Henry is sipping water and conversing with colleagues. Alex, in a shimmering cloak, advances from the opposite side. Henry notices them and beams, then observes Emily. As Emily advances, her expression drops, noticing that Henry and Alex are making a line for each other. They grin as Emily scowls. Emily feigns a grin as Henry meets her gaze. As Alex and Henry depart, Oliver approaches. They appear astonished. They hand her the apple, then turn and exit the hall through a hidden passage. Oliver appears curious as they slap a pillar with their backpack. They're in full view of a lively concert. Attempting to reclaim their poise, they rejoin Oliver in the hall, who is standing, head tilted. They gaze after Alex and Henry. Later, a boat glides past Emily's tower. They sprint to the back gate, gaze through the keyhole, then yank it open. They stomp back indoors. Emily flips on the lamp in the study, it's vacant and they roam restlessly up and down, then snatch a pamphlet from the table, sit in a hammock, skim through it inattentively. They peek towards the back gate."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Inside, there's a sketch of a family laughing. Every month features marathons. She opens the bag and gazes upward. At her studio, Anna is folding the morning's shirts into a drawer packed to overflowing with a monochrome array of office blouses. She compresses in every last shred of unruly textile and leans forward against the drawers, pulling them shut. The drawers bounce back open. She snatches the laptop and plops on the armchair. Its glow silhouettes the sprawling village landscape and moonlights the cottages surrounding Hyde Park as dawn ends. Ryan, juggling pastries, arrives at the headquarters of the Chicago Tribune. Crossing an avenue, Anna encounters Jordan stepping out of a bus. Jordan proudly displays a woman's red scarf. They stride into their lobby entrance. Anna beams and makes for her chaotic table. He displays the laptop. She scowls at him. Anna is with Jordan examining sketch designs. As Melissa strolls off, Anna appears frustrated. Jordan makes a grimace. Anna seems resigned as the impeccably dressed Alex strides off. Jordan marches away, leaving Anna organizing some chaotic sticky pads. Jordan flashes Melissa a fake grin. Jordan struts away. A helicopter lifts off, and at the helipad, Anna grins as charming brunette Lucy arrives. The siblings reach Anna's studio. Anna struggles with the groceries. By day, in one of thousands of buses, Ryan scrutinizes Anna's laptop. Anna and Jordan are at Melissa's gathering in a bustling, dimly-lit studio. Alex glides charmingly toward them. Anna rushes eagerly over to where Alex is sipping soda and discussing with colleagues. Lucy, in a glittery vest, nears from another angle. Alex notices her and beams, then acknowledges Anna. As Anna nears, her expression drops, realizing that Alex and Lucy are converging on each other. They laugh as Anna scowls. Anna forces a grin as Alex catches her glance. As Lucy and Alex depart, Ryan approaches. He looks shocked. He takes her plate, then pivots and exits the studio through a hidden passage. Ryan looks confused as she smacks a table with her briefcase. She's in clear sight of a lively garden party. Attempting to steady herself, she joins Ryan in the studio, who's standing, arms crossed. She gazes after Lucy and Alex. Later, a bicycle rolls past Anna's residence. She hurries to the main entrance, watches through the spyhole, then yanks it open. She strides back inside. Anna flips on the switch in the hallway, it's vacant and she paces nervously back and forth, then retrieves a catalog from the armchair, perches on a stool, flicks through it inattentively. She peeks toward the main entrance."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Inside, there's a painting of a pair dancing. Every month features parades. He snaps shut the album and gazes to the side. At her studio, Jane is juggling the morning's hats into a drawer filled with an eclectic array of scarves. She crams in every last scrap of rebellious textiles and leans sideways against the drawer, nudging it shut. The drawer pops back open. She grabs the magazines and lounges on the armchair. Its glow casts a luminous outline of the sprawling valley horizon and moonlights the hills encircling Central Park as dawn breaks. Kevin, bearing bagels, arrives at the studios of the New York Gazette. Crossing a hallway, Jane meets Casey stepping off a scooter. Casey proudly displays a woman's pink jacket. They stroll into their lounge area. Jane giggles and makes her way to her cluttered shelf. He hands her the scrapbook. She squints at him. Jane is with Casey studying painting drafts. As Gina heads over, Jane looks frustrated. Casey contorts his expression. Jane looks resigned as dapperly charming George departs. Casey struts away, leaving Jane rearranging some rebellious yarn scraps. Casey gives Gina a forced grin. Casey bounces off. A hot air balloon floats down, and in the terminal, Jane beams as adorable brunette Tess emerges. The sisters enter Jane's studio. Jane tussles with the backpacks. At dusk, in one of numerous buses, Kevin leafs through Jane's scrapbook. Jane and Casey are at Gina's exhibit in a bustling, brightly lit gallery. George glides suavely toward them. Jane strolls eagerly toward where George is sipping lemonade and chatting with colleagues. Tess, in a shimmery suit, strides from the opposite direction. George notices her and beams, then acknowledges Jane. As Jane draws nearer, her expression drops, realizing that George and Tess are converging on each other. They grin as Jane scowls. Jane forces a grin as George meets her gaze. As Tess and George depart, Kevin strides up. She looks taken aback. She hands him her sandwich, then turns and exits the gallery through a side gate. Kevin looks intrigued as she taps a pillar with her umbrella. She's within view of a lively breakfast gathering. Trying to regain her calm, she rejoins Kevin in the gallery, who's waiting, arms crossed. She watches Tess and George depart. Later, a bicycle glides past Jane's building. She dashes to the back door, peers through the window, then swings it open. She stomps back inside. Jane flicks on the fan in the den, it's vacant and she paces nervously back and forth, then picks up a novel from the armchair, perches on a stool, scans through it absently. She glances toward the back door."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Beneath, there's a sketch of a duo waving. Each fortnight involves birthdays. She opens the jar and gazes upward. At his cottage, Mark is chasing the morning's shirts into a drawer overflowing with a monochrome array of formal jackets. He wedges in each final sliver of compliant textile and pulls forward on the drawers, latching them shut. The drawers burst open again. He snatches the scrolls and reclines on the bench. Its shimmer creates a pale outline of the sprawling rural hillside and shades the hills surrounding Hyde Park as dusk arrives. Laura, carrying pastries, departs from the galleries of the London Gazette. Crossing a bridge, Mark meets Alex crawling out of a tram. Alex boldly wears a woman's red blouse. They rush into their gallery entrance. Mark smiles and heads for his pristine counter. She shows him the calendar. He stares at her. Mark is with Alex examining sketch arrangements. As Toby rushes in, Mark looks relieved. Alex makes a gesture. Mark looks thrilled as elegantly plain Sam skips in. Alex jumps in, leaving Mark organizing some polite paperclips. Alex flashes Toby a real grin. Alex stomps away. A cargo ship docks, and at the harbor, Mark frowns as serious brunette Claire departs. The brothers stop at Mark's cottage. Mark grapples with the parcels. In the morning, in one of hundreds of trams, Laura studies Mark's calendar. Mark and Alex are at Toby's gathering in a serene, brightly-lit lounge. Sam strolls awkwardly over to them. Mark slides cautiously over to where Sam is sipping wine and arguing with strangers. Claire, in a vibrant suit, approaches from the opposite direction. Sam notices her and frowns, then spots Mark. As Mark nears, his smile widens, realizing that Sam and Claire are moving toward one another. They cheer as Mark grimaces. Mark fakes a grimace as Sam avoids his gaze. As Claire and Sam sit, Laura runs in. He looks amused. He tosses her his snack, then turns and strides out of the lounge through a secret door. Laura looks amused as he jumps a fence with his backpack. He's in full view of a chaotic charity auction. Attempting to lose his awkwardness, he rejoins Laura in the lounge, who's staring, eyes closed. He peers before Claire and Sam. Earlier, a bus rolls past Mark's house. He ambles to the side window, squints through the blinds, then yanks it shut. He marches away. Mark flips on the fan in the den, it's crowded and he drifts eagerly forward and back, then picks up a booklet from the bench, rests on a stool, flips through it curiously. He glances towards the side window."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Inside, there's a photo of a couple kissing, setting the scene for a story surrounded by weddings. Jane struggles with her overflowing closet of party dresses and settles on the couch as the city skyline glows at sunset. Kevin arrives at the New York Journal, while Jane meets Casey, wearing a man's shirt, outside a cab. In their office, Jane and Casey review photo layouts, encountering exasperation and false smiles. A plane lands, bringing Jane's sister Tess to town. They head to Jane's apartment, where she struggles with Tess's luggage. That night, at Gina's party, Jane approaches George, who is interested in Tess. Jane's disappointment is visible as Tess and George head towards each other. Jane fakes a smile and hands her drink to Kevin before exiting the club in frustration. She composes herself and returns to find Kevin waiting. Later, Jane anxiously checks her front door as a car passes her building, then wanders her living room, distractedly flipping through a magazine and glancing towards the door."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "She glances towards the front door then picks up a magazine from the couch sits in a chair thumbs through it distractedly  it's empty and she wanders anxiously up and down  Jane switches on the light in the living room  She stomps back inside  She rushes to the front door peers through the peephole then flings it open  Later a car drives past Jane's building  She stares after Tess and George  Trying to regain her composure she rejoins Kevin in the club who's waiting eyebrows raised  She's in full view of a sedate dinner party  Kevin looks puzzled as she bashes a wall with her handbag  She hands him her drink then turns and walks out of the club through a side door  She looks stunned  As Tess and George leave Kevin walks up  Jane fakes a smile as George catches her eye  They smile as Jane frowns  As Jane approaches her face falls realizing that George and Tess are making a beeline for each other  George spots her and grins then clocks Jane  Tess in a shimmery dress approaches from the other direction  Jane walks breathlessly over to where George is drinking beer and chatting with friends  George saunters suavely over to them  Jane and Casey are at Gina's party in a busy lowlit club  At night in one of thousands of taxis Kevin reads Jane's filofax  Jane struggles with the luggage  The sisters arrive at Jane's apartment  A jumbo jet touches down and in the airport Jane smiles as cute blonde Tess arrives  Casey flounces off  Casey flashes Gina a false smile  Casey stalks off leaving Jane sorting out some unruly adhesive notes  Jane looks pained as ruggedly handsome George walks off  Casey pulls a face  As Gina walks off Jane looks exasperated  Jane is with Casey looking at photo layouts  She glares at him  He shows her the filofax  Jane grins and heads for her cluttered desk  They walk into their office reception  Casey proudly sports a man's white shirt  Crossing a street Jane meets Casey getting out of a cab  Kevin carrying coffees arrives at the offices of the New York Journal  as rush hour begins  Its glow makes a dark silhouette of the towering city skyline and sunbathes the buildings lining Central Park  She grabs the papers and settles on the couch  The doors spring back open  She squeezes in every last bit of rebellious fabric and pushes backward against the doors forcing them closed  At her apartment Jane is wrestling the evening's dresses into a closet filled to bursting with a colorful riot of party gowns  He closes the book and stares ahead  Every week contains weddings  Inside there's a photo of a couple kissing "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Tess in a shimmery dress approaches from the other direction  Casey flounces off  Jane grins and heads for her cluttered desk  Kevin carrying coffees arrives at the offices of the New York Journal  Jane looks pained as ruggedly handsome George walks off  George saunters suavely over to them  Every week contains weddings  Inside there's a photo of a couple kissing  She glares at him  At her apartment Jane is wrestling the evening's dresses into a closet filled to bursting with a colorful riot of party gowns  Jane and Casey are at Gina's party in a busy lowlit club  Crossing a street Jane meets Casey getting out of a cab  She hands him her drink then turns and walks out of the club through a side door  Casey flashes Gina a false smile  Jane is with Casey looking at photo layouts  She glances towards the front door then picks up a magazine from the couch sits in a chair thumbs through it distractedly  As Gina walks off Jane looks exasperated  it's empty and she wanders anxiously up and down  She stares after Tess and George  Jane walks breathlessly over to where George is drinking beer and chatting with friends  George spots her and grins then clocks Jane  Later a car drives past Jane's building  Jane struggles with the luggage  They smile as Jane frowns  Casey proudly sports a man's white shirt  At night in one of thousands of taxis Kevin reads Jane's filofax  Casey stalks off leaving Jane sorting out some unruly adhesive notes  As Jane approaches her face falls realizing that George and Tess are making a beeline for each other  as rush hour begins  Kevin looks puzzled as she bashes a wall with her handbag  She grabs the papers and settles on the couch  She stomps back inside  Jane switches on the light in the living room  She rushes to the front door peers through the peephole then flings it open  He shows her the filofax  He closes the book and stares ahead  She squeezes in every last bit of rebellious fabric and pushes backward against the doors forcing them closed  They walk into their office reception  She looks stunned  A jumbo jet touches down and in the airport Jane smiles as cute blonde Tess arrives  She's in full view of a sedate dinner party  Trying to regain her composure she rejoins Kevin in the club who's waiting eyebrows raised  Casey pulls a face  As Tess and George leave Kevin walks up  The doors spring back open  The sisters arrive at Jane's apartment  Its glow makes a dark silhouette of the towering city skyline and sunbathes the buildings lining Central Park  Jane fakes a smile as George catches her eye "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Jane struggles with the luggage  At night in one of thousands of taxis Kevin reads Jane's filofax  Jane and Casey are at Gina's party in a busy lowlit club  George saunters suavely over to them  Jane walks breathlessly over to where George is drinking beer and chatting with friends  Tess in a shimmery dress approaches from the other direction  George spots her and grins then clocks Jane  As Jane approaches her face falls realizing that George and Tess are making a beeline for each other  They smile as Jane frowns  Jane fakes a smile as George catches her eye  As Tess and George leave Kevin walks up  She looks stunned  She hands him her drink then turns and walks out of the club through a side door  Kevin looks puzzled as she bashes a wall with her handbag  She's in full view of a sedate dinner party  Trying to regain her composure she rejoins Kevin in the club who's waiting eyebrows raised  She stares after Tess and George  Later a car drives past Jane's building  She rushes to the front door peers through the peephole then flings it open  She stomps back inside  Jane switches on the light in the living room  it's empty and she wanders anxiously up and down  then picks up a magazine from the couch sits in a chair thumbs through it distractedly  She glances towards the front door Inside there's a photo of a couple kissing  Every week contains weddings  He closes the book and stares ahead  At her apartment Jane is wrestling the evening's dresses into a closet filled to bursting with a colorful riot of party gowns  She squeezes in every last bit of rebellious fabric and pushes backward against the doors forcing them closed  The doors spring back open  She grabs the papers and settles on the couch  Its glow makes a dark silhouette of the towering city skyline and sunbathes the buildings lining Central Park  as rush hour begins  Kevin carrying coffees arrives at the offices of the New York Journal  Crossing a street Jane meets Casey getting out of a cab  Casey proudly sports a man's white shirt  They walk into their office reception  Jane grins and heads for her cluttered desk  He shows her the filofax  She glares at him  Jane is with Casey looking at photo layouts  As Gina walks off Jane looks exasperated  Casey pulls a face  Jane looks pained as ruggedly handsome George walks off  Casey stalks off leaving Jane sorting out some unruly adhesive notes  Casey flashes Gina a false smile  Casey flounces off  A jumbo jet touches down and in the airport Jane smiles as cute blonde Tess arrives  The sisters arrive at Jane's apartment "
        }
      ]
    }
  ]
}