{
  "ground_truth": "Marcus looks incredulously at Willie who drags on a fag. In a boxing setting, Marcus talks to the kid, who is his opponent, and Marcus looks him over. The kid steps forward and kicks Marcus in the crotch, doubling him up. He punches the kid low, whacks Willie in the balls too, and hits Marcus in the nuts, resulting in all three combatants lying, writhing in agony, on the canvas. Willie turns to the kid, and they kick at each other. That night, Grandma has collapsed in front of the TV in the lounge when Willie and Sue come in and see her. Granny lies back on the sofa, deathly still, with her mouth agape. They walk a little closer, and Willie goes over to her. Sue looks on anxiously as Willie bends over Granny, then he looks around at Sue, holds his hand in front of Grandma’s mouth, and checks for a heartbeat. Granny suddenly comes to. Later on, in a bedroom, a black rug is spread out on the floor, with odd discarded clothes lying on it. Nearby, Sue lies on her back in her bra and jeans, while a bare-chested Willie sits astride her, wearing his jeans and a Santa hat. He leans down and seductively licks from her navel up to her bra, then leans forward and kisses her. He kisses his way back down her body, grips her pants between his teeth, and pulls on them just as the kid comes in through the door. The kid hands Willie a roughly carved bit of wood with a ribbon around it. Mystified, Willie looks at it and holds up his injured hand, looking moved. Sue props herself up on her elbows. Willie stares at the pickle, and Sue smiles. Willie stares at her, looks at her, nods to himself, smiles, and shrugs. The next morning, Willie is back in his Santa gear and rooting around in the fridge in the kitchen when the kid runs in. Willie takes the report card, puts it down, and stops buttering toast. Thurman looks down sadly, and Willie angrily throws down his knife, struck dumb. Thurman picks up his report card and heads out of the kitchen. Willie watches him go, a thoughtful expression crossing his face. At night, Marcus and Lois sit in the van in the deserted mall car park watching the staff entrance and see Gin come out. Marcus and Lois watch as Gin gets in his big Chevrolet car and drives off. Gin drives down a deserted unlit road, where he sees a light swinging from side to side and the vans up the roadside.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Marcus gazes incredulously at Willie who inhales on a cigarette. In a boxing environment, Marcus speaks to the youngster, who is his adversary, and Marcus observes him. The youngster strides forward and strikes Marcus in the groin, doubling him over. He jabs the youngster low, smacks Willie in the testicles as well, and strikes Marcus in the genitals, resulting in all three fighters lying, writhing in torment, on the canvas. Willie turns to the youngster, and they kick at each other. That evening, Grandma has collapsed in front of the TV in the lounge when Willie and Sue enter and notice her. Granny reclines on the sofa, lifelessly still, with her mouth wide open. They walk a bit closer, and Willie approaches her. Sue observes anxiously as Willie bends over Granny, then he glances around at Sue, places his hand in front of Grandma’s mouth, and checks for a pulse. Granny suddenly revives. Later, in a bedroom, a black carpet is spread out on the floor, with various discarded garments lying on it. Nearby, Sue reclines on her back in her bra and jeans, while a bare-chested Willie sits astride her, wearing his jeans and a Santa hat. He leans down and seductively licks from her navel up to her bra, then leans forward and kisses her. He kisses his way back down her body, grips her trousers between his teeth, and pulls on them just as the youngster enters through the door. The youngster hands Willie a roughly carved piece of wood with a ribbon around it. Perplexed, Willie gazes at it and holds up his injured hand, appearing touched. Sue props herself up on her elbows. Willie stares at the conundrum, and Sue smiles. Willie gazes at her, looks at her, nods to himself, smiles, and shrugs. The following morning, Willie is back in his Santa attire and rummaging around in the fridge in the kitchen when the youngster rushes in. Willie takes the report card, sets it down, and pauses buttering bread. Thurman looks down despondently, and Willie angrily throws down his knife, rendered speechless. Thurman picks up his report card and exits the kitchen. Willie watches him leave, a contemplative expression crossing his face. At night, Marcus and Lois sit in the van in the deserted mall car park watching the staff entrance and see Gin emerge. Marcus and Lois watch as Gin gets in his large Chevrolet vehicle and drives off. Gin drives down a deserted unlit road, where he sees a lantern swinging from side to side and the vans up the roadside."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Marcus is looked at incredulously by Willie, who is dragged on a fag. In a boxing setting, the kid, who is Marcus's opponent, is talked to by Marcus, and the kid is looked over by him. Marcus is stepped toward by the kid, who is doubled up after being kicked in the crotch by him. The kid is punched low by him, Willie is whacked in the balls too, and Marcus is hit in the nuts, resulting in all three combatants lying, writhing in agony, on the canvas. The kid is turned to by Willie, and each other is kicked at by them. That night, Grandma collapses in front of the TV in the lounge when she is seen by Willie and Sue as they come in. The sofa is laid back on by Granny, deathly still, with her mouth agape. A little closer is walked by them, and she is gone over to by Willie. Sue looks on anxiously as Granny is bent over by Willie, then Sue is looked around at by him, Grandma’s mouth is checked in front of by him, and a heartbeat is checked for by him. Granny suddenly comes to. Later on, in a bedroom, someone has spread a black rug out on the floor, with odd discarded clothes lying on it. Nearby, Sue is lying on her back in her bra and jeans, while a bare-chested Willie, wearing his jeans and a Santa hat, sits astride her. Down he leans and seductively licks from her navel up to her bra, then forward he leans and kisses her. Back down her body, he kisses his way, grips her pants between his teeth, and pulls on them just as the door is come in through by the kid. Willie is handed a roughly carved bit of wood with a ribbon around it by the kid. Mystified, he looks at it and holds up his injured hand, looking moved. Herself is propped up on her elbows by Sue. The pickle is stared at by Willie, and she smiles. Her is stared at by Willie, her is looked at by him, he nods to himself, smiles, and shrugs. The next morning, Willie is back in his Santa gear and is rooted around in the fridge in the kitchen when the kid runs in. The report card is taken by Willie, put down, and he stops buttering toast. Sadly, Thurman looks down, and Willie angrily throws down his knife, struck dumb. Thurman picks up his report card and heads out of the kitchen. Him is watched by Willie go, a thoughtful expression crossing his face. At night, the van is sat in by Marcus and Lois in the deserted mall car park watching the staff entrance and Gin is seen coming out by them. Gin is watched by Marcus and Lois as Gin gets in his big Chevrolet car and drives off. Down a deserted unlit road, Gin drives, where he sees a light swinging from side to side and the vans up the roadside."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Marcus incredulously watches Willie smoking. In a boxing scene, Marcus inspects his opponent, the kid, who kicks Marcus in the crotch, doubling him over. Marcus retaliates by punching the kid low, hitting Willie too, leaving all three writhing on the canvas. Willie turns to the kid, and they start kicking each other. That evening, Grandma collapses in front of the TV when Willie and Sue enter. She lies still on the sofa as Willie checks for signs of life. Suddenly, Granny revives. Later, in a bedroom, discarded clothes lie on a black rug. Sue is on her back in her bra and jeans, while Willie, bare-chested, sits on her wearing a Santa hat. He seductively licks her body and kisses her, pulling her pants with his teeth just as the kid enters. The kid gives Willie a carved wooden piece with a ribbon. Willie, moved, examines it and shows his injured hand. Sue props up, smiles at him, and Willie nods, smiles, and shrugs. The next morning, Willie, in his Santa outfit, is in the kitchen when the kid runs in. Willie puts the report card down, stopping his toast preparation. Thurman looks down, and Willie throws his knife down angrily, silent. Thurman takes his report card and leaves, with Willie watching thoughtfully. At night, Marcus and Lois sit in a van in a deserted mall car park, observing the staff entrance and see Gin exit. They watch as Gin drives his Chevrolet away down a dark road, noticing a light swinging and vans parked roadside."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Marcus incredulously watches Willie drag on a cigarette. In a boxing setting, Marcus examines his opponent, a kid, who then kicks Marcus in the crotch. Marcus retaliates, hitting the kid low, and they both hit Willie, leaving all three in pain on the canvas. Willie and the kid kick each other. That night, Willie and Sue find Grandma motionless on the sofa in front of the TV. They approach, and Willie checks her for signs of life; she suddenly revives. Later, in a bedroom, Sue lies in her bra and jeans while Willie, wearing jeans and a Santa hat, seductively kisses her body. The kid enters, handing Willie a carved wood piece with a ribbon, which Willie accepts, touched. Sue props up, and Willie, looking at the wood and Sue, smiles and shrugs. The next morning, Willie is in his Santa outfit in the kitchen when the kid arrives. Willie stops buttering toast to take the report card, but Thurman looks down sadly. Willie throws his knife in frustration, and Thurman leaves with his report card, while Willie watches thoughtfully. At night, Marcus and Lois watch from a van in the deserted car park, observing Gin exit and drive away in his Chevrolet down a dark road with a swinging light and parked vans."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Marcus gazes incredulously at Willie, who leisurely drags on a cigarette. In the bustling environment of a boxing ring, Marcus engages in conversation with the young boy, who is indeed his opponent, as Marcus critically examines him. The kid boldly steps forward and unexpectedly kicks Marcus in the crotch, causing him to double over in pain. Retaliating, Marcus punches the kid low, and in the ensuing chaos, Willie also gets hit in the balls. Marcus is struck in the nuts, resulting in the trio of combatants collapsing in agony, squirming on the canvas. Willie, recovering quickly, turns to face the kid, and they start kicking at each other. Later that evening, Grandma has collapsed in front of the television in the cozy lounge when Willie and Sue walk in and see her. Granny lies back on the sofa, eerily still, her mouth agape with no sign of movement. As they cautiously move closer, Willie approaches her with concern. Sue watches anxiously as Willie leans over Granny, then glances over at Sue, holding his hand in front of Grandma’s mouth to check for any breath, and feels for a heartbeat. Miraculously, Granny suddenly revives. In a bedroom later on, a black rug is spread out across the floor, with various discarded clothes haphazardly strewn across it. Close by, Sue is lying on her back wearing only her bra and jeans, while Willie, bare-chested and clad in his jeans and a Santa hat, is sitting astride her. He leans down, seductively licking from her navel up to her bra, then leans forward to plant a kiss on her. He continues to kiss his way down her body, grips her pants between his teeth, and tugs on them just as the kid unexpectedly enters through the door. The kid hands Willie a roughly carved piece of wood adorned with a ribbon. Willie, mystified, examines it and holds up his injured hand, visibly moved by the gesture. Sue props herself up on her elbows, watching him. Willie stares at the peculiar gift, then looks at Sue, nods to himself understandingly, smiles, and gives a nonchalant shrug. The following morning, Willie is once again dressed in his Santa costume, rummaging around in the kitchen fridge when the kid runs in. Willie takes the report card from him, puts it down, and pauses buttering his toast. Thurman, looking downcast, prompts Willie to angrily throw down his knife, rendered speechless by frustration. Thurman picks up his report card and quietly leaves the kitchen. Willie watches him go, his face reflecting a thoughtful expression as he considers the situation. That night, in a deserted mall car park, Marcus and Lois sit watchfully in their van, keeping an eye on the staff entrance as they see Gin emerge. Marcus and Lois observe as Gin gets into his large Chevrolet car and drives off. Gin continues driving down a deserted, dark, and unlit road, where he sees a solitary light swinging from side to side, and the vans parked up by the roadside."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Marcus casts a look of incredulous disbelief at Willie, who is leisurely taking a drag from his cigarette with an air of ease. Amidst the lively and chaotic atmosphere of a bustling boxing ring, Marcus finds himself engaging in a conversation with the young boy, who, as it turns out, is his opponent. As Marcus is occupied with critically examining the boy, the kid, with a bold and unexpected move, steps forward and suddenly kicks Marcus in the crotch, causing him to double over in immediate and intense pain. In retaliation, Marcus reacts by delivering a low punch to the kid, and amidst the ensuing chaos and confusion, Willie also ends up getting hit in the balls. Marcus, too, is struck in the nuts, resulting in all three combatants collapsing onto the canvas in a shared state of agony, squirming about in pain. Willie, however, recovers more quickly than the others and turns to face the kid, leading to the two beginning to kick at each other once more.\n\nLater that same evening, in the cozy and familiar setting of the lounge, Grandma has collapsed in front of the television. As Willie and Sue walk into the room, they are greeted by the sight of Granny lying back on the sofa, eerily still and with her mouth agape, showing no visible sign of movement. With cautious steps, they move closer to her, Willie approaching with a deep sense of concern. Sue watches from nearby with anxious eyes as Willie leans over Granny, then glances over at Sue, holding his hand in front of Grandma’s mouth to check for any breath and feels for a heartbeat, demonstrating his worry. To their relief, Granny unexpectedly revives, much to their surprise and relief.\n\nLater, in a bedroom, the floor is covered by a black rug, with various items of discarded clothing haphazardly strewn across it. Nearby, Sue is lying on her back, wearing only her bra and jeans, while Willie, bare-chested and donning a Santa hat along with his jeans, is sitting astride her. With a seductive motion, he leans down and licks from her navel up to her bra before leaning forward to plant a kiss on her. He continues his affectionate gestures, kissing his way down her body, grasping her pants between his teeth, and giving them a tug just as the kid unexpectedly enters through the door. The kid hands Willie a roughly carved piece of wood adorned with a ribbon. Willie, mystified and intrigued by the gesture, examines the object and holds up his injured hand, visibly moved. Sue props herself up on her elbows to watch him closely. Willie stares at the peculiar and thoughtful gift, then turns to look at Sue, nods to himself as if understanding something, smiles, and gives a nonchalant shrug.\n\nIn the following morning, Willie is once again dressed in his Santa costume and is rummaging around inside the kitchen fridge when the kid suddenly runs in. Willie takes the report card from him, puts it down, and momentarily pauses from buttering his toast. Thurman, looking downcast and dejected, prompts Willie to angrily throw down his knife, rendered speechless by his mounting frustration. Thurman then picks up his report card and quietly leaves the kitchen, his demeanor subdued. Willie watches him depart, his face reflecting a thoughtful expression, as if pondering the whole situation thoughtfully.\n\nThat night, in a deserted and empty mall car park, Marcus and Lois sit watchfully inside their van, keeping a vigilant eye on the staff entrance as they see Gin emerge. Marcus and Lois continue to observe as Gin gets into his large Chevrolet car and drives away. Gin proceeds to drive down a deserted, dark, and unlit road where he notices a solitary light swinging from side to side, with the vans parked up along the roadside, adding to the enigmatic and mysterious atmosphere."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Marcus, standing in a smoky room, directs a look filled with incredulity at Willie, who nonchalantly drags on a cigarette. This tense atmosphere is set in a boxing environment where Marcus engages in conversation with a kid, acknowledging him as his opponent, and takes a moment to scrutinize him from head to toe. Out of nowhere, the kid aggressively advances, delivering a swift kick to Marcus's crotch, causing him to double over in pain. Reacting to this unexpected attack, Marcus retaliates with a low punch directed at the kid, only to get caught up in an ensuing chaotic scuffle. Willie, appearing to join the fray, ends up being inadvertently hit in the balls, and in a moment of slapstick misfortune, Marcus takes another blow to his own sensitive area. This chain reaction results in all three fighters collapsing onto the canvas, each writhing in their own realm of agony. Willie, amidst groans, turns toward the kid, and they engage in a feeble kicking match with each other. Fast forward to that night, and the scene shifts to a cozy lounge where Grandma is seen collapsed in front of the television, utterly still, creating a stark picture of concern. Willie and Sue enter, immediately noticing her motionless form sprawled on the sofa with her mouth hanging open. They cautiously inch closer, and Willie takes it upon himself to approach her, while Sue watches with visible worry. Bending over Grandma, Willie hesitantly extends his hand, gently placing it in front of her mouth to check for breath, then cautiously attempts to detect a heartbeat. Just as the tension mounts, Granny suddenly stirs back to consciousness, much to everyone's relief. Later, the scene transitions to an intimate setting in a bedroom, where a black rug is laid out on the floor, speckled with various discarded clothes. Here, Sue reclines on her back, clad in just her bra and jeans, while Willie, bare-chested but wearing his jeans and a playful Santa hat, sits straddling her. He teasingly lowers himself to her navel, trailing a seductive lick upward toward her bra, before leaning in to plant a kiss. With a fluid movement, he kisses his way back down, catches hold of the fabric of her pants with his teeth, and begins to tug on them. This intimate moment is abruptly interrupted as the kid barges in through the door, unfazed, and approaches Willie with a peculiar offering—a roughly carved piece of wood adorned with a ribbon. Willie, perplexed, examines the object, holding his injured hand up with a mix of surprise and emotion. Sue, curious, props herself up on her elbows to get a better view. As Willie processes the gesture, he gazes at the pickle, then redirects his gaze to Sue, who meets his eyes with a smile. In a moment of realization, Willie stares into her eyes, absorbs her expression, nods to himself as if coming to a silent understanding, returns her smile, and lets out a shrug, signifying a silent agreement. The following morning brings a change in pace, with Willie back in his Santa attire, rummaging through the fridge in the kitchen. The kid bursts in, capturing his attention. Willie accepts the report card handed to him, momentarily setting it aside to concentrate on buttering his piece of toast. Thurman, standing nearby, casts a downcast look at the floor, prompting Willie to drop his knife in frustration, rendered speechless by the situation. Thurman, with a hint of disappointment, retrieves his report card and quietly exits the kitchen. Willie remains behind, watching him leave, as a thoughtful expression gradually makes its way across his face. As night falls, the scene shifts to Marcus and Lois, who are stationed in a van parked in the desolate mall car park. They keep a watchful eye on the staff entrance, observing as Gin emerges and makes his way to his large Chevrolet. Marcus and Lois continue their surveillance, watching as Gin starts the vehicle and drives off. The scene follows Gin as he navigates through a deserted, unlit road. With nothing but darkness around him, he notices a light ahead, swinging mysteriously from side to side, catching a glimpse of the vans stationed up along the roadside."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Marcus exchanges an incredulous look with Willie, who is smoking, before engaging in a brief altercation in the boxing ring. Marcus sizes up his kid opponent, only to be kicked in the crotch, leading to a chaotic scuffle where all three, including Willie, end up writhing in pain on the canvas after a series of retaliatory low blows. Later, Willie and Sue discover Grandma collapsed on the sofa, seemingly unconscious. Willie checks her vital signs as Sue looks on worriedly, only for Grandma to suddenly revive. In a bedroom scene, Sue is on her back while Willie, wearing jeans and a Santa hat, seductively kisses and teases her before the kid interrupts with a wooden gift, moving Willie. Sue smiles as Willie, touched, acknowledges her with a nod and smile. The following morning, Willie, back in his Santa outfit, stops preparing breakfast when Thurman enters with a poor report card, leading to a tense moment as Willie contemplates the situation. In the evening, Marcus and Lois surveil from a van in a mall car park, observing Gin leave in his Chevrolet. They track Gin as he drives down a dark, deserted road, where they notice a swinging light and vans parked at the roadside."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Marcus looks incredulously at Willie, who drags on a fag, a term commonly used in the UK for a cigarette. In a boxing setting that is reminiscent of local amateur tournaments where beginners often spar to hone their skills, Marcus talks to the kid, who is his opponent, and Marcus looks him over with a discerning eye for weaknesses. The kid steps forward and delivers an unexpected, unsportsmanlike kick to Marcus in the crotch, doubling him up. He punches the kid low, whacks Willie in the balls too with the same defensive desperation, and hits Marcus in the nuts again, resulting in all three combatants lying, writhing in agony, on the canvas that has seen many fighters' struggles. Willie turns to the kid, and they kick at each other, engaging in a haphazard melee. That night, Grandma has collapsed in front of the TV in the lounge, a room that serves as the social hub in many homes, when Willie and Sue come in and see her. Granny lies back on the sofa, deathly still, with her mouth agape, as if mimicking a scene from a dramatic soap opera. They walk a little closer, and Willie goes over to her. Sue looks on anxiously as Willie bends over Granny, then he looks around at Sue, holds his hand in front of Grandma’s mouth, a classic method to check for breath, and checks for a heartbeat. Granny suddenly comes to, as if awoken from a deep slumber. Later on, in a bedroom with dim lighting that casts shadows on the walls, a black rug is spread out on the floor, with odd discarded clothes lying on it from a hurried or perhaps passionate moment. Nearby, Sue lies on her back in her bra and jeans, while a bare-chested Willie sits astride her, wearing his jeans and a Santa hat, an accessory that adds a whimsical element to the intimate scene. He leans down and seductively licks from her navel up to her bra, then leans forward and kisses her, evoking a scene from a romantic movie. He kisses his way back down her body, grips her pants between his teeth, and pulls on them just as the kid comes in through the door, creating a comedic interruption. The kid hands Willie a roughly carved bit of wood with a ribbon around it, a symbol of a child's craft project filled with innocence and effort. Mystified, Willie looks at it and holds up his injured hand, looking moved by the gesture. Sue props herself up on her elbows. Willie stares at the pickle, an object that is oddly out of place, and Sue smiles. Willie stares at her, looks at her, nods to himself, smiles, and shrugs, perhaps acknowledging a silent understanding between them. The next morning, Willie is back in his Santa gear and rooting around in the fridge in the kitchen, reminiscent of a scene where morning routines intersect with lingering holiday duties, when the kid runs in. Willie takes the report card, puts it down, and stops buttering toast, an action interrupted by unexpected news. Thurman looks down sadly, and Willie angrily throws down his knife, struck dumb by the gravity of the grades. Thurman picks up his report card and heads out of the kitchen, his shoulders weighted with disappointment. Willie watches him go, a thoughtful expression crossing his face, an indication of stirring emotions. At night, Marcus and Lois sit in the van in the deserted mall car park, a place that seems more eerie when devoid of its usual bustle, watching the staff entrance and see Gin come out. Marcus and Lois watch as Gin gets in his big Chevrolet car, a classic American vehicle known for its robust design, and drives off. Gin drives down a deserted unlit road, where he sees a light swinging from side to side and the vans up the roadside, suggesting a hidden meeting or clandestine operation just beyond the reach of city lights."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Sue props herself up on her elbows Marcus looks incredulously at Willie who drags on a fag Thurman picks up his report card and heads out of the kitchen In a boxing setting Marcus talks to the kid who is his opponent and Marcus looks him over The next morning Willie is back in his Santa gear and rooting around in the fridge in the kitchen The kid steps forward and kicks Marcus in the crotch doubling him up He punches the kid low whacks Willie in the balls too and hits Marcus in the nuts resulting in all three combatants lying writhing in agony on the canvas Willie turns to the kid and they kick at each other He punches the kid low whacks Willie in the balls too and hits Marcus in the nuts resulting in all three combatants lying writhing in agony on the canvas Marcus looks incredulously at Willie who drags on a fag The kid steps forward and kicks Marcus in the crotch doubling him up That night Grandma has collapsed in front of the TV in the lounge when Willie and Sue come in and see her Granny lies back on the sofa deathly still with her mouth agape They walk a little closer and Willie goes over to her Sue looks on anxiously as Willie bends over Granny Sue looks on anxiously as Willie bends over Granny Thurman looks down sadly and Willie angrily throws down his knife struck dumb At night Marcus and Lois sit in the van in the deserted mall car park watching the staff entrance and see Gin come out then he looks around at Sue holds his hand in front of Grandma’s mouth and checks for a heartbeat Granny suddenly comes to Marcus and Lois watch as Gin gets in his big Chevrolet car and drives off Later on in a bedroom a black rug is spread out on the floor with odd discarded clothes lying on it In a boxing setting Marcus talks to the kid who is his opponent and Marcus looks him over Nearby Sue lies on her back in her bra and jeans while a barechested Willie sits astride her wearing his jeans and a Santa hat He leans down and seductively licks from her navel up to her bra then leans forward and kisses her He kisses his way back down her body grips her pants between his teeth and pulls on them just as the kid comes in through the door The kid hands Willie a roughly carved bit of wood with a ribbon around it Mystified Willie looks at it and holds up his injured hand looking moved Sue props herself up on her elbows He leans down and seductively licks from her navel up to her bra then leans forward and kisses her Willie stares at the pickle and Sue smiles Willie stares at her looks at her nods to himself smiles and shrugs The next morning Willie is back in his Santa gear and rooting around in the fridge in the kitchen They walk a little closer and Willie goes over to her Willie turns to the kid and they kick at each other when the kid runs in Willie takes the report card puts it down and stops buttering toast Thurman looks down sadly and Willie angrily throws down his knife struck dumb Thurman picks up his report card and heads out of the kitchen Willie watches him go a thoughtful expression crossing his face At night Marcus and Lois sit in the van in the deserted mall car park watching the staff entrance and see Gin come out Marcus and Lois watch as Gin gets in his big Chevrolet car and drives off Gin drives down a deserted unlit road where he sees a light swinging from side to side and the vans up the roadside"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Marcus looks incredulously at Willie who drags on a fag. In a boxing setting Marcus talks to the kid who is his opponent and Marcus looks him over. The kid steps forward and kicks Marcus in the crotch doubling him up. He punches the kid low whacks Willie in the balls too and hits Marcus in the nuts resulting in all three combatants lying writhing in agony on the canvas. Willie turns to the kid and they kick at each other. That night Grandma has collapsed in front of the TV in the lounge when Willie and Sue come in and see her. Granny lies back on the sofa deathly still with her mouth agape. They walk a little closer and Willie goes over to her. Sue looks on anxiously as Willie bends over Granny. then he looks around at Sue holds his hand in front of Grandma’s mouth and checks for a heartbeat. Granny suddenly comes to. Later on in a bedroom a black rug is spread out on the floor with odd discarded clothes lying on it. Nearby Sue lies on her back in her bra and jeans while a barechested Willie sits astride her wearing his jeans and a Santa hat. He leans down and seductively licks from her navel up to her bra then leans forward and kisses her. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. He kisses his way back down her body grips her pants between his teeth and pulls on them just as the kid comes in through the door. The kid hands Willie a roughly carved bit of wood with a ribbon around it. Mystified Willie looks at it and holds up his injured hand looking moved. Sue props herself up on her elbows. Willie stares at the pickle and Sue smiles. Willie stares at her looks at her nods to himself smiles and shrugs. The next morning Willie is back in his Santa gear and rooting around in the fridge in the kitchen. when the kid runs in Willie takes the report card puts it down and stops buttering toast. Thurman looks down sadly and Willie angrily throws down his knife struck dumb. Thurman picks up his report card and heads out of the kitchen. Willie watches him go a thoughtful expression crossing his face. At night Marcus and Lois sit in the van in the deserted mall car park watching the staff entrance and see Gin come out. Marcus and Lois watch as Gin gets in his big Chevrolet car and drives off. Gin drives down a deserted unlit road where he sees a light swinging from side to side and the vans up the roadside."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Marcus looks incredulously at Willie who drags on a fag. In a boxing setting Marcus talks to the kid who is his opponent and Marcus looks him over. The kid steps forward and kicks Marcus in the crotch doubling him up. He punches the kid low whacks Willie in the balls too and hits Marcus in the nuts resulting in all three combatants lying writhing in agony on the canvas. Willie turns to the kid and they kick at each other. That night Grandma has collapsed in front of the TV in the lounge when Willie and Sue come in and see her. Granny lies back on the sofa deathly still with her mouth agape. They walk a little closer and Willie goes over to her. Sue looks on anxiously as Willie bends over Granny. then he looks around at Sue holds his hand in front of Grandma’s mouth and checks for a heartbeat. Granny suddenly comes to. Later on in a bedroom a black rug is spread out on the floor with odd discarded clothes lying on it. Nearby Sue lies on her back in her bra and jeans while a barechested Willie sits astride her wearing his jeans and a Santa hat. He leans down and seductively licks from her navel up to her bra then leans forward and kisses her. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. He kisses his way back down her body grips her pants between his teeth and pulls on them just as the kid comes in through the door. The kid hands Willie a roughly carved bit of wood with a ribbon around it. Mystified Willie looks at it and holds up his injured hand looking moved. Sue props herself up on her elbows. Willie stares at the pickle and Sue smiles. Willie stares at her looks at her nods to himself smiles and shrugs. The next morning Willie is back in his Santa gear and rooting around in the fridge in the kitchen. when the kid runs in Willie takes the report card puts it down and stops buttering toast. Thurman looks down sadly and Willie angrily throws down his knife struck dumb. Thurman picks up his report card and heads out of the kitchen. Willie watches him go a thoughtful expression crossing his face. At night Marcus and Lois sit in the van in the deserted mall car park watching the staff entrance and see Gin come out. Marcus and Lois watch as Gin gets in his big Chevrolet car and drives off. Gin drives down a deserted unlit road where he sees a light swinging from side to side and the vans up the roadside."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Marcus looks incredulously at Willie who drags on a fag. In a boxing setting Marcus talks to the kid who is his opponent and Marcus looks him over. The kid steps forward and kicks Marcus in the crotch doubling him up. He punches the kid low whacks Willie in the balls too and hits Marcus in the nuts resulting in all three combatants lying writhing in agony on the canvas. Willie turns to the kid and they kick at each other. That night Grandma has collapsed in front of the TV in the lounge when Willie and Sue come in and see her. Granny lies back on the sofa deathly still with her mouth agape. when the kid runs in Willie takes the report card puts it down and stops buttering toast. Thurman looks down sadly and Willie angrily throws down his knife struck dumb. Thurman picks up his report card and heads out of the kitchen. Willie watches him go a thoughtful expression crossing his face. At night Marcus and Lois sit in the van in the deserted mall car park watching the staff entrance and see Gin come out. Marcus and Lois watch as Gin gets in his big Chevrolet car and drives off. Gin drives down a deserted unlit road where he sees a light swinging from side to side and the vans up the roadside."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Marcus looks incredulously at Willie who drags on a fag. In a boxing setting Marcus talks to the kid who is his opponent and Marcus looks him over. The kid steps forward and kicks Marcus in the crotch doubling him up. At night Marcus and Lois sit in the van in the deserted mall car park watching the staff entrance and see Gin come out. Marcus and Lois watch as Gin gets in his big Chevrolet car and drives off. Gin drives down a deserted unlit road where he sees a light swinging from side to side and the vans up the roadside."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Kevin looks incredulously at Sarah who drags on a fag. In a boxing setting, Kevin talks to the waiter, who is his opponent, and Kevin looks him over. The waiter steps forward and kicks Kevin in the crotch, doubling him up. He punches the waiter low, whacks Sarah in the balls too, and hits Kevin in the nuts, resulting in all three combatants lying, writhing in agony, on the canvas. Sarah turns to the waiter, and they kick at each other. That night, the plumber has collapsed in front of the TV in the lounge when Sarah and Tom come in and see her. The plumber lies back on the sofa, deathly still, with her mouth agape. They walk a little closer, and Sarah goes over to her. Tom looks on anxiously as Sarah bends over the plumber, then she looks around at Tom, holds her hand in front of the plumber’s mouth, and checks for a heartbeat. The plumber suddenly comes to. Later on, in a bedroom, a black rug is spread out on the floor, with odd discarded clothes lying on it. Nearby, Tom lies on his back in his bra and jeans, while a bare-chested Sarah sits astride him, wearing her jeans and a Santa hat. She leans down and seductively licks from his navel up to his bra, then leans forward and kisses him. She kisses her way back down his body, grips his pants between her teeth, and pulls on them just as the waiter comes in through the door. The waiter hands Sarah a roughly carved bit of wood with a ribbon around it. Mystified, Sarah looks at it and holds up her injured hand, looking moved. Tom props himself up on his elbows. Sarah stares at the pickle, and Tom smiles. Sarah stares at him, looks at him, nods to herself, smiles, and shrugs. The next morning, Sarah is back in her Santa gear and rooting around in the fridge in the kitchen when the waiter runs in. Sarah takes the report card, puts it down, and stops buttering toast. Roger looks down sadly, and Sarah angrily throws down her knife, struck dumb. Roger picks up his report card and heads out of the kitchen. Sarah watches him go, a thoughtful expression crossing her face. At night, Kevin and Linda sit in the van in the deserted mall car park watching the staff entrance and see Ollie come out. Kevin and Linda watch as Ollie gets in his big Chevrolet car and drives off. Ollie drives down a deserted unlit road, where he sees a light swinging from side to side and the vans up the roadside."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Marcus looks incredulously at Willie who drags on a cigar. In a wrestling ring, Marcus talks to the kid, who is his opponent, and Marcus looks him over. The kid steps forward and kicks Marcus in the shin, doubling him up. He punches the kid low, whacks Willie in the ankle too, and hits Marcus in the knee, resulting in all three combatants lying, writhing in agony, on the mat. Willie turns to the kid, and they slap at each other. That night, Grandma has collapsed in front of the radio in the parlor when Willie and Sue come in and see her. Granny lies back on the recliner, deathly still, with her mouth agape. They walk a little closer, and Willie goes over to her. Sue looks on anxiously as Willie bends over Granny, then he looks around at Sue, holds his hand in front of Grandma’s nose, and checks for a pulse. Granny suddenly comes to. Later on, in a study, a colorful tapestry is spread out on the floor, with odd discarded shoes lying on it. Nearby, Sue lies on her back in her blouse and jeans, while a bare-chested Willie sits astride her, wearing his jeans and a reindeer hat. He leans down and seductively licks from her collarbone up to her blouse, then leans forward and kisses her. He kisses his way back down her body, grips her socks between his teeth, and pulls on them just as the kid comes in through the door. The kid hands Willie a roughly carved piece of clay with a ribbon around it. Mystified, Willie looks at it and holds up his injured hand, looking moved. Sue props herself up on her elbows. Willie stares at the apple, and Sue smiles. Willie stares at her, looks at her, nods to himself, smiles, and shrugs. The next morning, Willie is back in his Santa gear and rooting around in the freezer in the pantry when the kid runs in. Willie takes the progress report, puts it down, and stops spreading jam. Thurman looks down sadly, and Willie angrily throws down his fork, struck dumb. Thurman picks up his progress report and heads out of the pantry. Willie watches him go, a thoughtful expression crossing his face. At night, Marcus and Lois sit in the SUV in the deserted market lot watching the employee entrance and see Gin come out. Marcus and Lois watch as Gin gets in his big Jeep and drives off. Gin drives down a deserted unlit path, where he sees a torch swinging from side to side and the trailers up the roadside."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Marcus stares curiously at Willie who juggles with a cigarette. In a boxing setting, Marcus listens to the kid, who is his opponent, and Marcus sizes him up. The kid spins around and nudges Marcus in the knee, twisting him sideways. He nudges the kid low, flicks Willie in the shoulder as well, and taps Marcus on the back, resulting in all three combatants resting, exhausted, on the canvas. Willie gestures to the kid, and they nudge at each other. That night, Grandma has dozed off in front of the TV in the lounge when Willie and Sue stroll in and notice her. Granny snoozes on the sofa, peacefully quiet, with her mouth agape. They edge a little closer, and Willie kneels by her. Sue watches anxiously as Willie peers over Granny, then he glances at Sue, waves his hand in front of Grandma’s mouth, and listens for a sound. Granny suddenly wakes up. Later on, in a bedroom, a black rug is laid out on the floor, with random discarded clothes scattered on it. Nearby, Sue reclines on her back in her bra and jeans, while a bare-chested Willie kneels beside her, wearing his jeans and a Santa hat. He reaches down and gently strokes from her navel up to her bra, then leans forward and whispers to her. He whispers his way back down her body, grips her pants between his fingers, and tugs on them just as the kid strolls in through the door. The kid hands Willie a roughly carved bit of wood with a ribbon around it. Mystified, Willie examines it and raises his injured hand, appearing touched. Sue leans up on her elbows. Willie gazes at the pickle, and Sue grins. Willie gazes at her, examines her, nods to himself, grins, and shrugs. The next morning, Willie is back in his Santa gear and rummaging around in the fridge in the kitchen when the kid dashes in. Willie glances at the report card, puts it down, and pauses stirring coffee. Thurman glances down sadly, and Willie furiously hurls down his spoon, left speechless. Thurman grabs his report card and makes his way out of the kitchen. Willie watches him leave, a reflective expression passing over his face. At night, Marcus and Lois relax in the van in the deserted mall car park observing the staff entrance and notice Gin come out. Marcus and Lois watch as Gin hops in his big Chevrolet car and speeds off. Gin cruises down a deserted unlit road, where he notices a light oscillating and the vans parked along the roadside."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Table looks incredulously at Chair who puffs on a candle. In a gardening setting, Table talks to the bird, who is his adversary, and Table looks it over. The bird steps forward and kicks Table in the stem, doubling it up. It punches the bird low, whacks Chair in the stones too, and hits Table in the marbles, resulting in all three instruments lying, writhing in agony, on the sidewalk. Chair turns to the bird, and they kick at each other. That evening, Aunt has collapsed in front of the bookshelf in the hallway when Chair and Pencil come in and see it. Auntie lies back on the recliner, deathly still, with its mouth open. They walk a little closer, and Chair goes over to it. Pencil looks on anxiously as Chair bends over Auntie, then it looks around at Pencil, holds its hand in front of Aunt’s mouth, and checks for a rhythm. Auntie suddenly comes to. Later on, in a garage, a white curtain is spread out on the ground, with peculiar discarded shoes lying on it. Nearby, Pencil lies on its back in its jacket and shorts, while a bare-chested Chair sits astride it, wearing its shorts and a clown cap. It leans down and seductively licks from its toe up to its jacket, then leans forward and kisses it. It kisses its way back down its body, grips its laces between its teeth, and pulls on them just as the bird comes in through the window. The bird hands Chair a roughly carved chunk of metal with a string around it. Mystified, Chair looks at it and holds up its bandaged elbow, looking moved. Pencil props itself up on its knees. Chair stares at the marshmallow, and Pencil smiles. Chair stares at it, looks at it, nods to itself, smiles, and shrugs. The next morning, Chair is back in its clown outfit and rummaging around in the oven in the pantry when the bird runs in. Chair takes the drawing pad, puts it down, and stops spreading mustard. Bird looks down sadly, and Chair angrily throws down its spoon, struck dumb. Bird picks up its drawing pad and heads out of the pantry. Chair watches it go, a thoughtful expression crossing its face. At night, Table and Fork sit in the truck in the deserted plaza courtyard watching the delivery entrance and see Soda come out. Table and Fork watch as Soda gets in its big Yamaha bike and rolls off. Soda rides down a deserted unlit path, where it sees a lamp swinging from side to side and the trucks by the roadside."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Oliver gazes skeptically at Trevor who lounges on a bench. In a gym setting, Oliver sings to the rabbit, who is his adversary, and Oliver sketches him. The rabbit jumps backward and taps Oliver on the hat, flipping him over. He tosses the rabbit a pillow, smacks Trevor on the kneecaps too, and nudges Oliver on the shoulder, resulting in all three performers sprawling, giggling in enjoyment, on the stage. Trevor turns to the rabbit, and they wink at each other. That evening, Grandpa has slumped in front of the TV in the lounge when Trevor and Lucy come in and spot him. Grandpa reclines on the sofa, peacefully resting, with his mouth closed. They approach a little closer, and Trevor kneels over him. Lucy gazes on nervously as Trevor pats Grandpa, then he gestures to Lucy, waves his hand in front of Grandpa’s eyes, and listens for breathing. Grandpa suddenly wakes up. Later on, in a living room, a yellow blanket is draped over the floor, with various abandoned toys scattered on it. Nearby, Lucy rests on her back in her blouse and skirt, while a shirtless Trevor stands beside her, wearing his jeans and a Santa hat. He bends down and delicately traces from her navel up to her blouse, then bends forward and hugs her. He hugs his way back down her body, grips her scarf between his fingers, and tugs on it just as the rabbit barges in through the door. The rabbit hands Trevor a crudely painted piece of paper with a bow around it. Bewildered, Trevor examines it and raises his bandaged hand, appearing touched. Lucy props herself up on her elbows. Trevor gazes at the trinket, and Lucy laughs. Trevor peers at her, watches her, nods to himself, chuckles, and shrugs. The next morning, Trevor is back in his Santa gear and rummaging through the cupboard in the kitchen when the rabbit hops in. Trevor takes the newspaper, places it down, and halts slicing an apple. Nathan glances down sadly, and Trevor vehemently drops his spoon, rendered speechless. Nathan gathers his newspaper and exits the kitchen. Trevor observes him leave, a pensive look on his face. At night, Oliver and Fiona sit in the truck in the empty mall car park observing the staff entrance and notice Sam amble out. Oliver and Fiona watch as Sam climbs into his massive Ford truck and drives away. Sam travels down a lonely dim road, where he spots a flag waving from side to side and the trucks along the roadside."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Marcus gapes incredulously at Willie who sips on a smoothie. In a library setting, Marcus chats with the kid, who is his rival, and Marcus examines him. The kid steps forward and jabs Marcus in the shin, causing him to wince. He pokes the kid's arm, taps Willie on the shoulder too, and nudges Marcus in the elbow, resulting in all three participants crouching, giggling awkwardly, on the carpet. Willie turns to the kid, and they tug at each other. That night, Grandma has dozed off in front of the radio in the den when Willie and Sue walk in and spot her. Granny reclines on the couch, eerily quiet, with her eyes closed. They inch a little closer, and Willie approaches her. Sue observes nervously as Willie leans over Granny, then he glances at Sue, places his hand near Grandma’s nose, and checks for a pulse. Granny suddenly springs to life. Later on, in a living room, a colorful blanket is sprawled on the floor, with random shoes scattered on it. Nearby, Sue lies on her back in her tank top and shorts, while a shirtless Willie sits beside her, wearing his shorts and a cowboy hat. He leans down and playfully nibbles from her navel up to her tank top, then leans forward and embraces her. He kisses back down her body, grips her scarf between his fingers, and pulls on it just as the kid bursts in through the window. The kid hands Willie a clumsily molded clay figure with a string around it. Confused, Willie examines it and raises his bruised hand, appearing touched. Sue props herself up on her knees. Willie stares at the ornament, and Sue grins. Willie gazes at her, glances at her, nods to himself, grins, and sighs. The next morning, Willie is back in his cowboy gear and rummaging through the pantry in the dining room when the kid dashes in. Willie takes the progress report, sets it aside, and stops peeling an apple. Thurman gazes down dejectedly, and Willie irritatedly throws down his spoon, rendered speechless. Thurman picks up his progress report and exits the dining room. Willie watches him leave, a contemplative expression forming on his face. At night, Marcus and Lois sit in the sedan in the empty shopping center parking lot watching the employee exit and see Gin emerge. Marcus and Lois watch as Gin gets in his massive Volvo car and drives away. Gin drives down a lonely dimly lit street, where he spots a balloon swaying from side to side and the cars along the roadside."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Walter gazes suspiciously at Benny who sips on a soda. In a dance studio, Walter chats with the turtle, who is his partner, and Walter assesses him. The turtle leaps upward and taps Walter on the shoulder, doubling him over. He tickles the turtle softly, slaps Benny on the foot too, and taps Walter on the knee, resulting in all three dancers sprawling, laughing hysterically, on the carpet. Benny turns to the turtle, and they tap dance at each other. That afternoon, Auntie has fainted in front of the fireplace in the attic when Benny and Lisa arrive and spot her. Auntie reclines on the beanbag, eerily quiet, with her eyes wide open. They inch a little nearer, and Benny approaches her. Lisa observes worriedly as Benny leans over Auntie, then he glances at Lisa, places his ear against Auntie’s nose, and listens for a heartbeat. Auntie suddenly awakens. Later in a parlor, a red curtain is draped over the chair, with random scattered books lying on it. Nearby, Lisa reclines on her side in her tank top and leggings, while a shirtless Benny kneels beside her, wearing his shorts and a pirate hat. He leans down and gently blows on her cheek up to her forehead, then leans forward and hugs her. He embraces his way back down her arm, grasps her scarf with his fingers, and pulls on it just as the turtle waddles through the window. The turtle hands Benny a delicately painted stone with a string around it. Confused, Benny examines it and holds up his bandaged knee, looking touched. Lisa props herself up on her knees. Benny gazes at the vase, and Lisa grins. Benny gazes at her, glances at her, nods quietly, grins, and shrugs. The following dawn, Benny is back in his pirate costume and rummaging around in the drawer in the pantry when the turtle waddles in. Benny takes the homework sheet, sets it aside, and pauses making tea. Terry glances down ruefully, and Benny furiously drops his spoon, left speechless. Terry picks up his homework sheet and strolls out of the pantry. Benny watches him leave, a contemplative look passing across his face. At dusk, Walter and Nora sit in the bus in the empty cinema parking lot watching the delivery entrance and spot Alex come out. Walter and Nora watch as Alex hops in his tiny Volkswagen and drives away. Alex cruises down a deserted unlit street, where he spots a balloon floating side to side and the scooters up on the sidewalk."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Marcus and Willie are at a boxing setting where tensions rise when a kid kicks Marcus, and a chaotic scuffle ensues, leaving all three fighters in pain. Later, Willie and Sue find Grandma collapsed in front of the TV, but she revives after Willie checks her. In an intimate scene, Willie and Sue are interrupted by the kid presenting Willie with a carved piece of wood, touching Willie deeply. The next morning, Willie, back in his Santa outfit, reacts with frustration upon seeing Thurman's disappointing report card, showing a moment of concern. Meanwhile, Marcus and Lois stake out a mall parking lot, observing Gin as he leaves in his Chevrolet down an empty road."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Gin drives down a deserted unlit road where he sees a light swinging from side to side and the vans up the roadside Marcus and Lois watch as Gin gets in his big Chevrolet car and drives off At night Marcus and Lois sit in the van in the deserted mall car park watching the staff entrance and see Gin come out Willie watches him go a thoughtful expression crossing his face Thurman picks up his report card and heads out of the kitchen Thurman looks down sadly and Willie angrily throws down his knife struck dumb when the kid runs in Willie takes the report card puts it down and stops buttering toast The next morning Willie is back in his Santa gear and rooting around in the fridge in the kitchen Willie stares at her looks at her nods to himself smiles and shrugs Willie stares at the pickle and Sue smiles Sue props herself up on her elbows Mystified Willie looks at it and holds up his injured hand looking moved The kid hands Willie a roughly carved bit of wood with a ribbon around it He kisses his way back down her body grips her pants between his teeth and pulls on them just as the kid comes in through the door He leans down and seductively licks from her navel up to her bra then leans forward and kisses her Nearby Sue lies on her back in her bra and jeans while a barechested Willie sits astride her wearing his jeans and a Santa hat Later on in a bedroom a black rug is spread out on the floor with odd discarded clothes lying on it Granny suddenly comes to then he looks around at Sue holds his hand in front of Grandma’s mouth and checks for a heartbeat Sue looks on anxiously as Willie bends over Granny They walk a little closer and Willie goes over to her Granny lies back on the sofa deathly still with her mouth agape That night Grandma has collapsed in front of the TV in the lounge when Willie and Sue come in and see her Willie turns to the kid and they kick at each other He punches the kid low whacks Willie in the balls too and hits Marcus in the nuts resulting in all three combatants lying writhing in agony on the canvas The kid steps forward and kicks Marcus in the crotch doubling him up In a boxing setting Marcus talks to the kid who is his opponent and Marcus looks him over Marcus looks incredulously at Willie who drags on a fag"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Willie stares at the pickle and Sue smiles Mystified Willie looks at it and holds up his injured hand looking moved Granny suddenly comes to when the kid runs in Willie takes the report card puts it down and stops buttering toast Gin drives down a deserted unlit road where he sees a light swinging from side to side and the vans up the roadside Granny lies back on the sofa deathly still with her mouth agape That night Grandma has collapsed in front of the TV in the lounge when Willie and Sue come in and see her Later on in a bedroom a black rug is spread out on the floor with odd discarded clothes lying on it He kisses his way back down her body grips her pants between his teeth and pulls on them just as the kid comes in through the door then he looks around at Sue holds his hand in front of Grandma’s mouth and checks for a heartbeat Willie watches him go a thoughtful expression crossing his face Nearby Sue lies on her back in her bra and jeans while a barechested Willie sits astride her wearing his jeans and a Santa hat Willie stares at her looks at her nods to himself smiles and shrugs The kid hands Willie a roughly carved bit of wood with a ribbon around it At night Marcus and Lois sit in the van in the deserted mall car park watching the staff entrance and see Gin come out In a boxing setting Marcus talks to the kid who is his opponent and Marcus looks him over He leans down and seductively licks from her navel up to her bra then leans forward and kisses her The kid steps forward and kicks Marcus in the crotch doubling him up Sue props herself up on her elbows Marcus and Lois watch as Gin gets in his big Chevrolet car and drives off Willie turns to the kid and they kick at each other Thurman looks down sadly and Willie angrily throws down his knife struck dumb They walk a little closer and Willie goes over to her Sue looks on anxiously as Willie bends over Granny Thurman picks up his report card and heads out of the kitchen Marcus looks incredulously at Willie who drags on a fag He punches the kid low whacks Willie in the balls too and hits Marcus in the nuts resulting in all three combatants lying writhing in agony on the canvas The next morning Willie is back in his Santa gear and rooting around in the fridge in the kitchen"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "He kisses his way back down her body grips her pants between his teeth and pulls on them just as the kid comes in through the door The kid hands Willie a roughly carved bit of wood with a ribbon around it Mystified Willie looks at it and holds up his injured hand looking moved Sue props herself up on her elbows Willie stares at the pickle and Sue smiles Willie stares at her looks at her nods to himself smiles and shrugs The next morning Willie is back in his Santa gear and rooting around in the fridge in the kitchen when the kid runs in Willie takes the report card puts it down and stops buttering toast Thurman looks down sadly and Willie angrily throws down his knife struck dumb Thurman picks up his report card and heads out of the kitchen Willie watches him go a thoughtful expression crossing his face At night Marcus and Lois sit in the van in the deserted mall car park watching the staff entrance and see Gin come out Marcus and Lois watch as Gin gets in his big Chevrolet car and drives off Gin drives down a deserted unlit road where he sees a light swinging from side to side and the vans up the roadside Marcus looks incredulously at Willie who drags on a fag In a boxing setting Marcus talks to the kid who is his opponent and Marcus looks him over The kid steps forward and kicks Marcus in the crotch doubling him up He punches the kid low whacks Willie in the balls too and hits Marcus in the nuts resulting in all three combatants lying writhing in agony on the canvas Willie turns to the kid and they kick at each other That night Grandma has collapsed in front of the TV in the lounge when Willie and Sue come in and see her Granny lies back on the sofa deathly still with her mouth agape They walk a little closer and Willie goes over to her Sue looks on anxiously as Willie bends over Granny then he looks around at Sue holds his hand in front of Grandma’s mouth and checks for a heartbeat Granny suddenly comes to Later on in a bedroom a black rug is spread out on the floor with odd discarded clothes lying on it Nearby Sue lies on her back in her bra and jeans while a barechested Willie sits astride her wearing his jeans and a Santa hat He leans down and seductively licks from her navel up to her bra then leans forward and kisses her"
        }
      ]
    }
  ]
}