{
  "ground_truth": "Having smashed the clock and several empties, he sits down on the bed and drinks from a half-full bottle with a cigarette end floating in it. Meanwhile, a smart convertible pulls up at a car valeting service by the beach, and Willie strolls up as the driver hands over the keys. A young guy from the valet service drives off with the convertible, and Willie walks over to a board holding the car keys; he looks around then picks up several of the keys. He saunters through the parking lot pressing the remotes, causing cars to flash and unlock. Willie tosses away the keys nonchalantly and continues unlocking until he walks up to one of the cars he's just unlocked. He then presses another remote and turns to see a blue sports convertible, his eyes brighten, and he goes for that. Climbing in, he opens the glove compartment, takes out the tax disk, reads the address on it, replaces the disk, starts the engine, and drives away. The car is parked outside a grand mansion with a pillared entranceway. Inside, Willie climbs an elegant marble staircase toward a balustrated balcony, and upstairs, in a smart kitchen, he drinks milk from the bottle and replaces it in the well-stocked fridge. He munches on a chicken leg, sits on the toilet, fiddles with the handle of the un-flushing toilet, stands up, and looks at it. Tossing the chicken leg down the pan, he saunters aimlessly down the hallway and tips oil paintings off the wall. On a wood-paneled wall, he sees a large portrait of a boy with dark hair. He peeks behind the painting, removes it from the wall revealing a safe, and sticks his ear to the safe to start turning the combination lock. His eyes catch sight of a companion set by the fireplace; selecting the poker, he attacks the safe and finds lots of money. At an exotic club, he ignores the girl writhing in front of him and rubs a scratch card, looking up as she crawls away. The girl moves towards a second exotic dancer on stage in front of another punter, while Willie continues scratching away as a scantily clad waitress brings beer to him. He places a scratch card in her bikini bottoms. Later, she follows him into his apartment, wanders away as Willie winds back through his phone messages. Marcus and Willie are once again in their festive elf and Santa costumes, striding through a heat shimmer in a car park. Willie pulls his beer down with a cigarette dangling from the corner of his mouth, clutching a bottle of dog in his left hand as he strolls along, removes the cigarette from his mouth, and takes a good pull on his bottle, draining it of its contents.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Having shattered the timepiece and several empties, he reclines down on the bed and sips from a half-full bottle with a cigarette butt suspended in it. Meanwhile, a stylish convertible halts up at a car detailing service by the shore, and Willie ambles up as the operator hands over the keys. A young guy from the valet service drives away with the convertible, and Willie meanders over to a board holding the car keys; he glances around then picks up several of the keys. He strolls through the parking area pressing the remotes, causing vehicles to flash and unlock. Willie tosses away the keys casually and continues unlocking until he approaches one of the cars he's just unlocked. He then presses another remote and turns to see a blue sports convertible, his eyes illuminate, and he goes for that. Climbing in, he opens the glove compartment, takes out the tax disc, reads the address on it, replaces the disc, starts the motor, and drives away. The car is stationed outside a grand mansion with a pillared entryway. Inside, Willie ascends an elegant marble staircase toward a balustraded balcony, and upstairs, in a chic kitchen, he drinks milk from the bottle and replaces it in the well-stocked refrigerator. He chews on a poultry leg, sits on the toilet, fiddles with the handle of the non-flushing toilet, stands up, and looks at it. Tossing the poultry leg down the pan, he strolls aimlessly down the corridor and tips oil portraits off the wall. On a wood-paneled wall, he observes a large depiction of a boy with dark hair. He peeks behind the painting, removes it from the wall revealing a safe, and presses his ear to the safe to start turning the combination lock. His eyes catch sight of a companion set by the hearth; selecting the poker, he attacks the safe and finds lots of cash. At an exotic club, he disregards the girl writhing in front of him and rubs a scratch card, looking up as she crawls away. The girl moves towards a second exotic dancer on stage in front of another patron, while Willie continues scratching away as a scantily clothed waitress brings beer to him. He places a scratch card in her bikini bottoms. Later, she follows him into his apartment, wanders away as Willie winds back through his phone messages. Marcus and Willie are once again in their festive elf and Santa outfits, striding through a heat shimmer in a car park. Willie pulls his beer down with a cigarette dangling from the corner of his mouth, clutching a bottle of dog in his left hand as he strolls along, removes the cigarette from his mouth, and takes a good pull on his bottle, draining it of its contents."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Having smashed the clock and several empties, the clock and several empties are smashed by him; he then sits down on the bed and drinks from a half-full bottle with a cigarette end floating in it. Meanwhile, a car valeting service by the beach is approached by a smart convertible, which pulls up, and the keys are handed over by the driver as Willie strolls up. A young guy from the valet service drives off with the convertible, and Willie walks over to a board holding the car keys; he looks around then picks up several of the keys. Cars are caused to flash and unlock as he saunters through the parking lot pressing the remotes. The keys are tossed away by Willie nonchalantly, and he continues unlocking until a car he's just unlocked is walked up to by him. Another remote is pressed by him, and he turns to see a blue sports convertible; his eyes are brightened by it, and he goes for that. The glove compartment is opened by him after climbing in; the tax disk is taken out, the address on it is read, the disk is replaced, the engine is started, and the car is driven away by him. Outside a grand mansion with a pillared entranceway, the car is parked. Inside, Willie climbs an elegant marble staircase toward a balustrated balcony, and upstairs, in a smart kitchen, milk is drunk from the bottle by him and replaced in the well-stocked fridge. A chicken leg is munched on by him, after which he sits on the toilet, fiddles with the handle of the un-flushing toilet, stands up, and looks at it. The chicken leg is tossed down the pan by him as he saunters aimlessly down the hallway and tips oil paintings off the wall. A large portrait of a boy with dark hair is seen by him on a wood-paneled wall. The painting is peeked behind, removed from the wall by him revealing a safe, and the combination lock is started to be turned as he sticks his ear to the safe. A companion set by the fireplace catches his eyes; the poker is selected by him, and the safe is attacked to find lots of money. At an exotic club, the girl writhing in front of him is ignored by him as he rubs a scratch card, looking up as she crawls away. The girl moves towards a second exotic dancer on stage in front of another punter, while scratching away is continued by Willie as a scantily clad waitress brings beer to him. A scratch card is placed in her bikini bottoms by him. Later, his apartment is entered by her as she follows him in, and she wanders away as Willie winds back through his phone messages. Marcus and Willie are once again in their festive elf and Santa costumes, striding through a heat shimmer in a car park. The beer is pulled down by Willie with a cigarette dangling from the corner of his mouth, a bottle of dog is clutched in his left hand as he strolls along; the cigarette is removed from his mouth, and a good pull on his bottle is taken by him, draining it of its contents."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "After smashing the clock and several bottles, he sits on the bed, drinking from a half-full bottle with a cigarette end in it. Meanwhile, a convertible arrives at a beachside car valeting service. Willie approaches as the driver hands over the keys. A valet drives off with the convertible, and Willie picks up several keys from a board. He wanders through the parking lot, pressing remotes to unlock cars. Tossing keys aside, he continues until he reaches a car he's unlocked. Spotting a blue sports convertible, he brightens and chooses it. Inside, he retrieves the tax disk from the glove compartment, notes the address, replaces it, starts the engine, and drives away. The car is parked outside a grand mansion with a pillared entrance. Inside, Willie ascends a marble staircase to a kitchen, drinks milk from the bottle, and returns it to the fridge. He eats a chicken leg, fiddles with a toilet handle, and tosses the leg into the pan. Wandering the hallway, he tips oil paintings off the wall. Behind a large portrait of a dark-haired boy, he finds a safe, listens to the combination, then uses a poker to open it, discovering money. At an exotic club, he ignores a dancer, scratches a card, and places it in a waitress's bikini. Later, she follows him to his apartment as he checks phone messages. Marcus and Willie, in elf and Santa costumes, walk through a car park. Willie drinks beer with a cigarette in his mouth, holding a bottle of dog, and drains it."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "After smashing the clock and some empties, he sits on the bed, drinking from a half-full bottle with a cigarette end in it. A convertible arrives at a beach valet service, and Willie approaches as the driver hands over the keys. A valet drives off, and Willie picks several keys from a board, unlocking cars by pressing remotes. He discards keys until he finds a blue sports convertible, retrieves the tax disk, notes the address, and drives away. The car stops at a mansion with a pillared entrance. Inside, Willie ascends a marble staircase, drinks milk from the fridge, eats a chicken leg, and fiddles with a toilet handle. He tosses the chicken leg in the toilet, wanders the hallway, and tips paintings. Behind a portrait, he finds a safe, uses a poker to open it, and discovers money. At a club, he ignores a dancer, scratches a card, and places it in a waitress's bikini. She follows him to his apartment as he checks phone messages. Marcus and Willie, in elf and Santa costumes, walk through a car park. Willie drinks beer, cigarette in mouth, and finishes his bottle."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Having completely smashed the clock into pieces and scattered several empty bottles around, he finally sits down heavily on the edge of the bed. He takes a swig from a half-full bottle, which unfortunately has a cigarette end floating in it. Meanwhile, a sleek and stylish convertible car smoothly pulls up at a car valeting service located by the picturesque beach. Willie casually strolls up just as the driver hands over the keys to the valet. A young employee from the valet service then drives off with the convertible, and Willie makes his way over to a board that holds an array of car keys. He glances around cautiously before picking up several sets of keys. As he saunters through the parking lot, he presses the remotes, causing various cars to flash their lights and unlock. Willie tosses away the keys with a nonchalant air and continues his unlocking spree until he approaches one of the cars he has just unlocked. He then presses another remote and turns to see a striking blue sports convertible, his eyes lighting up with interest, and he decides to go for that one. Climbing into the car, he opens the glove compartment, takes out the tax disk, reads the address printed on it, then carefully replaces the disk. He starts the engine and drives away smoothly. The car is soon parked outside a grand and impressive mansion with a pillared entranceway. Inside the mansion, Willie ascends an elegant marble staircase that leads toward a balustraded balcony. Upstairs, in a smart and modern kitchen, he drinks milk straight from the bottle and then places it back in the well-stocked fridge. He munches on a chicken leg, sits on the toilet, fiddles with the handle of the un-flushing toilet, stands up, and looks at it in frustration. Tossing the chicken leg down the pan, he saunters aimlessly down the hallway, casually tipping oil paintings off the wall as he goes. On a wood-paneled wall, he notices a large portrait of a boy with dark hair. He peeks behind the painting, removes it from the wall, revealing a hidden safe, and sticks his ear to the safe to start turning the combination lock. His eyes catch sight of a companion set by the fireplace; selecting the poker, he attacks the safe and discovers a stash of money. At an exotic club, he pays no attention to the girl writhing in front of him and instead focuses on rubbing a scratch card, looking up only as she crawls away. The girl moves towards a second exotic dancer performing on stage in front of another customer, while Willie continues scratching away as a scantily clad waitress brings a beer to him. He places a scratch card in her bikini bottoms. Later, she follows him into his apartment, wandering away as Willie rewinds through his phone messages. Marcus and Willie are once again dressed in their festive elf and Santa costumes, striding through a heat shimmer in a car park. Willie pulls his beer down with a cigarette dangling from the corner of his mouth, clutching a bottle of dog in his left hand as he strolls along. He removes the cigarette from his mouth and takes a good pull on his bottle, draining it of its contents."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Having brutally disassembled the clock into countless fragmented pieces, with numerous empty bottles scattered chaotically around him, he finally lowers himself heavily and wearily onto the very edge of the bed. Taking a deep swig from a half-full bottle, he unfortunately discovers a cigarette end bobbing inside the liquid. Meanwhile, a sleek and impeccably stylish convertible car glides smoothly to a halt at a car valeting service that is conveniently situated near the picturesque and scenic beach. With an air of casual indifference, Willie strolls up just as the driver casually hands over the keys to the valet attendant. Subsequently, a young and eager employee from the valet service hops into the convertible and drives off with professional ease, while Willie makes his way over to a board displaying an impressive array of car keys. He casts a careful, vigilant glance around before deftly picking up several sets of keys. As he saunters through the expansive parking lot, he absent-mindedly presses the remotes, causing various cars to flicker their lights and unlock with ease. Willie nonchalantly tosses the keys aside and continues his unlocking spree with unabated enthusiasm until he eventually approaches one of the cars he has just unlocked. At this point, he presses another remote and turns around, his eyes lighting up with keen interest upon seeing a strikingly beautiful blue sports convertible. It is this captivating car that he decides to claim for himself, climbing into the driver's seat with determination. Once inside, he carefully opens the glove compartment to extract the tax disk, reading the printed address with scrutiny before meticulously returning the disk to its original place. After starting the engine, he drives away with remarkable smoothness. \n\nBefore long, the car is parked outside an imposing and grand mansion characterized by its majestic pillared entranceway. Once inside this luxurious residence, Willie ascends an elegant and sweeping marble staircase that guides him toward a balustraded balcony. Upstairs, within a smart and contemporary kitchen setting, he proceeds to drink milk directly from the bottle, nonchalantly placing it back in the well-stocked fridge afterward. While munching on a chicken leg, he sits upon the toilet, fiddling with the unresponsive handle of the non-flushing toilet, only to stand up moments later in visible frustration. Carelessly discarding the chicken leg down the pan, he ambles aimlessly down the lengthy hallway, casually tipping over opulent oil paintings that adorn the walls as he goes. He notices a prominent and large portrait of a boy with dark hair on a wood-paneled wall. Upon inspecting behind the painting, he removes it from the wall, revealing a hidden safe, to which he presses his ear against as he starts turning the combination lock with keen focus. His attention is momentarily caught by a companion set located by the fireplace, from which he selects the poker to forcefully attack the safe. He successfully discovers a hidden stash of money within. \n\nAt an exotic club, Willie's attention is unwaveringly fixed on scratching a lottery card, paying no heed to the girl seductively writhing in front of him. He only looks up briefly as she crawls away, making her way toward a second exotic dancer who performs provocatively on a stage for another customer. As Willie continues to focus on scratching his card, a scantily clad waitress approaches and brings a beer to him. He places a scratch card playfully into her bikini bottoms. Later, she trails after him into his apartment, wandering off as Willie casually rewinds through his phone messages. Marcus and Willie are once again dressed in their lively and festive elf and Santa costumes, confidently striding through a heat shimmer enveloping a car park. With a cigarette dangling precariously from the corner of his mouth and a bottle of dog securely clutched in his left hand, Willie walks along with a relaxed demeanor. He eventually removes the cigarette from his mouth and takes a substantial pull on his bottle, efficiently draining it of its liquid contents."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "After smashing the clock and several empty bottles, he lowers himself onto the bed, feeling the mattress give slightly under his weight, and lifts a half-full bottle to his lips, taking a swig despite the cigarette end floating inside. Meanwhile, a sleek convertible glides smoothly to a stop at a car valeting service by the beach, and Willie approaches with a casual stride as the driver steps out and hands over the keys. A young valet service employee hops into the convertible and drives it away, leaving Willie to wander over to a board displaying an array of car keys. He glances around, ensuring no one is watching, before deftly picking up several sets of keys. With a leisurely pace, he meanders through the parking lot, pressing the buttons on the remotes, watching as various cars respond by flashing their lights and unlocking. He carelessly tosses aside the keys he no longer needs and continues this process until he stands before one of the cars he has just unlocked. He then presses another remote, and his attention is drawn to a blue sports convertible; his eyes light up with interest, and he decides to make that his target. Climbing into the driver's seat, he opens the glove compartment, retrieves the tax disk, and reads the address printed on it before carefully placing it back. He starts the engine, feeling the car roar to life beneath him, and drives away. The car comes to a stop outside a grand mansion, its pillared entranceway exuding opulence. Inside, Willie ascends an elegant marble staircase, his footsteps echoing as he makes his way toward a balustrated balcony. Upstairs, in a sophisticated kitchen, he grabs a bottle of milk from the well-stocked fridge, takes a swig directly from it, and returns it to its place. He finds a chicken leg, bites into it, and then heads to the bathroom, where he sits on the toilet, fiddling with the handle of the un-flushing toilet before standing up to inspect it. He casually tosses the chicken leg into the toilet bowl and saunters down the hallway, his fingers brushing against the walls as he tips oil paintings off their hooks. On a wood-paneled wall, he notices a large portrait of a boy with dark hair. Curiosity piqued, he peeks behind the painting, removes it from the wall, and reveals a safe. Pressing his ear against the cool metal, he begins to turn the combination lock, but his eyes drift to a companion set by the fireplace. Selecting the poker, he attacks the safe with force, eventually prying it open to discover a stash of money. Later, at an exotic club, he sits indifferent to the girl writhing in front of him, focusing instead on rubbing a scratch card. He glances up briefly as she crawls away, moving toward another exotic dancer performing on stage for a different patron. Willie continues to scratch away at his card, barely acknowledging the scantily clad waitress who brings him a beer. He slips a scratch card into her bikini bottoms as she passes. Later, she follows him into his apartment, but soon wanders off as Willie rewinds through his phone messages. In a different scene, Marcus and Willie are once again dressed in their festive elf and Santa costumes, striding confidently through a heat shimmer in a car park. Willie lowers his beer, a cigarette dangling from the corner of his mouth, and clutches a bottle of dog in his left hand. As he strolls along, he removes the cigarette from his mouth, takes a deep pull from his bottle, and drains it of its contents."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "After smashing the clock and several empty bottles, he sits on the bed, drinking from a half-full bottle with a cigarette end floating in it. Meanwhile, a smart convertible arrives at a beachside car valeting service, where Willie approaches as the driver hands over the keys. A valet drives off with the convertible, and Willie casually picks up several keys from a board, wandering through the parking lot and unlocking cars with the remotes. He discards the keys until he finds a blue sports convertible that catches his eye. Entering the car, he retrieves and reads the tax disk from the glove compartment, then starts the engine and drives to a grand mansion. Inside, he ascends an elegant marble staircase to a smart kitchen, drinks milk from the bottle, and eats a chicken leg. After attempting to fix an un-flushing toilet, he tosses the chicken leg into it and wanders down the hallway, tipping oil paintings off the wall. Discovering a safe behind a large portrait, he uses a poker from a companion set to break it open, finding lots of money. At an exotic club, he ignores a dancer while scratching a card, placing it in a waitress's bikini bottoms as she serves him beer. Later, she follows him to his apartment as he listens to phone messages. Marcus and Willie, dressed in festive elf and Santa costumes, stride through a heat shimmer in a car park. Willie drinks from a bottle, cigarette dangling from his mouth, and finishes it off as he strolls along."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Having smashed the clock, a vintage piece reminiscent of mid-century design, and several empties of various liquor bottles, he sits down on the bed and drinks from a half-full bottle with a cigarette end floating in it, a testament to his disregard for cleanliness. Meanwhile, a smart convertible, a classic red Ferrari known for its speed and elegance, pulls up at a car valeting service by the beach, a popular tourist spot renowned for its pristine sands, and Willie strolls up as the driver, a businessman in a tailored suit, hands over the keys. A young guy from the valet service, wearing a regulation uniform with the company's logo embroidered on the chest, drives off with the convertible, and Willie walks over to a board holding the car keys; he looks around then picks up several of the keys. He saunters through the parking lot, a vast expanse filled with luxury vehicles, pressing the remotes, causing cars to flash and unlock. Willie tosses away the keys nonchalantly, a clear sign of his confidence and familiarity with the trick, and continues unlocking until he walks up to one of the cars he's just unlocked. He then presses another remote and turns to see a blue sports convertible, a rare model known for its unique design, his eyes brighten, and he goes for that. Climbing in, he opens the glove compartment, takes out the tax disk, an official vehicle document required for road use, reads the address on it, replaces the disk, starts the engine, and drives away. The car is parked outside a grand mansion with a pillared entranceway, typical of Georgian architectural style. Inside, Willie climbs an elegant marble staircase, its banister carved with intricate designs, toward a balustrated balcony, and upstairs, in a smart kitchen equipped with the latest appliances, he drinks milk from the bottle and replaces it in the well-stocked fridge, filled with gourmet products. He munches on a chicken leg, likely from a catered meal judging by its presentation, sits on the toilet, fiddles with the handle of the un-flushing toilet, a common issue in older plumbing systems, stands up, and looks at it. Tossing the chicken leg down the pan, he saunters aimlessly down the hallway and tips oil paintings off the wall, works of art suggesting a taste for fine artistry. On a wood-paneled wall, he sees a large portrait of a boy with dark hair, perhaps a family heirloom. He peeks behind the painting, removes it from the wall revealing a safe, and sticks his ear to the safe to start turning the combination lock, a technique often seen in heist films. His eyes catch sight of a companion set by the fireplace, an antique that complements the room's decor; selecting the poker, he attacks the safe and finds lots of money, crisp bills bound in neat stacks. At an exotic club, famous for its nightly performances drawing crowds from all around the city, he ignores the girl writhing in front of him and rubs a scratch card, a pastime associated with gambling addictions, looking up as she crawls away. The girl moves towards a second exotic dancer on stage in front of another punter, while Willie continues scratching away as a scantily clad waitress brings beer to him, her tray balancing precariously as she maneuvers through the dimly lit room. He places a scratch card in her bikini bottoms, a brazen act met with a playful smile. Later, she follows him into his apartment, which is cluttered with mementos of past escapades, wanders away as Willie winds back through his phone messages, a collection of missed calls and voicemails from people in his chaotic life. Marcus and Willie are once again in their festive elf and Santa costumes, striding through a heat shimmer in a car park, the temperature soaring despite the season. Willie pulls his beer down with a cigarette dangling from the corner of his mouth, clutching a bottle of dog, a potent British brew, in his left hand as he strolls along, removes the cigarette from his mouth, and takes a good pull on his bottle, draining it of its contents with the ease of someone long accustomed to heavy drinking."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Having smashed the clock and several empties he sits down on the bed and drinks from a halffull bottle with a cigarette end floating in it  Meanwhile a smart convertible pulls up at a car valeting service by the beach and Willie strolls up as the driver hands over the keys  A young guy from the valet service drives off with the convertible and Willie walks over to a board holding the car keys  He munches on a chicken leg sits on the toilet fiddles with the handle of the unflushing toilet stands up and looks at it  Tossing the chicken leg down the pan he saunters aimlessly down the hallway and tips oil paintings off the wall  On a woodpaneled wall he sees a large portrait of a boy with dark hair  He peeks behind the painting removes it from the wall revealing a safe and sticks his ear to the safe to start turning the combination lock  His eyes catch sight of a companion set by the fireplace selecting the poker  he attacks the safe and finds lots of money  At an exotic club he ignores the girl writhing in front of him and rubs a scratch card looking up as she crawls away  The girl moves towards a second exotic dancer on stage in front of another punter while Willie continues scratching away as a scantily clad waitress brings beer to him  He places a scratch card in her bikini bottoms  Later she follows him into his apartment wanders away as Willie winds back through his phone messages  Marcus and Willie are once again in their festive elf and Santa costumes  striding through a heat shimmer in a car park  he looks around then picks up several of the keys  He saunters through the parking lot pressing the remotes causing cars to flash and unlock  Willie tosses away the keys nonchalantly and continues unlocking until he walks up to one of the cars he's just unlocked  He then presses another remote and turns to see a blue sports convertible his eyes brighten and he goes for that  Climbing in he opens the glove compartment takes out the tax disk reads the address on it replaces the disk starts the engine and drives away  The car is parked outside a grand mansion with a pillared entranceway  Inside Willie climbs an elegant marble staircase toward a balustrated balcony and upstairs in a smart kitchen he drinks milk from the bottle and replaces it in the wellstocked fridge  He munches on a chicken leg sits on the toilet fiddles with the handle of the unflushing toilet stands up and looks at it  Tossing the chicken leg down the pan he saunters aimlessly down the hallway and tips oil paintings off the wall  On a woodpaneled wall he sees a large portrait of a boy with dark hair  He peeks behind the painting removes it from the wall revealing a safe and sticks his ear to the safe to start turning the combination lock  His eyes catch sight of a companion set by the fireplace selecting the poker  he attacks the safe and finds lots of money  At an exotic club he ignores the girl writhing in front of him and rubs a scratch card looking up as she crawls away  The girl moves towards a second exotic dancer on stage in front of another punter while Willie continues scratching away as a scantily clad waitress brings beer to him  He places a scratch card in her bikini bottoms  Later she follows him into his apartment wanders away as Willie winds back through his phone messages  Marcus and Willie are once again in their festive elf and Santa costumes  striding through a heat shimmer in a car park  Willie pulls his beer down with a cigarette dangling from the corner of his mouth clutching a bottle of dog in his left hand as he strolls along removes the cigarette from his mouth and takes a good pull on his bottle draining it of its contents"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Having smashed the clock and several empties he sits down on the bed and drinks from a halffull bottle with a cigarette end floating in it. Meanwhile a smart convertible pulls up at a car valeting service by the beach and Willie strolls up as the driver hands over the keys. A young guy from the valet service drives off with the convertible and Willie walks over to a board holding the car keys. he looks around then picks up several of the keys. He saunters through the parking lot pressing the remotes causing cars to flash and unlock. Willie tosses away the keys nonchalantly and continues unlocking until he walks up to one of the cars he is just unlocked. He then presses another remote and turns to see a blue sports convertible his eyes brighten and he goes for that. Climbing in he opens the glove compartment takes out the tax disk reads the address on it replaces the disk starts the engine and drives away. The car is parked outside a grand mansion with a pillared entranceway. Inside Willie climbs an elegant marble staircase toward a balustrated balcony and upstairs in a smart kitchen he drinks milk from the bottle and replaces it in the wellstocked fridge. He munches on a chicken leg sits on the toilet fiddles with the handle of the unflushing toilet stands up and looks at it. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Tossing the chicken leg down the pan he saunters aimlessly down the hallway and tips oil paintings off the wall. On a woodpaneled wall he sees a large portrait of a boy with dark hair. He peeks behind the painting removes it from the wall revealing a safe and sticks his ear to the safe to start turning the combination lock. His eyes catch sight of a companion set by the fireplace selecting the poker. he attacks the safe and finds lots of money. At an exotic club he ignores the girl writhing in front of him and rubs a scratch card looking up as she crawls away. The girl moves towards a second exotic dancer on stage in front of another punter while Willie continues scratching away as a scantily clad waitress brings beer to him. He places a scratch card in her bikini bottoms. Later she follows him into his apartment wanders away as Willie winds back through his phone messages. Marcus and Willie are once again in their festive elf and Santa costumes. striding through a heat shimmer in a car park. Willie pulls his beer down with a cigarette dangling from the corner of his mouth clutching a bottle of dog in his left hand as he strolls along removes the cigarette from his mouth and takes a good pull on his bottle draining it of its contents."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Having smashed the clock and several empties he sits down on the bed and drinks from a halffull bottle with a cigarette end floating in it. Meanwhile a smart convertible pulls up at a car valeting service by the beach and Willie strolls up as the driver hands over the keys. A young guy from the valet service drives off with the convertible and Willie walks over to a board holding the car keys. he looks around then picks up several of the keys. He saunters through the parking lot pressing the remotes causing cars to flash and unlock. Willie tosses away the keys nonchalantly and continues unlocking until he walks up to one of the cars he is just unlocked. He then presses another remote and turns to see a blue sports convertible his eyes brighten and he goes for that. Climbing in he opens the glove compartment takes out the tax disk reads the address on it replaces the disk starts the engine and drives away. The car is parked outside a grand mansion with a pillared entranceway. Inside Willie climbs an elegant marble staircase toward a balustrated balcony and upstairs in a smart kitchen he drinks milk from the bottle and replaces it in the wellstocked fridge. He munches on a chicken leg sits on the toilet fiddles with the handle of the unflushing toilet stands up and looks at it. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. Tossing the chicken leg down the pan he saunters aimlessly down the hallway and tips oil paintings off the wall. On a woodpaneled wall he sees a large portrait of a boy with dark hair. He peeks behind the painting removes it from the wall revealing a safe and sticks his ear to the safe to start turning the combination lock. His eyes catch sight of a companion set by the fireplace selecting the poker. he attacks the safe and finds lots of money. At an exotic club he ignores the girl writhing in front of him and rubs a scratch card looking up as she crawls away. The girl moves towards a second exotic dancer on stage in front of another punter while Willie continues scratching away as a scantily clad waitress brings beer to him. He places a scratch card in her bikini bottoms. Later she follows him into his apartment wanders away as Willie winds back through his phone messages. Marcus and Willie are once again in their festive elf and Santa costumes. striding through a heat shimmer in a car park. Willie pulls his beer down with a cigarette dangling from the corner of his mouth clutching a bottle of dog in his left hand as he strolls along removes the cigarette from his mouth and takes a good pull on his bottle draining it of its contents."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Having smashed the clock and several empties he sits down on the bed and drinks from a halffull bottle with a cigarette end floating in it. Meanwhile a smart convertible pulls up at a car valeting service by the beach and Willie strolls up as the driver hands over the keys. A young guy from the valet service drives off with the convertible and Willie walks over to a board holding the car keys. he looks around then picks up several of the keys. He saunters through the parking lot pressing the remotes causing cars to flash and unlock. Willie tosses away the keys nonchalantly and continues unlocking until he walks up to one of the cars he is just unlocked. The girl moves towards a second exotic dancer on stage in front of another punter while Willie continues scratching away as a scantily clad waitress brings beer to him. He places a scratch card in her bikini bottoms. Later she follows him into his apartment wanders away as Willie winds back through his phone messages. Marcus and Willie are once again in their festive elf and Santa costumes. striding through a heat shimmer in a car park. Willie pulls his beer down with a cigarette dangling from the corner of his mouth clutching a bottle of dog in his left hand as he strolls along removes the cigarette from his mouth and takes a good pull on his bottle draining it of its contents."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Having smashed the clock and several empties he sits down on the bed and drinks from a halffull bottle with a cigarette end floating in it. Meanwhile a smart convertible pulls up at a car valeting service by the beach and Willie strolls up as the driver hands over the keys. Marcus and Willie are once again in their festive elf and Santa costumes. striding through a heat shimmer in a car park. Willie pulls his beer down with a cigarette dangling from the corner of his mouth clutching a bottle of dog in his left hand as he strolls along removes the cigarette from his mouth and takes a good pull on his bottle draining it of its contents."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Having smashed the clock and several empties, the dog sits down on the bed and drinks from a half-full bottle with a cigarette end floating in it. Meanwhile, a giraffe pulls up at a car valeting service by the beach, and a penguin strolls up as the driver hands over the keys. A squirrel from the valet service drives off with the convertible, and the penguin walks over to a board holding the car keys; the penguin looks around then picks up several of the keys. The penguin saunters through the parking lot pressing the remotes, causing cars to flash and unlock. The penguin tosses away the keys nonchalantly and continues unlocking until it walks up to one of the cars it's just unlocked. The penguin then presses another remote and turns to see a blue sports convertible, its eyes brighten, and it goes for that. Climbing in, it opens the glove compartment, takes out the tax disk, reads the address on it, replaces the disk, starts the engine, and drives away. The car is parked outside a grand mansion with a pillared entranceway. Inside, the penguin climbs an elegant marble staircase toward a balustrated balcony, and upstairs, in a smart kitchen, it drinks milk from the bottle and replaces it in the well-stocked fridge. It munches on a chicken leg, sits on the toilet, fiddles with the handle of the un-flushing toilet, stands up, and looks at it. Tossing the chicken leg down the pan, it saunters aimlessly down the hallway and tips oil paintings off the wall. On a wood-paneled wall, it sees a large portrait of a boy with dark hair. It peeks behind the painting, removes it from the wall revealing a safe, and sticks its ear to the safe to start turning the combination lock. Its eyes catch sight of a companion set by the fireplace; selecting the poker, it attacks the safe and finds lots of money. At an exotic club, it ignores the girl writhing in front of it and rubs a scratch card, looking up as she crawls away. The girl moves towards a second exotic dancer on stage in front of another punter, while the penguin continues scratching away as a scantily clad waitress brings beer to it. It places a scratch card in her bikini bottoms. Later, she follows the penguin into its apartment, wanders away as the penguin winds back through its phone messages. Marcus and a koala are once again in their festive elf and Santa costumes, striding through a heat shimmer in a car park. The koala pulls its beer down with a cigarette dangling from the corner of its mouth, clutching a bottle of dog in its left hand as it strolls along, removes the cigarette from its mouth, and takes a good pull on its bottle, draining it of its contents."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Having smashed the mirror and several glasses, he sits down on the couch and drinks from a half-full cup with a leaf floating in it. Meanwhile, a sleek bicycle pulls up at a shoe repair shop by the river, and Willie strolls up as the rider hands over the helmet. A young guy from the repair service rides off with the bicycle, and Willie walks over to a shelf holding the helmets; he looks around then picks up several of the helmets. He saunters through the parking garage pressing the remotes, causing bikes to beep and unlock. Willie tosses away the helmets nonchalantly and continues unlocking until he walks up to one of the bicycles he's just unlocked. He then presses another remote and turns to see a red tandem bike, his eyes brighten, and he goes for that. Climbing in, he opens the storage basket, takes out a map, reads the address on it, replaces the map, starts pedaling, and rides away. The bicycle is parked outside a towering skyscraper with a revolving door. Inside, Willie climbs a grand spiral staircase toward a glass balcony, and upstairs, in a modern dining room, he drinks orange juice from the carton and replaces it in the empty fruit bowl. He munches on a celery stick, sits on the bidet, fiddles with the handle of the un-working bidet, stands up, and looks at it. Tossing the celery stick down the drain, he saunters aimlessly down the corridor and tips sculptures off the pedestal. On a stone-tiled wall, he sees a large painting of a girl with blond hair. He peeks behind the painting, removes it from the wall revealing a cabinet, and sticks his ear to the cabinet to start turning the combination lock. His eyes catch sight of a shovel set by the bookshelf; selecting the shovel, he attacks the cabinet and finds lots of jewelry. At an eclectic café, he ignores the woman dancing in front of him and solves a crossword puzzle, looking up as she dances away. The woman moves towards a second performer on stage in front of another diner, while Willie continues solving as a casually dressed waiter brings tea to him. He places the crossword puzzle in his pocket. Later, the waiter follows him into his studio, wanders away as Willie winds back through his phone messages. Marcus and Willie are once again in their festive pirate and knight costumes, striding through a heat haze in a bus terminal. Willie pulls his lemonade down with a straw dangling from the corner of his mouth, clutching a can of fish in his left hand as he strolls along, removes the straw from his mouth, and takes a good pull on his can, draining it of its contents."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Having taped the clock and several empties, he lies down on the bed and fiddles with a half-full bottle with a cigarette end floating in it. Meanwhile, a smart convertible idles at a car valeting service by the beach, and Willie skips over as the driver waves the keys. A young guy from the valet service fiddles with the convertible, and Willie gazes over at a board holding the car keys; he glances around then juggles several of the keys. He skips through the parking lot tapping the remotes, causing cars to honk and lock. Willie flings away the keys nonchalantly and continues locking until he skips up to one of the cars he's just locked. He then taps another remote and turns to see a blue sports convertible, his eyes narrow, and he lounges for that. Hopping in, he shuts the glove compartment, takes out the tax disk, glances at the address on it, hides the disk, stalls the engine, and walks away. The car is parked outside a grand mansion with a pillared entranceway. Inside, Willie leaps an elegant marble staircase toward a balustrated balcony, and upstairs, in a smart kitchen, he spills milk from the bottle and leaves it in the well-stocked fridge. He tosses a chicken leg, sits on the toilet, plays with the handle of the un-flushing toilet, bends down, and kicks at it. Tossing the chicken leg down the pan, he dashes aimlessly down the hallway and dots oil paintings with the wall. On a wood-paneled wall, he traces a large portrait of a boy with dark hair. He creeps behind the painting, sticks it on the wall revealing a safe, and slaps his ear to the safe to start smashing the combination lock. His eyes catch sight of a companion set by the fireplace; selecting the poker, he taps the safe and ignores lots of money. At an exotic club, he praises the girl writhing in front of him and folds a scratch card, looking down as she skips away. The girl dances towards a second exotic dancer on stage in front of another punter, while Willie continues folding away as a scantily clad waitress hands coffee to him. He places a scratch card in her bikini bottoms. Later, she hides from him into his apartment, leaps away as Willie scrolls through his phone messages. Marcus and Willie are once again in their festive elf and Santa costumes, skipping through a heat shimmer in a car park. Willie spills his beer down with a cigarette dangling from the corner of his mouth, dropping a bottle of dog in his left hand as he spins along, places the cigarette above his mouth, and gives a slight glance at his bottle, filling it with its contents."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Having smashed the biscuit and several jump ropes, the stapler sits down on the car seat and drinks from a half-full trophy with a bookend floating in it. Meanwhile, a smart dinosaur pulls up at a surfboard waxing service by the mountain, and a bottle cap strolls up as the umbrella hands over the mittens. A young elephant from the waxing service drives off with the dinosaur, and the bottle cap walks over to a table holding the piano sheets; the stapler looks around then picks up several of the sheets. The stapler saunters through the meadow pressing the crayons, causing guitars to flash and unlock. The stapler tosses away the sheets nonchalantly and continues unlocking until it walks up to one of the guitars it's just unlocked. The stapler then presses another crayon and turns to see a blue kite snowboard, their eyes brighten, and the stapler goes for that. Climbing in, it opens the sock drawer, takes out the library card, reads the address on it, replaces the card, starts the blender, and paddles away. The snowboard is parked outside a grand pumpkin with a pillared drawbridge. Inside, the stapler climbs an elegant marble ottoman toward a balustrated diving board, and upstairs, in a smart workshop, it drinks tea from the mug and replaces it in the well-stocked cupboard. The stapler munches on a pizza slice, sits on the hammock, fiddles with the handle of the un-flushing wheelbarrow, stands up, and looks at it. Tossing the pizza slice down the pond, the stapler saunters aimlessly down the field and tips wind chimes off the branch. On a wood-paneled ceiling, it sees a large portrait of a giraffe with dark hooves. The stapler peeks behind the portrait, removes it from the ceiling revealing a basket, and sticks its ear to the basket to start turning the camera lens. Its eyes catch sight of a chessboard set by the trampoline; selecting the bishop, it attacks the basket and finds lots of buttons. At an exotic bakery, it ignores the turtle writhing in front of it and rubs a coaster, looking up as the turtle crawls away. The turtle moves towards a second exotic sloth on stage in front of another radiator, while the stapler continues rubbing away as a scantily clad hedge trimmer brings lemonade to it. It places a coaster in the trimmer's toolbox. Later, the trimmer follows it into its greenhouse, wanders away as the stapler winds back through its radio stations. A screwdriver and the stapler are once again in their festive cat and pumpkin costumes, striding through a heat shimmer in a garage. The stapler pulls its lemonade down with a feather dangling from the corner of its mouth, clutching a jar of pancake in its left hand as it strolls along, removes the feather from its mouth, and takes a good pull on its jar, draining it of its contents."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Having tapped the clock and several empties, the dog lies down on the bed and sips from a half-full bottle with a cigarette end floating in it. Meanwhile, an ancient bicycle rolls up to a car valeting service by the beach, and Lucy prances up as the rider hands over the keys. A young cat from the valet service pedals away with the bicycle, and Lucy meanders over to a board holding the car keys; she glances around then grabs several of the keys. She skips through the parking lot pressing the remotes, causing cars to blink and unlock. Lucy flings away the keys carelessly and continues unlocking until she waltzes up to one of the cars she's just unlocked. She then presses another remote and turns to see a yellow sports convertible, her eyes widen, and she dances for that. Clambering in, she opens the glove compartment, pulls out the tax disk, studies the address on it, places the disk back, starts the engine, and cruises away. The car is stationed outside a humble cottage with a wooden entranceway. Inside, Lucy ascends an elegant marble staircase toward a balustrated balcony, and upstairs, in a modest kitchen, she sips milk from the bottle and returns it to the well-stocked fridge. She nibbles on a carrot stick, perches on the toilet, tinkers with the handle of the un-flushing toilet, stands up, and examines it. Dropping the carrot stick down the pan, she skips aimlessly down the hallway and nudges oil paintings off the wall. On a wood-paneled wall, she notices a large portrait of a girl with red hair. She peers behind the painting, detaches it from the wall revealing a safe, and presses her ear to the safe to start twisting the combination lock. Her eyes catch sight of a vase set by the fireplace; choosing the poker, she strikes the safe and uncovers lots of coins. At a tropical market, she overlooks the girl twirling in front of her and scribbles on a scratch card, glancing up as the girl scampers away. The girl moves towards a second street performer on stage in front of another observer, while Lucy continues scribbling away as a barely clad magician offers a drink to her. She places a scratch card in his suspenders. Later, he trails her into his apartment, drifts away as Lucy scrolls back through her phone messages. Marcus and Lucy are once again in their festive elf and Santa costumes, gliding through a fog shimmer in a car park. Lucy pulls her soda down with a toothpick dangling from the corner of her mouth, holding a bottle of cat in her left hand as she prances along, removes the toothpick from her mouth, and takes a good sip from her bottle, emptying it of its contents."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Having tossed the lantern and several books, he sprawls on the couch and sips from a half-empty can with a coffee bean floating in it. Meanwhile, a shiny bicycle rolls up at a bicycle repair shop by the lake, and Willie meanders up as the cyclist passes over the helmet. A young woman from the repair shop pedals away with the bicycle, and Willie saunters over to a rack holding the helmets; he glances around then picks up several of the helmets. He ambles through the garden pressing the buttons, causing lights to flicker and blink. Willie throws away the helmets carelessly and continues blinking lights until he approaches one of the bikes he’s just illuminated. He then taps another button and turns to see a red racing bicycle, his eyes twinkle, and he reaches for that. Climbing on, he opens the saddlebag, takes out the notebook, reads the notes in it, replaces the notebook, kicks the pedal, and cycles away. The bike is parked outside a magnificent villa with a gated entrance. Inside, Willie ascends a wooden spiral staircase toward a railed balcony, and upstairs, in a posh kitchen, he sips juice from a glass and places it in the fully-stocked pantry. He chews on a breadstick, sits on the bathtub, twirls the faucet of the dripping sink, stands up, and peers at it. Tossing the breadstick down the drain, he shuffles aimlessly down the corridor and nudges sculptures off the table. On a wallpaper-covered wall, he spots a large mural of a ship with white sails. He peeks behind the mural, takes it off the wall revealing a cabinet, and presses his ear to the cabinet to start twisting the doorknob. His eyes catch sight of a chess set by the bookshelf; selecting a rook, he strikes the cabinet and discovers lots of jewelry. At a tropical beach party, he disregards the man dancing in front of him and scratches a lottery ticket, glancing up as he grooves away. The man moves towards a second performer on stage in front of another guest, while Willie continues scratching off as a lightly dressed server brings cocktails to him. He slips a lottery ticket into her skirt pocket. Later, she follows him into his flat, meanders away as Willie rewinds through his voicemail. Marcus and Willie are once again in their seasonal reindeer and snowman costumes, marching through a mirage in a field. Willie lowers his coffee with a straw tucked into the side of his mouth, gripping a cup of tea in his right hand as he ambles along, removes the straw from his mouth, and takes a good sip from his cup, draining it of its contents."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "After demolishing the lamp and several cushions, she perches on the bench and sips from a half-empty mug with a leaf floating in it. Meanwhile, a rusted tricycle rolls up at a plant nursery by the mountain, and Lila skips up as the gardener hands over the hose. An elderly lady from the nursery pedals away with the tricycle, and Lila jumps over to a shelf holding the flower pots; she glances around then picks up several of the pots. She dances through the flower beds pressing the sprinklers, causing flowers to bloom and sway. Lila tosses away the pots carelessly and continues watering until she skips up to one of the flowers she's just watered. She then presses another sprinkler and turns to see a red rose bloom, her eyes twinkle, and she reaches for that. Crawling in, she opens the utility drawer, takes out a seed packet, reads the instructions on it, replaces the packet, starts the sprinkler, and pedals away. The tricycle is parked outside a quaint cottage with a vine-covered porch. Inside, Lila climbs a spiral wooden staircase toward a stained-glass window, and upstairs, in a rustic pantry, she pours lemonade from the pitcher and puts it back in the fruit-laden basket. She nibbles on a bread roll, sits on the stool, tinkers with the handle of the creaky door, stands up, and stares at it. Tossing the bread roll toward the window, she dances aimlessly down the hallway and adjusts photos off the shelf. On a brick wall, she spots a small painting of a cat with white fur. She peeks behind the painting, removes it from the wall revealing a drawer, and presses her ear to the drawer to start turning the key. Her eyes catch sight of a candlestick by the bookshelf; selecting the broom, she attacks the drawer and finds lots of letters. At a bustling market, she ignores the chef cooking in front of her and rubs a lottery ticket, looking up as he walks away. The chef moves towards a second vendor on stage in front of another customer, while Lila continues scratching away as a colorfully dressed waitress brings lemonade to her. She places a lottery ticket in her apron pocket. Later, she follows him into his cottage, wanders away as Lila scrolls back through her phone contacts. Marcus and Lila are once again in their bright farmer and scarecrow costumes, skipping through a sunbeam in a garden. Lila pulls her lemonade down with a twig dangling from the corner of her mouth, holding a basket of fruit in her left hand as she skips along, removes the twig from her mouth, and takes a deep sip from her basket, savoring its contents."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "The scene opens with a man sitting on the bed drinking from a bottle. Meanwhile, Willie arrives at a car valeting service, picks several car keys, and unlocks a blue sports convertible. Discovering an address in the glove compartment, he drives to an opulent mansion, where he drinks from the fridge, eats a chicken leg, and attempts to open a safe revealed behind a portrait. Using a poker, he retrieves money from the safe and then heads to an exotic club. There, he ignores the dancers, focusing on a scratch card and tipping a waitress. Lastly, Willie, with Marcus, returns to their elf and Santa costumes, walking through a car park while smoking and drinking."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Willie pulls his beer down with a cigarette dangling from the corner of his mouth clutching a bottle of dog in his left hand as he strolls along removes the cigarette from his mouth and takes a good pull on his bottle draining it of its contents striding through a heat shimmer in a car park  Marcus and Willie are once again in their festive elf and Santa costumes  Later she follows him into his apartment wanders away as Willie winds back through his phone messages  He places a scratch card in her bikini bottoms  The girl moves towards a second exotic dancer on stage in front of another punter while Willie continues scratching away as a scantily clad waitress brings beer to him  At an exotic club he ignores the girl writhing in front of him and rubs a scratch card looking up as she crawls away  he attacks the safe and finds lots of money  His eyes catch sight of a companion set by the fireplace selecting the poker  He peeks behind the painting removes it from the wall revealing a safe and sticks his ear to the safe to start turning the combination lock  On a woodpaneled wall he sees a large portrait of a boy with dark hair  Tossing the chicken leg down the pan he saunters aimlessly down the hallway and tips oil paintings off the wall  He munches on a chicken leg sits on the toilet fiddles with the handle of the unflushing toilet stands up and looks at it  Inside Willie climbs an elegant marble staircase toward a balustrated balcony and upstairs in a smart kitchen he drinks milk from the bottle and replaces it in the wellstocked fridge  The car is parked outside a grand mansion with a pillared entranceway  Climbing in he opens the glove compartment takes out the tax disk reads the address on it replaces the disk starts the engine and drives away  He then presses another remote and turns to see a blue sports convertible his eyes brighten and he goes for that  Willie tosses away the keys nonchalantly and continues unlocking until he walks up to one of the cars he's just unlocked  He saunters through the parking lot pressing the remotes causing cars to flash and unlock  he looks around then picks up several of the keys  A young guy from the valet service drives off with the convertible and Willie walks over to a board holding the car keys  Meanwhile a smart convertible pulls up at a car valeting service by the beach and Willie strolls up as the driver hands over the keys  Having smashed the clock and several empties he sits down on the bed and drinks from a halffull bottle with a cigarette end floating in it "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "The girl moves towards a second exotic dancer on stage in front of another punter while Willie continues scratching away as a scantily clad waitress brings beer to him  Climbing in he opens the glove compartment takes out the tax disk reads the address on it replaces the disk starts the engine and drives away  Later she follows him into his apartment wanders away as Willie winds back through his phone messages  Tossing the chicken leg down the pan he saunters aimlessly down the hallway and tips oil paintings off the wall  He saunters through the parking lot pressing the remotes causing cars to flash and unlock  he attacks the safe and finds lots of money  Willie pulls his beer down with a cigarette dangling from the corner of his mouth clutching a bottle of dog in his left hand as he strolls along removes the cigarette from his mouth and takes a good pull on his bottle draining it of its contents Inside Willie climbs an elegant marble staircase toward a balustrated balcony and upstairs in a smart kitchen he drinks milk from the bottle and replaces it in the wellstocked fridge  He then presses another remote and turns to see a blue sports convertible his eyes brighten and he goes for that  At an exotic club he ignores the girl writhing in front of him and rubs a scratch card looking up as she crawls away  Meanwhile a smart convertible pulls up at a car valeting service by the beach and Willie strolls up as the driver hands over the keys  striding through a heat shimmer in a car park  On a woodpaneled wall he sees a large portrait of a boy with dark hair  he looks around then picks up several of the keys  A young guy from the valet service drives off with the convertible and Willie walks over to a board holding the car keys  Marcus and Willie are once again in their festive elf and Santa costumes  He munches on a chicken leg sits on the toilet fiddles with the handle of the unflushing toilet stands up and looks at it  He peeks behind the painting removes it from the wall revealing a safe and sticks his ear to the safe to start turning the combination lock  Willie tosses away the keys nonchalantly and continues unlocking until he walks up to one of the cars he's just unlocked  Having smashed the clock and several empties he sits down on the bed and drinks from a halffull bottle with a cigarette end floating in it  The car is parked outside a grand mansion with a pillared entranceway  He places a scratch card in her bikini bottoms  His eyes catch sight of a companion set by the fireplace selecting the poker "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "On a woodpaneled wall he sees a large portrait of a boy with dark hair  He peeks behind the painting removes it from the wall revealing a safe and sticks his ear to the safe to start turning the combination lock  His eyes catch sight of a companion set by the fireplace selecting the poker  he attacks the safe and finds lots of money  At an exotic club he ignores the girl writhing in front of him and rubs a scratch card looking up as she crawls away  The girl moves towards a second exotic dancer on stage in front of another punter while Willie continues scratching away as a scantily clad waitress brings beer to him  He places a scratch card in her bikini bottoms  Later she follows him into his apartment wanders away as Willie winds back through his phone messages  Marcus and Willie are once again in their festive elf and Santa costumes  striding through a heat shimmer in a car park  Willie pulls his beer down with a cigarette dangling from the corner of his mouth clutching a bottle of dog in his left hand as he strolls along removes the cigarette from his mouth and takes a good pull on his bottle draining it of its contents Having smashed the clock and several empties he sits down on the bed and drinks from a halffull bottle with a cigarette end floating in it  Meanwhile a smart convertible pulls up at a car valeting service by the beach and Willie strolls up as the driver hands over the keys  A young guy from the valet service drives off with the convertible and Willie walks over to a board holding the car keys  he looks around then picks up several of the keys  He saunters through the parking lot pressing the remotes causing cars to flash and unlock  Willie tosses away the keys nonchalantly and continues unlocking until he walks up to one of the cars he's just unlocked  He then presses another remote and turns to see a blue sports convertible his eyes brighten and he goes for that  Climbing in he opens the glove compartment takes out the tax disk reads the address on it replaces the disk starts the engine and drives away  The car is parked outside a grand mansion with a pillared entranceway  Inside Willie climbs an elegant marble staircase toward a balustrated balcony and upstairs in a smart kitchen he drinks milk from the bottle and replaces it in the wellstocked fridge  He munches on a chicken leg sits on the toilet fiddles with the handle of the unflushing toilet stands up and looks at it  Tossing the chicken leg down the pan he saunters aimlessly down the hallway and tips oil paintings off the wall "
        }
      ]
    }
  ]
}