{
  "ground_truth": "Marcus leans forward and glances at Willie, rubbing his chin thoughtfully as Gin gets up from the table and leaves. Marcus and Willie regard each other, with Willie resignedly resting his head on his hand while Marcus slips into a brooding silence. The next day, a very large queue of excited children and their mothers forms at the western-themed Christmas Corral Grotto. A semi-comatose Santa lies on the escalator clutching a broken bottle as Marcus, back in elf guise, tries to calm the kids. At the top of the escalator, Santa drunkenly gets to his feet and lurches slowly towards the grotto, bumping into one of the kids as he does so, before keeling over and collapsing on top of a fake cactus and a sack of presents. The kids and moms gasp as Santa rallies and gets on his feet, only to fall over a life-size model donkey, falling on his back and seeing a second donkey going over. He scrambles to his feet and slugs the donkey with a big right hook, knocking its head off, then punches and kicks the donkey's body to bits in a display of drunken violence. The moms hurriedly usher their offspring away as Gin strides up, drops Willie, and drags him away. Later on, Willie is back at the kid's house in the garage, sitting in Roger's BMW with the engine running, having run a hose from the exhaust pipe into the driver's window to commit seasonal suicide by carbon monoxide poisoning. The kid walks into the garage, sees Willie whose head lolls to one side as he inhales the noxious fumes. The kid walks over to the car and looks in through the driver's window, and Willie moves slightly, raising his head a little to look at the kid. The kid turns to leave, and Willie winds the driver's window down, handing the kid a letter and noticing the kid has a black eye. Later, Willie is smashing into the chief skaterat's face and then turns to the rest of the gang. Two other kids on bikes watch astounded as Santa administers the festive beating. Back at the mall, Marcus and Willie are in the locker rooms after a hard day dishing out presents; Marcus gets changed out of his elf gear while Willie, in a contemplative mood, sits on a bench and sucks on a bottle of gut rot.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Sure, here's the text transformed with synonyms:\n\nMarcus inclines forward and peeks at Willie, stroking his chin pensively as Gin rises from the table and departs. Marcus and Willie observe each other, with Willie resignedly resting his head on his hand while Marcus slips into a brooding hush. The next day, a very large line of thrilled youngsters and their mothers forms at the western-themed Christmas Corral Grotto. A semi-comatose Santa reclines on the escalator clutching a broken bottle as Marcus, back in elf guise, attempts to pacify the kids. At the top of the escalator, Santa drunkenly gets to his feet and staggers slowly towards the grotto, bumping into one of the kids as he does so, before keeling over and collapsing on top of a fake cactus and a sack of gifts. The kids and moms gasp as Santa rallies and gets on his feet, only to fall over a life-size model donkey, falling on his back and seeing a second donkey going over. He scrambles to his feet and slugs the donkey with a large right hook, knocking its head off, then punches and kicks the donkey's body to bits in a display of drunken aggression. The moms hurriedly usher their offspring away as Gin strides up, drops Willie, and drags him away. Later on, Willie is back at the kid's house in the garage, sitting in Roger's BMW with the motor running, having run a hose from the exhaust pipe into the driver's window to commit seasonal self-destruction by carbon monoxide poisoning. The kid walks into the garage, sees Willie whose head lolls to one side as he inhales the pernicious fumes. The kid walks over to the car and looks in through the driver's window, and Willie moves slightly, raising his head a little to look at the kid. The kid turns to depart, and Willie winds the driver's window down, handing the kid a letter and noticing the kid has a black eye. Later, Willie is bashing into the chief skaterat's face and then turns to the rest of the gang. Two other kids on bicycles watch astounded as Santa administers the festive thrashing. Back at the mall, Marcus and Willie are in the locker rooms after a hard day dishing out gifts; Marcus gets changed out of his elf attire while Willie, in a contemplative mood, sits on a bench and sucks on a bottle of gut rot."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Marcus leans forward, and Willie is glanced at by him, as his chin is rubbed thoughtfully by him while the table is left by Gin. Each other is regarded by Marcus and Willie, with Willie resignedly resting his head on his hand while Marcus slips into a brooding silence. The next day, a very large queue of excited children and their mothers is formed at the western-themed Christmas Corral Grotto. A semi-comatose Santa, clutching a broken bottle, is lying on the escalator as the kids are calmed by Marcus, who is back in elf guise. At the top of the escalator, Santa drunkenly gets to his feet and slowly lurches towards the grotto, bumping into one of the kids before keeling over and collapsing on top of a fake cactus and a sack of presents. A gasp is heard from the kids and moms as Santa rallies and gets on his feet, only to fall over a life-size model donkey, falling on his back and seeing a second donkey going over. He scrambles to his feet and a big right hook is slugged at the donkey by him, knocking its head off, then the donkey's body is punched and kicked to bits by him in a display of drunken violence. Their offspring are hurriedly ushered away by the moms as Willie is dropped by Gin, who strides up and drags him away. Later on, Willie is back at the kid's house in the garage, where Roger's BMW is sat in by him with the engine running, as a hose has been run from the exhaust pipe into the driver's window by him to commit seasonal suicide by carbon monoxide poisoning. The garage is walked into by the kid, who sees Willie with his head lolling to one side as the noxious fumes are inhaled by him. The kid walks over to the car and looks in through the driver's window, and Willie slightly moves, raising his head a little to look at the kid. The kid turns to leave, and the driver's window is wound down by Willie, who hands the kid a letter and notices the kid has a black eye. Later, the chief skaterat's face is smashed into by Willie, who then turns to the rest of the gang. Two other kids on bikes watch astounded as the festive beating is administered by Santa. Back at the mall, Marcus and Willie are in the locker rooms after a hard day dishing out presents; Marcus changes out of his elf gear while a contemplative mood sees Willie sit on a bench and suck on a bottle of gut rot."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Marcus leans forward, glancing at Willie and rubbing his chin thoughtfully as Gin exits. Willie resigns himself with his head on his hand, while Marcus slips into silence. The next day, a long line of excited children and mothers gathers at the western-themed Christmas Corral Grotto. A semi-conscious Santa lies on an escalator with a broken bottle, as Marcus, dressed as an elf, tries to calm the kids. Santa drunkenly stands and stumbles towards the grotto, bumping into a child and collapsing on a fake cactus and presents. As kids and moms gasp, Santa gets up, only to trip over a model donkey, smashing its head off in a fit of drunken rage. Mothers quickly escort their children away as Gin arrives, collects Willie, and drags him off. Later, Willie is in the kid's garage, attempting suicide by carbon monoxide in Roger's BMW. The kid discovers him, and Willie hands him a letter, noticing the kid’s black eye. Willie later attacks the chief skaterat, with onlookers shocked as Santa delivers a festive beating. At the mall, Marcus and Willie are in the locker rooms, Marcus changing out of his elf attire while contemplative Willie sips gut rot on a bench."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Marcus thoughtfully rubs his chin, glancing at Willie as Gin leaves the table. Willie rests his head in resignation while Marcus remains silent. The next day, at the western-themed Christmas Corral Grotto, excited children and mothers queue as a drunken Santa clutches a broken bottle on an escalator. Marcus, dressed as an elf, tries to calm the kids. Santa drunkenly rises, lurches toward the grotto, bumps a child, and collapses on a fake cactus and presents sack. Santa gets up, falls over a model donkey, and in a violent drunken rage, punches and kicks it apart. Moms hurriedly lead their kids away as Gin drags Willie off. Later, Willie attempts suicide in Roger's BMW by carbon monoxide poisoning. The kid enters, sees Willie inhaling fumes, and Willie raises his head and hands the kid a letter, noticing the kid’s black eye. Willie then beats the chief skaterat, impressing two biking kids with Santa's festive brawl. At the mall, Marcus changes out of his elf gear while Willie contemplates, sipping on a bottle after a tough day."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Marcus, with a thoughtful expression on his face, leans forward in his seat and casts a glance at Willie, rubbing his chin thoughtfully. Meanwhile, Gin stands up from the table and quietly exits the room. Left alone, Marcus and Willie exchange looks, with Willie resignedly resting his head in a weary manner on his hand, while Marcus, deep in thought, slips into a brooding silence. The following day, an impressively large queue of eager and excited children, accompanied by their mothers, begins to form at the western-themed Christmas Corral Grotto. In the midst of this bustling scene, a semi-comatose Santa lies sprawled on the escalator, clutching a broken bottle, as Marcus, now dressed in his elf costume once again, makes an effort to calm the restless kids. At the top of the escalator, a drunken Santa stirs, getting to his feet unsteadily, and begins to lurch slowly towards the grotto, accidentally bumping into one of the children as he progresses, before keeling over and collapsing on top of a fake cactus and a sack of presents. The children and their mothers gasp in shock as Santa makes an effort to rally and gets back on his feet, only to stumble and fall over a life-size model donkey, ending up on his back and seeing a second donkey toppling over. He scrambles awkwardly to his feet and, in a fit of drunken rage, delivers a powerful right hook to the donkey, knocking its head clean off, and then proceeds to punch and kick the donkey’s body into bits, displaying a shocking scene of drunken violence. Alarmed, the mothers hurriedly usher their children away from the chaotic scene as Gin strides purposefully up, unceremoniously drops Willie on the ground, and drags him away. Later on, Willie finds himself back at the home of the kid, in the garage, sitting inside Roger's BMW with the engine running. He has run a hose from the exhaust pipe into the driver’s window, intending to commit seasonal suicide through carbon monoxide poisoning. The kid walks innocently into the garage, immediately noticing Willie, whose head lolls to one side as he inhales the noxious fumes. The kid cautiously approaches the car and looks in through the driver’s window. Upon seeing the kid, Willie moves slightly, lifting his head just a little to regard the kid. The kid then turns to leave, and Willie, in a moment of vulnerability, winds down the driver's window, handing the kid a letter, and in the process, he notices the kid has a noticeable black eye. Following this, Willie is seen unleashing his fury on the chief skaterat. He smashes into the leader's face with intensity, then turns to face the rest of the gang. Two other kids on their bikes watch in stunned amazement as Santa delivers the unexpected festive beating. Back at the mall, Marcus and Willie are in the locker rooms after enduring a hard day of distributing presents. Marcus begins to change out of his elf gear, while Willie, in a contemplative and somewhat melancholic mood, sits on a bench, nursing a bottle of gut rot."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Marcus, with a contemplative and pensive expression deeply etched on his face, leans forward in his seat. He thoughtfully casts a sidelong glance at Willie, all the while rubbing his chin in a manner that suggests deep contemplation. Meanwhile, Gin quietly stands up from the table, making a subtle exit from the room, leaving behind Marcus and Willie. The two exchange meaningful looks; Willie, with an air of resignation, rests his weary head on the palm of his hand, while Marcus, lost in thought, drifts into a silent, brooding state. \n\nThe very next day, an impressively large line of eager and enthusiastic children, accompanied by their attentive mothers, begins to form at the festive, western-themed Christmas Corral Grotto. Amidst this bustling scene, a semi-comatose and disheveled Santa is seen sprawled across the escalator, clutching a broken bottle in hand. Marcus, who has donned his elf costume once again for the occasion, attempts to soothe and calm the restless children. At the top of the escalator, the drunken Santa stirs into motion, getting unsteadily to his feet, and begins an unsteady lurch toward the grotto. In his inebriated state, he accidentally bumps into one of the children as he stumbles forward, eventually keeling over and collapsing on a fake cactus and a sack filled with presents. The children and their mothers gasp audibly in shock as Santa makes a clumsy effort to rally and rise once more, only to stumble again, toppling over a life-sized model of a donkey and ending up flat on his back. In the process, he sees a second donkey model fall over. Santa awkwardly scrambles to his feet and, in a fit of drunk-induced rage, lands a furious right hook on the donkey, knocking its head clean off. He then proceeds to punch and kick the donkey’s body into scattered bits, creating a shocking and chaotic scene of drunken violence. Startled and alarmed, the mothers quickly usher their children away from the tumultuous spectacle as Gin strides purposefully up to Willie, roughly dropping him on the ground, before dragging him away.\n\nLater on, Willie finds himself back at the familiar setting of the kid’s home, this time sitting inside the garage in Roger's sleek BMW with the engine running. He has set up a hose, ingeniously running it from the car's exhaust pipe into the driver’s window, intending to commit the grim act of seasonal suicide using carbon monoxide poisoning. The kid unsuspectingly walks into the garage and immediately notices Willie, whose head is seen lolling to one side as he inhales the noxious fumes. The kid cautiously approaches the car and peers in through the driver’s window. Upon seeing the kid, Willie manages to move slightly, lifting his head just a little to acknowledge the kid's presence. The kid then turns as if to leave, and Willie, seizing a moment of vulnerability, winds down the driver's window. He hands the kid a letter and in doing so, he notices the kid has a noticeable black eye.\n\nFollowing this event, Willie is later seen unleashing his pent-up fury on the chief skaterat. He charges at the leader, smashing into his face with raw intensity, before turning to confront the rest of the gang. Two other kids on their bikes watch in stunned amazement as Santa delivers this unexpected display of festive wrath. \n\nBack at the mall, Marcus and Willie find themselves in the locker rooms after enduring an arduously hard day of distributing presents. Marcus begins to change out of his elf gear, while Willie, lost in a contemplative and somewhat melancholic mood, sits pensively on a bench, nursing a bottle of gut rot."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Marcus leans forward, subtly shifting his weight as he glances over at Willie, rubbing his chin with a thoughtful look etched on his face. As Gin rises from the table and departs, Marcus and Willie exchange a silent understanding, with Willie allowing his head to rest heavily on his hand, exuding a sense of resignation. Marcus, in turn, descends into a pensive silence, his eyes growing distant. The following day, a very large queue forms, comprised of excited children and their mothers eagerly awaiting their turn at the western-themed Christmas Corral Grotto. Meanwhile, a semi-comatose Santa sprawls out on the escalator, clutching a broken bottle in a loose grip, as Marcus, now dressed once more in his elf guise, attempts to maintain order and calm the excited kids. At the escalator's top, Santa drunkenly struggles to his feet, swaying unsteadily as he makes his way toward the grotto, inadvertently bumping into one of the children. Without warning, he tips over, collapsing on top of a fake cactus and a sack of presents, prompting gasps from the surrounding children and their mothers. As Santa attempts to rally, he gets back on his feet, only to stumble and fall over a life-sized model of a donkey, landing flat on his back and causing a second donkey to topple over in kind. In a wild burst of inebriated aggression, he scrambles to his feet and delivers a forceful punch to the donkey, knocking its head clean off, then follows up by pummeling and kicking the donkey's body until it is nothing more than bits. The mothers urgently whisk their children away from the chaotic scene as Gin strides over, drops Willie, and unceremoniously drags him away. Later, Willie finds himself at the kid's house in the garage, seated in Roger's BMW with the engine idling, having run a hose from the exhaust pipe into the driver's window in a grim attempt to end his life by carbon monoxide poisoning. The kid enters the garage and spots Willie in the car, noting how Willie's head lolls to one side as he inhales the toxic fumes. The kid approaches the car, peering through the driver's window, and Willie reacts slightly, lifting his head just enough to meet the kid's gaze. As the kid turns to leave, Willie hurriedly winds down the driver's window and hands the kid a letter, simultaneously noticing the kid's black eye. Later, in an act of retribution, Willie is seen delivering a resounding blow to the chief skaterat's face, turning afterward to face the rest of the gang. Two other kids on bikes watch, their faces a mixture of shock and awe, as Santa administers what can only be described as a festive beating. The scene shifts back to the mall, where Marcus and Willie find themselves in the locker rooms after a long day of distributing presents; Marcus methodically changes out of his elf attire while Willie, lost in contemplation, sits on a bench, taking solace in the burning swig of gut rot he draws from the bottle."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Marcus leans forward, thoughtfully rubbing his chin while exchanging a silent moment with Willie as Gin departs. The next day, a long queue of excited children and their mothers gathers at the western-themed Christmas Corral Grotto. Santa, semi-conscious and gripping a broken bottle, is sprawled on the escalator as Marcus, dressed as an elf, attempts to manage the situation. Santa drunkenly gets up, stumbles into a child, and collapses onto a fake cactus and presents. After a brief recovery, he falls over a model donkey, punches its head off, and violently dismantles the rest, prompting the mothers to quickly usher their children away. Gin arrives, picks Willie up, and drags him away. Later, Willie is in the kid's garage, attempting suicide by carbon monoxide poisoning in Roger's BMW. The kid enters, observes Willie, who then hands the kid a letter upon noticing his black eye. Subsequently, Willie confronts the chief skaterat, delivering a festive beating as two other kids watch in shock. Back at the mall, Marcus changes out of his elf costume in the locker room while Willie, reflecting on the day's events, sits pensively with a bottle in hand."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Marcus leans forward and glances at Willie, rubbing his chin thoughtfully as Gin, known for her terse demeanor and quick exits, gets up from the table and leaves. Marcus and Willie regard each other, with Willie resignedly resting his head on his hand, reflecting on the troubling events, while Marcus slips into a brooding silence. The next day, a very large queue of excited children and their mothers forms at the Christmas Corral Grotto, a popular seasonal attraction in the local mall that features a western-themed decor. Nearby, a semi-comatose Santa, disheveled and reeking of alcohol, lies on the escalator clutching a broken bottle as Marcus, back in his elf guise, tries to calm the kids with reassuring words and songs. At the top of the escalator, Santa drunkenly gets to his feet and lurches slowly towards the grotto, bumping into one of the kids as he does so, before keeling over and collapsing on top of a fake cactus and a sack of presents, crafted by a local artist to add authenticity to the theme. The kids and moms gasp as Santa rallies and gets on his feet, only to fall over a life-size model donkey, handcrafted by artisans for educational purposes, falling on his back and seeing a second donkey going over. He scrambles to his feet and, in a moment of alcohol-fueled rage, slugs the donkey with a big right hook, knocking its head off, then punches and kicks the donkey's body to bits in a display of drunken violence. The moms hurriedly usher their offspring away as Gin strides up, with a reputation for handling chaotic situations, drops Willie, and drags him away. Later on, Willie is back at the kid's house in the garage, sitting in Roger's BMW, a car admired for its luxury and performance, with the engine running, having run a hose from the exhaust pipe into the driver's window to commit seasonal suicide by carbon monoxide poisoning, a tragic method often associated with melancholy holidays. The kid walks into the garage, sees Willie whose head lolls to one side as he inhales the noxious fumes, the danger of which is not immediately apparent. The kid walks over to the car and looks in through the driver's window, and Willie moves slightly, raising his head a little to look at the kid, his conscience pricked by the child's innocent presence. The kid turns to leave, and Willie, in a moment of clarity, winds the driver's window down, handing the kid a letter and noticing the kid has a black eye, a silent testament to recent bullying. Later, Willie is seen smashing into the chief skaterat's face, the leader of a local group notorious for causing trouble, and then turns to the rest of the gang. Two other kids on bikes watch astounded as Santa administers the festive beating, a surreal scene blending holiday cheer with unexpected justice. Back at the mall, Marcus and Willie are in the locker rooms after a hard day dishing out presents; Marcus gets changed out of his elf gear while Willie, in a contemplative mood, sits on a bench and sucks on a bottle of gut rot, a cheap liquor often associated with desperate times."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "At the top of the escalator Santa drunkenly gets to his feet and lurches slowly towards the grotto bumping into one of the kids as he does so before keeling over and collapsing on top of a fake cactus and a sack of presents Marcus leans forward and glances at Willie rubbing his chin thoughtfully as Gin gets up from the table and leaves Marcus gets changed out of his elf gear while Willie in a contemplative mood sits on a bench and sucks on a bottle of gut rot The kid turns to leave and Willie winds the driver's window down handing the kid a letter and noticing the kid has a black eye Marcus and Willie regard each other with Willie resignedly resting his head on his hand while Marcus slips into a brooding silence A semicomatose Santa lies on the escalator clutching a broken bottle as Marcus back in elf guise tries to calm the kids Two other kids on bikes watch astounded as Santa administers the festive beating The next day a very large queue of excited children and their mothers forms at the westernthemed Christmas Corral Grotto The next day a very large queue of excited children and their mothers forms at the westernthemed Christmas Corral Grotto A semicomatose Santa lies on the escalator clutching a broken bottle as Marcus back in elf guise tries to calm the kids At the top of the escalator Santa drunkenly gets to his feet and lurches slowly towards the grotto bumping into one of the kids as he does so before keeling over and collapsing on top of a fake cactus and a sack of presents The kids and moms gasp as Santa rallies and gets on his feet only to fall over a lifesize model donkey falling on his back and seeing a second donkey going over He scrambles to his feet and slugs the donkey with a big right hook knocking its head off then punches and kicks the donkey's body to bits in a display of drunken violence The moms hurriedly usher their offspring away as Gin strides up drops Willie and drags him away Later on Willie is back at the kid's house in the garage sitting in Roger's BMW with the engine running having run a hose from the exhaust pipe into the driver's window to commit seasonal suicide by carbon monoxide poisoning The kid walks into the garage sees Willie whose head lolls to one side as he inhales the noxious fumes Marcus and Willie regard each other with Willie resignedly resting his head on his hand while Marcus slips into a brooding silence The kid walks over to the car and looks in through the driver's window and Willie moves slightly raising his head a little to look at the kid The kid turns to leave and Willie winds the driver's window down handing the kid a letter and noticing the kid has a black eye Marcus leans forward and glances at Willie rubbing his chin thoughtfully as Gin gets up from the table and leaves Later Willie is smashing into the chief skaterat's face and then turns to the rest of the gang Two other kids on bikes watch astounded as Santa administers the festive beating Back at the mall Marcus and Willie are in the locker rooms after a hard day dishing out presents Marcus gets changed out of his elf gear while Willie in a contemplative mood sits on a bench and sucks on a bottle of gut rot"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Marcus leans forward and glances at Willie rubbing his chin thoughtfully as Gin gets up from the table and leaves. Marcus and Willie regard each other with Willie resignedly resting his head on his hand while Marcus slips into a brooding silence. The next day a very large queue of excited children and their mothers forms at the westernthemed Christmas Corral Grotto. A semicomatose Santa lies on the escalator clutching a broken bottle as Marcus back in elf guise tries to calm the kids. At the top of the escalator Santa drunkenly gets to his feet and lurches slowly towards the grotto bumping into one of the kids as he does so before keeling over and collapsing on top of a fake cactus and a sack of presents. The kids and moms gasp as Santa rallies and gets on his feet only to fall over a lifesize model donkey falling on his back and seeing a second donkey going over. He scrambles to his feet and slugs the donkey with a big right hook knocking its head off then punches and kicks the donkey's body to bits in a display of drunken violence. The moms hurriedly usher their offspring away as Gin strides up drops Willie and drags him away. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. Later on Willie is back at the kid's house in the garage sitting in Roger's BMW with the engine running having run a hose from the exhaust pipe into the driver's window to commit seasonal suicide by carbon monoxide poisoning. The kid walks into the garage sees Willie whose head lolls to one side as he inhales the noxious fumes. The kid walks over to the car and looks in through the driver's window and Willie moves slightly raising his head a little to look at the kid. The kid turns to leave and Willie winds the driver's window down handing the kid a letter and noticing the kid has a black eye. Later Willie is smashing into the chief skaterat's face and then turns to the rest of the gang. Two other kids on bikes watch astounded as Santa administers the festive beating. Back at the mall Marcus and Willie are in the locker rooms after a hard day dishing out presents. Marcus gets changed out of his elf gear while Willie in a contemplative mood sits on a bench and sucks on a bottle of gut rot."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Marcus leans forward and glances at Willie rubbing his chin thoughtfully as Gin gets up from the table and leaves. Marcus and Willie regard each other with Willie resignedly resting his head on his hand while Marcus slips into a brooding silence. The next day a very large queue of excited children and their mothers forms at the westernthemed Christmas Corral Grotto. A semicomatose Santa lies on the escalator clutching a broken bottle as Marcus back in elf guise tries to calm the kids. At the top of the escalator Santa drunkenly gets to his feet and lurches slowly towards the grotto bumping into one of the kids as he does so before keeling over and collapsing on top of a fake cactus and a sack of presents. The kids and moms gasp as Santa rallies and gets on his feet only to fall over a lifesize model donkey falling on his back and seeing a second donkey going over. He scrambles to his feet and slugs the donkey with a big right hook knocking its head off then punches and kicks the donkey's body to bits in a display of drunken violence. The moms hurriedly usher their offspring away as Gin strides up drops Willie and drags him away. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. Later on Willie is back at the kid's house in the garage sitting in Roger's BMW with the engine running having run a hose from the exhaust pipe into the driver's window to commit seasonal suicide by carbon monoxide poisoning. The kid walks into the garage sees Willie whose head lolls to one side as he inhales the noxious fumes. The kid walks over to the car and looks in through the driver's window and Willie moves slightly raising his head a little to look at the kid. The kid turns to leave and Willie winds the driver's window down handing the kid a letter and noticing the kid has a black eye. Later Willie is smashing into the chief skaterat's face and then turns to the rest of the gang. Two other kids on bikes watch astounded as Santa administers the festive beating. Back at the mall Marcus and Willie are in the locker rooms after a hard day dishing out presents. Marcus gets changed out of his elf gear while Willie in a contemplative mood sits on a bench and sucks on a bottle of gut rot."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Marcus leans forward and glances at Willie rubbing his chin thoughtfully as Gin gets up from the table and leaves. Marcus and Willie regard each other with Willie resignedly resting his head on his hand while Marcus slips into a brooding silence. The next day a very large queue of excited children and their mothers forms at the westernthemed Christmas Corral Grotto. A semicomatose Santa lies on the escalator clutching a broken bottle as Marcus back in elf guise tries to calm the kids. Later Willie is smashing into the chief skaterat's face and then turns to the rest of the gang. Two other kids on bikes watch astounded as Santa administers the festive beating. Back at the mall Marcus and Willie are in the locker rooms after a hard day dishing out presents. Marcus gets changed out of his elf gear while Willie in a contemplative mood sits on a bench and sucks on a bottle of gut rot."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Marcus leans forward and glances at Willie rubbing his chin thoughtfully as Gin gets up from the table and leaves. Marcus and Willie regard each other with Willie resignedly resting his head on his hand while Marcus slips into a brooding silence. Back at the mall Marcus and Willie are in the locker rooms after a hard day dishing out presents. Marcus gets changed out of his elf gear while Willie in a contemplative mood sits on a bench and sucks on a bottle of gut rot."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Gin leans forward and glances at Marcus, rubbing her chin thoughtfully as Willie gets up from the table and leaves. Gin and Marcus regard each other, with Marcus resignedly resting his head on his hand while Gin slips into a brooding silence. The next day, a very large queue of excited children and their mothers forms at the western-themed Christmas Corral Grotto. A semi-comatose reindeer lies on the escalator clutching a broken bottle as Gin, back in elf guise, tries to calm the kids. At the top of the escalator, the reindeer drunkenly gets to his feet and lurches slowly towards the grotto, bumping into one of the kids as he does so, before keeling over and collapsing on top of a fake cactus and a sack of presents. The kids and moms gasp as the reindeer rallies and gets on his feet, only to fall over a life-size model donkey, falling on his back and seeing a second donkey going over. He scrambles to his feet and slugs the donkey with a big right hook, knocking its head off, then punches and kicks the donkey's body to bits in a display of drunken violence. The moms hurriedly usher their offspring away as Willie strides up, drops Gin, and drags her away. Later on, Gin is back at the kid's house in the garage, sitting in Roger's BMW with the engine running, having run a hose from the exhaust pipe into the driver's window to commit seasonal suicide by carbon monoxide poisoning. The kid walks into the garage, sees Gin whose head lolls to one side as she inhales the noxious fumes. The kid walks over to the car and looks in through the driver's window, and Gin moves slightly, raising her head a little to look at the kid. The kid turns to leave, and Gin winds the driver's window down, handing the kid a letter and noticing the kid has a black eye. Later, Gin is smashing into the chief skaterat's face and then turns to the rest of the gang. Two other kids on bikes watch astounded as the Easter Bunny administers the festive beating. Back at the mall, Gin and Marcus are in the locker rooms after a hard day dishing out presents; Gin gets changed out of her elf gear while Marcus, in a contemplative mood, sits on a bench and sucks on a bottle of gut rot."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Marcus leans forward and glances at Willie, rubbing his chin thoughtfully as Gin gets up from the sofa and leaves. Marcus and Willie regard each other, with Willie resignedly resting his head on his hand while Marcus slips into a brooding silence. The next day, a very large queue of excited children and their mothers forms at the pirate-themed Easter Egg Cove. A semi-comatose Santa lies on the conveyor belt clutching a broken vase as Marcus, back in pirate attire, tries to calm the kids. At the top of the conveyor belt, Santa drunkenly gets to his feet and lurches slowly towards the cove, bumping into one of the kids as he does so, before keeling over and collapsing on top of a fake palm tree and a basket of eggs. The kids and moms gasp as Santa rallies and gets on his feet, only to fall over a life-size model parrot, falling on his back and seeing a second parrot going over. He scrambles to his feet and slugs the parrot with a big right hook, knocking its head off, then punches and kicks the parrot's body to bits in a display of drunken violence. The moms hurriedly usher their offspring away as Gin strides up, drops Willie, and drags him away. Later on, Willie is back at the kid's house in the attic, sitting in Roger's Subaru with the engine running, having run a hose from the exhaust pipe into the driver's window to commit seasonal suicide by carbon monoxide poisoning. The kid walks into the attic, sees Willie whose head lolls to one side as he inhales the noxious fumes. The kid walks over to the car and looks in through the driver's window, and Willie moves slightly, raising his head a little to look at the kid. The kid turns to leave, and Willie winds the driver's window down, handing the kid a postcard and noticing the kid has a twisted ankle. Later, Willie is smashing into the chief skaterat's chest and then turns to the rest of the gang. Two other kids on scooters watch astounded as Santa administers the festive beating. Back at the gym, Marcus and Willie are in the changing rooms after a hard day dishing out gifts; Marcus gets changed out of his pirate gear while Willie, in a contemplative mood, sits on a bench and sips on a bottle of gut rot."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Marcus slouches backward and stares at Willie, patting his chin absentmindedly as Gin sits at the table and enters. Marcus and Willie avoid each other, with Willie cheerfully tapping his head on his hand while Marcus drifts into a cheerful silence. The next day, a very small cluster of calm children and their fathers dissolves at the eastern-themed Easter Corral Grotto. A fully awake Santa skips on the escalator holding a fixed bottle as Marcus, back in elf guise, tries to entertain the kids. At the bottom of the escalator, Santa soberly sits on his knees and walks swiftly towards the grotto, high-fiving one of the kids as he does so, before standing up and perching on top of a real cactus and a pile of presents. The kids and dads cheer as Santa stumbles and sits on his knees, only to lean against a mini model donkey, standing up on his hands and seeing a second donkey toppling over. He kneels on his hands and shakes the donkey with a gentle left tap, fixing its head on, then hugs and embraces the donkey's body in a display of sober affection. The dads casually call their offspring closer as Gin strolls up, picks up Willie, and hugs him tightly. Later on, Willie is back at the kid's house in the kitchen, standing next to Roger's BMW with the engine off, having put a hose from the exhaust pipe into the driver's window to clean it with soap bubbles. The kid walks into the kitchen, sees Willie whose head is tilted to one side as he smells the scented air. The kid walks over to the car and looks in through the driver's window, and Willie shifts slightly, lowering his head a little to look at the kid. The kid turns to approach, and Willie rolls the driver's window up, taking a letter from the kid and noticing the kid has a big smile. Later, Willie is laughing with the chief skaterat's face and then waves to the rest of the gang. Two other kids on bikes watch amused as Santa engages in the festive play. Back at the mall, Marcus and Willie are in the locker rooms after a hard day receiving presents; Marcus gets dressed in his elf gear while Willie, in a cheerful mood, stands on a bench and holds a bottle of sparkling water."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Daphne leans forward and glances at a lamppost, rubbing her elbow thoughtfully as a clock gets up from the windowsill and leaves. Daphne and the lamppost regard each other, with the lamppost resignedly resting its bulb on its pole while Daphne slips into a brooding silence. The next dawn, a very large queue of excited parrots and their trainers forms at the eastern-themed Halloween Meadow Stable. A semi-comatose snowman lies on the staircase clutching a broken umbrella as Daphne, back in pirate guise, tries to calm the parrots. At the top of the staircase, the snowman drunkenly gets to its feet and lurches slowly towards the stable, bumping into one of the parrots as it does so, before keeling over and collapsing on top of a fake banana and a pile of carrots. The parrots and trainers gasp as the snowman rallies and gets on its feet, only to fall over a life-size model kangaroo, falling on its back and seeing a second kangaroo going over. It scrambles to its feet and slugs the kangaroo with a big right hook, knocking its tail off, then punches and kicks the kangaroo's body to bits in a display of drunken violence. The trainers hurriedly usher their creatures away as the clock strides up, drops the lamppost, and drags it away. Later on, the lamppost is back at the octopus's cave in the attic, sitting in Tanya's scooter with the engine running, having run a leash from the tailpipe into the driver's window to commit seasonal suicide by carbon monoxide poisoning. The octopus slithers into the attic, sees the lamppost whose bulb lolls to one side as it inhales the noxious fumes. The octopus slithers over to the scooter and looks in through the driver's window, and the lamppost moves slightly, raising its bulb a little to look at the octopus. The octopus turns to leave, and the lamppost winds the driver's window down, handing the octopus a postcard and noticing the octopus has a bandaged fin. Later, the lamppost is smashing into the chief rabbit's nose and then turns to the rest of the flock. Two other frogs on skateboards watch astounded as the snowman administers the festive beating. Back at the fair, Daphne and the lamppost are in the changing rooms after a hard day dishing out carrots; Daphne gets changed out of her pirate gear while the lamppost, in a contemplative mood, sits on a shelf and sucks on a bottle of shoe polish."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Arnold leans back and peers at Clyde, tapping his nose absentmindedly as Bella slides down from the chair and vanishes. Arnold and Clyde observe each other, with Clyde lazily propping his chin on his fist while Arnold drifts into a pensive quiet. The following afternoon, a surprisingly tiny line of grumpy teenagers and their grandfathers gathers at the pirate-themed Easter Cove Harbor. A hyperactive Easter Bunny sprawls on the elevator clutching a shattered lantern as Arnold, dressed as a pirate, attempts to entertain the teens. At the peak of the elevator, the Bunny drunkenly stumbles to his knees and wobbles clumsily towards the harbor, knocking into one of the teens as he does so, before toppling over and crashing onto a plastic palm tree and a pile of eggs. The teens and grandpas gasp as the Bunny revives and sits up, only to trip over a life-size model parrot, landing on his stomach and watching a second parrot tumble down. He rises to his knees and bats the parrot with a hefty left swing, sending its beak flying, then pummels and stomps the parrot’s torso to rubble in a show of intoxicated chaos. The grandpas promptly steer their grandchildren away as Bella marches up, picks up Clyde, and hauls him aside. Later on, Clyde is back at the family’s house in the basement, reclining in Janet's Audi with the air conditioning on, having attached a tube from the heater vent to the passenger window to attempt seasonal snoozing by warm air exposure. The teen strolls into the basement, observes Clyde whose head droops to one side as he exhales the warm drafts. The teen walks up to the car and peers in through the passenger window, and Clyde jolts slightly, lifting his head a tad to gaze at the teen. The teen turns to depart, and Clyde lowers the passenger window, passing the teen a note and noticing the teen has a missing tooth. Afterward, Clyde is charging into the main mechanic’s chest and then faces the remainder of the crew. Two other teens on scooters gape astonished as the Bunny delivers the jolly trouncing. In the parking lot, Arnold and Clyde are in the dressing rooms after an exhausting afternoon distributing eggs; Arnold changes out of his pirate outfit while Clyde, in a reflective frame of mind, lounges on a chair and sips from a flask of moonshine."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Marcus tilts backward and scans Willie, scratching his ear absentmindedly as Gin rises from the bench and vanishes. Marcus and Willie stare at each other, with Willie reluctantly balancing his elbow on his knee while Marcus drifts into a pensive murmur. The following day, a very large line of eager kittens and their nannies congregates at the pirate-themed Easter Cove Lagoon. An almost asleep Easter Bunny lies on the conveyor belt clutching a shattered vase as Marcus, back in mermaid guise, attempts to entertain the kittens. At the top of the conveyor belt, Bunny clumsily stands and staggers gradually towards the lagoon, nudging one of the kittens as he does so, before tripping and collapsing on top of a fake palm tree and a basket of eggs. The kittens and nannies gasp as Bunny rallies and rises, only to stumble over a giant model lizard, falling on his side and watching a second lizard topple. He scrambles upright and jabs the lizard with a big left jab, sending its tail flying, then punches and kicks the lizard's body to fragments in a burst of drunken chaos. The nannies quickly shepherd their charges away as Gin marches up, releases Willie, and hauls him off. Later, Willie is back at the kitten's burrow in the bar, lounging in Roger's motorcycle with the lights flashing, having placed a rope from the tailpipe into the rider's helmet to execute holiday despair by exhaust vapor inhalation. The kitten strolls into the bar, notices Willie whose head droops to one shoulder as he inhales the toxic mist. The kitten strolls over to the motorcycle and peers in through the rider's visor, and Willie shifts slightly, lifting his head slightly to observe the kitten. The kitten turns to exit, and Willie lowers the rider's visor, handing the kitten a map and spotting the kitten has a bruised paw. Later, Willie is crashing into the lead clown’s arm and then pivots to the rest of the pack. Two other kittens on scooters watch dumbfounded as Bunny delivers the celebratory thrashing. Back at the lagoon, Marcus and Willie are in the changing rooms after a strenuous day distributing eggs; Marcus changes out of his mermaid attire while Willie, in a thoughtful mindset, perches on a stool and sips on a flask of hooch."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Harold reclines backward and glares at Benny, scratching his nose absentmindedly as Lee slides down from the chair and vanishes. Harold and Benny eye each other, with Benny lazily drooping his head on his elbow while Harold drifts into a pensive stillness. The following morning, an enormous line of jubilant dogs and their trainers assembles at the pirate-themed Easter Cove Habitat. A nearly comatose clown sprawls on the ladder clutching a shattered umbrella as Harold, back in goblin attire, attempts to soothe the puppies. At the summit of the ladder, the clown tipsily rises to his toes and staggers gradually towards the habitat, bumping into one of the puppies as he does so, before toppling over and collapsing onto a plastic palm tree and a heap of balloons. The puppies and trainers gasp as the clown rallies and gets on his toes, only to trip over a life-size model penguin, landing on his belly and seeing a second penguin tumbling over. He scrambles to his toes and smacks the penguin with a hefty left jab, detaching its flipper, then slaps and stomps the penguin’s form to fragments in an exhibition of drunken chaos. The trainers hastily herd their canines away as Lee marches up, releases Benny, and yanks him along. Later on, Benny is back at the puppy’s hut in the barn, lounging in Karen's Jeep with the headlights beaming, having looped a rope from the radiator into the passenger’s door to perform festive slumber by carbon dioxide inhalation. The puppy trots into the barn, spots Benny whose head sags to one side as he breathes the toxic vapors. The puppy trots over to the Jeep and peers in through the passenger’s door, and Benny shifts slightly, raising his head a tad to glance at the puppy. The puppy swivels to exit, and Benny lowers the passenger’s door, tossing the puppy a postcard and noticing the puppy sports a blue collar. Later, Benny is clobbering into the lead skatedog’s snout and then swivels to the rest of the troop. Two additional puppies on tricycles observe dumbfounded as the clown distributes the holiday thrashing. Back at the zoo, Harold and Benny are in the storage compartments after a challenging evening handing out candies; Harold changes out of his goblin uniform while Benny, in a reflective mindset, perches on a crate and sips on a jug of swamp juice."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Marcus and Willie share a tense, silent moment as Gin departs. The following day, a chaotic scene unfolds at the western-themed Christmas Corral Grotto. A drunken Santa, lying on the escalator, is surrounded by excited children and their mothers. Marcus, dressed as an elf, attempts to maintain order as Santa causes havoc, stumbling and fighting a donkey model in a display of drunken violence. The mothers quickly usher their children away as Gin takes Willie away. Later, Willie attempts suicide by carbon monoxide poisoning in Roger's BMW but is interrupted by a kid, to whom he gives a letter after noticing the kid's black eye. Willie later confronts the chief skaterat, delivering a festive beating. Back at the mall, Marcus changes out of his elf costume while Willie, reflective, sits and drinks, contemplating their day of distributing presents."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Marcus gets changed out of his elf gear while Willie in a contemplative mood sits on a bench and sucks on a bottle of gut rot Back at the mall Marcus and Willie are in the locker rooms after a hard day dishing out presents Two other kids on bikes watch astounded as Santa administers the festive beating Later Willie is smashing into the chief skaterat's face and then turns to the rest of the gang The kid turns to leave and Willie winds the driver's window down handing the kid a letter and noticing the kid has a black eye The kid walks over to the car and looks in through the driver's window and Willie moves slightly raising his head a little to look at the kid The kid walks into the garage sees Willie whose head lolls to one side as he inhales the noxious fumes Later on Willie is back at the kid's house in the garage sitting in Roger's BMW with the engine running having run a hose from the exhaust pipe into the driver's window to commit seasonal suicide by carbon monoxide poisoning The moms hurriedly usher their offspring away as Gin strides up drops Willie and drags him away He scrambles to his feet and slugs the donkey with a big right hook knocking its head off then punches and kicks the donkey's body to bits in a display of drunken violence The kids and moms gasp as Santa rallies and gets on his feet only to fall over a lifesize model donkey falling on his back and seeing a second donkey going over At the top of the escalator Santa drunkenly gets to his feet and lurches slowly towards the grotto bumping into one of the kids as he does so before keeling over and collapsing on top of a fake cactus and a sack of presents A semicomatose Santa lies on the escalator clutching a broken bottle as Marcus back in elf guise tries to calm the kids The next day a very large queue of excited children and their mothers forms at the westernthemed Christmas Corral Grotto Marcus and Willie regard each other with Willie resignedly resting his head on his hand while Marcus slips into a brooding silence Marcus leans forward and glances at Willie rubbing his chin thoughtfully as Gin gets up from the table and leaves"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "The moms hurriedly usher their offspring away as Gin strides up drops Willie and drags him away The kid walks into the garage sees Willie whose head lolls to one side as he inhales the noxious fumes The kids and moms gasp as Santa rallies and gets on his feet only to fall over a lifesize model donkey falling on his back and seeing a second donkey going over He scrambles to his feet and slugs the donkey with a big right hook knocking its head off then punches and kicks the donkey's body to bits in a display of drunken violence Back at the mall Marcus and Willie are in the locker rooms after a hard day dishing out presents The kid walks over to the car and looks in through the driver's window and Willie moves slightly raising his head a little to look at the kid Later Willie is smashing into the chief skaterat's face and then turns to the rest of the gang Later on Willie is back at the kid's house in the garage sitting in Roger's BMW with the engine running having run a hose from the exhaust pipe into the driver's window to commit seasonal suicide by carbon monoxide poisoning Marcus and Willie regard each other with Willie resignedly resting his head on his hand while Marcus slips into a brooding silence The next day a very large queue of excited children and their mothers forms at the westernthemed Christmas Corral Grotto Two other kids on bikes watch astounded as Santa administers the festive beating Marcus gets changed out of his elf gear while Willie in a contemplative mood sits on a bench and sucks on a bottle of gut rot At the top of the escalator Santa drunkenly gets to his feet and lurches slowly towards the grotto bumping into one of the kids as he does so before keeling over and collapsing on top of a fake cactus and a sack of presents The kid turns to leave and Willie winds the driver's window down handing the kid a letter and noticing the kid has a black eye Marcus leans forward and glances at Willie rubbing his chin thoughtfully as Gin gets up from the table and leaves A semicomatose Santa lies on the escalator clutching a broken bottle as Marcus back in elf guise tries to calm the kids"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Later on Willie is back at the kid's house in the garage sitting in Roger's BMW with the engine running having run a hose from the exhaust pipe into the driver's window to commit seasonal suicide by carbon monoxide poisoning The kid walks into the garage sees Willie whose head lolls to one side as he inhales the noxious fumes The kid walks over to the car and looks in through the driver's window and Willie moves slightly raising his head a little to look at the kid The kid turns to leave and Willie winds the driver's window down handing the kid a letter and noticing the kid has a black eye Later Willie is smashing into the chief skaterat's face and then turns to the rest of the gang Two other kids on bikes watch astounded as Santa administers the festive beating Back at the mall Marcus and Willie are in the locker rooms after a hard day dishing out presents Marcus gets changed out of his elf gear while Willie in a contemplative mood sits on a bench and sucks on a bottle of gut rot Marcus leans forward and glances at Willie rubbing his chin thoughtfully as Gin gets up from the table and leaves Marcus and Willie regard each other with Willie resignedly resting his head on his hand while Marcus slips into a brooding silence The next day a very large queue of excited children and their mothers forms at the westernthemed Christmas Corral Grotto A semicomatose Santa lies on the escalator clutching a broken bottle as Marcus back in elf guise tries to calm the kids At the top of the escalator Santa drunkenly gets to his feet and lurches slowly towards the grotto bumping into one of the kids as he does so before keeling over and collapsing on top of a fake cactus and a sack of presents The kids and moms gasp as Santa rallies and gets on his feet only to fall over a lifesize model donkey falling on his back and seeing a second donkey going over He scrambles to his feet and slugs the donkey with a big right hook knocking its head off then punches and kicks the donkey's body to bits in a display of drunken violence The moms hurriedly usher their offspring away as Gin strides up drops Willie and drags him away"
        }
      ]
    }
  ]
}