{
  "ground_truth": "Sitting with a cigarette burning in an ashtray beside him, Al-Saleem slots a SIM card into a mobile phone and replaces the battery. He has a drag on the cigarette. He dials a number on the phone. He has another drag on the cigarette. He slowly raises the phone to his ear. A surveillance view of the city. In a park, Hoffman calls Ferris, who's walking through an airport terminal. On a residential street, Ferris and Skip get out of an SUV. They communicate through earpieces. Sadiki emerges from an apartment building. Ferris walks up and follows him to his car. They are watched by men in a white four-by-four. The four-by-four drives at them. Sadiki gets in his car. Ferris smashes a window. Sadiki drives away. Ferris and the attackers exchange fire. An agent drives the SUV after the four-by-four but crashes. Skip is thrown through the windscreen. Ferris keeps shooting. The attackers drive off after Sadiki. Skip lies on the ground covered in blood. Ferris feels for a pulse in his neck. He makes a call on his mobile. Sadiki sits on a chair in a shabby room. A man sits filming him. Al-Saleem's lieutenant pours a drink. He hands the drink to Sadiki. The lieutenant looks at Sadiki curiously. In another room, Al-Saleem watches the video footage of Sadiki on a small screen. Outside the city, a group of boys stand on a hillside. Further down the hill, some dogs mooch about. Sadiki lies dead amongst piles of rubbish. Skip lies unconscious in a hospital bed with a breathing tube in his throat. Ferris stands by the bed, staring at Skip. Ferris swigs from a bottle of soda. Ferris picks up a phone and sits by a window. Sitting on a terrace by a lake, Hoffman pulls out his earpiece and sighs. Ferris walks into his apartment and steps on an envelope. He picks it up and shuts the door. He walks into the living room. He puts his keys on the table and opens the envelope. He takes out a photograph of him and Aisha walking down a street. He stares at the photo. He looks around anxiously. Then, he picks up a bowl and hurls it at the wall. He storms out of the apartment. Aggressively driving through town, he calls Aisha on his mobile. A mobile on a table in Aisha's apartment rings. Ferris speeds along a street and stops. Ferris gets out and runs across the street. He holds out his hand and the car stops. Ferris slaps the bonnet and runs to Aisha's apartment building. He heads up the stairs with his phone pressed to his ear. Ferris slows up as he approaches a gate.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Seated with a cigarette smoldering in an ashtray beside him, Al-Saleem inserts a SIM card into a mobile phone and reinstalls the battery. He takes a puff on the cigarette. He dials a numeral on the phone. He has another puff on the cigarette. He gradually lifts the phone to his ear. A surveillance perspective of the metropolis. In a park, Hoffman contacts Ferris, who's strolling through an airport terminal. On a residential avenue, Ferris and Skip exit an SUV. They communicate through earpieces. Sadiki emerges from an apartment edifice. Ferris approaches and shadows him to his vehicle. They are observed by men in a white four-by-four. The four-by-four accelerates toward them. Sadiki enters his vehicle. Ferris breaks a pane. Sadiki drives off. Ferris and the assailants swap gunfire. An agent maneuvers the SUV after the four-by-four but crashes. Skip is ejected through the windscreen. Ferris continues firing. The attackers drive away after Sadiki. Skip lies on the ground covered in blood. Ferris checks for a pulse in his neck. He makes a call on his mobile. Sadiki sits on a chair in a dingy chamber. A man sits recording him. Al-Saleem's aide pours a beverage. He hands the beverage to Sadiki. The aide observes Sadiki inquisitively. In another chamber, Al-Saleem watches the video footage of Sadiki on a small monitor. Beyond the metropolis, a group of boys stands on a hillside. Further down the hill, some dogs roam about. Sadiki lies deceased amongst heaps of refuse. Skip lies unconscious in a hospital bed with a breathing tube in his throat. Ferris stands by the bed, gazing at Skip. Ferris swigs from a bottle of soda. Ferris picks up a phone and sits by a window. Sitting on a terrace by a lake, Hoffman removes his earpiece and exhales. Ferris walks into his apartment and steps on an envelope. He picks it up and closes the door. He walks into the living room. He places his keys on the table and opens the envelope. He draws out a photograph of him and Aisha walking down a street. He gazes at the photo. He looks around apprehensively. Then, he picks up a bowl and flings it at the wall. He storms out of the apartment. Aggressively driving through town, he calls Aisha on his mobile. A mobile on a table in Aisha's apartment rings. Ferris speeds along a street and stops. Ferris exits and runs across the street. He extends his hand and the car stops. Ferris slaps the bonnet and runs to Aisha's apartment edifice. He heads up the stairs with his phone pressed to his ear. Ferris decelerates as he approaches a gate."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Sitting with a cigarette burning in an ashtray beside him, a SIM card is slotted into a mobile phone by Al-Saleem, and the battery is replaced. The cigarette is dragged on by him. A number is dialed on the phone by him. Another drag is taken on the cigarette by him. The phone is slowly raised to his ear. A surveillance view shows the city. In a park, Ferris is called by Hoffman, who's walking through an airport terminal. On a residential street, an SUV is exited by Ferris and Skip. Communication occurs through earpieces by them. Sadiki emerges from an apartment building. Sadiki is walked up to and followed to his car by Ferris. Men in a white four-by-four watch them. At them, the four-by-four is driven. Sadiki gets in his car. A window is smashed by Ferris. Sadiki drives away. Fire is exchanged between Ferris and the attackers. The SUV is driven after the four-by-four by an agent but crashes. Skip is thrown through the windscreen. Shooting is kept up by Ferris. The attackers drive off after Sadiki. On the ground, Skip lies covered in blood. A pulse is felt in Skip's neck by Ferris. A call is made on his mobile by him. In a shabby room, Sadiki sits on a chair. A man films him. A drink is poured by Al-Saleem's lieutenant. The drink is handed to Sadiki by him. Sadiki is looked at curiously by the lieutenant. In another room, video footage of Sadiki is watched on a small screen by Al-Saleem. Outside the city, a group of boys stand on a hillside. Further down the hill, some dogs mooch about. Amongst piles of rubbish, Sadiki lies dead. In a hospital bed, Skip lies unconscious with a breathing tube in his throat. By the bed, Ferris stands, staring at Skip. A bottle of soda is swigged from by Ferris. A phone is picked up, and Ferris sits by a window. Sitting on a terrace by a lake, his earpiece is pulled out, and Hoffman sighs. Into his apartment, Ferris walks and steps on an envelope. It is picked up by him, and the door is shut. He walks into the living room. His keys are put on the table, and the envelope is opened by him. A photograph of him and Aisha walking down a street is taken out by him. The photo is stared at by him. He looks around anxiously. Then, a bowl is picked up and hurled at the wall by him. The apartment is stormed out of by him. Through town, he aggressively drives and Aisha is called on his mobile. A mobile on a table in Aisha's apartment rings. Along a street, Ferris speeds and stops. The car is gotten out of, and he runs across the street. His hand is held out by him, and the car stops. The bonnet is slapped, and he runs to Aisha's apartment building. The stairs are headed up with his phone pressed to his ear. As he approaches a gate, Ferris slows up."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "With a cigarette burning beside him, Al-Saleem inserts a SIM card into a phone and replaces the battery. After taking a drag, he dials a number and slowly raises the phone to his ear. Meanwhile, Hoffman contacts Ferris at an airport terminal. Ferris and Skip exit an SUV on a residential street, communicating via earpieces. Sadiki leaves an apartment, followed by Ferris, under watch by men in a white SUV. The SUV charges them; Sadiki drives off as Ferris smashes a window and exchanges gunfire. An agent chases but crashes. Skip is flung through the windshield. The attackers flee after Sadiki. Ferris checks Skip for a pulse and makes a call. Sadiki sits in a shabby room, filmed by a man. Al-Saleem's lieutenant gives Sadiki a drink and watches him. Al-Saleem views footage of Sadiki. Outside the city, boys stand on a hillside near dogs, while Sadiki's body lies in rubbish. Skip is unconscious in the hospital, Ferris watching him while drinking soda. Ferris picks up a phone, sitting by a window. Hoffman removes his earpiece on a lake terrace. Ferris finds an envelope with a photo of him and Aisha in his apartment, becomes anxious, and throws a bowl. He then storms out, calls Aisha while driving, and runs to her building. He approaches a gate with his phone to his ear."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Al-Saleem slots a SIM card into a phone, takes a drag on his cigarette, and dials a number. In a park, Hoffman calls Ferris, who's walking in an airport. Ferris and Skip exit an SUV on a street using earpieces. They follow Sadiki, who is watched by men in a white vehicle. The attackers drive towards Sadiki. Ferris shatters a car window, leading to a gunfire exchange. An agent crashes the SUV; Skip is ejected. Ferris checks Skip's pulse. Sadiki is filmed in a shabby room; Al-Saleem watches this footage. Outside the city, boys stand on a hillside, and Sadiki is dead amidst rubbish. Skip lies unconscious in a hospital bed; Ferris stands by him. Ferris, holding a soda, sits with a phone. Hoffman removes his earpiece on a terrace. Ferris finds an envelope at home, opens it to see a photo of him and Aisha, and throws a bowl in frustration. Driving aggressively, Ferris calls Aisha, then stops, runs to her apartment, and approaches a gate with his phone to his ear."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Seated calmly with a cigarette idly burning in an ashtray beside him, Al-Saleem methodically inserts a SIM card into a mobile phone and deftly replaces the battery. Taking a drag from the cigarette, he inhales deeply. With deliberate precision, he dials a number on the phone. He pauses to take another long drag on the cigarette. Gradually, he raises the phone to his ear. Meanwhile, a surveillance view captures the bustling cityscape. In a nearby park, Hoffman reaches out to connect with Ferris, who is briskly walking through the busy corridors of an airport terminal. On a quiet residential street, Ferris and Skip step out from an SUV, exchanging communication through their concealed earpieces. Sadiki appears, emerging from an apartment building. Ferris approaches him with focus, trailing him to his car. Menacingly, men in a white four-by-four observe them closely. The vehicle accelerates aggressively at them. Sadiki hastily gets into his car. Ferris, determined, smashes a window. Sadiki makes his escape, driving away rapidly. A shootout ensues as Ferris exchanges gunfire with the attackers. In a tense chase, an agent follows in the SUV, pursuing the four-by-four but ends up crashing violently. Skip is violently ejected through the windscreen. Ferris persists in shooting. The attackers retreat, continuing their pursuit of Sadiki. Skip lies motionless on the ground, bloodied and severely injured. Ferris urgently checks for a pulse in his neck. He quickly makes a call on his mobile phone. Meanwhile, Sadiki is seated on a chair in a dilapidated room. Another man is there, filming him intently. Al-Saleem's lieutenant, with measured movements, pours a drink and passes it to Sadiki, examining him with a curious gaze. In a separate room, Al-Saleem intently watches the video footage of Sadiki being played on a small screen. Beyond the city's outskirts, a group of young boys stands on a hillside. Down the slope, a few dogs leisurely wander about. Amongst scattered piles of refuse, Sadiki's lifeless body lies. Skip remains unconscious in a hospital bed, a breathing tube inserted in his throat. Ferris stands vigilantly by the bed, his gaze fixed on Skip’s inert form. Ferris sips from a bottle of soda. He then picks up a phone and situates himself by a window. Sitting on an expansive terrace overlooking a serene lake, Hoffman removes his earpiece and lets out a weary sigh. Ferris enters his apartment, inadvertently stepping on an envelope. He picks it up, takes a moment to close the door, and proceeds into the living room. Placing his keys on the table, he opens the envelope to reveal a photograph of him and Aisha walking together down a street. He stares intensely at the photo, a look of rising anxiety on his face. He glances around the room with trepidation, before impulsively picking up a bowl and hurling it violently against the wall. In a fit of emotion, he storms out of the apartment. Driven by a sense of urgency, he speeds through town, dialing Aisha on his mobile. In Aisha's apartment, her mobile phone, resting on a table, rings audibly. Ferris, still in haste, speeds down a street, then brings his vehicle to a screeching halt. He exits the car and runs across the street, signaling with his hand for an approaching car to stop. Slapping the bonnet, he rushes toward Aisha's apartment building. He makes his way rapidly up the stairs, his phone still pressed firmly to his ear. As Ferris approaches a gate, his pace slows, reflecting his intense determination and rising anticipation."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Comfortably seated with a cigarette lazily burning down in the ashtray positioned beside him, Al-Saleem meticulously and methodically inserts a small SIM card into a mobile phone, then deftly replaces the phone’s battery with practiced ease. Taking a deliberate drag from the thin cigarette, he inhales deeply, savoring the moment. With deliberate and precise motions, he dials a number on the phone's keypad. He pauses briefly to take another long, contemplative drag on the cigarette. Gradually, with an air of calm assurance, he raises the phone to his ear. Meanwhile, a wide surveillance view captures the vibrant and bustling cityscape teeming with life. In a nearby park, Hoffman attempts to establish a connection with Ferris, who is briskly maneuvering through the busy and crowded corridors of an airport terminal. On a quiet residential street lined with homes, Ferris and Skip emerge from an SUV, engaging in discreet communication through their hidden earpieces. Sadiki makes an appearance, emerging from the entrance of an apartment building. Ferris, with a focused demeanor, approaches him and follows him to his car. Menacingly, a group of men in a white four-by-four vehicle observe them intently and closely. The vehicle suddenly accelerates aggressively in their direction. Sadiki quickly gets into his car. Ferris, with determination and urgency, smashes a window. Sadiki escapes hastily, driving away at high speed. A chaotic shootout ensues as Ferris exchanges gunfire with the attackers. In a tense and high-stakes chase, an agent follows in the SUV, pursuing the relentless four-by-four, but ends up crashing violently and disastrously. Skip is violently ejected through the shattered windscreen. Ferris continues shooting persistently. The attackers retreat, continuing their determined pursuit of Sadiki. Skip lies lifelessly motionless on the ground, severely bloodied and injured beyond immediate help. Ferris urgently checks for a faint pulse in Skip's neck. He quickly makes an urgent call on his mobile phone. Meanwhile, in a dilapidated room, Sadiki finds himself seated on a rickety chair. Another man is present, intently filming him with a camera. Al-Saleem's lieutenant, with measured and deliberate movements, pours a drink carefully and passes it to Sadiki, examining him with a curious, probing gaze. In a separate room, Al-Saleem intently watches the video footage of Sadiki being played on a small screen. Beyond the vast city’s outskirts, a group of young boys stands on a rolling hillside. Down the gentle slope, a few dogs wander about leisurely. Amidst scattered piles of refuse, Sadiki's lifeless body lies still. Skip remains unconscious in a hospital bed, a breathing tube inserted in his throat to aid his breathing. Ferris stands vigilantly by the bed, his gaze fixed intently on Skip’s inert form. Ferris takes a sip from a bottle of soda. He then picks up his phone and stations himself by a window. Sitting on an expansive terrace that overlooks a serene and tranquil lake, Hoffman removes his earpiece and releases a weary sigh. Ferris enters his apartment, inadvertently stepping on an envelope left on the floor. He picks it up, takes a brief moment to close the door behind him, and proceeds into the living room. Placing his keys on the table, he opens the envelope to reveal a photograph showing him and Aisha walking together down a street. He stares intensely at the photo, rising anxiety evident on his face. He glances anxiously around the room, eyes filled with trepidation, before impulsively picking up a nearby bowl and hurling it violently against the wall. In a fit of emotion, he storms out of the apartment. Driven by a sense of urgency, he speeds through town, dialing Aisha on his mobile phone. In Aisha's apartment, her mobile phone, resting on a table, rings audibly. Ferris, still in a state of haste, speeds down a street, then brings his vehicle to a screeching and abrupt halt. He exits the car and runs across the street, signaling with his hand for an approaching car to stop. Slapping the bonnet of the car, he rushes determinedly toward Aisha's apartment building. He makes his way rapidly up the stairs, all the while keeping his phone pressed firmly to his ear. As Ferris approaches the gate, his pace slows, reflecting both his intense determination and rising anticipation."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Seated with a cigarette slowly burning in an ashtray beside him, Al-Saleem meticulously positions a SIM card into the designated slot of a mobile phone and carefully replaces the battery. As a thin stream of smoke curls upward, he takes a deliberate drag on the cigarette, savoring the moment. With the device now operational, he calmly dials a number on the phone, the keys clicking softly under his fingers. He pauses briefly for another drag, allowing the acrid taste to linger before exhaling slowly. He then gradually lifts the phone to his ear, each motion deliberate and measured. The scene shifts to an aerial surveillance view of the city, capturing the intricate web of streets and structures. In a nearby park, Hoffman pulls out his phone to contact Ferris, who is navigating his way through the bustling confines of an airport terminal. Meanwhile, on a quiet residential street, Ferris and Skip emerge from an SUV, seamlessly coordinating through discreet earpieces. They remain vigilant as Sadiki exits an apartment building, prompting Ferris to purposefully approach and shadow Sadiki to his vehicle. Unbeknownst to them, they are under the watchful eyes of men inside a white four-by-four. Without warning, the four-by-four accelerates aggressively toward them. As Sadiki hastily climbs into his car, Ferris reacts swiftly, shattering a window in the chaos. Sadiki speeds away, and Ferris engages in a fierce exchange of gunfire with the attackers. An agent takes control of the SUV to pursue the four-by-four, but the chase ends abruptly as the SUV crashes violently, sending Skip hurtling through the windshield, leaving him bloodied and motionless on the ground. Amidst the turmoil, Ferris continues to fire at the retreating assailants, now following Sadiki. With urgency, Ferris kneels beside Skip, searching for a pulse in his neck, and then makes a critical call on his mobile. In a dilapidated room, Sadiki, now captive, sits forlornly on a chair as a man focuses a camera on him. Al-Saleem's lieutenant, offering an unsettling hospitality, pours a drink and hands it to Sadiki while examining him with a curious gaze. In a separate room, Al-Saleem watches the recorded footage of Sadiki on a small screen, absorbing every detail. Outside the urban sprawl, a group of boys gather on a hillside, their carefree stance contrasting with the grim scene below, where stray dogs roam around Sadiki's lifeless body amidst heaps of debris. In a stark hospital room, Skip lies unconscious, his life precariously sustained by a breathing tube. Standing vigilantly by the bed, Ferris stares intently at Skip, the weight of recent events etched on his face. He takes a swig from a bottle of soda, the cold liquid offering a momentary reprieve. Seeking solace, Ferris picks up his phone and settles by a window, the cityscape spread out before him. Meanwhile, seated on a terrace overlooking a serene lake, Hoffman extracts his earpiece and exhales a heavy sigh, the weight of the day apparent. Returning to his apartment, Ferris inadvertently steps on an envelope lying on the floor. Intrigued, he picks it up, shuts the door behind him, and strides into the living room. Methodically placing his keys on the table, he opens the envelope to reveal a poignant photograph of him and Aisha strolling down a street. Staring at the image, his expression shifts to one of anxiety as he scans the room worriedly. Overcome with emotion, he seizes a bowl and hurls it against the wall in a fit of frustration, the sound echoing through the apartment. With determination, he storms out, aggressively navigating his vehicle through the town. While driving, he makes a call to Aisha on his mobile, his urgency palpable. In Aisha's apartment, a mobile phone vibrates insistently on a table. Back on the street, Ferris accelerates down the road, abruptly stopping to leap out and sprint across the street. With resolve, he holds out his hand to halt an oncoming car, slapping the bonnet before racing toward Aisha's apartment building. Once inside, he ascends the stairs, the phone pressed against his ear, each step measured yet hurried. As he nears a gate, his pace diminishes, a new wave of anticipation taking hold."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Al-Saleem, with a cigarette burning beside him, inserts a SIM card into a phone, takes a couple of drags, and makes a call. Meanwhile, a surveillance view shows Hoffman contacting Ferris at an airport. Ferris and Skip leave an SUV on a residential street, communicating via earpieces as they follow Sadiki, who is under observation from a white four-by-four. The situation escalates quickly as the attackers advance; Sadiki escapes by car, Ferris breaks a window, and a firefight ensues, leading to a crash where Skip is injured. As the attackers pursue Sadiki, Ferris checks on Skip's condition and calls for help. \n\nElsewhere, Sadiki is filmed in a rundown room while Al-Saleem's lieutenant serves him a drink, watched by Al-Saleem on video footage. Outside the city, a group of boys stands on a hillside near where Sadiki lies dead. At the hospital, Ferris, visibly affected, watches over an unconscious Skip. Ferris' contemplation is interrupted by a call, and Hoffman, sitting lakeside, removes his earpiece with a sigh.\n\nBack home, Ferris steps on an envelope upon entering his apartment. Inside, he finds a photo of himself and Aisha, leading to anxious introspection. In frustration, he throws a bowl and leaves the apartment, driving aggressively while calling Aisha. Ferris halts and runs across the street to her building, uneasily advancing up the stairs with his phone to his ear as he reaches a gate."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Sitting with a cigarette burning in an ashtray beside him, Al-Saleem, a figure known to be a key player in underground networks, slots a SIM card into a mobile phone and replaces the battery, aware that this routine action is part of a larger, sinister plan. He has a drag on the cigarette, the brand of which is favored in his region for its rich, bold flavor. He dials a number on the phone, a contact important enough to warrant such secrecy. He has another drag on the cigarette, exhaling slowly as if contemplating the upcoming conversation. He slowly raises the phone to his ear, fully aware of the surveillance view of the city currently being monitored by intelligence agencies from miles away. \n\nIn a park, Hoffman, a CIA operative known for his strategic mind, calls Ferris, who's walking through an airport terminal, a location bustling with travelers and tightly monitored by airport security. On a residential street, Ferris and Skip, his trusted partner with a notable military background, get out of an SUV, a common choice among security teams for its reliability and space. They communicate through earpieces, ensuring their conversation remains private amidst potential eavesdroppers. Sadiki, who has been under observation for some time due to his connections to high-profile targets, emerges from an apartment building. Ferris walks up and follows him to his car, knowing that each step could lead to crucial information. They are watched by men in a white four-by-four, a vehicle often used by covert operatives for its unassuming appearance in urban areas. The four-by-four drives at them with intent to intimidate. Sadiki gets in his car, trying to escape the escalating situation. Ferris smashes a window, an act of desperation to prevent Sadiki's flight. Sadiki drives away, aware of the danger but determined to flee. Ferris and the attackers exchange fire, a risky gamble given the densely populated area. An agent drives the SUV after the four-by-four but crashes in a twist of fate, sending Skip flying through the windscreen. Ferris keeps shooting, focused on stopping the pursuit. The attackers drive off after Sadiki, their mission far from over. Skip lies on the ground covered in blood, his survival uncertain. Ferris feels for a pulse in his neck, desperately hoping for a sign of life. He makes a call on his mobile, seeking immediate medical assistance. \n\nSadiki sits on a chair in a shabby room, a stark contrast to the world of power he once roamed. A man sits filming him, documenting what could be vital evidence. Al-Saleem's lieutenant, a man of few words but critical influence, pours a drink and hands it to Sadiki, perhaps as a gesture of feigned hospitality. The lieutenant looks at Sadiki curiously, his mind likely evaluating Sadiki's next moves. In another room, Al-Saleem watches the video footage of Sadiki on a small screen, analyzing every detail with a strategist's eye. Outside the city, a group of boys stand on a hillside, unaware of the turmoil below. Further down the hill, some dogs mooch about, scavenging through the debris. Sadiki lies dead amongst piles of rubbish, his fate sealed in the chaos. Skip lies unconscious in a hospital bed with a breathing tube in his throat, fighting for life under medical supervision. Ferris stands by the bed, staring at Skip, grappling with the weight of their mission's cost. Ferris swigs from a bottle of soda, trying to quench a thirst driven by stress and fatigue. Ferris picks up a phone and sits by a window, contemplating his next move as daylight fades.\n\nSitting on a terrace by a lake known for its tranquil, escape-inviting atmosphere, Hoffman pulls out his earpiece and sighs, burdened by the complexity of his duties. Ferris walks into his apartment and steps on an envelope, recognizing it as an unexpected and possibly ominous delivery. He picks it up and shuts the door, sensing the content inside could change everything. He walks into the living room, a place that once felt like a safe haven but now feels penetrable. He puts his keys on the table and opens the envelope, bracing for what comes next. He takes out a photograph of him and Aisha walking down a street, a reminder of happier times shared with someone dear. He stares at the photo, his mind racing with emotions and unanswered questions. He looks around anxiously, the feeling of being watched creeping in. Then, he picks up a bowl and hurls it at the wall, frustration boiling over into action. He storms out of the apartment, driven by a surge of emotion. Aggressively driving through town, he calls Aisha on his mobile, hoping for answers or at least reassurance. A mobile on a table in Aisha's apartment rings, echoing in the emptiness of her absence. Ferris speeds along a street and stops, determination pushing him forward. Ferris gets out and runs across the street, urgency in every step. He holds out his hand and the car stops, acknowledging his authority in the situation. Ferris slaps the bonnet and runs to Aisha's apartment building, hope and fear intertwined with each stride. He heads up the stairs with his phone pressed to his ear, the silence of the building amplifying his pounding heart. Ferris slows up as he approaches a gate, confronting the uncertainty ahead."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "On a residential street Ferris and Skip get out of an SUV Sitting with a cigarette burning in an ashtray beside him AlSaleem slots a SIM card into a mobile phone and replaces the battery He has a drag on the cigarette He dials a number on the phone He has another drag on the cigarette Skip lies unconscious in a hospital bed with a breathing tube in his throat He slowly raises the phone to his ear A surveillance view of the city In a park Hoffman calls Ferris who is walking through an airport terminal On a residential street Ferris and Skip get out of an SUV Sadiki lies dead amongst piles of rubbish They communicate through earpieces Skip is thrown through the windscreen The lieutenant looks at Sadiki curiously Ferris slaps the bonnet and runs to Aisha's apartment building Sadiki emerges from an apartment building He hands the drink to Sadiki Ferris walks up and follows him to his car Hoffman pulls out his earpiece and sighs They are watched by men in a white fourbyfour The fourbyfour drives at them Sadiki gets in his car Ferris smashes a window Sadiki drives away Ferris and the attackers exchange fire An agent drives the SUV after the fourbyfour but crashes He stares at the photo Skip is thrown through the windscreen Ferris keeps shooting They communicate through earpieces The attackers drive off after Sadiki Skip lies on the ground covered in blood Ferris feels for a pulse in his neck He makes a call on his mobile Ferris swigs from a bottle of soda Sadiki sits on a chair in a shabby room A man sits filming him A mobile on a table in Aisha's apartment rings He holds out his hand and the car stops Ferris smashes a window AlSaleem's lieutenant pours a drink He hands the drink to Sadiki The lieutenant looks at Sadiki curiously In another room AlSaleem watches the video footage of Sadiki on a small screen Outside the city a group of boys stand on a hillside Further down the hill some dogs mooch about In a park Hoffman calls Ferris who is walking through an airport terminal Sadiki lies dead amongst piles of rubbish Skip lies unconscious in a hospital bed with a breathing tube in his throat Ferris stands by the bed staring at Skip Sadiki gets in his car Sitting on a terrace by a lake Ferris swigs from a bottle of soda Then he picks up a bowl and hurls it at the wall Ferris picks up a phone and sits by a window A surveillance view of the city Sitting on a terrace by a lake Hoffman pulls out his earpiece and sighs He dials a number on the phone Ferris walks into his apartment and steps on an envelope He picks it up and shuts the door He walks into the living room He puts his keys on the table and opens the envelope He picks it up and shuts the door Sadiki drives away Ferris and the attackers exchange fire He takes out a photograph of him and Aisha walking down a street He stares at the photo He looks around anxiously Then he picks up a bowl and hurls it at the wall He storms out of the apartment He has a drag on the cigarette Aggressively driving through town he calls Aisha on his mobile Ferris keeps shooting A mobile on a table in Aisha's apartment rings The fourbyfour drives at them Aggressively driving through town he calls Aisha on his mobile Ferris speeds along a street and stops Ferris gets out and runs across the street He holds out his hand and the car stops Ferris slaps the bonnet and runs to Aisha's apartment building He heads up the stairs with his phone pressed to his ear AlSaleem's lieutenant pours a drink Ferris slows up as he approaches a gate He walks into the living room"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Sitting with a cigarette burning in an ashtray beside him AlSaleem slots a SIM card into a mobile phone and replaces the battery. He has a drag on the cigarette. He dials a number on the phone. He has another drag on the cigarette. He slowly raises the phone to his ear. A surveillance view of the city. In a park Hoffman calls Ferris who is walking through an airport terminal. On a residential street Ferris and Skip get out of an SUV. They communicate through earpieces. Sadiki emerges from an apartment building. Ferris walks up and follows him to his car. They are watched by men in a white fourbyfour. The fourbyfour drives at them. Sadiki gets in his car. Ferris smashes a window. Sadiki drives away Ferris and the attackers exchange fire. An agent drives the SUV after the fourbyfour but crashes. Skip is thrown through the windscreen. Ferris keeps shooting. The attackers drive off after Sadiki. Skip lies on the ground covered in blood. Ferris feels for a pulse in his neck. He makes a call on his mobile. Sadiki sits on a chair in a shabby room. A man sits filming him. AlSaleem's lieutenant pours a drink. He hands the drink to Sadiki. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. The lieutenant looks at Sadiki curiously. In another room AlSaleem watches the video footage of Sadiki on a small screen. Outside the city a group of boys stand on a hillside. Further down the hill some dogs mooch about. Sadiki lies dead amongst piles of rubbish. Skip lies unconscious in a hospital bed with a breathing tube in his throat. Ferris stands by the bed staring at Skip. Ferris swigs from a bottle of soda. Ferris picks up a phone and sits by a window. Sitting on a terrace by a lake. Hoffman pulls out his earpiece and sighs. Ferris walks into his apartment and steps on an envelope. He picks it up and shuts the door. He walks into the living room. He puts his keys on the table and opens the envelope. He takes out a photograph of him and Aisha walking down a street. He stares at the photo. He looks around anxiously. Then he picks up a bowl and hurls it at the wall. He storms out of the apartment. Aggressively driving through town he calls Aisha on his mobile. A mobile on a table in Aisha's apartment rings. Ferris speeds along a street and stops. Ferris gets out and runs across the street. He holds out his hand and the car stops. Ferris slaps the bonnet and runs to Aisha's apartment building. He heads up the stairs with his phone pressed to his ear. Ferris slows up as he approaches a gate."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Sitting with a cigarette burning in an ashtray beside him AlSaleem slots a SIM card into a mobile phone and replaces the battery. He has a drag on the cigarette. He dials a number on the phone. He has another drag on the cigarette. He slowly raises the phone to his ear. A surveillance view of the city. In a park Hoffman calls Ferris who is walking through an airport terminal. On a residential street Ferris and Skip get out of an SUV. They communicate through earpieces. Sadiki emerges from an apartment building. Ferris walks up and follows him to his car. They are watched by men in a white fourbyfour. The fourbyfour drives at them. Sadiki gets in his car. Ferris smashes a window. Sadiki drives away Ferris and the attackers exchange fire. An agent drives the SUV after the fourbyfour but crashes. Skip is thrown through the windscreen. Ferris keeps shooting. The attackers drive off after Sadiki. Skip lies on the ground covered in blood. Ferris feels for a pulse in his neck. He makes a call on his mobile. Sadiki sits on a chair in a shabby room. A man sits filming him. AlSaleem's lieutenant pours a drink. He hands the drink to Sadiki. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. The lieutenant looks at Sadiki curiously. In another room AlSaleem watches the video footage of Sadiki on a small screen. Outside the city a group of boys stand on a hillside. Further down the hill some dogs mooch about. Sadiki lies dead amongst piles of rubbish. Skip lies unconscious in a hospital bed with a breathing tube in his throat. Ferris stands by the bed staring at Skip. Ferris swigs from a bottle of soda. Ferris picks up a phone and sits by a window. Sitting on a terrace by a lake. Hoffman pulls out his earpiece and sighs. Ferris walks into his apartment and steps on an envelope. He picks it up and shuts the door. He walks into the living room. He puts his keys on the table and opens the envelope. He takes out a photograph of him and Aisha walking down a street. He stares at the photo. He looks around anxiously. Then he picks up a bowl and hurls it at the wall. He storms out of the apartment. Aggressively driving through town he calls Aisha on his mobile. A mobile on a table in Aisha's apartment rings. Ferris speeds along a street and stops. Ferris gets out and runs across the street. He holds out his hand and the car stops. Ferris slaps the bonnet and runs to Aisha's apartment building. He heads up the stairs with his phone pressed to his ear. Ferris slows up as he approaches a gate."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Sitting with a cigarette burning in an ashtray beside him AlSaleem slots a SIM card into a mobile phone and replaces the battery. He has a drag on the cigarette. He dials a number on the phone. He has another drag on the cigarette. He slowly raises the phone to his ear. A surveillance view of the city. In a park Hoffman calls Ferris who is walking through an airport terminal. On a residential street Ferris and Skip get out of an SUV. They communicate through earpieces. Sadiki emerges from an apartment building. Ferris walks up and follows him to his car. They are watched by men in a white fourbyfour. The fourbyfour drives at them. Sadiki gets in his car. He puts his keys on the table and opens the envelope. He takes out a photograph of him and Aisha walking down a street. He stares at the photo. He looks around anxiously. Then he picks up a bowl and hurls it at the wall. He storms out of the apartment. Aggressively driving through town he calls Aisha on his mobile. A mobile on a table in Aisha's apartment rings. Ferris speeds along a street and stops. Ferris gets out and runs across the street. He holds out his hand and the car stops. Ferris slaps the bonnet and runs to Aisha's apartment building. He heads up the stairs with his phone pressed to his ear. Ferris slows up as he approaches a gate."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Sitting with a cigarette burning in an ashtray beside him AlSaleem slots a SIM card into a mobile phone and replaces the battery. He has a drag on the cigarette. He dials a number on the phone. He has another drag on the cigarette. He slowly raises the phone to his ear. Ferris speeds along a street and stops. Ferris gets out and runs across the street. He holds out his hand and the car stops. Ferris slaps the bonnet and runs to Aisha's apartment building. He heads up the stairs with his phone pressed to his ear. Ferris slows up as he approaches a gate."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Sitting with a cigarette burning in an ashtray beside her, the cat slots a SIM card into a mobile phone and replaces the battery. The cat has a drag on the cigarette. The cat dials a number on the phone. The cat has another drag on the cigarette. The cat slowly raises the phone to her ear. A surveillance view of the city. In a park, the squirrel calls the penguin, who's walking through an airport terminal. On a residential street, the penguin and the rabbit get out of an SUV. They communicate through earpieces. The parrot emerges from an apartment building. The penguin walks up and follows the parrot to his car. They are watched by men in a white four-by-four. The four-by-four drives at them. The parrot gets in his car. The penguin smashes a window. The parrot drives away. The penguin and the attackers exchange fire. An octopus drives the SUV after the four-by-four but crashes. The rabbit is thrown through the windscreen. The penguin keeps shooting. The attackers drive off after the parrot. The rabbit lies on the ground covered in blood. The penguin feels for a pulse in his neck. The penguin makes a call on his mobile. The parrot sits on a chair in a shabby room. A dog sits filming him. The giraffe's lieutenant pours a drink. The lieutenant hands the drink to the parrot. The lieutenant looks at the parrot curiously. In another room, the giraffe watches the video footage of the parrot on a small screen. Outside the city, a group of turtles stand on a hillside. Further down the hill, some cats mooch about. The parrot lies dead amongst piles of rubbish. The rabbit lies unconscious in a hospital bed with a breathing tube in his throat. The penguin stands by the bed, staring at the rabbit. The penguin swigs from a bottle of soda. The penguin picks up a phone and sits by a window. Sitting on a terrace by a lake, the monkey pulls out his earpiece and sighs. The penguin walks into his apartment and steps on an envelope. The penguin picks it up and shuts the door. The penguin walks into the living room. The penguin puts his keys on the table and opens the envelope. The penguin takes out a photograph of him and the llama walking down a street. The penguin stares at the photo. The penguin looks around anxiously. Then, the penguin picks up a bowl and hurls it at the wall. The penguin storms out of the apartment. Aggressively driving through town, the penguin calls the llama on his mobile. A mobile on a table in the llama's apartment rings. The penguin speeds along a street and stops. The penguin gets out and runs across the street. The penguin holds out his hand and the car stops. The penguin slaps the bonnet and runs to the llama's apartment building. The penguin heads up the stairs with his phone pressed to his ear. The penguin slows up as he approaches a gate."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Sitting with a candle burning in a lantern beside him, Al-Saleem slots a memory card into a tablet and replaces the cover. He takes a sip of his tea. He dials a number on the tablet. He takes another sip of his tea. He slowly raises the tablet to his ear. A surveillance view of the countryside. In a garden, Hoffman calls Ferris, who's strolling through a bus terminal. On a commercial street, Ferris and Skip get out of a minivan. They communicate through walkie-talkies. Sadiki emerges from a bookstore. Ferris walks up and follows him to his bicycle. They are watched by men in a red sedan. The sedan drives at them. Sadiki gets on his bicycle. Ferris kicks a tire. Sadiki rides away. Ferris and the attackers exchange fire. An agent drives the minivan after the sedan but crashes. Skip is thrown through the windshield. Ferris keeps shooting. The attackers drive off after Sadiki. Skip lies on the ground covered in paint. Ferris feels for a pulse in his wrist. He makes a call on his tablet. Sadiki sits on a bench in a cluttered room. A man sits sketching him. Al-Saleem's lieutenant pours a drink. He hands the drink to Sadiki. The lieutenant looks at Sadiki curiously. In another room, Al-Saleem watches the sketching of Sadiki on a large screen. Outside the town, a group of girls stand on a rooftop. Further down the slope, some cats wander about. Sadiki lies unconscious amongst piles of debris. Skip lies unconscious in a clinic bed with an oxygen mask on his face. Ferris stands by the bed, staring at Skip. Ferris swigs from a bottle of juice. Ferris picks up a tablet and sits by a balcony. Sitting on a porch by a pond, Hoffman pulls out his earpiece and sighs. Ferris walks into his house and steps on a package. He picks it up and shuts the door. He walks into the dining room. He puts his keys on the shelf and opens the package. He takes out a postcard of him and Aisha walking through a market. He stares at the postcard. He looks around nervously. Then, he picks up a vase and hurls it at the wall. He storms out of the house. Aggressively driving through town, he calls Aisha on his tablet. A tablet on a chair in Aisha's office rings. Ferris speeds along a road and stops. Ferris gets out and runs across the road. He holds out his hand and the van stops. Ferris slaps the hood and runs to Aisha's office building. He heads up the elevator with his tablet pressed to his ear. Ferris slows up as he approaches an archway."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Sitting with a cigarette smoldering in an ashtray beside him, Al-Saleem flips through a notebook and tosses the battery aside. He stares at the cigarette. He taps a rhythm on the phone. He examines the cigarette. He gently lowers the phone to the table. A panorama view of the city. In a park, Hoffman signals Ferris, who's browsing through an airport terminal. On a residential street, Ferris and Skip leap out of an SUV. They gesture through earpieces. Sadiki steps out of an apartment building. Ferris strolls up and shadows him to his car. They are observed by men in a white four-by-four. The four-by-four idles near them. Sadiki reclines in his car. Ferris shatters a glass. Sadiki speeds off. Ferris and the attackers exchange glances. An agent drags the SUV after the four-by-four but veers off. Skip is tossed through the windscreen. Ferris continues yelling. The attackers cruise off after Sadiki. Skip rests on the ground covered in blood. Ferris listens for a pulse in his neck. He scribbles a note on his mobile. Sadiki lounges on a chair in a shabby room. A man stands observing him. Al-Saleem's lieutenant assembles a puzzle. He offers the completed piece to Sadiki. The lieutenant gazes at Sadiki thoughtfully. In another area, Al-Saleem previews the video footage of Sadiki on a small screen. Outside the city, a group of boys lounge on a hillside. Further down the hill, some dogs wander around. Sadiki reclines dead amongst piles of rubbish. Skip lies unconscious in a hospital bed with a breathing tube in his throat. Ferris stands by the bed, gazing at Skip. Ferris sips from a bottle of soda. Ferris grabs a phone and leans by a window. Sitting on a terrace by a lake, Hoffman removes his earpiece and yawns. Ferris strides into his apartment and kicks an envelope. He examines it and slams the door. He strides into the living room. He drops his keys on the table and tears the envelope open. He takes out a photograph of him and Aisha strolling down a street. He glances at the photo. He scans the room nervously. Then, he grasps a bowl and launches it at the wall. He stomps out of the apartment. Recklessly cruising through town, he texts Aisha on his mobile. A mobile on a table in Aisha's apartment buzzes. Ferris races along a street and pauses. Ferris leaps out and sprints across the street. He waves his hand and the car halts. Ferris taps the bonnet and rushes to Aisha's apartment building. He ascends the stairs with his phone pressed to his ear. Ferris slows down as he nears a gate."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Sitting with a candle flickering in a lantern beside it, the elephant slides a library card into a calculator and replaces the battery. It takes a sip from the candle. It dials a number on the calculator. It takes another sip from the candle. It slowly raises the calculator to its ear. A panoramic view of the stadium. On a bench, the pineapple calls the umbrella, who's wandering through a museum corridor. On a suburban lane, the umbrella and the trampoline get out of a bicycle. They communicate through headphones. The suitcase emerges from a garage. The umbrella strolls up and follows it to its boat. They are observed by cats in a red skateboard. The skateboard rolls at them. The suitcase climbs into its boat. The umbrella shatters a mirror. The suitcase sails away. The umbrella and the penguins exchange glances. A comet drives the bicycle after the skateboard but collides. The trampoline is tossed through the mirror. The umbrella keeps shouting. The penguins drive off after the suitcase. The trampoline lies on the pavement covered in paint. The umbrella checks for a breath in its toe. It makes a call on its calculator. The suitcase sits on a couch in a dilapidated hall. A pizza sits photographing it. The elephant's assistant pours a smoothie. It hands the smoothie to the suitcase. The assistant gazes at the suitcase inquisitively. In another hall, the elephant watches the slideshow of the suitcase on a tiny projector. Beyond the village, a troop of cats linger on a mountain. Further down the slope, some birds wander about. The suitcase lies motionless amongst heaps of dirt. The trampoline lies unconscious in a clinic cot with a snorkel in its mouth. The umbrella stands by the cot, gazing at the trampoline. The umbrella takes a gulp from a flask of milkshake. The umbrella grabs a banana and sits by a curtain. Perched on a balcony by a pond, the pineapple extracts its headphones and exhales. The umbrella strides into its office and steps on a postcard. It retrieves it and shuts the gate. It saunters into the dining room. It places its hat on the desk and opens the postcard. It takes out a sketch of it and the kite strolling down a boulevard. It gazes at the sketch. It glances around nervously. Then, it grabs a spoon and flings it at the curtain. It bolts out of the office. Recklessly driving through the village, it calls the kite on its calculator. A calculator on a desk in the kite's office rings. The umbrella speeds along a boulevard and halts. The umbrella climbs out and dashes across the boulevard. It extends its arm and the boat halts. The umbrella taps the grille and sprints to the kite's office building. It strides up the ladder with its calculator pressed to its ear. The umbrella slows as it nears a window."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Sitting with a candy burning in a candle holder beside him, Johnson inserts a memory card into a digital camera and swaps the battery. He takes a sip from the soda. He composes a text on the camera. He takes another sip from the soda. He gradually lowers the camera to his lap. An observatory view of the town. In a museum, Martinez contacts Riley, who's strolling through a train station hall. On a suburban avenue, Riley and Eddy hop out of a minivan. They converse through walkie-talkies. Kadir exits from a shopping center. Riley approaches and tracks him to his bicycle. They are monitored by kids in a red pickup truck. The pickup truck speeds toward them. Kadir climbs on his bicycle. Riley kicks a door. Kadir pedals away. Riley and the pursuers trade signals. A courier races the minivan after the pickup truck but spins out. Eddy is flung from the sunroof. Riley keeps signaling. The pursuers trail after Kadir. Eddy rests on the pavement blanketed in bruises. Riley checks a wrist for a pulse. He sends a text on his device. Kadir rests on a sofa in a dingy basement. A woman sits sketching him. Johnson's assistant brews a coffee. He offers the coffee to Kadir. The assistant observes Kadir suspiciously. In another chamber, Johnson observes the sketch of Kadir on a large canvas. On the outskirts of the town, a team of girls sit on a ridge. Closer to the valley, some cats wander around. Kadir lies motionless amongst mounds of garbage. Eddy lies unresponsive in a clinic bed with an oxygen mask on his face. Riley stands by the bed, watching Eddy. Riley takes a bite of a sandwich. Riley grabs a tablet and sits by a balcony. Sitting on a deck by a pond, Martinez removes his glasses and yawns. Riley steps into his condo and steps on a brochure. He lifts it up and closes the door. He strides into the den. He places his glasses on the chair and tears open the brochure. He extracts a drawing of him and Maya strolling down an avenue. He gazes at the drawing. He glances around nervously. Then, he seizes a vase and flings it at the floor. He strides out of the condo. Rapidly biking through town, he texts Maya on his tablet. A tablet on a shelf in Maya's condo buzzes. Riley wheels along a lane and halts. Riley dismounts and dashes across the avenue. He gestures with his foot and the bicycle halts. Riley taps the side mirror and sprints to Maya's condo entrance. He scales the steps with his tablet clutched to his chest. Riley halts as he nears a doorway."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Sitting with a candle flickering in a saucer beside him, Al-Saleem inserts a memory card into a camera and spins the film reel. He takes a sip from a straw. He writes a letter on the camera. He takes another sip from the straw. He quickly places the camera on his lap. A drone view of the city. In a garden, Hoffman texts Ferris, who's jogging through a train station. On a suburban lane, Ferris and Skip climb out of a motorcycle. They signal through hand gestures. Sadiki appears from a grocery store. Ferris strolls up and trails him to his scooter. They are observed by people in a red convertible. The convertible zooms toward them. Sadiki jumps on his scooter. Ferris shatters a side mirror. Sadiki rides off. Ferris and the pursuers exchange glances. A courier chases the convertible on a skateboard but collides. Skip is ejected onto the pavement. Ferris keeps yelling. The pursuers drive away after Sadiki. Skip lies on the sidewalk covered in bruises. Ferris searches for a heartbeat on his wrist. He sends a text on his pager. Sadiki lounges on a couch in a messy office. A teenager sits sketching him. Al-Saleem's assistant brews a cup of tea. He hands the tea to Sadiki. The assistant eyes Sadiki intently. In another building, Al-Saleem observes the drawings of Sadiki on a large canvas. Outside the town, a group of cats sit on a fence. Further down the street, some goats linger about. Sadiki rests motionless amongst stacks of hay. Skip lies asleep in a hospital room with an oxygen mask on his face. Ferris stands by the bed, gazing at Skip. Ferris takes a bite from a piece of pizza. Ferris grabs a notebook and sits by the fireplace. Sitting on a balcony by a river, Hoffman removes his headphones and groans. Ferris steps into his flat and trips on a package. He grabs it and closes the door. He enters the dining room. He places his wallet on the chair and unwraps the package. He pulls out a drawing of him and Aisha strolling through a garden. He gazes at the drawing. He glances around nervously. Then, he lifts a cushion and throws it at the floor. He rushes out of the flat. Frantically driving through lanes, he texts Aisha on his pager. A pager on a chair in Aisha's house buzzes. Ferris dashes along a pathway and halts. Ferris jumps out and darts across the pavement. He stretches out his arm and the bicycle halts. Ferris taps the handlebars and rushes to Aisha's house. He climbs up the ladder with his notebook pressed to his chest. Ferris pauses as he reaches a door."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Perched with a lollipop melting in a cup beside him, Jenkins inserts a memory stick into a laptop computer and adjusts the keyboard. He takes a nibble of the lollipop. He clicks an icon on the computer. He takes another nibble of the lollipop. He carefully lowers the computer screen. A security view of the countryside. In a meadow, Thompson messages Delaney, who's jogging through a shopping mall. On a winding road, Delaney and Brooks exit a motorcycle. They signal through walkie-talkies. Marciano appears from a cottage. Delaney strolls up and shadows him to his bicycle. They are observed by children in a green tractor. The tractor revs toward them. Marciano hops on his bicycle. Delaney cracks a lantern. Marciano pedals away. Delaney and the pursuers exchange glances. A courier rides the motorcycle after the tractor but tumbles. Brooks is tossed over the handlebar. Delaney keeps sprinting. The pursuers chase after Marciano. Brooks lies on the pavement sprinkled in glitter. Delaney checks for a pulse in his wrist. He sends a text on his laptop. Marciano reclines on a couch in a cluttered attic. An artist sits drawing him. Jenkins's aide refills a mug. He offers the mug to Marciano. The aide peers at Marciano inquisitively. In another attic, Jenkins observes the sketch of Marciano on a huge canvas. Beyond the countryside, a pack of cats gather on a rooftop. Nearby, some sheep graze around. Marciano rests asleep amidst shards of glass. Brooks reclines dazed in a clinic bed with a bandage on his forehead. Delaney leans by the bed, peering at Brooks. Delaney sips from a can of juice. Delaney picks up a tablet and leans by a doorway. Sitting on a bench beside a fountain, Thompson disconnects his headphones and yawns. Delaney strides into his condo and steps on a parcel. He retrieves it and closes the gate. He roams into the kitchen. He drops his wallet on the counter and tears open the parcel. He extracts an image of him and Clara skipping down a path. He gazes at the image. He glances around cautiously. Then, he snatches a vase and flings it at the ceiling. He dashes out of the condo. Recklessly biking through fields, he texts Clara on his tablet. A tablet on a sofa in Clara's condo vibrates. Delaney zooms along a path and pauses. Delaney dismounts and jogs across the field. He waves his arm and the bike halts. Delaney taps the seat and rushes to Clara's condo entrance. He climbs up the ladder with his tablet pressed to his cheek. Delaney decelerates as he nears a doorway."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Al-Saleem inserts a SIM card into a phone and makes a call while smoking. Meanwhile, Hoffman contacts Ferris in an airport via earpiece as Ferris and Skip follow Sadiki from an apartment. Men in a four-by-four attack, leading to a firefight. The four-by-four escapes with Sadiki, and Skip is left injured and unconscious. Al-Saleem watches video footage of Sadiki, who is later found dead. Ferris, at Skip's hospital bedside, receives a photo of himself and Aisha, causing him to grow anxious and destructive. He leaves his apartment in a rage, urgently calling Aisha as he races through the city to reach her apartment, eventually arriving and running up the stairs toward it."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Ferris slows up as he approaches a gate He heads up the stairs with his phone pressed to his ear Ferris slaps the bonnet and runs to Aisha's apartment building He holds out his hand and the car stops Ferris gets out and runs across the street Ferris speeds along a street and stops A mobile on a table in Aisha's apartment rings Aggressively driving through town he calls Aisha on his mobile He storms out of the apartment Then he picks up a bowl and hurls it at the wall He looks around anxiously He stares at the photo He takes out a photograph of him and Aisha walking down a street He puts his keys on the table and opens the envelope He walks into the living room He picks it up and shuts the door Ferris walks into his apartment and steps on an envelope Hoffman pulls out his earpiece and sighs Sitting on a terrace by a lake Ferris picks up a phone and sits by a window Ferris swigs from a bottle of soda Ferris stands by the bed staring at Skip Skip lies unconscious in a hospital bed with a breathing tube in his throat Sadiki lies dead amongst piles of rubbish Further down the hill some dogs mooch about Outside the city a group of boys stand on a hillside In another room AlSaleem watches the video footage of Sadiki on a small screen The lieutenant looks at Sadiki curiously He hands the drink to Sadiki AlSaleem's lieutenant pours a drink A man sits filming him Sadiki sits on a chair in a shabby room He makes a call on his mobile Ferris feels for a pulse in his neck Skip lies on the ground covered in blood The attackers drive off after Sadiki Ferris keeps shooting Skip is thrown through the windscreen An agent drives the SUV after the fourbyfour but crashes Sadiki drives away Ferris and the attackers exchange fire Ferris smashes a window Sadiki gets in his car The fourbyfour drives at them They are watched by men in a white fourbyfour Ferris walks up and follows him to his car Sadiki emerges from an apartment building They communicate through earpieces On a residential street Ferris and Skip get out of an SUV In a park Hoffman calls Ferris who is walking through an airport terminal A surveillance view of the city He slowly raises the phone to his ear He has another drag on the cigarette He dials a number on the phone He has a drag on the cigarette Sitting with a cigarette burning in an ashtray beside him AlSaleem slots a SIM card into a mobile phone and replaces the battery"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Further down the hill some dogs mooch about Sadiki sits on a chair in a shabby room Ferris speeds along a street and stops They are watched by men in a white fourbyfour An agent drives the SUV after the fourbyfour but crashes Skip lies on the ground covered in blood Ferris gets out and runs across the street He heads up the stairs with his phone pressed to his ear Ferris picks up a phone and sits by a window The attackers drive off after Sadiki Sadiki emerges from an apartment building Ferris stands by the bed staring at Skip He puts his keys on the table and opens the envelope He looks around anxiously Outside the city a group of boys stand on a hillside Ferris slows up as he approaches a gate He has another drag on the cigarette Ferris feels for a pulse in his neck He storms out of the apartment He slowly raises the phone to his ear In another room AlSaleem watches the video footage of Sadiki on a small screen Ferris walks up and follows him to his car He takes out a photograph of him and Aisha walking down a street He makes a call on his mobile Ferris walks into his apartment and steps on an envelope A man sits filming him Sitting with a cigarette burning in an ashtray beside him AlSaleem slots a SIM card into a mobile phone and replaces the battery AlSaleem's lieutenant pours a drink He holds out his hand and the car stops Ferris keeps shooting Sadiki lies dead amongst piles of rubbish Sitting on a terrace by a lake He hands the drink to Sadiki The fourbyfour drives at them He picks it up and shuts the door Skip lies unconscious in a hospital bed with a breathing tube in his throat A mobile on a table in Aisha's apartment rings Sadiki gets in his car Then he picks up a bowl and hurls it at the wall Ferris slaps the bonnet and runs to Aisha's apartment building He dials a number on the phone The lieutenant looks at Sadiki curiously Hoffman pulls out his earpiece and sighs A surveillance view of the city Ferris swigs from a bottle of soda He stares at the photo In a park Hoffman calls Ferris who is walking through an airport terminal They communicate through earpieces Ferris smashes a window Sadiki drives away Ferris and the attackers exchange fire Skip is thrown through the windscreen Aggressively driving through town he calls Aisha on his mobile He has a drag on the cigarette On a residential street Ferris and Skip get out of an SUV He walks into the living room"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "In another room AlSaleem watches the video footage of Sadiki on a small screen Outside the city a group of boys stand on a hillside Further down the hill some dogs mooch about Sadiki lies dead amongst piles of rubbish Skip lies unconscious in a hospital bed with a breathing tube in his throat Ferris stands by the bed staring at Skip Ferris swigs from a bottle of soda Ferris picks up a phone and sits by a window Sitting on a terrace by a lake Hoffman pulls out his earpiece and sighs Ferris walks into his apartment and steps on an envelope He picks it up and shuts the door He walks into the living room He puts his keys on the table and opens the envelope He takes out a photograph of him and Aisha walking down a street He stares at the photo He looks around anxiously Then he picks up a bowl and hurls it at the wall He storms out of the apartment Aggressively driving through town he calls Aisha on his mobile A mobile on a table in Aisha's apartment rings Ferris speeds along a street and stops Ferris gets out and runs across the street He holds out his hand and the car stops Ferris slaps the bonnet and runs to Aisha's apartment building He heads up the stairs with his phone pressed to his ear Ferris slows up as he approaches a gate Sitting with a cigarette burning in an ashtray beside him AlSaleem slots a SIM card into a mobile phone and replaces the battery He has a drag on the cigarette He dials a number on the phone He has another drag on the cigarette He slowly raises the phone to his ear A surveillance view of the city In a park Hoffman calls Ferris who is walking through an airport terminal On a residential street Ferris and Skip get out of an SUV They communicate through earpieces Sadiki emerges from an apartment building Ferris walks up and follows him to his car They are watched by men in a white fourbyfour The fourbyfour drives at them Sadiki gets in his car Ferris smashes a window Sadiki drives away Ferris and the attackers exchange fire An agent drives the SUV after the fourbyfour but crashes Skip is thrown through the windscreen Ferris keeps shooting The attackers drive off after Sadiki Skip lies on the ground covered in blood Ferris feels for a pulse in his neck He makes a call on his mobile Sadiki sits on a chair in a shabby room A man sits filming him AlSaleem's lieutenant pours a drink He hands the drink to Sadiki The lieutenant looks at Sadiki curiously"
        }
      ]
    }
  ]
}