{
  "ground_truth": "They all sit at the table, and Cala serves food. Ferris looks at the boys, and Rowley shakes his head gravely. Ferris looks to the boys again, and Yousef nods in approval of the next dish, which Aisha notices. Cala looks at the boys and points, causing Aisha to look at Cala, worried. She waves a white napkin, and he smiles and raises his eyebrows at Aisha as they walk out to the street. He holds out his hand, and Aisha smiles and looks up to a window where Cala is looking down at them. Ferris waves to her, and without shaking hands, Ferris goes. Aisha wrings her hands as she looks up at people leaning out of windows, watching her. Hani gives Ferris photographs of Al-Masri and Sadiki with young women in a club, and Hani lights a cigar. Ferris frowns earnestly as Hani looks at a grandfather clock, while Ferris's eyes dart. He smiles and holds up the file of photographs. Garland works on a computer and stretches his arms above his head. At the military airbase, a chopper lands in front of a hangar, where pale light glows in the windows and casts a sheen across the tarmac. A troop carrier drives up, and soldiers lift bodies in body bags from the chopper and load them onto the troop carrier. Ferris walks along past an airport terminal building, talking on his phone, and Skip's by an SUV in arrivals. A soldier detonates a bomb, and Al-Saleem watches a news report with one of his men. Ferris, Hani, and Garland are also watching as Garland sends the message in Arabic. Ferris pulls out his earpiece while Al-Saleem sits on a balcony. His lieutenant walks over with a laptop, and Al-Saleem sits and opens it, which displays a picture of Sadiki. Al-Saleem looks at the picture, studies the photo, and narrows his eyes. In his office, Sadiki shows a model to three men when a colleague calls over. Sadiki goes to a computer and opens his mail, where emails flood across the screen. He frowns as he starts to read the messages, and below the message is a photograph of someone wearing a balaclava. The next has a picture of someone holding up the Koran. Sadiki looks at a TV that plays news footage of the bombing and, increasingly alarmed, takes off his glasses. Carrying a case and laptop, Sadiki rushes out of the building, walks out onto the street, and stops to look around anxiously. Then he walks over to his Mercedes, deactivating the alarm as he goes, walks round to the driver's door, unlocks it, opens it, and gets in. He frantically turns the key in the ignition, switches on the headlights as a group of men wander past watching, and drives away in his cream Mercedes.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "They all perch at the board, and Cala dishes cuisine. Ferris glances at the lads, and Rowley rattles his cranium solemnly. Ferris glances to the lads again, and Yousef inclines in endorsement of the subsequent platter, which Aisha discerns. Cala glances at the lads and gestures, causing Aisha to glance at Cala, apprehensive. She waves a white serviette, and he grins and elevates his eyebrows at Aisha as they stroll out to the avenue. He extends his hand, and Aisha grins and glances up to a casement where Cala is observing down at them. Ferris waves to her, and without clasping hands, Ferris departs. Aisha twists her hands as she glances up at individuals leaning out of apertures, observing her. Hani gives Ferris snapshots of Al-Masri and Sadiki with youthful women in a club, and Hani ignites a stogie. Ferris scowls sincerely as Hani glances at a grandfather clock, while Ferris's eyes flicker. He grins and holds up the dossier of snapshots. Garland toils on a machine and stretches his limbs above his cranium. At the martial airbase, a helicopter descends in front of a shed, where pale gleam radiates in the apertures and casts a gleam across the tarmac. A troop conveyance drives up, and troopers lift corpses in body sacks from the helicopter and load them onto the troop conveyance. Ferris ambles along past an airstrip terminal structure, conversing on his mobile, and Skip’s by an SUV in arrivals. A trooper detonates a device, and Al-Saleem observes a bulletin with one of his men. Ferris, Hani, and Garland are also observing as Garland dispatches the communiqué in Arabic. Ferris extracts his earpiece while Al-Saleem sits on a veranda. His aide strolls over with a laptop, and Al-Saleem sits and opens it, which displays a snapshot of Sadiki. Al-Saleem glances at the snapshot, scrutinizes the photo, and narrows his eyes. In his workspace, Sadiki exhibits a prototype to three men when a coworker calls over. Sadiki proceeds to a machine and opens his correspondence, where emails inundate across the screen. He scowls as he starts to peruse the communications, and below the communication is a snapshot of someone donning a balaclava. The subsequent has a snapshot of someone holding up the Koran. Sadiki glances at a TV that plays bulletin footage of the bombing and, increasingly perturbed, removes his spectacles. Carrying a case and laptop, Sadiki hastens out of the structure, strolls out onto the avenue, and halts to glance around uneasily. Then he strolls over to his Mercedes, deactivating the alarm as he goes, strolls round to the driver's door, unlocks it, opens it, and gets in. He frantically turns the key in the ignition, switches on the headlights as a group of men meander past observing, and drives away in his cream Mercedes."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "At the table, they are all seated, and food is served by Cala. The boys are looked at by Ferris, and his head is shaken gravely by Rowley. To the boys, Ferris looks again, and the next dish is nodded at in approval by Yousef, which is noticed by Aisha. The boys are looked at by Cala, and they are pointed at, causing Cala to be looked at by Aisha, worried. A white napkin is waved by her, and at Aisha, he smiles and his eyebrows are raised as they are walked out to the street. His hand is held out by him, and Aisha smiles and looks up to a window where Cala is looking down at them. To her, Ferris waves, and without shaking hands, he goes. Her hands are wrung by Aisha as people leaning out of windows are looked up at by her, watching her. Photographs of Al-Masri and Sadiki with young women in a club are given to Ferris by Hani, and a cigar is lit by Hani. Earnestly, Ferris frowns as a grandfather clock is looked at by Hani, while Ferris's eyes are darting. The file of photographs is held up by him, smiling. A computer is worked on by Garland and his arms are stretched above his head. At the military airbase, a chopper is landed in front of a hangar where pale light glows in the windows and a sheen is cast across the tarmac. A troop carrier is driven up, and bodies in body bags are lifted from the chopper and loaded onto the troop carrier by soldiers. Past an airport terminal building, Ferris walks along, talking on his phone, and by an SUV in arrivals is Skip. A bomb is detonated by a soldier, and a news report is watched by Al-Saleem with one of his men. Ferris, Hani, and Garland are also watching as the message is sent in Arabic by Garland. His earpiece is pulled out by Ferris while on a balcony, sits Al-Saleem. Over walks his lieutenant with a laptop, and it is opened by Al-Saleem, which displays a picture of Sadiki. At the picture, Al-Saleem looks, studies it, and his eyes are narrowed. In his office, a model is shown to three men by Sadiki when a colleague calls over. Sadiki goes to a computer and his mail is opened, where emails flood across the screen. He frowns as the messages are started to be read, and below the message, a photograph is of someone wearing a balaclava. The next has a picture of someone holding up the Koran, looked at by Sadiki. On a TV, news footage of the bombing is played, and increasingly alarmed, his glasses are taken off by him. Carrying a case and laptop, the building is rushed out of by Sadiki, the street is walked out onto, and he stops to look around anxiously. To his Mercedes, he then walks over, and the alarm is deactivated by him as he goes, he walks round to the driver's door, it is unlocked, opened, and he gets in. Frantically, he turns the key in the ignition, switches on the headlights as a group of men wander past, watching, and away in his cream Mercedes, he drives."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "They sit at the table as Cala serves food. Ferris observes the boys, and Rowley shakes his head gravely. Ferris looks at the boys again; Yousef nods, which Aisha notices. Cala points, causing Aisha to worry. She waves a white napkin, and he smiles, raising his eyebrows as they walk outside. He extends his hand, making Aisha smile and glance at Cala watching from a window. Ferris waves, but they don't shake hands as Ferris leaves. Aisha wrings her hands, seeing people at windows watching her. Hani gives Ferris photos of Al-Masri and Sadiki with women in a club, then lights a cigar. Ferris frowns as Hani checks a clock. Ferris smiles, holding the photo file. Garland stretches at his computer. At the military airbase, a chopper lands at a hangar. Soldiers unload body bags onto a troop carrier. Ferris walks by an airport terminal, talking on his phone while Skip waits by an SUV. A soldier detonates a bomb; Al-Saleem and others, including Ferris, Hani, and Garland, watch the news. Ferris removes his earpiece as Al-Saleem, on a balcony, receives a laptop with Sadiki's picture. Al-Saleem studies it closely. In his office, Sadiki shows a model to men when a colleague calls him. He checks his email, seeing a flood of messages, one with a balaclava photo and another with a Koran. Sadiki looks at alarming news footage, removes his glasses, and rushes out. He exits onto the street nervously, deactivates his Mercedes’ alarm, enters, starts it, and drives off as a group watches."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "They sit at the table as Cala serves food. Ferris observes the boys, and Rowley disapproves. Yousef nods, which Aisha notices. Cala points at the boys, worrying Aisha. She waves a napkin, and he smiles as they leave. Aisha looks up, smiling at Cala in the window. Ferris waves, and then leaves. Aisha wrings her hands while observing people watching her. Hani gives Ferris photos of Al-Masri and Sadiki with women, lighting a cigar as Ferris reacts. Garland works on a computer. At an airbase, a chopper lands, and soldiers load bodies onto a troop carrier. Ferris talks on his phone near an airport, and Skip stands by an SUV. A soldier detonates a bomb; Al-Saleem watches a news report. Ferris, Hani, and Garland watch too, as Garland sends a message in Arabic. Ferris removes his earpiece; Al-Saleem receives a laptop with Sadiki's picture. Al-Saleem narrows his eyes at the photo. Sadiki, in his office, sees concerning emails and news about a bombing. Alarmed, he rushes out, deactivates the alarm on his Mercedes, and drives away."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "They all find themselves gathered around the large dining table, where the generous Cala is in the midst of serving the deliciously prepared food. Ferris, with a discerning eye, observes the boys seated nearby, while Rowley, maintaining a solemn expression, shakes his head gravely in response. As Ferris's gaze returns to the boys, Yousef, with a subtle nod, signals his approval of the subsequent dish, which Aisha is quick to notice. Cala, once more, directs her attention toward the boys and gestures pointedly, an action that causes Aisha to turn her attention to Cala with a look of concern on her face. She waves a pristine white napkin, prompting him to respond with a smile and a playful raise of his eyebrows at Aisha, as they both make their way out to the bustling street. He extends his hand courteously, and Aisha returns his smile, glancing upward at the window where Cala is standing and observing them from above. Ferris, in a friendly manner, waves at her, and, without the customary handshake, he departs. Meanwhile, Aisha anxiously wrings her hands, her eyes drawn to the people leaning out of their windows, intently watching her movements.\n\nHani approaches Ferris and hands him photographs depicting Al-Masri and Sadiki in the company of young women at a nightclub. Hani, with a casual air, lights a cigar. Ferris, adopting a serious demeanor, furrows his brows earnestly, his eyes darting as Hani concentrates on the ticking of a grandfather clock. However, Ferris manages a smile and confidently holds up the file containing the insightful photographs. At his workstation, Garland diligently works on a computer, occasionally stretching his arms high above his head to relieve the tension. At a nearby military airbase, a helicopter descends and lands precisely in front of a hangar, where the pale light glowing in the windows casts an ethereal sheen across the expansive tarmac. A troop carrier approaches, and soldiers efficiently lift bodies encased in body bags from the helicopter, carefully loading them onto the waiting troop carrier.\n\nContinuing on his way, Ferris strides past an airport terminal building, engaged in a conversation on his phone. Meanwhile, Skip waits by an SUV parked in the arrivals area. Elsewhere, a soldier detonates a bomb, and Al-Saleem attentively watches a news report alongside one of his associates. Ferris, Hani, and Garland are also glued to the report as Garland diligently sends out a message written in Arabic. Ferris discreetly removes his earpiece, while Al-Saleem, seated on a balcony, watches. His trusted lieutenant approaches, carrying a laptop, and Al-Saleem opens it to reveal a picture of Sadiki displayed on the screen. Al-Saleem scrutinizes the photograph, narrowing his eyes in contemplation.\n\nInside his office, Sadiki is busy showing a meticulously crafted model to three men when a colleague calls him over. Responding promptly, Sadiki moves to a computer and opens his email, where a flood of messages rapidly fills the screen. Deep in thought, he frowns as he begins to read through the barrage of emails, noticing below one of the messages a photograph depicting someone wearing a balaclava. The next email contains an image of an individual holding up the Koran. Sadiki glances over at a television, which broadcasts news footage of the recent bombing. His alarm growing, he removes his glasses and, carrying a case along with his laptop, urgently exits the building. Once outside, he steps onto the street, pausing to scan his surroundings with growing anxiety. He then makes his way to his parked Mercedes, deactivates the car alarm, and walks around to the driver’s side door. Unlocking it, he opens the door, gets in, and turns the ignition key with urgency. He switches on the headlights, aware of a group of men wandering nearby, watching him closely. Without hesitation, he drives away in his elegant cream Mercedes, leaving the scene behind."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "They all find themselves gathered around the expansive and welcoming dining table, where the ever-generous Cala is in the midst of serving the wonderfully delicious and meticulously prepared food. Ferris, with his discerning eye and careful observation, takes note of the boys who are seated nearby, while Rowley, maintaining a solemn and serious expression, shakes his head gravely in response to the unfolding scene. As Ferris's attentive gaze returns to the boys, Yousef, with a subtle nod of his head, discreetly signals his approval of the subsequent dish, a gesture that Aisha is quick to notice and register. Cala, once more, redirects her focused attention toward the boys and gestures pointedly in their direction, an action that prompts Aisha to turn her concerned attention to Cala, a look of worry evident on her face. She waves a pristine, white napkin, which prompts him to respond with a wide smile and a playful raise of his eyebrows directed at Aisha, as they both make their way out to the bustling and lively street. He extends his hand courteously, a gesture of politeness, and Aisha reciprocates with her warm smile, glancing upward at the window where Cala is standing, observing them from above with quiet interest. Ferris, in a friendly and casual manner, waves at her, and without the customary handshake, he makes his departure. Meanwhile, Aisha anxiously wrings her hands, her eyes drawn to the curious people leaning out of their windows, intently watching her every movement.\n\nHani, with a casual and detached air, approaches Ferris and hands him a collection of photographs that depict Al-Masri and Sadiki in the company of young women at what appears to be a lively nightclub. Hani, maintaining his nonchalant demeanor, lights up a cigar. Ferris, adopting a serious and focused demeanor, furrows his brows in earnestness, his eyes darting about as Hani concentrates on the rhythmic ticking of a nearby grandfather clock. However, Ferris manages to compose himself enough to smile confidently as he holds up the file containing the insightful and revealing photographs. At his workstation, Garland works diligently on his computer, occasionally pausing to stretch his arms high above his head to relieve the tension that has built up. At a nearby bustling military airbase, a helicopter descends and lands with precision directly in front of a hangar, where the pale, glowing light through the windows casts an ethereal sheen across the expansive and vast tarmac. A troop carrier approaches, and soldiers efficiently lift bodies that are carefully encased in body bags from the helicopter, loading them with care onto the waiting troop carrier.\n\nContinuing on his way with purposeful strides, Ferris walks past an airport terminal building, engaged in a conversation on his phone. Meanwhile, Skip waits by an SUV that is parked in the arrivals area. Elsewhere, a soldier detonates a bomb, and Al-Saleem attentively watches a news report alongside one of his trusted associates. Ferris, Hani, and Garland, with intense focus, are also glued to the report as Garland diligently works to send out a message carefully written in Arabic. Ferris discreetly removes his earpiece, while Al-Saleem, comfortably seated on a balcony, watches intently. His trusted lieutenant approaches, carrying a laptop, and Al-Saleem quickly opens it to reveal a picture of Sadiki prominently displayed on the screen. Al-Saleem scrutinizes the photograph carefully, narrowing his eyes in deep contemplation.\n\nInside his office, Sadiki is busy showing a meticulously crafted and detailed model to three interested men when a colleague urgently calls him over. Responding promptly and with attention, Sadiki moves to a computer to open his email, where a flood of messages rapidly fills the screen. Deep in thought and growing concern, he frowns as he begins to read through the barrage of emails, noticing below one of the messages a photograph depicting a person wearing a balaclava. The next email contains an image of an individual holding up the Koran. Sadiki glances over at a television, which broadcasts news footage of the recent and alarming bombing. His alarm growing, he removes his glasses and, carrying a case along with his laptop, urgently exits the building. Once outside, he steps onto the street, pausing momentarily to scan his surroundings with growing anxiety and concern. He then makes his way to his parked Mercedes, deactivates the car alarm, and methodically walks around to the driver’s side door. Unlocking it with urgency, he opens the door, gets in, and turns the ignition key with a sense of urgency. He switches on the headlights, fully aware of a group of men wandering nearby, watching him closely and intently. Without hesitation, he drives away in his elegant cream Mercedes, leaving the scene behind him."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "They all gather around the table, each person finding their seat with a sense of anticipation, as Cala methodically begins to serve the food, ensuring each dish is placed with care. Ferris shifts his gaze towards the boys, scanning their reactions before turning to Rowley, who meets his glance and responds by solemnly shaking his head, indicating disapproval. Ferris, maintaining his focus on the boys, observes as Yousef offers a subtle nod of approval for the next dish, a gesture that catches Aisha's attention despite the surrounding din. Meanwhile, Cala directs her attention to the boys, pointing decisively, which prompts Aisha to shift her worried gaze toward Cala. In a moment of silent communication, Aisha waves a white napkin, a gesture that conjures a smile and a raised eyebrow from Cala, signaling approval and prompting them to proceed outside onto the street. As they transition to the outdoors, he extends his hand towards Aisha, who responds with a radiant smile while glancing upwards at a window where Cala stands, looking down at them. Ferris offers a wave in Cala's direction, acknowledging her presence, but instead of shaking hands, Ferris departs. Aisha, now alone with her thoughts, wrings her hands in nervousness, her gaze involuntarily drawn to the people leaning out of nearby windows, all of whom are watching her with curious intensity. Hani approaches Ferris and presents him with photographs depicting Al-Masri and Sadiki in the company of young women at a club. As Hani ceremoniously lights a cigar, Ferris inspects the photos with earnest concentration, his expression serious. While Hani turns his attention to a grandfather clock within the room, Ferris's eyes dart around the space, processing the information before him. He eventually breaks into a smile, holding the file of photographs aloft in triumph. Elsewhere, Garland is diligently working on a computer, periodically pausing to stretch his arms above his head, relieving the tension of long hours of labor. At the military airbase, the scene is set against the backdrop of a chopper landing majestically in front of a hangar, the pale light from the windows casting a reflective sheen across the tarmac. A troop carrier approaches with precision, and soldiers efficiently lift bodies encased in body bags from the chopper, transferring them onto the waiting carrier. Ferris moves along with purpose past the airport terminal building, engaged in conversation over the phone, while nearby, Skip stands poised next to an SUV in the arrivals area. In a separate scene, a soldier executes the detonation of a bomb, a moment of action captured on a news report being monitored by Al-Saleem and one of his men. Concurrently, Ferris, Hani, and Garland share in watching the unfolding news, as Garland adeptly sends a message in Arabic. Ferris disengages by removing his earpiece, while Al-Saleem occupies himself on a balcony. His lieutenant approaches, presenting a laptop which Al-Saleem opens to reveal an image of Sadiki. Al-Saleem scrutinizes the picture with intensity, narrowing his eyes as he processes the visual information. In another office, Sadiki is in the midst of showing a model to three men when his colleague's voice calls his attention away. He promptly moves to a computer, where he opens his email to a flood of messages cascading across the screen. With a frown furrowing his brow, he begins to read the messages, taking note of a photograph of a masked individual below one of the emails. Another email follows, displaying an image of someone holding a Koran. Alarmed, Sadiki's attention shifts to a TV airing news footage of a bombing, the implications of which prompt him to remove his glasses in distress. Hastily gathering a case and a laptop, he exits the building with urgency, stepping out onto the street where he pauses, casting his eyes about with anxious vigilance. Resolute, he proceeds to his Mercedes, deactivating the alarm with a practiced motion, before making his way to the driver's side, unlocking, opening the door, and settling into the driver's seat. With a sense of urgency, he twists the key in the ignition, activating the headlights and drawing the gaze of a group of men who wander past, observing the commotion. Undeterred, Sadiki drives away in his cream Mercedes, leaving the scene behind."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "The group gathers at the table as Cala serves the meal. Observing the boys, Ferris sees Rowley shake his head while Yousef nods approvingly, catching Aisha's attention. Cala gestures towards the boys, prompting a concerned Aisha to wave a white napkin at him, eliciting a knowing smile. As they exit to the street, Cala looks down from a window, and Ferris waves goodbye. Aisha, noticing people observing her from windows, anxiously wrings her hands. Hani hands Ferris incriminating photographs of Al-Masri and Sadiki at a club, lighting a cigar as Ferris studies them and reacts thoughtfully. Meanwhile, Garland works on a computer, stretching after a task. At a military airbase, a chopper lands and bodies in body bags are transferred to a troop carrier. Ferris, meanwhile, walks past an airport terminal while talking on his phone, intersecting with Skip near an SUV. A bomb detonation captures attention, prompting Al-Saleem, Ferris, Hani, and Garland to watch the news as Garland dispatches a message in Arabic. Al-Saleem, on a balcony, reviews images on a laptop from his lieutenant, focusing intently on a picture of Sadiki. In his office, Sadiki, interrupted by a colleague, checks his email, discovering alarming messages accompanied by photos. Disturbed by news footage of the bombing, he removes his glasses and quickly exits the building. On the street, he locates his Mercedes, deactivates the alarm, and drives off hastily as a group of men observe him."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "They all sit at the table, and Cala, known for her culinary skills honed in the bustling markets of Marrakech, serves food. Ferris looks at the boys with a sense of responsibility, and Rowley, who has recently returned from a diplomatic mission, shakes his head gravely. Ferris looks to the boys again, and Yousef, a young man with ambitions to join the international culinary scene, nods in approval of the next dish, which Aisha, known for her discerning taste, notices. Cala looks at the boys and points, prompting Aisha, who has always been protective of them since their parents passed away, to look at Cala, worried. She waves a white napkin, a signal of peace rooted in cultural tradition, and he smiles and raises his eyebrows at Aisha as they walk out to the street, filled with the evening hustle of a Middle Eastern city. He holds out his hand, and Aisha smiles and looks up to a window where Cala, who has always been a nurturing figure, is looking down at them. Ferris waves to her, and without shaking hands, Ferris, who is on a tight schedule due to his intelligence work, goes. Aisha wrings her hands as she looks up at people leaning out of windows, watching her intently. Hani, a seasoned intelligence officer known for his strategic acumen, gives Ferris photographs of Al-Masri and Sadiki with young women in a club, a hotspot for covert meetings, and Hani lights a cigar, a habit that reflects his contemplative nature. Ferris frowns earnestly as Hani looks at a grandfather clock, an heirloom passed down through generations, while Ferris's eyes dart. He smiles and holds up the file of photographs, aware of their significance. Garland, a tech expert pivotal to their operations, works on a computer and stretches his arms above his head, weary from long hours. At the military airbase, a strategic hub for operations in the region, a chopper lands in front of a hangar where pale light glows in the windows and casts a sheen across the tarmac. A troop carrier drives up, and soldiers, seasoned by recent conflicts, lift bodies in body bags from the chopper and load them onto the troop carrier. Ferris walks along past an airport terminal building, discreetly talking on his secure phone, and spots Skip by an SUV in arrivals, a fellow operative known for his quick thinking. A soldier detonates a bomb, drawing media attention, and Al-Saleem, a wanted figure in international terrorism, watches a news report with one of his men. Ferris, Hani, and Garland are also watching as Garland sends the message in Arabic, a crucial part of their communication strategy. Ferris pulls out his earpiece while Al-Saleem sits on a balcony, surveying his surroundings with a sense of control. His lieutenant walks over with a laptop, and Al-Saleem sits and opens it, which displays a picture of Sadiki, a person of interest in their investigation. Al-Saleem looks at the picture, studies the photo, and narrows his eyes, assessing the threat it represents. In his office, Sadiki, known for his connections in the underworld, shows a model to three men when a colleague calls over. Sadiki goes to a computer and opens his mail, where emails flood across the screen, likely linked to his clandestine activities. He frowns as he starts to read the messages, and below the message is a photograph of someone wearing a balaclava, symbolizing anonymity and fear. The next has a picture of someone holding up the Koran, a powerful image tied to religious motives. Sadiki looks at a TV that plays news footage of the bombing and, increasingly alarmed by the implications, takes off his glasses. Carrying a case and laptop, Sadiki rushes out of the building, walks out onto the street, and stops to look around anxiously, sensing danger. Then he walks over to his Mercedes, deactivating the alarm as he goes, walks round to the driver's door, unlocks it, opens it, and gets in. He frantically turns the key in the ignition, switches on the headlights as a group of men wander past, watching with suspicious interest, and drives away in his cream Mercedes, a car that stands out in the crowded streets."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Ferris pulls out his earpiece while AlSaleem sits on a balcony They all sit at the table and Cala serves food The next has a picture of someone holding up the Koran Ferris looks at the boys and Rowley shakes his head gravely In his office Sadiki shows a model to three men when a colleague calls over Ferris looks to the boys again and Yousef nods in approval of the next dish which Aisha notices Cala looks at the boys and points causing Aisha to look at Cala worried She waves a white napkin and he smiles and raises his eyebrows at Aisha as they walk out to the street Cala looks at the boys and points causing Aisha to look at Cala worried They all sit at the table and Cala serves food Ferris looks to the boys again and Yousef nods in approval of the next dish which Aisha notices He holds out his hand and Aisha smiles and looks up to a window where Cala is looking down at them Ferris waves to her and without shaking hands Ferris goes Aisha wrings her hands as she looks up at people leaning out of windows watching her Hani gives Ferris photographs of AlMasri and Sadiki with young women in a club and Hani lights a cigar Hani gives Ferris photographs of AlMasri and Sadiki with young women in a club and Hani lights a cigar He frowns as he starts to read the messages and below the message is a photograph of someone wearing a balaclava Carrying a case and laptop Sadiki rushes out of the building walks out onto the street and stops to look around anxiously Ferris frowns earnestly as Hani looks at a grandfather clock while Ferris's eyes dart He smiles and holds up the file of photographs Then he walks over to his Mercedes deactivating the alarm as he goes walks round to the driver's door unlocks it opens it and gets in Garland works on a computer and stretches his arms above his head Ferris looks at the boys and Rowley shakes his head gravely At the military airbase a chopper lands in front of a hangar where pale light glows in the windows and casts a sheen across the tarmac A troop carrier drives up and soldiers lift bodies in body bags from the chopper and load them onto the troop carrier Ferris walks along past an airport terminal building talking on his phone and Skip's by an SUV in arrivals A soldier detonates a bomb and AlSaleem watches a news report with one of his men Ferris Hani and Garland are also watching as Garland sends the message in Arabic Ferris pulls out his earpiece while AlSaleem sits on a balcony A troop carrier drives up and soldiers lift bodies in body bags from the chopper and load them onto the troop carrier His lieutenant walks over with a laptop and AlSaleem sits and opens it which displays a picture of Sadiki AlSaleem looks at the picture studies the photo and narrows his eyes In his office Sadiki shows a model to three men when a colleague calls over Aisha wrings her hands as she looks up at people leaning out of windows watching her She waves a white napkin and he smiles and raises his eyebrows at Aisha as they walk out to the street Sadiki goes to a computer and opens his mail where emails flood across the screen He frowns as he starts to read the messages and below the message is a photograph of someone wearing a balaclava The next has a picture of someone holding up the Koran Sadiki looks at a TV that plays news footage of the bombing and increasingly alarmed takes off his glasses Carrying a case and laptop Sadiki rushes out of the building walks out onto the street and stops to look around anxiously Then he walks over to his Mercedes deactivating the alarm as he goes walks round to the driver's door unlocks it opens it and gets in He frantically turns the key in the ignition switches on the headlights as a group of men wander past watching and drives away in his cream Mercedes"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "They all sit at the table and Cala serves food. Ferris looks at the boys and Rowley shakes his head gravely. Ferris looks to the boys again and Yousef nods in approval of the next dish which Aisha notices. Cala looks at the boys and points causing Aisha to look at Cala worried. She waves a white napkin and he smiles and raises his eyebrows at Aisha as they walk out to the street. He holds out his hand and Aisha smiles and looks up to a window where Cala is looking down at them. Ferris waves to her and without shaking hands Ferris goes. Aisha wrings her hands as she looks up at people leaning out of windows watching her. Hani gives Ferris photographs of AlMasri and Sadiki with young women in a club and Hani lights a cigar. Ferris frowns earnestly as Hani looks at a grandfather clock while Ferris's eyes dart. He smiles and holds up the file of photographs. Garland works on a computer and stretches his arms above his head. At the military airbase a chopper lands in front of a hangar where pale light glows in the windows and casts a sheen across the tarmac. A troop carrier drives up and soldiers lift bodies in body bags from the chopper and load them onto the troop carrier. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Ferris walks along past an airport terminal building talking on his phone and Skip's by an SUV in arrivals. A soldier detonates a bomb and AlSaleem watches a news report with one of his men. Ferris Hani and Garland are also watching as Garland sends the message in Arabic. Ferris pulls out his earpiece while AlSaleem sits on a balcony. His lieutenant walks over with a laptop and AlSaleem sits and opens it which displays a picture of Sadiki. AlSaleem looks at the picture studies the photo and narrows his eyes. In his office Sadiki shows a model to three men when a colleague calls over. Sadiki goes to a computer and opens his mail where emails flood across the screen. He frowns as he starts to read the messages and below the message is a photograph of someone wearing a balaclava. The next has a picture of someone holding up the Koran. Sadiki looks at a TV that plays news footage of the bombing and increasingly alarmed takes off his glasses. Carrying a case and laptop Sadiki rushes out of the building walks out onto the street and stops to look around anxiously. Then he walks over to his Mercedes deactivating the alarm as he goes walks round to the driver's door unlocks it opens it and gets in. He frantically turns the key in the ignition switches on the headlights as a group of men wander past watching and drives away in his cream Mercedes."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "They all sit at the table and Cala serves food. Ferris looks at the boys and Rowley shakes his head gravely. Ferris looks to the boys again and Yousef nods in approval of the next dish which Aisha notices. Cala looks at the boys and points causing Aisha to look at Cala worried. She waves a white napkin and he smiles and raises his eyebrows at Aisha as they walk out to the street. He holds out his hand and Aisha smiles and looks up to a window where Cala is looking down at them. Ferris waves to her and without shaking hands Ferris goes. Aisha wrings her hands as she looks up at people leaning out of windows watching her. Hani gives Ferris photographs of AlMasri and Sadiki with young women in a club and Hani lights a cigar. Ferris frowns earnestly as Hani looks at a grandfather clock while Ferris's eyes dart. He smiles and holds up the file of photographs. Garland works on a computer and stretches his arms above his head. At the military airbase a chopper lands in front of a hangar where pale light glows in the windows and casts a sheen across the tarmac. A troop carrier drives up and soldiers lift bodies in body bags from the chopper and load them onto the troop carrier. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. Ferris walks along past an airport terminal building talking on his phone and Skip's by an SUV in arrivals. A soldier detonates a bomb and AlSaleem watches a news report with one of his men. Ferris Hani and Garland are also watching as Garland sends the message in Arabic. Ferris pulls out his earpiece while AlSaleem sits on a balcony. His lieutenant walks over with a laptop and AlSaleem sits and opens it which displays a picture of Sadiki. AlSaleem looks at the picture studies the photo and narrows his eyes. In his office Sadiki shows a model to three men when a colleague calls over. Sadiki goes to a computer and opens his mail where emails flood across the screen. He frowns as he starts to read the messages and below the message is a photograph of someone wearing a balaclava. The next has a picture of someone holding up the Koran. Sadiki looks at a TV that plays news footage of the bombing and increasingly alarmed takes off his glasses. Carrying a case and laptop Sadiki rushes out of the building walks out onto the street and stops to look around anxiously. Then he walks over to his Mercedes deactivating the alarm as he goes walks round to the driver's door unlocks it opens it and gets in. He frantically turns the key in the ignition switches on the headlights as a group of men wander past watching and drives away in his cream Mercedes."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "They all sit at the table and Cala serves food. Ferris looks at the boys and Rowley shakes his head gravely. Ferris looks to the boys again and Yousef nods in approval of the next dish which Aisha notices. Cala looks at the boys and points causing Aisha to look at Cala worried. She waves a white napkin and he smiles and raises his eyebrows at Aisha as they walk out to the street. He holds out his hand and Aisha smiles and looks up to a window where Cala is looking down at them. Ferris waves to her and without shaking hands Ferris goes. Sadiki goes to a computer and opens his mail where emails flood across the screen. He frowns as he starts to read the messages and below the message is a photograph of someone wearing a balaclava. The next has a picture of someone holding up the Koran. Sadiki looks at a TV that plays news footage of the bombing and increasingly alarmed takes off his glasses. Carrying a case and laptop Sadiki rushes out of the building walks out onto the street and stops to look around anxiously. Then he walks over to his Mercedes deactivating the alarm as he goes walks round to the driver's door unlocks it opens it and gets in. He frantically turns the key in the ignition switches on the headlights as a group of men wander past watching and drives away in his cream Mercedes."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "They all sit at the table and Cala serves food. Ferris looks at the boys and Rowley shakes his head gravely. Ferris looks to the boys again and Yousef nods in approval of the next dish which Aisha notices. Carrying a case and laptop Sadiki rushes out of the building walks out onto the street and stops to look around anxiously. Then he walks over to his Mercedes deactivating the alarm as he goes walks round to the driver's door unlocks it opens it and gets in. He frantically turns the key in the ignition switches on the headlights as a group of men wander past watching and drives away in his cream Mercedes."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The squirrels all sit at the table, and the gardener serves food. The musician looks at the boys, and the librarian shakes his head gravely. The musician looks to the boys again, and the conductor nods in approval of the next dish, which the florist notices. The gardener looks at the boys and points, causing the florist to look at the gardener, worried. The turtle waves a white napkin, and the kangaroo smiles and raises his eyebrows at the florist as they walk out to the street. The kangaroo holds out his hand, and the florist smiles and looks up to a window where the gardener is looking down at them. The musician waves to her, and without shaking hands, the musician goes. The florist wrings her hands as she looks up at people leaning out of windows, watching her. The detective gives the musician photographs of Al-Masri and Sadiki with young women in a club, and the detective lights a cigar. The musician frowns earnestly as the detective looks at a grandfather clock, while the musician's eyes dart. The musician smiles and holds up the file of photographs. The chef works on a computer and stretches his arms above his head. At the military airbase, a chopper lands in front of a hangar, where pale light glows in the windows and casts a sheen across the tarmac. A troop carrier drives up, and firefighters lift bodies in body bags from the chopper and load them onto the troop carrier. The musician walks along past an airport terminal building, talking on his phone, and the dancer's by an SUV in arrivals. A gardener detonates a bomb, and Al-Saleem watches a news report with one of his men. The musician, the detective, and the chef are also watching as the chef sends the message in Arabic. The musician pulls out his earpiece while Al-Saleem sits on a balcony. His lieutenant walks over with a laptop, and Al-Saleem sits and opens it, which displays a picture of Sadiki. Al-Saleem looks at the picture, studies the photo, and narrows his eyes. In his office, Sadiki shows a model to three giraffes when a colleague calls over. Sadiki goes to a computer and opens his mail, where emails flood across the screen. He frowns as he starts to read the messages, and below the message is a photograph of someone wearing a balaclava. The next has a picture of someone holding up the Koran. Sadiki looks at a TV that plays news footage of the bombing and, increasingly alarmed, takes off his glasses. Carrying a case and laptop, Sadiki rushes out of the building, walks out onto the street, and stops to look around anxiously. Then he walks over to his Mercedes, deactivating the alarm as he goes, walks around to the driver's door, unlocks it, opens it, and gets in. He frantically turns the key in the ignition, switches on the headlights as a group of raccoons wander past watching, and drives away in his cream Mercedes."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "They all sit at the bench, and Cala serves pastries. Ferris looks at the plants, and Rowley shakes his head gravely. Ferris looks to the plants again, and Yousef nods in approval of the next drink, which Aisha notices. Cala looks at the plants and points, causing Aisha to look at Cala, worried. She waves a red scarf, and he smiles and raises his eyebrows at Aisha as they walk out to the garden. He holds out his smartphone, and Aisha smiles and looks up to a rooftop where Cala is looking down at them. Ferris waves to her, and without shaking hands, Ferris goes. Aisha wrings her hands as she looks up at birds flying out of rooftops, watching her. Hani gives Ferris sketches of Al-Masri and Sadiki with young women in a café, and Hani lights a pipe. Ferris frowns earnestly as Hani looks at a sundial, while Ferris's eyes dart. He smiles and holds up the envelope of sketches. Garland works on a tablet and stretches his arms above his head. At the naval port, a submarine surfaces in front of a dock, where pale light glows in the portholes and casts a sheen across the water. A lorry drives up, and sailors lift crates in boxes from the submarine and load them onto the lorry. Ferris walks along past a shipping terminal building, talking on his phone, and Skip's by a motorbike in arrivals. A sailor detonates a flare, and Al-Saleem watches a news report with one of his men. Ferris, Hani, and Garland are also watching as Garland sends the message in Mandarin. Ferris pulls out his headset while Al-Saleem sits on a terrace. His lieutenant walks over with a tablet, and Al-Saleem sits and opens it, which displays a picture of Sadiki. Al-Saleem looks at the picture, studies the photo, and narrows his eyes. In his workshop, Sadiki shows a prototype to three women when a partner calls over. Sadiki goes to a laptop and opens his mail, where alerts flood across the screen. He frowns as he starts to read the notices, and below the notice is a photograph of someone wearing a helmet. The next has a picture of someone holding up a Torah. Sadiki looks at a monitor that plays news footage of the explosion and, increasingly alarmed, takes off his spectacles. Carrying a backpack and tablet, Sadiki rushes out of the room, walks out onto the lawn, and stops to look around anxiously. Then he walks over to his bicycle, deactivating the lock as he goes, walks round to the seat, unlocks it, opens it, and gets on. He frantically turns the pedal in the chain, switches on the front light as a group of people wander past watching, and rides away on his green bicycle."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "They all gather at the table, and Cala pours drinks. Ferris glances at the boys, and Rowley nods his head thoughtfully. Ferris turns to the boys again, and Yousef grins in approval of the next dish, which Aisha observes. Cala glances at the boys and nods, causing Aisha to glance at Cala, perplexed. She folds a white napkin, and he chuckles and winks at Aisha as they stroll out to the street. He gestures with his hand, and Aisha chuckles and glances up to a window where Cala is peering down at them. Ferris salutes her, and without embracing, Ferris departs. Aisha taps her fingers as she glances up at people peering out of windows, observing her. Hani hands Ferris sketches of Al-Masri and Sadiki with young women in a club, and Hani inspects a cigar. Ferris grimaces earnestly as Hani peers at a grandfather clock, while Ferris's gaze flits about. He chuckles and waves the file of photographs. Garland types on a computer and stretches his legs under the desk. At the military airbase, a chopper appears in front of a hangar, where pale light flickers in the windows and casts a shadow across the tarmac. A troop carrier rolls up, and soldiers hang flags in body bags from the chopper and fit them onto the troop carrier. Ferris strides along past an airport terminal building, chatting on his phone, and Skip's beside an SUV in arrivals. A soldier dismantles a bomb, and Al-Saleem discusses a news report with one of his men. Ferris, Hani, and Garland are also observing as Garland translates the message in Arabic. Ferris adjusts his earpiece while Al-Saleem stands on a balcony. His lieutenant approaches with a laptop, and Al-Saleem stands and closes it, which displays a picture of Sadiki. Al-Saleem glances at the picture, inspects the photo, and rubs his chin. In his office, Sadiki reviews a model with three men when a colleague gestures over. Sadiki approaches a computer and scans his mail, where emails scroll across the screen. He scowls as he begins to read the messages, and below the message is a photograph of someone wearing a mask. The next shows a picture of someone holding up a book. Sadiki glances at a TV that displays news footage of the bombing and, increasingly worried, polishes his glasses. Carrying a folder and laptop, Sadiki dashes out of the building, steps out onto the street, and pauses to glance around anxiously. Then he steps over to his Mercedes, disabling the alarm as he goes, steps round to the driver's door, locks it, closes it, and settles in. He carefully turns the key in the ignition, turns off the headlights as a group of men drift past watching, and rolls away in his cream Mercedes."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "The umbrellas all sit at the garden, and Violet serves popcorn. The radio looks at the rabbits, and the suitcase shakes its head gravely. The radio looks to the rabbits again, and the blender nods in approval of the next bowl, which the kite notices. Violet looks at the rabbits and points, causing the kite to look at Violet, worried. It waves a purple balloon, and the chair smiles and raises its eyebrows at the kite as they walk out to the beach. It holds out its arm, and the kite smiles and looks up to a ceiling where Violet is looking down at them. The radio waves to it, and without shaking branches, the radio goes. The kite wrings its branches as it looks up at bicycles leaning out of ceilings, watching it. The suitcase gives the radio paintings of Al-Masri and Sadiki with young oranges in a cafe, and the suitcase lights a candle. The radio frowns earnestly as the suitcase looks at a digital watch, while the radio's wheels dart. It smiles and holds up the folder of paintings. The trampoline works on a tablet and stretches its legs above its roof. At the school library, a helicopter lands in front of a stadium, where dim light glows in the ceilings and casts a sheen across the rooftop. A bicycle carrier drives up, and cats lift plants in plant pots from the helicopter and load them onto the bicycle carrier. The radio walks along past a bus station building, talking on its camera, and skips by a bulldozer in departures. A bowler hat detonates a firecracker, and Al-Saleem watches a weather report with one of its dogs. The radio, the suitcase, and the trampoline are also watching as the trampoline sends the postcard in French. The radio pulls out its microphone while Al-Saleem sits on a balcony. Its umbrella walks over with a typewriter, and Al-Saleem sits and opens it, which displays a drawing of Sadiki. Al-Saleem looks at the drawing, studies the sketch, and narrows its leaves. In its garage, Sadiki shows a statue to three chairs when a mat calls over. Sadiki goes to a tablet and opens its notebook, where scripts flood across the projector. It frowns as it starts to read the scripts, and below the script is a sketch of someone wearing a hat. The next has a sketch of someone holding up the Torah. Sadiki looks at a radio that plays comedy footage of the firecracker and, increasingly alarmed, takes off its shoes. Carrying a suitcase and typewriter, Sadiki rushes out of the spaceship, walks out onto the beach, and stops to look around anxiously. Then it walks over to its bicycle, deactivating the alarm as it goes, walks round to the driver's window, unlocks it, opens it, and gets in. It frantically turns the key in the ignition, switches on the flashlights as a group of dogs wander past watching, and rides away in its blue bicycle."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "They all stand on the rooftop, and Mira paints a mural. Jarvis glances at the clouds, and Spencer nods his head slowly. Jarvis glances to the clouds again, and Omar grins in recognition of the next brush stroke, which Lina observes. Mira glances at the clouds and claps, prompting Lina to glance at Mira, apprehensive. She tosses a blue scarf, and he chuckles and raises his arms at Lina as they dance out to the street. He extends his arm, and Lina chuckles and glances up to a balcony where Mira is watching them. Jarvis nods to her, and without embracing, Jarvis departs. Lina taps her feet as she glances up at birds flying across balconies, observing her. Tariq hands Jarvis postcards of Al-Tariq and Jabari with young women in a lounge, and Tariq blows on a harmonica. Jarvis grimaces thoughtfully as Tariq glances at a grandfather clock, while Jarvis's gaze flits. He nods and waves the bundle of postcards. Harper skims through a tablet and lifts his legs onto the desk. At the naval dockyard, a submarine surfaces in front of a warehouse, where faint light flickers in the portholes and reflects off the water. A cargo ship pulls up, and sailors hoist crates in wooden boxes from the submarine and stack them onto the cargo ship. Jarvis strolls along past a train station building, gesturing on his Bluetooth, and Dooley's near a jeep in departures. A sailor plants a flag, and Al-Zahir listens to a podcast with one of his allies. Jarvis, Tariq, and Harper are also listening as Harper crafts the document in French. Jarvis yanks out his Bluetooth while Al-Zahir reclines on a veranda. His captain walks over with a tablet, and Al-Zahir examines it, which displays a sketch of Jabari. Al-Zahir examines the sketch, scrutinizes the drawing, and tightens his lips. In his studio, Jabari reveals a sculpture to three critics when a helper whispers nearby. Jabari moves to a tablet and taps his messages, where notifications flash across the screen. He scowls as he begins to review the alerts, and beneath the alert is an illustration of someone wearing a helmet. The next has an image of someone holding up a Torah. Jabari glances at a monitor that plays documentary footage of the collision and, increasingly unnerved, takes off his headset. Carrying a backpack and tablet, Jabari dashes out of the workshop, steps out onto the street, and pauses to glance around warily. Then he strides over to his Jaguar, disengaging the lock as he proceeds, walks round to the passenger door, unlatches it, swings it open, and climbs in. He hastily presses the button on the dashboard, switches on the fog lights as a gang of youths amble by observing, and speeds away in his red Jaguar."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "They all perch at the bench, and Cala offers beverages. Ferris glances at the girls, and Rowley tilts his head thoughtfully. Ferris glances at the girls again, and Yousef grins in admiration of the subsequent song, which Aisha overhears. Cala surveys the girls and gestures, prompting Aisha to stare at Cala, concerned. She waves a yellow flag, and he chuckles and arches his nose at Aisha as they march out to the park. He extends his umbrella, and Aisha grins and peers up to a rooftop where Cala is peering down at them. Ferris salutes her, and without exchanging books, Ferris departs. Aisha clasps her fingers as she gazes up at birds perching on rooftops, observing her. Hani hands Ferris maps of Al-Masri and Sadiki with young women in a restaurant, and Hani inhales a pipe. Ferris gazes seriously as Hani stares at a sundial, while Ferris's pupils twitch. He chuckles and holds up the bundle of maps. Garland fiddles on a typewriter and flexes his legs beneath his chair. At the naval yard, a sailboat anchors in front of a warehouse, where dim torches flicker in the doors and cast a shadow across the dock. A cargo truck rolls up, and workers hoist crates in shipping containers from the sailboat and load them onto the cargo truck. Ferris strolls along past a train station platform, chatting on his radio, and Skips by a motorcycle in departures. An officer triggers a flare, and Al-Saleem tunes into a weather report with one of his crew. Ferris, Hani, and Garland are also tuning in as Garland types the note in Swahili. Ferris removes his headphones while Al-Saleem reclines on a porch. His assistant drifts over with a tablet, and Al-Saleem reclines and browses it, which displays a sketch of Sadiki. Al-Saleem scrutinizes the sketch, examines the drawing, and tightens his lips. In his workshop, Sadiki displays a sculpture to three women when a partner calls across. Sadiki heads to a tablet and reads his texts, where messages cascade across the display. He grimaces as he begins to peruse the notes, and below the note is a drawing of someone wearing a sombrero. The next shows an image of someone waving a passport. Sadiki observes a radio that plays updates on the explosion and, increasingly petrified, removes his hat. Carrying a backpack and tablet, Sadiki bolts out of the structure, strides onto the avenue, and halts to survey nervously. Then he ambles over to his bicycle, disabling the lock as he goes, walks around to the pedal, unlocks it, mounts it, and rides off. He hastily spins the pedal in the chain, switches on the tail light as a flock of pigeons flutters nearby watching, and pedals away on his blue bicycle."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "They all perch on the roof, and Zara delivers books. Milo glances at the statues, and Patrick waves his foot joyfully. Milo glances to the statues again, and Oliver claps in disapproval of the next painting, which Fiona observes. Zara glances at the statues and laughs, causing Fiona to glance at Zara, annoyed. She tosses a red scarf, and he frowns and lowers his hat at Fiona as they shuffle out to the forest. He holds out his umbrella, and Fiona frowns and glances up to a cloud where Zara is peering down at them. Milo claps to her, and without jumping rope, Milo yells. Fiona scratches her nose as she glances up at animals hanging out of trees, observing her. Sami hands Milo sketches of Al-Greco and Jabari with old men in a barn, and Sami sips a smoothie. Milo smiles sadly as Sami peers at a cuckoo clock, while Milo's fingers twitch. He scowls and unfolds the map of sketches. Morgan paints on a canvas and wiggles his feet above his head. At the botanical garden, a breeze drifts in front of a greenhouse, where orange mist swirls in the panes and casts a shadow across the grass. A wagon rolls up, and gardeners unload flowers in flower pots from the breeze and stack them onto the wagon. Milo dances along past an aquarium entrance, humming into his radio, and skips by a bus in line. A pilot plants a seed, and Al-Mansoor watches a concert snippet with one of his women. Milo, Sami, and Morgan are also watching as Morgan translates the instructions in German. Milo takes off his jacket while Al-Mansoor reclines on a hammock. His assistant wanders over with a telescope, and Al-Mansoor reclines and peers through it, which displays a painting of Jabari. Al-Mansoor squints at the painting, examines the canvas, and widens his smile. In his kitchen, Jabari presents a sculpture to three women when a friend waves over. Jabari heads to a typewriter and reads his telegram, where postcards flutter across the desk. He chuckles as he begins to paint the images, and above the image is a drawing of someone wearing a fez. The next has a drawing of someone holding up a map. Jabari peers at a radio that plays music clips of the fireworks and, increasingly amused, puts on his sunglasses. Carrying a backpack and telescope, Jabari strolls out of the apartment, shuffles out onto the road, and pauses to wave around cheerfully. Then he strolls over to his bicycle, fastening the lock as he strolls, shuffles round to the saddlebag, undoes it, lifts it, and pedals in. He cheerfully rings the bell in the handlebars, switches on the lamp as a flock of birds flutter past observing, and pedals away on his red bicycle."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "At a meal, Cala serves food while Ferris and Rowley observe the boys. Yousef approves the dish, noticed by Aisha, who waves a napkin at Cala. As Ferris leaves, Aisha looks around nervously. Hani shows Ferris incriminating photos of Al-Masri and Sadiki, then lights a cigar while Ferris examines the images. Garland works on a computer, stretching as a chopper lands at a military airbase. Soldiers transfer body bags from the chopper to a troop carrier. Ferris talks on his phone, passing the airport as a bomb detonates. Al-Saleem watches the news with his men as Ferris, Hani, and Garland monitor events. Al-Saleem receives a laptop displaying Sadiki's photo and becomes suspicious. Sadiki, alarmed by emails and news footage of a bombing, rushes from his office. He heads to his Mercedes, anxiously starting the car as onlookers watch, then drives away."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "He frantically turns the key in the ignition switches on the headlights as a group of men wander past watching and drives away in his cream Mercedes Then he walks over to his Mercedes deactivating the alarm as he goes walks round to the driver's door unlocks it opens it and gets in Carrying a case and laptop Sadiki rushes out of the building walks out onto the street and stops to look around anxiously Sadiki looks at a TV that plays news footage of the bombing and increasingly alarmed takes off his glasses The next has a picture of someone holding up the Koran He frowns as he starts to read the messages and below the message is a photograph of someone wearing a balaclava Sadiki goes to a computer and opens his mail where emails flood across the screen In his office Sadiki shows a model to three men when a colleague calls over AlSaleem looks at the picture studies the photo and narrows his eyes His lieutenant walks over with a laptop and AlSaleem sits and opens it which displays a picture of Sadiki Ferris pulls out his earpiece while AlSaleem sits on a balcony Ferris Hani and Garland are also watching as Garland sends the message in Arabic A soldier detonates a bomb and AlSaleem watches a news report with one of his men Ferris walks along past an airport terminal building talking on his phone and Skip's by an SUV in arrivals A troop carrier drives up and soldiers lift bodies in body bags from the chopper and load them onto the troop carrier At the military airbase a chopper lands in front of a hangar where pale light glows in the windows and casts a sheen across the tarmac Garland works on a computer and stretches his arms above his head He smiles and holds up the file of photographs Ferris frowns earnestly as Hani looks at a grandfather clock while Ferris's eyes dart Hani gives Ferris photographs of AlMasri and Sadiki with young women in a club and Hani lights a cigar Aisha wrings her hands as she looks up at people leaning out of windows watching her Ferris waves to her and without shaking hands Ferris goes He holds out his hand and Aisha smiles and looks up to a window where Cala is looking down at them She waves a white napkin and he smiles and raises his eyebrows at Aisha as they walk out to the street Cala looks at the boys and points causing Aisha to look at Cala worried Ferris looks to the boys again and Yousef nods in approval of the next dish which Aisha notices Ferris looks at the boys and Rowley shakes his head gravely They all sit at the table and Cala serves food"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "His lieutenant walks over with a laptop and AlSaleem sits and opens it which displays a picture of Sadiki Ferris Hani and Garland are also watching as Garland sends the message in Arabic He smiles and holds up the file of photographs Sadiki goes to a computer and opens his mail where emails flood across the screen He frantically turns the key in the ignition switches on the headlights as a group of men wander past watching and drives away in his cream Mercedes Ferris waves to her and without shaking hands Ferris goes He holds out his hand and Aisha smiles and looks up to a window where Cala is looking down at them Garland works on a computer and stretches his arms above his head Ferris walks along past an airport terminal building talking on his phone and Skip's by an SUV in arrivals Ferris frowns earnestly as Hani looks at a grandfather clock while Ferris's eyes dart Sadiki looks at a TV that plays news footage of the bombing and increasingly alarmed takes off his glasses At the military airbase a chopper lands in front of a hangar where pale light glows in the windows and casts a sheen across the tarmac AlSaleem looks at the picture studies the photo and narrows his eyes A soldier detonates a bomb and AlSaleem watches a news report with one of his men Carrying a case and laptop Sadiki rushes out of the building walks out onto the street and stops to look around anxiously Ferris looks at the boys and Rowley shakes his head gravely A troop carrier drives up and soldiers lift bodies in body bags from the chopper and load them onto the troop carrier Ferris looks to the boys again and Yousef nods in approval of the next dish which Aisha notices Ferris pulls out his earpiece while AlSaleem sits on a balcony Then he walks over to his Mercedes deactivating the alarm as he goes walks round to the driver's door unlocks it opens it and gets in She waves a white napkin and he smiles and raises his eyebrows at Aisha as they walk out to the street He frowns as he starts to read the messages and below the message is a photograph of someone wearing a balaclava Aisha wrings her hands as she looks up at people leaning out of windows watching her Hani gives Ferris photographs of AlMasri and Sadiki with young women in a club and Hani lights a cigar The next has a picture of someone holding up the Koran They all sit at the table and Cala serves food Cala looks at the boys and points causing Aisha to look at Cala worried In his office Sadiki shows a model to three men when a colleague calls over"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Ferris walks along past an airport terminal building talking on his phone and Skip's by an SUV in arrivals A soldier detonates a bomb and AlSaleem watches a news report with one of his men Ferris Hani and Garland are also watching as Garland sends the message in Arabic Ferris pulls out his earpiece while AlSaleem sits on a balcony His lieutenant walks over with a laptop and AlSaleem sits and opens it which displays a picture of Sadiki AlSaleem looks at the picture studies the photo and narrows his eyes In his office Sadiki shows a model to three men when a colleague calls over Sadiki goes to a computer and opens his mail where emails flood across the screen He frowns as he starts to read the messages and below the message is a photograph of someone wearing a balaclava The next has a picture of someone holding up the Koran Sadiki looks at a TV that plays news footage of the bombing and increasingly alarmed takes off his glasses Carrying a case and laptop Sadiki rushes out of the building walks out onto the street and stops to look around anxiously Then he walks over to his Mercedes deactivating the alarm as he goes walks round to the driver's door unlocks it opens it and gets in He frantically turns the key in the ignition switches on the headlights as a group of men wander past watching and drives away in his cream Mercedes They all sit at the table and Cala serves food Ferris looks at the boys and Rowley shakes his head gravely Ferris looks to the boys again and Yousef nods in approval of the next dish which Aisha notices Cala looks at the boys and points causing Aisha to look at Cala worried She waves a white napkin and he smiles and raises his eyebrows at Aisha as they walk out to the street He holds out his hand and Aisha smiles and looks up to a window where Cala is looking down at them Ferris waves to her and without shaking hands Ferris goes Aisha wrings her hands as she looks up at people leaning out of windows watching her Hani gives Ferris photographs of AlMasri and Sadiki with young women in a club and Hani lights a cigar Ferris frowns earnestly as Hani looks at a grandfather clock while Ferris's eyes dart He smiles and holds up the file of photographs Garland works on a computer and stretches his arms above his head At the military airbase a chopper lands in front of a hangar where pale light glows in the windows and casts a sheen across the tarmac A troop carrier drives up and soldiers lift bodies in body bags from the chopper and load them onto the troop carrier"
        }
      ]
    }
  ]
}