{
  "ground_truth": "Jacob cocks his head, then nods, and Cal sighs heavily. Cal turns to Jacob, who shakes his head and shrugs his shoulders, as Cal gazes at him penetratingly and raises his brows. Jacob looks at him directly and nods, then he nods again and turns away. Cal turns and stares directly ahead as Jacob gets off his bar stool and soldiers out, putting his hands in his pockets. Cal downs his shot. At school, all the kids have dressed smartly and lined up on a long row at the back of tiered seating constructed in the hall. Cal walks past the kids and over to the seating, looking across the hall and spying Emily with Molly and Hannah. His eyes light up hopefully when he spots an empty seat next to Hannah, but then he sees Jacob stamping over a chair to take the seat next to her. Cal looks away and heads upstairs, making his way to a seat on the other side of the structure. Cal points to a seat between a man and woman who are chatting, and the guy leans back so Cal can sit down. On the stage, Robbie in a suit, sits slumped at the end of a row. Cal eyes him and smiles softly. Robbie looks up and sees Jessica sitting with her parents and looks down miserably. The principal walks onto the stage and up to the podium, and Emily's jaw tightens. Kate takes the podium, and Cal beams and claps proudly as Emily, Molly, Hannah, and Jacob clap and cheer. Robbie gets up, and Jessica smiles as Robbie plods over to the podium. Emily smiles and glances at Molly, while Cal frowns and Emily’s face falls. Robbie looks at Cal, who stands up, causing the audience to all turn to him. Cal makes his way down the seating structure, squeezing past Bernie as Robbie's eyes start to find. Kate leans into the principal and whispers something, to which the principal nods. Cal faces the audience, and Kate puts her middle finger up at him. Cal turns to glance at Robbie as Emily's eyes brim. Tearfully, Emily smiles as Claire and Bernie glance at each other and smile. Emily's jaw slackens as Cal turns back to Robbie, and Emily smiles and looks down. Cal turns back to Robbie, who beams. Jessica hangs her head, giggling, as Emily laughs. Claire glances at Jessica with a worried look, and Emily wipes away a tear. Cal puts his arm around Robbie, and they leave the podium. In the school grounds, the kids and parents stand around chatting as Emily, Molly, Jacob, and Hannah head over to Cal and Robbie. Hannah and Cal wrap their arms around each other, and Cal eyes Jacob as Hannah steps back. Cal addresses Jacob, who steps forward nervously, and Cal holds out his hand. They shake, and Jacob smiles before Cal slaps Jacob.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Jacob tilts his head, then nods, and Cal exhales heavily. Cal turns to Jacob, who shakes his head and shrugs his shoulders, as Cal stares at him intensely and raises his brows. Jacob gazes at him directly and nods, then he nods again and turns away. Cal turns and gazes directly ahead as Jacob gets off his bar stool and marches out, putting his hands in his pockets. Cal downs his drink. At school, all the children have dressed stylishly and lined up in a long row at the back of tiered seating constructed in the hall. Cal walks past the children and over to the seating, looking across the hall and spotting Emily with Molly and Hannah. His eyes illuminate hopefully when he notices an unoccupied seat next to Hannah, but then he sees Jacob stepping over a chair to take the seat next to her. Cal looks away and heads upstairs, making his way to a seat on the other side of the structure. Cal indicates a seat between a man and woman who are chatting, and the guy leans back so Cal can sit down. On the stage, Robbie in a suit, sits slouched at the end of a row. Cal observes him and smiles gently. Robbie looks up and sees Jessica sitting with her parents and looks down miserably. The principal walks onto the stage and up to the podium, and Emily's jaw tightens. Kate takes the podium, and Cal beams and claps proudly as Emily, Molly, Hannah, and Jacob clap and cheer. Robbie gets up, and Jessica smiles as Robbie trudges over to the podium. Emily smiles and glances at Molly, while Cal scowls and Emily’s face falls. Robbie looks at Cal, who stands up, causing the audience to all turn to him. Cal makes his way down the seating structure, squeezing past Bernie as Robbie's eyes start to search. Kate leans into the principal and whispers something, to which the principal nods. Cal faces the audience, and Kate puts her middle finger up at him. Cal turns to glance at Robbie as Emily's eyes fill. Tearfully, Emily smiles as Claire and Bernie glance at each other and smile. Emily's jaw relaxes as Cal turns back to Robbie, and Emily smiles and looks down. Cal turns back to Robbie, who beams. Jessica hangs her head, giggling, as Emily laughs. Claire glances at Jessica with a concerned look, and Emily wipes away a tear. Cal puts his arm around Robbie, and they leave the podium. In the school grounds, the children and parents stand around chatting as Emily, Molly, Jacob, and Hannah head over to Cal and Robbie. Hannah and Cal wrap their arms around each other, and Cal eyes Jacob as Hannah steps back. Cal addresses Jacob, who steps forward anxiously, and Cal holds out his hand. They shake, and Jacob smiles before Cal slaps Jacob."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Jacob's head is cocked, then a nod is given by him, and a heavy sigh is given by Cal. Jacob is turned to by Cal, who has his head shaken and shoulders shrugged by Jacob, as Jacob is penetrated by Cal's gaze while his brows are raised. Cal is looked at directly by Jacob, and a nod is given by him again before he turns away. Jacob's bar stool is gotten off by him, and he soldiers out while placing his hands in his pockets, as Cal turns and stares directly ahead. A shot is downed by Cal. At school, the kids have dressed smartly and line themselves up in a long row at the back of tiered seating constructed in the hall. The kids are walked past by Cal over to the seating, and the hall is looked across by him, spying Emily with Molly and Hannah. When an empty seat next to Hannah is spotted by him, his eyes light up hopefully, but Jacob is seen by him stamping over a chair to take the seat next to her. Cal looks away and heads upstairs, making his way to a seat on the other side of the structure. A seat between a man and woman who chat is pointed to by Cal, and the guy leans back to allow Cal to sit down. On the stage, Robbie, in a suit, is slumped at the end of a row. He is eyed by Cal, who smiles softly. Jessica is seen by Robbie sitting with her parents, and he looks down miserably. The stage is walked onto by the principal and the podium is approached, causing Emily's jaw to tighten. The podium is taken by Kate, and proud claps and a beaming smile are given by Cal as cheers and claps are given by Emily, Molly, Hannah, and Jacob. The podium is plodded over to by Robbie, getting up as Jessica smiles. A look is shared between Emily and Molly, as she smiles, while Cal frowns and Emily’s face falls. Cal is looked at by Robbie, who stands up, causing all the audience to turn to him. The seating structure is made his way down by Cal, squeezing past Bernie as Robbie's eyes start to find him. The principal is leaned into by Kate and a whisper is given, resulting in a nod from the principal. The audience is faced by Cal, and Kate's middle finger is put up at him. Robbie is glanced at by Cal as Emily's eyes brim. Smiles, tearfully, are given by Emily as glances are exchanged between Claire and Bernie, who smile. Robbie is turned back to by Cal, and Emily’s jaw slackens, smiling and looking down. Back to Robbie, Cal turns as a beam is given by Robbie. Laughter escapes from Emily as Jessica giggles and hangs her head. A worried look is glanced at Jessica by Claire, while a tear is wiped away by Emily. An arm is put around Robbie by Cal, and the podium is left by them. In the school grounds, kids and parents stand around chatting as Cal and Robbie are headed over to by Emily, Molly, Jacob, and Hannah. Arms are wrapped around each other by Hannah and Cal, and Jacob is eyed by Cal as Hannah steps back. Jacob is addressed by Cal, who steps forward nervously, and Cal holds out his hand. They shake, producing a smile from Jacob before a slap is delivered to Jacob by Cal."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Jacob cocks his head, nods, and Cal sighs. Cal turns to Jacob, who shakes his head and shrugs as Cal gazes intently and raises his brows. Jacob nods again and turns away. Cal stares ahead as Jacob leaves, hands in pockets, while Cal downs his shot. At school, neatly dressed kids line up at the back of tiered seating in the hall. Cal walks past them, spotting Emily with Molly and Hannah, and his eyes light up at an empty seat next to Hannah. However, Jacob takes the seat first. Cal looks away, heading to a seat on the other side. Cal points to a spot between a chatting couple, and the guy leans back to let Cal sit. On stage, Robbie, in a suit, sits slumped. Cal eyes him, smiling softly, while Robbie looks down, spotting Jessica with her parents. The principal arrives, and Emily's jaw tightens as Kate takes the podium. Cal claps proudly with Emily, Molly, Hannah, and Jacob. Robbie rises, and Jessica smiles as he approaches the podium. Emily smiles at Molly, while Cal frowns, causing Emily’s face to fall. Robbie looks at Cal, who stands, drawing the audience's attention. Cal moves down the seating, squeezing past Bernie as Robbie's eyes start to find. Kate whispers to the principal, who nods, while Kate gestures rudely at Cal. Cal turns back to Robbie as Emily's eyes brim with tears. Emily smiles and looks down, while Cal and Robbie beam at each other. Jessica giggles, and Emily laughs, wiping away a tear. Cal puts his arm around Robbie, and they leave the podium. Outside, kids and parents chat as Emily, Molly, Jacob, and Hannah join Cal and Robbie. Hannah and Cal embrace, and Cal eyes Jacob as Hannah steps back. Cal addresses Jacob, who nervously steps forward, shaking hands with him before Cal playfully slaps Jacob."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Jacob cocks his head, nods, and Cal sighs. Cal turns to Jacob, who shakes his head and shrugs, while Cal gazes at him and raises his brows. Jacob nods, turns, and leaves as Cal stares ahead and downs his shot. At school, kids in smart outfits line up at the back of tiered seating. Cal walks to the seating, spots Emily with Molly and Hannah, eyes lighten at an empty seat near Hannah, but Jacob takes it. Cal heads to a seat on the other side, points at a spot between a chatting couple, and the man leans back for Cal to sit. On stage, Robbie slumps in a suit, and Cal smiles softly. Robbie sees Jessica with her parents and looks down. The principal approaches the podium, as Emily's jaw tightens. Kate takes the podium, and Cal proudly claps with Emily, Molly, Hannah, and Jacob. Robbie stands, Jessica smiles, and Emily's face falls as Cal frowns. Robbie looks at Cal, who stands, drawing the audience's attention. Cal moves down, squeezing past Bernie, as Robbie watches. Kate whispers to the principal, who nods. Cal faces the audience, and Kate gestures rudely. Cal glances at Robbie, Emily tears up, smiles, and Claire and Bernie smile at each other. Cal supports Robbie, and they leave the podium. Outside, kids and parents chat as Emily, Molly, Jacob, and Hannah join Cal and Robbie. Hannah and Cal embrace, Cal addresses Jacob, who steps forward nervously, and they shake hands before Cal slaps Jacob."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Jacob tilts his head thoughtfully, then gives a nod of affirmation, prompting Cal to let out a deep, weary sigh. Cal then turns his attention back to Jacob, who simply shakes his head from side to side and gives a nonchalant shrug of his shoulders, while Cal fixes him with an intense, penetrating gaze, subtly raising his eyebrows. Jacob meets Cal's gaze directly with a steady look, nods once more, and then, with a final nod, turns away from him. Cal shifts his gaze forward, staring intently ahead as Jacob dismounts from his bar stool. With a determined air, Jacob strides out of the room, his hands stuffed casually into his pockets. Meanwhile, Cal finishes his drink in one swift motion. \n\nAt the school, a noticeable sense of occasion hangs in the air as the children have donned their finest attire and are lined up smartly in a long, orderly row at the back of the hall's tiered seating arrangement. Cal strides past the neatly assembled line of children, making his way over to the seating area, his eyes scanning the breadth of the hall. He spots Emily, who is accompanied by Molly and Hannah, and his eyes light up with a hopeful glint as he notices an empty seat next to Hannah. However, his hopeful expression dims as he observes Jacob clambering over a chair to claim the seat beside her. With a resigned look, Cal turns away and proceeds upstairs, navigating his way to a seat located on the opposite side of the seating structure. \n\nOnce there, Cal gestures towards a seat nestled between a man and a woman who are engaged in conversation. The man obligingly leans back to let Cal sit down with ease. On the stage, Robbie, dressed in a formal suit, sits slumped at the far end of a row, looking rather dejected. Cal's gaze softens as he glances at Robbie and offers a gentle smile of encouragement. From his seated position, Robbie lifts his head, his eyes catching sight of Jessica seated with her parents, which causes him to look down with a crestfallen expression. \n\nMeanwhile, the principal makes a dignified entrance onto the stage and approaches the podium, prompting Emily's jaw to tighten with anticipation. Kate then steps up to the podium, and Cal beams with pride, clapping enthusiastically as Emily, Molly, Hannah, and Jacob join in with clapping and cheering. Robbie rises from his seat, and Jessica's face lights up with a smile as she watches him plod over to the podium. Emily smiles and exchanges a glance with Molly, while Cal's face clouds over with a frown, causing Emily's expression to fall. Robbie looks in Cal's direction, who, in turn, stands up, drawing the attention of the entire audience as they all swivel to face him. Cal begins to make his way down the seating structure, carefully squeezing past Bernie, attracting Robbie's full attention in the process. Kate leans over to whisper something into the principal's ear, to which the principal responds with a nod of agreement. Cal faces the audience, while Kate, in a moment of playful irreverence, raises her middle finger at him. \n\nCal takes a moment to glance back at Robbie, noticing the tears welling up in Emily's eyes. Despite her tears, Emily offers a heartfelt smile as Claire and Bernie exchange a knowing smile with each other. Emily's jaw slackens in gentle relief as Cal turns back towards Robbie, and Emily lowers her gaze, smiling softly to herself. Cal turns once more to Robbie, who is now beaming with happiness. Jessica hangs her head, letting out a soft giggle, while Emily is overtaken by laughter. Claire glances over at Jessica with a look of concern, while Emily wipes a tear from her eye. Cal then wraps an arm around Robbie, and together they step away from the podium. \n\nOutside, in the school grounds, students and parents mingle, engaging in lively conversations as Emily, Molly, Jacob, and Hannah move over to where Cal and Robbie are standing. Hannah and Cal share a warm embrace before Hannah steps aside, allowing Cal to focus his attention on Jacob. Cal addresses Jacob, who tentatively steps forward, feeling a bit nervous, and Cal extends his hand in a gesture of camaraderie. They shake hands firmly, with Jacob breaking into a smile, though his smile turns to surprise when Cal playfully slaps him on the back."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Jacob tilts his head thoughtfully, contemplating the situation, and then gives a nod of affirmation, prompting Cal to let out a deep, weary sigh, as if releasing the tension that had built up. Cal, gathering his thoughts, turns his attention back to Jacob, who simply shakes his head from side to side in a gesture of disagreement and gives a nonchalant shrug of his shoulders. Cal fixes him with an intense, penetrating gaze, subtly raising his eyebrows in an unspoken question. Jacob meets Cal's gaze directly with a steady look, nods once more, and then, with a final nod to indicate his decision is made, turns away from him. Cal shifts his gaze forward, staring intently ahead as Jacob dismounts from his bar stool with purpose. With a determined air, Jacob strides out of the room, his hands stuffed casually into his pockets, leaving Cal behind. Meanwhile, Cal finishes his drink in one swift, decisive motion.\n\nAt the school, a noticeable sense of occasion hangs heavily in the air, as the children have donned their finest attire and are lined up smartly in a long, orderly row at the back of the hall's tiered seating arrangement, creating a picturesque scene. Cal strides past the neatly assembled line of children, making his way over to the seating area, his eyes scanning the breadth of the hall with focused attention. He spots Emily, who is accompanied by Molly and Hannah, and his eyes light up with a hopeful glint as he notices an empty seat next to Hannah that seems to be calling his name. However, his hopeful expression dims as he observes Jacob clambering over a chair to claim the seat beside her. With a resigned look, Cal turns away from the scene and proceeds upstairs, navigating his way to a seat located on the opposite side of the seating structure.\n\nOnce there, Cal gestures towards a vacant seat nestled between a man and a woman who are already engaged in a quiet conversation. The man obligingly leans back to let Cal sit down with ease, making room for him. On the stage, Robbie, dressed in a formal suit, sits slumped at the far end of a row, looking rather dejected and out of place. Cal's gaze softens as he glances at Robbie and offers a gentle smile of encouragement, hoping to lift his spirits. From his seated position, Robbie lifts his head, his eyes catching sight of Jessica seated with her parents, which causes him to look down with a crestfallen expression, making the moment bittersweet.\n\nMeanwhile, the principal makes a dignified entrance onto the stage and approaches the podium, prompting Emily's jaw to tighten with anticipation as the event unfolds. Kate then steps up to the podium, and Cal beams with pride, clapping enthusiastically as Emily, Molly, Hannah, and Jacob join in with clapping and cheering, filling the hall with a lively sound. Robbie rises from his seat, and Jessica's face lights up with a smile as she watches him plod over to the podium. Emily smiles and exchanges a glance with Molly, while Cal's face clouds over with a frown, causing Emily's expression to fall, creating an air of tension. Robbie looks in Cal's direction, who, in turn, stands up, drawing the attention of the entire audience as they all swivel to face him, curious about his next move. Cal begins to make his way down the seating structure, carefully squeezing past Bernie, attracting Robbie's full attention in the process. Kate leans over to whisper something into the principal's ear, to which the principal responds with a nod of agreement, signaling a shared understanding. Cal faces the audience, while Kate, in a moment of playful irreverence, raises her middle finger at him, adding a touch of humor to the proceedings.\n\nCal takes a moment to glance back at Robbie, noticing the tears welling up in Emily's eyes, which are filled with emotion. Despite her tears, Emily offers a heartfelt smile as Claire and Bernie exchange a knowing smile with each other, understanding the significance of the moment. Emily's jaw slackens in gentle relief as Cal turns back towards Robbie, and Emily lowers her gaze, smiling softly to herself, feeling a sense of satisfaction. Cal turns once more to Robbie, who is now beaming with happiness, his expression transformed. Jessica hangs her head, letting out a soft giggle, while Emily is overtaken by laughter that echoes around her. Claire glances over at Jessica with a look of concern, while Emily wipes a tear from her eye, clearing her vision. Cal then wraps an arm around Robbie, pulling him close, and together they step away from the podium, marking the end of the event.\n\nOutside, in the school grounds, students and parents mingle together, engaging in lively conversations as Emily, Molly, Jacob, and Hannah move over to where Cal and Robbie are standing. Hannah and Cal share a warm, affectionate embrace before Hannah steps aside, allowing Cal to focus his attention on Jacob. Cal addresses Jacob, who tentatively steps forward, feeling a bit nervous in the moment, and Cal extends his hand in a gesture of camaraderie. They shake hands firmly, with Jacob breaking into a smile, though his smile turns to surprise when Cal playfully slaps him on the back, showing a sense of humor and camaraderie."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Jacob tilts his head slightly, considering something, then nods in agreement with a subtle movement. Cal lets out a deep, heavy sigh, turning his attention to Jacob. Jacob, in response, shakes his head slowly, indicating disagreement, while simultaneously lifting his shoulders in a casual shrug. As Cal maintains a penetrating gaze at Jacob, his eyebrows arch inquisitively. Jacob meets Cal's gaze directly, nodding once to affirm a shared understanding, and subsequently nods a second time for emphasis before averting his eyes and turning away. Cal shifts his focus to what lies ahead, staring intently as Jacob hops off his bar stool. Jacob then strides away confidently, tucking his hands into his pockets with a purposeful gesture. Cal quickly picks up his glass and downs his shot in one smooth motion. At school, the students have put on their best attire and arranged themselves neatly in a long line along the back of the tiered seating set up in the hall. Cal walks purposefully past the children, making his way to the seating area, his eyes scanning the hall until he catches sight of Emily chatting with Molly and Hannah. A glimmer of hope sparkles in his eyes as they light up upon spotting an empty seat next to Hannah, only for that hope to fade as he witnesses Jacob abruptly clamber over a chair to claim the seat beside her. Cal diverts his gaze, opting to ascend the stairs, weaving his way up to a seat on the opposite side. Spotting an available seat wedged between a man and a woman engrossed in conversation, Cal gestures politely to indicate his interest. The man graciously leans back to allow Cal to sit down. Onstage, Robbie, clad in a suit, sits slumped at the far end of a row. Cal's eyes land on Robbie, softening into a gentle smile. Robbie lifts his eyes to see Jessica seated with her parents, then drops his gaze in despondency. The principal strides onto the stage, heading to the podium, and Emily's jaw sets with tension. Kate steps up to the podium, prompting Cal to beam with pride, clapping enthusiastically as Emily, Molly, Hannah, and Jacob join in with cheers and applause. Robbie rises reluctantly, and Jessica's face brightens into a smile as Robbie trudges over to the podium. Emily's face lights up with a smile as she exchanges a glance with Molly, but Cal's expression contracts into a frown, causing Emily's demeanor to fall. Robbie's eyes meet Cal's, prompting Cal to stand abruptly, drawing the audience's focus onto him. Cal navigates his way down the seating structure, excusing himself as he squeezes past Bernie while Robbie's eyes gradually search the crowd. Kate leans in towards the principal, murmuring something softly, receiving a confirming nod in return. With his back to the audience, Cal faces forward and catches a glance of Kate flipping her middle finger at him. He turns back briefly to see Robbie as Emily's eyes brim with tears. Emily, through her tears, lets out a smile, prompting Claire and Bernie to exchange a shared look of happiness. Emily's jaw loosens in relief as Cal turns back towards Robbie, allowing Emily to smile again and drop her gaze. Cal pivots back to Robbie, who greets him with a beaming smile. Jessica lowers her head, releasing a giggle, while Emily joins her in laughter. Claire's brows knit together as she casts a worried glance at Jessica, but in contrast, Emily wipes a tear from her eye. Cal drapes an arm warmly around Robbie's shoulder, and together they walk away from the podium. In the school grounds, students and parents mingle and converse animatedly as Emily, Molly, Jacob, and Hannah approach Cal and Robbie. With affection, Hannah and Cal exchange a hug, and once they part, Cal fixes his gaze on Jacob. Hannah steps aside, allowing Cal to address Jacob, who steps forward with a hint of nervousness. Cal extends his hand in a cordial gesture. Jacob accepts the handshake, a smile spreading across his face, only for Cal to unexpectedly slap him."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Jacob nods after a brief exchange with Cal, who sighs heavily. Cal turns to face Jacob, who shakes his head and shrugs, as Cal intently meets his gaze and raises his eyebrows. Jacob nods again before exiting the bar, hands in pockets, while Cal downs his drink. At school, the kids are smartly dressed and lined up on tiered seating in the hall. Cal spots Emily with Molly and Hannah and notices an empty seat next to Hannah, but watches as Jacob takes it. Cal moves to the opposite side, sits between a chatting couple, and observes Robbie on stage, smiling softly. Robbie, looking despondent, notices Jessica with her parents, and the principal begins the event. Kate takes the podium, drawing applause from Cal and the others. As Robbie approaches the podium and makes eye contact with Jessica, Cal stands up, capturing the audience's attention. Moving down the seating, Cal causes a stir while Kate discreetly gestures at him. Emily, smiling tearfully, exchanges a glance with Claire and Bernie, while Cal and Robbie share a moment at the podium. In the school grounds afterward, Emily, Molly, Jacob, and Hannah approach Cal and Robbie. Hannah embraces Cal, who then addresses Jacob. They shake hands, leading to a moment of camaraderie before Cal playfully slaps Jacob."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Jacob cocks his head, then nods, and Cal sighs heavily, feeling the weight of an unspoken understanding between them. Cal turns to Jacob, who shakes his head and shrugs his shoulders, as Cal gazes at him penetratingly, communicating without words, and raises his brows. Jacob looks at him directly and nods, then he nods again in a gesture of silent agreement and turns away. Cal turns and stares directly ahead as Jacob gets off his bar stool and soldiers out, putting his hands in his pockets, bracing himself for the chilly evening air. Cal downs his shot, a small ritual of fortification. At school, a modern campus that has recently won awards for its educational environment, all the kids have dressed smartly and lined up in a long row at the back of tiered seating constructed in the hall for the upcoming ceremony. Cal walks past the kids and over to the seating, looking across the hall and spying Emily with Molly and Hannah, his closest friends since childhood. His eyes light up hopefully when he spots an empty seat next to Hannah, but then he sees Jacob stamping over a chair to take the seat next to her, a move that invoked both courage and friendship. Cal looks away and heads upstairs, making his way to a seat on the other side of the structure, which has been set up for the school’s annual assembly. Cal points to a seat between a man and woman who are chatting, and the guy leans back so Cal can sit down, a gesture of camaraderie among community members. On the stage, Robbie, known for his musical talent and wearing a suit for the first time since his graduation interview, sits slumped at the end of a row. Cal eyes him and smiles softly, knowing the struggles Robbie has faced this year. Robbie looks up and sees Jessica sitting with her parents, who are prominent figures in the town's local businesses, and looks down miserably, feeling the pressure of expectations. The principal, recently appointed and known for revolutionary changes, walks onto the stage and up to the podium, and Emily's jaw tightens, recalling a past disagreement. Kate takes the podium, and Cal beams and claps proudly as Emily, Molly, Hannah, and Jacob clap and cheer, appreciating Kate's inspiring leadership in extracurricular activities. Robbie gets up, and Jessica smiles as Robbie plods over to the podium, a significant moment he has been anxiously preparing for. Emily smiles and glances at Molly, while Cal frowns and Emily’s face falls, worried about what might unfold. Robbie looks at Cal, who stands up, causing the audience to all turn to him, the school's star athlete making an unexpected move. Cal makes his way down the seating structure, squeezing past Bernie, his science partner from the past year, as Robbie's eyes start to find clarity. Kate leans into the principal and whispers something, to which the principal nods, perhaps a reassurance about the ongoing presentation. Cal faces the audience, and Kate puts her middle finger up at him, a sign of their playful sibling rivalry. Cal turns to glance at Robbie as Emily's eyes brim, touched by the unfolding of emotions. Tearfully, Emily smiles as Claire and Bernie glance at each other and smile, sharing a moment of mutual understanding. Emily's jaw slackens as Cal turns back to Robbie, and Emily smiles and looks down, filled with complex emotions. Cal turns back to Robbie, who beams, proud of his moment on stage. Jessica hangs her head, giggling, as Emily laughs, enjoying the lighthearted moment. Claire, known for her candid advice, glances at Jessica with a worried look, concerned about her friend’s reaction, and Emily wipes away a tear, moved by the sincerity of the event. Cal puts his arm around Robbie, and they leave the podium together, symbolizing the solidified bond between them. In the school grounds, the oak-shaded area often used for community gatherings, the kids and parents stand around chatting as Emily, Molly, Jacob, and Hannah head over to Cal and Robbie, sharing stories from the ceremony. Hannah and Cal wrap their arms around each other, reaffirming their close connection, and Cal eyes Jacob as Hannah steps back, a silent acknowledgment passed between them. Cal addresses Jacob, who steps forward nervously, and Cal holds out his hand, a gesture of reconciliation and new beginnings. They shake, and Jacob smiles before Cal slaps Jacob, a friendly gesture reminiscent of their shared history."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Robbie looks at Cal who stands up causing the audience to all turn to him Jacob cocks his head then nods and Cal sighs heavily His eyes light up hopefully when he spots an empty seat next to Hannah but then he sees Jacob stamping over a chair to take the seat next to her Cal turns to Jacob who shakes his head and shrugs his shoulders as Cal gazes at him penetratingly and raises his brows Jacob looks at him directly and nods then he nods again and turns away Cal turns and stares directly ahead as Jacob gets off his bar stool and soldiers out putting his hands in his pockets Cal downs his shot At school all the kids have dressed smartly and lined up on a long row at the back of tiered seating constructed in the hall Cal walks past the kids and over to the seating looking across the hall and spying Emily with Molly and Hannah Robbie looks up and sees Jessica sitting with her parents and looks down miserably His eyes light up hopefully when he spots an empty seat next to Hannah but then he sees Jacob stamping over a chair to take the seat next to her Cal looks away and heads upstairs making his way to a seat on the other side of the structure Cal points to a seat between a man and woman who are chatting and the guy leans back so Cal can sit down Cal puts his arm around Robbie and they leave the podium On the stage Robbie in a suit sits slumped at the end of a row then he nods again and turns away Cal eyes him and smiles softly Cal walks past the kids and over to the seating looking across the hall and spying Emily with Molly and Hannah Jacob looks at him directly and nods Cal turns to Jacob who shakes his head and shrugs his shoulders as Cal gazes at him penetratingly and raises his brows Cal turns back to Robbie who beams Robbie looks up and sees Jessica sitting with her parents and looks down miserably The principal walks onto the stage and up to the podium and Emily's jaw tightens Kate takes the podium and Cal beams and claps proudly as Emily Molly Hannah and Jacob clap and cheer Robbie gets up and Jessica smiles as Robbie plods over to the podium Emily smiles and glances at Molly while Cal frowns and Emily’s face falls Robbie looks at Cal who stands up causing the audience to all turn to him Jacob cocks his head then nods and Cal sighs heavily Cal makes his way down the seating structure squeezing past Bernie as Robbie's eyes start to find Kate leans into the principal and whispers something to which the principal nods Cal faces the audience and Kate puts her middle finger up at him Hannah and Cal wrap their arms around each other and Cal eyes Jacob as Hannah steps back Cal faces the audience and Kate puts her middle finger up at him Cal turns to glance at Robbie as Emily's eyes brim Tearfully Emily smiles as Claire and Bernie glance at each other and smile Emily's jaw slackens as Cal turns back to Robbie and Emily smiles and looks down Cal turns back to Robbie who beams Jessica hangs her head giggling as Emily laughs Claire glances at Jessica with a worried look and Emily wipes away a tear Cal puts his arm around Robbie and they leave the podium In the school grounds the kids and parents stand around chatting as Emily Molly Jacob and Hannah head over to Cal and Robbie Emily smiles and glances at Molly while Cal frowns and Emily’s face falls Cal turns and stares directly ahead as Jacob gets off his bar stool and soldiers out putting his hands in his pockets Emily smiles as Claire and Bernie glance at each other and smile Hannah and Cal wrap their arms around each other and Cal eyes Jacob as Hannah steps back Cal addresses Jacob who steps forward nervously and Cal holds out his hand They shake and Jacob smiles before Cal slaps Jacob Cal addresses Jacob who steps forward nervously and Cal holds out his hand They shake and Jacob smiles before Cal slaps Jacob"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Jacob cocks his head then nods and Cal sighs heavily. Cal turns to Jacob who shakes his head and shrugs his shoulders as Cal gazes at him penetratingly and raises his brows. Jacob looks at him directly and nods. then he nods again and turns away. Cal turns and stares directly ahead as Jacob gets off his bar stool and soldiers out putting his hands in his pockets. Cal downs his shot. At school all the kids have dressed smartly and lined up on a long row at the back of tiered seating constructed in the hall. Cal walks past the kids and over to the seating looking across the hall and spying Emily with Molly and Hannah. His eyes light up hopefully when he spots an empty seat next to Hannah but then he sees Jacob stamping over a chair to take the seat next to her. Cal looks away and heads upstairs making his way to a seat on the other side of the structure. Cal points to a seat between a man and woman who are chatting and the guy leans back so Cal can sit down. On the stage Robbie in a suit sits slumped at the end of a row. Cal eyes him and smiles softly. Robbie looks up and sees Jessica sitting with her parents and looks down miserably. The principal walks onto the stage and up to the podium and Emily's jaw tightens. Kate takes the podium and Cal beams and claps proudly as Emily Molly Hannah and Jacob clap and cheer. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. Robbie gets up and Jessica smiles as Robbie plods over to the podium. Emily smiles and glances at Molly while Cal frowns and Emily’s face falls. Robbie looks at Cal who stands up causing the audience to all turn to him. Cal makes his way down the seating structure squeezing past Bernie as Robbie's eyes start to find. Kate leans into the principal and whispers something to which the principal nods. Cal faces the audience and Kate puts her middle finger up at him. Cal turns to glance at Robbie as Emily's eyes brim Tearfully. Emily smiles as Claire and Bernie glance at each other and smile. Emily's jaw slackens as Cal turns back to Robbie and Emily smiles and looks down. Cal turns back to Robbie who beams. Jessica hangs her head giggling as Emily laughs. Claire glances at Jessica with a worried look and Emily wipes away a tear. Cal puts his arm around Robbie and they leave the podium. In the school grounds the kids and parents stand around chatting as Emily Molly Jacob and Hannah head over to Cal and Robbie. Hannah and Cal wrap their arms around each other and Cal eyes Jacob as Hannah steps back. Cal addresses Jacob who steps forward nervously and Cal holds out his hand. They shake and Jacob smiles before Cal slaps Jacob."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Jacob cocks his head then nods and Cal sighs heavily. Cal turns to Jacob who shakes his head and shrugs his shoulders as Cal gazes at him penetratingly and raises his brows. Jacob looks at him directly and nods. then he nods again and turns away. Cal turns and stares directly ahead as Jacob gets off his bar stool and soldiers out putting his hands in his pockets. Cal downs his shot. At school all the kids have dressed smartly and lined up on a long row at the back of tiered seating constructed in the hall. Cal walks past the kids and over to the seating looking across the hall and spying Emily with Molly and Hannah. His eyes light up hopefully when he spots an empty seat next to Hannah but then he sees Jacob stamping over a chair to take the seat next to her. Cal looks away and heads upstairs making his way to a seat on the other side of the structure. Cal points to a seat between a man and woman who are chatting and the guy leans back so Cal can sit down. On the stage Robbie in a suit sits slumped at the end of a row. Cal eyes him and smiles softly. Robbie looks up and sees Jessica sitting with her parents and looks down miserably. The principal walks onto the stage and up to the podium and Emily's jaw tightens. Kate takes the podium and Cal beams and claps proudly as Emily Molly Hannah and Jacob clap and cheer. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. Robbie gets up and Jessica smiles as Robbie plods over to the podium. Emily smiles and glances at Molly while Cal frowns and Emily’s face falls. Robbie looks at Cal who stands up causing the audience to all turn to him. Cal makes his way down the seating structure squeezing past Bernie as Robbie's eyes start to find. Kate leans into the principal and whispers something to which the principal nods. Cal faces the audience and Kate puts her middle finger up at him. Cal turns to glance at Robbie as Emily's eyes brim Tearfully. Emily smiles as Claire and Bernie glance at each other and smile. Emily's jaw slackens as Cal turns back to Robbie and Emily smiles and looks down. Cal turns back to Robbie who beams. Jessica hangs her head giggling as Emily laughs. Claire glances at Jessica with a worried look and Emily wipes away a tear. Cal puts his arm around Robbie and they leave the podium. In the school grounds the kids and parents stand around chatting as Emily Molly Jacob and Hannah head over to Cal and Robbie. Hannah and Cal wrap their arms around each other and Cal eyes Jacob as Hannah steps back. Cal addresses Jacob who steps forward nervously and Cal holds out his hand. They shake and Jacob smiles before Cal slaps Jacob."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Jacob cocks his head then nods and Cal sighs heavily. Cal turns to Jacob who shakes his head and shrugs his shoulders as Cal gazes at him penetratingly and raises his brows. Jacob looks at him directly and nods. then he nods again and turns away. Cal turns and stares directly ahead as Jacob gets off his bar stool and soldiers out putting his hands in his pockets. Cal downs his shot. At school all the kids have dressed smartly and lined up on a long row at the back of tiered seating constructed in the hall. Cal walks past the kids and over to the seating looking across the hall and spying Emily with Molly and Hannah. Emily's jaw slackens as Cal turns back to Robbie and Emily smiles and looks down. Cal turns back to Robbie who beams. Jessica hangs her head giggling as Emily laughs. Claire glances at Jessica with a worried look and Emily wipes away a tear. Cal puts his arm around Robbie and they leave the podium. In the school grounds the kids and parents stand around chatting as Emily Molly Jacob and Hannah head over to Cal and Robbie. Hannah and Cal wrap their arms around each other and Cal eyes Jacob as Hannah steps back. Cal addresses Jacob who steps forward nervously and Cal holds out his hand. They shake and Jacob smiles before Cal slaps Jacob."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Jacob cocks his head then nods and Cal sighs heavily. Cal turns to Jacob who shakes his head and shrugs his shoulders as Cal gazes at him penetratingly and raises his brows. Jacob looks at him directly and nods. In the school grounds the kids and parents stand around chatting as Emily Molly Jacob and Hannah head over to Cal and Robbie. Hannah and Cal wrap their arms around each other and Cal eyes Jacob as Hannah steps back. Cal addresses Jacob who steps forward nervously and Cal holds out his hand. They shake and Jacob smiles before Cal slaps Jacob."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Lucas cocks his head, then nods, and Sarah sighs heavily. Sarah turns to Lucas, who shakes his head and shrugs his shoulders, as Sarah gazes at him penetratingly and raises her brows. Lucas looks at her directly and nods, then he nods again and turns away. Sarah turns and stares directly ahead as Lucas gets off his bar stool and soldiers out, putting his hands in his pockets. Sarah downs her shot. At school, all the musicians have dressed smartly and lined up on a long row at the back of tiered seating constructed in the hall. Sarah walks past the musicians and over to the seating, looking across the hall and spying Zoe with Olivia and Mia. Her eyes light up hopefully when she spots an empty seat next to Mia, but then she sees Lucas stamping over a chair to take the seat next to her. Sarah looks away and heads upstairs, making her way to a seat on the other side of the structure. Sarah points to a seat between a dog and cat who are chatting, and the elephant leans back so Sarah can sit down. On the stage, Sam in a suit, sits slumped at the end of a row. Sarah eyes him and smiles softly. Sam looks up and sees Natalia sitting with her parents and looks down miserably. The janitor walks onto the stage and up to the podium, and Zoe's jaw tightens. Lily takes the podium, and Sarah beams and claps proudly as Zoe, Olivia, Mia, and Lucas clap and cheer. Sam gets up, and Natalia smiles as Sam plods over to the podium. Zoe smiles and glances at Olivia, while Sarah frowns and Zoe’s face falls. Sam looks at Sarah, who stands up, causing the audience to all turn to her. Sarah makes her way down the seating structure, squeezing past David as Sam's eyes start to find. Lily leans into the janitor and whispers something, to which the janitor nods. Sarah faces the audience, and Lily puts her middle finger up at her. Sarah turns to glance at Sam as Zoe's eyes brim. Tearfully, Zoe smiles as Rachel and David glance at each other and smile. Zoe's jaw slackens as Sarah turns back to Sam, and Zoe smiles and looks down. Sarah turns back to Sam, who beams. Natalia hangs her head, giggling, as Zoe laughs. Rachel glances at Natalia with a worried look, and Zoe wipes away a tear. Sarah puts her arm around Sam, and they leave the podium. In the school grounds, the musicians and parents stand around chatting as Zoe, Olivia, Lucas, and Mia head over to Sarah and Sam. Mia and Sarah wrap their arms around each other, and Sarah eyes Lucas as Mia steps back. Sarah addresses Lucas, who steps forward nervously, and Sarah holds out her hand. They shake, and Lucas smiles before Sarah slaps Lucas."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Jacob tilts his head, then nods, and Cal sighs heavily. Cal turns to Jacob, who shakes his head and shrugs his shoulders, as Cal gazes at him intensely and raises his eyebrows. Jacob looks at him directly and nods, then he nods again and turns away. Cal turns and stares directly ahead as Jacob gets off his rocking chair and soldiers out, putting his hands in his pockets. Cal downs his espresso. At the park, all the kids have dressed smartly and lined up on a long row at the back of tiered benches constructed in the field. Cal walks past the kids and over to the benches, looking across the park and spying Emily with Molly and Hannah. His eyes light up hopefully when he spots an empty spot next to Hannah, but then he sees Jacob stepping over a picnic table to take the spot next to her. Cal looks away and heads uphill, making his way to a spot on the other side of the hill. Cal points to a spot between a man and woman who are chatting, and the guy leans back so Cal can sit down. On the platform, Robbie in a tuxedo, sits slumped at the end of a row. Cal eyes him and smiles softly. Robbie looks up and sees Jessica sitting with her siblings and looks down miserably. The coach walks onto the platform and up to the microphone, and Emily's jaw tightens. Kate takes the microphone, and Cal beams and claps proudly as Emily, Molly, Hannah, and Jacob clap and cheer. Robbie gets up, and Jessica smiles as Robbie plods over to the microphone. Emily smiles and glances at Molly, while Cal frowns and Emily’s face falls. Robbie looks at Cal, who stands up, causing the audience to all turn to him. Cal makes his way down the hill, squeezing past Bernie as Robbie's eyes start to glisten. Kate leans into the coach and whispers something, to which the coach nods. Cal faces the audience, and Kate waves her hat at him. Cal turns to glance at Robbie as Emily's eyes brim. Tearfully, Emily smiles as Claire and Bernie glance at each other and smile. Emily's jaw slackens as Cal turns back to Robbie, and Emily smiles and looks down. Cal turns back to Robbie, who beams. Jessica hangs her head, giggling, as Emily laughs. Claire glances at Jessica with a worried look, and Emily wipes away a tear. Cal puts his arm around Robbie, and they leave the microphone. In the park grounds, the kids and parents stand around chatting as Emily, Molly, Jacob, and Hannah head over to Cal and Robbie. Hannah and Cal wrap their arms around each other, and Cal eyes Jacob as Hannah steps back. Cal addresses Jacob, who steps forward nervously, and Cal holds out his hand. They shake, and Jacob smiles before Cal taps Jacob."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Jacob tilts his head, then winks, and Cal laughs softly. Cal turns to Jacob, who raises his eyebrows and waves his hands, as Cal glares at him thoughtfully and squints his eyes. Jacob stares at him intently and winks, then he winks again and turns away. Cal turns and glares directly ahead as Jacob hops off his bar stool and skips out, crossing his arms. Cal sips his drink. At school, all the kids have jumped energetically and gathered in a long line at the front of tiered seating constructed in the hall. Cal skips past the kids and around the seating, scanning across the hall and noticing Emily with Molly and Hannah. His face brightens hopefully when he observes an empty seat next to Hannah, but then he sees Jacob leaping over a chair to take the seat next to her. Cal glances away and climbs upstairs, skipping his way to a seat on the other side of the structure. Cal signals to a seat between a man and woman who are whispering, and the guy tilts back so Cal can sit down. On the stage, Robbie in a suit, sits perched at the end of a row. Cal watches him and laughs softly. Robbie glances up and sees Jessica sitting with her parents and looks down thoughtfully. The principal dances onto the stage and around the podium, and Emily's nostrils flare. Kate approaches the podium, and Cal laughs and gestures proudly as Emily, Molly, Hannah, and Jacob sing and whistle. Robbie stands up, and Jessica smiles as Robbie dances over to the podium. Emily grins and nudges Molly, while Cal grimaces and Emily’s smile fades. Robbie glances at Cal, who rises up, causing the audience to all face him. Cal sneaks his way down the seating structure, sliding past Bernie as Robbie's eyes start to twinkle. Kate leans into the principal and murmurs something, to which the principal bows. Cal turns to the audience, and Kate blows a raspberry at him. Cal spins to glance at Robbie as Emily's eyes glimmer. Tearfully, Emily laughs as Claire and Bernie nudge each other and wave. Emily's jaw drops as Cal turns back to Robbie, and Emily laughs and looks down. Cal turns back to Robbie, who grins. Jessica covers her mouth, chuckling, as Emily giggles. Claire peeks at Jessica with a confused look, and Emily wipes her eyes. Cal throws his arm around Robbie, and they prance away from the podium. In the school grounds, the kids and parents huddle around whispering as Emily, Molly, Jacob, and Hannah glide over to Cal and Robbie. Hannah and Cal high-five each other, and Cal stares at Jacob as Hannah steps aside. Cal questions Jacob, who steps forward cautiously, and Cal holds out his hand. They high-five, and Jacob grins before Cal pats Jacob."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Stuart tilts his pencil, then waves, and Marcus groans loudly. Marcus turns to Stuart, who waves his broom and shrugs his shoelaces, as Marcus gazes at it intently and raises his scissors. Stuart looks at it directly and waves, then he waves again and turns away. Marcus turns and stares directly ahead as Stuart gets off his bookshelf and hops out, putting his elbows in his envelopes. Marcus downs his toothbrush. At the zoo, all the parrots have dressed brightly and lined up on a long row at the back of stacked shelves constructed in the cave. Marcus walks past the parrots and over to the shelves, looking across the cave and spying Natalie with Lucy and Sarah. His ears light up hopefully when he spots an empty box next to Sarah, but then he sees Stuart jumping over a box to take the spot next to it. Marcus looks away and heads upward, making his way to a box on the other side of the plank. Marcus points to a box between a table and chair who are chatting, and the lamp leans back so Marcus can sit down. On the stage, Ollie in a jacket, sits slumped at the end of a row. Marcus eyes him and smiles softly. Ollie looks up and sees Rachel sitting with her dogs and looks down miserably. The conductor walks onto the stage and up to the microphone, and Natalie's mouth tightens. Anna takes the microphone, and Marcus beams and claps proudly as Natalie, Lucy, Sarah, and Stuart clap and cheer. Ollie gets up, and Rachel smiles as Ollie waddles over to the microphone. Natalie smiles and glances at Lucy, while Marcus frowns and Natalie’s mouth falls. Ollie looks at Marcus, who stands up, causing the audience to all turn to him. Marcus makes his way down the plank structure, squeezing past Bella as Ollie's eyes start to locate. Anna leans into the conductor and whispers something, to which the conductor nods. Marcus faces the audience, and Anna puts her balloon finger up at it. Marcus turns to glance at Ollie as Natalie’s eyes brim. Tearfully, Natalie smiles as Patty and Bella glance at each other and smile. Natalie's mouth slackens as Marcus turns back to Ollie, and Natalie smiles and looks down. Marcus turns back to Ollie, who grins. Rachel hangs her book, giggling, as Natalie laughs. Patty glances at Rachel with a worried look, and Natalie wipes away a tear. Marcus puts his arm around Ollie, and they leave the microphone. In the zoo grounds, the parrots and dogs stand around chatting as Natalie, Lucy, Stuart, and Sarah head over to Marcus and Ollie. Sarah and Marcus wrap their elbows around each other, and Marcus eyes Stuart as Sarah steps back. Marcus addresses Stuart, who steps forward nervously, and Marcus holds out his hat. They shake, and Stuart smiles before Marcus slaps Stuart."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Sam tilts his hat, then chuckles, and Ben groans quietly. Ben glances at Sam, who tilts his head and taps his foot, as Ben examines him carefully and waves his finger. Sam surveys him directly and chuckles, then he chuckles again and pivots away. Ben pivots and glances directly ahead as Sam slips off his bicycle and saunters out, crossing his arms over his chest. Ben sips his espresso. At the museum, all the visitors have arrived energetically and clustered on a narrow path at the side of a steep staircase built in the lobby. Ben strolls past the visitors and over to the staircase, scanning the lobby and noticing Zoey with Ava and Lucy. His face brightens excitedly when he spots an available spot next to Lucy, but then he sees Sam skipping over a table to take the spot beside her. Ben averts his eyes and climbs upstairs, maneuvering to a spot on the opposite side of the structure. Ben gestures to a spot between a cat and a dog who are playing, and the cat hops aside so Ben can settle down. On the platform, Charlie in a tuxedo, sits leaned back at the edge of a line. Ben watches him and grins gently. Charlie glances up and notices Olivia sitting with her friends and gazes down sadly. The conductor strides onto the platform and up to the mic, and Zoey's lips purse. Lily takes the mic, and Ben grins broadly and cheers excitedly as Zoey, Ava, Lucy, and Sam cheer and holler. Charlie stands, and Olivia grins as Charlie trudges over to the mic. Zoey grins and peers at Ava, while Ben scowls and Zoey’s expression falters. Charlie gazes at Ben, who rises abruptly, prompting the audience to all swivel toward him. Ben threads his way down the staircase structure, weaving past Dylan as Charlie's gaze starts to wander. Lily leans toward the conductor and murmurs something, to which the conductor nods. Ben faces the audience, and Lily shoots a thumbs-up at him. Ben pivots to look at Charlie as Zoey's eyes water. Tearfully, Zoey grins as Lisa and Dylan exchange glances and grin. Zoey’s lips part as Ben turns back to Charlie, and Zoey grins and lowers her gaze. Ben turns back to Charlie, who radiates. Olivia lowers her chin, snickering, as Zoey chuckles. Lisa peers at Olivia with a concerned expression, and Zoey brushes away a tear. Ben drapes his scarf over Charlie, and they exit the mic area. In the museum courtyard, the visitors and friends mill about talking as Zoey, Ava, Sam, and Lucy approach Ben and Charlie. Lucy and Ben embrace each other warmly, and Ben observes Sam as Lucy steps away. Ben addresses Sam, who steps forward hesitantly, and Ben extends his fist. They bump fists, and Sam grins before Ben nudges Sam."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Jacob tilts his nose, then winks, and Cal breathes loudly. Cal swivels to Jacob, who wobbles his chin and twirls his fingers, as Cal peers at him intently and lowers his eyelids. Jacob peers back at him levelly and winks, then he winks again and spins away. Cal pivots and glares directly forward as Jacob slips off his rocking chair and marches out, jamming his fists into his backpack. Cal gulps his tea. At the library, all the teachers have dressed casually and gathered in a circle at the front of tiered desks arranged in the room. Cal strides past the teachers and over to the desks, scanning across the room and noticing Emily with Molly and Hannah. His face lights up eagerly when he detects an open seat next to Hannah, but then he sees Jacob leaping over a bench to occupy the seat next to her. Cal averts his gaze and moves uphill, navigating his way to a spot on the opposite side of the structure. Cal gestures to a spot between a boy and girl who are conversing, and the boy leans forward so Cal can settle down. On the platform, Robbie in a jumpsuit, sits hunched at the top of a stair. Cal observes him and grins gently. Robbie glances up and notices Jessica sitting with her friends and averts his gaze sullenly. The announcer strides onto the platform and onto the stage, and Emily's fingers twitch. Kate takes the stage, and Cal grins and stomps excitedly as Emily, Molly, Hannah, and Jacob stomp and chant. Robbie rises, and Jessica grins as Robbie trudges over to the stage. Emily grins and peeks at Molly, while Cal grumbles and Emily’s expression droops. Robbie glances at Cal, who rises up, prompting the audience to all swivel toward him. Cal navigates his way down the seating structure, sliding past Bernie as Robbie's eyes start to roam. Kate leans into the announcer and murmurs something, to which the announcer bobs. Cal faces the audience, and Kate waves her thumb up at him. Cal rotates to glimpse at Robbie as Emily's eyes water. Tearfully, Emily grins as Claire and Bernie peek at each other and grin. Emily's mouth opens as Cal rotates back to Robbie, and Emily grins and gazes down. Cal rotates back to Robbie, who smiles. Jessica lowers her gaze, chuckling, as Emily chuckles. Claire peeks at Jessica with a concerned look, and Emily brushes away a tear. Cal wraps his arm around Robbie, and they exit the stage. In the schoolyard, the teachers and guardians linger around talking as Emily, Molly, Jacob, and Hannah journey over to Cal and Robbie. Hannah and Cal entwine their arms around each other, and Cal observes Jacob as Hannah steps aside. Cal directs Jacob, who approaches cautiously, and Cal extends his foot. They bump, and Jacob grins before Cal pats Jacob."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Benny tilts his watch, then winks, and Max giggles loudly. Max glances at Benny, who turns his hat and jumps his knees, as Max stares at him thoughtfully and lowers his glasses. Benny frowns at him directly and winks, then he winks again and hops away. Max twists and gazes directly upwards as Benny slides off his skateboard and swims out, putting his feet in his gloves. Max sips his smoothie. At the zoo, all the penguins have painted colorfully and huddled on a short fence at the front of circular benches crafted in the garden. Max dances past the penguins and over to the benches, peering across the garden and spotting Lucy with Zoe and Ava. His cheeks sink loudly when he notices a busy tree next to Ava, but then he sees Benny leaping over a rock to hug the tree next to her. Max looks back and flies downstairs, hopping his way to a spot on the opposite side of the building. Max whispers to a fence between a cat and bird who are knitting, and the dog leans forward so Max can float up. On the floor, Jamie in a hat, stands perched at the start of a line. Max smells him and sings softly. Jamie looks down and notices Rachel juggling with her friends and looks up excitedly. The zookeeper strolls into the garden and down to the gate, and Lucy's wrist loosens. Tom takes the gate, and Max dances and spins excitedly as Lucy, Zoe, Ava, and Benny spin and swing. Jamie sits down, and Rachel frowns as Jamie hops over to the gate. Lucy spins and stares at Zoe, while Max applauds and Lucy’s hair rises. Jamie listens to Max, who rolls down, causing the animals to all sing to him. Max floats his way up the building, jumping past Oliver as Jamie's nose starts to twitch. Tom kneels into the zookeeper and shouts something, to which the zookeeper rolls. Max hides the animals, and Tom puts his elbow down at him. Max jumps to peek at Jamie as Lucy's elbows lift. Sleepily, Lucy frowns as Nancy and Oliver nod at each other and frown. Lucy's nose scrunches as Max jumps back to Jamie, and Lucy frowns and silences. Max jumps back to Jamie, who whispers. Rachel hangs her arms, spinning, as Lucy howls. Nancy nods at Rachel with a cheerful nod, and Lucy shakes away a nod. Max squeezes his foot around Jamie, and they enter the gate. In the zoo entrance, the penguins and friends stand around singing as Lucy, Zoe, Benny, and Ava run over to Max and Jamie. Ava and Max flap their ears at each other, and Max whispers Benny as Ava jumps forward. Max tickles Benny, who jumps forward excitedly, and Max waves out his foot. They race, and Benny whistles before Max taps Benny."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Jacob and Cal exchange a tense, silent conversation with nods and shrugs, before Jacob leaves. At school, Cal notices Emily, Molly, and Hannah seated, but Jacob takes the empty spot beside Hannah. Disappointed, Cal finds another seat. Robbie, in a suit on stage, looks miserable until he sees Jessica in the audience. As the principal begins the event, Cal proudly claps for Kate at the podium. Robbie approaches the podium, and Cal stands, causing a stir. Kate gestures provocatively at Cal, and Emily tears up but smiles. Cal and Robbie share a supportive moment, exit the podium together, and join the crowd outside. Cal and Hannah embrace, and then Cal offers a handshake to a nervous Jacob, which turns into a playful slap."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "They shake and Jacob smiles before Cal slaps Jacob Cal addresses Jacob who steps forward nervously and Cal holds out his hand Hannah and Cal wrap their arms around each other and Cal eyes Jacob as Hannah steps back In the school grounds the kids and parents stand around chatting as Emily Molly Jacob and Hannah head over to Cal and Robbie Cal puts his arm around Robbie and they leave the podium Claire glances at Jessica with a worried look and Emily wipes away a tear Jessica hangs her head giggling as Emily laughs Cal turns back to Robbie who beams Emily's jaw slackens as Cal turns back to Robbie and Emily smiles and looks down Emily smiles as Claire and Bernie glance at each other and smile Cal turns to glance at Robbie as Emily's eyes brim Tearfully Cal faces the audience and Kate puts her middle finger up at him Kate leans into the principal and whispers something to which the principal nods Cal makes his way down the seating structure squeezing past Bernie as Robbie's eyes start to find Robbie looks at Cal who stands up causing the audience to all turn to him Emily smiles and glances at Molly while Cal frowns and Emily’s face falls Robbie gets up and Jessica smiles as Robbie plods over to the podium Kate takes the podium and Cal beams and claps proudly as Emily Molly Hannah and Jacob clap and cheer The principal walks onto the stage and up to the podium and Emily's jaw tightens Robbie looks up and sees Jessica sitting with her parents and looks down miserably Cal eyes him and smiles softly On the stage Robbie in a suit sits slumped at the end of a row Cal points to a seat between a man and woman who are chatting and the guy leans back so Cal can sit down Cal looks away and heads upstairs making his way to a seat on the other side of the structure His eyes light up hopefully when he spots an empty seat next to Hannah but then he sees Jacob stamping over a chair to take the seat next to her Cal walks past the kids and over to the seating looking across the hall and spying Emily with Molly and Hannah At school all the kids have dressed smartly and lined up on a long row at the back of tiered seating constructed in the hall Cal downs his shot Cal turns and stares directly ahead as Jacob gets off his bar stool and soldiers out putting his hands in his pockets then he nods again and turns away Jacob looks at him directly and nods Cal turns to Jacob who shakes his head and shrugs his shoulders as Cal gazes at him penetratingly and raises his brows Jacob cocks his head then nods and Cal sighs heavily"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Claire glances at Jessica with a worried look and Emily wipes away a tear Cal downs his shot On the stage Robbie in a suit sits slumped at the end of a row Robbie gets up and Jessica smiles as Robbie plods over to the podium Jessica hangs her head giggling as Emily laughs Cal eyes him and smiles softly Kate leans into the principal and whispers something to which the principal nods Kate takes the podium and Cal beams and claps proudly as Emily Molly Hannah and Jacob clap and cheer Cal points to a seat between a man and woman who are chatting and the guy leans back so Cal can sit down The principal walks onto the stage and up to the podium and Emily's jaw tightens Cal makes his way down the seating structure squeezing past Bernie as Robbie's eyes start to find Cal turns to glance at Robbie as Emily's eyes brim Tearfully Cal looks away and heads upstairs making his way to a seat on the other side of the structure In the school grounds the kids and parents stand around chatting as Emily Molly Jacob and Hannah head over to Cal and Robbie Emily's jaw slackens as Cal turns back to Robbie and Emily smiles and looks down At school all the kids have dressed smartly and lined up on a long row at the back of tiered seating constructed in the hall Cal turns back to Robbie who beams Jacob cocks his head then nods and Cal sighs heavily Cal addresses Jacob who steps forward nervously and Cal holds out his hand Robbie looks up and sees Jessica sitting with her parents and looks down miserably Robbie looks at Cal who stands up causing the audience to all turn to him Jacob looks at him directly and nods Emily smiles and glances at Molly while Cal frowns and Emily’s face falls Cal faces the audience and Kate puts her middle finger up at him then he nods again and turns away Hannah and Cal wrap their arms around each other and Cal eyes Jacob as Hannah steps back Cal turns and stares directly ahead as Jacob gets off his bar stool and soldiers out putting his hands in his pockets Cal puts his arm around Robbie and they leave the podium They shake and Jacob smiles before Cal slaps Jacob His eyes light up hopefully when he spots an empty seat next to Hannah but then he sees Jacob stamping over a chair to take the seat next to her Emily smiles as Claire and Bernie glance at each other and smile Cal turns to Jacob who shakes his head and shrugs his shoulders as Cal gazes at him penetratingly and raises his brows Cal walks past the kids and over to the seating looking across the hall and spying Emily with Molly and Hannah"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Emily smiles and glances at Molly while Cal frowns and Emily’s face falls Robbie looks at Cal who stands up causing the audience to all turn to him Cal makes his way down the seating structure squeezing past Bernie as Robbie's eyes start to find Kate leans into the principal and whispers something to which the principal nods Cal faces the audience and Kate puts her middle finger up at him Cal turns to glance at Robbie as Emily's eyes brim Tearfully Emily smiles as Claire and Bernie glance at each other and smile Emily's jaw slackens as Cal turns back to Robbie and Emily smiles and looks down Cal turns back to Robbie who beams Jessica hangs her head giggling as Emily laughs Claire glances at Jessica with a worried look and Emily wipes away a tear Cal puts his arm around Robbie and they leave the podium In the school grounds the kids and parents stand around chatting as Emily Molly Jacob and Hannah head over to Cal and Robbie Hannah and Cal wrap their arms around each other and Cal eyes Jacob as Hannah steps back Cal addresses Jacob who steps forward nervously and Cal holds out his hand They shake and Jacob smiles before Cal slaps Jacob Jacob cocks his head then nods and Cal sighs heavily Cal turns to Jacob who shakes his head and shrugs his shoulders as Cal gazes at him penetratingly and raises his brows Jacob looks at him directly and nods then he nods again and turns away Cal turns and stares directly ahead as Jacob gets off his bar stool and soldiers out putting his hands in his pockets Cal downs his shot At school all the kids have dressed smartly and lined up on a long row at the back of tiered seating constructed in the hall Cal walks past the kids and over to the seating looking across the hall and spying Emily with Molly and Hannah His eyes light up hopefully when he spots an empty seat next to Hannah but then he sees Jacob stamping over a chair to take the seat next to her Cal looks away and heads upstairs making his way to a seat on the other side of the structure Cal points to a seat between a man and woman who are chatting and the guy leans back so Cal can sit down On the stage Robbie in a suit sits slumped at the end of a row Cal eyes him and smiles softly Robbie looks up and sees Jessica sitting with her parents and looks down miserably The principal walks onto the stage and up to the podium and Emily's jaw tightens Kate takes the podium and Cal beams and claps proudly as Emily Molly Hannah and Jacob clap and cheer Robbie gets up and Jessica smiles as Robbie plods over to the podium"
        }
      ]
    }
  ]
}