{
  "ground_truth": "The detective leaves, while the boss lingers with his arms folded. Sandy gazes at the floor, then rises and watches the men leave. Holding his cell phone, he looks at the salon number displayed in red. He glances up, then down to the number's origin. The detective glances at Daniel, who rubs his face with one hand. Sandy runs off. Sandy's wife helps him pack. Sandy shrugs at his wife. He sets her on the bed. He takes the folded mug shot from his back pocket. She gives him a little nudge. Sandy heads out. He kisses Trish. She hands him his suitcase. Now, a plane sails across the sky. Our view moves over a sunny beach toward a city skyline. Outside Ladies Choice salon, Sandy rolls up his window in a gold Sedan. The plump thief strolls into view in a loud pink print shirt and poofy hair. She walks in slow motion. Sandy observes her go to a tiny blue Fiat with a red stripe on its side. She bounces to the driver's door and gets in. The garishly made-up woman takes a handicapped parking tag off the rear view mirror and tosses it in back. Sandy puts his seat belt on as the woman zips out of her parking space. Now, on a freeway, Sandy tails the thief while she plays with her smartphone. She looks in her rear view and catches sight of him. Setting her phone down, the redhead takes her sunglasses off, looks into the driver's side mirror, and gives her car some gas. The odometer needle rises. Sandy presses his accelerator. The speedometer ticks up to 50. The woman tightens her mouth and slams on the brakes with both feet. The sedan bangs the Fiat's rear bumper. In her rear view, she sees Sandy white-knuckling his wheel. She puts her sunglasses on and primps her hair, then gets out. The short woman looks up at Sandy, then punches his throat. She pushes him and goes for her car. He pulls her hair. She delivers a swift kick to his crotch. Sandy sags as she runs to his car. She gets into his sedan. Sandy limps toward her. She reverses while flipping him off. He shambles back to her Fiat and gets in. He discovers the key missing. In the rear view, he sees an empty road. She comes in from the sides. The sedan T-bones the compact. She pins it to the guardrail. Sandy tries in vain to open the crushed door as she speeds down the highway. He reaches through the sunroof. He finds a pink registration form in the glove box. He takes it out. He reads the address. Now, in a tiny pink house with a jet ski on the lawn, a variety of small expensive products in sets of three or more clutters the kitchen.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "The investigator departs, while the supervisor stays with his arms crossed. Sandy looks at the ground, then stands and observes the men exit. Holding his mobile phone, he gazes at the salon numeral shown in crimson. He glances upward, then downward to the numeral's source. The investigator glances at Daniel, who rubs his visage with one hand. Sandy dashes off. Sandy's spouse assists him pack. Sandy shrugs at his wife. He places her on the mattress. He extracts the folded booking photo from his rear pocket. She gives him a small push. Sandy proceeds out. He kisses Trish. She hands him his suitcase. Now, an aircraft glides across the heavens. Our perspective shifts over a bright shore toward a metropolis horizon. Outside Ladies Choice salon, Sandy rolls up his pane in a gold Sedan. The rotund robber saunters into view in a boisterous pink pattern shirt and voluminous hair. She strides in slow motion. Sandy watches her proceed to a diminutive blue Fiat with a crimson stripe on its side. She skips to the driver's portal and gets in. The garishly adorned woman removes a handicapped parking placard off the rear view mirror and tosses it in back. Sandy fastens his safety belt as the woman zooms out of her parking spot. Now, on a freeway, Sandy follows the robber while she fiddles with her smartphone. She glances in her rear view and spots him. Placing her phone down, the redhead removes her sunglasses, looks into the driver's side mirror, and gives her vehicle some acceleration. The odometer needle ascends. Sandy presses his gas pedal. The speedometer ascends to 50. The woman narrows her mouth and slams on the brakes with both feet. The sedan collides with the Fiat's rear fender. In her rear view, she sees Sandy gripping his wheel tightly. She dons her sunglasses and preens her hair, then exits. The petite woman gazes up at Sandy, then punches his throat. She shoves him and moves toward her vehicle. He tugs her hair. She delivers a rapid kick to his groin. Sandy droops as she dashes to his vehicle. She enters his sedan. Sandy hobbles toward her. She reverses while gesturing at him. He totters back to her Fiat and enters. He discovers the key absent. In the rear view, he sees a vacant road. She arrives from the sides. The sedan T-bones the compact. She pins it to the barrier. Sandy attempts unsuccessfully to open the damaged door as she races down the highway. He reaches through the sunroof. He finds a pink registration document in the glove compartment. He extracts it. He reads the location. Now, in a diminutive pink abode with a jet ski on the yard, a variety of small costly items in sets of three or more clutters the cooking area."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The detective is left by his departure, while his arms are folded by the boss as he lingers. The floor is gazed at by Sandy, who then rises and watches the men leave. His cell phone is held by him, and the salon number displayed in red is looked at. The number's origin is glanced at by him, then glanced up. Daniel is glanced at by the detective, and his face is rubbed by Daniel with one hand. Sandy runs off. Sandy is helped by his wife to pack. His wife is shrugged at by Sandy. She is set on the bed by him. The folded mug shot is taken from his back pocket by him. A little nudge is given to him by her. Out heads Sandy. Trish is kissed by him. His suitcase is handed to him by her. Now, the sky is sailed across by a plane. Over a sunny beach toward a city skyline, our view moves. Outside Ladies Choice salon, his window in a gold Sedan is rolled up by Sandy. Into view strolls the plump thief in a loud pink print shirt and poofy hair. In slow motion, she walks. She is observed by Sandy going to a tiny blue Fiat with a red stripe on its side. To the driver's door, she bounces and gets in. A handicapped parking tag is taken off the rear view mirror by the garishly made-up woman and tossed in back. His seat belt is put on by Sandy as the parking space is zipped out of by the woman. Now, the freeway is tailed on by Sandy while the thief plays with her smartphone. The rear view is looked in by her, and sight of him is caught. Her phone is set down by her, the sunglasses of the redhead are taken off, she looks into the driver's side mirror, and her car is given some gas by her. The odometer needle is risen. His accelerator is pressed by Sandy. The speedometer is ticked up to 50. Her mouth is tightened by the woman, and the brakes are slammed on with both feet by her. The Fiat's rear bumper is banged by the sedan. In her rear view, Sandy is seen white-knuckling his wheel by her. Her sunglasses are put on by her, and her hair is primped, then she gets out. Sandy is looked up at by the short woman, then his throat is punched by her. He is pushed by her, and she goes for her car. Her hair is pulled by him. A swift kick to his crotch is delivered by her. As Sandy sags, his car is run toward by her. His sedan is gotten into by her. Toward her, Sandy limps. While flipping him off, she reverses. Her Fiat is shambled back to by him, and he gets in. The key is discovered missing by him. An empty road is seen in the rear view by him. From the sides, she comes in. The compact is T-boned by the sedan. It is pinned to the guardrail by her. The crushed door is tried in vain to be opened by Sandy as the highway is sped down by her. Through the sunroof, he reaches. A pink registration form is found in the glove box by him. It is taken out by him. The address is read by him. Now, in a tiny pink house with a jet ski on the lawn, the kitchen is cluttered by a variety of small expensive products in sets of three or more."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "The detective departs as the boss lingers with folded arms. Sandy stares at the floor, then rises to watch them leave. Holding his phone, he views the salon number in red. He glances at Daniel, who rubs his face. Sandy runs off. His wife helps him pack. He shrugs, places her on the bed, and takes a folded mug shot from his pocket. She nudges him, and he heads out, kissing Trish, who hands him his suitcase. A plane crosses the sky. Our view shifts from a sunny beach to a city skyline. Outside Ladies Choice salon, Sandy rolls up his window in a gold Sedan. A plump thief wearing a loud pink shirt with poofy hair strolls in slow motion to a tiny blue Fiat with a red stripe. She removes a handicapped parking tag and tosses it in back. Sandy fastens his seat belt as she drives off. On a freeway, Sandy tails her as she fiddles with her smartphone. She spots him in her rear view, and after removing her sunglasses, she accelerates. The odometer needle rises as Sandy follows, reaching 50. She slams on her brakes, causing a collision. In her rear view, she sees Sandy gripping the wheel. She exits, punches his throat, and moves to his car. He pulls her hair, she kicks his crotch, and he collapses as she enters his sedan. She reverses, flipping him off. He reaches her Fiat but finds the key missing. She appears from the side, T-boning his car into the guardrail. He tries to open the door as she speeds away. Through the sunroof, he finds a pink registration in the glove box and reads the address. In a tiny pink house with a jet ski on the lawn, the kitchen is cluttered with small expensive products in sets."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "The detective departs as the boss remains with folded arms. Sandy, after glancing at the floor, watches them leave. Holding his cell, he sees the salon's number in red, then its origin. The detective eyes Daniel, who rubs his face. Sandy runs off, helped by his wife. He shrugs at her, places her on the bed, and takes a mugshot from his pocket. After a nudge, he kisses Trish, who hands him a suitcase. A plane flies over a sunny beach toward the city skyline. Outside Ladies Choice salon, Sandy, in a gold Sedan, observes a plump thief in a loud pink shirt. She moves slowly to a blue Fiat with a red stripe, tosses a handicapped tag, and drives off. Sandy follows while she plays with her smartphone, noticing him in her rear view. She speeds up, Sandy accelerates to 50. She then brakes hard, and the sedan hits her. In her mirror, she sees Sandy gripping his wheel. She exits, punches his throat, and kicks his crotch. Sandy collapses as she drives off in his sedan. He limps to her Fiat, finds the key missing, and sees an empty road. She T-bones the Fiat into a guardrail. As she speeds away, he reaches through the sunroof and finds a pink registration form with an address. In a pink house with a jet ski on the lawn, small expensive sets clutter the kitchen."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "The detective makes his exit, leaving the scene, while the boss remains behind, lingering with a stern posture, his arms defiantly folded across his chest. Sandy, feeling a mix of emotions, casts his eyes toward the floor, then gets up, and watches intently as the men depart. Grasping his cell phone tightly, he observes the salon number prominently displayed in bold red on the screen. He shifts his gaze upward momentarily before returning his attention to the phone, tracing the origin of the number. Meanwhile, the detective steals a glance at Daniel, who is anxiously rubbing his face with one hand. Sandy, filled with urgency, makes a swift departure. His wife steps in to assist him with the packing process. With a nonchalant shrug in response to his wife’s unspoken question, he gently sets her down on the bed. He retrieves a folded mug shot from his back pocket, glancing at it before tucking it away again. She gives him an encouraging little nudge. Sandy, now more determined, heads out. He places a quick, affectionate kiss on Trish’s cheek. She dutifully hands him his packed suitcase. \n\nIn the next moment, a plane majestically soars across the clear blue sky. Our view gracefully transitions over a sun-drenched beach, moving toward a distant city skyline shimmering in the sunlight. Outside the Ladies Choice salon, Sandy is sitting in his gold Sedan, rolling up the window with a sense of purpose. The plump thief leisurely strolls into view, sporting an outrageously loud pink print shirt and uniquely styled poofy hair. Her movements are captured in slow motion. Sandy attentively watches her approach a tiny blue Fiat, which is accented with a bold red stripe along its side. She bounces energetically to the driver’s door and climbs in. The woman, elaborately made-up, removes a handicapped parking tag from the rearview mirror and casually tosses it to the back seat. Sandy, preparing for action, fastens his seat belt as the woman rapidly reverses her car out of the parking space. Now on a bustling freeway, Sandy carefully follows the thief while she nonchalantly plays with her smartphone. As she glances into her rearview mirror, she catches sight of Sandy tailing her. Setting her phone down, the redhead strategically removes her sunglasses, glances into the driver’s side mirror for a quick assessment, and promptly accelerates, giving her car some extra gas. The odometer needle steadily climbs. Responding in kind, Sandy presses down harder on his accelerator. The speedometer gradually ticks up to 50. The woman clenches her mouth in concentration and suddenly slams on the brakes with forceful intensity using both feet. The sedan crashes into the Fiat's rear bumper with a loud bang. Observing through her rearview mirror, she notices Sandy gripping his steering wheel with white-knuckled determination. With a composed air, she places her sunglasses back on and tidies her hair, then steps out of her car. The short woman looks up at Sandy with a defiant expression and swiftly punches his throat. She shoves him aside and makes a dash for her car. Grabbing her hair firmly, he attempts to stop her. In response, she delivers a swift, painful kick to his crotch. Sandy collapses as the woman runs back to his car, quickly getting into his sedan. Sandy limps toward her, but she reverses the vehicle defiantly, flipping him off as she does so. He awkwardly shambles back to her Fiat, getting in but finds, to his dismay, that the key is missing. Looking into the rearview mirror, he sees an empty road stretched out behind him. However, she swiftly comes in from the sides, and the Sedan forcefully T-bones the compact vehicle, pinning it to the guardrail. Desperately, Sandy tries in vain to open the crushed door as she speeds away down the highway. Reaching through the sunroof, he finds a pink registration form hidden in the glove box. Carefully pulling it out, he reads the address written on it. Later, in a tiny pink house with a jet ski quaintly perched on the lawn, a dizzying array of small, expensive products, neatly arranged in sets of three or more, clutter the kitchen space."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "The detective, with a sense of finality, makes his exit from the bustling scene, leaving the area behind, while the boss stays put, lingering with a stern demeanor and a posture that conveys authority, his arms defiantly folded across his chest. Sandy, feeling a mix of complex emotions, lowers his gaze to the floor before eventually standing up. He watches with keen interest as the men make their departure. Grasping his cell phone firmly, he notices the salon number prominently displayed in bold red on the screen. Briefly, he shifts his gaze upward in thought, then returns his attention to the phone, tracing the origin of the number with intense focus. Meanwhile, the detective steals a quick glance at Daniel, who is nervously rubbing his face with one hand, clearly anxious. Filled with urgency, Sandy makes a quick and determined exit. His wife then steps in to assist him with the packing process. With a nonchalant shrug in response to his wife’s unspoken question, he gently sets her down on the bed. From his back pocket, he retrieves a folded mug shot, glancing at it momentarily before tucking it away again. She gives him an encouraging little nudge, prompting Sandy, now more resolved, to head out with determination. He places a quick, affectionate kiss on Trish’s cheek, a simple gesture of love. She dutifully hands him his packed suitcase, aiding his departure. \n\nIn the very next moment, a plane majestically soars across the clear, expansive blue sky. Our view seamlessly transitions over a sun-drenched beach, gracefully moving toward a distant city skyline shimmering under the warm sunlight. Outside the Ladies Choice salon, Sandy is sitting in his gold Sedan, rolling up the window with a clear sense of purpose. The plump thief leisurely strolls into view, wearing an outrageously loud pink print shirt and uniquely styled poofy hair, her movements captured in slow motion for dramatic effect. Sandy intently watches as she approaches a tiny blue Fiat, which is accented with a bold red stripe elegantly running along its side. She bounces energetically to the driver’s door and climbs in with enthusiasm. The woman, elaborately made-up, removes a handicapped parking tag from the rearview mirror and casually tosses it into the back seat without a care. Preparing for action, Sandy fastens his seat belt, ready for what comes next, as the woman rapidly reverses her car out of the parking space with a flourish. Now on a bustling freeway, Sandy carefully follows the thief, keeping a close eye on her movements while she nonchalantly plays with her smartphone. As she glances into her rearview mirror, she catches sight of Sandy tailing her closely. Setting her phone down, the redhead strategically removes her sunglasses, glancing into the driver’s side mirror for a quick assessment of the situation, and promptly accelerates, giving her car some extra gas. The odometer needle begins to steadily climb. Responding in kind, Sandy presses down harder on his accelerator, determined to keep up. The speedometer gradually ticks up to 50, matching her pace. The woman clenches her mouth in concentration, suddenly slamming on the brakes with forceful intensity, using both feet. The Sedan crashes into the Fiat’s rear bumper with a loud bang, the impact echoing in the air. Observing through her rearview mirror, she notices Sandy gripping his steering wheel with white-knuckled determination, clearly unfazed by the collision. With a composed air, she places her sunglasses back on her face and tidies her hair, then confidently steps out of her car. The short woman looks up at Sandy with a defiant expression and swiftly delivers a punch to his throat, catching him off guard. She shoves him aside and makes a quick dash back to her car. Grabbing her hair firmly, Sandy attempts to stop her, his grip tight. In response, she delivers a swift, painful kick to his crotch, causing Sandy to collapse in pain. The woman runs back to his car with agility, quickly getting into his Sedan. Sandy, although in pain, limps toward her in a determined effort to catch up, but she defiantly reverses the vehicle, flipping him off as she does so. He awkwardly shambles back to her Fiat, getting in, only to find, to his dismay, that the key is missing, leaving him stranded. Looking into the rearview mirror, he sees an empty road stretched out behind him. However, she swiftly comes in from the sides, and the Sedan forcefully T-bones the compact vehicle, pinning it to the guardrail with precision. Desperately, Sandy tries in vain to open the crushed door as the woman speeds away down the highway, leaving him behind. Reaching through the sunroof, he finds a pink registration form hidden in the glove box. Carefully pulling it out, he reads the address written on it, committing it to memory. Later, in a tiny pink house with a jet ski quaintly perched on the lawn, a dizzying array of small, expensive products, neatly arranged in sets of three or more, clutters the kitchen space, creating a scene of organized chaos."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "As the moment arrives for the detective to make his exit, he moves away, leaving behind the boss who stays put, arms folded in a posture of contemplation. Sandy, caught in a moment of introspection, casts his eyes to the floor, eventually deciding to rise. He watches the departing men with a contemplative gaze. In his hand, his cell phone reflects the intense glow of the salon number displayed prominently in red. With a thoughtful expression, he shifts his gaze from the illuminated digits upward, then back down, tracing the number's origin with his eyes. Meanwhile, the detective's glance meets Daniel, who responds to the weight of the moment by rubbing his face with one weary hand. At this juncture, Sandy propels himself into action, breaking into a run. With urgency, his wife becomes an ally, assisting him in the rapid task of packing. Sandy, in a moment of silent communication, offers a nonchalant shrug in response to his wife's unspoken queries. He tenderly guides her to sit on the bed, an act punctuated by his retrieval of a folded mug shot from his back pocket, a piece of evidence he holds onto with care. His wife, supportive and understanding, offers him a gentle nudge, a physical encouragement that propels him forward. Sandy then proceeds to step out, but not before sharing an intimate moment—a tender kiss—with Trish, who hands him his suitcase, a symbol of his impending journey. The narrative shifts its focus to the sky, where a plane sails gracefully, its trajectory leading our view over a sun-kissed beach, ultimately merging with the silhouette of a vibrant city skyline. Outside the Ladies Choice salon, Sandy, situated in a gold Sedan, methodically rolls up his window, his actions deliberate and purposeful. Enter the plump thief, her presence announced by a loud pink print shirt and a distinctive poofy hairstyle. Her movements, playing out in slow motion, capture Sandy's attention as he observes her approach a tiny blue Fiat marked by a red stripe on its side. With a playful bounce, she advances to the driver's door and slips inside. In a display of nonchalance, she removes a handicapped parking tag from the rear-view mirror, carelessly tossing it into the back. Sandy secures his own seat belt, a prelude to the woman swiftly exiting her parking space. Now on the freeway, Sandy doggedly follows the thief, who remains seemingly engrossed with her smartphone. The moment arrives when she spots Sandy in her rear view, prompting her to strategically set down her phone. With calculated movements, she removes her sunglasses, redirects her gaze to the driver's side mirror, and infuses her vehicle with increased speed as the odometer needle ascends. Sandy responds by pressing his accelerator, watching his speedometer tick upward to the 50 mark. The woman, in a decisive maneuver, tenses her mouth and forcefully applies both feet to the brakes. The ensuing collision is marked by the sedan impacting the Fiat's rear bumper. Through her rear view, she observes Sandy tightly gripping his steering wheel, his hands white-knuckled with tension. With a flourish, she dons her sunglasses once more, takes a moment to adjust her hair, and then steps out of her vehicle. The short woman sizes up Sandy, follows through with a punch to his throat, and with a forceful shove, makes a beeline for her car. Sandy, responding instinctively, reaches for her hair, but she counters with a swift, debilitating kick to his crotch. Overcome with pain, Sandy sags, while she makes her way to his sedan and quickly enters. Despite Sandy's attempt to pursue her, albeit limping, she reverses the vehicle, all the while flipping him off in a final gesture of defiance. He manages to make his way back to her Fiat, only to discover the key missing, a realization that dawns as he peers into the rear view, finding nothing but an empty road behind him. In a dramatic twist, she emerges from the sides, her sedan executing a T-bone maneuver that pins the compact to the guardrail. In a futile attempt to escape, Sandy struggles to open the now-crushed door, his efforts met with the unforgiving reality of the pinned vehicle. As she accelerates down the highway, he improvises by reaching through the sunroof, searching and eventually extracting a pink registration form from the glove box. He examines the address contained within, a critical clue leading to the next chapter of his journey. The scene transitions to a quaint and quirky setting—a tiny pink house adorned with a jet ski on the lawn. Inside, the cluttered kitchen is a testament to excess, filled with a variety of small, expensive products meticulously arranged in sets of three or more, crafting a portrait of the mysterious woman’s opulent yet chaotic world."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "The detective departs while the boss remains with folded arms. Sandy initially gazes at the floor, then rises, observing them leave. He notes the salon number on his cell phone screen but looks up to its source. The detective and Daniel exchange glances; Daniel rubs his face. Sandy rushes off, assisted by his wife in packing. After a brief, wordless exchange, he places her on the bed and retrieves a folded mug shot from his pocket. She nudges him gently, and after receiving his suitcase, he kisses Trish and heads out.\n\nA plane crosses a sunny beach toward a city skyline. Outside the Ladies Choice salon, Sandy, in a gold sedan, witnesses a plump thief in a loud pink shirt and poofy hair entering view in slow motion. She approaches a tiny blue Fiat with a red stripe, removes a handicapped parking tag, and drives away. Sandy buckles up and follows her onto the freeway as she toys with her smartphone. Noticing him in the rearview mirror, she accelerates, prompting Sandy to match her speed. She abruptly brakes, causing the sedan to hit the Fiat's bumper. Upon exiting, she attacks Sandy, who retaliates by pulling her hair. She delivers a kick and seizes his sedan, reversing and flipping him off as she drives away. Sandy limps to the Fiat, finding it without a key but watches her sedan T-bone the compact car. Trapped, Sandy reaches through the sunroof for a pink registration form in the glove box and reads the address.\n\nNow, at a tiny pink house with a jet ski on the lawn, a collection of small, expensive products clutters the kitchen in sets of three or more."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "The detective leaves, his coat barely brushing the floor of the dimly lit office, while the boss, known for his intimidating presence in the local business community, lingers with his arms folded. Sandy, feeling the weight of the situation, gazes at the floor, then rises and watches the men leave, their footsteps echoing down the hallway. Holding his cell phone, a model often used by those wanting to securely communicate, he looks at the salon number displayed in red, a contact for Ladies Choice, a salon famous for its high-profile clientele. He glances up, contemplating the risks, then down to the number's origin in the call log. The detective, a veteran with years of experience solving complex cases, glances at Daniel, who nervously rubs his face with one hand. Sandy, driven by urgency, runs off. Sandy's wife, known for her unwavering support, helps him pack. Sandy shrugs at his wife, as if to say this is just another day in their unpredictable lives. He sets her on the bed gently, knowing she is his anchor. He takes the folded mug shot, evidence from a past case, from his back pocket. She gives him a little nudge to reassure him. Sandy heads out, determined. He kisses Trish, his childhood sweetheart. She hands him his suitcase, packed with meticulous care. Now, a plane, a commercial flight soaring toward new destinations, sails across the sky. Our view moves over a sunny beach, renowned for its clear waters and popular with tourists, toward a city skyline bustling with life. Outside Ladies Choice salon, Sandy rolls up his window in a gold Sedan, a car model often chosen for its reliability. The plump thief strolls into view in a loud pink print shirt and poofy hair, her distinctive look drawing attention. She walks in slow motion, dramatizing her entrance. Sandy observes her go to a tiny blue Fiat with a red stripe on its side, known locally for its unique style. She bounces to the driver's door and gets in with an air of nonchalance. The garishly made-up woman takes a handicapped parking tag off the rearview mirror, a clear sign of her disregard for rules, and tosses it in back. Sandy puts his seat belt on as the woman zips out of her parking space, her car known for its zippy acceleration. Now, on a freeway, Sandy tails the thief while she plays with her smartphone, a recent model that captures her every move. She looks in her rearview and catches sight of him following. Setting her phone down, the redhead takes her sunglasses off, looks into the driver's side mirror with confidence, and gives her car some gas, ready for a chase. The odometer needle rises as she speeds up. Sandy presses his accelerator, his determination unyielding. The speedometer ticks up to 50, the car humming under his steady hand. The woman tightens her mouth and slams on the brakes with both feet, a maneuver she has perfected in past escapes. The sedan bangs the Fiat's rear bumper, the impact echoing in the air. In her rearview, she sees Sandy white-knuckling his wheel, his focus unbroken. She puts her sunglasses on and primps her hair, then gets out, her confidence unwavering. The short woman looks up at Sandy, then punches his throat with surprising strength. She pushes him and goes for her car, every move calculated. He pulls her hair, desperation in his grip. She delivers a swift kick to his crotch, a move that leaves Sandy sagging as she runs to his car. She gets into his sedan, her victory almost complete. Sandy limps toward her, fueled by adrenaline. She reverses while flipping him off, a crude farewell. He shambles back to her Fiat and gets in, only to discover the key missing, a setback he didn't expect. In the rearview, he sees an empty road, a symbol of his fading chances. She comes in from the sides, her determination ferocious. The sedan T-bones the compact, demonstrating her ruthlessness. She pins it to the guardrail, securing her advantage. Sandy tries in vain to open the crushed door, feeling the weight of defeat as she speeds down the highway. He reaches through the sunroof, a last-ditch effort. He finds a pink registration form in the glove box, a potential clue. He takes it out, hope flickering. He reads the address, memorizing it. Now, in a tiny pink house with a jet ski on the lawn, a telltale sign of her lifestyle, a variety of small expensive products in sets of three or more clutters the kitchen, remnants of her many exploits."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Sandy shrugs at his wife The detective leaves while the boss lingers with his arms folded Sandy gazes at the floor then rises and watches the men leave Holding his cell phone he looks at the salon number displayed in red He glances up then down to the number's origin He reaches through the sunroof The detective glances at Daniel who rubs his face with one hand Sandy runs off Sandy's wife helps him pack Sandy shrugs at his wife She comes in from the sides He sets her on the bed Sandy rolls up his window in a gold Sedan He pulls her hair Holding his cell phone he looks at the salon number displayed in red He takes the folded mug shot from his back pocket He kisses Trish She gives him a little nudge Sandy runs off Sandy heads out He kisses Trish She hands him his suitcase Now a plane sails across the sky Our view moves over a sunny beach toward a city skyline Outside Ladies Choice salon Sandy's wife helps him pack Sandy rolls up his window in a gold Sedan The plump thief strolls into view in a loud pink print shirt and poofy hair She walks in slow motion Sandy observes her go to a tiny blue Fiat with a red stripe on its side She bounces to the driver's door and gets in The garishly madeup woman takes a handicapped parking tag off the rear view mirror and tosses it in back Sandy puts his seat belt on as the woman zips out of her parking space He shambles back to her Fiat and gets in Now on a freeway Sandy tails the thief while she plays with her smartphone She hands him his suitcase The plump thief strolls into view in a loud pink print shirt and poofy hair She looks in her rear view and catches sight of him Setting her phone down the redhead takes her sunglasses off looks into the driver's side mirror and gives her car some gas The odometer needle rises Sandy presses his accelerator The speedometer ticks up to 50 The woman tightens her mouth and slams on the brakes with both feet The sedan bangs the Fiat's rear bumper He reads the address In her rear view she sees Sandy whiteknuckling his wheel She puts her sunglasses on and primps her hair then gets out The short woman looks up at Sandy then punches his throat He discovers the key missing She looks in her rear view and catches sight of him She pushes him and goes for her car Now in a tiny pink house with a jet ski on the lawn He pulls her hair She puts her sunglasses on and primps her hair then gets out She delivers a swift kick to his crotch Sandy sags as she runs to his car Setting her phone down the redhead takes her sunglasses off looks into the driver's side mirror and gives her car some gas She gets into his sedan He sets her on the bed Sandy limps toward her Our view moves over a sunny beach toward a city skyline The sedan bangs the Fiat's rear bumper She reverses while flipping him off He shambles back to her Fiat and gets in He discovers the key missing In the rear view he sees an empty road She comes in from the sides Sandy gazes at the floor then rises and watches the men leave The sedan Tbones the compact She pins it to the guardrail The odometer needle rises The sedan Tbones the compact the kitchen Now a plane sails across the sky Sandy tries in vain to open the crushed door as she speeds down the highway He reaches through the sunroof He finds a pink registration form in the glove box He takes it out Sandy tails the thief while she plays with her smartphone He reads the address Sandy tries in vain to open the crushed door as she speeds down the highway Now in a tiny pink house with a jet ski on the lawn She gets into his sedan a variety of small expensive products in sets of three or more clutters the kitchen"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "The detective leaves while the boss lingers with his arms folded. Sandy gazes at the floor then rises and watches the men leave. Holding his cell phone he looks at the salon number displayed in red. He glances up then down to the number's origin. The detective glances at Daniel who rubs his face with one hand. Sandy runs off. Sandy's wife helps him pack. Sandy shrugs at his wife. He sets her on the bed. He takes the folded mug shot from his back pocket. She gives him a little nudge. Sandy heads out. He kisses Trish. She hands him his suitcase. Now a plane sails across the sky. Our view moves over a sunny beach toward a city skyline. Outside Ladies Choice salon. Sandy rolls up his window in a gold Sedan. The plump thief strolls into view in a loud pink print shirt and poofy hair. She walks in slow motion. Sandy observes her go to a tiny blue Fiat with a red stripe on its side. She bounces to the driver's door and gets in. The garishly madeup woman takes a handicapped parking tag off the rear view mirror and tosses it in back. Sandy puts his seat belt on as the woman zips out of her parking space. Now on a freeway. Sandy tails the thief while she plays with her smartphone. She looks in her rear view and catches sight of him. Setting her phone down the redhead takes her sunglasses off looks into the driver's side mirror and gives her car some gas. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. The odometer needle rises. Sandy presses his accelerator. The speedometer ticks up to 50. The woman tightens her mouth and slams on the brakes with both feet. The sedan bangs the Fiat's rear bumper. In her rear view she sees Sandy whiteknuckling his wheel. She puts her sunglasses on and primps her hair then gets out. The short woman looks up at Sandy then punches his throat. She pushes him and goes for her car. He pulls her hair. She delivers a swift kick to his crotch. Sandy sags as she runs to his car. She gets into his sedan. Sandy limps toward her. She reverses while flipping him off. He shambles back to her Fiat and gets in. He discovers the key missing. In the rear view he sees an empty road. She comes in from the sides. The sedan Tbones the compact. She pins it to the guardrail. Sandy tries in vain to open the crushed door as she speeds down the highway. He reaches through the sunroof. He finds a pink registration form in the glove box. He takes it out. He reads the address. Now in a tiny pink house with a jet ski on the lawn. a variety of small expensive products in sets of three or more clutters. the kitchen."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "The detective leaves while the boss lingers with his arms folded. Sandy gazes at the floor then rises and watches the men leave. Holding his cell phone he looks at the salon number displayed in red. He glances up then down to the number's origin. The detective glances at Daniel who rubs his face with one hand. Sandy runs off. Sandy's wife helps him pack. Sandy shrugs at his wife. He sets her on the bed. He takes the folded mug shot from his back pocket. She gives him a little nudge. Sandy heads out. He kisses Trish. She hands him his suitcase. Now a plane sails across the sky. Our view moves over a sunny beach toward a city skyline. Outside Ladies Choice salon. Sandy rolls up his window in a gold Sedan. The plump thief strolls into view in a loud pink print shirt and poofy hair. She walks in slow motion. Sandy observes her go to a tiny blue Fiat with a red stripe on its side. She bounces to the driver's door and gets in. The garishly madeup woman takes a handicapped parking tag off the rear view mirror and tosses it in back. Sandy puts his seat belt on as the woman zips out of her parking space. Now on a freeway. Sandy tails the thief while she plays with her smartphone. She looks in her rear view and catches sight of him. Setting her phone down the redhead takes her sunglasses off looks into the driver's side mirror and gives her car some gas. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. The odometer needle rises. Sandy presses his accelerator. The speedometer ticks up to 50. The woman tightens her mouth and slams on the brakes with both feet. The sedan bangs the Fiat's rear bumper. In her rear view she sees Sandy whiteknuckling his wheel. She puts her sunglasses on and primps her hair then gets out. The short woman looks up at Sandy then punches his throat. She pushes him and goes for her car. He pulls her hair. She delivers a swift kick to his crotch. Sandy sags as she runs to his car. She gets into his sedan. Sandy limps toward her. She reverses while flipping him off. He shambles back to her Fiat and gets in. He discovers the key missing. In the rear view he sees an empty road. She comes in from the sides. The sedan Tbones the compact. She pins it to the guardrail. Sandy tries in vain to open the crushed door as she speeds down the highway. He reaches through the sunroof. He finds a pink registration form in the glove box. He takes it out. He reads the address. Now in a tiny pink house with a jet ski on the lawn. a variety of small expensive products in sets of three or more clutters. the kitchen."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "The detective leaves while the boss lingers with his arms folded. Sandy gazes at the floor then rises and watches the men leave. Holding his cell phone he looks at the salon number displayed in red. He glances up then down to the number's origin. The detective glances at Daniel who rubs his face with one hand. Sandy runs off. Sandy's wife helps him pack. Sandy shrugs at his wife. He sets her on the bed. He takes the folded mug shot from his back pocket. She gives him a little nudge. Sandy heads out. He kisses Trish. She hands him his suitcase. She reverses while flipping him off. He shambles back to her Fiat and gets in. He discovers the key missing. In the rear view he sees an empty road. She comes in from the sides. The sedan Tbones the compact. She pins it to the guardrail. Sandy tries in vain to open the crushed door as she speeds down the highway. He reaches through the sunroof. He finds a pink registration form in the glove box. He takes it out. He reads the address. Now in a tiny pink house with a jet ski on the lawn. a variety of small expensive products in sets of three or more clutters. the kitchen."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "The detective leaves while the boss lingers with his arms folded. Sandy gazes at the floor then rises and watches the men leave. Holding his cell phone he looks at the salon number displayed in red. He glances up then down to the number's origin. The detective glances at Daniel who rubs his face with one hand. Sandy runs off. He finds a pink registration form in the glove box. He takes it out. He reads the address. Now in a tiny pink house with a jet ski on the lawn. a variety of small expensive products in sets of three or more clutters. the kitchen."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The gardener leaves, while the musician lingers with his arms folded. A dog gazes at the floor, then rises and watches the men leave. Holding his cell phone, a kitten looks at the salon number displayed in red. The kitten glances up, then down to the number's origin. The gardener glances at a robot, who rubs his face with one hand. The dog runs off. The dog's neighbor helps him pack. The dog shrugs at his neighbor. The dog sets her on the bed. The dog takes the folded mug shot from his back pocket. She gives him a little nudge. The dog heads out. The dog kisses a cat. The cat hands him his suitcase. Now, a kite sails across the sky. Our view moves over a sunny beach toward a city skyline. Outside Ladies Choice salon, the dog rolls up his window in a gold Sedan. A raccoon strolls into view in a loud pink print shirt and poofy hair. The raccoon walks in slow motion. The dog observes the raccoon go to a tiny blue Fiat with a red stripe on its side. The raccoon bounces to the driver's door and gets in. The garishly made-up ferret takes a handicapped parking tag off the rear view mirror and tosses it in back. The dog puts his seat belt on as the ferret zips out of her parking space. Now, on a freeway, the dog tails the raccoon while the ferret plays with her smartphone. The ferret looks in her rear view and catches sight of the dog. Setting her phone down, the redhead parrot takes her sunglasses off, looks into the driver's side mirror, and gives her car some gas. The odometer needle rises. The dog presses his accelerator. The speedometer ticks up to 50. The parrot tightens her mouth and slams on the brakes with both feet. The sedan bangs the Fiat's rear bumper. In her rear view, the parrot sees the dog white-knuckling his wheel. The parrot puts her sunglasses on and primps her hair, then gets out. The short giraffe looks up at the dog, then punches his throat. The giraffe pushes him and goes for her car. The dog pulls her hair. The giraffe delivers a swift kick to his crotch. The dog sags as the giraffe runs to his car. The giraffe gets into his sedan. The dog limps toward her. The giraffe reverses while flipping him off. The dog shambles back to her Fiat and gets in. The dog discovers the key missing. In the rear view, the dog sees an empty road. The ferret comes in from the sides. The sedan T-bones the compact. The ferret pins it to the guardrail. The dog tries in vain to open the crushed door as the ferret speeds down the highway. The dog reaches through the sunroof. The dog finds a pink registration form in the glove box. The dog takes it out. The dog reads the address. Now, in a tiny pink house with a jet ski on the lawn, a variety of small expensive products in sets of three or more clutters the kitchen."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "The detective departs, while the boss lingers with his arms crossed. Sandy gazes at the wall, then rises and watches the men exit. Holding his remote control, he looks at the office number displayed in blue. He glances up, then down to the number's origin. The detective glances at Daniel, who rubs his forehead with one hand. Sandy dashes off. Sandy's sister helps him pack. Sandy shrugs at his sister. He sets her on the couch. He takes the folded pamphlet from his front pocket. She gives him a gentle shove. Sandy heads out. He kisses Trish. She hands him his backpack. Now, a kite soars across the sky. Our view moves over a bustling market toward a mountain range. Outside Fresh Eats café, Sandy rolls up his window in a silver Motorcycle. The slender pickpocket strolls into view in a loud green paisley scarf and curly hair. She walks in slow motion. Sandy observes her go to a large orange Truck with a blue stripe on its side. She saunters to the driver's door and gets in. The minimally made-up woman takes a parking voucher off the dashboard and tosses it in back. Sandy puts his seat belt on as the woman zooms out of her parking spot. Now, on a dirt road, Sandy follows the pickpocket while she fiddles with her tablet. She looks in her side mirror and catches sight of him. Setting her tablet down, the brunette takes her hat off, looks into the rearview mirror, and gives her vehicle some gas. The speedometer needle rises. Sandy presses his pedal. The tachometer ticks up to 1000 RPM. The woman tightens her lips and slams on the brakes with both feet. The motorcycle taps the truck's rear bumper. In her side mirror, she sees Sandy gripping his handlebars tightly. She puts her hat back on and adjusts her scarf, then gets out. The tall woman looks up at Sandy, then elbows his stomach. She shoves him and heads for her vehicle. He pulls her scarf. She delivers a swift kick to his shin. Sandy staggers as she runs to his motorcycle. She gets into his Motorcycle. Sandy limps after her. She reverses while waving sarcastically. He hobbles back to her Truck and gets in. He discovers the key missing. In the side mirror, he sees an empty road. She comes in from the opposite lane. The Motorcycle sideswipes the off-roader. She wedges it against a barrier. Sandy tries in vain to open the wedged door as she speeds down the expressway. He reaches through the moonroof. He finds a yellow invoice form in the center console. He takes it out. He reads the address. Now, in a grand yellow mansion with a sailboat on the driveway, a collection of large lavish sculptures in sets of three or more clutters the living room."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "The detective departs, while the boss reclines with his arms swinging. Sandy stares at the ceiling, then sits down and listens to the men chatter. Holding his cell phone, he gazes at the salon number highlighted in green. He peers up, then sideways to the number's source. The detective peers at Daniel, who scratches his arm with one hand. Sandy strolls away. Sandy's wife watches him clean. Sandy winks at his wife. He places her beside the bed. He drops the folded mug shot from his back pocket. She gives him a little wave. Sandy skips out. He hugs Trish. She tosses him his suitcase. Now, a plane drifts across the sky. Our view slides over a sunny beach toward a city skyline. Outside Ladies Choice salon, Sandy slides his window down in a gold Sedan. The plump thief tiptoes into view in a loud pink print shirt and poofy hair. She dances in slow motion. Sandy notices her head to a tiny blue Fiat with a red stripe on its side. She skips to the driver's door and clambers in. The garishly made-up woman grabs a handicapped parking tag off the rear view mirror and throws it in back. Sandy clicks his seat belt off as the woman inches out of her parking space. Now, on a freeway, Sandy trails the thief while she taps on her smartphone. She glimpses in her rear view and notices him. Putting her phone aside, the redhead slips her sunglasses on, peers into the driver's side mirror, and eases her car forward. The odometer needle wavers. Sandy eases his accelerator. The speedometer drifts to 50. The woman relaxes her mouth and taps the brakes with one foot. The sedan nudges the Fiat's rear bumper. In her rear view, she notices Sandy gripping his wheel gently. She lifts her sunglasses and pats her hair, then walks out. The short woman glances at Sandy, then pokes his shoulder. She shakes him and turns toward her car. He pats her hair. She delivers a gentle tap to his foot. Sandy stands firm as she strolls to his car. She jumps into his sedan. Sandy strides toward her. She advances while ignoring him. He creeps back to her Fiat and hops in. He uncovers the key missing. In the rear view, he notices an empty road. She drives in from the edges. The sedan brushes the compact. She pins it beside the guardrail. Sandy nudges the stubborn door as she cruises down the highway. He taps through the sunroof. He locates a pink registration form in the glove box. He takes it out. He examines the address. Now, in a tiny pink house with a jet ski on the lawn, a variety of small expensive products in sets of three or more decorates the kitchen."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "The giraffe departs, while the librarian lingers with its branches folded. The parrot gazes at the ceiling, then rises and watches the clouds leave. Holding its spoon, it looks at the stereo combination displayed in purple. It glances up, then down to the combination's destination. The giraffe glances at the balloon, who waves its tail with one branch. The parrot flies off. The parrot's uncle helps it cook. The parrot frowns at its uncle. It sets him on the couch. It takes the crumpled envelope from its shoe. He gives it a little push. The parrot floats out. It kisses the pencil. The pencil hands it its backpack. Now, a kite glides across the lake. Our gaze moves over a snowy mountain toward an ocean skyline. Outside Gentlemen's Preference bakery, the parrot rolls up its curtain in a purple scooter. The skinny bandit sweeps into view in a quiet orange striped scarf and sleek shoes. He walks in fast motion. The parrot observes him go to a giant yellow tractor with a green square on its roof. He skips to the passenger's door and climbs in. The quietly decorated man takes an oversized tissue box off the steering column and tosses it in front. The parrot puts its helmet on as the man zooms out of his resting place. Now, on a railway, the parrot follows the bandit while he chats with his wristwatch. He looks in his sideview and catches sight of it. Placing his watch down, the blonde takes his spectacles off, looks into the passenger's side visor, and gives his truck some electricity. The tachometer arrow rises. The parrot presses its clutch. The gauge ticks up to 75. The man smirks and smashes on the accelerator with two wings. The scooter taps the tractor's front grille. In his sideview, he sees the parrot gripping its handlebars. He puts his spectacles on and adjusts his shoes, then hops out. The tall man looks up at the parrot, then tickles its neck. He nudges it and goes for his scooter. It pulls his shoes. He delivers a swift pat on its head. The parrot floats as he bounces to its scooter. He gets into its scooter. The parrot waddles toward him. He backs away while shaking him off. It saunters back to his tractor and steps in. It discovers the pedal missing. In the sideview, it sees a busy street. He arrives in from the shadows. The scooter barrels the machine. He pins it to the lamppost. The parrot tries hopelessly to close the broken window as he zooms up the cliff. It reaches through the side pocket. It finds a purple coupon booklet in the cup holder. It takes it out. It reads the coordinates. Now, in a quiet purple apartment with a helicopter on the roof, a multitude of large shabby fruits in sets of five or less litters the bedroom."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "The botanist departs, while the teacher loiters with his arms crossed. Alex stares at the window, then ascends and follows the women wander. Clutching his notepad, he examines the salon address displayed in blue. He peers sideways, then up to the address's location. The botanist peers at Michael, who scratches his chin with one finger. Alex dashes off. Alex's brother assists him unpack. Alex nods at his brother. He places him on the couch. He retrieves the folded map from his front pocket. He gives him a small push. Alex marches out. He waves at Lisa. She passes him his backpack. Now, a drone flies across the forest. Our view shifts over a bustling city toward a mountain range. Outside Gentlemen's Choice barber, Alex rolls down his window in an emerald Coupe. The lanky runner ambles into view in a silent green print shirt and spiky hair. He proceeds in awkward motion. Alex watches him head to a large yellow van with a black stripe on its side. He hops to the passenger's door and climbs in. The elegantly dressed man takes a VIP parking tag off the dashboard and flings it aside. Alex fastens his seat belt as the man swerves out of his parking spot. Now, on a country road, Alex shadows the runner while he scrolls through his tablet. He glances in his side mirror and notices him. Placing his tablet down, the brunette adjusts his cap, peers into the passenger side mirror, and gives his van some juice. The speedometer needle climbs. Alex taps his brake. The odometer drops to 30. The man widens his grin and slams on the gas with one hand. The Coupe bumps the van's front fender. In his side mirror, he spots Alex gripping his seat. He puts his cap on and smooths his jacket, then steps out. The tall man looks down at Alex, then kicks his tire. He nudges him and rushes for his bike. He tugs his sleeve. He delivers a quick slap to his knee. Alex slumps as he trots to his van. He hops into his Coupe. Alex hobbles toward him. He speeds off while waving at him. He trudges back to his van and hops in. He notices the battery missing. In the side mirror, he views an empty field. He swings in from the top. The van T-bones the vehicle. He pins it to the tree. Alex struggles in vain to open the blocked window as he cruises down the avenue. He reaches under the dashboard. He locates a purple insurance form in the center console. He pulls it out. He examines the details. Now, in a spacious purple apartment with a helicopter on the balcony, a range of large inexpensive tools in sets of four or more litters the garage."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "The detective exits, while the boss idles with his hands clasped. Sandy peers at the ceiling, then stands and observes the men depart. Clutching his wallet, he peers at the theater number displayed in green. He gazes forward, then back to the number's source. The detective peers at Daniel, who pats his neck with one hand. Sandy dashes away. Sandy's wife assists him unpack. Sandy nods at his wife. He places her on the sofa. He takes the crumpled comic strip from his front pocket. She gives him a gentle poke. Sandy strides out. He hugs Trish. She passes him his backpack. Now, a kite drifts across the sky. Our view drifts over a cloudy mountain toward a rural landscape. Outside Gentlemen’s Corner bookstore, Sandy pulls down his visor in a silver Bicycle. The slender clown tiptoes into view in a muted yellow polka dot jacket and slicked-back hair. She skips in fast motion. Sandy watches her approach a large red Vespa with a green stripe on its front. She hops to the driver's seat and gets in. The modestly adorned woman takes a fuzzy dice ornament off the dashboard and flings it aside. Sandy buckles his helmet as the woman darts out of her parking zone. Now, on a bridge, Sandy pursues the clown while she fiddles with her notebook. She peers in her side mirror and spots him. Dropping her notebook, the brunette removes her gloves, looks into the rearview mirror, and gives her bike more throttle. The tachometer needle climbs. Sandy pushes his clutch. The odometer climbs to 50. The woman purses her lips and jabs the brakes with one hand. The bicycle taps the Vespa's side panel. In her side mirror, she sees Sandy gripping his handlebars. She dons her gloves and adjusts her scarf, then steps out. The tall woman glances up at Sandy, then jabs his shoulder. She shoves him and darts for her bike. He tugs her jacket. She lands a rapid slap to his cheek. Sandy droops as she hurries to his bike. She hops into his bicycle. Sandy limps after her. She retreats while waving at him. He staggers back to her Vespa and mounts it. He finds the pedal missing. In the side mirror, he sees an empty lane. She advances from the flanks. The bicycle rams the scooter. She traps it against the fence. Sandy struggles unsuccessfully to unfasten the tangled latch as she zips down the boulevard. He extends through the window. He discovers a yellow warranty card in the seat compartment. He retrieves it. He examines the directions. Now, in a large yellow mansion with a kayak on the porch, a multitude of large mundane devices in pairs or more clutters the garage."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "The baker departs, while the farmer hovers with his hands waving. Alex stares at the ceiling, then jumps and notices the women enter. Grasping his notepad, he squints at the gym address written in blue. He peers left, then right to the address's location. The baker peeks at Alan, who scratches his head with one finger. Alex dashes away. Alex's cousin assists him unpack. Alex laughs at his cousin. He places her on the couch. He removes the crumpled recipe from his front pocket. She gives him a gentle push. Alex strolls outside. He high-fives Pat. She tosses him his backpack. Now, a kite drifts above the forest. Our perspective shifts over a snowy mountain toward an urban horizon. Outside Gentlemen's Corner gym, Alex lowers his umbrella in a silver Coupe. The slim juggler waltzes into sight in a muted green floral dress and curly wig. He moves at regular speed. Alex observes him wander to a large red Van with a white stripe on its top. He skips to the passenger's seat and hops in. The subtly dressed man removes a furry dice from the dashboard and hurls it forward. Alex fastens his helmet as the man zooms from his parking spot. Now, on a boulevard, Alex follows the juggler while he taps on his tablet. He glances in his side mirror and catches sight of him. Placing his tablet aside, the blonde puts his hat on, checks the passenger's side mirror, and presses his foot on the pedal. The speedometer climbs. Alex pushes his clutch. The tachometer inches up to 80. The man clenches his jaw and stomps on the brakes with one toe. The coupe nudges the Van's front fender. In his side mirror, he spots Alex gripping his seat. He places his hat back and adjusts his scarf, then steps out. The tall man peers up at Alex, then nudges his knee. He nudges him and reaches for his van. He tugs his scarf. He gives a soft pat on his shoulder. Alex bends as he hobbles to his van. He enters his coupe. Alex limps closer to him. He moves backward while waving him off. He strolls back to his Van and climbs in. He notices the map absent. Through the windshield, he sees a deserted highway. He enters from the shadows. The coupe collides with the SUV. He presses it against the embankment. Alex struggles fruitlessly to pry the stuck window as he cruises along the motorway. He extends through the sunshade. He comes across a blue instruction card in the toolbox. He extracts it. He examines the map. Now, in a large blue mansion with a bicycle on the porch, a collection of large inexpensive items in sets of one or two fills the living room."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Sandy, involved in a complex case, watches his boss leave before focusing on a mysterious salon number on his phone. His wife helps him pack and he departs, kissing her goodbye. A plane transitions to a sunny beach scene and Sandy, in his gold Sedan, observes a flamboyant thief in a pink shirt entering a blue Fiat. He follows her on the freeway as she notices him in her mirror and accelerates. A chase ensues, resulting in a collision when she brakes suddenly. Confronting each other, she kicks Sandy and hijacks his Sedan. He manages to get into her Fiat but finds the key missing. As she speeds away, Sandy retrieves a pink registration form from the glovebox and notes the address. The scene shifts to a small pink house cluttered with expensive items."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "the kitchen a variety of small expensive products in sets of three or more clutters Now in a tiny pink house with a jet ski on the lawn He reads the address He takes it out He finds a pink registration form in the glove box He reaches through the sunroof Sandy tries in vain to open the crushed door as she speeds down the highway She pins it to the guardrail The sedan Tbones the compact She comes in from the sides In the rear view he sees an empty road He discovers the key missing He shambles back to her Fiat and gets in She reverses while flipping him off Sandy limps toward her She gets into his sedan Sandy sags as she runs to his car She delivers a swift kick to his crotch He pulls her hair She pushes him and goes for her car The short woman looks up at Sandy then punches his throat She puts her sunglasses on and primps her hair then gets out In her rear view she sees Sandy whiteknuckling his wheel The sedan bangs the Fiat's rear bumper The woman tightens her mouth and slams on the brakes with both feet The speedometer ticks up to 50 Sandy presses his accelerator The odometer needle rises Setting her phone down the redhead takes her sunglasses off looks into the driver's side mirror and gives her car some gas She looks in her rear view and catches sight of him Sandy tails the thief while she plays with her smartphone Now on a freeway Sandy puts his seat belt on as the woman zips out of her parking space The garishly madeup woman takes a handicapped parking tag off the rear view mirror and tosses it in back She bounces to the driver's door and gets in Sandy observes her go to a tiny blue Fiat with a red stripe on its side She walks in slow motion The plump thief strolls into view in a loud pink print shirt and poofy hair Sandy rolls up his window in a gold Sedan Outside Ladies Choice salon Our view moves over a sunny beach toward a city skyline Now a plane sails across the sky She hands him his suitcase He kisses Trish Sandy heads out She gives him a little nudge He takes the folded mug shot from his back pocket He sets her on the bed Sandy shrugs at his wife Sandy's wife helps him pack Sandy runs off The detective glances at Daniel who rubs his face with one hand He glances up then down to the number's origin Holding his cell phone he looks at the salon number displayed in red Sandy gazes at the floor then rises and watches the men leave The detective leaves while the boss lingers with his arms folded"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "She pushes him and goes for her car Sandy puts his seat belt on as the woman zips out of her parking space He finds a pink registration form in the glove box Sandy heads out Outside Ladies Choice salon Sandy observes her go to a tiny blue Fiat with a red stripe on its side He takes it out a variety of small expensive products in sets of three or more clutters In her rear view she sees Sandy whiteknuckling his wheel She walks in slow motion He takes the folded mug shot from his back pocket In the rear view he sees an empty road The woman tightens her mouth and slams on the brakes with both feet The short woman looks up at Sandy then punches his throat The speedometer ticks up to 50 Sandy limps toward her He glances up then down to the number's origin She bounces to the driver's door and gets in She pins it to the guardrail The detective glances at Daniel who rubs his face with one hand Sandy presses his accelerator She gives him a little nudge She delivers a swift kick to his crotch The garishly madeup woman takes a handicapped parking tag off the rear view mirror and tosses it in back Sandy sags as she runs to his car Now on a freeway The detective leaves while the boss lingers with his arms folded She reverses while flipping him off Sandy tails the thief while she plays with her smartphone Sandy tries in vain to open the crushed door as she speeds down the highway The plump thief strolls into view in a loud pink print shirt and poofy hair The odometer needle rises She comes in from the sides She looks in her rear view and catches sight of him He kisses Trish the kitchen The sedan bangs the Fiat's rear bumper He reaches through the sunroof She hands him his suitcase He discovers the key missing Now in a tiny pink house with a jet ski on the lawn Holding his cell phone he looks at the salon number displayed in red Setting her phone down the redhead takes her sunglasses off looks into the driver's side mirror and gives her car some gas He pulls her hair Sandy runs off She puts her sunglasses on and primps her hair then gets out He shambles back to her Fiat and gets in Sandy's wife helps him pack He reads the address He sets her on the bed Now a plane sails across the sky Our view moves over a sunny beach toward a city skyline Sandy rolls up his window in a gold Sedan The sedan Tbones the compact Sandy gazes at the floor then rises and watches the men leave Sandy shrugs at his wife She gets into his sedan"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Sandy presses his accelerator The speedometer ticks up to 50 The woman tightens her mouth and slams on the brakes with both feet The sedan bangs the Fiat's rear bumper In her rear view she sees Sandy whiteknuckling his wheel She puts her sunglasses on and primps her hair then gets out The short woman looks up at Sandy then punches his throat She pushes him and goes for her car He pulls her hair She delivers a swift kick to his crotch Sandy sags as she runs to his car She gets into his sedan Sandy limps toward her She reverses while flipping him off He shambles back to her Fiat and gets in He discovers the key missing In the rear view he sees an empty road She comes in from the sides The sedan Tbones the compact She pins it to the guardrail Sandy tries in vain to open the crushed door as she speeds down the highway He reaches through the sunroof He finds a pink registration form in the glove box He takes it out He reads the address Now in a tiny pink house with a jet ski on the lawn a variety of small expensive products in sets of three or more clutters the kitchen The detective leaves while the boss lingers with his arms folded Sandy gazes at the floor then rises and watches the men leave Holding his cell phone he looks at the salon number displayed in red He glances up then down to the number's origin The detective glances at Daniel who rubs his face with one hand Sandy runs off Sandy's wife helps him pack Sandy shrugs at his wife He sets her on the bed He takes the folded mug shot from his back pocket She gives him a little nudge Sandy heads out He kisses Trish She hands him his suitcase Now a plane sails across the sky Our view moves over a sunny beach toward a city skyline Outside Ladies Choice salon Sandy rolls up his window in a gold Sedan The plump thief strolls into view in a loud pink print shirt and poofy hair She walks in slow motion Sandy observes her go to a tiny blue Fiat with a red stripe on its side She bounces to the driver's door and gets in The garishly madeup woman takes a handicapped parking tag off the rear view mirror and tosses it in back Sandy puts his seat belt on as the woman zips out of her parking space Now on a freeway Sandy tails the thief while she plays with her smartphone She looks in her rear view and catches sight of him Setting her phone down the redhead takes her sunglasses off looks into the driver's side mirror and gives her car some gas The odometer needle rises"
        }
      ]
    }
  ]
}