{
  "ground_truth": "Looking through the passenger side window, he sees the skiptracer lying groggily against the wheel. The side door bursts open and Diana rolls onto her feet. Blood drips from her nose. She hugs him. He glances back. A tractor-trailer plows through the rental car, tearing it to pieces. Sandy stands motionless with his gaze fixed on the wreckage. Sandy looks at her and softly nods. Later, he drives the beat-up van along a narrow dirt road. In an office, Big Chuck sits across from Marisol and Julian. Big Chuck's smile fades. Chuck eyes the thugs. Julian slams Chuck's head against the desk. Diana searches the van. The temperature gauge rises. Sandy pulls over as steam wafts from the hood. Sandy steps out and approaches the steaming hood as Diana duct tapes the unconscious skiptracer. She takes a sip. She touches his pecs. Her nose grazes his beard. Sandy props the hood open and lets steam vent out. He stares at the sign, then opens the van. The skiptracer breathes deeply in his duct tape restraint. Now, a state trooper waves on traffic past Sandy's wrecked sedan. As Julian and Marisol cruise by, they overhear a witness. Now, Sandy talks on his cell as he and Diana walk along a deserted road. He shoots Diana a look. She looks away. At night, a pickup truck approaches. Her thumbs. He shows her his phone. Later, they start a fire. He looks up and she shuts her eyes. Sandy shrugs. Sandy lies on his side next to the fire, and Diana snuggles up behind him. She pulls her arm away. A snake slithers toward them. The snake moves closer. He glances back at Diana as the snake slithers into his pants. He springs up and fumbles with his jeans. He pushes his pants off. Sandy tosses his jeans into the woods. A snake lowers from a tree. It drops onto his shoulders. She dips the stick into the fire. She swings the stick. The snake tightens around his neck. The snake watches the flame, then bites into Sandy's neck. Diana whacks it with a stick, and Sandy drops to the ground. She hits it a few more times, then tosses away the stick. Diana grabs the snake and tugs at it, as Sandy pries the reptile's teeth from his neck. Diana tosses the snake away and shakes her hands. In the morning, a cargo train passes by a rusty disheveled station. Diana applies makeup while Sandy lies on a bench in a pair of dirt-covered khakis. Sandy wakes up and reaches for his neck. Diana watches him with a smile. He walks away. He moves to the ticket booth. He looks back at Diana and paces.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Gazing through the traveler side pane, he observes the bounty hunter reclining drowsily against the steering apparatus. The lateral portal erupts open and Diana rolls onto her soles. Hemoglobin trickles from her nostrils. She embraces him. He peeks back. A semi-truck furrows through the leased vehicle, shredding it to fragments. Sandy stands immobile with his stare fixed on the debris. Sandy glances at her and gently nods. Subsequently, he pilots the shabby van along a slender earthen path. In a bureau, Big Chuck perches across from Marisol and Julian. Big Chuck's grin diminishes. Chuck surveys the henchmen. Julian bangs Chuck's skull against the table. Diana searches the van. The heat gauge ascends. Sandy halts as mist wafts from the cover. Sandy exits and approaches the fogging hood as Diana duct tapes the insensible skiptracer. She sips. She touches his pecs. Her nose grazes his whiskers. Sandy props the hood ajar and lets vapor escape. He gazes at the notice, then opens the van. The skiptracer breathes deeply in his duct tape bind. Now, a state officer waves on traffic past Sandy's shattered sedan. As Julian and Marisol sail by, they overhear a spectator. Now, Sandy converses on his mobile as he and Diana tread along an abandoned path. He gives Diana a look. She averts her eyes. At dusk, a pickup approaches. Her thumbs. He displays her his device. Afterward, they ignite a flame. He looks up and she closes her eyes. Sandy shrugs. Sandy reclines on his flank next to the blaze, and Diana snuggles up behind him. She withdraws her limb. A serpent crawls toward them. The serpent advances closer. He peeks back at Diana as the snake glides into his trousers. He leaps up and struggles with his jeans. He shoves his pants off. Sandy hurls his jeans into the forest. A snake descends from a branch. It drops onto his shoulders. She dips the rod into the flame. She swings the rod. The serpent constricts around his throat. The serpent watches the blaze, then bites into Sandy's throat. Diana strikes it with a stick, and Sandy collapses to the terrain. She hits it a few more times, then discards the rod. Diana seizes the serpent and tugs at it, as Sandy pries the reptile's fangs from his throat. Diana throws the serpent away and shakes her hands. In the dawn, a freight train travels by a corroded unkempt depot. Diana applies cosmetics while Sandy lies on a seat in a pair of dirt-covered khakis. Sandy awakens and reaches for his throat. Diana watches him with a grin. He walks away. He moves to the ticket kiosk. He looks back at Diana and strides."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Looking through the passenger side window, the skiptracer is seen lying groggily against the wheel by him. The side door is burst open, and Diana rolls onto her feet. Blood drips from her nose. He is hugged by her. Back is glanced at by him. The rental car is plowed through by a tractor-trailer, tearing it to pieces. Motionless Sandy stands with his gaze fixed on the wreckage. Her, Sandy looks at and softly nods. Later, the beat-up van is driven by him along a narrow dirt road. In an office, Marisol and Julian sit across from Big Chuck. Big Chuck's smile fades. The thugs are eyed by Chuck. Chuck's head is slammed against the desk by Julian. The van is searched by Diana. The temperature gauge rises. Over, Sandy pulls as steam wafts from the hood. Out steps Sandy and the steaming hood is approached by him as the unconscious skiptracer is duct-taped by Diana. A sip is taken by her. His pecs are touched by her. Her nose grazes his beard. The hood is propped open by Sandy and steam is let vent out by him. At the sign, he stares, then the van is opened by him. Deeply, the skiptracer breathes in his duct tape restraint. Now, traffic is waved on past Sandy's wrecked sedan by a state trooper. As Marisol and Julian cruise by, a witness is overheard by them. Now, on his cell, Sandy talks as he and Diana walk along a deserted road. Diana is shot a look by him. Away, she looks. At night, a pickup truck is approached. Her thumbs. A phone is shown to her by him. Later, a fire is started by them. Up, he looks, and her eyes are shut by her. Sandy shrugs. On his side, Sandy lies next to the fire, and up behind him, Diana snuggles. Away, her arm is pulled by her. Toward them, a snake slithers. Closer, the snake moves. Diana is glanced back at by him as into his pants, the snake slithers. Up, he springs and with his jeans fumbles. Off, his pants are pushed by him. Into the woods, Sandy tosses his jeans. From a tree, a snake is lowered. Onto his shoulders, it drops. The stick is dipped into the fire by her. The stick is swung by her. Around his neck, the snake tightens. The flame is watched by the snake, then into Sandy's neck, it bites. With a stick, Diana whacks it, and to the ground, Sandy drops. A few more times, she hits it, then the stick is tossed away by her. The snake is grabbed by Diana and at it, she tugs, as the reptile's teeth are pried from his neck by Sandy. Away, the snake is tossed by Diana and her hands are shaken by her. In the morning, a cargo train passes by a rusty disheveled station. While Sandy lies on a bench in a pair of dirt-covered khakis, makeup is applied by Diana. Sandy wakes up and his neck is reached for by him. A smile is given by Diana as she watches him. Away, he walks. To the ticket booth, he moves. Back at Diana, he looks and paces are made by him."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Looking through the passenger window, he sees the skiptracer groggily against the wheel. The side door bursts open, and Diana rolls out, blood dripping from her nose. She hugs him. A tractor-trailer plows through the rental car, destroying it. Sandy stands motionless, gazing at the wreckage, then softly nods at her. Later, he drives a beat-up van on a narrow dirt road. In an office, Big Chuck sits with Marisol and Julian. Chuck's smile fades as Julian slams his head against the desk. Diana searches the van. The temperature gauge rises, and Sandy pulls over as steam wafts from the hood. He approaches the hood while Diana duct tapes the unconscious skiptracer. She sips and touches his pecs, her nose grazing his beard. Sandy props the hood open to vent steam. He stares at a sign, then opens the van. The skiptracer breathes deeply in his restraint. A state trooper waves traffic past Sandy's wrecked sedan. Julian and Marisol cruise by, overhearing a witness. Sandy talks on his cell as he and Diana walk a deserted road. He shoots Diana a look; she looks away. At night, a pickup truck approaches. He shows her his phone. Later, they start a fire. He looks up, and she shuts her eyes. Sandy shrugs, lying next to the fire, and Diana snuggles up. She pulls her arm away as a snake slithers toward them, moving into his pants. He springs up, fumbling with his jeans, and tosses them into the woods. A snake drops onto his shoulders. She dips a stick into the fire and swings it. The snake tightens around his neck, then bites him. Diana whacks it with a stick, and Sandy drops. She hits it a few more times, then tosses the stick. Diana grabs the snake, prying its teeth from Sandy's neck, and tosses it away. In the morning, a cargo train passes a rusty station. Diana applies makeup while Sandy lies on a bench in dirt-covered khakis. Sandy wakes, reaching for his neck. Diana watches with a smile. He walks to the ticket booth, looks back at Diana, and paces."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "He sees the skiptracer groggy against the wheel. Diana rolls out, nose bleeding, and hugs him. A tractor-trailer destroys the rental car. Sandy stares at the wreckage, nods at her, and later drives a beat-up van. In an office, Big Chuck's smile fades as Julian slams his head on the desk. Diana searches the van; the temperature gauge rises. Sandy pulls over, approaches the steaming hood, and Diana duct tapes the skiptracer. She sips, touches his pecs, and grazes his beard. Sandy vents the hood, stares at a sign, and opens the van. The skiptracer breathes deeply. A state trooper waves traffic past Sandy's wrecked sedan. Julian and Marisol overhear a witness. Sandy talks on his cell with Diana on a deserted road. He looks at her; she looks away. At night, a pickup approaches. He shows her his phone. They start a fire. He looks up; she shuts her eyes. Sandy lies by the fire, Diana snuggles, then pulls away. A snake slithers into his pants. He fumbles, tosses his jeans, and a snake drops onto his shoulders. She swings a stick; the snake bites Sandy's neck. Diana hits it, and Sandy falls. She grabs the snake, pries its teeth from his neck, and tosses it away. In the morning, a train passes a disheveled station. Diana applies makeup while Sandy lies on a bench. He wakes, reaches for his neck, and she smiles. He walks to the ticket booth, looks back, and paces."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Gazing through the passenger side window, he observes the skiptracer, who is lying groggily against the steering wheel, clearly disoriented. Suddenly, the side door bursts open with a loud bang, and Diana rolls onto her feet with agility. Blood is dripping from her nose, a stark reminder of the recent chaos. She embraces him tightly. He glances back over his shoulder. A massive tractor-trailer comes barreling through, plowing into the rental car and tearing it to pieces. Sandy stands there, motionless, his gaze fixed intently on the wreckage. Sandy looks at her and gives a soft nod of understanding. Later on, he is seen driving the beat-up van along a narrow, winding dirt road. In an office, Big Chuck sits across from Marisol and Julian. Big Chuck's smile gradually fades away. Chuck eyes the thugs with a wary expression. Julian suddenly slams Chuck's head against the desk with force. Meanwhile, Diana is busy searching the van. The temperature gauge begins to rise ominously. Sandy pulls over to the side of the road as steam starts wafting from the hood. Sandy steps out of the vehicle and approaches the steaming hood, while Diana duct tapes the unconscious skiptracer. She takes a sip from a bottle. She touches his pecs gently. Her nose grazes his beard lightly. Sandy props the hood open, allowing the steam to vent out. He stares at the sign, then opens the van door. The skiptracer breathes deeply, restrained by the duct tape. Now, a state trooper is waving on traffic past Sandy's wrecked sedan. As Julian and Marisol cruise by, they overhear a witness speaking. Now, Sandy is talking on his cell phone as he and Diana walk along a deserted road. He shoots Diana a look, filled with meaning. She looks away, avoiding his gaze. At night, a pickup truck approaches them. Her thumbs move nervously. He shows her something on his phone. Later, they start a fire to keep warm. He looks up at the sky, and she shuts her eyes, seeking rest. Sandy shrugs, resigned. Sandy lies on his side next to the fire, and Diana snuggles up behind him for warmth. She pulls her arm away after a moment. A snake slithers toward them silently. The snake moves closer, inching forward. He glances back at Diana as the snake slithers into his pants. He springs up in alarm and fumbles with his jeans. He hurriedly pushes his pants off. Sandy tosses his jeans into the woods in a panic. A snake lowers itself from a tree above. It drops onto his shoulders unexpectedly. She dips a stick into the fire, igniting it. She swings the stick with determination. The snake tightens its grip around his neck. The snake watches the flame intently, then bites into Sandy's neck. Diana whacks it with the stick, and Sandy drops to the ground, gasping. She hits it a few more times, then tosses the stick away. Diana grabs the snake and tugs at it, as Sandy pries the reptile's teeth from his neck. Diana tosses the snake away and shakes her hands, trying to rid herself of the encounter. In the morning, a cargo train rumbles past a rusty, disheveled station. Diana applies makeup while Sandy lies on a bench in a pair of dirt-covered khakis. Sandy wakes up and instinctively reaches for his neck. Diana watches him with a smile, a hint of amusement in her eyes. He walks away, needing space. He moves to the ticket booth, contemplating his next move. He looks back at Diana and paces, deep in thought."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Gazing intently through the passenger side window, he finds himself observing the skiptracer, who is lying in a groggy daze against the steering wheel, clearly exhibiting signs of disorientation. Suddenly and without warning, the side door bursts open with a loud, startling bang, and Diana rolls onto her feet with remarkable agility. Blood is noticeably dripping from her nose, serving as a stark reminder of the recent chaos they have endured. She embraces him tightly, holding on with a sense of urgency. He takes a moment to glance back over his shoulder. A massive tractor-trailer comes barreling through the scene, plowing into the rental car and tearing it to pieces in its destructive path. Sandy stands there, utterly motionless, his gaze fixed intently on the wreckage before him. Sandy then looks at her and gives a soft nod of understanding, conveying unspoken empathy. Later on, he is seen navigating the beat-up van along a narrow, winding dirt road, the wheels kicking up dust behind him. In an office setting, Big Chuck finds himself sitting across from Marisol and Julian. Big Chuck's previously confident smile gradually fades away. Chuck eyes the thugs with a wary, suspicious expression. Julian suddenly takes action, slamming Chuck's head against the desk with forceful intent. Meanwhile, Diana is busy meticulously searching the van. The temperature gauge ominously begins to rise, signaling potential trouble. Sandy wisely pulls over to the side of the road as steam starts wafting from the hood. Sandy steps out of the vehicle cautiously and approaches the steaming hood, while Diana efficiently duct tapes the unconscious skiptracer. She takes a casual sip from a bottle. She touches his pecs gently, her fingers brushing softly against his skin. Her nose grazes his beard lightly, almost tenderly. Sandy props the hood open, allowing the steam to vent out freely. He stares at the sign thoughtfully, then opens the van door with purpose. The skiptracer breathes deeply, restrained firmly by the duct tape. Now, a state trooper is seen waving on traffic to move past Sandy's wrecked sedan. As Julian and Marisol cruise by in their vehicle, they overhear a witness speaking animatedly. Now, Sandy is talking on his cell phone as he and Diana walk together along a deserted road. He shoots Diana a look, filled with unspoken meaning. She looks away, deliberately avoiding his gaze. As night falls, a pickup truck approaches them cautiously. Her thumbs move nervously, displaying her anxiety. He shows her something on his phone, perhaps a message or a plan. Later on, they sit together and start a fire to keep warm in the chilly night air. He looks up at the stars in the sky above, and she shuts her eyes, seeking rest and solace. Sandy shrugs, resigned to their current situation. Sandy lies on his side next to the fire, and Diana snuggles up behind him for warmth, seeking comfort in his presence. She eventually pulls her arm away after a moment. A snake silently slithers toward them with stealth. The snake moves closer, inching forward with intent. He glances back at Diana as the snake, with surprising speed, slithers into his pants. He springs up in alarm, wildly fumbling with his jeans. He hurriedly pushes his pants off, acting out of sheer panic. Sandy then tosses his jeans into the woods, desperate to rid himself of the intruder. A snake lowers itself sneakily from a tree above. It drops onto his shoulders unexpectedly, catching him off guard. She reacts quickly, dipping a stick into the fire, igniting it with determination. She swings the stick with determination, aiming to deter the snake. The snake tightens its grip menacingly around his neck. As the snake watches the flame intently, it suddenly bites into Sandy's neck. Diana acts swiftly, whacking it with the stick, and Sandy drops to the ground, gasping for breath. She hits it a few more times, then tosses the stick away. Diana grabs the snake firmly and tugs at it, as Sandy pries the reptile's teeth carefully from his neck. Diana tosses the snake away and shakes her hands, trying to rid herself of the disturbing encounter. In the morning, a cargo train rumbles past a rusty, disheveled station. Diana applies makeup while Sandy lies on a bench in a pair of dirt-covered khakis. Sandy wakes up slowly and instinctively reaches for his neck, feeling for any lingering pain. Diana watches him with a smile, a hint of amusement sparkling in her eyes. He walks away, needing space to think. He moves to the ticket booth, contemplating his next move carefully. He looks back at Diana and paces, clearly deep in thought."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Peering through the passenger side window, he observes the skiptracer slumped groggily against the steering wheel, his body limp and unresponsive. Suddenly, the side door bursts open with a loud clatter, and Diana rolls out, landing deftly on her feet despite the blood dripping from her nose. She immediately moves toward him, wrapping her arms around him in a tight embrace. He quickly glances back over his shoulder just in time to see a massive tractor-trailer barreling through the rental car, reducing it to a heap of twisted metal and debris. Sandy stands frozen, his eyes locked on the wreckage, unable to tear his gaze away from the scene of destruction. He then shifts his focus to Diana, meeting her eyes and offering a soft nod of understanding. Later, Sandy is behind the wheel of a beat-up van, navigating it along a narrow dirt road, the vehicle rattling with each bump. Meanwhile, in an office, Big Chuck sits across from Marisol and Julian, his initial smile fading as he assesses the situation. Chuck's eyes dart toward the thugs, sensing the tension in the room. Without warning, Julian slams Chuck's head against the desk with a resounding thud. Back in the van, Diana rummages through the interior, her hands moving quickly as she searches for something. The temperature gauge on the dashboard begins to climb, prompting Sandy to pull over to the side of the road as steam starts to waft from the hood. He steps out of the van and approaches the source of the steam, while Diana busies herself with duct-taping the unconscious skiptracer. She pauses to take a sip from a bottle, then reaches out to touch Sandy's pecs, her nose brushing against his beard. Sandy props the hood open, allowing the steam to vent out into the air. He takes a moment to stare at a nearby sign before turning back to open the van. Inside, the skiptracer breathes deeply, his chest rising and falling beneath the duct tape restraint. Meanwhile, a state trooper directs traffic past Sandy's wrecked sedan, waving cars along the road. As Julian and Marisol drive by, they catch snippets of a witness's account. Now, Sandy is on his cell phone, his voice low as he and Diana walk along a deserted road. He shoots Diana a look, a silent communication passing between them, but she looks away, avoiding his gaze. As night falls, the headlights of a pickup truck pierce the darkness, approaching them slowly. Her thumbs move restlessly, and he shows her something on his phone. Later, they sit by a crackling fire, the flames casting flickering shadows around them. He looks up at the night sky, while she shuts her eyes, seeking solace in the moment. Sandy shrugs, a gesture of resignation, before lying on his side next to the fire. Diana snuggles up behind him, seeking warmth, but soon pulls her arm away. A snake silently slithers toward them, its movements almost imperceptible. As it moves closer, Sandy glances back at Diana, a warning in his eyes, just as the snake slips into his pants. He springs up in alarm, fumbling with his jeans in a frantic attempt to dislodge the intruder. In a desperate move, he pushes his pants off and tosses them into the woods. Another snake lowers itself from a tree, dropping onto his shoulders with a sudden weight. Diana quickly dips a stick into the fire, igniting the end, and swings it toward the snake. The snake, undeterred, tightens its grip around Sandy's neck, its eyes fixed on the flame before it strikes, sinking its fangs into his neck. Diana reacts swiftly, whacking the snake with the stick until Sandy collapses to the ground. She continues to hit it a few more times, then discards the stick. Grabbing the snake, she tugs at it with determination, while Sandy pries the reptile's teeth from his neck. With a final effort, Diana tosses the snake away and shakes her hands, trying to rid herself of the encounter. As morning breaks, a cargo train rumbles past a rusty, disheveled station. Diana sits nearby, applying makeup with careful precision, while Sandy lies on a bench, his khakis dirt-covered and worn. He stirs awake, instinctively reaching for his neck, feeling the tender spot where the snake had bitten him. Diana watches him with a smile, her eyes following him as he gets up and walks away. He moves toward the ticket booth, his steps purposeful, but pauses to look back at Diana, pacing as he contemplates their next move."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "He sees the skiptracer groggily lying against the wheel through the passenger side window as Diana, with blood dripping from her nose, rolls out and hugs him. A tractor-trailer demolishes the rental car, leaving Sandy staring at the wreckage before nodding softly at Diana. Later, he drives a beat-up van down a narrow dirt road. In an office, Big Chuck's smile fades as Julian slams his head against the desk while eyeing the thugs. Meanwhile, Diana searches the van as Sandy pulls over due to the rising temperature gauge and steam from the hood. As Sandy props the hood open, Diana duct tapes the unconscious skiptracer. A state trooper directs traffic past Sandy's wrecked sedan, and Julian and Marisol overhear a witness as they drive by. Sandy, on his cell, walks with Diana along a deserted road, exchanging a look with her. At night, a pickup truck approaches, and they start a fire. Sandy lies beside the fire, with Diana snuggling up before pulling her arm away. A snake slithers into Sandy's pants, prompting him to spring up, fumble with his jeans, and toss them into the woods. Another snake drops onto his shoulders, tightening around his neck and biting him. Diana swings a stick at the snake, eventually prying it off Sandy and tossing it away. In the morning, a cargo train passes a rusty station as Diana applies makeup and Sandy, in dirt-covered khakis, wakes up and reaches for his neck. Diana smiles as he walks to the ticket booth, looking back at her and pacing."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Looking through the passenger side window, he sees the skiptracer, a private investigator hired to track debtors, lying groggily against the wheel. The side door bursts open and Diana, who had been a gymnast in college, rolls onto her feet. Blood drips from her nose, suggesting a recent altercation. She hugs him. He glances back as a tractor-trailer, a massive vehicle typically used for transporting large quantities of goods, plows through the rental car, tearing it to pieces. Sandy stands motionless with his gaze fixed on the wreckage of the vehicle he had rented from the town’s only car service. Sandy looks at her and softly nods, signaling a silent understanding. Later, he drives the beat-up van, a relic from the late 1980s, along a narrow dirt road lined with towering pines. In an office downtown, Big Chuck, a local crime boss known for his ruthless dealings, sits across from Marisol and Julian. Big Chuck's smile fades into a grimace. Chuck eyes the thugs, hardened men who have been his enforcers for years. Julian, known for his volatile temper, slams Chuck's head against the desk, demonstrating his dominance. Diana searches the van frantically for a first aid kit. The temperature gauge rises, indicating engine trouble, so Sandy pulls over as steam wafts from the hood, a common issue with the van due to a leaky radiator. Sandy steps out and approaches the steaming hood as Diana duct tapes the unconscious skiptracer, ensuring he won't escape. She takes a sip from a flask she carries for courage. She touches his pecs, feeling his heartbeat, as her nose grazes his beard that he hasn't shaved in days. Sandy props the hood open, letting steam vent out and cool the engine. He stares at the sign for an upcoming highway, realizing they need to keep moving, then opens the van. The skiptracer breathes deeply in his duct tape restraint, struggling against his bonds. Now, a state trooper waves on traffic past Sandy's wrecked sedan, which had been reported stolen. As Julian and Marisol cruise by, they overhear a witness recounting the chaotic scene. Now, Sandy talks on his cell to a contact who might help them, as he and Diana walk along a deserted road lined with tumbleweeds. He shoots Diana a look, silently telling her to be cautious. She looks away, understanding the gravity of their situation. At night, a pickup truck approaches, its headlights illuminating their path. Her thumbs, which ache from hours of gripping the steering wheel, massage the tension away. He shows her his phone, revealing a message from an ally. Later, they start a fire, using dry branches to keep warm. He looks up into the starry sky, and she shuts her eyes, weary from their journey. Sandy shrugs, resigned to their fate. Sandy lies on his side next to the fire, and Diana snuggles up behind him, seeking warmth against the chilly night. She pulls her arm away as a snake, native to this part of the country, slithers toward them. The snake moves closer, its scales glistening in the firelight. He glances back at Diana as the snake slithers into his pants, causing him to spring up and fumble with his jeans. He pushes his pants off, desperate to rid himself of the creature. Sandy tosses his jeans into the woods, not caring about their loss. A snake lowers from a tree, its eyes fixed on him. It drops onto his shoulders, startling him. She dips the stick into the fire, intending to use it as a torch. She swings the stick, aiming to frighten the snake. The snake tightens around his neck, sensing prey. The snake watches the flame, then bites into Sandy's neck, injecting venom. Diana whacks it with a stick, and Sandy drops to the ground, gasping for air. She hits it a few more times, then tosses away the stick, which is now charred from the fire. Diana grabs the snake and tugs at it, as Sandy pries the reptile's teeth from his neck, fighting the pain. Diana tosses the snake away and shakes her hands, trembling from the adrenaline. In the morning, a cargo train passes by a rusty, disheveled station that hasn't been operational for years. Diana applies makeup while Sandy lies on a bench in a pair of dirt-covered khakis, which are the only clothes he has left. Sandy wakes up and reaches for his neck, feeling the bandaged wound. Diana watches him with a smile, relieved he's recovering. He walks away, contemplating their next move. He moves to the ticket booth, hoping to buy a ticket with the little cash they have. He looks back at Diana and paces, torn between staying with her and continuing their dangerous journey alone."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Looking through the passenger side window he sees the skiptracer lying groggily against the wheel  The side door bursts open and Diana rolls onto her feet  Blood drips from her nose  She hugs him  He glances back  A tractortrailer plows through the rental car tearing it to pieces  Sandy stands motionless with his gaze fixed on the wreckage  Sandy props the hood open and lets steam vent out  He stares at the sign then opens the van  The skiptracer breathes deeply in his duct tape restraint  Now a state trooper waves on traffic past Sandy's wrecked sedan  As Julian and Marisol cruise by they overhear a witness  Now Sandy talks on his cell as he and Diana walk along a deserted road  He shoots Diana a look  She looks away  At night a pickup truck approaches Her thumbs  He shows her his phone  Later they start a fire  He looks up and she shuts her eyes  Sandy shrugs  Sandy lies on his side next to the fire and Diana snuggles up behind him  She pulls her arm away  A snake slithers toward them  The snake moves closer  He glances back at Diana as the snake slithers into his pants  He springs up and fumbles with his jeans  He pushes his pants off  Sandy tosses his jeans into the woods  A snake lowers from a tree  It drops onto his shoulders  She dips the stick into the fire  She swings the stick  The snake tightens around his neck  The snake watches the flame then bites into Sandy's neck  Diana whacks it with a stick and Sandy drops to the ground  She hits it a few more times then tosses away the stick  Diana grabs the snake and tugs at it as Sandy pries the reptile's teeth from his neck  Sandy looks at her and softly nods  Later he drives the beatup van along a narrow dirt road  In an office Big Chuck sits across from Marisol and Julian  Big Chuck's smile fades  Chuck eyes the thugs  Julian slams Chuck's head against the desk  Diana searches the van  The temperature gauge rises  Sandy pulls over as steam wafts from the hood  Sandy steps out and approaches the steaming hood as Diana duct tapes the unconscious skiptracer  She takes a sip  She touches his pecs  Her nose grazes his beard  Sandy props the hood open and lets steam vent out  He stares at the sign then opens the van  The skiptracer breathes deeply in his duct tape restraint  Now a state trooper waves on traffic past Sandy's wrecked sedan  As Julian and Marisol cruise by they overhear a witness  Now Sandy talks on his cell as he and Diana walk along a deserted road  He shoots Diana a look  She looks away  At night a pickup truck approaches Her thumbs  He shows her his phone  Later they start a fire  He looks up and she shuts her eyes  Sandy shrugs  Sandy lies on his side next to the fire and Diana snuggles up behind him  She pulls her arm away  A snake slithers toward them  The snake moves closer  He glances back at Diana as the snake slithers into his pants  He springs up and fumbles with his jeans  He pushes his pants off  Sandy tosses his jeans into the woods  A snake lowers from a tree  It drops onto his shoulders  She dips the stick into the fire  She swings the stick  The snake tightens around his neck  The snake watches the flame then bites into Sandy's neck  Diana whacks it with a stick and Sandy drops to the ground  She hits it a few more times then tosses away the stick  Diana grabs the snake and tugs at it as Sandy pries the reptile's teeth from his neck  Diana tosses the snake away and shakes her hands  In the morning a cargo train passes by a rusty disheveled station  Diana applies makeup while  Sandy lies on a bench in a pair of dirtcovered khakis  Sandy wakes up and reaches for his neck  Diana watches him with a smile  He walks away  He moves to the ticket booth  He looks back at Diana and paces"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Looking through the passenger side window he sees the skiptracer lying groggily against the wheel. The side door bursts open and Diana rolls onto her feet. Blood drips from her nose. She hugs him. He glances back. A tractortrailer plows through the rental car tearing it to pieces. Sandy stands motionless with his gaze fixed on the wreckage. Sandy looks at her and softly nods. Later he drives the beatup van along a narrow dirt road. In an office Big Chuck sits across from Marisol and Julian. Big Chuck's smile fades. Chuck eyes the thugs. Julian slams Chuck's head against the desk. Diana searches the van. The temperature gauge rises. Sandy pulls over as steam wafts from the hood. Sandy steps out and approaches the steaming hood as Diana duct tapes the unconscious skiptracer. She takes a sip. She touches his pecs. Her nose grazes his beard. Sandy props the hood open and let us steam vent out. He stares at the sign then opens the van. The skiptracer breathes deeply in his duct tape restraint. Now a state trooper waves on traffic past Sandy's wrecked sedan. As Julian and Marisol cruise by they overhear a witness. Now Sandy talks on his cell as he and Diana walk along a deserted road. He shoots Diana a look. She looks away. At night a pickup truck approaches Her thumbs. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. He shows her his phone. Later they start a fire. He looks up and she shuts her eyes. Sandy shrugs. Sandy lies on his side next to the fire and Diana snuggles up behind him. She pulls her arm away. A snake slithers toward them. The snake moves closer. He glances back at Diana as the snake slithers into his pants. He springs up and fumbles with his jeans. He pushes his pants off. Sandy tosses his jeans into the woods. A snake lowers from a tree. It drops onto his shoulders. She dips the stick into the fire. She swings the stick. The snake tightens around his neck. The snake watches the flame then bites into Sandy's neck. Diana whacks it with a stick and Sandy drops to the ground. She hits it a few more times then tosses away the stick. Diana grabs the snake and tugs at it as Sandy pries the reptile's teeth from his neck. Diana tosses the snake away and shakes her hands. In the morning a cargo train passes by a rusty disheveled station. Diana applies makeup while. Sandy lies on a bench in a pair of dirtcovered khakis. Sandy wakes up and reaches for his neck. Diana watches him with a smile. He walks away. He moves to the ticket booth. He looks back at Diana and paces."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Looking through the passenger side window he sees the skiptracer lying groggily against the wheel. The side door bursts open and Diana rolls onto her feet. Blood drips from her nose. She hugs him. He glances back. A tractortrailer plows through the rental car tearing it to pieces. Sandy stands motionless with his gaze fixed on the wreckage. Sandy looks at her and softly nods. Later he drives the beatup van along a narrow dirt road. In an office Big Chuck sits across from Marisol and Julian. Big Chuck's smile fades. Chuck eyes the thugs. Julian slams Chuck's head against the desk. Diana searches the van. The temperature gauge rises. Sandy pulls over as steam wafts from the hood. Sandy steps out and approaches the steaming hood as Diana duct tapes the unconscious skiptracer. She takes a sip. She touches his pecs. Her nose grazes his beard. Sandy props the hood open and let us steam vent out. He stares at the sign then opens the van. The skiptracer breathes deeply in his duct tape restraint. Now a state trooper waves on traffic past Sandy's wrecked sedan. As Julian and Marisol cruise by they overhear a witness. Now Sandy talks on his cell as he and Diana walk along a deserted road. He shoots Diana a look. She looks away. At night a pickup truck approaches Her thumbs. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. He shows her his phone. Later they start a fire. He looks up and she shuts her eyes. Sandy shrugs. Sandy lies on his side next to the fire and Diana snuggles up behind him. She pulls her arm away. A snake slithers toward them. The snake moves closer. He glances back at Diana as the snake slithers into his pants. He springs up and fumbles with his jeans. He pushes his pants off. Sandy tosses his jeans into the woods. A snake lowers from a tree. It drops onto his shoulders. She dips the stick into the fire. She swings the stick. The snake tightens around his neck. The snake watches the flame then bites into Sandy's neck. Diana whacks it with a stick and Sandy drops to the ground. She hits it a few more times then tosses away the stick. Diana grabs the snake and tugs at it as Sandy pries the reptile's teeth from his neck. Diana tosses the snake away and shakes her hands. In the morning a cargo train passes by a rusty disheveled station. Diana applies makeup while. Sandy lies on a bench in a pair of dirtcovered khakis. Sandy wakes up and reaches for his neck. Diana watches him with a smile. He walks away. He moves to the ticket booth. He looks back at Diana and paces."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Looking through the passenger side window he sees the skiptracer lying groggily against the wheel. The side door bursts open and Diana rolls onto her feet. Blood drips from her nose. She hugs him. He glances back. A tractortrailer plows through the rental car tearing it to pieces. Sandy stands motionless with his gaze fixed on the wreckage. Sandy looks at her and softly nods. Later he drives the beatup van along a narrow dirt road. In an office Big Chuck sits across from Marisol and Julian. Big Chuck's smile fades. Chuck eyes the thugs. Julian slams Chuck's head against the desk. Diana searches the van. The temperature gauge rises. She swings the stick. The snake tightens around his neck. The snake watches the flame then bites into Sandy's neck. Diana whacks it with a stick and Sandy drops to the ground. She hits it a few more times then tosses away the stick. Diana grabs the snake and tugs at it as Sandy pries the reptile's teeth from his neck. Diana tosses the snake away and shakes her hands. In the morning a cargo train passes by a rusty disheveled station. Diana applies makeup while. Sandy lies on a bench in a pair of dirtcovered khakis. Sandy wakes up and reaches for his neck. Diana watches him with a smile. He walks away. He moves to the ticket booth. He looks back at Diana and paces."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Looking through the passenger side window he sees the skiptracer lying groggily against the wheel. The side door bursts open and Diana rolls onto her feet. Blood drips from her nose. She hugs him. He glances back. A tractortrailer plows through the rental car tearing it to pieces. Sandy lies on a bench in a pair of dirtcovered khakis. Sandy wakes up and reaches for his neck. Diana watches him with a smile. He walks away. He moves to the ticket booth. He looks back at Diana and paces."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Looking through the passenger side window, the cat sees the skiptracer lying groggily against the wheel. The side door bursts open and an elephant rolls onto its feet. Blood drips from the elephant's nose. The elephant hugs the cat. The cat glances back. A tractor-trailer plows through the rental car, tearing it to pieces. A parrot stands motionless with its gaze fixed on the wreckage. The parrot looks at the elephant and softly nods. Later, a dog drives the beat-up van along a narrow dirt road. In an office, a giraffe sits across from Marisol and Julian. The giraffe's smile fades. The giraffe eyes the thugs. Julian slams the giraffe's head against the desk. An octopus searches the van. The temperature gauge rises. A rabbit pulls over as steam wafts from the hood. The rabbit steps out and approaches the steaming hood as the octopus duct tapes the unconscious skiptracer. The octopus takes a sip. The octopus touches the rabbit's pecs. The octopus's nose grazes the rabbit's beard. The rabbit props the hood open and lets steam vent out. The rabbit stares at the sign, then opens the van. The skiptracer breathes deeply in his duct tape restraint. Now, a zebra waves on traffic past the rabbit's wrecked sedan. As Julian and Marisol cruise by, they overhear a witness. Now, the rabbit talks on a cell as it and an elephant walk along a deserted road. The rabbit shoots the elephant a look. The elephant looks away. At night, a wolf approaches. The elephant's thumbs. The rabbit shows the elephant its phone. Later, they start a fire. The rabbit looks up and the elephant shuts its eyes. The rabbit shrugs. The rabbit lies on its side next to the fire, and the elephant snuggles up behind the rabbit. The elephant pulls its arm away. A turtle slithers toward them. The turtle moves closer. The rabbit glances back at the elephant as the turtle slithers into its pants. The rabbit springs up and fumbles with its jeans. The rabbit pushes its pants off. The rabbit tosses its jeans into the woods. A turtle lowers from a tree. It drops onto the rabbit's shoulders. The elephant dips the stick into the fire. The elephant swings the stick. The turtle tightens around the rabbit's neck. The turtle watches the flame, then bites into the rabbit's neck. The elephant whacks it with a stick, and the rabbit drops to the ground. The elephant hits it a few more times, then tosses away the stick. The elephant grabs the turtle and tugs at it, as the rabbit pries the reptile's teeth from its neck. The elephant tosses the turtle away and shakes its hands. In the morning, a horse passes by a rusty disheveled station. The elephant applies makeup while the rabbit lies on a bench in a pair of dirt-covered khakis. The rabbit wakes up and reaches for its neck. The elephant watches the rabbit with a smile. The rabbit walks away. The rabbit moves to the ticket booth. The rabbit looks back at the elephant and paces."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Looking through the passenger side window, he sees the investigator lying groggily against the dashboard. The cargo door bursts open and Diana rolls onto her feet. Ink drips from her chin. She hugs him. He glances back. A fire engine plows through the tour bus, tearing it to pieces. Sandy stands motionless with his gaze fixed on the wreckage. Sandy looks at her and softly nods. Later, he drives the beat-up bicycle along a narrow cobblestone path. In an apartment, Big Chuck sits across from Marisol and Julian. Big Chuck's smile fades. Chuck eyes the assistants. Julian slams Chuck's head against the shelf. Diana searches the bicycle. The fuel gauge rises. Sandy pulls over as confetti wafts from the trunk. Sandy steps out and approaches the confetti-filled trunk as Diana duct tapes the unconscious investigator. She takes a sip. She touches his shoulders. Her nose grazes his cheek. Sandy props the trunk open and lets confetti spill out. He stares at the billboard, then opens the bicycle. The investigator breathes deeply in his duct tape restraint. Now, a traffic warden waves on traffic past Sandy's broken skateboard. As Julian and Marisol cruise by, they overhear a bystander. Now, Sandy talks on his radio as he and Diana walk along a deserted alley. He shoots Diana a look. She looks away. At night, a scooter approaches. Her elbows. He shows her his tablet. Later, they start a campfire. He looks up and she shuts her eyes. Sandy shrugs. Sandy lies on his side next to the campfire, and Diana snuggles up behind him. She pulls her arm away. A lizard slithers toward them. The lizard moves closer. He glances back at Diana as the lizard slithers into his pants. He springs up and fumbles with his jeans. He pushes his pants off. Sandy tosses his jeans into the bushes. A lizard lowers from a bush. It drops onto his shoulders. She dips the branch into the fire. She swings the branch. The lizard tightens around his neck. The lizard watches the flame, then bites into Sandy's neck. Diana whacks it with a branch, and Sandy drops to the ground. She hits it a few more times, then tosses away the branch. Diana grabs the lizard and tugs at it, as Sandy pries the reptile's teeth from his neck. Diana tosses the lizard away and shakes her hands. In the morning, a freight truck passes by a rusty disheveled warehouse. Diana applies cream while Sandy lies on a bench in a pair of grass-stained trousers. Sandy wakes up and reaches for his neck. Diana watches him with a smile. He walks away. He moves to the kiosk. He looks back at Diana and paces."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Looking through the passenger side window, he watches the skiptracer slumped groggily against the wheel. The side door swings open and Diana bounces onto her feet. Blood trickles from her nose. She pats him on the back. He turns around. A tractor-trailer skids past the rental car, skimming it slightly. Sandy stands motionless with his gaze fixed on the aftermath. Sandy glances at her and subtly salutes. Later, he guides the beat-up van along a narrow dirt road. In an office, Big Chuck lounges across from Marisol and Julian. Big Chuck's grin diminishes. Chuck observes the thugs. Julian taps Chuck's head against the desk. Diana examines the van. The temperature gauge dips. Sandy pulls over as steam billows from the hood. Sandy leaps out and examines the steaming hood as Diana bandages the unconscious skiptracer. She takes a gulp. She brushes his pecs. Her nose skim his beard. Sandy holds the hood open and watches steam drift out. He contemplates the sign, then enters the van. The skiptracer inhales deeply in his duct tape cocoon. Now, a state trooper signals traffic past Sandy's mangled sedan. As Julian and Marisol drive by, they catch a fragment of a witness's statement. Now, Sandy texts on his cell as he and Diana amble along a deserted road. He gives Diana a nod. She glances away. At night, a pickup truck trundles near. Her thumbs twiddle. He shows her his phone. Later, they extinguish a fire. He peers up and she closes her eyes. Sandy shrugs. Sandy rests on his side next to the fire, and Diana curls up behind him. She retracts her arm. A snake glides toward them. The snake approaches nearer. He turns toward Diana as the snake slips into his pants. He bolts upright and struggles with his jeans. He shuffles his pants off. Sandy flings his jeans into the woods. A snake descends from a tree. It drops onto his back. She prods the stick into the fire. She waves the stick. The snake loosens around his neck. The snake gazes at the flame, then nibbles on Sandy's neck. Diana jabs it with a stick, and Sandy collapses to the ground. She strikes it a few more times, then drops the stick. Diana grabs the snake and yanks it, as Sandy dislodges the reptile's fangs from his neck. Diana flings the snake away and dusts off her hands. In the morning, a cargo train rolls by a rusty disheveled station. Diana applies makeup while Sandy sprawls on a bench in a pair of dirt-smeared khakis. Sandy stirs awake and rubs his neck. Diana observes him with a grin. He strolls away. He wanders to the ticket booth. He glances back at Diana and paces anew."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Looking through the aquarium lid, the mailbox sees the chandelier lying groggily against the bookshelf. The floor mat bursts open and the cactus rolls onto its wheels. Sand trickles from its elbow. It hugs the mailbox. The mailbox glances back. A snowblower plows through the bicycle pump, tearing it to pieces. A pencil sharpener stands motionless with its gaze fixed on the wreckage. The pencil sharpener looks at the cactus and softly nods. Later, it pushes the beat-up wheelbarrow along a narrow garden path. In a factory, Tall Tim sits across from a notebook and a violin. Tall Tim's grin fades. Tim eyes the scissors. The violin slams Tim's chair against the wall. The cactus searches the wheelbarrow. The pressure gauge rises. The pencil sharpener pulls over as steam wafts from the grill. The pencil sharpener steps out and approaches the steaming grill as the cactus duct tapes the unconscious chandelier. It takes a sip. It touches the mailbox's shingles. Its elbow grazes the mailbox's hat. The pencil sharpener props the grill open and lets steam vent out. It stares at the billboard, then opens the wheelbarrow. The chandelier breathes deeply in its duct tape restraint. Now, an astronaut waves on pedestrians past the pencil sharpener's wrecked tricycle. As the violin and notebook cruise by, they overhear a sunflower. Now, the pencil sharpener talks on its radio as it and the cactus walk along a deserted path. It shoots the cactus a look. It looks away. At night, a locomotive approaches. Its knuckles. It shows its map. Later, they start an explosion. It looks up and the cactus shuts its eyes. The pencil sharpener shrugs. The pencil sharpener lies on its back next to the explosion, and the cactus snuggles up behind it. It pulls its arm away. A frisbee glides toward them. The frisbee moves closer. The mailbox glances back at the cactus as the frisbee glides into its pocket. It springs up and fumbles with its buttons. It pushes its buttons off. The pencil sharpener tosses its buttons into the valley. A frisbee lowers from a vine. It drops onto its goggles. The cactus dips the spoon into the explosion. It swings the spoon. The frisbee tightens around its ankle. The frisbee watches the flare, then bites into the pencil sharpener's ankle. The cactus whacks it with a spoon, and the pencil sharpener drops to the ground. The cactus hits it a few more times, then tosses away the spoon. The cactus grabs the frisbee and tugs at it, as the pencil sharpener pries the knick-knack's spoons from its ankle. The cactus tosses the frisbee away and shakes its knuckles. In the morning, a seesaw passes by a rusty disheveled warehouse. The cactus applies lotion while the pencil sharpener lies on a lounge chair in a pair of dirt-covered loafers. The pencil sharpener wakes up and reaches for its ankle. The cactus watches it with a grin. It walks away. It moves to the service kiosk. It looks back at the cactus and paces."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Peering through the passenger side window, the dog observes the firefighter lounging lazily against the wheel. The rear door flings open and Rachel tumbles onto her feet. Water drips from her forehead. She high-fives him. The dog glances back. A motorcycle zooms through the rental car, shredding it to pieces. Taylor stands frozen with his gaze fixed on the wreckage. Taylor glances at Rachel and lightly shrugs. Later, he navigates the beat-up convertible along a narrow mountain trail. In a library, Little Joe sits across from Carmen and Felix. Little Joe's smile vanishes. Joe surveys the journalists. Felix smacks Joe's head against the bookshelf. Rachel investigates the convertible. The fuel gauge plummets. Taylor pulls over as exhaust wafts from the trunk. Taylor climbs out and strides toward the smoking trunk as Rachel bandages the unconscious firefighter. She takes a gulp. She pats his shoulders. Her nose grazes his jacket. Taylor props the trunk open and lets exhaust escape. He gazes at the billboard, then examines the convertible. The firefighter breathes heavily in his bandaged state. Now, a park ranger directs traffic past Taylor's wrecked bicycle. As Carmen and Felix coast by, they overhear an onlooker. Now, Taylor chats on his cell as he and Rachel stroll along an abandoned trail. He throws Rachel a glance. She looks away. At night, a bicycle approaches. Her fingers. He shows her his map. Later, they ignite a lantern. He gazes upward and she shuts her eyes. Taylor shrugs. Taylor rolls onto his back next to the lantern, and Rachel cuddles up beside him. She pulls her arm away. A lizard creeps toward them. The lizard sneaks closer. The dog glances back at Rachel as the lizard crawls into his pocket. He leaps up and fiddles with his coat. He sheds his jacket. Taylor flings his jacket into the bushes. A lizard drops from a branch. It lands onto his back. She dips the stick into the lantern. She waves the stick. The lizard coils around his chest. The lizard eyes the flicker, then chomps onto Taylor's shoulder. Rachel smacks it with a branch, and Taylor collapses to the ground. She strikes it a few more times, then discards the branch. Rachel grabs the lizard and tugs at it, as Taylor loosens the creature's grip from his shoulder. Rachel flings the lizard away and wipes her hands. In the morning, a trolley coasts by a rusty abandoned warehouse. Rachel applies moisturizer while Taylor rests on a bench in a pair of dust-covered jeans. Taylor awakens and reaches for his shoulder. Rachel observes him with a grin. He wanders away. He proceeds to the snack stand. He looks back at Rachel and circles."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Looking through the passenger side mirror, he notices the mechanic lounging drowsily against the seat. The rear hatch flings open and Diana bounces onto her knees. Ink dribbles from her chin. She pats him. He peers back. A bulldozer crashes through the bicycle, shredding it to bits. Sandy stands immobile with his gaze locked on the debris. Sandy glances at her and quietly winks. Later, he pedals the battered scooter along a winding gravel path. In a warehouse, Big Chuck leans across from Marisol and Julian. Big Chuck's grin vanishes. Chuck observes the henchmen. Julian bangs Chuck's elbow against the table. Diana scans the scooter. The fuel indicator climbs. Sandy pulls aside as smoke puffs from the exhaust. Sandy hops out and advances toward the smoky exhaust as Diana zip ties the sleeping mechanic. She takes a gulp. She brushes his shoulders. Her forehead grazes his ear. Sandy props the exhaust open and lets smoke escape. He gazes at the banner, then slides the scooter. The mechanic breathes shallowly in his zip tie bind. Now, a park ranger waves on hikers past Sandy's overturned wagon. As Julian and Marisol glide by, they overhear a bystander. Now, Sandy chats on his radio as he and Diana march along a vacant path. He throws Diana a glance. She turns aside. At dusk, a motorbike rolls up. Her knuckles. He shows her his map. Later, they kindle a torch. He peers upward and she closes her eyes. Sandy sighs. Sandy lies on his back next to the torch, and Diana curls up beside him. She lifts her hand away. A lizard crawls toward them. The lizard slinks closer. He looks back at Diana as the lizard wriggles into his coat. He leaps up and struggles with his jacket. He slips his coat off. Sandy flings his jacket into the bushes. A lizard descends from a branch. It climbs onto his back. She dips the brush into the torch. She flails the brush. The lizard coils around his arm. The lizard eyes the blaze, then snaps at Sandy's arm. Diana swats it with a brush, and Sandy falls to the earth. She hits it several more times, then chucks away the brush. Diana seizes the lizard and pulls at it, as Sandy pulls the creature's jaws from his arm. Diana throws the lizard away and rubs her palms. At dawn, a freight car rolls past a rusted cluttered shack. Diana applies lotion while Sandy reclines on a bench in a pair of mud-splattered shorts. Sandy stirs and touches his arm. Diana observes him with a grin. He saunters off. He heads to the vending machine. He glances back at Diana and dawdles."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Peering through the submarine hatch, she notices the loggerhead turtle floating lazily near the periscope. The airlock swings open, and Alex leaps onto his hands. Glitter falls from his ear. He salutes her. She peers forward. A freight ship crashes into the kayak, shredding it to scraps. Morgan stands frozen with her gaze fixed on the debris. Morgan glances at him and silently winks. Later, she sails the rusted skiff along a winding creek. In a barn, Little Joe perches beside Felicia and Hector. Little Joe's frown brightens. Joe examines the clowns. Hector taps Joe's foot against the crate. Alex scavenges the skiff. The oil gauge drops. Morgan halts as smoke curls from the mast. Morgan leaps in and examines the smoking mast as Alex zip ties the snoring loggerhead turtle. He takes a gulp. He pats her ankle. His hand brushes her hair. Morgan lifts the mast open and lets smoke billow out. She squints at the billboard, then closes the skiff. The loggerhead turtle snores peacefully in his zip tie cocoon. Meanwhile, a forest ranger signals for joggers past Morgan's dented moped. As Hector and Felicia drift by, they overhear a pedestrian. Now, Morgan texts on her pager as she and Alex stroll beside an abandoned path. She gives Alex a glance. He turns away. By twilight, a minivan draws near. His fingers. She shows him her map. Eventually, they ignite a lantern. She gazes up and he closes his eyes. Morgan shrugs. Morgan curls on his back beside the lantern, and Alex nestles up behind her. He draws his hand back. A lizard scampers toward them. The lizard scurries closer. She peers over at Alex as the lizard wriggles into her shirt. She jumps up and fiddles with her blouse. She tosses her blouse into the canyon. A lizard descends from a cliff. It lands on her elbows. He dips the branch into the lantern. He waves the branch. The lizard squeezes around her wrist. The lizard eyes the glow, then latches onto Morgan's wrist. Alex strikes it with a branch, and Morgan slumps to the ground. He strikes it a few more times, then throws aside the branch. Alex seizes the lizard and wrenches it, as Morgan pulls the creature's claws from her wrist. Alex flings the lizard away and wipes his fingers. At dawn, a coal train rumbles past a decayed ramshackle depot. Alex powders his face while Morgan stretches on a bench in a pair of leaf-strewn overalls. Morgan wakes up and touches her wrist. Alex observes him with a grin. She strolls away. She meanders to the snack stand. She glances back at Alex and lingers."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Sandy sees a groggy skiptracer beside a wheel and Diana, bleeding, rushes to him. A tractor-trailer destroys the rental car as Sandy stands motionless. Later, Sandy drives a van while Big Chuck faces trouble in an office with Marisol and Julian. Diana searches the van as it overheats, and Sandy deals with the hood as Diana ties the skiptracer. A state trooper directs traffic past Sandy's wrecked sedan, and Diana and Sandy walk along a deserted road. They start a fire at night, and a snake enters Sandy's pants, then attacks him. Diana saves him by using a stick, eventually tossing the snake away. In the morning, a train passes a rusty station where Diana applies makeup and Sandy, waking up, touches his neck. He walks toward the ticket booth, looking back at Diana who watches with a smile."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "He looks back at Diana and paces He moves to the ticket booth  He walks away  Diana watches him with a smile  Sandy wakes up and reaches for his neck  Sandy lies on a bench in a pair of dirtcovered khakis  Diana applies makeup while  In the morning a cargo train passes by a rusty disheveled station  Diana tosses the snake away and shakes her hands  Diana grabs the snake and tugs at it as Sandy pries the reptile's teeth from his neck  She hits it a few more times then tosses away the stick  Diana whacks it with a stick and Sandy drops to the ground  The snake watches the flame then bites into Sandy's neck  The snake tightens around his neck  She swings the stick  She dips the stick into the fire  It drops onto his shoulders  A snake lowers from a tree  Sandy tosses his jeans into the woods  He pushes his pants off  He springs up and fumbles with his jeans  He glances back at Diana as the snake slithers into his pants  The snake moves closer  A snake slithers toward them  She pulls her arm away  Sandy lies on his side next to the fire and Diana snuggles up behind him  Sandy shrugs  He looks up and she shuts her eyes  Later they start a fire  He shows her his phone  At night a pickup truck approaches Her thumbs  She looks away  He shoots Diana a look  Now Sandy talks on his cell as he and Diana walk along a deserted road  As Julian and Marisol cruise by they overhear a witness  Now a state trooper waves on traffic past Sandy's wrecked sedan  The skiptracer breathes deeply in his duct tape restraint  He stares at the sign then opens the van  Sandy props the hood open and lets steam vent out  Her nose grazes his beard  She touches his pecs  She takes a sip  Sandy steps out and approaches the steaming hood as Diana duct tapes the unconscious skiptracer  Sandy pulls over as steam wafts from the hood  The temperature gauge rises  Diana searches the van  Julian slams Chuck's head against the desk  Chuck eyes the thugs  Big Chuck's smile fades  In an office Big Chuck sits across from Marisol and Julian  Later he drives the beatup van along a narrow dirt road  Sandy looks at her and softly nods  Sandy stands motionless with his gaze fixed on the wreckage  A tractortrailer plows through the rental car tearing it to pieces  He glances back  She hugs him  Blood drips from her nose  The side door bursts open and Diana rolls onto her feet  Looking through the passenger side window he sees the skiptracer lying groggily against the wheel "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Looking through the passenger side window he sees the skiptracer lying groggily against the wheel  Her nose grazes his beard  In the morning a cargo train passes by a rusty disheveled station  He glances back at Diana as the snake slithers into his pants  He shoots Diana a look  Sandy steps out and approaches the steaming hood as Diana duct tapes the unconscious skiptracer  At night a pickup truck approaches Her thumbs  He pushes his pants off  A snake slithers toward them  He looks up and she shuts her eyes  She hugs him  Diana tosses the snake away and shakes her hands  Chuck eyes the thugs  In an office Big Chuck sits across from Marisol and Julian  Diana applies makeup while  She hits it a few more times then tosses away the stick  Diana watches him with a smile  Later they start a fire  He looks back at Diana and paces A snake lowers from a tree  She looks away  Now Sandy talks on his cell as he and Diana walk along a deserted road  The side door bursts open and Diana rolls onto her feet  Sandy lies on his side next to the fire and Diana snuggles up behind him  He stares at the sign then opens the van  Sandy looks at her and softly nods  He springs up and fumbles with his jeans  She swings the stick  Sandy props the hood open and lets steam vent out  Sandy shrugs  Later he drives the beatup van along a narrow dirt road  Diana whacks it with a stick and Sandy drops to the ground  He moves to the ticket booth  The snake moves closer  Sandy pulls over as steam wafts from the hood  She pulls her arm away  Sandy wakes up and reaches for his neck  He walks away  The snake watches the flame then bites into Sandy's neck  Diana searches the van  The skiptracer breathes deeply in his duct tape restraint  She dips the stick into the fire  Big Chuck's smile fades  Now a state trooper waves on traffic past Sandy's wrecked sedan  Sandy tosses his jeans into the woods  He shows her his phone  She takes a sip  As Julian and Marisol cruise by they overhear a witness  Sandy stands motionless with his gaze fixed on the wreckage  Sandy lies on a bench in a pair of dirtcovered khakis  A tractortrailer plows through the rental car tearing it to pieces  She touches his pecs  Diana grabs the snake and tugs at it as Sandy pries the reptile's teeth from his neck  The temperature gauge rises  It drops onto his shoulders  Blood drips from her nose  He glances back  The snake tightens around his neck  Julian slams Chuck's head against the desk "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Later they start a fire  He looks up and she shuts her eyes  Sandy shrugs  Sandy lies on his side next to the fire and Diana snuggles up behind him  She pulls her arm away  A snake slithers toward them  The snake moves closer  He glances back at Diana as the snake slithers into his pants  He springs up and fumbles with his jeans  He pushes his pants off  Sandy tosses his jeans into the woods  A snake lowers from a tree  It drops onto his shoulders  She dips the stick into the fire  She swings the stick  The snake tightens around his neck  The snake watches the flame then bites into Sandy's neck  Diana whacks it with a stick and Sandy drops to the ground  She hits it a few more times then tosses away the stick  Diana grabs the snake and tugs at it as Sandy pries the reptile's teeth from his neck  Diana tosses the snake away and shakes her hands  In the morning a cargo train passes by a rusty disheveled station  Diana applies makeup while  Sandy lies on a bench in a pair of dirtcovered khakis  Sandy wakes up and reaches for his neck  Diana watches him with a smile  He walks away  He moves to the ticket booth  He looks back at Diana and paces Looking through the passenger side window he sees the skiptracer lying groggily against the wheel  The side door bursts open and Diana rolls onto her feet  Blood drips from her nose  She hugs him  He glances back  A tractortrailer plows through the rental car tearing it to pieces  Sandy stands motionless with his gaze fixed on the wreckage  Sandy looks at her and softly nods  Later he drives the beatup van along a narrow dirt road  In an office Big Chuck sits across from Marisol and Julian  Big Chuck's smile fades  Chuck eyes the thugs  Julian slams Chuck's head against the desk  Diana searches the van  The temperature gauge rises  Sandy pulls over as steam wafts from the hood  Sandy steps out and approaches the steaming hood as Diana duct tapes the unconscious skiptracer  She takes a sip  She touches his pecs  Her nose grazes his beard  Sandy props the hood open and lets steam vent out  He stares at the sign then opens the van  The skiptracer breathes deeply in his duct tape restraint  Now a state trooper waves on traffic past Sandy's wrecked sedan  As Julian and Marisol cruise by they overhear a witness  Now Sandy talks on his cell as he and Diana walk along a deserted road  He shoots Diana a look  She looks away  At night a pickup truck approaches Her thumbs  He shows her his phone "
        }
      ]
    }
  ]
}