{
  "ground_truth": "Dark clouds cover half of the bright moon as a figure hurtles dying towards the ground. Long, bony fingers caress the street as the black-tied figure rises to its feet, revealing a slight man in his 30s with blood streaking the right side of his face, blond cropped hair, and a thick collar. He stares at lights in the sky which go out as rain falls. He throws himself against the wall and huddles beside it, holding out a broad-bladed dagger and pointing it in the direction of a barking dog behind a wire fence. The man rips open his black top, revealing a thin, toned body with tattoos and blood aligned with the streak on his face. He walks towards the dog in its pound, raises the dagger above his head, and brings it down with great force. A bright light shines on him, and a blue light ring falls over him, opening the collar around his neck, which falls to the ground. Rain washes blood across the ground and into a drain. Inside a building, a man in a suit carrying a torch walks between stacking shelves, some covered with cellophane, steps on a toy under a skylight, and bends down to pick it up. The man in the black coat jumps through the skylight onto him, knocking him and his torch to the floor. The man from the sky goes to a grubby men's room, removes his coat, opens a first aid box, uses a thread and a bent needle to stitch a nasty wound on his back with flesh torn away at shoulder level, watches his reflection in a mirror as he sews, and grasps the sink with his bloody hand as his blood drips on the floor. Now dressed, he marches to a door, removes a chain, switches on lights in an armory, and is dressed in black shirt, trousers, and light coat. He picks up two assault rifles with grenade launchers, a selection of assault and sniper rifles, and walks out of the armory with two bags in his hands. He reaches a door with a metal bar across it as two cops, Burton and Estevez, drive along a downtown street. The burlier of the two, Burton, glances out as they pass people on the sidewalk and holds up his fingers in the shape of a gun. A door explodes just in front of them, and a man is hurled into the air, creating a hole in the shape of a cross in the building. They watch as the man from the sky steps into the flaming surround, and Burton gets out and draws his gun.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Dark thunderheads conceal half of the luminous moon as a silhouette plunges lifeless towards the terrain. Long, skeletal digits stroke the avenue as the ebony-tied shape ascends to its feet, disclosing a slight individual in his 30s with gore streaking the right side of his visage, fair cropped locks, and a substantial collar. He gazes at illuminations in the firmament which extinguish as precipitation falls. He flings himself against the barrier and crouches beside it, presenting a broad-bladed stiletto and directing it in the direction of a yelping canine behind a wire enclosure. The individual tears open his sable shirt, unveiling a slender, honed physique with tattoos and gore aligned with the streak on his visage. He strides towards the canine in its pen, elevates the stiletto above his head, and brings it down with immense force. A radiant illumination beams on him, and a cerulean light ring descends over him, releasing the collar around his neck, which drops to the terrain. Precipitation rinses blood across the terrain and into a gutter. Inside a structure, an individual in a suit bearing a flashlight strides between stacking shelves, some shrouded with cellophane, steps on a toy under a skylight, and stoops to retrieve it. The individual in the sable coat leaps through the skylight onto him, toppling him and his flashlight to the flooring. The individual from the firmament proceeds to a dingy men's room, removes his coat, opens a first aid box, utilizes a thread and a bent needle to stitch a vicious injury on his back with flesh rent away at shoulder height, observes his image in a looking glass as he sews, and grasps the basin with his sanguine hand as his blood drips on the flooring. Now attired, he marches to an entrance, removes a chain, switches on illuminations in an armory, and is clad in sable shirt, trousers, and light coat. He picks up two assault rifles with grenade launchers, a selection of assault and sharpshooter rifles, and walks out of the armory with two sacks in his hands. He reaches an entrance with a metallic rod across it as two officers, Burton and Estevez, drive along a downtown avenue. The burlier of the two, Burton, glances out as they pass individuals on the walkway and holds up his digits in the shape of a firearm. An entrance detonates just in front of them, and an individual is hurled into the atmosphere, creating an aperture in the shape of a cross in the structure. They observe as the individual from the firmament steps into the blazing perimeter, and Burton gets out and draws his firearm."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The bright moon is covered by dark clouds as half of it is revealed, and the ground is hurtled towards by a figure dying. The street is caressed by long, bony fingers as the black-tied figure rises to its feet, revealing a slight man in his 30s with blond cropped hair, a thick collar, and blood streaking the right side of his face. Lights in the sky are stared at by him, which go out as rain falls. The wall is thrown against by him, and he huddles beside it, a broad-bladed dagger being held out and pointed in the direction of a barking dog behind a wire fence. His black top is ripped open by the man, revealing a thin, toned body with tattoos and blood aligned with the streak on his face. The dog in its pound is walked towards by him, and the dagger is raised above his head and brought down with great force. He is shone on by a bright light, and a blue light ring falls over him, opening the collar around his neck, which falls to the ground. Blood is washed across the ground and into a drain by the rain. Inside a building, shelves are stacked between by a man in a suit carrying a torch, some covered with cellophane, and he steps on a toy under a skylight and bends down to pick it up. The skylight is jumped through by the man in the black coat onto him, knocking him and his torch to the floor. The grubby men's room is gone to by the man from the sky, and his coat is removed. A first aid box is opened, and a nasty wound on his back is stitched with a thread and a bent needle, flesh torn away at shoulder level, his reflection in a mirror watched as he sews, and the sink grasped with his bloody hand as his blood drips on the floor. Now dressed, he marches to a door, removes a chain, and lights in an armory are switched on. He is dressed in a black shirt, trousers, and a light coat. Two assault rifles with grenade launchers, a selection of assault and sniper rifles are picked up by him, and two bags are carried out of the armory by him. A door with a metal bar across it is reached by him as Burton and Estevez, two cops, drive along a downtown street. As they pass people on the sidewalk, Burton, the burlier of the two, glances out and holds up his fingers in the shape of a gun. Just in front of them, a door explodes, and a man creates a hole in the shape of a cross in the building as he is hurled into the air. They watch the man from the sky step into the flaming surround, and Burton gets out and draws his gun."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Dark clouds obscure half the bright moon as a figure crashes to the ground. Bony fingers touch the street as the black-tied figure stands, revealing a slight man in his 30s with blood on his face, blond hair, and a thick collar. He eyes lights in the sky before rain falls. He leans against a wall, wielding a broad-bladed dagger toward a barking dog behind a wire fence. Tearing his black top, he exposes a thin, tattooed body with blood aligned with the face streak. He approaches the dog, raises the dagger, and forcefully strikes. A bright light shines, a blue ring drops, and his neck collar falls. Rain washes blood into a drain. Inside, a suited man with a flashlight moves between shelves, steps on a toy under a skylight, and bends to pick it up. The man in the black coat crashes through the skylight, toppling him and his flashlight. The sky man enters a grimy men's room, removes his coat, and stitches a wound on his back using a thread and needle, watching his reflection in a mirror. Dressed, he opens an armory, switches on lights, and dons a black shirt, trousers, and coat. He grabs two assault rifles with grenade launchers, and a selection of other rifles, leaving with two bags. Approaching a door with a metal bar, two cops, Burton and Estevez, drive downtown. Burton notices pedestrians and mimics a gun with his fingers. Ahead, a door explodes, sending a man into the air, creating a cross-shaped hole in the building. The sky man emerges from the flames, and Burton exits the car, drawing his gun."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Dark clouds partially obscure the bright moon as a figure crashes toward the ground. Long fingers touch the street as the black-tied figure stands, revealing a slight, 30-something man with blood on his face, short blond hair, and a thick collar. He stares at fading sky lights as rain falls, huddles against a wall, holding a broad-bladed dagger towards a barking dog behind a fence. He tears open his black top, exposing a toned, tattooed body matching the blood on his face, walks to the dog, raises the dagger, and strikes with force. A bright light and blue ring activate, releasing his collar, which drops. Rain washes blood into a drain. Inside a building, a suited man with a torch maneuvers between shelves, steps on a toy under a skylight, and bends to pick it up. The man in the black coat crashes through the skylight, knocking him and his torch down. The sky man goes to a men's room, removes his coat, stitches a wound on his back, and grasps the sink as blood drips. Now dressed, he enters an armory, dons a black outfit, grabs rifles, and leaves with two bags. He reaches a door with a metal bar as cops Burton and Estevez drive downtown. Burton glances out, shapes his fingers like a gun. A door explodes, hurling a man through, creating a cross-shaped hole. They watch the man from the sky step into flames, as Burton exits and draws his gun."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Dark, ominous clouds gradually obscure half of the radiant moon, casting an eerie shadow over the landscape as a mysterious figure plummets with alarming speed toward the earth. The figure's long, skeletal fingers reach out and gently touch the cold, unforgiving street as the black-tied individual swiftly rises to his feet. This reveals a somewhat slight man who appears to be in his 30s, with blond hair cropped close to his scalp. A streak of blood marks the right side of his face, contrasting starkly against his skin, while a thick collar encircles his neck. His eyes fixate on the lights in the sky, which extinguish one by one as rain begins to pour down in heavy sheets. Suddenly, he hurls himself against the nearby wall and crouches beside it, defensively holding out a broad-bladed dagger, which he points in the direction of a barking dog standing behind a wire fence. \n\nThe man abruptly tears open his black top, exposing a slender yet muscular physique adorned with numerous tattoos. These tattoos seem to align perfectly with the blood streak on his face. Determined, he strides toward the dog imprisoned in its pound, and with a swift, forceful motion, he raises the dagger high above his head and brings it down with resounding force. At that very moment, a dazzlingly bright light envelops him, and a shimmering blue ring of light descends over him. This light mysteriously causes the collar around his neck to release and fall to the ground with a clatter. Meanwhile, the relentless rain washes away the blood, allowing it to flow across the ground and disappear into a nearby drain.\n\nSimultaneously, inside a dimly lit building, a man clad in a suit, and equipped with a torch, navigates between towering shelves stacked with various goods, some wrapped in protective cellophane. As he strides purposefully under a skylight, he inadvertently steps on a child's toy and pauses to pick it up. In a sudden burst of movement, the man from the sky crashes through the skylight, landing forcefully on him, sending both the man and his torch sprawling across the floor. \n\nThe man from the sky then makes his way to a grimy men's restroom. There, he sheds his coat, opens a first aid kit, and, using a thread and bent needle, painstakingly stitches up a severe wound on his back where the flesh is torn away at shoulder level. He watches his reflection intently in a cracked mirror as he meticulously sews, gripping the sink with his bloody hand while crimson droplets fall to the floor. Now fully dressed, he resolutely marches to a door, removes a heavy chain, and switches on the lights in an armory. He is now dressed in a black shirt, trousers, and a light coat. He systematically selects two assault rifles equipped with grenade launchers, along with an assortment of assault and sniper rifles, and proceeds to exit the armory, carrying two heavy bags.\n\nHe approaches a sturdy door bolstered by a metal bar as two police officers, Burton and Estevez, drive cautiously along a bustling downtown street. Burton, the bulkier of the two, glances out the window as they pass by pedestrians on the sidewalk, making a playful gesture by holding up his fingers in the shape of a gun. Suddenly, the door in front of them explodes with a thunderous roar, and a man is violently propelled into the air, creating a cross-shaped hole in the building. They watch in wide-eyed disbelief as the man from the sky confidently steps into the flaming wreckage. Burton promptly exits the vehicle and draws his gun, ready for whatever may come next."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "As the dark, ominous clouds gradually move across the sky, they begin to obscure half of the radiant, glowing moon, casting an eerie and unsettling shadow over the entire landscape. In this dimly lit scene, a mysterious figure is seen plummeting with alarming speed toward the earth, creating an air of foreboding. The figure's long, skeletal fingers extend outward and gently touch the cold, unforgiving surface of the street as the black-tied individual swiftly rises to his feet. This action reveals a somewhat slight man, appearing to be in his 30s, with blond hair that is cropped close to his scalp. A streak of blood marks the right side of his face, contrasting starkly against his pale skin, while a thick collar encircles his neck. His eyes are fixated intently on the lights in the sky, which gradually extinguish one by one as the rain begins to pour down in heavy, relentless sheets. In a sudden, decisive motion, he hurls himself against a nearby wall and crouches defensively beside it, holding out a broad-bladed dagger that he points in the direction of a barking dog standing behind a wire fence.\n\nThe man abruptly tears open his black top, revealing a slender yet muscular physique that is adorned with numerous intricate tattoos. These tattoos seem to align perfectly with the bloodstreak on his face. With determination, he strides purposefully toward the dog that is imprisoned in its pound, and with a swift, forceful motion, he raises the dagger high above his head and brings it down with resounding force. At that very moment, a dazzlingly bright light envelops him entirely, and a shimmering blue ring of light descends over his form. This mysterious light causes the collar around his neck to release and fall to the ground with a clatter. Meanwhile, the relentless rain washes away the blood, allowing it to flow across the ground and disappear into a nearby drain.\n\nSimultaneously, within the confines of a dimly lit building, a man clad in a suit and equipped with a torch navigates carefully between towering shelves that are stacked with various goods, some of which are wrapped in protective cellophane. As he strides purposefully under a skylight, he inadvertently steps on a child's toy and pauses momentarily to pick it up. In a sudden, unexpected burst of movement, the man from the sky crashes through the skylight, landing forcefully upon him and sending both the man and his torch sprawling across the floor.\n\nThe man from the sky then makes his way to a grimy and unkempt men's restroom. There, he sheds his coat, opens a first aid kit, and using a thread and bent needle, painstakingly stitches up a severe wound on his back where the flesh is torn away at shoulder level. He watches his reflection intently in a cracked mirror as he meticulously sews, gripping the sink with his bloody hand while crimson droplets fall continuously to the floor. Now fully dressed, he resolutely marches to a door, removes a heavy chain, and switches on the lights in an armory. He is now dressed in a black shirt, trousers, and a light coat. He systematically selects two assault rifles equipped with grenade launchers, along with an assortment of assault and sniper rifles, and proceeds to exit the armory, carrying two heavy bags.\n\nHe approaches a sturdy door bolstered by a metal bar as two police officers, Burton and Estevez, drive cautiously along a bustling downtown street. Burton, the bulkier and more robust of the two, glances out the window as they pass by pedestrians on the bustling sidewalk, making a playful gesture by holding up his fingers in the shape of a gun. Suddenly, the door in front of them explodes with a thunderous roar, and a man is violently propelled into the air, creating a cross-shaped hole in the side of the building. They watch in wide-eyed disbelief as the man from the sky confidently steps into the flaming wreckage. Burton promptly exits the vehicle, draws his gun, and readies himself for whatever may come next."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Dark clouds gradually obscure half of the bright moon, casting an eerie shadow as a figure plummets toward the ground with an alarming speed. As the figure lands, their long, bony fingers lightly brush against the surface of the street, providing a semblance of balance as the person rises to their feet. What stands revealed is a slight man in his 30s, distinguished by blood smearing the right side of his face, blond cropped hair, and a thick collar encircling his neck. His gaze is fixated on the lights twinkling in the sky, which, one by one, fade into darkness as rain begins to cascade. Reacting swiftly, he propels himself against a nearby wall, pressing his body into its shelter and curling against it with a sense of urgency. Clutching a broad-bladed dagger tightly within his grip, he extends it menacingly towards the source of a dog's bark—an animal confined behind a wire fence. In a sudden motion, he yanks open his black top, uncovering a lean, toned physique adorned with tattoos, the ink and his wounds echoing the blood trail on his face. With determination, he strides toward the dog's enclosure, lifts the dagger high above his head, and brings it down with resolute force. Just then, a bright light catches him off guard, and simultaneously, a blue light ring descends, encircling him and activating the mechanism that causes the collar around his neck to spring open, dropping uselessly to the ground. With the rain, blood is swept across the surface of the street, trickling into a drain. Meanwhile, inside a dimly-lit building, a man in a suit cautiously makes his way through aisles of stacked shelves, some meticulously covered with cellophane. As he steps under a skylight, his foot lands on a toy, producing a sound that prompts him to bend down and retrieve it. At that moment, the man from the sky crashes through the skylight with explosive energy, landing directly on him and sending both the man and his torch sprawling across the floor. Wasting no time, the sky man seeks refuge in a dingy men's room, where he sheds his coat, opens a first aid box, and methodically threads a bent needle to stitch a deep gash on his back at shoulder level, all the while watching his reflection in the mirror. He clutches the edge of the sink with his blood-stained hand, blood continuing to drip onto the floor. Once he is fully dressed, he strides purposefully to a door, unfastens a chain, and illuminates an armory packed with weapons. Clad in a black shirt, trousers, and a light coat, he selects and retrieves two assault rifles equipped with grenade launchers, alongside an assortment of assault and sniper rifles. Laden with two bags, he exits the armory and approaches a door reinforced with a metal bar. Concurrently, two police officers, Burton and Estevez, navigate the downtown streets in their vehicle. Burton, the burlier of the duo, peers outside the window as the car glides past pedestrians, cheekily mimicking a gun with his fingers. Suddenly, they are startled as a door ahead detonates with tremendous force, propelling a man skyward and leaving behind a cross-shaped void in the building. As they witness the figure emerge from the fiery backdrop, Burton promptly steps out of the vehicle, drawing his gun with deft readiness."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Dark clouds obscure half of the bright moon as a figure plummets toward the ground. This black-tied individual, a slight man in his 30s with cropped blond hair and a bloodied face, caresses the street with long fingers while rising to his feet. He observes the sky's lights extinguishing as rain begins. Seeking shelter, he presses against a wall, brandishing a broad-bladed dagger toward a barking dog behind a wire fence. Exposing a thin, tattooed torso by ripping his shirt, the man approaches the dog, raises his dagger, and forcefully strikes. Suddenly, a bright light illuminates him as a blue ring descends, unlocking the collar around his neck, which drops to the ground, allowing rain to wash blood into a drain. Meanwhile, inside a building, a suited man with a torch moves between stacked shelves, steps on a toy, and picks it up. The man from the sky crashes in through the skylight, knocking the suited man and his torch to the floor. In a grubby men's room, the man stitches a shoulder wound using a thread and bent needle, watching his reflection in the mirror and gripping the sink as his blood drips. Once dressed, he enters an armory, removes a chain, illuminates the room, and outfits himself in a black shirt, trousers, and light coat. Gathering assault rifles, he exits with two bags. Approaching a door with a metal bar, he is noticed by cops Burton and Estevez driving nearby. The burlier Burton signals with finger guns as the door explodes, sending a man flying through the building, leaving a cross-shaped hole. They watch as the man from the sky emerges into the fiery scene, prompting Burton to draw his gun and exit the vehicle."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Dark clouds cover half of the bright moon, which sailors often referred to as a \"hunter's moon\" due to its visibility during hunting activities, as a figure hurtles dying towards the ground. Long, bony fingers caress the street as the black-tied figure rises to its feet, revealing a slight man in his 30s with blood streaking the right side of his face, blond cropped hair, and a thick collar, reminiscent of those often used in high-security prisons to control inmates. He stares at lights in the sky, possibly the lingering lights of passing aircraft indicating a nearby airport, which go out as rain falls. He throws himself against the wall, likely scarred from years of graffiti and urban decay, and huddles beside it, holding out a broad-bladed dagger, historically known for its use in close combat during medieval times, and pointing it in the direction of a barking dog behind a wire fence. The man rips open his black top, revealing a thin, toned body with tattoos reminiscent of tribal symbols and blood aligned with the streak on his face. He walks towards the dog in its pound, where stray animals are kept before adoption or euthanasia, raises the dagger above his head, and brings it down with great force. A bright light, similar to those used in high-security searchlights, shines on him, and a blue light ring falls over him, activating the complex mechanism and opening the collar around his neck, which falls to the ground. Rain washes blood across the ground and into a drain that leads into the city’s intricate sewage system. Inside a building, a man in a suit, likely a security guard given the context, carrying a torch walks between stacking shelves, some covered with cellophane used for protective storage, steps on a toy under a skylight, often installed to allow natural light into buildings, and bends down to pick it up. The man in the black coat jumps through the skylight onto him, knocking him and his torch to the floor. The man from the sky goes to a grubby men's room, indicative of neglect in maintenance, removes his coat, opens a first aid box that complies with workplace safety regulations, uses a thread and a bent needle to stitch a nasty wound on his back with flesh torn away at shoulder level, watches his reflection in a mirror as he sews, and grasps the sink with his bloody hand as his blood drips on the floor. Now dressed, he marches to a door, removes a chain typically used for reinforcement, switches on lights in an armory reminiscent of a military-grade installation, and is dressed in black shirt, trousers, and light coat. He picks up two assault rifles with grenade launchers, a selection of assault and sniper rifles commonly used by special forces, and walks out of the armory with two bags in his hands. He reaches a door with a metal bar across it as two cops, Burton and Estevez, drive along a downtown street, known for its bustling nightlife and commercial activity. The burlier of the two, Burton, glances out as they pass people on the sidewalk and holds up his fingers in the shape of a gun, a gesture often used by law enforcement as a sign of impending action. A door explodes just in front of them, likely due to high-impact explosives, and a man is hurled into the air, creating a hole in the shape of a cross symbolizing chaos and destruction in the building. They watch as the man from the sky steps into the flaming surround, reminiscent of scenes from action movies, and Burton gets out and draws his gun, prepared for an intense confrontation."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "They watch as the man from the sky steps into the flaming surround and Burton gets out and draws his gun Dark clouds cover half of the bright moon as a figure hurtles dying towards the ground He picks up two assault rifles with grenade launchers a selection of assault and sniper rifles and walks out of the armory with two bags in his hands The man rips open his black top revealing a thin toned body with tattoos and blood aligned with the streak on his face Long bony fingers caress the street as the blacktied figure rises to its feet revealing a slight man in his 30s with blood streaking the right side of his face blond cropped hair and a thick collar He throws himself against the wall and huddles beside it holding out a broadbladed dagger and pointing it in the direction of a barking dog behind a wire fence He stares at lights in the sky which go out as rain falls Long bony fingers caress the street as the blacktied figure rises to its feet revealing a slight man in his 30s with blood streaking the right side of his face blond cropped hair and a thick collar He stares at lights in the sky which go out as rain falls He throws himself against the wall and huddles beside it holding out a broadbladed dagger and pointing it in the direction of a barking dog behind a wire fence The man rips open his black top revealing a thin toned body with tattoos and blood aligned with the streak on his face He walks towards the dog in its pound raises the dagger above his head and brings it down with great force A bright light shines on him and a blue light ring falls over him opening the collar around his neck which falls to the ground Rain washes blood across the ground and into a drain Inside a building a man in a suit carrying a torch walks between stacking shelves some covered with cellophane steps on a toy under a skylight and bends down to pick it up The man in the black coat jumps through the skylight onto him knocking him and his torch to the floor Inside a building a man in a suit carrying a torch walks between stacking shelves some covered with cellophane steps on a toy under a skylight and bends down to pick it up The man from the sky goes to a grubby men's room removes his coat opens a first aid box uses a thread and a bent needle to stitch a nasty wound on his back with flesh torn away at shoulder level watches his reflection in a mirror as he sews and grasps the sink with his bloody hand as his blood drips on the floor Now dressed he marches to a door removes a chain switches on lights in an armory and is dressed in black shirt trousers and light coat Now dressed he marches to a door removes a chain switches on lights in an armory and is dressed in black shirt trousers and light coat He picks up two assault rifles with grenade launchers a selection of assault and sniper rifles and walks out of the armory with two bags in his hands He reaches a door with a metal bar across it as two cops Burton and Estevez drive along a downtown street The burlier of the two Burton glances out as they pass people on the sidewalk and holds up his fingers in the shape of a gun A door explodes just in front of them and a man is hurled into the air creating a hole in the shape of a cross in the building They watch as the man from the sky steps into the flaming surround and Burton gets out and draws his gun Dark clouds cover half of the bright moon as a figure hurtles dying towards the ground"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Dark clouds cover half of the bright moon as a figure hurtles dying towards the ground. Long bony fingers caress the street as the blacktied figure rises to its feet revealing a slight man in his 30s with blood streaking the right side of his face blond cropped hair and a thick collar. He stares at lights in the sky which go out as rain falls. He throws himself against the wall and huddles beside it holding out a broadbladed dagger and pointing it in the direction of a barking dog behind a wire fence. The man rips open his black top revealing a thin toned body with tattoos and blood aligned with the streak on his face. He walks towards the dog in its pound raises the dagger above his head and brings it down with great force. A bright light shines on him and a blue light ring falls over him opening the collar around his neck which falls to the ground. Rain washes blood across the ground and into a drain. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. Inside a building a man in a suit carrying a torch walks between stacking shelves some covered with cellophane steps on a toy under a skylight and bends down to pick it up. The man in the black coat jumps through the skylight onto him knocking him and his torch to the floor. The man from the sky goes to a grubby men's room removes his coat opens a first aid box uses a thread and a bent needle to stitch a nasty wound on his back with flesh torn away at shoulder level watches his reflection in a mirror as he sews and grasps the sink with his bloody hand as his blood drips on the floor. Now dressed he marches to a door removes a chain switches on lights in an armory and is dressed in black shirt trousers and light coat. He picks up two assault rifles with grenade launchers a selection of assault and sniper rifles and walks out of the armory with two bags in his hands. He reaches a door with a metal bar across it as two cops Burton and Estevez drive along a downtown street. The burlier of the two Burton glances out as they pass people on the sidewalk and holds up his fingers in the shape of a gun. A door explodes just in front of them and a man is hurled into the air creating a hole in the shape of a cross in the building. They watch as the man from the sky steps into the flaming surround and Burton gets out and draws his gun."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Dark clouds cover half of the bright moon as a figure hurtles dying towards the ground. Long bony fingers caress the street as the blacktied figure rises to its feet revealing a slight man in his 30s with blood streaking the right side of his face blond cropped hair and a thick collar. He stares at lights in the sky which go out as rain falls. He throws himself against the wall and huddles beside it holding out a broadbladed dagger and pointing it in the direction of a barking dog behind a wire fence. The man rips open his black top revealing a thin toned body with tattoos and blood aligned with the streak on his face. He walks towards the dog in its pound raises the dagger above his head and brings it down with great force. A bright light shines on him and a blue light ring falls over him opening the collar around his neck which falls to the ground. Rain washes blood across the ground and into a drain. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Inside a building a man in a suit carrying a torch walks between stacking shelves some covered with cellophane steps on a toy under a skylight and bends down to pick it up. The man in the black coat jumps through the skylight onto him knocking him and his torch to the floor. The man from the sky goes to a grubby men's room removes his coat opens a first aid box uses a thread and a bent needle to stitch a nasty wound on his back with flesh torn away at shoulder level watches his reflection in a mirror as he sews and grasps the sink with his bloody hand as his blood drips on the floor. Now dressed he marches to a door removes a chain switches on lights in an armory and is dressed in black shirt trousers and light coat. He picks up two assault rifles with grenade launchers a selection of assault and sniper rifles and walks out of the armory with two bags in his hands. He reaches a door with a metal bar across it as two cops Burton and Estevez drive along a downtown street. The burlier of the two Burton glances out as they pass people on the sidewalk and holds up his fingers in the shape of a gun. A door explodes just in front of them and a man is hurled into the air creating a hole in the shape of a cross in the building. They watch as the man from the sky steps into the flaming surround and Burton gets out and draws his gun."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Dark clouds cover half of the bright moon as a figure hurtles dying towards the ground. Long bony fingers caress the street as the blacktied figure rises to its feet revealing a slight man in his 30s with blood streaking the right side of his face blond cropped hair and a thick collar. He stares at lights in the sky which go out as rain falls. He throws himself against the wall and huddles beside it holding out a broadbladed dagger and pointing it in the direction of a barking dog behind a wire fence. He picks up two assault rifles with grenade launchers a selection of assault and sniper rifles and walks out of the armory with two bags in his hands. He reaches a door with a metal bar across it as two cops Burton and Estevez drive along a downtown street. The burlier of the two Burton glances out as they pass people on the sidewalk and holds up his fingers in the shape of a gun. A door explodes just in front of them and a man is hurled into the air creating a hole in the shape of a cross in the building. They watch as the man from the sky steps into the flaming surround and Burton gets out and draws his gun."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Dark clouds cover half of the bright moon as a figure hurtles dying towards the ground. Long bony fingers caress the street as the blacktied figure rises to its feet revealing a slight man in his 30s with blood streaking the right side of his face blond cropped hair and a thick collar. A door explodes just in front of them and a man is hurled into the air creating a hole in the shape of a cross in the building. They watch as the man from the sky steps into the flaming surround and Burton gets out and draws his gun."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Dark clouds cover half of the bright moon as a squirrel hurtles dying towards the ground. Long, bony fingers caress the street as the black-tied squirrel rises to its feet, revealing a slight giraffe in its 30s with blood streaking the right side of its face, blond cropped hair, and a thick collar. The giraffe stares at lights in the sky which go out as rain falls. The giraffe throws itself against the wall and huddles beside it, holding out a broad-bladed dagger and pointing it in the direction of a barking cat behind a wire fence. The giraffe rips open its black top, revealing a thin, toned body with tattoos and blood aligned with the streak on its face. The giraffe walks towards the cat in its pound, raises the dagger above its head, and brings it down with great force. A bright light shines on the giraffe, and a blue light ring falls over it, opening the collar around its neck, which falls to the ground. Rain washes blood across the ground and into a drain. Inside a building, a penguin in a suit carrying a torch walks between stacking shelves, some covered with cellophane, steps on a toy under a skylight, and bends down to pick it up. The platypus in the black coat jumps through the skylight onto the penguin, knocking the penguin and its torch to the floor. The giraffe from the sky goes to a grubby men's room, removes its coat, opens a first aid box, uses a thread and a bent needle to stitch a nasty wound on its back with flesh torn away at shoulder level, watches its reflection in a mirror as it sews, and grasps the sink with its bloody paw as its blood drips on the floor. Now dressed, the giraffe marches to a door, removes a chain, switches on lights in an armory, and is dressed in black shirt, trousers, and light coat. The giraffe picks up two assault rifles with grenade launchers, a selection of assault and sniper rifles, and walks out of the armory with two bags in its hands. The giraffe reaches a door with a metal bar across it as two monkeys, Burton and Estevez, drive along a downtown street. The burlier of the two, Burton, glances out as they pass people on the sidewalk and holds up its fingers in the shape of a gun. A door explodes just in front of them, and a squirrel is hurled into the air, creating a hole in the shape of a cross in the building. They watch as the giraffe from the sky steps into the flaming surround, and Burton gets out and draws its gun."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Dark bubbles cover half of the bright neon sign as a figure hurtles spinning towards the forest. Long, bony fingers caress the sand as the blue-tied figure rises to its feet, revealing a slight man in his 30s with dirt streaking the right side of his face, blond cropped hair, and a thick bracelet. He stares at balloons in the sky which pop as snow falls. He throws himself against the bench and huddles beside it, holding out a broad-bladed spatula and pointing it in the direction of a meowing cat behind a vine-covered trellis. The man rips open his brown jacket, revealing a thin, toned body with tattoos and dirt aligned with the streak on his face. He walks towards the cat in its cage, raises the spatula above his head, and brings it down with great force. A bright flare shines on him, and a green light circle falls over him, opening the bracelet around his wrist, which falls to the ground. Snow washes dirt across the path and into a gutter. Inside a warehouse, a man in a tuxedo carrying a flashlight walks between towering crates, some covered with bubble wrap, steps on a doll under a stained-glass window, and bends down to pick it up. The man in the brown jacket jumps through the stained-glass window onto him, knocking him and his flashlight to the floor. The man from the forest goes to a shabby storage room, removes his jacket, opens a sewing kit, uses a thread and a bent paperclip to stitch a nasty wound on his back with flesh torn away at shoulder level, watches his reflection in a window as he sews, and grasps the countertop with his bloody hand as his blood drips on the rug. Now dressed, he marches to a portal, removes a latch, switches on lanterns in an arcade, and is dressed in gray vest, jeans, and light jacket. He picks up two water pistols with bubble blowers, a selection of squirt and foam dart guns, and walks out of the arcade with two backpacks in his hands. He reaches a portal with a wooden bar across it as two officers, Burton and Estevez, drive along a suburban road. The burlier of the two, Burton, glances out as they pass people on the path and holds up his fingers in the shape of a spoon. A portal explodes just in front of them, and a man is hurled into the air, creating a hole in the shape of a star in the building. They watch as the man from the forest steps into the flaming surround, and Burton gets out and draws his water pistol."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Dark clouds obscure half of the bright moon as a figure drifts peacefully towards the ground. Long, bony fingers trace the street as the black-tied figure shuffles to its feet, revealing a slight man in his 30s with mud streaking the right side of his face, blond cropped hair, and a thick collar. He glances at lights in the sky which flicker as rain descends. He presses himself against the wall and leans beside it, holding out a broad-bladed dagger and swinging it in the direction of a barking dog behind a wire fence. The man tears open his black top, revealing a thin, toned body with tattoos and mud aligned with the streak on his face. He ambles towards the dog in its pound, lowers the dagger beside his hip, and taps it on the ground. A bright light illuminates him, and a blue light ring encircles him, unfastening the collar around his neck, which clinks to the ground. Rain pushes mud across the ground and into a drain. Inside a building, a man in a suit carrying a torch ambles between stacking shelves, some covered with cellophane, stumbles on a toy under a skylight, and crouches down to examine it. The man in the black coat dives through the skylight onto him, propelling him and his torch across the floor. The man from the sky saunters to a grubby men's room, hangs his coat, takes out a first aid box, uses a thread and a bent needle to mend a nasty wound on his back with flesh torn away at shoulder level, examines his reflection in a mirror as he sews, and clutches the sink with his muddy hand as his blood splashes on the floor. Now dressed, he strides to a door, attaches a chain, flicks on lights in an armory, and is dressed in black shirt, trousers, and light coat. He grabs two assault rifles with grenade launchers, a selection of assault and sniper rifles, and strolls out of the armory with two bags in his hands. He reaches a door with a metal bar across it as two cops, Burton and Estevez, cruise along a downtown street. The burlier of the two, Burton, peers out as they pass people on the sidewalk and waves his fingers in the shape of a gun. A door vaporizes just in front of them, and a man is lifted into the air, creating a gap in the shape of a cross in the building. They observe as the man from the sky marches into the flaming surround, and Burton steps out and holsters his gun."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Dark flowers cover half of the bright star as a kite hurtles flying towards the ocean. Long, bony branches caress the river as the orange-tied kite rises to its roots, revealing a slight giraffe in its 30s with ink streaking the right side of its frame, blond cropped leaves, and a thick ribbon. It stares at lamps in the field which go out as sand falls. It throws itself against the car and huddles beside it, holding out a broad-bladed spoon and pointing it in the direction of a meowing cat behind a wire gate. The giraffe rips open its purple coat, revealing a thin, toned ladder with stickers and ink aligned with the streak on its frame. It walks towards the cat in its cage, raises the spoon above its head, and brings it down with great force. A glowing bulb shines on it, and a red light circle falls over it, opening the ribbon around its neck, which falls to the ocean. Sand washes ink across the ocean and into a pipe. Inside a tent, a bird in a hat carrying a flashlight walks between stacking boxes, some covered with fabric, steps on a cookie under a window, and bends down to pick it up. The kite in the orange coat jumps through the window onto it, knocking it and its flashlight to the ground. The kite from the field goes to a dusty women's room, removes its coat, opens a sewing kit, uses a rope and a bent wire to stitch a nasty tear on its handle with bark torn away at trunk level, watches its reflection in a glass as it sews, and grasps the tub with its inky wing as its ink drips on the field. Now dressed, it marches to a gate, removes a lock, switches on lamps in a warehouse, and is dressed in red sweater, jeans, and dark hat. It picks up two water pistols with water balloons, a selection of water and paint guns, and walks out of the warehouse with two baskets in its wings. It reaches a gate with a wooden stick across it as two mice, Watson and Holmes, drive along an uptown avenue. The skinnier of the two, Watson, glances out as they pass gardens on the trail and holds up its wings in the shape of a bow. A gate explodes just in front of them, and a kite is hurled into the sky, creating a hole in the shape of a triangle in the mountain. They watch as the kite from the field steps into the shining surround, and Watson gets out and draws its bow."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Gleaming stars obscure half of the dim sun as an animal glides cheerfully towards the river. Short, furry paws tap the tree as the white-caped animal rolls to its belly, revealing a burly woman in her 40s with paint streaking the left side of her arm, brown braided hair, and a thin bracelet. She claps at shadows in the forest which disappear as snow falls. She flings herself against the boulder and sings beside it, tossing out a narrow-bladed sword and swaying it towards a purring cat within a wooden cage. The woman stitches up her white pants, revealing a broad, muscular leg with scars and paint aligned with the streak on her arm. She skips towards the cat in its crate, raises the sword towards her heart, and lowers it with gentle care. A loud sound echoes to her, and a red sound wave echoes over her, unlocking the bracelet around her wrist, which rolls to the river. Snow scatters paint across the leaves and into a stream. Outside a field, a woman in a dress holding a match dances between tall trees, some draped with wool, steps on a ball under a canopy, and kneels down to roll it away. The woman in the white cape swings through the canopy onto her, lifting her and the match to the skies. The woman from the river flies to a cluttered ladies' hall, wraps her cape, rummages through a first aid kit, uses a ribbon and a crooked pin to repair a thin tear on her leg with fabric torn away at knee level, gazes at her shadow in a window as she stitches, and grasps the wall with her painted foot as her paint drips on the chair. Now cloaked, she paddles to a curtain, attaches a lock, switches on speakers in a gallery, and is cloaked in white dress, shorts, and thick scarf. She picks up three water bottles with dinner trays, a collection of water and wine glasses, and dances out of the gallery with three baskets in her arms. She arrives at a curtain with a wooden plank above it as two chefs, Willis and Martin, stroll along an uptown lane. The leaner of the two, Willis, peers in as they encounter animals on the pavement and pumps up his arms in the shape of a dance. A roof collapses just behind them, and a woman is floated into the clouds, creating a pattern in the shape of a circle in the sky. They gaze as the woman from the river glides into the silent space, and Willis steps out and lifts his camera."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Dark veils shroud half of the glowing lantern as a silhouette dances carelessly towards the sea. Long, slender toes brush the sand as the white-gloved figure springs to its knees, revealing a tall woman in her 30s with mud splattering the left edge of her body, brunette braided hair, and a thin bracelet. She gazes at shadows on the ground which vanish as winds howl. She propels herself against a tree and perches beside it, holding out a slender-bladed flute and aiming it in the direction of a meowing cat under a wooden bench. The woman tears off her white hat, revealing a broad, strong torso with patterns and mud matching the splat on her body. She dances towards the cat in its shelter, raises the flute above her head, and lowers it with delicate precision. A soft glow envelops her, and a red light garland slips around her, releasing the bracelet on her wrist, which clinks onto the grass. Winds sweep mud along the grass and into a stream. Inside a hut, a woman in a gown carrying a lantern ambles between leaning poles, some draped with netting, treads on a cushion under a window, and crouches down to retrieve it. The woman in the white coat dives through the window onto her, toppling her and her lantern to the ground. The woman from the sea goes to a dingy laundry room, removes her coat, opens a toolbox, uses a string and a curved hook to mend a ragged scratch on her arm with skin flayed away at elbow level, observes her silhouette in a window as she stitches, and holds the faucet with her muddy hand as her mud puddles on the tile. Now clothed, she strides to a gate, unlocks a latch, flips on lamps in a storage room, and is clad in a white blouse, shorts, and dark vest. She grabs two water pistols with squirt nozzles, a collection of water balloons and binoculars, and prances out of the storage room with two pails in her hands. She arrives at a gate with a wooden plank across it as two merchants, Greenfield and Ramirez, stroll along a coastal path. The stockier of the two, Greenfield, peers out as they approach tourists on the boardwalk and lifts his fingers in the shape of a fish. A gate implodes just before them, and a woman is flung into the sky, crafting a gap in the shape of a butterfly in the fence. They watch as the woman from the sea strides into the watery embrace, and Greenfield steps out and brandishes his net."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Pale mist obscures half of the glowing sun as a shadow glides spinning towards the ocean. Short, stubby toes pat the sand as the red-capped shadow sinks to its knees, revealing a large child in her 60s with paint dripping down the left side of her arm, brunette braided beard, and a flimsy hat. She peers at shadows in the forest which flicker as snow falls. She pushes herself against the boulder and leans beside it, waving a narrow-bladed sword and aiming it at a meowing cat beyond a wooden gate. The child tears apart her green jacket, exposing a wide, frail torso with paint and mud matching the drip on her arm. She dances towards the cat in its kennel, swings the sword beneath her feet, and lifts it up with gentle grace. A dim glow flickers on her, and an orange aura hoop emerges around her, snapping the hat off her head, which rolls to the horizon. Snow carries paint across the beach and into a ditch. Beneath a gazebo, a woman in a gown holding a lantern shuffles between leaning racks, some draped with fabric, steps on a spatula beneath a lattice, and crouches down to taste it. The child in the green jacket flips through the lattice onto her, tumbling her and her lantern to the block. The child from the ocean crawls to a clean ladies' lounge, removes her jacket, unlocks a toolbox, uses a pin and a twisted thread to patch a small scrape on her knee with skin peeled away at shin level, watches her silhouette in a window as she stitches, and grips the bathtub with her muddy foot as her paint drips on the tile. Now clothed, she wanders to a window, adds a rope, flickers off shadows in a nursery, and is clothed in white blouse, slacks, and heavy jacket. She picks up two water pistols with flashlights, a collection of water and bubble guns, and skips out of the nursery with two pails in her arms. She approaches a window with a wooden plank over it as two bakers, Smith and Gonzales, stroll along a crowded market. The skinnier of the two, Smith, peers out as they pass animals on the path and wiggles his ears in the shape of an axe. A window collapses just beside them, and a woman is rolled into the breeze, crafting a shape of a circle in the shrubbery. They observe as the child from the ocean strolls into the flaming brush, and Smith hops out and holsters his axe."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Dark clouds obscure the moon as a man in his 30s crashes to the ground, blood streaking his face. He wield a dagger, confronts a barking dog, and a blue light frees a collar from his neck. The rain washes blood into a drain. Inside a building, a suited man with a torch steps on a toy and is attacked by the man from the sky. Badly injured, he stitches a wound in a grubby restroom, then enters an armory and equips himself with rifles. As two cops, Burton and Estevez, drive downtown, a door explodes. The man from the sky emerges from the flames, prompting Burton to draw his gun."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "They watch as the man from the sky steps into the flaming surround and Burton gets out and draws his gun A door explodes just in front of them and a man is hurled into the air creating a hole in the shape of a cross in the building The burlier of the two Burton glances out as they pass people on the sidewalk and holds up his fingers in the shape of a gun He reaches a door with a metal bar across it as two cops Burton and Estevez drive along a downtown street He picks up two assault rifles with grenade launchers a selection of assault and sniper rifles and walks out of the armory with two bags in his hands Now dressed he marches to a door removes a chain switches on lights in an armory and is dressed in black shirt trousers and light coat The man from the sky goes to a grubby men's room removes his coat opens a first aid box uses a thread and a bent needle to stitch a nasty wound on his back with flesh torn away at shoulder level watches his reflection in a mirror as he sews and grasps the sink with his bloody hand as his blood drips on the floor The man in the black coat jumps through the skylight onto him knocking him and his torch to the floor Inside a building a man in a suit carrying a torch walks between stacking shelves some covered with cellophane steps on a toy under a skylight and bends down to pick it up Rain washes blood across the ground and into a drain A bright light shines on him and a blue light ring falls over him opening the collar around his neck which falls to the ground He walks towards the dog in its pound raises the dagger above his head and brings it down with great force The man rips open his black top revealing a thin toned body with tattoos and blood aligned with the streak on his face He throws himself against the wall and huddles beside it holding out a broadbladed dagger and pointing it in the direction of a barking dog behind a wire fence He stares at lights in the sky which go out as rain falls Long bony fingers caress the street as the blacktied figure rises to its feet revealing a slight man in his 30s with blood streaking the right side of his face blond cropped hair and a thick collar Dark clouds cover half of the bright moon as a figure hurtles dying towards the ground"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Rain washes blood across the ground and into a drain The man from the sky goes to a grubby men's room removes his coat opens a first aid box uses a thread and a bent needle to stitch a nasty wound on his back with flesh torn away at shoulder level watches his reflection in a mirror as he sews and grasps the sink with his bloody hand as his blood drips on the floor He walks towards the dog in its pound raises the dagger above his head and brings it down with great force A bright light shines on him and a blue light ring falls over him opening the collar around his neck which falls to the ground A door explodes just in front of them and a man is hurled into the air creating a hole in the shape of a cross in the building The burlier of the two Burton glances out as they pass people on the sidewalk and holds up his fingers in the shape of a gun He reaches a door with a metal bar across it as two cops Burton and Estevez drive along a downtown street The man in the black coat jumps through the skylight onto him knocking him and his torch to the floor Inside a building a man in a suit carrying a torch walks between stacking shelves some covered with cellophane steps on a toy under a skylight and bends down to pick it up Long bony fingers caress the street as the blacktied figure rises to its feet revealing a slight man in his 30s with blood streaking the right side of his face blond cropped hair and a thick collar He stares at lights in the sky which go out as rain falls He picks up two assault rifles with grenade launchers a selection of assault and sniper rifles and walks out of the armory with two bags in his hands They watch as the man from the sky steps into the flaming surround and Burton gets out and draws his gun The man rips open his black top revealing a thin toned body with tattoos and blood aligned with the streak on his face Now dressed he marches to a door removes a chain switches on lights in an armory and is dressed in black shirt trousers and light coat Dark clouds cover half of the bright moon as a figure hurtles dying towards the ground He throws himself against the wall and huddles beside it holding out a broadbladed dagger and pointing it in the direction of a barking dog behind a wire fence"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "The man in the black coat jumps through the skylight onto him knocking him and his torch to the floor The man from the sky goes to a grubby men's room removes his coat opens a first aid box uses a thread and a bent needle to stitch a nasty wound on his back with flesh torn away at shoulder level watches his reflection in a mirror as he sews and grasps the sink with his bloody hand as his blood drips on the floor Now dressed he marches to a door removes a chain switches on lights in an armory and is dressed in black shirt trousers and light coat He picks up two assault rifles with grenade launchers a selection of assault and sniper rifles and walks out of the armory with two bags in his hands He reaches a door with a metal bar across it as two cops Burton and Estevez drive along a downtown street The burlier of the two Burton glances out as they pass people on the sidewalk and holds up his fingers in the shape of a gun A door explodes just in front of them and a man is hurled into the air creating a hole in the shape of a cross in the building They watch as the man from the sky steps into the flaming surround and Burton gets out and draws his gun Dark clouds cover half of the bright moon as a figure hurtles dying towards the ground Long bony fingers caress the street as the blacktied figure rises to its feet revealing a slight man in his 30s with blood streaking the right side of his face blond cropped hair and a thick collar He stares at lights in the sky which go out as rain falls He throws himself against the wall and huddles beside it holding out a broadbladed dagger and pointing it in the direction of a barking dog behind a wire fence The man rips open his black top revealing a thin toned body with tattoos and blood aligned with the streak on his face He walks towards the dog in its pound raises the dagger above his head and brings it down with great force A bright light shines on him and a blue light ring falls over him opening the collar around his neck which falls to the ground Rain washes blood across the ground and into a drain Inside a building a man in a suit carrying a torch walks between stacking shelves some covered with cellophane steps on a toy under a skylight and bends down to pick it up"
        }
      ]
    }
  ]
}