{
  "ground_truth": "He sits, and she looks down as Jeep frowns and his expression hardens. He walks away, causing Charlie's face to crumple and she sobs. Wisps of cloud float past the moon. On the roof, Kyle is with Audrey, who's aiming an assault rifle, but she puts the gun down. Kyle looks away thoughtfully, and Audrey shakes her head and grins broadly. Audrey looks down thoughtfully, while inside, more lights come on and the jukebox whirs into action. On the roof, Kyle and Audrey look out into the darkness as a vehicle speeds along the freeway. Bob walks out from the kitchen. Bob, Jeep, and Charlie go to the window and peer out through the blinds. Audrey and Kyle watch the vehicle, a van, driving between the jumble of cars in front of the diner. Kyle gives Audrey a dark look; then Kyle aims his assault rifle and Audrey aims her pistol at the van as it stops by the pumps. A man gets out of the van and gestures to the occupants, while a child looks out of the window at the man as he grabs a gas nozzle. With his hands pressed against the window, the little boy looks up at Kyle and Audrey. Audrey runs to the side of the roof and looks out, and Kyle looks over as several cars drive out of the darkness towards the diner. Kyle stares down at the man by the van, and the boy bashes on the window. The vehicles close in, and the man drops the gas nozzle and runs to the driver's side as a car side-sweeps him, sending him flying. The car stops, and a punky-looking guy gets out. A van stops, and a rabble spills out. They surround the van, open it, and grab the boy. Kyle shoots the rabble, who surround the boy crouched on the ground. Kyle swings over the wall and jumps down from the front of the diner, running at the rabble, gun blazing. Bob starts to wrench the planks away from the windows, but turns to see Michael aiming his gun at him. Kyle barges through and picks up the boy as the rabble closes in. Kyle picks off a few of them, clutching the boy close to him as he stares out at the possessed. The boy looks at Kyle with black eyes and bites Kyle in the neck. Kyle collapses as Bob kicks a chair over. Audrey comes down from the roof and runs at the possessed, gun blazing, but when she aims at the boy and pulls the trigger, she's out of ammo. The boy stares at her with blood around his mouth. Audrey gets in the van and shuts the door as the possessed clamber on the outside. Charlie turns to Michael, who just stares at her.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "He perches, and she gazes down as Jeep scowls and his visage stiffens. He strides away, causing Charlie's countenance to crumple and she weeps. Tendrils of vapor drift past the satellite. On the rooftop, Kyle is with Audrey, who's targeting an assault rifle, but she places the weapon down. Kyle gazes away pensively, and Audrey shakes her head and beams broadly. Audrey gazes down contemplatively, while inside, additional lights illuminate and the jukebox whirs into motion. On the rooftop, Kyle and Audrey gaze out into the obscurity as a conveyance speeds along the highway. Bob strides out from the kitchen. Bob, Jeep, and Charlie proceed to the window and peer out through the blinds. Audrey and Kyle observe the vehicle, a van, driving among the chaos of automobiles in front of the eatery. Kyle gives Audrey a somber look; then Kyle targets his assault rifle and Audrey targets her handgun at the van as it halts by the pumps. A man exits the van and motions to the occupants, while a youngster gazes out of the window at the man as he grabs a fuel nozzle. With his hands pressed against the window, the little boy gazes up at Kyle and Audrey. Audrey dashes to the side of the rooftop and gazes out, and Kyle looks over as several vehicles drive out of the obscurity towards the eatery. Kyle stares down at the man by the van, and the boy bangs on the window. The vehicles converge, and the man drops the fuel nozzle and dashes to the driver's side as a car sideswipes him, sending him flying. The car halts, and a punky-looking fellow exits. A van halts, and a mob spills out. They encircle the van, open it, and grab the youngster. Kyle shoots the mob, who encircle the youngster crouched on the terrain. Kyle swings over the barrier and leaps down from the front of the eatery, sprinting at the mob, gun blazing. Bob starts to yank the boards away from the windows, but turns to see Michael targeting his firearm at him. Kyle forces through and picks up the youngster as the mob converges. Kyle picks off a few of them, clutching the youngster close to him as he stares out at the possessed. The youngster gazes at Kyle with dark eyes and sinks his teeth into Kyle's neck. Kyle collapses as Bob kicks a chair over. Audrey descends from the rooftop and dashes at the possessed, firearm blazing, but when she targets at the youngster and squeezes the trigger, she's out of ammunition. The youngster stares at her with crimson around his mouth. Audrey gets in the van and shuts the door as the possessed clamber on the exterior. Charlie turns to Michael, who just stares at her."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "He sits, and she looks down as Jeep is frowned upon by his expression hardening. He walks away, causing Charlie's face to crumple and her sobs to be heard. The moon is floated past by wisps of cloud. On the roof, Kyle is with Audrey, who's aiming an assault rifle, but the gun is put down by her. Kyle looks away thoughtfully, and Audrey's head is shaken as she grins broadly. Audrey looks down thoughtfully, while inside, more lights are turned on and the jukebox is whirred into action. On the roof, Kyle and Audrey look out into the darkness as a vehicle is sped along the freeway. Bob walks out from the kitchen. Bob, Jeep, and Charlie approach the window and the blinds are peered through by them. Audrey and Kyle observe the vehicle, a van, being driven between the jumble of cars in front of the diner. Audrey is given a dark look by Kyle; then the assault rifle is aimed by Kyle and her pistol is aimed by Audrey at the van as it stops by the pumps. A man gets out of the van and gestures to the occupants, while a child looks out of the window at the man as he grabs a gas nozzle. With his hands pressed against the window, the little boy looks up at Kyle and Audrey. Audrey runs to the side of the roof and looks out, and Kyle observes as several cars drive out of the darkness towards the diner. Down at the man by the van, Kyle stares, and the window is bashed on by the boy. As the vehicles close in, the gas nozzle is dropped by the man and he runs to the driver's side as a car side-sweeps him, sending him flying. The car is stopped, and a punky-looking guy gets out. A rabble spills out as a van stops. The van is surrounded, opened, and the boy is grabbed. Kyle shoots the rabble, who surround the boy crouched on the ground. Swinging over the wall, Kyle jumps down from the front of the diner, running at the rabble, gun blazing. Bob starts to wrench the planks away from the windows, but Michael is seen aiming his gun at him. Kyle barges through and the boy is picked up by him as the rabble closes in. A few of them are picked off by Kyle, clutching the boy close to him as he stares out at the possessed. The boy looks at Kyle with black eyes and Kyle is bitten in the neck. As Bob kicks a chair over, Kyle collapses. Down from the roof, Audrey comes and she runs at the possessed, gun blazing, but when the boy is aimed at and the trigger is pulled by her, she's out of ammo. With blood around his mouth, the boy stares at her. Audrey gets in the van and the door is shut by her as the possessed clamber on the outside. Charlie turns to Michael, who just stares at her."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Jeep frowns, his expression hardening as he walks away, causing Charlie to sob. Wisps of cloud float past the moon. On the roof, Kyle is with Audrey, who lowers her assault rifle. Kyle looks away thoughtfully, and Audrey shakes her head, grinning. Inside, more lights come on, and the jukebox starts. Kyle and Audrey watch a vehicle speeding along the freeway. Bob, Jeep, and Charlie peer through the blinds. Audrey and Kyle see a van maneuvering among cars in front of the diner. Kyle gives Audrey a dark look, then they aim their weapons at the van as it stops by the pumps. A man exits, gesturing to the occupants, while a child watches him grab a gas nozzle. The boy presses against the window, looking at Kyle and Audrey. Audrey runs to the roof's edge, and Kyle watches as cars approach the diner. The man by the van is hit by a car and sent flying. A punky guy exits the car, and a rabble surrounds the van, grabbing the boy. Kyle shoots at them, then jumps down, running at the rabble, gun blazing. Bob starts removing planks from the windows but stops when Michael aims at him. Kyle picks up the boy as the rabble closes in. The boy bites Kyle's neck, and Kyle collapses. Audrey runs at the possessed, firing, but runs out of ammo when aiming at the boy. The boy, with blood around his mouth, stares at her. Audrey gets in the van as the possessed clamber outside. Charlie turns to Michael, who just stares at her."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "He sits, and she looks down as Jeep frowns and walks away, causing Charlie to sob. Clouds float past the moon. On the roof, Kyle is with Audrey, who lowers her assault rifle. Kyle looks away thoughtfully, and Audrey grins. Inside, more lights come on, and the jukebox starts. Kyle and Audrey watch a vehicle speed along the freeway. Bob, Jeep, and Charlie peer through the blinds. Audrey and Kyle watch a van maneuver among cars. Kyle gives Audrey a dark look, then they aim their guns at the van as it stops. A man exits, gestures to the occupants, and grabs a gas nozzle. A boy inside looks at Kyle and Audrey. Audrey runs to the roof's edge as cars approach the diner. Kyle stares at the man by the van, and the boy bangs on the window. Vehicles close in, and the man is hit by a car. A punky guy exits, and a rabble surrounds the van, grabbing the boy. Kyle shoots the rabble, jumps down, and runs at them, gun blazing. Bob starts removing planks from the windows but sees Michael aiming at him. Kyle picks up the boy, shooting at the possessed. The boy bites Kyle, who collapses. Audrey runs at the possessed, but her gun is empty when she aims at the boy. The boy, with blood around his mouth, stares at her. Audrey gets in the van as the possessed clamber outside. Charlie turns to Michael, who just stares."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "He sits quietly, and she lowers her gaze as Jeep frowns deeply, his expression becoming more severe and hardened. He turns and walks away, causing Charlie's face to crumple with emotion, and she begins to sob uncontrollably. Wisps of cloud drift gently past the glowing moon. Meanwhile, on the roof, Kyle is with Audrey, who is aiming an assault rifle with precision, but she eventually decides to put the gun down. Kyle looks away thoughtfully, lost in his own contemplations, and Audrey shakes her head with a broad grin spreading across her face. Audrey then looks down thoughtfully, while inside the building, more lights flicker on, and the jukebox whirs into action, filling the air with music. On the roof, Kyle and Audrey gaze out into the enveloping darkness as a vehicle speeds swiftly along the freeway. Bob emerges from the kitchen. Bob, Jeep, and Charlie move to the window and peer out through the blinds with curiosity. Audrey and Kyle continue to watch the vehicle, which is a van, as it maneuvers between the jumble of cars parked in front of the diner. Kyle gives Audrey a dark, meaningful look; then Kyle aims his assault rifle, and Audrey follows suit by aiming her pistol at the van as it comes to a stop by the pumps. A man exits the van and gestures to the occupants inside, while a child peers out of the window at the man as he grabs a gas nozzle. With his small hands pressed against the window, the little boy looks up at Kyle and Audrey with wide eyes. Audrey runs to the side of the roof and looks out, and Kyle glances over as several cars emerge from the darkness, heading towards the diner. Kyle stares intently down at the man by the van, and the boy begins to bash on the window. The vehicles close in rapidly, and the man drops the gas nozzle in a panic and runs to the driver's side, but a car side-swipes him, sending him flying through the air. The car comes to a halt, and a punky-looking guy steps out. A van stops, and a rabble spills out in a chaotic rush. They surround the van, open it, and grab the boy. Kyle opens fire on the rabble, who surround the boy crouched on the ground. Kyle swings over the wall and jumps down from the front of the diner, charging at the rabble with his gun blazing. Bob begins to wrench the planks away from the windows, but he turns to see Michael aiming his gun at him. Kyle barges through the chaos and picks up the boy as the rabble closes in around them. Kyle picks off a few of them, clutching the boy tightly to him as he stares out at the possessed. The boy looks at Kyle with black, soulless eyes and bites Kyle viciously in the neck. Kyle collapses to the ground as Bob kicks a chair over in frustration. Audrey descends from the roof and runs at the possessed, her gun blazing, but when she aims at the boy and pulls the trigger, she realizes she's out of ammo. The boy stares at her with blood smeared around his mouth. Audrey quickly gets into the van and shuts the door as the possessed clamber on the outside, trying to get in. Charlie turns to Michael, who just stands there, staring at her with an unreadable expression."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "He sits quietly, maintaining a composed silence, while she lowers her gaze to the ground as if trying to avoid the intensity of the moment. Meanwhile, Jeep frowns deeply, his expression becoming more severe and hardened with every passing second. His eyebrows knit together in a display of inner turmoil. Without a word, he turns abruptly and walks away, leaving an air of tension hanging in his wake. As he goes, Charlie's face crumples with emotion, and she is overwhelmed, beginning to sob uncontrollably. Tears stream down her cheeks as the weight of the situation bears down on her. Above them, in the night sky, ethereal wisps of cloud drift gently past the glowing moon, casting a soft, silvery light on the scene below. Meanwhile, up on the roof, Kyle is there with Audrey, who is aiming an assault rifle with great precision and care, but eventually decides to put the gun down with a sigh. Kyle looks away thoughtfully, his mind lost in his own contemplations, and Audrey shakes her head with a broad grin spreading across her face, as if amused by her own decisions. Turning her gaze downward thoughtfully, she contemplates the world below, while inside the building, more lights flicker to life, casting warm pools of light, and the jukebox whirs into action, filling the air with lively music. On the roof, Kyle and Audrey gaze out into the enveloping darkness that stretches before them, as a vehicle speeds swiftly along the freeway, cutting through the night like a swift arrow. Meanwhile, Bob emerges from the kitchen. Bob, Jeep, and Charlie move toward the window, peering out through the slatted blinds with curiosity, trying to make sense of what’s happening. Audrey and Kyle continue to observe the speedy vehicle, which reveals itself to be a van, as it maneuvers skillfully between the jumble of cars parked in front of the diner. Kyle gives Audrey a dark, meaningful look, rich with unspoken communication; then Kyle aims his assault rifle, and Audrey follows suit, aiming her pistol at the van as it comes to a halt by the pumps. A man exits the van and gestures with urgency to the occupants inside. From within, a child peers out of the window at the man, who grabs a gas nozzle with determined intent. With tiny hands pressed firmly against the window, the little boy looks up at Kyle and Audrey with wide, innocent eyes. Audrey runs swiftly to the side of the roof and looks out, while Kyle glances over as several cars emerge from the shadows, heading with speed toward the diner. Kyle stares intently down at the man by the van, focusing on his every move, while the boy begins to bash on the window, creating a frantic rhythm. As the vehicles close in rapidly, the man drops the gas nozzle in a panic, scrambling to the driver's side in haste, but a passing car side-swipes him, sending him flying through the air in a sudden, chaotic motion. The car comes to a screeching halt, and a punky-looking guy steps out, exuding an air of menace. A van stops, and a rabble spills out in a chaotic rush, resembling a disorganized but determined mob. They surround the van, open it with force, and seize the boy. Kyle opens fire on the rabble, who surround the boy now crouched on the ground, his small frame trembling. With determination, Kyle swings over the wall and jumps down from the front of the diner, charging at the rabble with his gun blazing furiously. Bob begins to wrench the planks away from the windows, but halts abruptly when he turns to see Michael aiming his gun at him, a silent warning in the dim light. Kyle barges through the chaos, moving like a force of nature, and picks up the boy as the rabble closes in around them. He picks off a few of the attackers, clutching the boy tightly to him as he stares defiantly at the possessed. However, the boy looks up at Kyle with black, soulless eyes and bites him viciously in the neck, leaving Kyle collapsing to the ground in anguish. Bob kicks a chair over in frustration, the noise echoing hollowly. Audrey descends from the roof with urgency and runs at the possessed, her gun blazing, but when she aims at the boy and attempts to pull the trigger, she realizes she's out of ammo, her weapon useless. The boy stares at her with blood smeared around his mouth, a grotesque mask. In a flash, Audrey quickly gets into the van and shuts the door securely as the possessed clamber on the outside, desperate to get in. Charlie turns to Michael, who just stands there, staring at her with an unreadable expression, his thoughts a mystery."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "He sits down, settling into his seat, while she lowers her gaze, her eyes drifting downward as Jeep's face contorts into a frown, his expression becoming more severe and unyielding. He then turns on his heel and walks away, his departure causing Charlie's face to crumple with emotion, and she begins to sob, her shoulders shaking with each cry. Meanwhile, outside, wisps of cloud drift lazily across the sky, momentarily obscuring the moon. On the roof, Kyle stands beside Audrey, who is holding an assault rifle, her fingers wrapped around the grip, but she decides to lower the weapon, placing it down with a deliberate motion. Kyle averts his gaze, his eyes wandering thoughtfully as Audrey shakes her head, a broad grin spreading across her face. Audrey then looks down, her expression turning pensive, while inside the building, more lights flicker on, casting a warm glow, and the jukebox springs to life, its mechanical whirring filling the room. Back on the roof, Kyle and Audrey peer into the darkness, their eyes scanning the horizon as a vehicle speeds along the freeway, its headlights cutting through the night. Bob emerges from the kitchen, stepping into the room with a purposeful stride. Together, Bob, Jeep, and Charlie move to the window, pressing their faces close to the glass as they peer through the blinds, trying to discern what lies beyond. Audrey and Kyle continue to watch the vehicle, identifying it as a van, as it maneuvers through the chaotic jumble of cars in front of the diner. Kyle casts a dark, intense look at Audrey before he raises his assault rifle, taking aim, while Audrey follows suit, aiming her pistol at the van as it comes to a halt by the pumps. A man exits the van, his movements quick and deliberate, gesturing to the occupants inside, while a child peers out of the window, his eyes fixed on the man as he reaches for a gas nozzle. The little boy presses his hands against the window, his eyes wide as he looks up at Kyle and Audrey. Audrey dashes to the side of the roof, her feet pounding against the surface as she leans over to get a better view, and Kyle glances over as several cars emerge from the darkness, heading towards the diner. Kyle's gaze locks onto the man by the van, watching intently as the boy inside begins to bash on the window with his fists. The vehicles draw closer, and in a sudden, violent motion, the man drops the gas nozzle and sprints towards the driver's side, but a car sideswipes him, sending him flying through the air. The car screeches to a halt, and a punky-looking guy steps out, his demeanor aggressive. A van pulls up, and a chaotic rabble spills out, surrounding the van, prying it open, and seizing the boy. Kyle opens fire on the rabble, his shots precise as they encircle the boy, who is now crouched defensively on the ground. With determination, Kyle swings over the wall, leaping down from the front of the diner, and charges at the rabble, his gun blazing with each step. Inside, Bob begins to wrench the planks away from the windows, his muscles straining with the effort, but he pauses, turning to see Michael standing there, his gun trained on him. Outside, Kyle forces his way through the throng, scooping up the boy and holding him close as the rabble closes in. He picks off a few more of them, his grip on the boy firm, but as he stares out at the possessed, the boy turns to him with black, soulless eyes and sinks his teeth into Kyle's neck. Kyle collapses, his body crumpling to the ground as Bob, in a fit of frustration, kicks a chair over. Audrey descends from the roof, her feet hitting the ground as she runs at the possessed, her gun blazing, but when she aims at the boy and pulls the trigger, she realizes with horror that she's out of ammo. The boy fixes her with a stare, blood smeared around his mouth. In a desperate move, Audrey scrambles into the van, slamming the door shut as the possessed swarm over the vehicle, their hands clawing at the windows. Inside, Charlie turns to Michael, her eyes searching his face for any sign of reassurance, but he simply stares back at her, his expression unreadable."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "He sits as she looks down, noticing Jeep's expression harden before he walks away, leaving Charlie sobbing. Wisps of cloud float past the moon. On the roof, Kyle and Audrey, who initially aims an assault rifle, share a thoughtful moment before Audrey grins and puts the gun down. Inside, more lights come on and the jukebox starts playing. Kyle and Audrey watch a vehicle speed along the freeway, while Bob, Jeep, and Charlie peer through the blinds. As the van maneuvers through the cars in front of the diner, Kyle and Audrey exchange a dark look and aim their weapons at the van as it stops by the pumps. A man exits the van, gestures to the occupants, and grabs a gas nozzle, while a child inside watches Kyle and Audrey. Audrey runs to the side of the roof as more cars approach the diner. The man drops the nozzle and runs, but a car hits him. A punky-looking guy exits the car, and a rabble emerges from a van, surrounding the van and grabbing the boy. Kyle shoots at the rabble, then jumps down from the diner, firing his gun as he runs toward them. Bob starts to remove the planks from the windows but stops when Michael aims his gun at him. Kyle reaches the boy, shooting a few of the rabble while holding the boy close. The boy, revealing black eyes, bites Kyle, who collapses. Bob kicks a chair over as Audrey descends from the roof, firing at the possessed. When she aims at the boy, she's out of ammo, and the boy stares at her with blood around his mouth. Audrey retreats into the van as the possessed clamber outside. Charlie turns to Michael, who just stares at her."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "He sits, and she looks down as Jeep, known for his quiet resilience in the group, frowns and his expression hardens. He walks away, causing Charlie's face to crumple as she sobs, overwhelmed by the tension. Wisps of cloud float past the moon, a natural phenomenon often associated with calm before a storm. On the roof, Kyle is with Audrey, who's aiming an assault rifle, a weapon typically used by military personnel, but she puts the gun down. Kyle looks away thoughtfully, reminiscent of a strategic leader considering his next move, and Audrey shakes her head and grins broadly, perhaps finding humor in the intensity of the moment. Audrey looks down thoughtfully, while inside, more lights come on and the jukebox, an old model popular among nostalgic diners, whirs into action. On the roof, Kyle and Audrey look out into the darkness as a vehicle speeds along the freeway, a major road known for its long stretches and fast traffic. Bob walks out from the kitchen, where he's been preparing supplies for the group's survival. Bob, Jeep, and Charlie go to the window and peer out through the blinds, wary of what approaches. Audrey and Kyle watch the vehicle, a van often used by families for long journeys, driving between the jumble of abandoned cars in front of the diner. Kyle gives Audrey a dark look; then Kyle aims his assault rifle and Audrey aims her pistol at the van as it stops by the pumps, likely a strategic location for fuel. A man gets out of the van and gestures to the occupants, an action suggesting urgency, while a child looks out of the window at the man as he grabs a gas nozzle. With his hands pressed against the window, the little boy looks up at Kyle and Audrey. Audrey runs to the side of the roof and looks out, and Kyle looks over as several cars, resembling a convoy, drive out of the darkness towards the diner. Kyle stares down at the man by the van, and the boy bashes on the window, a desperate signal for help. The vehicles close in, and the man drops the gas nozzle and runs to the driver's side as a car side-sweeps him, sending him flying with a brutal force. The car stops, and a punky-looking guy, characterized by his worn leather jacket and piercings, gets out. A van stops, and a rabble, a disorderly group with malicious intent, spills out. They surround the van, open it, and grab the boy. Kyle shoots the rabble, displaying his sharpshooting skills, who surround the boy crouched on the ground. Kyle swings over the wall and jumps down from the front of the diner, running at the rabble, gun blazing. Bob starts to wrench the planks away from the windows, reinforced for protection against the outside threat, but turns to see Michael aiming his gun at him. Kyle barges through and picks up the boy as the rabble closes in. Kyle picks off a few of them, clutching the boy close to him as he stares out at the possessed, individuals known to be under supernatural influence. The boy looks at Kyle with black eyes, a common sign of possession, and bites Kyle in the neck. Kyle collapses as Bob kicks a chair over in frustration and fear. Audrey comes down from the roof and runs at the possessed, gun blazing, but when she aims at the boy and pulls the trigger, she's out of ammo, a critical moment of vulnerability. The boy stares at her with blood around his mouth, a chilling image of his transformation. Audrey gets in the van and shuts the door as the possessed clamber on the outside, their numbers overwhelming. Charlie turns to Michael, who just stares at her, his silence heavy with unspoken plans."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "He sits and she looks down as Jeep frowns and his expression hardens  On the roof Kyle is with Audrey who's aiming an assault rifle but she puts the gun down  Kyle looks away thoughtfully and Audrey shakes her head and grins broadly  Audrey looks down thoughtfully while inside more lights come on and the jukebox whirs into action  On the roof Kyle and Audrey look out into the darkness as a vehicle speeds along the freeway  Bob walks out from the kitchen  Bob Jeep and Charlie go to the window and peer out through the blinds  Audrey and Kyle watch the vehicle  a van driving between the jumble of cars in front of the diner  Kyle gives Audrey a dark look  then Kyle aims his assault rifle and Audrey aims her pistol at the van as it stops by the pumps  A man gets out of the van and gestures to the occupants while a child looks out of the window at the man as he grabs a gas nozzle  With his hands pressed against the window the little boy looks up at Kyle and Audrey  Audrey runs to the side of the roof and looks out and Kyle looks over as several cars drive out of the darkness towards the diner  Kyle stares down at the man by the van and the boy bashes on the window  The vehicles close in and the man drops the gas nozzle and runs to the driver's side as a car sidesweeps him sending him flying  The car stops and a punkylooking guy gets out  He walks away causing Charlie's face to crumple and she sobs  Wisps of cloud float past the moon  On the roof Kyle is with Audrey who's aiming an assault rifle but she puts the gun down  Kyle looks away thoughtfully and Audrey shakes her head and grins broadly  Audrey looks down thoughtfully while inside more lights come on and the jukebox whirs into action  On the roof Kyle and Audrey look out into the darkness as a vehicle speeds along the freeway  Bob walks out from the kitchen  Bob Jeep and Charlie go to the window and peer out through the blinds  Audrey and Kyle watch the vehicle  a van driving between the jumble of cars in front of the diner  Kyle gives Audrey a dark look  then Kyle aims his assault rifle and Audrey aims her pistol at the van as it stops by the pumps  A man gets out of the van and gestures to the occupants while a child looks out of the window at the man as he grabs a gas nozzle  With his hands pressed against the window the little boy looks up at Kyle and Audrey  Audrey runs to the side of the roof and looks out and Kyle looks over as several cars drive out of the darkness towards the diner  Kyle stares down at the man by the van and the boy bashes on the window  The vehicles close in and the man drops the gas nozzle and runs to the driver's side as a car sidesweeps him sending him flying  The car stops and a punkylooking guy gets out  A van stops and a rabble spills out  They surround the van open it and grab the boy  Kyle shoots the rabble who surround the boy crouched on the ground  Kyle swings over the wall and jumps down from the front of the diner running at the rabble gun blazing  Bob starts to wrench the planks away from the windows but turns to see Michael aiming his gun at him  Kyle barges through and picks up the boy as the rabble closes in  Kyle picks off a few of them clutching the boy close to him as he stares out at the possessed  The boy looks at Kyle with black eyes and bites Kyle in the neck  Kyle collapses as Bob kicks a chair over  Audrey comes down from the roof and runs at the possessed gun blazing but when she aims at the boy and pulls the trigger she's out of ammo  The boy stares at her with blood around his mouth  Audrey gets in the van and shuts the door as the possessed clamber on the outside  Charlie turns to Michael who just stares at her"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "He sits and she looks down as Jeep frowns and his expression hardens. He walks away causing Charlie's face to crumple and she sobs. Wisps of cloud float past the moon. On the roof Kyle is with Audrey who is aiming an assault rifle but she puts the gun down. Kyle looks away thoughtfully and Audrey shakes her head and grins broadly. Audrey looks down thoughtfully while inside more lights come on and the jukebox whirs into action. On the roof Kyle and Audrey look out into the darkness as a vehicle speeds along the freeway. Bob walks out from the kitchen. Bob Jeep and Charlie go to the window and peer out through the blinds. Audrey and Kyle watch the vehicle. a van driving between the jumble of cars in front of the diner. Kyle gives Audrey a dark look. then Kyle aims his assault rifle and Audrey aims her pistol at the van as it stops by the pumps. A man gets out of the van and gestures to the occupants while a child looks out of the window at the man as he grabs a gas nozzle. With his hands pressed against the window the little boy looks up at Kyle and Audrey. Audrey runs to the side of the roof and looks out and Kyle looks over as several cars drive out of the darkness towards the diner. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. Kyle stares down at the man by the van and the boy bashes on the window. The vehicles close in and the man drops the gas nozzle and runs to the driver's side as a car sidesweeps him sending him flying. The car stops and a punkylooking guy gets out. A van stops and a rabble spills out. They surround the van open it and grab the boy. Kyle shoots the rabble who surround the boy crouched on the ground. Kyle swings over the wall and jumps down from the front of the diner running at the rabble gun blazing. Bob starts to wrench the planks away from the windows but turns to see Michael aiming his gun at him. Kyle barges through and picks up the boy as the rabble closes in. Kyle picks off a few of them clutching the boy close to him as he stares out at the possessed. The boy looks at Kyle with black eyes and bites Kyle in the neck. Kyle collapses as Bob kicks a chair over. Audrey comes down from the roof and runs at the possessed gun blazing but when she aims at the boy and pulls the trigger she is out of ammo. The boy stares at her with blood around his mouth. Audrey gets in the van and shuts the door as the possessed clamber on the outside. Charlie turns to Michael who just stares at her."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "He sits and she looks down as Jeep frowns and his expression hardens. He walks away causing Charlie's face to crumple and she sobs. Wisps of cloud float past the moon. On the roof Kyle is with Audrey who is aiming an assault rifle but she puts the gun down. Kyle looks away thoughtfully and Audrey shakes her head and grins broadly. Audrey looks down thoughtfully while inside more lights come on and the jukebox whirs into action. On the roof Kyle and Audrey look out into the darkness as a vehicle speeds along the freeway. Bob walks out from the kitchen. Bob Jeep and Charlie go to the window and peer out through the blinds. Audrey and Kyle watch the vehicle. a van driving between the jumble of cars in front of the diner. Kyle gives Audrey a dark look. then Kyle aims his assault rifle and Audrey aims her pistol at the van as it stops by the pumps. A man gets out of the van and gestures to the occupants while a child looks out of the window at the man as he grabs a gas nozzle. With his hands pressed against the window the little boy looks up at Kyle and Audrey. Audrey runs to the side of the roof and looks out and Kyle looks over as several cars drive out of the darkness towards the diner. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Kyle stares down at the man by the van and the boy bashes on the window. The vehicles close in and the man drops the gas nozzle and runs to the driver's side as a car sidesweeps him sending him flying. The car stops and a punkylooking guy gets out. A van stops and a rabble spills out. They surround the van open it and grab the boy. Kyle shoots the rabble who surround the boy crouched on the ground. Kyle swings over the wall and jumps down from the front of the diner running at the rabble gun blazing. Bob starts to wrench the planks away from the windows but turns to see Michael aiming his gun at him. Kyle barges through and picks up the boy as the rabble closes in. Kyle picks off a few of them clutching the boy close to him as he stares out at the possessed. The boy looks at Kyle with black eyes and bites Kyle in the neck. Kyle collapses as Bob kicks a chair over. Audrey comes down from the roof and runs at the possessed gun blazing but when she aims at the boy and pulls the trigger she is out of ammo. The boy stares at her with blood around his mouth. Audrey gets in the van and shuts the door as the possessed clamber on the outside. Charlie turns to Michael who just stares at her."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "He sits and she looks down as Jeep frowns and his expression hardens. He walks away causing Charlie's face to crumple and she sobs. Wisps of cloud float past the moon. On the roof Kyle is with Audrey who is aiming an assault rifle but she puts the gun down. Kyle looks away thoughtfully and Audrey shakes her head and grins broadly. Audrey looks down thoughtfully while inside more lights come on and the jukebox whirs into action. On the roof Kyle and Audrey look out into the darkness as a vehicle speeds along the freeway. Bob walks out from the kitchen. Kyle barges through and picks up the boy as the rabble closes in. Kyle picks off a few of them clutching the boy close to him as he stares out at the possessed. The boy looks at Kyle with black eyes and bites Kyle in the neck. Kyle collapses as Bob kicks a chair over. Audrey comes down from the roof and runs at the possessed gun blazing but when she aims at the boy and pulls the trigger she is out of ammo. The boy stares at her with blood around his mouth. Audrey gets in the van and shuts the door as the possessed clamber on the outside. Charlie turns to Michael who just stares at her."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "He sits and she looks down as Jeep frowns and his expression hardens. He walks away causing Charlie's face to crumple and she sobs. Wisps of cloud float past the moon. On the roof Kyle is with Audrey who is aiming an assault rifle but she puts the gun down. The boy stares at her with blood around his mouth. Audrey gets in the van and shuts the door as the possessed clamber on the outside. Charlie turns to Michael who just stares at her."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The dog sits, and the horse looks down as the cat frowns and its expression hardens. The dog walks away, causing the rabbit's face to crumple and the horse sobs. Wisps of cloud float past the moon. On the roof, the parrot is with the fish, who's aiming an assault rifle, but it puts the gun down. The parrot looks away thoughtfully, and the fish shakes its head and grins broadly. The fish looks down thoughtfully, while inside, more lights come on and the jukebox whirs into action. On the roof, the parrot and the fish look out into the darkness as a vehicle speeds along the freeway. The turtle walks out from the kitchen. The turtle, the cat, and the rabbit go to the window and peer out through the blinds. The fish and the parrot watch the vehicle, a van, driving between the jumble of cars in front of the diner. The parrot gives the fish a dark look; then the parrot aims its assault rifle and the fish aims its pistol at the van as it stops by the pumps. A chicken gets out of the van and gestures to the occupants, while a child looks out of the window at the chicken as it grabs a gas nozzle. With its hands pressed against the window, the little boy looks up at the parrot and the fish. The fish runs to the side of the roof and looks out, and the parrot looks over as several cars drive out of the darkness towards the diner. The parrot stares down at the chicken by the van, and the boy bashes on the window. The vehicles close in, and the chicken drops the gas nozzle and runs to the driver's side as a car side-sweeps it, sending it flying. The car stops, and a punky-looking owl gets out. A van stops, and a rabble spills out. They surround the van, open it, and grab the boy. The parrot shoots the rabble, who surround the boy crouched on the ground. The parrot swings over the wall and jumps down from the front of the diner, running at the rabble, gun blazing. The turtle starts to wrench the planks away from the windows, but turns to see the gorilla aiming its gun at the turtle. The parrot barges through and picks up the boy as the rabble closes in. The parrot picks off a few of them, clutching the boy close to it as it stares out at the possessed. The boy looks at the parrot with black eyes and bites the parrot in the neck. The parrot collapses as the turtle kicks a chair over. The fish comes down from the roof and runs at the possessed, gun blazing, but when it aims at the boy and pulls the trigger, it's out of ammo. The boy stares at the fish with blood around its mouth. The fish gets in the van and shuts the door as the possessed clamber on the outside. The rabbit turns to the gorilla, who just stares at the rabbit."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "He sits, and she looks down as Jeep frowns and his expression hardens. He walks away, causing Charlie's face to crumple and she sobs. Wisps of fog float past the lighthouse. On the deck, Kyle is with Audrey, who's aiming a bow, but she puts the bow down. Kyle looks away thoughtfully, and Audrey shakes her head and grins broadly. Audrey looks down thoughtfully, while inside, more lamps come on and the radio whirs into action. On the deck, Kyle and Audrey look out into the darkness as a bicycle speeds along the trail. Bob walks out from the shed. Bob, Jeep, and Charlie go to the window and peer out through the curtains. Audrey and Kyle watch the bicycle, a wagon, rolling between the jumble of tents in front of the cabin. Kyle gives Audrey a dark look; then Kyle aims his bow and Audrey aims her slingshot at the wagon as it stops by the barrels. A woman gets out of the wagon and gestures to the occupants, while a dog looks out of the window at the woman as she grabs a hose. With his paws pressed against the window, the little dog looks up at Kyle and Audrey. Audrey runs to the side of the deck and looks out, and Kyle looks over as several motorcycles drive out of the darkness towards the cabin. Kyle stares down at the woman by the wagon, and the dog bashes on the window. The motorcycles close in, and the woman drops the hose and runs to the driver's side as a bike side-swipes her, sending her flying. The bike stops, and a scruffy-looking girl gets out. A wagon stops, and a crowd spills out. They surround the wagon, open it, and grab the dog. Kyle shoots the crowd, who surround the dog crouched on the ground. Kyle swings over the railing and jumps down from the front of the cabin, running at the crowd, bow blazing. Bob starts to wrench the boards away from the windows, but turns to see Michael aiming his bow at him. Kyle barges through and picks up the dog as the crowd closes in. Kyle picks off a few of them, clutching the dog close to him as he stares out at the possessed. The dog looks at Kyle with black eyes and bites Kyle in the hand. Kyle collapses as Bob kicks a stool over. Audrey comes down from the deck and runs at the possessed, bow blazing, but when she aims at the dog and pulls the trigger, she's out of ammo. The dog stares at her with blood around his snout. Audrey gets in the wagon and shuts the door as the possessed clamber on the outside. Charlie turns to Michael, who just stares at her."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "He reclines, and she glances down as Jeep pouts and his expression softens. He skips away, causing Charlie's face to brighten and she giggles. Wisps of cloud drift past the moon. On the roof, Kyle is with Audrey, who's tossing an assault rifle, but she picks the gun up. Kyle gazes away dreamily, and Audrey nods her head and frowns slightly. Audrey glances down dreamily, while inside, more lights dim and the jukebox clicks into action. On the roof, Kyle and Audrey gaze out into the dusk as a vehicle crawls along the freeway. Bob strides out from the kitchen. Bob, Jeep, and Charlie head to the window and glance out through the blinds. Audrey and Kyle observe the vehicle, a van, meandering between the jumble of cars in front of the diner. Kyle gives Audrey a bright look; then Kyle lowers his assault rifle and Audrey lowers her pistol at the van as it idles by the pumps. A man climbs out of the van and beckons to the occupants, while a child peers out of the window at the man as he drops a gas nozzle. With his hands pressed against the window, the little boy glances up at Kyle and Audrey. Audrey dashes to the side of the roof and glances out, and Kyle peers over as several cars roll out of the dusk towards the diner. Kyle glances down at the man by the van, and the boy taps on the window. The vehicles drift in, and the man sets down the gas nozzle and jogs to the driver's side as a car taps him, sending him rolling. The car idles, and a punky-looking guy saunters out. A van idles, and a rabble spills out. They surround the van, unlatch it, and lift the boy. Kyle waves at the rabble, who gather around the boy crouched on the ground. Kyle hops over the wall and climbs down from the front of the diner, strolling at the rabble, hands waving. Bob starts to slide the planks away from the windows, but turns to see Michael lowering his gun at him. Kyle strides through and lifts the boy as the rabble closes in. Kyle greets a few of them, clutching the boy close to him as he glances out at the possessed. The boy examines Kyle with black eyes and pokes Kyle in the arm. Kyle kneels as Bob knocks a chair over. Audrey descends from the roof and strolls at the possessed, hands waving, but when she waves at the boy and lifts the trigger, she's out of ammo. The boy gazes at her with jam around his mouth. Audrey climbs in the van and shuts the door as the possessed tap on the outside. Charlie turns to Michael, who just gazes at her."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "The sofa sits, and the suitcase looks down as the lamp frowns and its expression hardens. The sofa walks away, causing the cushion's face to crumple and the suitcase sobs. Wisps of smoke float past the streetlight. On the cliff, the pencil is with the notebook, who's aiming a water pistol, but it puts the toy down. The pencil looks away thoughtfully, and the notebook shakes its head and grins broadly. The notebook looks down thoughtfully, while inside, more fans come on and the washing machine whirs into action. On the cliff, the pencil and the notebook look out into the brightness as a bicycle speeds along the railway. The stapler walks out from the attic. The stapler, the lamp, and the cushion go to the window and peer out through the curtains. The notebook and the pencil watch the bicycle, a skateboard, weaving between the jungle of tents in front of the tent. The pencil gives the notebook a curious look; then the pencil aims its water pistol and the notebook aims its slingshot at the skateboard as it stops by the benches. An astronaut gets out of the skateboard and gestures to the spectators, while a puppy looks out of the window at the astronaut as it grabs a paintbrush. With its hands pressed against the window, the kitten looks up at the pencil and the notebook. The notebook runs to the side of the cliff and looks out, and the pencil looks over as several bicycles glide out of the brightness towards the tent. The pencil stares down at the astronaut by the skateboard, and the puppy bangs on the window. The bicycles close in, and the astronaut drops the paintbrush and runs to the conductor's side as a motorcycle side-swipes them, sending them soaring. The motorcycle halts, and a nerdy-looking girl gets out. A scooter stops, and a circus spills out. They surround the skateboard, open it, and grab the kitten. The pencil shoots the circus, who surround the kitten crouched on the pavement. The pencil swings over the railing and jumps down from the top of the tent, dashing at the circus, water pistol blazing. The stapler starts to tug the books away from the doors, but turns to see the giraffe aiming its slingshot at them. The pencil charges through and picks up the kitten as the circus closes in. The pencil picks off a few of them, clutching the kitten close to it as it stares out at the enchanted. The kitten looks at the pencil with green eyes and bites the pencil in the shoulder. The pencil collapses as the stapler pitches a table over. The notebook comes down from the cliff and runs at the enchanted, toy blazing, but when it aims at the kitten and pulls the lever, it's out of darts. The kitten stares at it with chocolate around its mouth. The notebook gets in the skateboard and shuts the hatch as the enchanted clamber on the outside. The cushion turns to the giraffe, who just stares at it."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "He reclines, and she glances up as Tractor grimaces and his demeanor softens. He wanders off, causing Lucy's eyes to sparkle and she giggles. Strands of mist drift past the stars. On the porch, Max is with Morgan, who's balancing a skateboard, but she sets the board aside. Max gazes around absentmindedly, and Morgan shrugs and chuckles softly. Morgan glances up dreamily, while inside, more shadows move around and the fireplace crackles into life. On the porch, Max and Morgan gaze out into the horizon as a balloon drifts along the skyline. Sam emerges from the office. Sam, Tractor, and Lucy move to the bookshelf and glance out through the curtains. Morgan and Max observe the balloon, a blimp, gliding between the cluster of trees in front of the cabin. Max throws Morgan a curious glance; then Max reads his book thoughtfully and Morgan stretches her arms at the blimp as it lingers by the fence. A woman steps out of the blimp and waves to the passengers, while a cat peeks out of the basket at the woman as she inspects a garden hose. With his paws pressed against the window, the little kitten gazes up at Max and Morgan. Morgan dashes to the edge of the porch and peers out, and Max looks over as several bicycles glide out of the shadows towards the cabin. Max squints down at the woman by the blimp, and the kitten scratches on the window. The bicycles close in, and the woman drops the garden hose and leaps to the rider's side as a scooter nudges her, sending her sprawling. The scooter halts, and a scruffy-looking girl dismounts. A blimp hovers, and a mob pours out. They circle the blimp, pry it open, and lift the kitten. Max darts at the crowd, who surround the kitten crouched on the bench. Max leaps over the railing and slides down from the side of the cabin, sprinting at the crowd, book in hand. Sam begins to yank the drapes away from the windows, but pivots to see Gabriel aiming his camera at him. Max pushes through and scoops up the kitten as the mob converges. Max singles out a few of them, squeezing the kitten gently as he gazes out at the afflicted. The kitten gazes at Max with fierce eyes and nibbles Max on the ear. Max collapses as Sam tips a vase over. Morgan descends from the porch and rushes at the afflicted, book waving, but when she confronts the kitten and flips the pages, she finds nothing useful. The kitten gazes at her with ink around his mouth. Morgan climbs into the blimp and closes the hatch as the afflicted climb on the side. Lucy turns to Gabriel, who just gazes back at her."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "He kneels, and she turns up as Truck scowls and his demeanor softens. He strides away, causing Charlie's lips to quiver and she giggles. Flakes of mist drift past the star. On the balcony, Kyle is with Audrey, who's aiming a water cannon, but she places the cannon aside. Kyle glances away pensively, and Audrey nods her head and chuckles loudly. Audrey stares up pensively, while inside, additional candles flicker and the radio buzzes into life. On the terrace, Kyle and Audrey gaze out into the brightness as a bicycle cruises along the railway. Bob storms out from the pantry. Bob, Truck, and Charlie go to the curtain and gaze out through the shutters. Audrey and Kyle observe the bicycle, a scooter, weaving between the stack of trees in front of the café. Kyle gives Audrey an annoyed glance; then Kyle points his water cannon and Audrey points her slingshot at the scooter as it halts by the barrels. A woman steps out of the scooter and signals to the figures, while a puppy peers out of the curtain at the woman as she seizes a watering can. With his paws pressed against the curtain, the little puppy gazes up at Kyle and Audrey. Audrey sprints to the edge of the balcony and peers out, and Kyle glances over as several bicycles glide out of the brightness towards the café. Kyle glares down at the woman by the scooter, and the puppy taps on the curtain. The vehicles converge, and the woman drops the watering can and dashes to the passenger's side as a bicycle brushes against her, sending her spinning. The bicycle ceases, and a quirky-looking woman emerges. A scooter stops, and a crowd trickles out. They encircle the scooter, unlatch it, and seize the puppy. Kyle fires at the crowd, who encircle the puppy crouched on the pavement. Kyle vaults over the barrier and leaps down from the side of the café, sprinting at the crowd, horn blaring. Bob starts to yank the shingles away from the curtains, but turns to see Michael pointing his horn at him. Kyle charges through and lifts the puppy as the crowd tightens. Kyle picks off a few of them, cradling the puppy close to him as he squints out at the transformed. The puppy gazes at Kyle with white eyes and nibbles Kyle on the arm. Kyle tumbles as Bob topples a stool. Audrey descends from the balcony and dashes at the transformed, horn blaring, but when she aims at the puppy and presses the button, she's out of power. The puppy gazes at her with ink around his snout. Audrey clambers in the scooter and seals the entrance as the transformed scramble on the exterior. Charlie turns to Michael, who merely gazes at her."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "The cat relaxes, and the parrot gazes upward as the bicycle chuckles and its demeanor softens. The cat jogs away, prompting the robot's screen to flicker and it giggles. Threads of cobweb drift past the candle. On the balcony, the carpenter is with the jester, who's pointing a slingshot, but they toss the rubber band aside. The carpenter glances away wistfully, and the jester shrugs and beams brightly. The jester glances down introspectively, while inside, more lanterns flicker on and the phonograph hums into motion. On the balcony, the carpenter and the jester gaze into the oblivion as a skateboard zips along the thoroughfare. The farmer shuffles out from the cellar. The farmer, the bicycle, and the robot amble to the doorway and peek through the shutters. The jester and the carpenter observe the skateboard, a tricycle, navigating through the cluster of carts in front of the pizzeria. The carpenter casts the jester a piercing glance; then the carpenter points their slingshot and the jester lifts her water gun at the tricycle as it halts by the hydrants. A llama leaps out of the tricycle and signals to the riders, while a kitten peers through the skylight at the llama as it hoists a watering can. With its paws pressed against the skylight, the tiny feline gazes up at the carpenter and the jester. The jester dashes to the edge of the balcony and scans outward, and the carpenter peers over as numerous wagons glide out of the shadows towards the pizzeria. The carpenter glares at the llama by the tricycle, and the kitten taps on the skylight. The wagons advance, and the llama drops the watering can and gallops to the conductor's side as a wagon edges against it, sending it soaring. The wagon halts, and a spiky-haired youth hops out. A tricycle pauses, and a horde tumbles forth. They encircle the tricycle, pry it open, and snatch the kitten. The carpenter fires at the horde, who surround the kitten hunkered on the carpet. The carpenter flips over the partition and descends from the façade of the pizzeria, dashing at the horde, slingshot blazing. The farmer begins to yank the shutters away from the doorways, but pivots to find the wizard pointing his wand at them. The carpenter busts through and hoists the kitten as the horde tightens its encirclement. The carpenter eliminates a few of them, holding the kitten snug as they peer at the enchanted. The kitten gazes at the carpenter with glowing eyes and nibbles the carpenter on the paw. The carpenter crumples as the farmer topples a stool. The jester descends from the balcony and rushes towards the enchanted, slingshot blazing, but when they aim at the kitten and squeeze the trigger, they're out of pebbles. The kitten fixes her with a stare, crimson dripping from its mouth. The jester slides into the tricycle and latches the portal as the enchanted clamber atop. The robot turns to the wizard, who solely gazes at them."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Jeep frowns and walks away, causing Charlie to sob. On the roof, Kyle and Audrey look out into the darkness; Audrey puts down her rifle and grins at Kyle. Inside, more lights illuminate, and the jukebox activates. Kyle and Audrey watch as a van speeds along the freeway toward the diner. Bob, Jeep, and Charlie peer through the window blinds. The van stops by the pumps, and its driver gestures to its occupants. A boy inside looks up at Kyle and Audrey. As the vehicles close in, the driver drops the gas nozzle and is hit by a car. A gang surrounds the van, grabs the boy, and Kyle shoots at them before leaping from the diner roof to rescue him. Bob tries to break the window planks but hesitates when Michael aims his gun. Kyle rescues the boy, only to be bitten in the neck. As Kyle collapses, Audrey runs out of ammo trying to shoot the boy, who has blood around his mouth. She retreats to the van as the possessed swarm outside. Meanwhile, Charlie turns to Michael, who just stares at her."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Charlie turns to Michael who just stares at her Audrey gets in the van and shuts the door as the possessed clamber on the outside  The boy stares at her with blood around his mouth  Audrey comes down from the roof and runs at the possessed gun blazing but when she aims at the boy and pulls the trigger she's out of ammo  Kyle collapses as Bob kicks a chair over  The boy looks at Kyle with black eyes and bites Kyle in the neck  Kyle picks off a few of them clutching the boy close to him as he stares out at the possessed  Kyle barges through and picks up the boy as the rabble closes in  Bob starts to wrench the planks away from the windows but turns to see Michael aiming his gun at him  Kyle swings over the wall and jumps down from the front of the diner running at the rabble gun blazing  Kyle shoots the rabble who surround the boy crouched on the ground  They surround the van open it and grab the boy  A van stops and a rabble spills out  The car stops and a punkylooking guy gets out  The vehicles close in and the man drops the gas nozzle and runs to the driver's side as a car sidesweeps him sending him flying  Kyle stares down at the man by the van and the boy bashes on the window  Audrey runs to the side of the roof and looks out and Kyle looks over as several cars drive out of the darkness towards the diner  With his hands pressed against the window the little boy looks up at Kyle and Audrey  A man gets out of the van and gestures to the occupants while a child looks out of the window at the man as he grabs a gas nozzle  then Kyle aims his assault rifle and Audrey aims her pistol at the van as it stops by the pumps  Kyle gives Audrey a dark look  a van driving between the jumble of cars in front of the diner  Audrey and Kyle watch the vehicle  Bob Jeep and Charlie go to the window and peer out through the blinds  Bob walks out from the kitchen  On the roof Kyle and Audrey look out into the darkness as a vehicle speeds along the freeway  Audrey looks down thoughtfully while inside more lights come on and the jukebox whirs into action  Kyle looks away thoughtfully and Audrey shakes her head and grins broadly  On the roof Kyle is with Audrey who's aiming an assault rifle but she puts the gun down  Wisps of cloud float past the moon  He walks away causing Charlie's face to crumple and she sobs  He sits and she looks down as Jeep frowns and his expression hardens "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Bob starts to wrench the planks away from the windows but turns to see Michael aiming his gun at him  Kyle picks off a few of them clutching the boy close to him as he stares out at the possessed  Bob walks out from the kitchen  Kyle swings over the wall and jumps down from the front of the diner running at the rabble gun blazing  A man gets out of the van and gestures to the occupants while a child looks out of the window at the man as he grabs a gas nozzle  He sits and she looks down as Jeep frowns and his expression hardens  A van stops and a rabble spills out  Audrey runs to the side of the roof and looks out and Kyle looks over as several cars drive out of the darkness towards the diner  Audrey looks down thoughtfully while inside more lights come on and the jukebox whirs into action  Audrey and Kyle watch the vehicle  Audrey comes down from the roof and runs at the possessed gun blazing but when she aims at the boy and pulls the trigger she's out of ammo  The car stops and a punkylooking guy gets out  The vehicles close in and the man drops the gas nozzle and runs to the driver's side as a car sidesweeps him sending him flying  Charlie turns to Michael who just stares at her Kyle stares down at the man by the van and the boy bashes on the window  Kyle shoots the rabble who surround the boy crouched on the ground  With his hands pressed against the window the little boy looks up at Kyle and Audrey  He walks away causing Charlie's face to crumple and she sobs  The boy stares at her with blood around his mouth  They surround the van open it and grab the boy  Kyle gives Audrey a dark look  The boy looks at Kyle with black eyes and bites Kyle in the neck  then Kyle aims his assault rifle and Audrey aims her pistol at the van as it stops by the pumps  Wisps of cloud float past the moon  On the roof Kyle is with Audrey who's aiming an assault rifle but she puts the gun down  Audrey gets in the van and shuts the door as the possessed clamber on the outside  Kyle barges through and picks up the boy as the rabble closes in  On the roof Kyle and Audrey look out into the darkness as a vehicle speeds along the freeway  Kyle looks away thoughtfully and Audrey shakes her head and grins broadly  Bob Jeep and Charlie go to the window and peer out through the blinds  a van driving between the jumble of cars in front of the diner  Kyle collapses as Bob kicks a chair over "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Kyle stares down at the man by the van and the boy bashes on the window  The vehicles close in and the man drops the gas nozzle and runs to the driver's side as a car sidesweeps him sending him flying  The car stops and a punkylooking guy gets out  A van stops and a rabble spills out  They surround the van open it and grab the boy  Kyle shoots the rabble who surround the boy crouched on the ground  Kyle swings over the wall and jumps down from the front of the diner running at the rabble gun blazing  Bob starts to wrench the planks away from the windows but turns to see Michael aiming his gun at him  Kyle barges through and picks up the boy as the rabble closes in  Kyle picks off a few of them clutching the boy close to him as he stares out at the possessed  The boy looks at Kyle with black eyes and bites Kyle in the neck  Kyle collapses as Bob kicks a chair over  Audrey comes down from the roof and runs at the possessed gun blazing but when she aims at the boy and pulls the trigger she's out of ammo  The boy stares at her with blood around his mouth  Audrey gets in the van and shuts the door as the possessed clamber on the outside  Charlie turns to Michael who just stares at her He sits and she looks down as Jeep frowns and his expression hardens  He walks away causing Charlie's face to crumple and she sobs  Wisps of cloud float past the moon  On the roof Kyle is with Audrey who's aiming an assault rifle but she puts the gun down  Kyle looks away thoughtfully and Audrey shakes her head and grins broadly  Audrey looks down thoughtfully while inside more lights come on and the jukebox whirs into action  On the roof Kyle and Audrey look out into the darkness as a vehicle speeds along the freeway  Bob walks out from the kitchen  Bob Jeep and Charlie go to the window and peer out through the blinds  Audrey and Kyle watch the vehicle  a van driving between the jumble of cars in front of the diner  Kyle gives Audrey a dark look  then Kyle aims his assault rifle and Audrey aims her pistol at the van as it stops by the pumps  A man gets out of the van and gestures to the occupants while a child looks out of the window at the man as he grabs a gas nozzle  With his hands pressed against the window the little boy looks up at Kyle and Audrey  Audrey runs to the side of the roof and looks out and Kyle looks over as several cars drive out of the darkness towards the diner "
        }
      ]
    }
  ]
}