{
  "ground_truth": "Underwater, a French tricolor is visible. A wooden galleon is being hauled into a dry dock in rough seas, listing heavily to its starboard side. Lines of men in the dry dock pull on heavy ropes attached to the ship, with those in the center waist-high in water. Others are positioned at higher levels. The men are scruffy, unshaven prisoners who grunt as they pull in unison, with rough, chained hands moving the rope. A grave-looking man in a blue uniform named Javert watches from above on the quay side, staring intently at one particular prisoner who avoids his gaze. The ship is now in the dock, and the prisoners begin to file out. Javert stops one, the same prisoner he had been watching closely. This tall prisoner, who has a beard, closely-cropped hair, and a stoop, turns back from a broken flagpole on the ground. Another prisoner is stopped from following him. The flagpole is long and thick, and the prisoner heaves, squatting and raising one end onto his shoulder. He struggles to his feet and, grimacing, lumbers forward under Javert's cold gaze. The flag, still attached to the pole, drags through the water as the prisoner reaches Javert and drops the pole. Javert's eyes remain fixed on Valjean, who staggers away from the dry dock. Valjean, using a stout staff, plods across rocky terrain towards a cross on a mountain summit. He passes the cross and looks ahead as the sun begins to rise. He walks up a snow-covered hillside, silhouetted against the skyline, with a satchel over his shoulder. Stepping onto a ledge, he glances at the mountains and stops by a farmer upon seeing men at work. The farmer reads them as Valjean removes his woolen hat. As Valjean leaves, a fleshy-jowled town hall officer speaks to a guard. On the street, children throw stones at Valjean, who later warms his hands at a fire in an inn. Valjean is then attacked outside, punched, and kicked. Wandering through a churchyard, he lies down by the church, where something startles him: a bishop holding a lamp. Valjean frowns, then crouches by a blazing fire and eats at a table, shoveling food. He stops momentarily to stare at the bishop and two women by the table. On his feet, he watches as one woman places silverware in a cupboard. Later, lying in bed, he stares up at the ornate ceiling before going to the cupboard. As the bishop sleeps, Valjean stuffs silverware into his satchel.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Beneath, a French flag is perceptible. A timber galleon is being pulled into a dry dock in harsh waters, tilting significantly to its right side. Rows of men in the dry dock tug on hefty cords affixed to the vessel, with those in the middle waist-high in liquid. Others are stationed at elevated levels. The men are disheveled, unshaven captives who groan as they tug in harmony, with coarse, manacled hands shifting the cord. A somber-appearing man in a blue attire named Javert observes from above on the quay side, gazing intently at one particular captive who shuns his stare. The vessel is now in the dock, and the captives commence to file out. Javert halts one, the same captive he had been observing attentively. This tall captive, who has a beard, closely-cropped hair, and a stoop, turns back from a fractured flagpole on the ground. Another captive is stopped from trailing him. The flagpole is lengthy and thick, and the captive hoists, crouching and lifting one extremity onto his shoulder. He struggles to his feet and, grimacing, trudges forward under Javert's frigid gaze. The flag, still affixed to the pole, drags through the liquid as the captive reaches Javert and drops the pole. Javert's eyes remain fixed on Valjean, who staggers away from the dry dock. Valjean, using a sturdy staff, trudges across stony landscape towards a cross on a mountain peak. He passes the cross and looks forward as the sun starts to rise. He strides up a snow-covered slope, silhouetted against the horizon, with a satchel over his shoulder. Stepping onto a shelf, he glances at the mountains and halts by a farmer upon seeing men at labor. The farmer regards them as Valjean removes his woolen cap. As Valjean departs, a fleshy-jowled town hall official speaks to a guard. On the street, children hurl stones at Valjean, who later warms his hands at a blaze in an inn. Valjean is then assaulted outside, struck, and kicked. Roaming through a churchyard, he reclines by the church, where something startles him: a bishop holding a lamp. Valjean frowns, then crouches by a roaring fire and eats at a table, shoveling nourishment. He halts momentarily to gaze at the bishop and two women by the table. On his feet, he watches as one woman places cutlery in a cupboard. Later, lying in bed, he stares up at the ornate roof before going to the cupboard. As the bishop slumbers, Valjean stuffs cutlery into his satchel."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Underwater, a French tricolor can be seen. A wooden galleon is hauled into a dry dock in rough seas, and it lists heavily to its starboard side. Heavy ropes attached to the ship are pulled by lines of men in the dry dock, with those in the center waist-high in water. Others position themselves at higher levels. They are scruffy, unshaven prisoners who grunt as they pull in unison, and their rough, chained hands move the rope. Javert, a grave-looking man in a blue uniform, watches from above on the quay side, and he stares intently at one particular prisoner who avoids his gaze. The dock now holds the ship, and the prisoners begin to file out. Javert stops one, the same prisoner he had watched closely. This tall prisoner, with a beard, closely-cropped hair, and a stoop, turns back from a broken flagpole on the ground. Another prisoner is prevented from following him. The flagpole is long and thick, and the prisoner heaves, squatting and raising one end onto his shoulder. He struggles to his feet and, grimacing, lumbers forward under the cold gaze of Javert. The flag, still attached to the pole, drags through the water as the prisoner reaches Javert and drops the pole. The fixed eyes of Javert remain on Valjean, who staggers away from the dry dock. Using a stout staff, Valjean plods across rocky terrain towards a cross on a mountain summit. He passes the cross and looks ahead as the sun begins to rise. He walks up a snow-covered hillside, silhouetted against the skyline, with a satchel over his shoulder. Stepping onto a ledge, he glances at the mountains and stops by a farmer upon seeing men at work. The farmer reads them as Valjean removes his woolen hat. As Valjean leaves, a fleshy-jowled town hall officer speaks to a guard. On the street, stones are thrown by children at Valjean, who later warms his hands at a fire in an inn. Outside, Valjean is then attacked, punched, and kicked. Wandering through a churchyard, he lies down by the church, where something startles him: a bishop holding a lamp. Valjean frowns, then crouches by a blazing fire and eats at a table, shoveling food. Stopping momentarily, he stares at the bishop and two women by the table. On his feet, he watches as one woman places silverware in a cupboard. Later, lying in bed, he stares up at the ornate ceiling before he goes to the cupboard. As the bishop sleeps, silverware is stuffed into his satchel by Valjean."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Underwater, a French tricolor is visible. A wooden galleon is hauled into a dry dock in rough seas, listing heavily to starboard. Lines of scruffy, unshaven prisoners pull on heavy ropes, some waist-high in water, others at higher levels. They grunt in unison, moving the rope with chained hands. A grave-looking man in a blue uniform, Javert, watches from the quay, focusing on one prisoner who avoids his gaze. The ship is docked, and prisoners file out. Javert stops the tall, bearded prisoner he watched closely. This prisoner, with closely-cropped hair and a stoop, turns from a broken flagpole. Another prisoner is stopped from following. The prisoner heaves the long, thick flagpole onto his shoulder, struggling under Javert's cold gaze. The flag drags through the water as he reaches Javert and drops the pole. Javert's eyes remain on Valjean, who staggers away. Valjean, using a stout staff, plods across rocky terrain toward a mountain summit cross. He passes the cross as the sun rises, walking up a snow-covered hillside, silhouetted against the skyline with a satchel. On a ledge, he glances at the mountains and stops by a farmer, removing his woolen hat. As Valjean leaves, a fleshy-jowled town hall officer speaks to a guard. On the street, children throw stones at Valjean, who later warms his hands at an inn's fire. Valjean is attacked outside, punched, and kicked. Wandering through a churchyard, he lies by the church, startled by a bishop holding a lamp. Valjean frowns, then crouches by a fire, eating at a table, and stops to stare at the bishop and two women. On his feet, he watches a woman place silverware in a cupboard. Later, in bed, he stares at the ornate ceiling before going to the cupboard. As the bishop sleeps, Valjean stuffs silverware into his satchel."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Underwater, a French tricolor is visible. A wooden galleon is hauled into a dry dock in rough seas, listing heavily starboard. Men in the dock pull on heavy ropes, some waist-high in water, others higher. The scruffy, unshaven prisoners grunt in unison, with chained hands moving the rope. Javert, in a blue uniform, watches from the quay, focusing on one prisoner who avoids his gaze. The ship is docked, and prisoners file out. Javert stops the prisoner he watched closely. This tall, bearded prisoner with cropped hair and a stoop turns from a broken flagpole. Another prisoner is stopped from following. The prisoner heaves the long, thick flagpole onto his shoulder, struggling under Javert's gaze. The flag drags through water as he reaches Javert and drops the pole. Javert's eyes remain on Valjean, who staggers away. Valjean, using a staff, plods across rocky terrain towards a mountain cross. He passes it as the sun rises, walking up a snow-covered hillside with a satchel. On a ledge, he glances at mountains and stops by a farmer, removing his hat. As Valjean leaves, a town hall officer speaks to a guard. Children throw stones at Valjean, who later warms his hands at an inn fire. Attacked outside, he is punched and kicked. In a churchyard, he lies down, startled by a bishop with a lamp. Valjean frowns, crouches by a fire, and eats at a table, staring at the bishop and two women. On his feet, he watches a woman place silverware in a cupboard. Later, in bed, he stares at the ceiling before going to the cupboard. As the bishop sleeps, Valjean stuffs silverware into his satchel."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Beneath the surface of the water, the vibrant colors of a French tricolor flag can be seen fluttering. A large, wooden galleon is being laboriously hauled into a dry dock amidst the tumultuous, rough seas, listing heavily to its starboard side as it is maneuvered. Lines of men, standing in the dry dock, are pulling with all their might on the heavy ropes that are securely attached to the ship, with those positioned in the center standing waist-high in the churning water. Others are strategically positioned at higher levels, working in unison. These men are scruffy, unshaven prisoners, their faces marked by hardship, who grunt and strain as they pull together, their rough, chained hands moving rhythmically along the rope. Overseeing this arduous task is a grave-looking man dressed in a blue uniform, known as Javert, who watches from above on the quay side. His eyes are fixed intently on one particular prisoner who deliberately avoids meeting his gaze. As the ship finally settles into the dock, the prisoners begin to file out in an orderly manner. Javert, however, stops one of them, the very same prisoner he had been observing so closely. This tall prisoner, with a beard, closely-cropped hair, and a noticeable stoop, turns back from a broken flagpole lying on the ground. Another prisoner is prevented from following him. The flagpole is long and thick, and the prisoner heaves with effort, squatting down and raising one end onto his shoulder. He struggles to his feet, grimacing with the exertion, and lumbers forward under the cold, unyielding gaze of Javert. The flag, still attached to the pole, drags through the water as the prisoner reaches Javert and drops the pole at his feet. Javert's eyes remain fixed on Valjean, who staggers away from the dry dock, his movements heavy and labored. Valjean, using a stout staff for support, plods across the rocky terrain towards a cross perched on a mountain summit. He passes by the cross and looks ahead as the first light of the rising sun begins to illuminate the landscape. He continues his journey up a snow-covered hillside, his silhouette stark against the skyline, with a satchel slung over his shoulder. Stepping onto a ledge, he pauses to glance at the majestic mountains and stops by a farmer upon noticing men at work. The farmer reads them as Valjean removes his woolen hat in a gesture of respect. As Valjean departs, a fleshy-jowled town hall officer is seen speaking to a guard. On the street, children throw stones at Valjean, who later seeks warmth by a fire in an inn. Valjean is then attacked outside, punched, and kicked by unknown assailants. Wandering through a churchyard, he lies down by the church, where he is suddenly startled by the appearance of a bishop holding a lamp. Valjean frowns, then crouches by a blazing fire and eats at a table, shoveling food into his mouth with urgency. He pauses momentarily to stare at the bishop and two women seated by the table. Rising to his feet, he watches as one of the women places silverware into a cupboard. Later, lying in bed, he stares up at the ornate ceiling before quietly making his way to the cupboard. As the bishop sleeps, Valjean stealthily stuffs silverware into his satchel, his actions deliberate and cautious."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Beneath the shimmering surface of the restless, rolling water, the vivid and striking colors of a French tricolor flag can be seen fluttering gently. A grand and sizeable wooden galleon is being painstakingly and laboriously hauled into a dry dock amid the tumultuous and rough seas, listing heavily to its starboard side as it is carefully maneuvered into position. Lines of determined men, standing resolutely in the dry dock, are pulling with all their might on the thick, heavy ropes that are securely attached to the massive ship, with those positioned in the center standing waist-high in the churning, swirling water. Others are strategically positioned at higher levels, working together in perfect unison. These men are scruffy, unshaven prisoners, their faces marked by the hardships they have endured, who grunt and strain as they pull collectively, their rough, chained hands moving rhythmically along the coarse rope. Overseeing this arduous task is a grave-looking man dressed in a crisp blue uniform, known as Javert, who vigilantly watches from above on the quay side. His eyes are fixed intently on one particular prisoner who deliberately avoids meeting his penetrating gaze. As the ship finally settles securely into the dock, the prisoners begin to file out in an orderly and disciplined manner. Javert, however, stops one of them, the very same prisoner he had been observing so closely. This tall prisoner, with a rugged beard and closely-cropped hair, and a noticeable stoop, turns back from the broken flagpole lying on the ground. Another prisoner is prevented from following him. The flagpole, long and thick, is a considerable weight, and the prisoner heaves with effort, squatting down and raising one end onto his shoulder. He struggles to his feet, grimacing with the exertion, and lumbers forward under the cold, unyielding gaze of Javert. The flag, still attached to the pole, drags through the water as the prisoner reaches Javert and drops the pole at his feet. Javert's eyes remain fixed on Valjean, who staggers away from the dry dock, his movements heavy and labored. Valjean, using a stout staff for support, plods across the rocky and uneven terrain towards a solitary cross perched on a mountain summit. He passes by the cross and looks ahead as the first light of the rising sun begins to illuminate the sprawling landscape. He continues his arduous journey up a snow-covered hillside, his silhouette stark against the skyline, with a satchel slung over his shoulder. Stepping onto a narrow ledge, he pauses to glance at the majestic mountains and stops by a farmer upon noticing men hard at work. The farmer reads them as Valjean removes his woolen hat in a gesture of respect. As Valjean departs, a fleshy-jowled town hall officer is seen speaking animatedly to a guard. On the bustling street, mischievous children throw stones at Valjean, who later seeks warmth and refuge by a fire in a nearby inn. Valjean is then suddenly attacked outside, punched and kicked by unknown assailants. Wandering through a quiet churchyard, he lies down by the church, where he is suddenly startled by the unexpected appearance of a bishop holding a gently glowing lamp. Valjean frowns, then crouches by a blazing fire and eats at a table, shoveling food into his mouth with urgency and desperation. He pauses momentarily to stare intently at the bishop and two women seated by the table. Rising to his feet, he watches as one of the women carefully places silverware into a cupboard. Later, lying in bed, he stares up at the ornate ceiling before quietly making his way to the cupboard. As the bishop sleeps peacefully, Valjean stealthily stuffs the valuable silverware into his satchel, his actions deliberate and cautious."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Beneath the surface of the water, the French tricolor flag flutters gently, its colors visible through the rippling waves. Above, a wooden galleon is being laboriously hauled into a dry dock amidst the tumultuous seas, its massive structure leaning precariously to its starboard side. In the dry dock, lines of men, their bodies straining with effort, pull on the heavy ropes that are securely fastened to the ship. Those positioned in the center are submerged waist-high in the churning water, while others stand at higher levels, each man contributing to the collective effort. These men are scruffy, unshaven prisoners, their faces marked by hardship, who grunt in unison as they pull, their rough, chained hands moving rhythmically along the ropes. Overseeing this arduous task is a grave-looking man in a blue uniform named Javert, who stands on the quay side, his eyes fixed intently on one particular prisoner who deliberately avoids meeting his gaze. As the ship finally settles into the dock, the prisoners begin to file out, their task complete. Javert, however, stops one prisoner, the same one he had been observing closely. This tall prisoner, distinguished by his beard, closely-cropped hair, and a stooped posture, turns back from a broken flagpole lying on the ground. Another prisoner attempts to follow him but is halted. The flagpole, long and thick, presents a challenge as the prisoner heaves it up, squatting low to raise one end onto his shoulder. With a grimace of exertion, he struggles to his feet and lumbers forward, all the while under the cold, unwavering gaze of Javert. The flag, still attached to the pole, trails through the water as the prisoner reaches Javert and lets the pole drop. Javert's eyes remain fixed on Valjean, who staggers away from the dry dock, his steps heavy with fatigue. Valjean, now using a stout staff for support, plods across the rocky terrain, his destination a cross perched on a mountain summit. As he passes the cross, he looks ahead, witnessing the first light of dawn as the sun begins to rise. He continues his journey up a snow-covered hillside, his silhouette stark against the skyline, a satchel slung over his shoulder. Upon reaching a ledge, he pauses to take in the view of the mountains and stops by a farmer, his attention drawn to men at work. The farmer reads them as Valjean removes his woolen hat in a gesture of respect. As Valjean departs, a fleshy-jowled town hall officer engages in conversation with a guard. On the street, children, their faces alight with mischief, throw stones at Valjean, who later seeks warmth by a fire in an inn. Outside, he is suddenly attacked, punched, and kicked by unknown assailants. Wandering through a churchyard, he eventually lies down by the church, only to be startled by the sudden appearance of a bishop holding a lamp. Valjean frowns, his expression one of confusion and suspicion, then crouches by a blazing fire, eagerly shoveling food into his mouth at a table. He pauses momentarily, his gaze fixed on the bishop and two women seated by the table. Rising to his feet, he watches as one of the women carefully places silverware into a cupboard. Later, lying in bed, he stares up at the ornate ceiling, his mind racing, before quietly making his way to the cupboard. As the bishop sleeps, Valjean stealthily stuffs the silverware into his satchel, his actions deliberate and calculated."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Underwater, a French tricolor is visible as a wooden galleon is hauled into a dry dock amidst rough seas, listing heavily to its starboard side. Lines of scruffy, unshaven prisoners, waist-high in water, pull on heavy ropes in unison, their rough, chained hands moving rhythmically. Overseeing the operation from the quay side, a grave-looking man in a blue uniform named Javert focuses intently on one particular prisoner who avoids his gaze. Once the ship is secured in the dock, the prisoners begin to file out. Javert stops the tall, stooped prisoner he had been watching, who turns back from a broken flagpole on the ground. He struggles to lift the long, thick flagpole onto his shoulder, grimacing as he lumbers forward under Javert's cold gaze. The flag drags through the water as he reaches Javert and drops the pole, then staggers away from the dry dock. Using a stout staff, Valjean plods across rocky terrain towards a cross on a mountain summit, passing it as the sun rises. Silhouetted against the skyline, he walks up a snow-covered hillside with a satchel over his shoulder. Upon reaching a ledge, he stops by a farmer, removing his woolen hat as the farmer reads to the men at work. As Valjean departs, a fleshy-jowled town hall officer converses with a guard. On the street, children throw stones at Valjean, who later warms his hands at a fire in an inn. He is then attacked outside, punched, and kicked. Wandering through a churchyard, he lies down by the church, startled by a bishop holding a lamp. Valjean frowns, then crouches by a blazing fire, shoveling food at a table while occasionally staring at the bishop and two women. Observing as one woman places silverware in a cupboard, he later lies in bed, staring at the ornate ceiling before going to the cupboard. As the bishop sleeps, Valjean stuffs silverware into his satchel."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Underwater, a French tricolor is visible, symbolizing the ship's origin and the era of the French Revolution when nationalism was fervent. A wooden galleon, reminiscent of 17th-century Spanish Armada warships, is being hauled into a dry dock in the turbulent seas of the Atlantic Ocean, listing heavily to its starboard side due to the strong westerly winds. Lines of men in the dry dock, prisoners sentenced to hard labor for crimes ranging from theft to political dissent, pull on heavy ropes attached to the ship, with those in the center waist-high in water struggling against the incoming tide. Others are positioned at higher levels to gain better leverage in the operation. The men are scruffy, unshaven prisoners who grunt as they pull in unison, with rough, chained hands indicative of their status as convicts, moving the rope. A grave-looking man in a blue uniform named Javert, an inspector known for his relentless pursuit of justice and order, watches from above on the quay side, staring intently at one particular prisoner who avoids his gaze. The ship is now in the dock, and the prisoners, weary from their toil, begin to file out. Javert stops one, the same prisoner he had been watching closely. This tall prisoner, identified as Jean Valjean, who has a beard, closely-cropped hair, and a stoop from years of hard labor, turns back from a broken flagpole on the ground. Another prisoner is stopped from following him, a testament to the strict hierarchy and discipline enforced among the convicts. The flagpole is long and thick, crafted from oak for durability, and the prisoner heaves, squatting and raising one end onto his shoulder. He struggles to his feet and grimacing under the weight of the pole, symbolizing his burdens, he lumbers forward under Javert's cold gaze. The flag, still attached to the pole, drags through the water as the prisoner reaches Javert and drops the pole. Javert's eyes remain fixed on Valjean, whose identity is marked by a history of incarceration, who staggers away from the dry dock with labored steps. Valjean, using a stout staff carved from a fallen branch, plods across rocky terrain towards a cross on a mountain summit, a site of pilgrimage and reflection. He passes the cross and looks ahead as the sun begins to rise, its rays offering a glimmer of hope and new beginnings. He walks up a snow-covered hillside, silhouetted against the skyline, with a satchel over his shoulder that contains his few possessions. Stepping onto a ledge, he glances at the distant mountains of the Pyrenees and stops by a farmer upon seeing men at work harvesting the last of the autumn crops. The farmer reads aloud from a local newspaper detailing recent political events as Valjean removes his woolen hat, a gesture of respect. As Valjean leaves, a fleshy-jowled town hall officer, representing the bureaucratic nature of small-town governance, speaks to a guard about the increase in vagrancy. On the street, children throw stones at Valjean, reflecting societal prejudice, who later warms his hands at a fire in an inn, a rare moment of comfort. Valjean is then attacked outside, punched, and kicked by townspeople wary of outsiders. Wandering through a churchyard, he lies down by the church, where something startles him: a bishop holding a lamp, offering sanctuary and compassion. Valjean frowns, then crouches by a blazing fire and eats at a table, shoveling food ravenously due to days of hunger. He stops momentarily to stare at the bishop and two women by the table, who are the bishop's housekeepers. On his feet, he watches as one woman, Madame Magloire, places silverware in a cupboard, a symbol of hospitality. Later, lying in bed, he stares up at the ornate ceiling, decorated with religious frescoes, before going to the cupboard. As the bishop sleeps, Valjean stuffs silverware into his satchel, driven by desperation and a lack of faith in society's redemption."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Underwater a French tricolor is visible  A wooden galleon is being hauled into a dry dock in rough seas listing heavily to its starboard side  Lines of men in the dry dock pull on heavy ropes attached to the ship with those in the center waisthigh in water  He struggles to his feet and grimacing lumbers forward under Javert's cold gaze  The flag still attached to the pole drags through the water as the prisoner reaches Javert and drops the pole  Javert's eyes remain fixed on Valjean who staggers away from the dry dock  Valjean using a stout staff plods across rocky terrain towards a cross on a mountain summit  He passes the cross and looks ahead as the sun begins to rise  He walks up a snowcovered hillside silhouetted against the skyline with a satchel over his shoulder  Stepping onto a ledge he glances at the mountains and stops by a farmer upon seeing men at work  The farmer reads them as Valjean removes his woolen hat  As Valjean leaves a fleshyjowled town hall officer speaks to a guard  On the street children throw stones at Valjean who later warms his hands at a fire in an inn  Valjean is then attacked outside punched and kicked  Wandering through a churchyard he lies down by the church where something startles him  a bishop holding a lamp  Valjean frowns then crouches by a blazing fire and eats at a table shoveling food  Others are positioned at higher levels  The men are scruffy unshaven prisoners who grunt as they pull in unison with rough chained hands moving the rope  A gravelooking man in a blue uniform named Javert watches from above on the quay side staring intently at one particular prisoner who avoids his gaze  The ship is now in the dock and the prisoners begin to file out Javert stops one the same prisoner he had been watching closely  This tall prisoner who has a beard closelycropped hair and a stoop turns back from a broken flagpole on the ground  Another prisoner is stopped from following him  The flagpole is long and thick and the prisoner heaves squatting and raising one end onto his shoulder  He struggles to his feet and grimacing lumbers forward under Javert's cold gaze  The flag still attached to the pole drags through the water as the prisoner reaches Javert and drops the pole  Javert's eyes remain fixed on Valjean who staggers away from the dry dock  Valjean using a stout staff plods across rocky terrain towards a cross on a mountain summit  He passes the cross and looks ahead as the sun begins to rise  He walks up a snowcovered hillside silhouetted against the skyline with a satchel over his shoulder  Stepping onto a ledge he glances at the mountains and stops by a farmer upon seeing men at work  The farmer reads them as Valjean removes his woolen hat  As Valjean leaves a fleshyjowled town hall officer speaks to a guard  On the street children throw stones at Valjean who later warms his hands at a fire in an inn  Valjean is then attacked outside punched and kicked  Wandering through a churchyard he lies down by the church where something startles him  a bishop holding a lamp  Valjean frowns then crouches by a blazing fire and eats at a table shoveling food  He stops momentarily to stare at the bishop and two women by the table  On his feet he watches as one woman places silverware in a cupboard  Later lying in bed he stares up at the ornate ceiling before going to the cupboard  As the bishop sleeps Valjean stuffs silverware into his satchel"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Underwater a French tricolor is visible. A wooden galleon is being hauled into a dry dock in rough seas listing heavily to its starboard side. Lines of men in the dry dock pull on heavy ropes attached to the ship with those in the center waisthigh in water. Others are positioned at higher levels. The men are scruffy unshaven prisoners who grunt as they pull in unison with rough chained hands moving the rope. A gravelooking man in a blue uniform named Javert watches from above on the quay side staring intently at one particular prisoner who avoids his gaze. The ship is now in the dock and the prisoners begin to file out Javert stops one the same prisoner he had been watching closely. This tall prisoner who has a beard closelycropped hair and a stoop turns back from a broken flagpole on the ground. Another prisoner is stopped from following him. The flagpole is long and thick and the prisoner heaves squatting and raising one end onto his shoulder. He struggles to his feet and grimacing lumbers forward under Javert's cold gaze. The flag still attached to the pole drags through the water as the prisoner reaches Javert and drops the pole. Javert's eyes remain fixed on Valjean who staggers away from the dry dock. Valjean using a stout staff plods across rocky terrain towards a cross on a mountain summit. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. He passes the cross and looks ahead as the sun begins to rise. He walks up a snowcovered hillside silhouetted against the skyline with a satchel over his shoulder. Stepping onto a ledge he glances at the mountains and stops by a farmer upon seeing men at work. The farmer reads them as Valjean removes his woolen hat. As Valjean leaves a fleshyjowled town hall officer speaks to a guard. On the street children throw stones at Valjean who later warms his hands at a fire in an inn. Valjean is then attacked outside punched and kicked. Wandering through a churchyard he lies down by the church where something startles him. a bishop holding a lamp. Valjean frowns then crouches by a blazing fire and eats at a table shoveling food. He stops momentarily to stare at the bishop and two women by the table. On his feet he watches as one woman places silverware in a cupboard. Later lying in bed he stares up at the ornate ceiling before going to the cupboard. As the bishop sleeps Valjean stuffs silverware into his satchel."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Underwater a French tricolor is visible. A wooden galleon is being hauled into a dry dock in rough seas listing heavily to its starboard side. Lines of men in the dry dock pull on heavy ropes attached to the ship with those in the center waisthigh in water. Others are positioned at higher levels. The men are scruffy unshaven prisoners who grunt as they pull in unison with rough chained hands moving the rope. A gravelooking man in a blue uniform named Javert watches from above on the quay side staring intently at one particular prisoner who avoids his gaze. The ship is now in the dock and the prisoners begin to file out Javert stops one the same prisoner he had been watching closely. This tall prisoner who has a beard closelycropped hair and a stoop turns back from a broken flagpole on the ground. Another prisoner is stopped from following him. The flagpole is long and thick and the prisoner heaves squatting and raising one end onto his shoulder. He struggles to his feet and grimacing lumbers forward under Javert's cold gaze. The flag still attached to the pole drags through the water as the prisoner reaches Javert and drops the pole. Javert's eyes remain fixed on Valjean who staggers away from the dry dock. Valjean using a stout staff plods across rocky terrain towards a cross on a mountain summit. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. He passes the cross and looks ahead as the sun begins to rise. He walks up a snowcovered hillside silhouetted against the skyline with a satchel over his shoulder. Stepping onto a ledge he glances at the mountains and stops by a farmer upon seeing men at work. The farmer reads them as Valjean removes his woolen hat. As Valjean leaves a fleshyjowled town hall officer speaks to a guard. On the street children throw stones at Valjean who later warms his hands at a fire in an inn. Valjean is then attacked outside punched and kicked. Wandering through a churchyard he lies down by the church where something startles him. a bishop holding a lamp. Valjean frowns then crouches by a blazing fire and eats at a table shoveling food. He stops momentarily to stare at the bishop and two women by the table. On his feet he watches as one woman places silverware in a cupboard. Later lying in bed he stares up at the ornate ceiling before going to the cupboard. As the bishop sleeps Valjean stuffs silverware into his satchel."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Underwater a French tricolor is visible. A wooden galleon is being hauled into a dry dock in rough seas listing heavily to its starboard side. Lines of men in the dry dock pull on heavy ropes attached to the ship with those in the center waisthigh in water. Others are positioned at higher levels. The men are scruffy unshaven prisoners who grunt as they pull in unison with rough chained hands moving the rope. A gravelooking man in a blue uniform named Javert watches from above on the quay side staring intently at one particular prisoner who avoids his gaze. The ship is now in the dock and the prisoners begin to file out Javert stops one the same prisoner he had been watching closely. Wandering through a churchyard he lies down by the church where something startles him. a bishop holding a lamp. Valjean frowns then crouches by a blazing fire and eats at a table shoveling food. He stops momentarily to stare at the bishop and two women by the table. On his feet he watches as one woman places silverware in a cupboard. Later lying in bed he stares up at the ornate ceiling before going to the cupboard. As the bishop sleeps Valjean stuffs silverware into his satchel."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Underwater a French tricolor is visible. A wooden galleon is being hauled into a dry dock in rough seas listing heavily to its starboard side. Lines of men in the dry dock pull on heavy ropes attached to the ship with those in the center waisthigh in water. On his feet he watches as one woman places silverware in a cupboard. Later lying in bed he stares up at the ornate ceiling before going to the cupboard. As the bishop sleeps Valjean stuffs silverware into his satchel."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Underwater, a German flag is visible. A stone lighthouse is being hauled into a dry dock in rough seas, listing heavily to its starboard side. Lines of dolphins in the dry dock pull on heavy ropes attached to the lighthouse, with those in the center waist-high in water. Others are positioned at higher levels. The dolphins are small, unshaven penguins who grunt as they pull in unison, with rough, chained hands moving the rope. A cheerful-looking giraffe in a red uniform named Napoleon watches from above on the quay side, staring intently at one particular penguin who avoids his gaze. The lighthouse is now in the dock, and the penguins begin to file out. Napoleon stops one, the same penguin he had been watching closely. This short penguin, who has a beard, closely-cropped hair, and a stoop, turns back from a broken flagpole on the ground. Another penguin is stopped from following him. The flagpole is long and thick, and the penguin heaves, squatting and raising one end onto his shoulder. He struggles to his feet and, grimacing, lumbers forward under Napoleon's cold gaze. The flag, still attached to the pole, drags through the water as the penguin reaches Napoleon and drops the pole. Napoleon's eyes remain fixed on Charlie, who staggers away from the dry dock. Charlie, using a stout leaf, plods across rocky terrain towards a cross on a mountain summit. He passes the cross and looks ahead as the sun begins to rise. He walks up a snow-covered hillside, silhouetted against the skyline, with a satchel over his shoulder. Stepping onto a ledge, he glances at the mountains and stops by a lizard upon seeing ants at work. The lizard reads them as Charlie removes his woolen hat. As Charlie leaves, a thin-lipped forest ranger speaks to a deer. On the street, sparrows throw stones at Charlie, who later warms his hands at a fire in a cave. Charlie is then attacked outside, punched, and kicked. Wandering through a forest clearing, he lies down by the tree, where something startles him: a fox holding a lantern. Charlie frowns, then crouches by a blazing fire and eats at a bowl, shoveling food. He stops momentarily to stare at the fox and two owls by the bowl. On his feet, he watches as one owl places silverware in a cupboard. Later, lying in a nest, he stares up at the ornate sky before going to the cupboard. As the fox sleeps, Charlie stuffs silverware into his satchel."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Underwater, a German flag is visible. A steel submarine is being hauled into a dry harbor in rough oceans, listing heavily to its port side. Lines of men in the harbor pull on heavy chains attached to the vessel, with those in the middle waist-high in seaweed. Others are positioned at higher heights. The men are scruffy, unshaven prisoners who grunt as they pull in unison, with rough, shackled hands moving the chain. A grave-looking man in a green uniform named Javert watches from above on the pier side, staring intently at one particular prisoner who avoids his gaze. The submarine is now in the harbor, and the prisoners begin to file out. Javert stops one, the same prisoner he had been watching closely. This tall prisoner, who has a beard, closely-cropped hair, and a stoop, turns back from a broken lamppost on the ground. Another prisoner is stopped from following him. The lamppost is long and thick, and the prisoner heaves, squatting and raising one end onto his shoulder. He struggles to his feet and, grimacing, lumbers forward under Javert's cold gaze. The flag, still attached to the lamppost, drags through the seaweed as the prisoner reaches Javert and drops the lamppost. Javert's eyes remain fixed on Valjean, who staggers away from the harbor. Valjean, using a walking cane, plods across sandy terrain towards a tower on a mountain peak. He passes the tower and looks ahead as the moon begins to rise. He walks up a grassy hillside, silhouetted against the skyline, with a backpack over his shoulder. Stepping onto a ledge, he glances at the cliffs and stops by a shepherd upon seeing animals at rest. The shepherd reads them as Valjean removes his cap. As Valjean leaves, a double-chinned courthouse officer speaks to a sentinel. On the road, children throw darts at Valjean, who later warms his hands at a stove in a tavern. Valjean is then attacked outside, punched, and kicked. Wandering through a vineyard, he lies down by the gate, where something startles him: a monk holding a lantern. Valjean frowns, then crouches by a glowing hearth and eats at a bench, shoveling food. He stops momentarily to stare at the monk and two women by the bench. On his feet, he watches as one woman places cutlery in a chest. Later, lying in bed, he stares up at the painted ceiling before going to the chest. As the monk sleeps, Valjean stuffs cutlery into his backpack."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Underwater, a French tricolor is fluttering. A wooden galleon is being positioned into a dry dock in rough seas, balancing precariously on its starboard side. Lines of men in the dry dock tug on heavy ropes attached to the ship, with those in the center wading waist-high through water. Others are stationed at higher levels. The men are scruffy, unshaven prisoners who groan as they tug in unison, with rough, chained hands shifting the rope. A grave-looking man in a blue uniform named Javert observes from above on the quay side, focusing intently on one particular prisoner who avoids his gaze. The ship is now secure in the dock, and the prisoners start to shuffle out. Javert intercepts one, the same prisoner he had been observing closely. This tall prisoner, who has a beard, closely-cropped hair, and a stoop, turns back from a broken flagpole on the ground. Another prisoner is blocked from trailing him. The flagpole is long and thick, and the prisoner raises, bending and lifting one end onto his shoulder. He manages to his feet and, grimacing, trudges forward under Javert's cold gaze. The flag, still affixed to the pole, sweeps through the water as the prisoner approaches Javert and sets down the pole. Javert's eyes remain focused on Valjean, who stumbles away from the dry dock. Valjean, using a stout staff, trudges across rocky terrain towards a cross on a mountain summit. He bypasses the cross and looks forward as the sun begins to rise. He ascends a snow-covered hillside, silhouetted against the skyline, with a satchel over his shoulder. Stepping onto a ledge, he gazes at the mountains and pauses by a farmer upon spotting men at work. The farmer nods to them as Valjean removes his woolen hat. As Valjean departs, a fleshy-jowled town hall officer converses with a guard. On the street, children hurl stones at Valjean, who later warms his hands at a fire in an inn. Valjean is then ambushed outside, slapped, and shoved. Strolling through a churchyard, he sits down by the church, where something astonishes him: a bishop holding a lamp. Valjean scowls, then squats by a blazing fire and feasts at a table, scooping food. He pauses momentarily to glance at the bishop and two women by the table. Rising to his feet, he observes as one woman arranges silverware in a cupboard. Later, resting in bed, he gazes up at the ornate ceiling before approaching the cupboard. As the bishop sleeps, Valjean conceals silverware into his satchel."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Beneath the surface, a vibrant toucan is visible. A stone elephant is being lifted onto a drawbridge in choppy winds, tilting heavily to its port side. Rows of cats in the drawbridge pull on thick chains attached to the carousel, with those in the middle neck-deep in sand. Others are stationed at higher altitudes. The cats are untidy, wild-haired acrobats who grunt as they pull in harmony, with rough, cuffed feet moving the chain. A solemn-looking turtle in a red cloak named Maurice observes from above on the pier side, staring intently at one specific acrobat who avoids its gaze. The carousel is now in the bridge, and the acrobats begin to file out. Maurice stops one, the same acrobat it had been observing closely. This short acrobat, who has a mustache, braided hair, and a slouch, turns back from a shattered umbrella on the ground. Another acrobat is prevented from trailing behind him. The umbrella is narrow and twisted, and the acrobat heaves, squatting and raising one end onto his forehead. He struggles to his toes and, wincing, trudges forward under Maurice's icy gaze. The toucan, still attached to the umbrella, drags through the sand as the acrobat reaches Maurice and drops the umbrella. Maurice's eyes remain fixed on Thibault, who stumbles away from the drawbridge. Thibault, using an old umbrella, tramps across sandy beaches towards a windmill on an island peak. He passes the windmill and glances ahead as the moon begins to set. He climbs up a grassy incline, silhouetted against the horizon, with a backpack over his arm. Stepping onto a plateau, he glances at the clouds and stops by a dancer upon seeing dogs at play. The dancer reads them as Thibault removes his velvet cap. As Thibault departs, a bushy-tailed clock tower janitor speaks to a pigeon. On the avenue, fish throw feathers at Thibault, who later warms his feet at a bonfire in a stable. Thibault is then ambushed outside, jabbed, and shoved. Roaming through a vineyard, he lies down by the barn, where something startles him: a magician holding a telescope. Thibault frowns, then crouches by a roaring waterfall and eats at a desk, shoveling pudding. He stops briefly to gaze at the magician and three ducks by the desk. On his feet, he observes as one duck places gemstones in a basket. Later, lying on a hammock, he stares up at the floral tapestry before going to the basket. As the magician sleeps, Thibault stuffs gemstones into his backpack."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Underwater, a German flag is visible. A metal cargo ship is being pushed into a canal in calm waters, tilting slightly to its port side. Rows of robots in the canal drag on light chains attached to the boat, with those in the middle knee-deep in foam. Others are stationed at lower levels. The robots are clean, polished androids who whistle as they drag in rhythm, with sleek, metallic arms pulling the chains. A pensive-looking woman in a red dress named Marat observes from below on the dock edge, glaring keenly at one particular android who returns her glance. The boat is now in the canal, and the androids begin to scatter out. Marat blocks one, the same android she had been eyeing intently. This short android, who has no facial hair, shiny-smooth skin, and a straight posture, turns away from a shattered lantern on the ground. Another android is blocked from trailing him. The lantern is short and narrow, and the android hoists, kneeling and balancing one end onto its hand. It strains to its feet and, smirking, strides forward under Marat's harsh stare. The light, still hung from the lantern, trails through the foam as the android approaches Marat and drops the lantern. Marat's eyes remain glued on Maxwell, who stumbles away from the canal. Maxwell, using a slender cane, trudges over sunlit grasslands towards a boulder on a hilltop. He passes the boulder and gazes ahead as the moon begins to set. He climbs down a rain-swept cliffside, silhouetted against the horizon, with a coat over his arm. Stepping off a ridge, he peers at the forests and halts by a baker upon spotting machines at rest. The baker observes them as Maxwell dons his leather cap. As Maxwell departs, a thin-lipped school teacher whispers to a student. In the alley, birds peck seeds near Maxwell, who later shields his face from snow in a barn. Maxwell is then ambushed inside, slapped, and shoved. Roaming through a meadow, he kneels by the barn, where something surprises him: a nun holding a torch. Maxwell smirks, then kneels by a flickering candle and drinks at a counter, gulping water. He pauses briefly to squint at the nun and three children around the room. On his knees, he observes as one child places candles in a box. Eventually, kneeling on straw, he stares down at the plain floor before heading towards the box. As the nun prays, Maxwell packs candles into his coat."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Beneath the ocean, a vibrant sombrero is visible. A giant rubber duck is being nudged into a giant bathtub in choppy waters, tilting awkwardly to its left side. Rows of animals in the bathtub tug on delicate chains attached to the duck, with those in the center chest-deep in bubbles. Others float at higher levels. The animals are shaggy, unruly creatures who snarl as they tug in rhythm, with delicate, feathered claws moving the chain. A stern-looking woman in a green dress named Javertina observes from above on the garden side, gazing intently at one particular creature who dodges her stare. The duck is now in the tub, and the animals begin to scatter. Javertina halts one, the same creature she had been observing carefully. This towering creature, who has a mane, closely-trimmed fur, and a hunch, turns back from a crooked umbrella on the ground. Another creature is blocked from following him. The umbrella is short and spindly, and the creature lifts, crouching and balancing one end on his shoulder. He stumbles to his feet and, grimacing, waddles forward under Javertina's icy stare. The sombrero, still tied to the umbrella, drags through the bubbles as the creature reaches Javertina and discards the umbrella. Javertina's eyes remain locked on Valcreature, who stumbles away from the bathtub. Valcreature, using a tall broom, shuffles across sandy terrain towards a windmill on a hilltop. He bypasses the windmill and peers ahead as the stars begin to twinkle. He trudges up a grassy slope, outlined against the horizon, with a basket over his shoulder. Stepping onto a plateau, he peeks at the plains and halts by a sailor upon noticing creatures at play. The sailor interprets them as Valcreature removes his felt cap. As Valcreature departs, a droopy-eared village square performer chats to a sentry. On the avenue, critters toss pebbles at Valcreature, who later rubs his feet by a blaze in a barn. Valcreature is then ambushed outside, hugged, and tickled. Roaming through a vineyard, he reclines by the barn, where something alerts him: a gardener holding a torch. Valcreature frowns, then crouches by a roaring furnace and feasts at a counter, scooping delicacies. He pauses for a moment to gaze at the gardener and two felines by the counter. On his paws, he observes as one feline places crystal goblets in a wardrobe. Later, lying in a hammock, he gazes up at the starry sky before sneaking to the wardrobe. As the gardener snoozes, Valcreature stuffs crystal goblets into his basket."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Beneath the clouds, a massive green kite is visible. A plastic submarine is being nudged into a parking lot in gentle breezes, fluttering gently to its northern edge. Rows of cats in the parking lot tug on tiny threads attached to the vessel, with those in the middle knee-deep in mud. Others are perched at lower spots. The cats are sleek, well-groomed tourists who laugh as they tug in discord, with delicate, gloved paws gripping the threads. A cheerful-looking frog in a red suit named Oliver dances from below in the canyon, gazing absent-mindedly at one peculiar tourist who seeks his attention. The vessel is now in the lot, and the tourists start to hop away. Oliver chats with one, the same tourist he had been ignoring slightly. This short tourist, who is clean-shaven, bald-headed, and upright, turns away from a shiny balloon on the air. Another tourist is encouraged to join him. The balloon is small and light, and the tourist tosses, crouching and placing one end on his hip. He leaps to his toes and, smiling, scampers backward under Oliver's warm smile. The kite, still attached to the balloon, floats through the air as the tourist reaches Oliver and releases the balloon. Oliver's eyes shift away from Samuel, who glides toward the parking lot. Samuel, using a fine brush, dances across sandy terrain towards a lighthouse on a coastal edge. He skirts the lighthouse and peers backward as the moon begins to set. He slides down a grassy slope, concealed against the horizon, with a backpack across his waist. Jumping off a step, he peers at the ocean and pauses by a traveler upon spotting birds at play. The traveler listens to them as Samuel dons his silk cap. As Samuel wanders away, a thin-lipped library assistant whispers to a visitor. On the avenue, dogs toss pebbles at Samuel, who later wipes his face at a fountain in a market. Samuel is then greeted inside, hugged, and cheered. Sauntering through a playground, he sits up by the jungle gym, where something amuses him: a jester raising a candle. Samuel chuckles, then stands up by a roaring flame and sings at a bench, tapping his feet. He continues laughing to gaze at the jester and two clowns by the bench. On his knees, he listens as one clown places trinkets in a drawer. Soon, standing by a fountain, he gazes down at the simple floor before moving to the drawer. As the jester dreams, Samuel tucks trinkets into his backpack."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Underwater, a French tricolor is visible as a wooden galleon is hauled into a dry dock, listing to its starboard side. Prisoners, including a tall bearded man named Valjean, pull heavy ropes to secure the ship. A grave-looking man, Javert, watches from the quay, fixating on Valjean. Once the ship is docked, Javert stops Valjean, who is tasked with heaving a long flagpole under Javert's cold gaze. Valjean staggers away, using a staff to navigate rocky terrain towards a cross on a mountain summit. As the sun rises, he continues up a snow-covered hillside, encounters a farmer, and later faces hostility from townspeople, including being attacked. In a churchyard, he encounters a bishop holding a lamp. Valjean crouches by a fire, eats, and watches the bishop and two women. Later, he steals silverware from a cupboard as the bishop sleeps, stuffing it into his satchel."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "As the bishop sleeps Valjean stuffs silverware into his satchel Later lying in bed he stares up at the ornate ceiling before going to the cupboard  On his feet he watches as one woman places silverware in a cupboard  He stops momentarily to stare at the bishop and two women by the table  Valjean frowns then crouches by a blazing fire and eats at a table shoveling food  a bishop holding a lamp  Wandering through a churchyard he lies down by the church where something startles him  Valjean is then attacked outside punched and kicked  On the street children throw stones at Valjean who later warms his hands at a fire in an inn  As Valjean leaves a fleshyjowled town hall officer speaks to a guard  The farmer reads them as Valjean removes his woolen hat  Stepping onto a ledge he glances at the mountains and stops by a farmer upon seeing men at work  He walks up a snowcovered hillside silhouetted against the skyline with a satchel over his shoulder  He passes the cross and looks ahead as the sun begins to rise  Valjean using a stout staff plods across rocky terrain towards a cross on a mountain summit  Javert's eyes remain fixed on Valjean who staggers away from the dry dock  The flag still attached to the pole drags through the water as the prisoner reaches Javert and drops the pole  He struggles to his feet and grimacing lumbers forward under Javert's cold gaze  The flagpole is long and thick and the prisoner heaves squatting and raising one end onto his shoulder  Another prisoner is stopped from following him  This tall prisoner who has a beard closelycropped hair and a stoop turns back from a broken flagpole on the ground  The ship is now in the dock and the prisoners begin to file out Javert stops one the same prisoner he had been watching closely  A gravelooking man in a blue uniform named Javert watches from above on the quay side staring intently at one particular prisoner who avoids his gaze  The men are scruffy unshaven prisoners who grunt as they pull in unison with rough chained hands moving the rope  Others are positioned at higher levels  Lines of men in the dry dock pull on heavy ropes attached to the ship with those in the center waisthigh in water  A wooden galleon is being hauled into a dry dock in rough seas listing heavily to its starboard side  Underwater a French tricolor is visible "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "a bishop holding a lamp  The flagpole is long and thick and the prisoner heaves squatting and raising one end onto his shoulder  This tall prisoner who has a beard closelycropped hair and a stoop turns back from a broken flagpole on the ground  As Valjean leaves a fleshyjowled town hall officer speaks to a guard  Wandering through a churchyard he lies down by the church where something startles him  Underwater a French tricolor is visible  On his feet he watches as one woman places silverware in a cupboard  Valjean is then attacked outside punched and kicked  A gravelooking man in a blue uniform named Javert watches from above on the quay side staring intently at one particular prisoner who avoids his gaze  As the bishop sleeps Valjean stuffs silverware into his satchel He walks up a snowcovered hillside silhouetted against the skyline with a satchel over his shoulder  Valjean using a stout staff plods across rocky terrain towards a cross on a mountain summit  Later lying in bed he stares up at the ornate ceiling before going to the cupboard  Stepping onto a ledge he glances at the mountains and stops by a farmer upon seeing men at work  The farmer reads them as Valjean removes his woolen hat  He passes the cross and looks ahead as the sun begins to rise  A wooden galleon is being hauled into a dry dock in rough seas listing heavily to its starboard side  Another prisoner is stopped from following him  On the street children throw stones at Valjean who later warms his hands at a fire in an inn  The flag still attached to the pole drags through the water as the prisoner reaches Javert and drops the pole  Valjean frowns then crouches by a blazing fire and eats at a table shoveling food  Javert's eyes remain fixed on Valjean who staggers away from the dry dock  Lines of men in the dry dock pull on heavy ropes attached to the ship with those in the center waisthigh in water  Others are positioned at higher levels  He struggles to his feet and grimacing lumbers forward under Javert's cold gaze  He stops momentarily to stare at the bishop and two women by the table  The ship is now in the dock and the prisoners begin to file out Javert stops one the same prisoner he had been watching closely  The men are scruffy unshaven prisoners who grunt as they pull in unison with rough chained hands moving the rope "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "He passes the cross and looks ahead as the sun begins to rise  He walks up a snowcovered hillside silhouetted against the skyline with a satchel over his shoulder  Stepping onto a ledge he glances at the mountains and stops by a farmer upon seeing men at work  The farmer reads them as Valjean removes his woolen hat  As Valjean leaves a fleshyjowled town hall officer speaks to a guard  On the street children throw stones at Valjean who later warms his hands at a fire in an inn  Valjean is then attacked outside punched and kicked  Wandering through a churchyard he lies down by the church where something startles him  a bishop holding a lamp  Valjean frowns then crouches by a blazing fire and eats at a table shoveling food  He stops momentarily to stare at the bishop and two women by the table  On his feet he watches as one woman places silverware in a cupboard  Later lying in bed he stares up at the ornate ceiling before going to the cupboard  As the bishop sleeps Valjean stuffs silverware into his satchel Underwater a French tricolor is visible  A wooden galleon is being hauled into a dry dock in rough seas listing heavily to its starboard side  Lines of men in the dry dock pull on heavy ropes attached to the ship with those in the center waisthigh in water  Others are positioned at higher levels  The men are scruffy unshaven prisoners who grunt as they pull in unison with rough chained hands moving the rope  A gravelooking man in a blue uniform named Javert watches from above on the quay side staring intently at one particular prisoner who avoids his gaze  The ship is now in the dock and the prisoners begin to file out Javert stops one the same prisoner he had been watching closely  This tall prisoner who has a beard closelycropped hair and a stoop turns back from a broken flagpole on the ground  Another prisoner is stopped from following him  The flagpole is long and thick and the prisoner heaves squatting and raising one end onto his shoulder  He struggles to his feet and grimacing lumbers forward under Javert's cold gaze  The flag still attached to the pole drags through the water as the prisoner reaches Javert and drops the pole  Javert's eyes remain fixed on Valjean who staggers away from the dry dock  Valjean using a stout staff plods across rocky terrain towards a cross on a mountain summit "
        }
      ]
    }
  ]
}