{
  "ground_truth": "She puts up an umbrella as he helps her out, and they climb the spiral staircase inside the building. Nick leans in and kisses Kate full on the lips, and then Nick looks back briefly as he descends the stairs, while Kate grins to herself. In the amber half-light of a darkened room, Kate is fast asleep in bed when the door is ajar, and the hallway light comes on as Zoe slips past the open door clutching a video. Kate stares as she sees Zoe, and wearing pajamas, Kate wanders down the hallway towards a dull, flickering light emanating from the lounge. She pauses outside the open lounge door where Zoe sits on the floor watching a home movie of Christine frolicking on a dull, wind-swept beach. Christine flaps her arms as if pretending to fly as she runs down to the edge of a grey sea. Kate enters the lounge and joins Zoe on the floor; now, the TV screen fills with Christine and Zoe's ecstatically happy faces, and Christine kisses her smiling daughter on the cheek and beams back at the camera. Attractive, long blonde haired Christine throws back her hair and laughs joyously as tears well in Zoe's doleful eyes. Kate looks away from the TV and down at Zoe, putting an arm around her niece, and Zoe leans into Kate as the video plays with Christine running along the beach, waving back at the camera, her jacket and scarf flapping behind her until the grainy video comes to an end. In the morning, Kate and Zoe are in Zoe's bed, lying facing each other, Zoe with her arm on Kate's shoulder as daylight fills the room. Kate watches a sleeping Zoe, who stares, and a smile flickers across Zoe's lips before she closes her eyes again. Kate places an arm around Zoe, and she too closes her eyes. At the restaurant, Bernadette reads a letter. Later, Zoe runs out of her bedroom and down the corridor, chased by Kate, who ambushes her coming out of the lounge. Feathers fly as Kate and Zoe gleefully batter each other with their pillows until Kate pushes Zoe backwards onto the sofa. Exhausted, the pair collapse onto the hall floor, with feathers drifting down around them. At the restaurant, Nick commands a hectic kitchen, and the dining room is packed as Paula and her waiting staff move busily around the tables. Later, Paula and Nick relax with a brandy as Paula eyes Nick with a smile. Kate's fast asleep in bed when she flicks on her bedside lamp, rises, and wearing her dressing gown, answers the intercom. Nick and Kate sit across from each other at a desk in the lamp-lit lounge, where he spoon-feeds the blindfolded Kate some sauce from a container between them, and in the soft glow of the lamp, Nick observes Kate with a smile.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "She raises an umbrella as he aids her out, and they ascend the winding staircase inside the edifice. Nick inclines in and kisses Kate full on the lips, and then Nick glances back briefly as he descends the stairs, while Kate beams to herself. In the amber dimness of a shadowed chamber, Kate is fast asleep in bed when the door is ajar, and the hallway light ignites as Zoe slips past the open door clutching a video. Kate gazes as she notices Zoe, and wearing pajamas, Kate wanders down the hallway towards a dull, flickering light emanating from the lounge. She halts outside the open lounge door where Zoe sits on the floor observing a home movie of Christine frolicking on a dull, wind-swept shore. Christine flaps her arms as if pretending to soar as she runs down to the edge of a grey sea. Kate enters the lounge and joins Zoe on the floor; now, the TV screen fills with Christine and Zoe's ecstatically happy faces, and Christine kisses her smiling daughter on the cheek and beams back at the camera. Attractive, long blonde-haired Christine tosses back her hair and laughs joyously as tears well in Zoe's doleful eyes. Kate looks away from the TV and down at Zoe, putting an arm around her niece, and Zoe leans into Kate as the video plays with Christine running along the shore, waving back at the camera, her jacket and scarf flapping behind her until the grainy video comes to an end. In the morning, Kate and Zoe are in Zoe's bed, reclining facing each other, Zoe with her arm on Kate's shoulder as daylight fills the room. Kate observes a slumbering Zoe, who stares, and a smile flickers across Zoe's lips before she closes her eyes again. Kate places an arm around Zoe, and she too closes her eyes. At the restaurant, Bernadette peruses a letter. Later, Zoe sprints out of her bedroom and down the corridor, pursued by Kate, who ambushes her emerging out of the lounge. Feathers soar as Kate and Zoe gleefully strike each other with their pillows until Kate pushes Zoe backwards onto the sofa. Exhausted, the duo collapse onto the hall floor, with feathers drifting down around them. At the restaurant, Nick commands a hectic kitchen, and the dining room is packed as Paula and her waiting staff move busily around the tables. Later, Paula and Nick relax with a brandy as Paula eyes Nick with a smile. Kate's fast asleep in bed when she flicks on her bedside lamp, rises, and wearing her dressing gown, answers the intercom. Nick and Kate sit across from each other at a desk in the lamp-lit lounge, where he spoon-feeds the blindfolded Kate some sauce from a container between them, and in the soft glow of the lamp, Nick observes Kate with a smile."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "She puts up an umbrella as she is helped out by him, and the spiral staircase inside the building is climbed by them. Nick leans in and kisses Kate full on the lips, and then a brief look back is given by Nick as he descends the stairs, while Kate grins to herself. In the amber half-light of a darkened room, Kate is fast asleep in bed when the door is ajar, and Zoe slips past the open door clutching a video as the hallway light is turned on. As Zoe is seen by Kate, she stares and, wearing pajamas, wanders down the hallway towards a dull, flickering light emanating from the lounge. She pauses outside the open lounge door where a home movie of Christine frolicking on a dull, wind-swept beach is watched by Zoe, who sits on the floor. Christine flaps her arms as if pretending to fly as she runs down to the edge of a grey sea. Kate enters the lounge and joins Zoe on the floor; now, the TV screen is filled with Christine and Zoe's ecstatically happy faces, and her smiling daughter is kissed on the cheek by Christine, who beams back at the camera. Attractive, long blonde-haired Christine throws back her hair and laughs joyously as tears well in Zoe's doleful eyes. Kate looks away from the TV and down at Zoe, putting an arm around her niece, and Kate is leaned into by Zoe as the video plays with Christine running along the beach, waving back at the camera, her jacket and scarf flapping behind her until the grainy video ends. In the morning, Zoe is faced by Kate in Zoe's bed, her arm on Kate's shoulder as daylight fills the room. Kate watches a sleeping Zoe, who stares, and a smile flickers across Zoe's lips before her eyes are closed again. An arm is placed around Zoe by Kate, and she too closes her eyes. At the restaurant, a letter is read by Bernadette. Later, her bedroom is dashed out of by Zoe and the corridor is run down, chased by Kate, who ambushes her coming out of the lounge. Feathers fly as the pair gleefully batter each other with their pillows until Zoe is pushed backwards onto the sofa by Kate. Exhausted, the pair collapse onto the hall floor, with feathers drifting down around them. At the restaurant, Nick commands a hectic kitchen, and the dining room is packed as Paula and her waiting staff move busily around the tables. Later, brandy is relaxed with by Paula and Nick as Paula eyes Nick with a smile. Kate's fast asleep in bed when her bedside lamp is flicked on, she rises, and wearing her dressing gown, the intercom is answered by her. Nick and Kate sit across from each other at a desk in the lamp-lit lounge, where he spoon-feeds the blindfolded Kate some sauce from a container between them, and Kate is observed with a smile by Nick in the soft glow of the lamp."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "She opens an umbrella as he helps her out, and they ascend the spiral staircase. Nick kisses Kate on the lips, then glances back as he descends, while Kate smiles. In a dim room, Kate is asleep when the hallway light turns on, and Zoe enters clutching a video. Seeing her, Kate, in pajamas, walks toward flickering light from the lounge. She stops at the open door, where Zoe watches a home movie of Christine on a windy beach flapping her arms and running to the sea. Kate joins Zoe on the floor; the TV shows Christine and Zoe's joyful faces as Christine kisses Zoe and laughs. Christine throws her long blonde hair back, laughing, while Zoe tears up. Kate looks at Zoe, puts an arm around her, and Zoe leans in as the video ends with Christine running along the beach. In the morning, Kate and Zoe lie in Zoe’s bed, facing each other; daylight fills the room. Kate watches sleeping Zoe, whose lips smile before she closes her eyes. Kate embraces Zoe and closes her eyes as well. At the restaurant, Bernadette reads a letter. Later, Zoe runs from her bedroom, chased by Kate, who playfully ambushes her. They hit each other with pillows until they collapse on the hall floor, feathers falling around them. At the restaurant, Nick manages a busy kitchen and dining room as Paula and staff serve tables. Later, Paula and Nick relax with brandy, Paula smiling at Nick. Kate is asleep when she turns on her lamp, gets up, and answers the intercom. Nick and Kate sit across from each other at a desk in the lamp-lit lounge; he feeds her sauce while she is blindfolded, and Nick smiles at Kate in the soft glow."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "She opens an umbrella as he helps her, and they climb the spiral staircase. Nick kisses Kate, then briefly looks back as he descends, while she grins. In a dark room's amber light, Kate sleeps as Zoe, holding a video, slips past and turns on the hallway light. Kate, in pajamas, follows the flickering light to the lounge and sees Zoe watching a home movie of Christine on a windy beach. Christine runs by the sea, pretending to fly. Kate joins Zoe, and the TV shows Christine and Zoe's joyful faces; Christine kisses Zoe, who tears up. Kate comforts Zoe as the video shows Christine waving until it ends. In the morning, Kate and Zoe lie facing each other; Zoe smiles and closes her eyes as Kate embraces her. At the restaurant, Bernadette reads a letter. Later, Zoe, chased by Kate, runs out of her bedroom. The two engage in a pillow fight until collapsing exhausted on the hallway floor. In the restaurant, Nick manages a busy kitchen and dining room. Later, Nick and Paula relax with brandy, sharing smiles. At night, Kate wakes, answers the intercom, and sits with Nick in the lounge, where he spoon-feeds her sauce as he observes her with a smile."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "She carefully opens her umbrella as he graciously assists her in getting out, and together they make their way up the elegant spiral staircase that winds its way inside the building. Nick leans in intimately and kisses Kate deeply on the lips, after which he briefly glances back with a thoughtful expression as he makes his way down the stairs, while Kate is left with a delighted grin on her face, savoring the moment. In the amber half-light that softly illuminates a shadowy room, Kate is sound asleep in bed when the door is left ajar, and the hallway light flickers on as Zoe quietly slips past the open door, clutching a video close to her chest. Kate gazes intently as she notices Zoe, and dressed in her pajamas, Kate meanders softly down the hallway, drawn towards a dull, flickering light that is gently radiating from the lounge. She hesitates for a moment outside the open lounge door where Zoe is seated on the floor, watching a home movie of Christine joyfully frolicking on a dull, wind-swept beach. Christine playfully flaps her arms as if she is pretending to take flight as she runs joyously down to the edge of a grey, foamy sea. Kate steps into the lounge and sits down beside Zoe on the floor; now, the TV screen is filled with the vibrant, ecstatically joyful faces of Christine and Zoe, as Christine lovingly kisses her smiling daughter on the cheek and beams warmly back at the camera. With her attractive, long blonde hair cascading down, Christine throws her hair back and laughs joyously, while tears begin to well up in Zoe's doleful eyes. Kate averts her gaze away from the TV and looks down affectionately at Zoe, gently putting an arm around her niece, and Zoe leans into Kate for comfort as the video continues to play with Christine energetically running along the shore, waving enthusiastically back at the camera, her jacket and scarf flapping dramatically behind her until the grainy video finally comes to an end. When morning arrives, Kate and Zoe find themselves nestled in Zoe's bed, lying closely facing each other, with Zoe's arm resting lightly on Kate's shoulder as the morning daylight gracefully fills the room. Kate watches over a sleeping Zoe, who stares dreamily, and a faint smile dances across Zoe's lips before she gently closes her eyes once more. Kate tenderly places an arm around Zoe, and she too gradually closes her eyes. At the busy restaurant, Bernadette is seen absorbed in reading a letter. Later, Zoe excitedly runs out of her bedroom and charges down the corridor, with Kate playfully chasing after her, only to ambush her as she emerges from the lounge. Feathers scatter everywhere as Kate and Zoe gleefully engage in a playful pillow fight until Kate playfully pushes Zoe backward onto the inviting sofa. Exhausted and out of breath, the pair collapses onto the hall floor, with soft feathers drifting gracefully down around them, as if caught in a gentle breeze. Meanwhile, at the bustling restaurant, Nick commands the hectic kitchen with authority, and the dining room is packed to the brim as Paula and her dedicated waiting staff move busily around the tables, attending to guests. Later, Paula and Nick find a moment to relax together with a glass of brandy as Paula eyes Nick with a knowing smile. Kate is fast asleep in bed when she suddenly flicks on her bedside lamp, gets up, and wearing her comfortable dressing gown, answers the persistent intercom. Nick and Kate sit across from each other at a desk in the warmly lamp-lit lounge, where he carefully spoon-feeds the blindfolded Kate some sauce from a container positioned between them, and in the soft, ambient glow of the lamp, Nick observes Kate with a contented smile."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "With a deliberate motion, she carefully opens her umbrella as he gallantly assists her in getting out of the vehicle, and together they elegantly make their way up the grand, sophisticated spiral staircase that gracefully winds its way inside the magnificent building. Nick leans in with a sense of intimacy and affection, kissing Kate deeply and passionately on the lips. After this tender moment, he briefly turns back with a thoughtful expression on his face as he begins to make his way down the staircase, while Kate is left standing with a delighted and satisfied grin spread across her face, savoring the moment they shared. In the gentle, amber half-light that softly bathes a dimly lit room, Kate is serenely asleep in bed when the door is left slightly open, and the hallway light flickers on as Zoe quietly slips by the open door, clutching a video closely against her chest. Kate gazes intently as she catches sight of Zoe, and dressed comfortably in her pajamas, Kate meanders softly down the hallway, drawn towards a dull, flickering light that is gently emanating from the lounge. She pauses for a moment outside the open lounge door where Zoe is seated on the floor, watching an old home movie of Christine joyfully frolicking on a dull, wind-swept beach. Christine playfully flaps her arms, as though pretending to take flight, as she runs joyously down to the edge of a grey, foamy sea. Kate steps quietly into the lounge and sits down beside Zoe on the floor; now, the TV screen is filled with the vibrant, ecstatically joyful faces of Christine and Zoe, as Christine lovingly kisses her smiling daughter on the cheek and beams warmly back at the camera. With her attractive, long blonde hair cascading down, Christine throws her hair back with a carefree laugh, while tears begin to well up in Zoe's sorrowful eyes. Kate averts her gaze from the TV, looking down with affection at Zoe, gently wrapping an arm around her niece, as Zoe leans into Kate for comfort. The video continues to play with scenes of Christine energetically running along the shore, waving enthusiastically back at the camera, her jacket and scarf flapping dramatically behind her until the grainy video finally comes to an end. When the morning light finally arrives, Kate and Zoe find themselves nestled together in Zoe's bed, lying closely and facing each other, with Zoe's arm resting tenderly on Kate's shoulder as the morning daylight gracefully fills the room. Kate watches over a sleeping Zoe, who stares dreamily into the distance, and a faint smile dances across Zoe's lips before she gently closes her eyes once more. Kate tenderly places an arm around Zoe, and she too gradually closes her eyes, surrendering to the peaceful moment. At the bustling restaurant, Bernadette is seen absorbed, deeply engrossed in reading a letter. Later, Zoe excitedly dashes out of her bedroom and enthusiastically runs down the corridor, with Kate playfully chasing after her, only to ambush her as she emerges from the lounge. Feathers scatter everywhere as Kate and Zoe gleefully engage in a playful, spirited pillow fight until Kate playfully pushes Zoe backward onto the inviting sofa. Exhausted and out of breath from laughter, the pair collapses onto the hall floor, with soft feathers gently drifting down around them, as if caught in a gentle breeze. Meanwhile, at the bustling, vibrant restaurant, Nick expertly commands the hectic kitchen with a sense of authority and professionalism, and the dining area is filled to the brim with guests as Paula and her dedicated team of waiting staff move efficiently around the tables, attending to all the guests. Later, Paula and Nick find a moment to relax together, enjoying a glass of brandy as Paula eyes Nick with a knowing, affectionate smile. Kate is fast asleep in bed when she suddenly flicks on her bedside lamp, gets up, and wearing her comfortable, cozy dressing gown, answers the persistent intercom. Nick and Kate sit across from each other at a desk in the warmly lamp-lit lounge, where he carefully and considerately spoon-feeds the blindfolded Kate a taste of sauce from a container positioned between them, and in the soft, ambient glow of the lamp, Nick observes Kate with a contented, satisfied smile."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "As she reaches for the umbrella and opens it, he gently offers his assistance and helps her out into the weather, and together they ascend the spiral staircase inside the building, one step at a time, paying attention to the elegant curvature of each step. Nick leans in towards Kate, closing the distance slowly, and kisses her fully on the lips, savoring the moment before he pulls back. As he begins his descent back down the stairs, he takes a brief glance back, while Kate remains at the top, grinning to herself, cherishing the shared intimacy. Meanwhile, in a dimly lit room graced with an ambiance of amber light, Kate is deeply asleep in her bed, completely relaxed until the door, left ajar, creaks slightly. This allows a sliver of hallway light to stream in as Zoe quietly sneaks past, holding a video with care. The soft movement alerts Kate, who opens her eyes and sees Zoe, prompting her to get out of bed, still clad in her pajamas. Kate then slowly wanders down the hallway, her gaze fixed on the dull, flickering light emanating from the lounge where the video seems to be playing. As she reaches the open lounge door, she comes to a pause, observing Zoe seated comfortably on the floor, engrossed in watching a home movie. On-screen, Christine frolics on a drab, wind-swept beach, animatedly flapping her arms in a playful imitation of flight as she runs down to meet the moody grey sea. Drawn to the scene and Zoe's quiet company, Kate steps into the lounge and sits beside Zoe, their eyes glued to the TV. The screen is soon filled with images of Christine and Zoe’s joy-filled faces, capturing a moment where Christine kisses Zoe on the cheek lovingly and beams back warmly at the camera. Christine, with her striking long blonde hair, tosses her hair back with an infectious laugh, her joy apparent even as tears gently form in Zoe's eyes, reflecting a mix of emotions. Kate diverts her gaze from the TV to Zoe, noticing her niece's emotional reaction, and gently wraps an arm around her in a comforting gesture. Zoe leans into Kate's embrace, finding solace as the video continues, showing Christine running along the beach, waving energetically before the camera, her jacket and scarf caught in the breeze until the grainy video eventually fades out. The following morning, in the gentle embrace of daylight streaming into the room, Kate and Zoe lie in Zoe's bed, facing each other. Zoe, with a soft arm resting across Kate's shoulder, emits a steady, serene presence as Kate watches Zoe in her sleep. Zoe's lips part into a brief, unconscious smile, a flicker of contentment crossing her features before her eyes flutter shut again. Mirroring her niece, Kate places an arm around Zoe, her eyes slowly closing as peaceful sleep reclaims her. At the restaurant, amidst the bustling noise and activity, Bernadette reads a letter, engrossed in its contents. Later, Zoe bursts out of her bedroom, her small feet pattering down the corridor with Kate in playful pursuit. As Zoe streaks past the lounge, Kate skillfully ambushes her, and with a shared mischievous spirit, they engage in a boisterous pillow fight, exuberantly swinging the cushions at each other until feathers erupt into the air, floating down in gentle chaos. Overcome with laughter and fatigue, they both collapse onto the hall floor, lying side by side as feathers continue to drift and settle around them like a soft, whimsical snowfall. In a different scene, the restaurant is alive with activity, Nick orchestrates the hustle and bustle of a hectic kitchen with confidence and authority. In the adjacent dining room, the tables fill with patrons as Paula and her team of waitstaff expertly navigate the crowd, attending to guests with efficiency and care. Eventually, the pace winds down, and Paula and Nick find a moment to unwind, savoring a brandy together. Paula observes Nick with a smile, her eyes conveying warmth and camaraderie. Back at home, deep into the night, Kate lies fast asleep in bed when she suddenly awakens, her fingers reaching almost instinctively to flick on her bedside lamp. Rising from her slumber, she puts on her dressing gown and makes her way to the intercom, responding to an unexpected call. Later, Nick and Kate sit across from each other at a desk in the warmly-lit lounge. There, Nick indulges in a playful game as he spoon-feeds the blindfolded Kate a sample of sauce from a container positioned between them. In the soothing glow of the lamp, Nick watches Kate’s reaction with a satisfied smile, appreciating the moment they share in the intimate setting."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "She opens an umbrella as he assists her, and they ascend the spiral staircase inside the building. Nick kisses Kate before descending the stairs, leaving her grinning. In a dimly lit room, Kate is asleep when Zoe quietly enters with a video. Kate follows Zoe to a lounge lit by a flickering light, pausing to see Zoe watching a home movie of Christine playing on a windswept beach. Kate joins Zoe on the floor as they watch the video showing Christine joyously with Zoe, prompting tears in Zoe's eyes. Kate consoles Zoe, putting an arm around her as the video concludes. The next morning, they lie facing each other in bed, sharing a tender moment as Zoe smiles and returns to sleep. At a restaurant, Bernadette reads a letter. Later, Zoe rushes from her room with Kate in chase, culminating in a playful pillow fight that ends with them collapsing on the floor amidst drifting feathers. In the busy restaurant, Nick manages the kitchen while Paula and her team serve patrons, and later, Paula shares a brandy with Nick. Kate, asleep in bed, wakes to answer the intercom, then sits with Nick at a desk where he playfully spoon-feeds her sauce while observing her with a smile."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "She puts up an umbrella, a classic black model often seen on the rainy streets of London, as he helps her out, and they climb the spiral staircase inside the building, an architectural marvel designed by the renowned architect Sir Giles Gilbert Scott. Nick leans in and kisses Kate full on the lips, reminiscent of a scene out of a classic romantic film, and then Nick looks back briefly as he descends the stairs, while Kate grins to herself, savoring the moment. In the amber half-light of a darkened room, reminiscent of a setting from a moody Edward Hopper painting, Kate is fast asleep in bed when the door is ajar, and the hallway light comes on as Zoe slips past the open door clutching a video, a copy of their family trip to Cornwall last summer. Kate stares as she sees Zoe, and wearing pajamas adorned with tiny stars, Kate wanders down the hallway towards a dull, flickering light emanating from the lounge. She pauses outside the open lounge door where Zoe sits on the floor watching a home movie of Christine frolicking on a dull, wind-swept beach, reminiscent of the rugged shores of the North Sea. Christine flaps her arms as if pretending to fly as she runs down to the edge of a grey sea. Kate enters the lounge and joins Zoe on the floor; now, the TV screen fills with Christine and Zoe's ecstatically happy faces, and Christine kisses her smiling daughter on the cheek and beams back at the camera. Attractive, long blonde-haired Christine throws back her hair and laughs joyously as tears well in Zoe's doleful eyes. Kate looks away from the TV and down at Zoe, putting an arm around her niece, and Zoe leans into Kate as the video plays with Christine running along the beach, waving back at the camera, her jacket and scarf flapping behind her until the grainy video comes to an end. In the morning, Kate and Zoe are in Zoe's bed, lying facing each other, Zoe with her arm on Kate's shoulder as daylight fills the room, streaming through the curtains that Kate had just opened to let in the morning sun. Kate watches a sleeping Zoe, who stares, and a smile flickers across Zoe's lips before she closes her eyes again. Kate places an arm around Zoe, and she too closes her eyes. At the restaurant, a cozy French bistro known for its exquisite pastries, Bernadette reads a letter, a handwritten note in elegant script that seems to bring both surprise and joy to her expression. Later, Zoe runs out of her bedroom and down the corridor, chased by Kate, who ambushes her coming out of the lounge. Feathers fly as Kate and Zoe gleefully batter each other with their pillows until Kate pushes Zoe backwards onto the sofa. Exhausted, the pair collapse onto the hall floor, with feathers drifting down around them like snowflakes in a gentle winter storm. At the restaurant, Nick commands a hectic kitchen, orchestrating the staff as if conducting a symphony, and the dining room is packed as Paula and her waiting staff move busily around the tables. Later, Paula and Nick relax with a brandy, a fine cognac from a cherished reserve, as Paula eyes Nick with a smile. Kate's fast asleep in bed when she flicks on her bedside lamp, an antique Tiffany passed down from her grandmother, rises, and wearing her dressing gown, answers the intercom. Nick and Kate sit across from each other at a desk in the lamp-lit lounge, where he spoon-feeds the blindfolded Kate some sauce, a new culinary experiment from his restaurant menu, from a container between them, and in the soft glow of the lamp, Nick observes Kate with a smile that speaks of shared secrets and future plans."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Nick and Kate sit across from each other at a desk in the lamplit lounge where he spoonfeeds the blindfolded Kate She puts up an umbrella as he helps her out and they climb the spiral staircase inside the building Later Paula and Nick relax with a brandy as Paula eyes Nick with a smile Nick leans in and kisses Kate full on the lips and then Nick looks back briefly as he descends the stairs while Kate grins to herself At the restaurant Nick commands a hectic kitchen and the dining room is packed as Paula and her waiting staff move busily around the tables In the amber halflight of a darkened room Kate is fast asleep in bed when the door is ajar and the hallway light comes on as Zoe slips past the open door clutching a video Kate stares as she sees Zoe and wearing pajamas Kate wanders down the hallway towards a dull flickering light emanating from the lounge Kate stares as she sees Zoe and wearing pajamas She puts up an umbrella as he helps her out and they climb the spiral staircase inside the building Kate watches a sleeping Zoe who stares and a smile flickers across Zoe's lips before she closes her eyes again She pauses outside the open lounge door where Zoe sits on the floor watching a home movie of Christine frolicking on a dull windswept beach Christine flaps her arms as if pretending to fly as she runs down to the edge of a grey sea Kate enters the lounge and joins Zoe on the floor Kate wanders down the hallway towards a dull flickering light emanating from the lounge now the TV screen fills with Christine and Zoe's ecstatically happy faces and Christine kisses her smiling daughter on the cheek and beams back at the camera Later Zoe runs out of her bedroom and down the corridor chased by Kate who ambushes her coming out of the lounge Attractive long blonde haired Christine throws back her hair and laughs joyously as tears well in Zoe's doleful eyes Kate looks away from the TV and down at Zoe putting an arm around her niece and Zoe leans into Kate as the video plays with Christine running along the beach waving back at the camera her jacket and scarf flapping behind her until the grainy video comes to an end as daylight fills the room In the morning Kate and Zoe are in Zoe's bed lying facing each other Zoe with her arm on Kate's shoulder now the TV screen fills with Christine and Zoe's ecstatically happy faces and Christine kisses her smiling daughter on the cheek and beams back at the camera as daylight fills the room Kate watches a sleeping Zoe who stares and a smile flickers across Zoe's lips before she closes her eyes again Kate enters the lounge and joins Zoe on the floor Kate places an arm around Zoe and she too closes her eyes At the restaurant Bernadette reads a letter Later Zoe runs out of her bedroom and down the corridor chased by Kate who ambushes her coming out of the lounge Feathers fly as Kate and Zoe gleefully batter each other with their pillows until Kate pushes Zoe backwards onto the sofa some sauce from a container between them and in the soft glow of the lamp In the amber halflight of a darkened room Kate is fast asleep in bed when the door is ajar and the hallway light comes on as Zoe slips past the open door clutching a video Exhausted the pair collapse onto the hall floor with feathers drifting down around them At the restaurant Nick commands a hectic kitchen and the dining room is packed as Paula and her waiting staff move busily around the tables Later Paula and Nick relax with a brandy as Paula eyes Nick with a smile Kate's fast asleep in bed when she flicks on her bedside lamp rises and wearing her dressing gown answers the intercom Nick and Kate sit across from each other at a desk in the lamplit lounge where he spoonfeeds the blindfolded Kate some sauce from a container between them and in the soft glow of the lamp Nick observes Kate with a smile"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "She puts up an umbrella as he helps her out and they climb the spiral staircase inside the building. Nick leans in and kisses Kate full on the lips and then Nick looks back briefly as he descends the stairs while Kate grins to herself. In the amber halflight of a darkened room Kate is fast asleep in bed when the door is ajar and the hallway light comes on as Zoe slips past the open door clutching a video. Kate stares as she sees Zoe and wearing pajamas. Kate wanders down the hallway towards a dull flickering light emanating from the lounge. She pauses outside the open lounge door where Zoe sits on the floor watching a home movie of Christine frolicking on a dull windswept beach. Christine flaps her arms as if pretending to fly as she runs down to the edge of a grey sea. Kate enters the lounge and joins Zoe on the floor. now the TV screen fills with Christine and Zoe's ecstatically happy faces and Christine kisses her smiling daughter on the cheek and beams back at the camera. Attractive long blonde haired Christine throws back her hair and laughs joyously as tears well in Zoe's doleful eyes. Kate looks away from the TV and down at Zoe putting an arm around her niece and Zoe leans into Kate as the video plays with Christine running along the beach waving back at the camera her jacket and scarf flapping behind her until the grainy video comes to an end. In the morning Kate and Zoe are in Zoe's bed lying facing each other. Zoe with her arm on Kate's shoulder. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. as daylight fills the room. Kate watches a sleeping Zoe who stares and a smile flickers across Zoe's lips before she closes her eyes again. Kate places an arm around Zoe and she too closes her eyes. At the restaurant Bernadette reads a letter. Later Zoe runs out of her bedroom and down the corridor chased by Kate who ambushes her coming out of the lounge. Feathers fly as Kate and Zoe gleefully batter each other with their pillows until Kate pushes Zoe backwards onto the sofa. Exhausted the pair collapse onto the hall floor with feathers drifting down around them. At the restaurant Nick commands a hectic kitchen and the dining room is packed as Paula and her waiting staff move busily around the tables. Later Paula and Nick relax with a brandy as Paula eyes Nick with a smile. Kate's fast asleep in bed when she flicks on her bedside lamp rises and wearing her dressing gown answers the intercom. Nick and Kate sit across from each other at a desk in the lamplit lounge where he spoonfeeds the blindfolded Kate. some sauce from a container between them and in the soft glow of the lamp. Nick observes Kate with a smile."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "She puts up an umbrella as he helps her out and they climb the spiral staircase inside the building. Nick leans in and kisses Kate full on the lips and then Nick looks back briefly as he descends the stairs while Kate grins to herself. In the amber halflight of a darkened room Kate is fast asleep in bed when the door is ajar and the hallway light comes on as Zoe slips past the open door clutching a video. Kate stares as she sees Zoe and wearing pajamas. Kate wanders down the hallway towards a dull flickering light emanating from the lounge. She pauses outside the open lounge door where Zoe sits on the floor watching a home movie of Christine frolicking on a dull windswept beach. Christine flaps her arms as if pretending to fly as she runs down to the edge of a grey sea. Kate enters the lounge and joins Zoe on the floor. now the TV screen fills with Christine and Zoe's ecstatically happy faces and Christine kisses her smiling daughter on the cheek and beams back at the camera. Attractive long blonde haired Christine throws back her hair and laughs joyously as tears well in Zoe's doleful eyes. Kate looks away from the TV and down at Zoe putting an arm around her niece and Zoe leans into Kate as the video plays with Christine running along the beach waving back at the camera her jacket and scarf flapping behind her until the grainy video comes to an end. In the morning Kate and Zoe are in Zoe's bed lying facing each other. Zoe with her arm on Kate's shoulder. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. as daylight fills the room. Kate watches a sleeping Zoe who stares and a smile flickers across Zoe's lips before she closes her eyes again. Kate places an arm around Zoe and she too closes her eyes. At the restaurant Bernadette reads a letter. Later Zoe runs out of her bedroom and down the corridor chased by Kate who ambushes her coming out of the lounge. Feathers fly as Kate and Zoe gleefully batter each other with their pillows until Kate pushes Zoe backwards onto the sofa. Exhausted the pair collapse onto the hall floor with feathers drifting down around them. At the restaurant Nick commands a hectic kitchen and the dining room is packed as Paula and her waiting staff move busily around the tables. Later Paula and Nick relax with a brandy as Paula eyes Nick with a smile. Kate's fast asleep in bed when she flicks on her bedside lamp rises and wearing her dressing gown answers the intercom. Nick and Kate sit across from each other at a desk in the lamplit lounge where he spoonfeeds the blindfolded Kate. some sauce from a container between them and in the soft glow of the lamp. Nick observes Kate with a smile."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "She puts up an umbrella as he helps her out and they climb the spiral staircase inside the building. Nick leans in and kisses Kate full on the lips and then Nick looks back briefly as he descends the stairs while Kate grins to herself. In the amber halflight of a darkened room Kate is fast asleep in bed when the door is ajar and the hallway light comes on as Zoe slips past the open door clutching a video. Kate stares as she sees Zoe and wearing pajamas. Kate wanders down the hallway towards a dull flickering light emanating from the lounge. She pauses outside the open lounge door where Zoe sits on the floor watching a home movie of Christine frolicking on a dull windswept beach. Christine flaps her arms as if pretending to fly as she runs down to the edge of a grey sea. At the restaurant Nick commands a hectic kitchen and the dining room is packed as Paula and her waiting staff move busily around the tables. Later Paula and Nick relax with a brandy as Paula eyes Nick with a smile. Kate's fast asleep in bed when she flicks on her bedside lamp rises and wearing her dressing gown answers the intercom. Nick and Kate sit across from each other at a desk in the lamplit lounge where he spoonfeeds the blindfolded Kate. some sauce from a container between them and in the soft glow of the lamp. Nick observes Kate with a smile."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "She puts up an umbrella as he helps her out and they climb the spiral staircase inside the building. Nick leans in and kisses Kate full on the lips and then Nick looks back briefly as he descends the stairs while Kate grins to herself. In the amber halflight of a darkened room Kate is fast asleep in bed when the door is ajar and the hallway light comes on as Zoe slips past the open door clutching a video. Nick and Kate sit across from each other at a desk in the lamplit lounge where he spoonfeeds the blindfolded Kate. some sauce from a container between them and in the soft glow of the lamp. Nick observes Kate with a smile."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "She puts up an umbrella as the dog helps her out, and they climb the spiral staircase inside the building. The squirrel leans in and kisses the rabbit full on the lips, and then the squirrel looks back briefly as he descends the stairs, while the rabbit grins to herself. In the amber half-light of a darkened room, the rabbit is fast asleep in bed when the door is ajar, and the hallway light comes on as the raccoon slips past the open door clutching a video. The rabbit stares as she sees the raccoon, and wearing pajamas, the rabbit wanders down the hallway towards a dull, flickering light emanating from the lounge. She pauses outside the open lounge door where the raccoon sits on the floor watching a home movie of the fox frolicking on a dull, wind-swept beach. The fox flaps her arms as if pretending to fly as she runs down to the edge of a grey sea. The rabbit enters the lounge and joins the raccoon on the floor; now, the TV screen fills with the fox and the raccoon's ecstatically happy faces, and the fox kisses her smiling daughter on the cheek and beams back at the camera. Attractive, long blonde-haired fox throws back her hair and laughs joyously as tears well in the raccoon's doleful eyes. The rabbit looks away from the TV and down at the raccoon, putting an arm around her niece, and the raccoon leans into the rabbit as the video plays with the fox running along the beach, waving back at the camera, her jacket and scarf flapping behind her until the grainy video comes to an end. In the morning, the rabbit and the raccoon are in the raccoon's bed, lying facing each other, the raccoon with her arm on the rabbit's shoulder as daylight fills the room. The rabbit watches a sleeping raccoon, who stares, and a smile flickers across the raccoon's lips before she closes her eyes again. The rabbit places an arm around the raccoon, and she too closes her eyes. At the restaurant, the owl reads a letter. Later, the raccoon runs out of her bedroom and down the corridor, chased by the rabbit, who ambushes her coming out of the lounge. Feathers fly as the rabbit and the raccoon gleefully batter each other with their pillows until the rabbit pushes the raccoon backwards onto the sofa. Exhausted, the pair collapse onto the hall floor, with feathers drifting down around them. At the restaurant, the dog commands a hectic kitchen, and the dining room is packed as the parrot and her waiting staff move busily around the tables. Later, the parrot and the dog relax with a brandy as the parrot eyes the dog with a smile. The rabbit's fast asleep in bed when she flicks on her bedside lamp, rises, and wearing her dressing gown, answers the intercom. The dog and the rabbit sit across from each other at a desk in the lamp-lit lounge, where he spoon-feeds the blindfolded rabbit some sauce from a container between them, and in the soft glow of the lamp, the dog observes the rabbit with a smile."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "She puts up a parasol as he helps her out, and they climb the spiral escalator inside the greenhouse. Nick leans in and kisses Kate full on the lips, and then Nick looks back briefly as he descends the escalator, while Kate grins to herself. In the sapphire half-light of a dim aviary, Kate is fast asleep in a hammock when the curtain is ajar, and the hallway light comes on as Zoe slips past the open curtain clutching a book. Kate stares as she sees Zoe, and wearing overalls, Kate wanders down the hallway towards a dull, flickering light emanating from the studio. She pauses outside the open studio door where Zoe sits on the floor reading a magazine of Christine frolicking on a dull, wind-swept prairie. Christine flaps her arms as if pretending to fly as she runs down to the edge of a grey lake. Kate enters the studio and joins Zoe on the floor; now, the projector fills with Christine and Zoe's ecstatically happy faces, and Christine kisses her smiling daughter on the cheek and beams back at the camera. Attractive, long blonde haired Christine throws back her hair and laughs joyously as tears well in Zoe's doleful eyes. Kate looks away from the projector and down at Zoe, putting an arm around her niece, and Zoe leans into Kate as the magazine shows Christine running along the prairie, waving back at the camera, her sweater and scarf flapping behind her until the grainy magazine comes to an end. In the morning, Kate and Zoe are in Zoe's tent, lying facing each other, Zoe with her arm on Kate's shoulder as daylight fills the room. Kate watches a sleeping Zoe, who stares, and a smile flickers across Zoe's lips before she closes her eyes again. Kate places an arm around Zoe, and she too closes her eyes. At the cafe, Bernadette reads a postcard. Later, Zoe runs out of her study and down the corridor, chased by Kate, who ambushes her coming out of the studio. Confetti flies as Kate and Zoe gleefully batter each other with their cushions until Kate pushes Zoe backwards onto the armchair. Exhausted, the pair collapse onto the hallway floor, with confetti drifting down around them. At the cafe, Nick commands a hectic bakery, and the dining room is packed as Paula and her waiting staff move busily around the tables. Later, Paula and Nick relax with a cider as Paula eyes Nick with a smile. Kate's fast asleep in bed when she flicks on her bedside lantern, rises, and wearing her bathrobe, answers the intercom. Nick and Kate sit across from each other at a bench in the lantern-lit studio, where he spoon-feeds the blindfolded Kate some soup from a bowl between them, and in the soft glow of the lantern, Nick observes Kate with a smile."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "She tosses an umbrella as he distracts her out, and they skip the spiral staircase inside the building. Nick waves and tickles Kate full on the lips, and then Nick turns back briefly as he floats up the stairs, while Kate chuckles to herself. In the amber half-light of a darkened room, Kate is wide awake in bed when the door is ajar, and the hallway light dims as Zoe dances past the open door clutching a video. Kate listens as she hears Zoe, and wearing pajamas, Kate marches down the hallway towards a bright, flickering light emanating from the lounge. She spins outside the open lounge door where Zoe kneels on the floor watching a home movie of Christine skipping on a dull, wind-swept beach. Christine rolls her arms as if pretending to wave as she strolls down to the edge of a grey sea. Kate exits the lounge and stands beside Zoe on the floor; now, the TV screen fills with Christine and Zoe's ecstatically happy faces, and Christine nudges her smiling daughter on the cheek and laughs back at the camera. Attractive, long blonde haired Christine flicks back her hair and shouts joyously as tears drip in Zoe's doleful eyes. Kate turns away from the TV and down at Zoe, raising an arm around her niece, and Zoe hops into Kate as the video pauses with Christine spinning along the beach, shouting back at the camera, her jacket and scarf fluttering behind her until the grainy video bursts to an end. In the morning, Kate and Zoe are in Zoe's bed, standing facing each other, Zoe with her arm on Kate's shoulder as daylight brightens the room. Kate nudges a sleeping Zoe, who peers, and a smile spreads across Zoe's lips before she stretches her eyes again. Kate lifts an arm around Zoe, and she too stretches her eyes. At the restaurant, Bernadette sketches a letter. Later, Zoe bounces out of her bedroom and through the corridor, shadowed by Kate, who surprises her slipping out of the lounge. Feathers swirl as Kate and Zoe gleefully tickle each other with their pillows until Kate drags Zoe sideways onto the sofa. Exhausted, the pair roll onto the hall floor, with feathers scattering down around them. At the restaurant, Nick dreams a quiet kitchen, and the dining room is vacant as Paula and her waiting staff drift lazily around the tables. Later, Paula and Nick unwind with a brandy as Paula studies Nick with a smile. Kate's wide awake in bed when she dims on her bedside lamp, lowers, and wearing her dressing gown, puzzles the intercom. Nick and Kate sit beside each other at a desk in the lamp-lit lounge, where he hand-feeds the blindfolded Kate some sauce from a container between them, and in the soft glow of the lamp, Nick listens to Kate with a smile."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "The mailbox puts up a kite as the piano helps the mailbox out, and they climb the escalator inside the suitcase. The toaster leans in and kisses the backpack full on the thermometer, and then the toaster looks back briefly as it descends the ladder, while the backpack grins to itself. In the amber half-light of a darkened attic, the backpack is fast asleep in a hammock when the cabinet is ajar, and the hallway light comes on as the curtain slips past the open cabinet clutching a spoon. The backpack stares as it sees the curtain, and wearing curtains, the backpack wanders down the hallway toward a dull, flickering light emanating from the refrigerator. It pauses outside the open refrigerator door where the curtain sits on the floor watching a home movie of the mailbox frolicking on a dull, wind-swept rooftop. The mailbox flaps its arms as if pretending to fly as it runs down to the edge of a grey spaceship. The backpack enters the refrigerator and joins the curtain on the floor; now, the TV screen fills with the mailbox and the curtain’s ecstatically happy faces, and the mailbox kisses its smiling flowerpot on the cheek and beams back at the umbrella. Attractive, long blonde-haired mailbox throws back its hair and laughs joyously as tears well in the curtain’s doleful branches. The backpack looks away from the TV and down at the curtain, putting an arm around its cactus, and the curtain leans into the backpack as the spoon plays with the mailbox running along the rooftop, waving back at the umbrella, its jacket and scarf flapping behind it until the grainy spoon comes to an end. In the morning, the backpack and the curtain are in the curtain's basket, lying facing each other, the curtain with its arm on the backpack's shoulder as daylight fills the attic. The backpack watches a sleeping curtain, who stares, and a smile flickers across the curtain’s petals before it closes its eyes again. The backpack places an arm around the curtain, and it too closes its eyes. At the playground, the lamp reads a postcard. Later, the curtain runs out of its cupboard and down the corridor, chased by the backpack, who ambushes it coming out of the refrigerator. Feathers fly as the backpack and the curtain gleefully batter each other with their slippers until the backpack pushes the curtain backward onto the suitcase. Exhausted, the pair collapse onto the hall garden, with feathers drifting down around them. At the playground, the toaster commands a hectic library, and the dining room is packed as the balloon and its waiting staff move busily around the swings. Later, the balloon and the toaster relax with a lemonade as the balloon eyes the toaster with a smile. The backpack's fast asleep in the hammock when it flicks on its bedside candle, rises, and wearing its dressing gown, answers the doorknob. The toaster and the backpack sit across from each other at a desk in the lamp-lit refrigerator, where it spoon-feeds the blindfolded backpack some honey from a container between them, and in the soft glow of the candle, the toaster observes the backpack with a smile."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "He hangs up a coat as she lifts him out, and they descend the narrow escalator inside the museum. Lisa leans back and whispers to Tom full in the ear, and then Lisa glances back briefly as she ascends the escalator, while Tom chuckles to himself. In the silver twilight of a sunlit room, Tom is wide awake on the chair when the window is closed, and the desk lamp turns off as Sarah sneaks by the closed window clutching a book. Tom yawns as he hears Sarah, and wearing flip-flops, Tom strides down the corridor towards a bright, flickering light shining from the kitchen. He stops inside the open kitchen door where Sarah stands on the couch reading a novel about Jonathan diving into a bright, sunlit pool. Jonathan waves his hands as if trying to swim as he jumps up to the surface of a blue lake. Tom exits the kitchen and follows Sarah onto the couch; now, the monitor fills with Jonathan and Sarah's incredibly cheerful expressions, and Jonathan pats his smiling mother on the shoulder and nods back at the lens. Graceful, short brunette Jonathan ties back his scarf and cries sadly as laughter rings in Sarah's gleeful smile. Tom listens away from the monitor and up at Sarah, lifting a foot below his uncle, and Sarah curls into Tom as the novel continues with Jonathan walking along the cliff, smiling up at the lens, his umbrella and hat bouncing beside him until the polished novel skips to a start. At night, Tom and Sarah are on Tom's chair, sitting away from each other, Sarah with her foot on Tom's knee as moonlight dims the room. Tom watches an awake Sarah, who blinks, and a frown flashes across Sarah's eyes before she opens her lips again. Tom places a hand over Sarah, and he too opens his eyes. In the garden, Michael sings a song. Earlier, Sarah strolls into the kitchen and up the stairs, followed by Tom, who sneaks past her going into the office. Papers swirl as Tom and Sarah anxiously nudge each other with their elbows until Tom lifts Sarah upright onto the desk. Refreshed, the duo straighten onto the bedroom ceiling, with papers raining up around them. In the garden, Lisa observes a quiet balcony, and the living room is empty as Ben and her cleaning crew drift slowly around the chairs. Earlier, Ben and Lisa laugh over a martini as Ben scans Lisa with a frown. Tom's wide awake on the chair when he shuts off his table lamp, sits, and wearing his bathrobe, ignores the telephone. Ben and Tom stand in front of each other at a table in the moon-lit office, where she spoon-feeds the blindfolded Tom some mustard from a pot beside them, and in the dim shade of the lamp, Ben admires Tom with a grin."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "She raises a parasol as he guides her forward, and they hop the looping ladder outside the monument. Nick bends down and whispers to Kate full in the ear, and then Nick glances forward briefly as he elevates the ladder, while Kate chuckles to herself. In the violet dusk of a dim room, Kate is fully awake on a couch when the window is shut, and the pathway light flickers off as Zoe creeps past the closed window clutching a cassette. Kate blinks as she notices Zoe, and wearing slippers, Kate drifts down the corridor towards a bright, pulsing glow radiating from the kitchen. She halts outside the shut kitchen window where Zoe perches on a chair observing a slide show of Christine dancing on a bright, sun-drenched meadow. Christine wiggles her hands as if pretending to swim as she skips up to the border of a blue lake. Kate steps into the kitchen and sits beside Zoe on the chair; now, the computer screen fills with Christine and Zoe's cheerfully excited faces, and Christine pecks her giggling daughter on the forehead and grins up at the camera. Attractive, bob-haired Christine tosses up her locks and chuckles cheerfully as laughter wells in Zoe's joyous eyes. Kate glances away from the computer and up at Zoe, placing a hand on her nephew, and Zoe embraces Kate as the slide show ends with Christine skipping along the meadow, winking up at the camera, her sweater and scarf fluttering beside her until the clear image fades out. In the night, Kate and Zoe are in Zoe's hammock, lying back to back, Zoe with her hand on Kate's knee as moonlight shades the room. Kate observes a conscious Zoe, who blinks, and a giggle dances across Zoe's mouth before she opens her eyes again. Kate puts a blanket over Zoe, and she too drifts away. At the café, Bernadette skims through a postcard. Later, Zoe stumbles out of her wardrobe and up the passageway, followed by Kate, who tackles her coming out of the kitchen. Confetti scatters as Kate and Zoe joyously pelt each other with their cushions until Kate trips Zoe forward onto the armchair. Weary, the pair flop onto the yard floor, with confetti showering down around them. At the café, Nick directs a tranquil bakery, and the front room is overflowing as Paula and her serving crew wander calmly around the counters. Later, Paula and Nick rest with a soda as Paula regards Nick with a chuckle. Kate's fully awake in bed when she shuts off her bedside lamp, falls, and wearing her boots, answers the telephone. Nick and Kate lie across from each other at a table in the lamp-lit kitchen, where he hands the masked Kate some candy from a jar beside them, and in the bright glow of the lamp, Nick watches Kate with a grin."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "The penguin hoists a kite as the elephant assists the penguin up, and they slide down the icy ladder outside the submarine. Sam drifts away and pecks Alex lightly on the forehead, and then Sam glances forward briefly as Sam climbs the vines, while Alex chuckles to themselves. In the turquoise spotlight of a bright room, Alex is wide awake in a hammock when the window is sealed, and the ceiling fan spins on as Luca hovers above the locked window grasping a painting. Alex gapes as Alex notices Luca, and wearing overalls, Alex dances down the corridor towards a bright, flickering glow emanating from the kitchen. Alex hesitates inside the closed kitchen window where Luca stands on the table observing a cartoon of Taylor soaring over a bright, moonlit field. Taylor twirls her legs as if pretending to cartwheel as she jumps up to the tip of a blue mountain. Alex leaves the kitchen and follows Luca on the table; now, the laptop screen fills with Taylor and Luca's blissfully curious expressions, and Taylor hugs her laughing father on the elbow and scowls away from the window. Short, dark-haired Taylor pulls up his shoes and sobs quietly as laughter erupts in Luca's joyful cheeks. Alex gawks at the laptop and over at Luca, offering a leg under her uncle, and Luca embraces Alex as the cartoon rolls with Taylor skipping through the field, pointing away from the window, his boots and gloves trailing behind him until the digital cartoon freezes to a conclusion. In the evening, Alex and Luca are on Luca's desk, standing against each other, Luca with their knee on Alex's ankle as moonlight darkens the window. Alex listens to a snoring Luca, who hums, and a smirk skips under Luca's ears before they open their fingers again. Alex stretches a leg over Luca, and they too open their fingers. At the garage, Fred scans a postcard. Later, Luca tiptoes into their kitchen and up the ladder, shadowed by Alex, who tackles them stepping into the kitchen. Dust floats as Alex and Luca silently embrace each other with their blankets until Alex pulls Luca gently onto the stool. Rested, the duo drift up to the attic ceiling, with dust falling up around them. At the garage, Sam whispers into a silent garden, and the living room is empty as Olivia and her cleaning crew stroll silently around the ceiling. Later, Olivia and Sam dream with a tea as Olivia watches Sam with a smirk. Alex's wide awake in a hammock when Alex turns off their ceiling fan, sleeps, and wearing a bathrobe, ignores the elevator. Sam and Alex stand apart from each other on a balcony in the neon-lit kitchen, where Sam sings to the blindfolded Alex some soup from a suitcase behind them, and in the glaring heat of the light, Sam puzzles Alex with a grin."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Kate and Nick share a romantic moment before Nick departs. Later, Kate finds her niece, Zoe, watching a home video of Christine, evoking an emotional scene. Zoe and Kate bond, sharing a comforting moment in bed overnight. In the morning, they enjoy playful antics with a pillow fight that leaves them breathless amidst floating feathers. Meanwhile, Nick is busy managing a bustling restaurant, sharing a relaxed moment with Paula afterward. That night, Nick visits Kate, and they share an intimate moment in the warmly lit lounge, with Nick feeding Kate a sauce while she wears a blindfold, both appearing content and connected."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Nick observes Kate with a smile some sauce from a container between them and in the soft glow of the lamp Nick and Kate sit across from each other at a desk in the lamplit lounge where he spoonfeeds the blindfolded Kate Kate's fast asleep in bed when she flicks on her bedside lamp rises and wearing her dressing gown answers the intercom Later Paula and Nick relax with a brandy as Paula eyes Nick with a smile At the restaurant Nick commands a hectic kitchen and the dining room is packed as Paula and her waiting staff move busily around the tables Exhausted the pair collapse onto the hall floor with feathers drifting down around them Feathers fly as Kate and Zoe gleefully batter each other with their pillows until Kate pushes Zoe backwards onto the sofa Later Zoe runs out of her bedroom and down the corridor chased by Kate who ambushes her coming out of the lounge At the restaurant Bernadette reads a letter Kate places an arm around Zoe and she too closes her eyes Kate watches a sleeping Zoe who stares and a smile flickers across Zoe's lips before she closes her eyes again as daylight fills the room Zoe with her arm on Kate's shoulder In the morning Kate and Zoe are in Zoe's bed lying facing each other Kate looks away from the TV and down at Zoe putting an arm around her niece and Zoe leans into Kate as the video plays with Christine running along the beach waving back at the camera her jacket and scarf flapping behind her until the grainy video comes to an end Attractive long blonde haired Christine throws back her hair and laughs joyously as tears well in Zoe's doleful eyes now the TV screen fills with Christine and Zoe's ecstatically happy faces and Christine kisses her smiling daughter on the cheek and beams back at the camera Kate enters the lounge and joins Zoe on the floor Christine flaps her arms as if pretending to fly as she runs down to the edge of a grey sea She pauses outside the open lounge door where Zoe sits on the floor watching a home movie of Christine frolicking on a dull windswept beach Kate wanders down the hallway towards a dull flickering light emanating from the lounge Kate stares as she sees Zoe and wearing pajamas In the amber halflight of a darkened room Kate is fast asleep in bed when the door is ajar and the hallway light comes on as Zoe slips past the open door clutching a video Nick leans in and kisses Kate full on the lips and then Nick looks back briefly as he descends the stairs while Kate grins to herself She puts up an umbrella as he helps her out and they climb the spiral staircase inside the building"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "At the restaurant Bernadette reads a letter Zoe with her arm on Kate's shoulder Attractive long blonde haired Christine throws back her hair and laughs joyously as tears well in Zoe's doleful eyes Nick observes Kate with a smile Exhausted the pair collapse onto the hall floor with feathers drifting down around them Christine flaps her arms as if pretending to fly as she runs down to the edge of a grey sea She pauses outside the open lounge door where Zoe sits on the floor watching a home movie of Christine frolicking on a dull windswept beach Kate looks away from the TV and down at Zoe putting an arm around her niece and Zoe leans into Kate as the video plays with Christine running along the beach waving back at the camera her jacket and scarf flapping behind her until the grainy video comes to an end Kate places an arm around Zoe and she too closes her eyes Kate's fast asleep in bed when she flicks on her bedside lamp rises and wearing her dressing gown answers the intercom In the morning Kate and Zoe are in Zoe's bed lying facing each other Feathers fly as Kate and Zoe gleefully batter each other with their pillows until Kate pushes Zoe backwards onto the sofa Nick leans in and kisses Kate full on the lips and then Nick looks back briefly as he descends the stairs while Kate grins to herself Kate watches a sleeping Zoe who stares and a smile flickers across Zoe's lips before she closes her eyes again Nick and Kate sit across from each other at a desk in the lamplit lounge where he spoonfeeds the blindfolded Kate as daylight fills the room In the amber halflight of a darkened room Kate is fast asleep in bed when the door is ajar and the hallway light comes on as Zoe slips past the open door clutching a video Later Zoe runs out of her bedroom and down the corridor chased by Kate who ambushes her coming out of the lounge some sauce from a container between them and in the soft glow of the lamp Kate wanders down the hallway towards a dull flickering light emanating from the lounge Later Paula and Nick relax with a brandy as Paula eyes Nick with a smile Kate enters the lounge and joins Zoe on the floor now the TV screen fills with Christine and Zoe's ecstatically happy faces and Christine kisses her smiling daughter on the cheek and beams back at the camera She puts up an umbrella as he helps her out and they climb the spiral staircase inside the building Kate stares as she sees Zoe and wearing pajamas At the restaurant Nick commands a hectic kitchen and the dining room is packed as Paula and her waiting staff move busily around the tables"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "as daylight fills the room Kate watches a sleeping Zoe who stares and a smile flickers across Zoe's lips before she closes her eyes again Kate places an arm around Zoe and she too closes her eyes At the restaurant Bernadette reads a letter Later Zoe runs out of her bedroom and down the corridor chased by Kate who ambushes her coming out of the lounge Feathers fly as Kate and Zoe gleefully batter each other with their pillows until Kate pushes Zoe backwards onto the sofa Exhausted the pair collapse onto the hall floor with feathers drifting down around them At the restaurant Nick commands a hectic kitchen and the dining room is packed as Paula and her waiting staff move busily around the tables Later Paula and Nick relax with a brandy as Paula eyes Nick with a smile Kate's fast asleep in bed when she flicks on her bedside lamp rises and wearing her dressing gown answers the intercom Nick and Kate sit across from each other at a desk in the lamplit lounge where he spoonfeeds the blindfolded Kate some sauce from a container between them and in the soft glow of the lamp Nick observes Kate with a smile She puts up an umbrella as he helps her out and they climb the spiral staircase inside the building Nick leans in and kisses Kate full on the lips and then Nick looks back briefly as he descends the stairs while Kate grins to herself In the amber halflight of a darkened room Kate is fast asleep in bed when the door is ajar and the hallway light comes on as Zoe slips past the open door clutching a video Kate stares as she sees Zoe and wearing pajamas Kate wanders down the hallway towards a dull flickering light emanating from the lounge She pauses outside the open lounge door where Zoe sits on the floor watching a home movie of Christine frolicking on a dull windswept beach Christine flaps her arms as if pretending to fly as she runs down to the edge of a grey sea Kate enters the lounge and joins Zoe on the floor now the TV screen fills with Christine and Zoe's ecstatically happy faces and Christine kisses her smiling daughter on the cheek and beams back at the camera Attractive long blonde haired Christine throws back her hair and laughs joyously as tears well in Zoe's doleful eyes Kate looks away from the TV and down at Zoe putting an arm around her niece and Zoe leans into Kate as the video plays with Christine running along the beach waving back at the camera her jacket and scarf flapping behind her until the grainy video comes to an end In the morning Kate and Zoe are in Zoe's bed lying facing each other Zoe with her arm on Kate's shoulder"
        }
      ]
    }
  ]
}