{
  "ground_truth": "He mops his sweaty brow with a handkerchief and closes his book. Lizzie comes in defiantly and goes to stand closer to her father, giving her hysterical mother a wry smile. Outside, Lydia and Kitty are heading out and they all look back at the house as Charlotte heads towards the house. Charlotte pauses for a moment, lost in thought, and inside, Mr. Collins is packing. He bows, and Charlotte follows him out. A lady's hand is at work on a delicate piece of floral embroidery as Lydia and Kitty hurry excitedly over to their house, Longbourn, and burst through the front door. Jane sets down her embroidery as Lizzie slumps into a chair opposite. The housekeeper comes in and hands a letter to Jane, curtsies, and then leaves the room. Trunks and boxes are being ferried out of Netherfield, and in their cloaks and bonnets, Kitty, Lydia, and Lizzie make their way through the busy town. As Denny takes Lydia's arm and Kitty is escorted away by Carter, Wickham smiles hopefully at Lizzie, who beams back at him. The pair walk through the town together. Later, Mrs. Bennet emerges from Longbourn, engrossed in conversation with Denny, and as the three girls follow their mother and the officers outside, Lizzie catches Wickham's eye with a smile. He nods politely towards her mother, then the three officers leave. Just as the girls are heading back inside, Lydia chases after them, reaches up, and whispers something to him. He strides off with Carter and Wickham. Inside, the tea things are being cleared away in the drawing room, where Mr. Bennet, Mary, and Jane are sitting. Mrs. Bennet bustles in, and the girls laugh as Mr. Bennet walks out. Jane is washing her hands in a basin in her room. Drying her hands, Jane sits at the top of the four-poster bed, Lizzie's at the bottom, and with a look of concern, Lizzie moves and sits next to Jane, looking at her and smiling. A carriage, drawn by four white horses, pulls into the drive at Longbourn, and as Mrs. Bennet comes running out of the house followed by Mr. Bennet and their daughters, a portly gentleman, Edward Gardiner, and his wife emerge from the carriage. Charlotte Lucas enters followed by Jane, and as they make their way across the crowded room, a girl with red hair eyes them curiously. They pass Lizzie, who's engaged in a conversation with Wickham. Mrs. Bennet sits with Mrs. Phillips and Mrs. Gardiner as Lizzie approaches with Wickham. Mrs. Bennet purses her lips, exchanges a glance with her sister, and haughtily walks off. Lizzie takes Wickham's hand and leads him to the dance floor, passing the girl with red hair who gives Wickham a shy smile.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "He wipes his perspiring forehead with a handkerchief and shuts his book. Lizzie enters defiantly and moves to stand nearer to her father, giving her frantic mother a wry grin. Outside, Lydia and Kitty are proceeding out and they all glance back at the residence as Charlotte proceeds towards the house. Charlotte halts for a moment, lost in reflection, and inside, Mr. Collins is packing. He bows, and Charlotte follows him out. A lady's hand is at work on a delicate piece of floral needlework as Lydia and Kitty rush enthusiastically over to their home, Longbourn, and burst through the front entrance. Jane sets down her needlework as Lizzie slumps into a chair opposite. The housekeeper enters and hands a letter to Jane, curtsies, and then exits the chamber. Trunks and boxes are being transported out of Netherfield, and in their cloaks and bonnets, Kitty, Lydia, and Lizzie make their way through the bustling town. As Denny takes Lydia's arm and Kitty is accompanied away by Carter, Wickham grins hopefully at Lizzie, who beams back at him. The pair stroll through the town together. Later, Mrs. Bennet emerges from Longbourn, absorbed in dialogue with Denny, and as the three girls follow their mother and the officers outside, Lizzie catches Wickham's eye with a grin. He nods courteously towards her mother, then the three officers depart. Just as the girls are heading back inside, Lydia pursues after them, reaches up, and whispers something to him. He strides off with Carter and Wickham. Inside, the tea things are being cleared away in the drawing room, where Mr. Bennet, Mary, and Jane are seated. Mrs. Bennet bustles in, and the girls chortle as Mr. Bennet walks out. Jane is washing her hands in a basin in her room. Drying her hands, Jane sits at the top of the four-poster bed, Lizzie's at the foot, and with a look of concern, Lizzie moves and sits next to Jane, gazing at her and smiling. A carriage, drawn by four white horses, pulls into the drive at Longbourn, and as Mrs. Bennet comes running out of the house followed by Mr. Bennet and their daughters, a stout gentleman, Edward Gardiner, and his wife appear from the carriage. Charlotte Lucas enters followed by Jane, and as they make their way across the crowded room, a girl with red hair eyes them inquisitively. They pass Lizzie, who's engaged in a conversation with Wickham. Mrs. Bennet sits with Mrs. Phillips and Mrs. Gardiner as Lizzie approaches with Wickham. Mrs. Bennet purses her lips, exchanges a glance with her sister, and arrogantly walks off. Lizzie takes Wickham's hand and leads him to the dance floor, passing the girl with red hair who gives Wickham a timid smile."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "His sweaty brow is mopped with a handkerchief by him, and his book is closed. Lizzie comes in defiantly and stands closer to her father, giving a wry smile to her hysterical mother. Outside, Lydia and Kitty head out, and as the house is looked back at by them, Charlotte heads towards the house. For a moment, she pauses, lost in thought, and inside, Mr. Collins packs. He bows to Charlotte, and she follows him out. A lady works on a delicate piece of floral embroidery as Lydia and Kitty hurry excitedly over to Longbourn and burst through the front door. Her embroidery is set down by Jane as Lizzie slumps into a chair opposite. The housekeeper hands a letter to Jane, curtsies, and then she leaves the room. Trunks and boxes are being ferried out of Netherfield, and in their cloaks and bonnets, Kitty, Lydia, and Lizzie make their way through the busy town. As Denny takes Lydia's arm and Carter escorts Kitty away, Lizzie is smiled at hopefully by Wickham, who is beamed back at by her. Through the town, the pair walks together. Later, Mrs. Bennet emerges from Longbourn, and she is engrossed in conversation with Denny, and as the three girls follow their mother and the officers outside, Wickham's eye is caught by Lizzie with a smile. A polite nod is given by him towards her mother, then the three officers leave. Just as back inside, the girls are heading, after them Lydia chases, reaches up, and something is whispered to him. He strides off with Carter and Wickham. Inside, the tea things are cleared away in the drawing room, where Mary, Jane, and Mr. Bennet sit. In bustles Mrs. Bennet, and as out walks Mr. Bennet, laughter is shared by the girls. Jane washes her hands in a basin in her room. Her hands are dried, and at the top of the four-poster bed, Jane sits, Lizzie's at the bottom, and with a look of concern, Lizzie sits next to Jane, looking at her and smiling. The drive at Longbourn is pulled into by a carriage, drawn by four white horses, and as Mrs. Bennet comes running out of the house followed by Mr. Bennet and their daughters, a portly gentleman, Edward Gardiner, and his wife emerge from the carriage. Charlotte Lucas enters followed by Jane, and as they make their way across the crowded room, they are eyed curiously by a girl with red hair. They pass Lizzie, who's engaged in a conversation with Wickham. Mrs. Bennet sits with Mrs. Phillips and Mrs. Gardiner as Wickham is approached by Lizzie. A glance is exchanged by Mrs. Bennet with her sister, and she haughtily walks off. Wickham's hand is taken by Lizzie, and he is led to the dance floor, passing the girl with red hair who gives him a shy smile."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "He wipes his sweaty brow with a handkerchief and closes his book. Lizzie enters defiantly, stands near her father, and gives her hysterical mother a wry smile. Outside, Lydia and Kitty head out, glancing back as Charlotte approaches the house. Charlotte pauses, lost in thought, while Mr. Collins packs. He bows, and Charlotte follows him out. A lady works on floral embroidery as Lydia and Kitty excitedly rush into Longbourn. Jane sets down her embroidery as Lizzie slumps into a chair. The housekeeper hands Jane a letter, curtsies, and leaves. Trunks and boxes are moved from Netherfield, and in cloaks and bonnets, Kitty, Lydia, and Lizzie navigate the busy town. Denny takes Lydia's arm, Carter escorts Kitty, and Wickham smiles at Lizzie, who beams back. They walk through town together. Later, Mrs. Bennet, engrossed in conversation with Denny, emerges from Longbourn, followed by her daughters and the officers. Lizzie smiles at Wickham, who nods politely at her mother before the officers leave. As the girls head inside, Lydia whispers to Wickham, who strides off with Carter. Inside, tea things are cleared in the drawing room where Mr. Bennet, Mary, and Jane sit. Mrs. Bennet bustles in, and the girls laugh as Mr. Bennet exits. Jane washes her hands in her room, then sits on her bed. Lizzie joins her, looking concerned but smiling. A carriage with four white horses arrives at Longbourn, and Mrs. Bennet runs out, followed by Mr. Bennet and their daughters. Edward Gardiner and his wife emerge from the carriage. Charlotte Lucas enters with Jane, passing a curious red-haired girl. They pass Lizzie, talking with Wickham. Mrs. Bennet sits with Mrs. Phillips and Mrs. Gardiner as Lizzie approaches with Wickham. Mrs. Bennet exchanges a glance with her sister and walks off. Lizzie leads Wickham to the dance floor, passing the red-haired girl who shyly smiles at him."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "He wipes his sweaty brow with a handkerchief and closes his book. Lizzie enters defiantly, stands near her father, and gives her hysterical mother a wry smile. Outside, Lydia and Kitty leave, glancing back as Charlotte approaches the house. Charlotte pauses, lost in thought, while Mr. Collins packs. He bows, and Charlotte follows him out. A lady works on floral embroidery as Lydia and Kitty excitedly rush to Longbourn, bursting through the door. Jane sets aside her embroidery as Lizzie slumps into a chair. The housekeeper hands Jane a letter, curtsies, and exits. Trunks are moved from Netherfield, and in cloaks and bonnets, Kitty, Lydia, and Lizzie navigate the busy town. Denny escorts Lydia, Carter takes Kitty, and Wickham smiles at Lizzie, who beams back. They walk together. Later, Mrs. Bennet talks with Denny outside Longbourn, and as the girls follow, Lizzie smiles at Wickham, who nods at her mother before the officers leave. As the girls head inside, Lydia whispers to Wickham, who leaves with Carter. Inside, tea is cleared in the drawing room where Mr. Bennet, Mary, and Jane sit. Mrs. Bennet enters, and the girls laugh as Mr. Bennet exits. Jane washes her hands, then sits on her bed. Lizzie joins her, smiling with concern. A carriage with four white horses arrives at Longbourn, and Mrs. Bennet, Mr. Bennet, and their daughters greet Edward Gardiner and his wife. Charlotte Lucas and Jane cross a crowded room, passing a curious red-haired girl and Lizzie, who talks with Wickham. Mrs. Bennet sits with Mrs. Phillips and Mrs. Gardiner as Lizzie and Wickham approach. Mrs. Bennet exchanges a glance with her sister and leaves. Lizzie leads Wickham to the dance floor, passing the red-haired girl who shyly smiles at him."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "He carefully mops his sweaty brow with a handkerchief, feeling the relief of the cool fabric against his skin, and then gently closes his book with a sense of finality. Lizzie enters the room with a defiant air, moving purposefully to stand closer to her father, while casting a wry smile in the direction of her hysterical mother. Outside, Lydia and Kitty are seen heading out, and they all take a moment to look back at the house as Charlotte makes her way towards it. Charlotte pauses briefly, appearing lost in thought, and inside, Mr. Collins is busy packing his belongings. He bows respectfully, and Charlotte follows him out of the room. Meanwhile, a lady's hand is diligently at work on a delicate piece of floral embroidery as Lydia and Kitty hurry excitedly over to their home, Longbourn, and burst energetically through the front door. Jane gently sets down her embroidery as Lizzie slumps into a chair directly opposite her. The housekeeper enters the room, hands a letter to Jane, curtsies politely, and then quietly leaves. Trunks and boxes are being efficiently ferried out of Netherfield, and dressed in their cloaks and bonnets, Kitty, Lydia, and Lizzie make their way through the bustling town. As Denny takes Lydia's arm and Kitty is escorted away by Carter, Wickham offers a hopeful smile to Lizzie, who beams back at him warmly. The pair walk through the lively town together. Later on, Mrs. Bennet emerges from Longbourn, deeply engrossed in conversation with Denny, and as the three girls follow their mother and the officers outside, Lizzie catches Wickham's eye with a friendly smile. He nods politely in the direction of her mother, and then the three officers take their leave. Just as the girls are about to head back inside, Lydia chases after them, reaches up, and whispers something to him. He strides off confidently with Carter and Wickham. Inside, the tea things are being cleared away in the drawing room, where Mr. Bennet, Mary, and Jane are sitting comfortably. Mrs. Bennet bustles in energetically, and the girls laugh as Mr. Bennet walks out. Jane is seen washing her hands in a basin in her room. After drying her hands, Jane sits at the top of the four-poster bed, while Lizzie is positioned at the bottom, and with a look of concern, Lizzie moves to sit next to Jane, looking at her with a reassuring smile. A carriage, drawn by four elegant white horses, pulls into the drive at Longbourn, and as Mrs. Bennet comes running out of the house followed by Mr. Bennet and their daughters, a portly gentleman, Edward Gardiner, and his wife emerge gracefully from the carriage. Charlotte Lucas enters, followed by Jane, and as they make their way across the crowded room, a girl with striking red hair eyes them curiously. They pass by Lizzie, who is engaged in a lively conversation with Wickham. Mrs. Bennet sits with Mrs. Phillips and Mrs. Gardiner as Lizzie approaches with Wickham. Mrs. Bennet purses her lips, exchanges a knowing glance with her sister, and haughtily walks off. Lizzie takes Wickham's hand confidently and leads him to the dance floor, passing the girl with red hair who gives Wickham a shy, admiring smile."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "With meticulous care, he mops his damp, sweaty brow using a handkerchief, savoring the refreshing relief of the cool fabric as it presses against his warm skin. Then, with a deliberate motion, he gently closes his book, imbued with a profound sense of finality. Meanwhile, Lizzie enters the room with an air of defiance as if asserting her purpose, and moves with intent until she stands purposefully closer to her father. Her eyes cast a wry, knowing smile in the direction of her hysterical mother, as if sharing an inside joke. Beyond the walls, Lydia and Kitty can be observed making their way outside, pausing momentarily in unison to glance back at the house. Charlotte, strolling towards the house, momentarily halts her steps, as though lost in contemplation. Inside, Mr. Collins is busy and absorbed, packing his belongings with care. With a respectful bow, he acknowledges those around him, and Charlotte follows him out of the room, trailing behind. Meanwhile, a lady's hand is engrossed in the diligent, intricate work of creating a delicate piece of floral embroidery. Lydia and Kitty hurry forward with youthful enthusiasm towards their home, Longbourn, bursting energetically through the front door. Jane, engaged in her embroidery, carefully sets it aside as Lizzie slumps into a chair positioned directly opposite her. The housekeeper makes a quiet entrance into the room, hands a letter politely to Jane, curtsies with politeness, and then departs as silently as she arrived. The hustle and bustle are evident as trunks and boxes are efficiently carried out from Netherfield, while dressed in their cloaks and bonnets, Kitty, Lydia, and Lizzie make their way through the bustling, lively town. As Denny clasps Lydia's arm and Kitty is courteously escorted away by Carter, Wickham extends a hopeful smile in Lizzie's direction, prompting her to beam warmly back at him. Together, the pair walks leisurely through the vibrant, bustling town. Later on, Mrs. Bennet emerges from Longbourn, deeply engrossed in a conversation with Denny. As the three girls follow closely behind their mother and the officers outside, Lizzie catches Wickham's gaze with a friendly smile, and he returns the gesture with a polite nod in the direction of her mother. Then, with quiet dignity, the three officers take their leave. Just at the moment when the girls are about to reenter the house, Lydia dashes after them, reaches up, and whispers something softly to him. He strides off confidently, accompanied by Carter and Wickham. Inside, the remnants of the tea gathering are being efficiently cleared away in the drawing room, where Mr. Bennet, Mary, and Jane are seated comfortably. Mrs. Bennet bustles in with energetic purpose, prompting laughter amongst the girls as Mr. Bennet makes his way out. Later, Jane is seen washing her hands with care in a basin within the privacy of her room. After drying her hands meticulously, she takes a seat at the top of the grand four-poster bed, while Lizzie takes her place at the bottom. With a look of concern etched onto her face, Lizzie moves closer, sitting beside Jane and offering her a reassuring smile. A majestic carriage, drawn by four elegant white horses, gracefully pulls into the drive at Longbourn. As Mrs. Bennet comes running out of the house, followed by Mr. Bennet and their daughters, a portly gentleman named Edward Gardiner and his wife emerge gracefully from the carriage. Inside, Charlotte Lucas enters, followed by Jane, making their way across a crowded room where a girl with strikingly vivid red hair watches them with curiosity. As they pass by Lizzie, who is engaged in a lively, animated conversation with Wickham, Mrs. Bennet is seated alongside Mrs. Phillips and Mrs. Gardiner. As Lizzie approaches, accompanied by Wickham, Mrs. Bennet purses her lips, exchanges a knowing glance with her sister, and walks off haughtily. With confidence, Lizzie takes Wickham's hand in hers and leads him to the dance floor, passing by the red-haired girl, who offers Wickham a shy, admiring smile."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "He wipes the sweat from his brow with a handkerchief, feeling the cool fabric against his skin, and then gently closes his book, the pages coming together with a soft thud. Lizzie enters the room with a defiant air, her steps purposeful as she moves closer to her father, positioning herself near him while casting a wry smile towards her mother, who is in a state of hysteria. Outside, Lydia and Kitty are making their way out, their steps quick and eager, and they all turn their heads back to glance at the house as Charlotte approaches it. Charlotte pauses momentarily, her mind wandering as she stands still, and inside, Mr. Collins is methodically packing his belongings. He bows courteously, and Charlotte follows him out, her steps echoing his. A lady's hand is diligently working on a delicate piece of floral embroidery, the needle moving in and out of the fabric with precision, as Lydia and Kitty hurry with excitement towards their home, Longbourn, and burst energetically through the front door. Jane carefully sets down her embroidery, placing it aside as Lizzie slumps into a chair opposite her, the weight of her body sinking into the seat. The housekeeper enters the room, her presence quiet and efficient, and hands a letter to Jane, offering a respectful curtsy before exiting the room. Trunks and boxes are being carried out of Netherfield, the movement brisk and purposeful, and clad in their cloaks and bonnets, Kitty, Lydia, and Lizzie navigate their way through the bustling town. As Denny takes Lydia's arm with a gentle grip and Kitty is escorted away by Carter, Wickham catches Lizzie's eye and smiles hopefully, to which she beams back at him, her face lighting up. The pair walk together through the town, their steps in sync. Later, Mrs. Bennet emerges from Longbourn, deeply engaged in conversation with Denny, her words animated, and as the three girls follow their mother and the officers outside, Lizzie meets Wickham's gaze with a smile. He acknowledges her mother with a polite nod, then the three officers take their leave. Just as the girls are about to head back inside, Lydia dashes after them, reaching up to whisper something to him, her voice low and secretive. He strides off with Carter and Wickham, their figures receding into the distance. Inside, the tea things are being cleared away in the drawing room, the clinking of china filling the air, where Mr. Bennet, Mary, and Jane are seated. Mrs. Bennet bustles in, her energy palpable, and the girls laugh as Mr. Bennet makes his way out. Jane is in her room, washing her hands in a basin, the water cool against her skin. She dries her hands and then sits at the top of the four-poster bed, while Lizzie is positioned at the bottom. With a look of concern, Lizzie moves to sit next to Jane, her eyes meeting hers with a reassuring smile. A carriage, drawn by four white horses, pulls into the drive at Longbourn, the wheels crunching on the gravel, and as Mrs. Bennet comes running out of the house, followed by Mr. Bennet and their daughters, a portly gentleman, Edward Gardiner, and his wife step out of the carriage. Charlotte Lucas enters, followed by Jane, and as they navigate their way across the crowded room, a girl with red hair watches them curiously, her gaze lingering. They pass Lizzie, who is engaged in a lively conversation with Wickham. Mrs. Bennet sits with Mrs. Phillips and Mrs. Gardiner, her posture composed, as Lizzie approaches with Wickham. Mrs. Bennet purses her lips, exchanging a glance with her sister, and then walks off with an air of haughtiness. Lizzie takes Wickham's hand, feeling the warmth of his palm, and leads him to the dance floor, their path taking them past the girl with red hair, who offers Wickham a shy smile."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "He wipes his brow with a handkerchief and closes his book as Lizzie enters, standing closer to her father and giving her mother a wry smile. Outside, Lydia and Kitty head out, glancing back at the house as Charlotte approaches, momentarily lost in thought. Inside, Mr. Collins packs and bows, with Charlotte following him out. Meanwhile, a lady works on floral embroidery as Lydia and Kitty excitedly rush into Longbourn, where Jane sets down her embroidery as Lizzie slumps into a chair. The housekeeper delivers a letter to Jane and leaves. Trunks and boxes are moved from Netherfield as Kitty, Lydia, and Lizzie, in cloaks and bonnets, navigate the busy town. Denny escorts Lydia, Carter takes Kitty, and Wickham shares a hopeful smile with Lizzie, who beams back as they walk together. Later, Mrs. Bennet converses with Denny outside Longbourn, followed by her daughters and the officers. Lizzie exchanges a smile with Wickham, who nods politely at her mother before the officers depart. As the girls head inside, Lydia whispers to Wickham, who then leaves with Carter. Inside, tea is cleared in the drawing room where Mr. Bennet, Mary, and Jane sit. Mrs. Bennet enters, prompting laughter from the girls as Mr. Bennet exits. In her room, Jane washes her hands, then sits on her bed with Lizzie, who joins her with a concerned smile. A carriage with four white horses arrives at Longbourn, and Mrs. Bennet, Mr. Bennet, and their daughters greet Edward Gardiner and his wife. Charlotte Lucas and Jane navigate a crowded room, passing a curious red-haired girl and Lizzie, who is conversing with Wickham. Mrs. Bennet sits with Mrs. Phillips and Mrs. Gardiner as Lizzie approaches with Wickham. Mrs. Bennet exchanges a glance with her sister and walks off haughtily. Lizzie leads Wickham to the dance floor, passing the red-haired girl who shyly smiles at him."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "He mops his sweaty brow with a handkerchief, a tradition that dates back to the 16th century when handkerchiefs became a common fashion accessory, and closes his book. Lizzie, known for her rebellious spirit in the family, comes in defiantly and goes to stand closer to her father, giving her hysterical mother a wry smile. Outside, Lydia and Kitty, two of the Bennet sisters who are known for their lively and somewhat impulsive nature, are heading out and they all look back at the house named Longbourn, the family estate in Hertfordshire as Charlotte heads towards the house. Charlotte, a sensible and pragmatic woman who is Lizzie's close friend, pauses for a moment, lost in thought, and inside, Mr. Collins, her recent husband known for his obsequiousness, is packing. He bows, a formality he insists on maintaining, and Charlotte follows him out. A lady's hand is at work on a delicate piece of floral embroidery, an art form highly valued in Regency England for its craftsmanship, as Lydia and Kitty hurry excitedly over to their house at Longbourn and burst through the front door. Jane, the eldest and gentlest Bennet sister, sets down her embroidery as Lizzie slumps into a chair opposite. The housekeeper, a longstanding fixture of the Bennet household who ensures its smooth operation, comes in and hands a letter to Jane, curtsies, and then leaves the room. Trunks and boxes are being ferried out of Netherfield, the nearby estate leased by the wealthy Mr. Bingley, and in their cloaks and bonnets, Kitty, Lydia, and Lizzie make their way through the busy town, Meryton, known for its bustling markets. As Denny, a militia officer stationed in Meryton, takes Lydia's arm and Kitty is escorted away by Carter, another officer, Wickham smiles hopefully at Lizzie, who beams back at him. The pair walk through the town together. Later, Mrs. Bennet, always on the lookout for advantageous marriages for her daughters, emerges from Longbourn, engrossed in conversation with Denny, and as the three girls follow their mother and the officers outside, Lizzie catches Wickham's eye with a smile. He nods politely towards her mother, then the three officers leave. Just as the girls are heading back inside, Lydia chases after them, reaches up, and whispers something to him, likely planning another flirtatious encounter. He strides off with Carter and Wickham. Inside, the tea things, an essential part of afternoon social rituals in Britain, are being cleared away in the drawing room, where Mr. Bennet, Mary, a studious and often overlooked sister, and Jane are sitting. Mrs. Bennet bustles in, and the girls laugh as Mr. Bennet, known for his dry wit and subtle disdain for societal conventions, walks out. Jane is washing her hands in a basin in her room. Drying her hands, Jane sits at the top of the four-poster bed, a common and luxurious bed design of the period, Lizzie's at the bottom, and with a look of concern, Lizzie moves and sits next to Jane, looking at her and smiling. A carriage, drawn by four white horses, symbols of wealth and status during this era, pulls into the drive at Longbourn, and as Mrs. Bennet comes running out of the house followed by Mr. Bennet and their daughters, a portly gentleman, Edward Gardiner, Jane and Lizzie's amiable uncle with a successful business in London, and his wife emerge from the carriage. Charlotte Lucas enters followed by Jane, and as they make their way across the crowded room, a girl with red hair, unfamiliar and curious, eyes them curiously. They pass Lizzie, who's engaged in a conversation with Wickham, a charming officer with a questionable reputation. Mrs. Bennet sits with Mrs. Phillips, her sister, and Mrs. Gardiner as Lizzie approaches with Wickham. Mrs. Bennet purses her lips, exchanges a glance with her sister, and haughtily walks off. Lizzie takes Wickham's hand and leads him to the dance floor, passing the girl with red hair who gives Wickham a shy smile."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "He mops his sweaty brow with a handkerchief and closes his book  Charlotte pauses for a moment lost in thought and inside Mr Collins is packing  He bows and Charlotte follows him out  A lady's hand is at work on a delicate piece of floral embroidery  as Lydia and Kitty hurry excitedly over to their house Longbourn and burst through the front door  Jane sets down her embroidery as Lizzie slumps into a chair opposite  The housekeeper comes in and hands a letter to Jane curtsies and then leaves the room  Trunks and boxes are being ferried out of Netherfield and in their cloaks and bonnets Kitty  Lydia and Lizzie make their way through the busy town  As Denny takes Lydia's arm and Kitty is escorted away by Carter Wickham smiles hopefully at Lizzie who beams back at him  The pair walk through the town together  Later Mrs Bennet emerges from Longbourn engrossed in conversation with Denny and as the three girls follow their mother and the officers outside Lizzie catches Wickham's eye with a smile  He nods politely towards her mother  then the three officers leave  Just as the girls are heading back inside Lydia chases after them reaches up and whispers something to him  He strides off with Carter and Wickham  Inside the tea things are being cleared away in the drawing room where Mr Bennet  Lizzie comes in defiantly and goes to stand closer to her father giving her hysterical mother a wry smile  Outside Lydia and Kitty are heading out and they all look back at the house as Charlotte heads towards the house  Charlotte pauses for a moment lost in thought and inside Mr Collins is packing  He bows and Charlotte follows him out  A lady's hand is at work on a delicate piece of floral embroidery  as Lydia and Kitty hurry excitedly over to their house Longbourn and burst through the front door  Jane sets down her embroidery as Lizzie slumps into a chair opposite  The housekeeper comes in and hands a letter to Jane curtsies and then leaves the room  Trunks and boxes are being ferried out of Netherfield and in their cloaks and bonnets Kitty  Lydia and Lizzie make their way through the busy town  As Denny takes Lydia's arm and Kitty is escorted away by Carter Wickham smiles hopefully at Lizzie who beams back at him  The pair walk through the town together  Later Mrs Bennet emerges from Longbourn engrossed in conversation with Denny and as the three girls follow their mother and the officers outside Lizzie catches Wickham's eye with a smile  He nods politely towards her mother  then the three officers leave  Just as the girls are heading back inside Lydia chases after them reaches up and whispers something to him  He strides off with Carter and Wickham  Inside the tea things are being cleared away in the drawing room where Mr Bennet  Mary and Jane are sitting  Mrs Bennet bustles in and the girls laugh as Mr Bennet walks out  Jane is washing her hands in a basin in her room  Drying her hands Jane sits at the top of the fourposter bed  Lizzie's at the bottom and with a look of concern Lizzie moves and sits next to Jane looking at her and smiling  A carriage drawn by four white horses pulls into the drive at Longbourn and as Mrs Bennet comes running out of the house followed by Mr Bennet and their daughters  a portly gentleman  Edward Gardiner and his wife emerge from the carriage  Charlotte Lucas enters followed by Jane and as they make their way across the crowded room a girl with red hair eyes them curiously  They pass Lizzie who's engaged in a conversation with Wickham  Mrs Bennet sits with Mrs Phillips and Mrs Gardiner  as Lizzie approaches with Wickham Mrs Bennet purses her lips exchanges a glance with her sister and haughtily walks off  Lizzie takes Wickham's hand and leads him to the dance floor passing the girl with red hair who gives Wickham a shy smile"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "He mops his sweaty brow with a handkerchief and closes his book. Lizzie comes in defiantly and goes to stand closer to her father giving her hysterical mother a wry smile. Outside Lydia and Kitty are heading out and they all look back at the house as Charlotte heads towards the house. Charlotte pauses for a moment lost in thought and inside Mr Collins is packing. He bows and Charlotte follows him out. A lady's hand is at work on a delicate piece of floral embroidery as Lydia and Kitty hurry excitedly over to their house Longbourn and burst through the front door. Jane sets down her embroidery as Lizzie slumps into a chair opposite. The housekeeper comes in and hands a letter to Jane curtsies and then leaves the room. Trunks and boxes are being ferried out of Netherfield and in their cloaks and bonnets Kitty. Lydia and Lizzie make their way through the busy town. As Denny takes Lydia's arm and Kitty is escorted away by Carter Wickham smiles hopefully at Lizzie who beams back at him. The pair walk through the town together. Later Mrs Bennet emerges from Longbourn engrossed in conversation with Denny and as the three girls follow their mother and the officers outside Lizzie catches Wickham's eye with a smile. He nods politely towards her mother. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. then the three officers leave. Just as the girls are heading back inside Lydia chases after them reaches up and whispers something to him. He strides off with Carter and Wickham. Inside the tea things are being cleared away in the drawing room where Mr Bennet Mary and Jane are sitting. Mrs Bennet bustles in and the girls laugh as Mr Bennet walks out. Jane is washing her hands in a basin in her room. Drying her hands Jane sits at the top of the fourposter bed. Lizzie's at the bottom and with a look of concern Lizzie moves and sits next to Jane looking at her and smiling. A carriage drawn by four white horses pulls into the drive at Longbourn and as Mrs Bennet comes running out of the house followed by Mr Bennet and their daughters. a portly gentleman Edward Gardiner and his wife emerge from the carriage. Charlotte Lucas enters followed by Jane and as they make their way across the crowded room a girl with red hair eyes them curiously. They pass Lizzie who is engaged in a conversation with Wickham. Mrs Bennet sits with Mrs Phillips and Mrs Gardiner. as Lizzie approaches with Wickham Mrs Bennet purses her lips exchanges a glance with her sister and haughtily walks off. Lizzie takes Wickham's hand and leads him to the dance floor passing the girl with red hair who gives Wickham a shy smile."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "He mops his sweaty brow with a handkerchief and closes his book. Lizzie comes in defiantly and goes to stand closer to her father giving her hysterical mother a wry smile. Outside Lydia and Kitty are heading out and they all look back at the house as Charlotte heads towards the house. Charlotte pauses for a moment lost in thought and inside Mr Collins is packing. He bows and Charlotte follows him out. A lady's hand is at work on a delicate piece of floral embroidery as Lydia and Kitty hurry excitedly over to their house Longbourn and burst through the front door. Jane sets down her embroidery as Lizzie slumps into a chair opposite. The housekeeper comes in and hands a letter to Jane curtsies and then leaves the room. Trunks and boxes are being ferried out of Netherfield and in their cloaks and bonnets Kitty. Lydia and Lizzie make their way through the busy town. As Denny takes Lydia's arm and Kitty is escorted away by Carter Wickham smiles hopefully at Lizzie who beams back at him. The pair walk through the town together. Later Mrs Bennet emerges from Longbourn engrossed in conversation with Denny and as the three girls follow their mother and the officers outside Lizzie catches Wickham's eye with a smile. He nods politely towards her mother. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. then the three officers leave. Just as the girls are heading back inside Lydia chases after them reaches up and whispers something to him. He strides off with Carter and Wickham. Inside the tea things are being cleared away in the drawing room where Mr Bennet Mary and Jane are sitting. Mrs Bennet bustles in and the girls laugh as Mr Bennet walks out. Jane is washing her hands in a basin in her room. Drying her hands Jane sits at the top of the fourposter bed. Lizzie's at the bottom and with a look of concern Lizzie moves and sits next to Jane looking at her and smiling. A carriage drawn by four white horses pulls into the drive at Longbourn and as Mrs Bennet comes running out of the house followed by Mr Bennet and their daughters. a portly gentleman Edward Gardiner and his wife emerge from the carriage. Charlotte Lucas enters followed by Jane and as they make their way across the crowded room a girl with red hair eyes them curiously. They pass Lizzie who is engaged in a conversation with Wickham. Mrs Bennet sits with Mrs Phillips and Mrs Gardiner. as Lizzie approaches with Wickham Mrs Bennet purses her lips exchanges a glance with her sister and haughtily walks off. Lizzie takes Wickham's hand and leads him to the dance floor passing the girl with red hair who gives Wickham a shy smile."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "He mops his sweaty brow with a handkerchief and closes his book. Lizzie comes in defiantly and goes to stand closer to her father giving her hysterical mother a wry smile. Outside Lydia and Kitty are heading out and they all look back at the house as Charlotte heads towards the house. Charlotte pauses for a moment lost in thought and inside Mr Collins is packing. He bows and Charlotte follows him out. A lady's hand is at work on a delicate piece of floral embroidery as Lydia and Kitty hurry excitedly over to their house Longbourn and burst through the front door. Jane sets down her embroidery as Lizzie slumps into a chair opposite. Lizzie's at the bottom and with a look of concern Lizzie moves and sits next to Jane looking at her and smiling. A carriage drawn by four white horses pulls into the drive at Longbourn and as Mrs Bennet comes running out of the house followed by Mr Bennet and their daughters. a portly gentleman Edward Gardiner and his wife emerge from the carriage. Charlotte Lucas enters followed by Jane and as they make their way across the crowded room a girl with red hair eyes them curiously. They pass Lizzie who is engaged in a conversation with Wickham. Mrs Bennet sits with Mrs Phillips and Mrs Gardiner. as Lizzie approaches with Wickham Mrs Bennet purses her lips exchanges a glance with her sister and haughtily walks off. Lizzie takes Wickham's hand and leads him to the dance floor passing the girl with red hair who gives Wickham a shy smile."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "He mops his sweaty brow with a handkerchief and closes his book. Lizzie comes in defiantly and goes to stand closer to her father giving her hysterical mother a wry smile. Outside Lydia and Kitty are heading out and they all look back at the house as Charlotte heads towards the house. Mrs Bennet sits with Mrs Phillips and Mrs Gardiner. as Lizzie approaches with Wickham Mrs Bennet purses her lips exchanges a glance with her sister and haughtily walks off. Lizzie takes Wickham's hand and leads him to the dance floor passing the girl with red hair who gives Wickham a shy smile."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The lion mops its sweaty brow with a handkerchief and closes its book. The bird comes in defiantly and goes to stand closer to its father, giving its hysterical mother a wry smile. Outside, the kangaroo and the dolphin are heading out and they all look back at the house as the butterfly heads towards the house. The butterfly pauses for a moment, lost in thought, and inside, the turtle is packing. The turtle bows, and the butterfly follows it out. A snake's hand is at work on a delicate piece of floral embroidery as the kangaroo and the dolphin hurry excitedly over to their house, Longbourn, and burst through the front door. The rabbit sets down its embroidery as the bird slumps into a chair opposite. The fox comes in and hands a letter to the rabbit, curtsies, and then leaves the room. Trunks and boxes are being ferried out of Netherfield, and in their cloaks and bonnets, the dolphin, the kangaroo, and the bird make their way through the busy town. As the bear takes the dolphin's arm and the kangaroo is escorted away by the flamingo, the horse smiles hopefully at the bird, who beams back at the horse. The pair walk through the town together. Later, the elephant emerges from Longbourn, engrossed in conversation with the bear, and as the three girls follow their elephant and the officers outside, the bird catches the horse's eye with a smile. The horse nods politely towards its elephant, then the three officers leave. Just as the girls are heading back inside, the dolphin chases after them, reaches up, and whispers something to it. It strides off with the flamingo and the horse. Inside, the tea things are being cleared away in the drawing room, where the owl, the giraffe, and the rabbit are sitting. The elephant bustles in, and the girls laugh as the owl walks out. The rabbit is washing its hands in a basin in its room. Drying its hands, the rabbit sits at the top of the four-poster bed, the bird's at the bottom, and with a look of concern, the bird moves and sits next to the rabbit, looking at it and smiling. A carriage, drawn by four white horses, pulls into the drive at Longbourn, and as the elephant comes running out of the house followed by the owl and their daughters, a portly gentleman, the panda, and its wife emerge from the carriage. The butterfly enters followed by the rabbit, and as they make their way across the crowded room, a girl with red hair eyes them curiously. They pass the bird, who's engaged in a conversation with the horse. The elephant sits with the cat and the koala as the bird approaches with the horse. The elephant purses its lips, exchanges a glance with its sister, and haughtily walks off. The bird takes the horse's hand and leads it to the dance floor, passing the girl with red hair who gives the horse a shy smile."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "He mops his sweaty brow with a napkin and closes his magazine. Lizzie comes in defiantly and goes to stand closer to her father, giving her hysterical mother a wry smile. Outside, Lydia and Kitty are heading out and they all look back at the cabin as Charlotte heads towards the cabin. Charlotte pauses for a moment, lost in thought, and inside, Mr. Collins is packing. He bows, and Charlotte follows him out. A lady's hand is at work on a delicate piece of glass sculpture as Lydia and Kitty hurry excitedly over to their cabin, Bellwood, and burst through the front gate. Jane sets down her sculpture as Lizzie slumps into a sofa opposite. The assistant comes in and hands a note to Jane, curtsies, and then leaves the room. Crates and bags are being ferried out of Chatsworth, and in their jackets and hats, Kitty, Lydia, and Lizzie make their way through the busy village. As Denny takes Lydia's arm and Kitty is escorted away by Carter, Wickham smiles hopefully at Lizzie, who beams back at him. The pair walk through the village together. Later, Mrs. Bennet emerges from Bellwood, engrossed in conversation with Denny, and as the three girls follow their mother and the marshals outside, Lizzie catches Wickham's eye with a smile. He nods politely towards her mother, then the three marshals leave. Just as the girls are heading back inside, Lydia chases after them, reaches up, and whispers something to him. He strides off with Carter and Wickham. Inside, the dessert dishes are being cleared away in the parlor, where Mr. Bennet, Mary, and Jane are sitting. Mrs. Bennet bustles in, and the girls laugh as Mr. Bennet walks out. Jane is washing her hands in a pitcher in her room. Drying her hands, Jane sits at the top of the bunk bed, Lizzie's at the bottom, and with a look of concern, Lizzie moves and sits next to Jane, looking at her and smiling. A wagon, drawn by four brown oxen, pulls into the lane at Bellwood, and as Mrs. Bennet comes running out of the cabin followed by Mr. Bennet and their daughters, a portly gentleman, Edward Gardiner, and his wife emerge from the wagon. Charlotte Lucas enters followed by Jane, and as they make their way across the bustling hall, a girl with blond hair eyes them curiously. They pass Lizzie, who's engaged in a conversation with Wickham. Mrs. Bennet sits with Mrs. Phillips and Mrs. Gardiner as Lizzie approaches with Wickham. Mrs. Bennet purses her lips, exchanges a glance with her sister, and haughtily walks off. Lizzie takes Wickham's hand and leads him to the garden path, passing the girl with blond hair who gives Wickham a shy smile."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "He wipes his sweaty brow with a handkerchief and tosses his book aside. Lizzie enters boldly and positions herself closer to her father, casting her hysterical mother a cheeky grin. Outside, Lydia and Kitty are wandering off and they all glance back at the house as Charlotte strolls towards the house. Charlotte hesitates for a moment, lost in reverie, and inside, Mr. Collins is wrapping up. He nods, and Charlotte accompanies him out. A lady's hand is engaged in crafting a delicate piece of floral embroidery as Lydia and Kitty race exuberantly over to their house, Longbourn, and slip through the front door. Jane places her embroidery aside as Lizzie sprawls into a chair opposite. The housekeeper enters and delivers a letter to Jane, bows, and then exits the room. Trunks and boxes are being hauled out of Netherfield, and in their cloaks and bonnets, Kitty, Lydia, and Lizzie weave their way through the bustling town. As Denny nudges Lydia's arm and Kitty is ushered away by Carter, Wickham grins optimistically at Lizzie, who glances back at him warmly. The pair amble through the town together. Later, Mrs. Bennet steps out of Longbourn, absorbed in dialogue with Denny, and as the three girls trail their mother and the officers outside, Lizzie catches Wickham's eye with a grin. He gestures courteously towards her mother, then the three officers depart. Just as the girls are turning back inside, Lydia dashes after them, reaches up, and murmurs something to him. He marches off with Carter and Wickham. Inside, the tea things are being removed in the drawing room, where Mr. Bennet, Mary, and Jane are seated. Mrs. Bennet bustles in, and the girls chuckle as Mr. Bennet steps out. Jane is rinsing her hands in a basin in her room. Drying her hands, Jane perches at the top of the four-poster bed, Lizzie's at the bottom, and with a look of concern, Lizzie shifts and sits beside Jane, gazing at her and smirking. A carriage, drawn by four white horses, rolls into the drive at Longbourn, and as Mrs. Bennet comes hurrying out of the house followed by Mr. Bennet and their daughters, a portly gentleman, Edward Gardiner, and his wife alight from the carriage. Charlotte Lucas enters followed by Jane, and as they navigate across the bustling room, a girl with red hair observes them curiously. They pass Lizzie, who's engaged in a chat with Wickham. Mrs. Bennet sits with Mrs. Phillips and Mrs. Gardiner as Lizzie nears with Wickham. Mrs. Bennet tightens her lips, shares a glance with her sister, and haughtily strides away. Lizzie grasps Wickham's hand and guides him to the dance floor, passing the girl with red hair who offers Wickham a timid smile."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "The basketball bounces its orange surface with a towel and shuts its journal. A fox trots in boldly and moves to stand closer to its mountain, giving its ecstatic helicopter a sly grin. Overhead, a comet and a rainbow are heading out and they all glance back at the volcano as a violin drifts towards the volcano. A violin hesitates for a moment, lost in thought, and inside, Procrastination is sorting. It nods, and a violin trails it out. A clock's hand is at work on an intricate piece of floral quilting as a comet and a rainbow rush excitedly over to their river, Pemberley, and leap through the entrance. Thunder places down its quilting as a fox flops into a hammock across. The sculptor enters and delivers a package to Thunder, nods, and then departs the cave. Bottles and scrolls are being ferried out of Atlantis, and in their vests and helmets, a rainbow, a comet, and a fox weave their way through the bustling market. As a shadow takes a comet's paw and a rainbow is accompanied away by a broom, a riddle grins hopefully at a fox, who gleams back at it. The duo stroll through the market side by side. Eventually, a storm exits Pemberley, engrossed in dialogue with a shadow, and as the three kittens trail their storm and the pencils outside, a fox catches a riddle’s gaze with a grin. It bows courteously towards its helicopter, then the three pencils disperse. Just as the kittens are trailing back inside, a comet scurries after them, reaches upward, and murmurs something to it. It marches off with a broom and a riddle. Inside, the dessert plates are being tidied away in the den, where a puzzle, a giraffe, and Thunder are lounging. A storm flurries in, and the kittens chuckle as a puzzle meanders out. Thunder is rinsing its fins in a tub in its studio. Patting its fins dry, Thunder reclines at the summit of the canopy bed, a fox's at the base, and with an expression of worry, a fox shifts and perches beside Thunder, gazing at it and grinning. A spaceship, drawn by four golden dragons, glides into the orbit at Pemberley, and as a storm comes dashing out of the river followed by a puzzle and their kittens, a corpulent unicorn, Imagination Star, and its companion emerge from the spaceship. A violinist strides in followed by Thunder, and as they navigate the bustling hall, a zebra with purple scales observes them keenly. They bypass a fox, who's engrossed in a dialogue with a riddle. A storm settles with a gust and Imagination Star as a fox nears with a riddle. A storm puckers its lips, swaps a glance with its wind, and arrogantly strolls away. A fox takes a riddle’s paw and leads it to the rink, passing the zebra with purple scales who bestows a riddle a timid grin."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "He wipes his dusty glasses with a napkin and snaps his pen. Oliver marches in confidently and leans closer to his uncle, sending his frantic sister a sly wink. Outside, Susan and Tara are strolling away and they all glance back at the cottage as Rebecca wanders towards the cottage. Rebecca hesitates for a moment, lost in thought, and inside, Mr. Harris is sorting. He waves, and Rebecca trails him out. A gentleman's hand is busy on a delicate piece of floral embroidery as Susan and Tara sprint energetically over to their cottage, Oakwood, and burst through the front door. Emily sets down her embroidery as Oliver sinks into a chair opposite. The gardener comes in and passes a note to Emily, bows, and then departs. Bags and crates are being hauled out of Greenfield, and in their coats and hats, Tara, Susan, and Oliver make their way through the busy market. As Ritchie grabs Susan's hand and Tara is guided away by Dawson, Thompson grins encouragingly at Oliver, who grins back at him. The pair stroll through the market together. Later, Mrs. Green emerges from Oakwood, deep in conversation with Ritchie, and as the three siblings follow their mother and the friends outside, Oliver catches Thompson's eye with a grin. He gestures politely towards her mother, then the three friends depart. Just as the siblings are stepping back inside, Susan dashes after them, reaches up, and murmurs something to him. He marches off with Dawson and Thompson. Inside, the books are being shelved in the study, where Mr. Green, Sarah, and Emily are sitting. Mrs. Green rushes in, and the siblings giggle as Mr. Green strolls out. Emily is rinsing her hands in a sink in her room. Drying her hands, Emily sits at the top of the four-poster bed, Oliver's at the bottom, and with a look of curiosity, Oliver shifts and sits next to Emily, looking at her and grinning. A carriage, drawn by four black horses, pulls into the drive at Oakwood, and as Mrs. Green comes sprinting out of the house followed by Mr. Green and their children, a slender gentleman, David Johnson, and his wife emerge from the carriage. Rebecca White enters followed by Emily, and as they navigate across the crowded chamber, a boy with blonde hair watches them curiously. They pass Oliver, who's engaged in a conversation with Thompson. Mrs. Green sits with Mrs. Porter and Mrs. Johnson as Oliver approaches with Thompson. Mrs. Green squints, exchanges a glance with her cousin, and arrogantly strides off. Oliver takes Thompson's hand and leads him to the garden, passing the boy with blonde hair who gives Thompson a bashful smile."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "He wipes his dusty forehead with a napkin and snaps his magazine shut. Lizzie storms in cheerfully and strolls closer to her father, offering her frantic mother a bemused grin. Outside, Lydia and Kitty are floating away, and they all glance back at the barn as Charlotte drifts towards the barn. Charlotte hesitates for a moment, deep in reverie, and inside, Mr. Collins is juggling. He curtseys, and Charlotte trails him out. A gentleman's hand is at play on a fragile piece of abstract painting as Lydia and Kitty dash eagerly over to their greenhouse, Longbourn, and leap through the garden gate. Jane places down her painting as Lizzie collapses into a hammock opposite. The gardener comes in and tosses a scroll to Jane, bows, and then exits the yard. Crates and barrels are being pushed out of Netherfield, and in their shawls and caps, Kitty, Lydia, and Lizzie wander their way through the bustling village. As Denny grasps Lydia’s elbow and Kitty is spun away by Carter, Wickham grins expectantly at Lizzie, who nods back at him. The pair skip through the village together. Later, Mrs. Bennet exits Longbourn, absorbed in conversation with Denny, and as the three girls trail their mother and the officers outside, Lizzie catches Wickham's gaze with a grin. He waves politely towards her mother, then the three officers depart. Just as the girls are sneaking back inside, Lydia dashes after them, leaps up, and murmurs something to him. He saunters off with Carter and Wickham. Inside, the dishes are being stacked away in the dining room, where Mr. Bennet, Mary, and Jane are lounging. Mrs. Bennet hustles in, and the girls giggle as Mr. Bennet strolls out. Jane is splashing her hands in a bowl in her alcove. Shaking her hands dry, Jane reclines at the top of the wooden bench, Lizzie’s at the bottom, and with a look of curiosity, Lizzie shifts and perches next to Jane, gazing at her and grinning. A wagon, pulled by four black oxen, glides into the lane at Longbourn, and as Mrs. Bennet comes hurrying out of the barn followed by Mr. Bennet and their daughters, a plump gentleman, Edward Gardiner, and his sister emerge from the wagon. Charlotte Lucas bounces in followed by Jane, and as they weave their way across the bustling meadow, a boy with orange hair observes them intently. They pass Lizzie, who's absorbed in a debate with Wickham. Mrs. Bennet perches with Mrs. Phillips and Mrs. Gardiner as Lizzie introduces Wickham. Mrs. Bennet rolls her eyes, shares a look with her cousin, and pompously flounces off. Lizzie grabs Wickham's elbow and pulls him to the music hall, passing the boy with orange hair who offers Wickham a bashful grin."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "He dusts his soggy hat with a feather and opens his journal. Fred enters sheepishly and goes to sit nearer to his uncle, giving his grumpy neighbor a sly grin. Indoors, Betty and Nancy are climbing up and they all peer up at the barn as George drifts away from the barn. George stops for a second, absorbed in memories, and outdoors, Dr. Jones is unpacking. He sneezes, and George shadows him inside. A farmer's foot is at rest on a sturdy piece of wooden sculpture as Betty and Nancy stroll leisurely over to their barn, Greenhill, and tiptoe through the back gate. Steve picks up his sculpture as Fred collapses onto a bench nearby. The gardener enters and hands a package to Steve, bows, and then exits the barn. Baskets and crates are being lifted into Oakfield, and in their capes and sandals, Nancy, Betty, and Fred make their way across the sleepy village. As James grabs Betty's purse and Nancy is chased away by Brown, Marvin frowns sadly at Fred, who glares back at him. The duo skip through the village apart. Later, Mrs. Green exits Greenhill, captivated by a chat with James, and as the three boys shadow their uncle and the thieves indoors, Fred surprises Marvin with a frown. He sneezes rudely towards her uncle, then the three thieves arrive. Just as the boys are running outside, Betty skips towards them, bends down, and shouts something to him. He jogs off with Brown and Marvin. Outdoors, the coffee mugs are being set up in the garden, where Mr. Green, Clara, and Steve are sleeping. Mrs. Green races out, and the boys scream as Mr. Green strolls in. Steve is combing his hair in a mirror in his study. Tying his hair, Steve lies at the bottom of the twin bed, Fred's at the top, and with a glare of worry, Fred stands and lies next to Steve, glaring at him and frowning. A bicycle, pedaled by six black donkeys, races into the street at Greenhill, and as Mrs. Green stands listening into the barn trailed by Mr. Green and their sons, a slender athlete, Michael Harris, and his brother vanish from the bicycle. George Lewis departs trailed by Steve, and as they bounce their way around the bustling garden, a boy with blue shoes ignores them carelessly. They meet Fred, who's occupied in a conversation with Marvin. Mrs. Green stands with Mrs. Smith and Mrs. Harris as Fred departs with Marvin. Mrs. Green tosses her head back, avoids a look with her father, and calmly strolls in. Fred lets Marvin's elbow and chases him to the waiting chair, spotting the boy with blue shoes who gives Marvin a bold frown."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "He wipes his brow and closes his book as Lizzie approaches defiantly, smiling wryly at her hysterical mother. Outside, Lydia and Kitty head out while Charlotte hesitates before entering where Mr. Collins packs. Lydia and Kitty hurry home to Longbourn, where Jane sets aside her embroidery as Lizzie slumps into a chair. The housekeeper delivers a letter to Jane. Trunks are being moved from Netherfield, and the sisters walk through town. Denny and Carter escort Lydia and Kitty, while Wickham and Lizzie walk together, exchanging smiles. Mrs. Bennet chats with Denny as the officers leave, and Lydia whispers to one of them. Inside, tea is cleared away as Mr. Bennet exits, and Jane and Lizzie share a moment of concern. A carriage arrives with Edward Gardiner and his wife, greeted by the Bennets. Charlotte arrives with Jane, and they pass a curious red-haired girl. Lizzie, talking with Wickham, approaches Mrs. Bennet, who exchanges a glance with her sister and leaves. Lizzie leads Wickham to the dance floor, passing the red-haired girl who smiles at him."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Lizzie takes Wickham's hand and leads him to the dance floor passing the girl with red hair who gives Wickham a shy smile as Lizzie approaches with Wickham Mrs Bennet purses her lips exchanges a glance with her sister and haughtily walks off  Mrs Bennet sits with Mrs Phillips and Mrs Gardiner  They pass Lizzie who's engaged in a conversation with Wickham  Charlotte Lucas enters followed by Jane and as they make their way across the crowded room a girl with red hair eyes them curiously  Edward Gardiner and his wife emerge from the carriage  a portly gentleman  A carriage drawn by four white horses pulls into the drive at Longbourn and as Mrs Bennet comes running out of the house followed by Mr Bennet and their daughters  Lizzie's at the bottom and with a look of concern Lizzie moves and sits next to Jane looking at her and smiling  Drying her hands Jane sits at the top of the fourposter bed  Jane is washing her hands in a basin in her room  Mrs Bennet bustles in and the girls laugh as Mr Bennet walks out  Mary and Jane are sitting  Inside the tea things are being cleared away in the drawing room where Mr Bennet  He strides off with Carter and Wickham  Just as the girls are heading back inside Lydia chases after them reaches up and whispers something to him  then the three officers leave  He nods politely towards her mother  Later Mrs Bennet emerges from Longbourn engrossed in conversation with Denny and as the three girls follow their mother and the officers outside Lizzie catches Wickham's eye with a smile  The pair walk through the town together  As Denny takes Lydia's arm and Kitty is escorted away by Carter Wickham smiles hopefully at Lizzie who beams back at him  Lydia and Lizzie make their way through the busy town  Trunks and boxes are being ferried out of Netherfield and in their cloaks and bonnets Kitty  The housekeeper comes in and hands a letter to Jane curtsies and then leaves the room  Jane sets down her embroidery as Lizzie slumps into a chair opposite  as Lydia and Kitty hurry excitedly over to their house Longbourn and burst through the front door  A lady's hand is at work on a delicate piece of floral embroidery  He bows and Charlotte follows him out  Charlotte pauses for a moment lost in thought and inside Mr Collins is packing  Outside Lydia and Kitty are heading out and they all look back at the house as Charlotte heads towards the house  Lizzie comes in defiantly and goes to stand closer to her father giving her hysterical mother a wry smile  He mops his sweaty brow with a handkerchief and closes his book "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Lizzie's at the bottom and with a look of concern Lizzie moves and sits next to Jane looking at her and smiling  a portly gentleman  Jane sets down her embroidery as Lizzie slumps into a chair opposite  Drying her hands Jane sits at the top of the fourposter bed  Later Mrs Bennet emerges from Longbourn engrossed in conversation with Denny and as the three girls follow their mother and the officers outside Lizzie catches Wickham's eye with a smile  He mops his sweaty brow with a handkerchief and closes his book  Mary and Jane are sitting  then the three officers leave  A lady's hand is at work on a delicate piece of floral embroidery  Trunks and boxes are being ferried out of Netherfield and in their cloaks and bonnets Kitty  They pass Lizzie who's engaged in a conversation with Wickham  Inside the tea things are being cleared away in the drawing room where Mr Bennet  He strides off with Carter and Wickham  Lizzie takes Wickham's hand and leads him to the dance floor passing the girl with red hair who gives Wickham a shy smile Just as the girls are heading back inside Lydia chases after them reaches up and whispers something to him  Jane is washing her hands in a basin in her room  He nods politely towards her mother  Lizzie comes in defiantly and goes to stand closer to her father giving her hysterical mother a wry smile  Mrs Bennet sits with Mrs Phillips and Mrs Gardiner  Mrs Bennet bustles in and the girls laugh as Mr Bennet walks out  As Denny takes Lydia's arm and Kitty is escorted away by Carter Wickham smiles hopefully at Lizzie who beams back at him  Edward Gardiner and his wife emerge from the carriage  The pair walk through the town together  Outside Lydia and Kitty are heading out and they all look back at the house as Charlotte heads towards the house  Charlotte pauses for a moment lost in thought and inside Mr Collins is packing  as Lizzie approaches with Wickham Mrs Bennet purses her lips exchanges a glance with her sister and haughtily walks off  A carriage drawn by four white horses pulls into the drive at Longbourn and as Mrs Bennet comes running out of the house followed by Mr Bennet and their daughters  as Lydia and Kitty hurry excitedly over to their house Longbourn and burst through the front door  He bows and Charlotte follows him out  The housekeeper comes in and hands a letter to Jane curtsies and then leaves the room  Lydia and Lizzie make their way through the busy town  Charlotte Lucas enters followed by Jane and as they make their way across the crowded room a girl with red hair eyes them curiously "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Just as the girls are heading back inside Lydia chases after them reaches up and whispers something to him  He strides off with Carter and Wickham  Inside the tea things are being cleared away in the drawing room where Mr Bennet  Mary and Jane are sitting  Mrs Bennet bustles in and the girls laugh as Mr Bennet walks out  Jane is washing her hands in a basin in her room  Drying her hands Jane sits at the top of the fourposter bed  Lizzie's at the bottom and with a look of concern Lizzie moves and sits next to Jane looking at her and smiling  A carriage drawn by four white horses pulls into the drive at Longbourn and as Mrs Bennet comes running out of the house followed by Mr Bennet and their daughters  a portly gentleman  Edward Gardiner and his wife emerge from the carriage  Charlotte Lucas enters followed by Jane and as they make their way across the crowded room a girl with red hair eyes them curiously  They pass Lizzie who's engaged in a conversation with Wickham  Mrs Bennet sits with Mrs Phillips and Mrs Gardiner  as Lizzie approaches with Wickham Mrs Bennet purses her lips exchanges a glance with her sister and haughtily walks off  Lizzie takes Wickham's hand and leads him to the dance floor passing the girl with red hair who gives Wickham a shy smile He mops his sweaty brow with a handkerchief and closes his book  Lizzie comes in defiantly and goes to stand closer to her father giving her hysterical mother a wry smile  Outside Lydia and Kitty are heading out and they all look back at the house as Charlotte heads towards the house  Charlotte pauses for a moment lost in thought and inside Mr Collins is packing  He bows and Charlotte follows him out  A lady's hand is at work on a delicate piece of floral embroidery  as Lydia and Kitty hurry excitedly over to their house Longbourn and burst through the front door  Jane sets down her embroidery as Lizzie slumps into a chair opposite  The housekeeper comes in and hands a letter to Jane curtsies and then leaves the room  Trunks and boxes are being ferried out of Netherfield and in their cloaks and bonnets Kitty  Lydia and Lizzie make their way through the busy town  As Denny takes Lydia's arm and Kitty is escorted away by Carter Wickham smiles hopefully at Lizzie who beams back at him  The pair walk through the town together  Later Mrs Bennet emerges from Longbourn engrossed in conversation with Denny and as the three girls follow their mother and the officers outside Lizzie catches Wickham's eye with a smile  He nods politely towards her mother  then the three officers leave "
        }
      ]
    }
  ]
}