{
  "ground_truth": "The wooden gates open, and Bond heads down a long, straight brick tunnel. He stops, gets out, and opens the boot to reveal a man blinking up at him. Bond is elevated in a pool of light and fires a bullet in a super slow-mo burst of smoke, with the bullet-stream of smoke moving over the sand dunes. Light surrounds the sun, and a shadowy Bond aims his pistol, with Bond's shadow passing over the dunes. A red dot travels sideways as a naked woman is silhouetted by the sand, lying over the dunes in the half-light. Bond stands in the low light as fine sands flow like liquid, and a woman's naked body emerges from the flowing sand. Bond turns, aiming his gun, while a gloom-shaped hood of lights surrounds the scene. A naked woman stands in silhouette, and Bond falls into billowing sand. Sand and stars swirl amidst the gloom of light, and the grid flexes, turns, and walks as the sand billows against the starry darkness. A crowd of naked women pose in silhouette around the glaring sun, forming circles of bodies that animate into a flickering blur and dissolve away, floating through space. Sand swirls in the light while posing high-heels form a slowly turning pattern. Bond falls towards the expanding people in the eye, and sand engulfs a pistol as Bond falls in slow motion onto the sandy ground. He raises his pistol and fires in super slow-motion, with the bullet spinning slowly as it flies. The red dot travels sideways as the sun flares behind a pile of naked women, and the bullet lands in an explosion of sand. A red and yellow checked flag billows in the breeze as a procession of people in bright costumes parades around a square, watched by huge crowds. Bond dumps the man from the boot onto a chair in a cellar, where M and another agent watch. Bond gulps whiskey while near-tired horsemen enter the square, laid out as a racetrack. A chair is dragged across a stone floor, and Bond sits next to Mr. White, joined by M. Mitchell drops one agent, and as M goes down, the horse race starts. Bond leaps on the man, grabs the gun, and the prisoner is hit and goes down. Bond disarms Mitchell and kicks the gun away but then gets booted to the ground. Mitchell goes for the gun and runs off as the fast and furious Palio horse race thunders around Siena's main square. Mitchell pounds down spiral stairs and into water at the base of a tower, then dives through an iron gate. Bond ignores the stairs and takes a flying leap after him. In the race, a rider falls, and Bond chases his man down a watery tunnel, but a gate bars his way.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "The timber portals open, and Bond proceeds down a lengthy, direct brick passageway. He halts, exits, and opens the trunk to disclose a person blinking up at him. Bond is elevated in a pool of illumination and discharges a projectile in a super slow-mo burst of smoke, with the projectile-stream of smoke moving over the sand dunes. Light encircles the sun, and a shadowy Bond targets his handgun, with Bond's shadow gliding over the dunes. A crimson speck traverses sideways as a nude woman is silhouetted by the sand, reclining over the dunes in the twilight. Bond stands in the dim light as fine sands flow like fluid, and a woman's nude form emerges from the fluid sand. Bond turns, targeting his firearm, while a gloom-shaped hood of lights envelops the scene. A nude woman stands in silhouette, and Bond descends into billowing sand. Sand and stars swirl amidst the gloom of light, and the grid flexes, turns, and advances as the sand billows against the starry obscurity. A crowd of nude women pose in silhouette around the glaring sun, forming circles of bodies that animate into a flickering blur and dissolve away, floating through space. Sand swirls in the light while posing stilettos form a gradually turning pattern. Bond descends towards the expanding people in the eye, and sand engulfs a firearm as Bond descends in slow motion onto the sandy ground. He raises his firearm and discharges in super slow-motion, with the projectile rotating slowly as it flies. The crimson speck traverses sideways as the sun flares behind a heap of nude women, and the projectile lands in an explosion of sand. A red and yellow checked banner billows in the breeze as a procession of people in vivid outfits parades around a square, observed by huge crowds. Bond dumps the person from the trunk onto a seat in a basement, where M and another operative observe. Bond gulps whiskey while near-exhausted horsemen enter the square, laid out as a racetrack. A seat is dragged across a stone floor, and Bond sits beside Mr. White, joined by M. Mitchell drops one operative, and as M goes down, the horse race begins. Bond leaps on the person, seizes the firearm, and the captive is struck and goes down. Bond disarms Mitchell and kicks the firearm away but then gets booted to the ground. Mitchell goes for the firearm and runs off as the fast and furious Palio horse race thunders around Siena's main square. Mitchell pounds down spiral steps and into water at the base of a tower, then dives through an iron portal. Bond ignores the steps and takes a flying leap after him. In the race, a rider falls, and Bond pursues his person down a watery passageway, but a portal bars his way."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "The wooden gates are opened, and a long, straight brick tunnel is headed down by Bond. He is stopped, gets out, and the boot is opened by him to reveal a man blinking up at him. Bond is elevated in a pool of light and a bullet is fired by him in a super slow-mo burst of smoke, with the bullet-stream of smoke moving over the sand dunes. The sun is surrounded by light, and a pistol is aimed by a shadowy Bond, with his shadow passing over the dunes. A red dot travels sideways as the sand silhouettes a naked woman, lying over the dunes in the half-light. Bond stands in the low light as fine sands are flowed like liquid, and the woman's naked body emerges from the flowing sand. Bond turns, and his gun is aimed while the scene is surrounded by a gloom-shaped hood of lights. A silhouette is made by a naked woman standing, and billowing sand is fallen into by Bond. Sand and stars are swirled amidst the gloom of light, and the grid flexes, turns, and walks while the sand is billowed against the starry darkness. A crowd of naked women is posed in silhouette around the glaring sun, circles of bodies are formed that animate into a flickering blur and dissolve away, floating through space. Light is swirled by sand while posing high heels form a pattern that is slowly turned. Bond falls towards the expanding people in the eye, and a pistol is engulfed by sand as Bond is fallen in slow motion onto the sandy ground. His pistol is raised by him and it is fired in super slow-motion, with the bullet spinning slowly as it flies. The red dot travels sideways as a pile of naked women is silhouetted by the flaring sun, and an explosion of sand is created by the bullet’s landing. A red and yellow checked flag is billowed in the breeze as a square is paraded around by a procession of people in bright costumes, watched by huge crowds. The man is dumped by Bond from the boot onto a chair in a cellar, where M and another agent watch. Whiskey is gulped by Bond while near-tired horsemen enter the square, laid out as a racetrack. A chair is dragged across a stone floor, and a seat is taken by Bond next to Mr. White, joined by M. One agent is dropped by Mitchell, and as M goes down, the horse race starts. The man is leapt on by Bond, the gun is grabbed, and the prisoner hits and goes down. Mitchell is disarmed by Bond, the gun is kicked away, but then Bond is booted to the ground. The gun is gone for by Mitchell, and he runs off as the fast and furious Palio horse race is thundered around Siena's main square. Spiral stairs are pounded down by Mitchell into water at the base of a tower, and he then dives through an iron gate. The stairs are ignored by Bond and a flying leap is taken after him. In the race, a rider falls, and his man is chased down a watery tunnel by Bond, but a gate bars his way."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "The wooden gates open, and Bond drives down a long brick tunnel. He stops, opens the boot, revealing a man inside. Bond, illuminated, fires a bullet in slow motion, with smoke trailing over sand dunes. Light surrounds the sun as a shadowy Bond aims his pistol, casting shadows over the dunes. A red dot moves sideways as a naked woman is silhouetted on the dunes. Bond stands in low light as sand flows like liquid, revealing a woman's body. He turns, aiming his gun, surrounded by lights. A naked woman stands in silhouette, and Bond falls into swirling sand. Sand and stars swirl in the light, forming patterns. A crowd of naked women pose around the sun, forming circles that dissolve into space. Sand swirls as high-heels form a pattern. Bond falls toward expanding figures, sand engulfing a pistol as he lands. He fires in slow motion, the bullet spinning. The red dot moves as the sun flares behind women, and the bullet explodes in sand. A checked flag waves as people in bright costumes parade, watched by crowds. Bond dumps the man from the boot in a cellar, where M and another agent watch. Bond drinks whiskey as horsemen enter a racetrack. A chair drags across the floor, and Bond sits with Mr. White and M. Mitchell drops an agent, and as M falls, the horse race begins. Bond tackles the man, grabs the gun, and the prisoner is hit. Bond disarms Mitchell but is kicked down. Mitchell grabs the gun and runs as the Palio horse race thunders around Siena's square. Mitchell runs down stairs into water, diving through a gate. Bond leaps after him. In the race, a rider falls, and Bond chases his target down a tunnel, but a gate blocks his way."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "The wooden gates open, and Bond drives through a long brick tunnel. He stops, opens the boot, revealing a man inside. Bond, in a pool of light, fires a bullet in slow motion, with smoke streaming over sand dunes. Light surrounds the sun as Bond's shadow passes over the dunes. A red dot moves sideways, silhouetting a naked woman on the dunes. Bond stands in low light as sand flows like liquid, revealing a woman's body. He turns, aiming his gun, surrounded by lights. A naked woman stands in silhouette, and Bond falls into sand. Sand and stars swirl, forming circles of silhouetted women around the sun, dissolving into space. Sand swirls as high-heels form a pattern. Bond falls towards people in the eye, sand engulfing a pistol. He fires in slow motion, the bullet spinning. The red dot moves as the sun flares behind women, and the bullet explodes in sand. A checked flag waves as people parade in costumes, watched by crowds. Bond dumps the man from the boot in a cellar, where M and another agent watch. Bond drinks whiskey as horsemen enter a racetrack. A chair drags across the floor, and Bond sits with Mr. White and M. Mitchell drops an agent, and as M falls, the horse race starts. Bond leaps on the man, grabs the gun, and the prisoner is hit. Bond disarms Mitchell, kicks the gun away, but is knocked down. Mitchell grabs the gun and runs as the Palio horse race thunders around Siena's square. Mitchell runs down stairs into water, diving through a gate. Bond leaps after him. In the race, a rider falls, and Bond chases his man down a tunnel, but a gate blocks him."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "The sturdy wooden gates swing open with a creak, and James Bond confidently makes his way down a long, straight tunnel lined with bricks. He comes to a halt, steps out of his vehicle, and opens the boot to reveal a man blinking up at him in surprise. Bond stands elevated in a pool of light, and in a dramatic, super slow-motion sequence, he fires a bullet, creating a burst of smoke. The bullet's smoky trail gracefully moves over the sand dunes. Light envelops the sun, casting a shadowy silhouette of Bond as he aims his pistol, with his shadow gliding over the dunes. A red dot travels sideways, and a naked woman is silhouetted against the sand, lying languidly over the dunes in the dim half-light. Bond stands in the low light, where the fine sands flow like liquid, and a woman's naked form emerges from the flowing sand. Bond turns, aiming his gun, while a hood of lights, shaped by the gloom, surrounds the scene. A naked woman stands in silhouette, and Bond falls into the billowing sand. Sand and stars swirl together amidst the dim light, and the grid flexes, turns, and walks as the sand billows against the starry darkness. A crowd of naked women pose in silhouette around the glaring sun, forming circles of bodies that animate into a flickering blur and dissolve away, floating through the vastness of space. Sand swirls in the light while high-heeled shoes pose, forming a slowly turning pattern. Bond falls towards the expanding figures in the eye, and sand engulfs a pistol as Bond descends in slow motion onto the sandy ground. He raises his pistol and fires in super slow-motion, with the bullet spinning slowly as it flies through the air. The red dot travels sideways as the sun flares behind a pile of naked women, and the bullet lands in an explosion of sand. A red and yellow checked flag flutters in the breeze as a procession of people in bright, colorful costumes parades around a square, watched by huge crowds. Bond unceremoniously dumps the man from the boot onto a chair in a dimly lit cellar, where M and another agent are watching. Bond gulps down whiskey while near-tired horsemen enter the square, which is laid out as a racetrack. A chair is dragged noisily across the stone floor, and Bond sits next to Mr. White, joined by M. Mitchell drops one agent, and as M goes down, the horse race begins with a thunderous start. Bond leaps onto the man, seizes the gun, and the prisoner is hit and goes down. Bond disarms Mitchell and kicks the gun away, but then he is booted to the ground. Mitchell makes a dash for the gun and runs off as the fast and furious Palio horse race thunders around Siena's main square. Mitchell pounds down spiral stairs and into water at the base of a tower, then dives through an iron gate. Bond, undeterred by the stairs, takes a flying leap after him. In the race, a rider falls, and Bond chases his target down a watery tunnel, but a gate bars his way, halting his pursuit."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "The sturdy and robust wooden gates swing open with a lengthy, resonant creak, and James Bond strides forward with confidence down a long, straight tunnel that is meticulously lined with precisely placed bricks. He comes to a distinct halt, steps deliberately out of his vehicle, and opens the boot to reveal a man, who is blinking up at him in utter surprise. Bond stands elevated in a bright pool of light, and in a dramatic and super slow-motion sequence, he fires a single bullet, creating an impressive burst of smoke. The bullet's smoky trail gracefully and elegantly moves over the vast sand dunes. The light envelops the sun, casting a shadowy silhouette of Bond as he carefully aims his pistol, with his shadow gliding seamlessly over the dunes. A red dot travels sideways, and a naked woman is silhouetted against the sand, lying languidly over the dunes in the dim, suffused half-light. Bond stands in the low light, where the fine sands appear to flow like liquid, and a woman's naked form seems to emerge from the flowing sand. Bond turns, aiming his gun, while a hood of lights, shaped intriguingly by the surrounding gloom, envelops the scene. A naked woman stands prominently in silhouette, and Bond falls into the billowing sand. Sand and stars swirl intricately together amidst the dim light, and the grid flexes, turns, and walks as the sand billows elegantly against the starry darkness. A crowd of naked women pose artfully in silhouette around the glaring sun, forming intricate circles of bodies that animate into a flickering blur and dissolve away, floating gently through the vastness of space. Sand swirls in the light while high-heeled shoes pose delicately, forming a slowly turning pattern. Bond falls towards the expanding figures in the eye’s center, and sand engulfs a pistol as Bond descends slowly in slow motion onto the sandy ground. He raises his pistol and fires once more in super slow-motion, with the bullet spinning slowly and methodically as it flies through the air. The red dot travels sideways as the sun flares brightly behind a pile of naked women, and the bullet lands dramatically in an explosion of sand. A red and yellow checked flag flutters whimsically in the breeze as a procession of people in bright, colorful costumes parades energetically around a square, watched intently by huge crowds. Bond unceremoniously dumps the man ungraciously from the boot onto a chair in a dimly lit cellar, where M and another agent are watching. Bond gulps down whiskey while near-tired horsemen enter the square, which has been laid out as a racetrack. A chair is dragged noisily and loudly across the stone floor, and Bond sits next to Mr. White with M joining them. Mitchell drops one agent, and as M goes down, the horse race begins with an intense, thunderous start. Bond leaps onto the man, seizes the gun, and the prisoner is hit and promptly goes down. Bond skillfully disarms Mitchell and kicks the gun away, but then he is booted forcefully to the ground. Mitchell makes a frantic dash for the gun and runs off as the fast and furious Palio horse race thunders dramatically around Siena's main square. Mitchell pounds down a spiraling set of stairs and into the water at the base of a tower, then dives agilely through an iron gate. Bond, undeterred by the stairs, takes a flying leap after him. In the race, a rider falls with great drama, and Bond persistently chases his target down a watery tunnel, but a gate bars his way, effectively halting his determined pursuit."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "As the wooden gates slowly swing open, Bond confidently strides down a long, straight brick tunnel, his footsteps echoing softly against the walls. He comes to a halt, steps out of his vehicle, and moves to the rear, where he opens the boot to reveal a man inside, blinking up at him in surprise. Bond stands elevated in a pool of light, his silhouette stark against the brightness, and with deliberate precision, he fires a bullet. The shot unfolds in super slow motion, creating a dramatic burst of smoke that trails the bullet as it streams over the sand dunes. Light envelops the sun, casting a shadowy Bond as he aims his pistol, his shadow stretching across the dunes. A red dot moves sideways, highlighting a naked woman silhouetted against the sand, her form draped over the dunes in the dim light. Bond stands in the subdued glow as fine sands flow like liquid, revealing a woman's naked body emerging from the shifting grains. He turns, his gun poised, while a hood of lights shaped by the gloom encircles the scene. A naked woman stands silhouetted, and Bond finds himself falling into billowing sand. As sand and stars swirl amidst the dim light, a grid flexes, turns, and moves as the sand billows against the starry darkness. A crowd of naked women pose in silhouette around the glaring sun, their bodies forming circles that animate into a flickering blur before dissolving away, floating through space. Sand swirls in the light, and high-heeled shoes pose, forming a slowly turning pattern. Bond falls towards the expanding figures in the eye, and sand engulfs a pistol as he descends in slow motion onto the sandy ground. He raises his pistol and fires again in super slow motion, the bullet spinning slowly as it travels. The red dot continues its sideways journey as the sun flares behind a pile of naked women, culminating in the bullet landing with an explosion of sand. A red and yellow checked flag flutters in the breeze as a procession of people in bright costumes parades around a square, observed by huge crowds. Bond unceremoniously dumps the man from the boot onto a chair in a dimly lit cellar, where M and another agent are watching. He gulps down whiskey while near-tired horsemen enter the square, which is laid out as a racetrack. The sound of a chair scraping across the stone floor fills the air as Bond sits next to Mr. White, joined by M. Suddenly, Mitchell drops one of the agents, and as M goes down, the horse race begins with a thunderous start. Bond leaps onto the man, wrestles the gun from him, and the prisoner is hit, collapsing to the ground. Bond quickly disarms Mitchell, kicking the gun away, but is then booted to the ground himself. Mitchell seizes the opportunity, grabs the gun, and makes a run for it as the fast and furious Palio horse race roars around Siena's main square. Mitchell races down spiral stairs and splashes into water at the base of a tower, diving through an iron gate. Bond, undeterred by the stairs, takes a daring leap after him. In the race, a rider falls, and Bond pursues his target down a watery tunnel, only to be stopped by a gate barring his way."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "The wooden gates open, and Bond proceeds through a long brick tunnel. He stops to reveal a man in the boot, then fires a bullet in super slow motion, with the smoke trailing over the sand dunes. As light surrounds the sun, Bond's shadow passes over the dunes, and a red dot moves sideways, silhouetting a naked woman against the sand. Bond stands in low light as fine sands flow like liquid, revealing a woman's body. He turns, aiming his gun amidst a hood of lights, and falls into billowing sand. Sand and stars swirl in the light, forming patterns with posing high-heels. A crowd of silhouetted women forms circles that dissolve into space. Bond falls toward expanding figures, and sand engulfs a pistol as he lands in slow motion. He fires his pistol, with the bullet spinning slowly, landing in an explosion of sand. A red and yellow checked flag flutters as a parade of people in bright costumes moves through a square, watched by crowds. Bond dumps the man from the boot into a cellar chair, where M and another agent observe. He gulps whiskey as horsemen enter the racetrack square. Bond sits next to Mr. White, joined by M. Mitchell drops an agent, and as M falls, the horse race begins. Bond tackles the man, disarms Mitchell, and kicks the gun away but is knocked down. Mitchell retrieves the gun and escapes as the Palio horse race thunders around Siena's main square. Mitchell descends spiral stairs into water at a tower's base and dives through an iron gate. Bond leaps after him, bypassing the stairs. In the race, a rider falls, and Bond pursues his target down a watery tunnel, only to be stopped by a gate."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "The wooden gates of the secluded estate, reminiscent of ancient architecture with their gothic design, open, and Bond heads down a long, straight brick tunnel that resembles the secret passages often found in medieval castles. He stops, gets out, and opens the boot to reveal a man blinking up at him, disoriented under the harsh light. Bond is elevated in a pool of light and fires a bullet in a super slow-mo burst of smoke, with the bullet-stream of smoke moving over the sand dunes, reminiscent of the arid landscapes found in the deserts of North Africa. Light surrounds the sun, casting a dramatic effect similar to that of a solar eclipse, and a shadowy Bond aims his pistol, with Bond's shadow passing over the dunes like a phantom. A red dot travels sideways as a naked woman is silhouetted by the sand, lying over the dunes in the half-light, evoking imagery akin to surrealist art. Bond stands in the low light as fine sands flow like liquid, and a woman's naked body emerges from the flowing sand, a scene reminiscent of mythical tales where figures are born from the earth. Bond turns, aiming his gun, while a gloom-shaped hood of lights, reminiscent of a celestial halo, surrounds the scene. A naked woman stands in silhouette, and Bond falls into billowing sand that moves as if orchestrated by an unseen hand. Sand and stars swirl amidst the gloom of light, and the grid flexes, turning and walking as the sand billows against the starry darkness, creating an effect akin to a celestial dance. A crowd of naked women pose in silhouette around the glaring sun, forming circles of bodies that animate into a flickering blur, a visual echo of ancient rituals, and dissolve away, floating through the cosmic expanse of space. Sand swirls in the light while posing high-heels form a slowly turning pattern, reminiscent of the intricate designs in haute couture. Bond falls towards the expanding people in the eye of a swirling vortex, and sand engulfs a pistol as Bond falls in slow motion onto the sandy ground. He raises his pistol and fires in super slow-motion, with the bullet spinning slowly as it flies, appearing as if caught in time itself. The red dot travels sideways as the sun flares behind a pile of naked women, and the bullet lands in an explosion of sand, a spectacular climax reminiscent of dramatic film endings. A red and yellow checked flag, typically seen at international motorsport events such as Formula 1, billows in the breeze as a procession of people in bright costumes parades around a square, watched by huge crowds. Bond dumps the man from the boot onto a chair in a cellar, historically used for storing fine wines, where M and another agent watch. Bond gulps whiskey while near-tired horsemen enter the square, laid out as a racetrack for the annual Palio di Siena, a historic horse race. A chair is dragged across a stone floor, and Bond sits next to Mr. White, a notorious figure known for his connections to international crime syndicates, joined by M. Mitchell drops one agent, and as M goes down, the horse race starts, its thunderous energy echoing through the streets. Bond leaps on the man, grabs the gun, and the prisoner is hit and goes down. Bond disarms Mitchell and kicks the gun away but then gets booted to the ground amid the chaos. Mitchell goes for the gun and runs off as the fast and furious Palio horse race, a tradition since the Middle Ages, thunders around Siena's main square. Mitchell pounds down spiral stairs and into water at the base of a tower, then dives through an iron gate, reminiscent of ancient city defenses. Bond ignores the stairs and takes a flying leap after him. In the race, a rider falls, and Bond chases his man down a watery tunnel, originally designed for city irrigation, but a gate bars his way."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "The wooden gates open and Bond heads down a long straight brick tunnel  He stops gets out and opens the boot to reveal a man blinking up at him  Bond is elevated in a pool of light and fires a bullet in a super slowmo burst of smoke with the bulletstream of smoke moving over the sand dunes  Sand swirls in the light while posing highheels form a slowly turning pattern  Bond falls towards the expanding people in the eye and sand engulfs a pistol as Bond falls in slow motion onto the sandy ground  He raises his pistol and fires in super slowmotion with the bullet spinning slowly as it flies  The red dot travels sideways as the sun flares behind a pile of naked women and the bullet lands in an explosion of sand  A red and yellow checked flag billows in the breeze as a procession of people in bright costumes parades around a square watched by huge crowds  Bond dumps the man from the boot onto a chair in a cellar where M and another agent watch  Bond gulps whiskey while neartired horsemen enter the square laid out as a racetrack  A chair is dragged across a stone floor and Bond sits next to Mr White joined by M  Mitchell drops one agent and as M goes down the horse race starts  Bond leaps on  the man grabs the gun and the prisoner is hit and goes down  Bond disarms Mitchell and kicks the gun away but then gets booted to the ground  Mitchell goes for the gun and runs off as the fast and furious Palio horse race thunders around Siena's main square  Light surrounds the sun and a shadowy Bond aims his pistol with Bond's shadow passing over the dunes  A red dot travels sideways as a naked woman is silhouetted by the sand lying over the dunes in the halflight  Bond stands in the low light as fine sands flow like liquid and a woman's naked body emerges from the flowing sand  Bond turns aiming his gun while a gloomshaped hood of lights surrounds the scene  A naked woman stands in silhouette and Bond falls into billowing sand  Sand and stars swirl amidst the gloom of light and the grid flexes turns and walks as the sand billows against the starry darkness  A crowd of naked women pose in silhouette around the glaring sun forming circles of bodies that animate into a flickering blur and dissolve away floating through space  Sand swirls in the light while posing highheels form a slowly turning pattern  Bond falls towards the expanding people in the eye and sand engulfs a pistol as Bond falls in slow motion onto the sandy ground  He raises his pistol and fires in super slowmotion with the bullet spinning slowly as it flies  The red dot travels sideways as the sun flares behind a pile of naked women and the bullet lands in an explosion of sand  A red and yellow checked flag billows in the breeze as a procession of people in bright costumes parades around a square watched by huge crowds  Bond dumps the man from the boot onto a chair in a cellar where M and another agent watch  Bond gulps whiskey while neartired horsemen enter the square laid out as a racetrack  A chair is dragged across a stone floor and Bond sits next to Mr White joined by M  Mitchell drops one agent and as M goes down the horse race starts  Bond leaps on  the man grabs the gun and the prisoner is hit and goes down  Bond disarms Mitchell and kicks the gun away but then gets booted to the ground  Mitchell goes for the gun and runs off as the fast and furious Palio horse race thunders around Siena's main square  Mitchell pounds down spiral stairs and into water at the base of a tower then dives through an iron gate  Bond ignores the stairs and takes a flying leap after him  In the race a rider falls and Bond chases his man down a watery tunnel but a gate bars his way"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "The wooden gates open and Bond heads down a long straight brick tunnel. He stops gets out and opens the boot to reveal a man blinking up at him. Bond is elevated in a pool of light and fires a bullet in a super slowmo burst of smoke with the bulletstream of smoke moving over the sand dunes. Light surrounds the sun and a shadowy Bond aims his pistol with Bond's shadow passing over the dunes. A red dot travels sideways as a naked woman is silhouetted by the sand lying over the dunes in the halflight. Bond stands in the low light as fine sands flow like liquid and a woman's naked body emerges from the flowing sand. Bond turns aiming his gun while a gloomshaped hood of lights surrounds the scene. A naked woman stands in silhouette and Bond falls into billowing sand. Sand and stars swirl amidst the gloom of light and the grid flexes turns and walks as the sand billows against the starry darkness. A crowd of naked women pose in silhouette around the glaring sun forming circles of bodies that animate into a flickering blur and dissolve away floating through space. Sand swirls in the light while posing highheels form a slowly turning pattern. Bond falls towards the expanding people in the eye and sand engulfs a pistol as Bond falls in slow motion onto the sandy ground. He raises his pistol and fires in super slowmotion with the bullet spinning slowly as it flies. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. The red dot travels sideways as the sun flares behind a pile of naked women and the bullet lands in an explosion of sand. A red and yellow checked flag billows in the breeze as a procession of people in bright costumes parades around a square watched by huge crowds. Bond dumps the man from the boot onto a chair in a cellar where M and another agent watch. Bond gulps whiskey while neartired horsemen enter the square laid out as a racetrack. A chair is dragged across a stone floor and Bond sits next to Mr White joined by M. Mitchell drops one agent and as M goes down the horse race starts. Bond leaps on. the man grabs the gun and the prisoner is hit and goes down. Bond disarms Mitchell and kicks the gun away but then gets booted to the ground. Mitchell goes for the gun and runs off as the fast and furious Palio horse race thunders around Siena's main square. Mitchell pounds down spiral stairs and into water at the base of a tower then dives through an iron gate. Bond ignores the stairs and takes a flying leap after him. In the race a rider falls and Bond chases his man down a watery tunnel but a gate bars his way."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "The wooden gates open and Bond heads down a long straight brick tunnel. He stops gets out and opens the boot to reveal a man blinking up at him. Bond is elevated in a pool of light and fires a bullet in a super slowmo burst of smoke with the bulletstream of smoke moving over the sand dunes. Light surrounds the sun and a shadowy Bond aims his pistol with Bond's shadow passing over the dunes. A red dot travels sideways as a naked woman is silhouetted by the sand lying over the dunes in the halflight. Bond stands in the low light as fine sands flow like liquid and a woman's naked body emerges from the flowing sand. Bond turns aiming his gun while a gloomshaped hood of lights surrounds the scene. A naked woman stands in silhouette and Bond falls into billowing sand. Sand and stars swirl amidst the gloom of light and the grid flexes turns and walks as the sand billows against the starry darkness. A crowd of naked women pose in silhouette around the glaring sun forming circles of bodies that animate into a flickering blur and dissolve away floating through space. Sand swirls in the light while posing highheels form a slowly turning pattern. Bond falls towards the expanding people in the eye and sand engulfs a pistol as Bond falls in slow motion onto the sandy ground. He raises his pistol and fires in super slowmotion with the bullet spinning slowly as it flies. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. The red dot travels sideways as the sun flares behind a pile of naked women and the bullet lands in an explosion of sand. A red and yellow checked flag billows in the breeze as a procession of people in bright costumes parades around a square watched by huge crowds. Bond dumps the man from the boot onto a chair in a cellar where M and another agent watch. Bond gulps whiskey while neartired horsemen enter the square laid out as a racetrack. A chair is dragged across a stone floor and Bond sits next to Mr White joined by M. Mitchell drops one agent and as M goes down the horse race starts. Bond leaps on. the man grabs the gun and the prisoner is hit and goes down. Bond disarms Mitchell and kicks the gun away but then gets booted to the ground. Mitchell goes for the gun and runs off as the fast and furious Palio horse race thunders around Siena's main square. Mitchell pounds down spiral stairs and into water at the base of a tower then dives through an iron gate. Bond ignores the stairs and takes a flying leap after him. In the race a rider falls and Bond chases his man down a watery tunnel but a gate bars his way."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "The wooden gates open and Bond heads down a long straight brick tunnel. He stops gets out and opens the boot to reveal a man blinking up at him. Bond is elevated in a pool of light and fires a bullet in a super slowmo burst of smoke with the bulletstream of smoke moving over the sand dunes. Light surrounds the sun and a shadowy Bond aims his pistol with Bond's shadow passing over the dunes. A red dot travels sideways as a naked woman is silhouetted by the sand lying over the dunes in the halflight. Bond stands in the low light as fine sands flow like liquid and a woman's naked body emerges from the flowing sand. Bond turns aiming his gun while a gloomshaped hood of lights surrounds the scene. the man grabs the gun and the prisoner is hit and goes down. Bond disarms Mitchell and kicks the gun away but then gets booted to the ground. Mitchell goes for the gun and runs off as the fast and furious Palio horse race thunders around Siena's main square. Mitchell pounds down spiral stairs and into water at the base of a tower then dives through an iron gate. Bond ignores the stairs and takes a flying leap after him. In the race a rider falls and Bond chases his man down a watery tunnel but a gate bars his way."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "The wooden gates open and Bond heads down a long straight brick tunnel. He stops gets out and opens the boot to reveal a man blinking up at him. Bond is elevated in a pool of light and fires a bullet in a super slowmo burst of smoke with the bulletstream of smoke moving over the sand dunes. Mitchell pounds down spiral stairs and into water at the base of a tower then dives through an iron gate. Bond ignores the stairs and takes a flying leap after him. In the race a rider falls and Bond chases his man down a watery tunnel but a gate bars his way."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "The wooden gates open, and a cat heads down a long, straight brick tunnel. The cat stops, gets out, and opens the boot to reveal a man blinking up at the cat. The cat is elevated in a pool of light and fires a bullet in a super slow-mo burst of smoke, with the bullet-stream of smoke moving over the sand dunes. Light surrounds the sun, and a shadowy rabbit aims its pistol, with the rabbit's shadow passing over the dunes. A red dot travels sideways as a naked woman is silhouetted by the sand, lying over the dunes in the half-light. A dog stands in the low light as fine sands flow like liquid, and a woman's naked body emerges from the flowing sand. The turtle turns, aiming its gun, while a gloom-shaped hood of lights surrounds the scene. A naked woman stands in silhouette, and the frog falls into billowing sand. Sand and stars swirl amidst the gloom of light, and the grid flexes, turns, and walks as the sand billows against the starry darkness. A crowd of naked women pose in silhouette around the glaring sun, forming circles of bodies that animate into a flickering blur and dissolve away, floating through space. Sand swirls in the light while posing high-heels form a slowly turning pattern. The horse falls towards the expanding people in the eye, and sand engulfs a pistol as the rabbit falls in slow motion onto the sandy ground. It raises its pistol and fires in super slow-motion, with the bullet spinning slowly as it flies. The red dot travels sideways as the sun flares behind a pile of naked women, and the bullet lands in an explosion of sand. A red and yellow checked flag billows in the breeze as a procession of ghosts in bright costumes parades around a square, watched by huge crowds. The bear dumps the man from the boot onto a chair in a cellar, where a fish and another agent watch. The deer gulps whiskey while near-tired horsemen enter the square, laid out as a racetrack. A chair is dragged across a stone floor, and the bat sits next to Mr. White, joined by a penguin. A mouse drops one agent, and as the dolphin goes down, the horse race starts. A lion leaps on the man, grabs the gun, and the prisoner is hit and goes down. The kangaroo disarms the mouse and kicks the gun away but then gets booted to the ground. The mouse goes for the gun and runs off as the fast and furious Palio horse race thunders around Siena's main square. The fox pounds down spiral stairs and into water at the base of a tower, then dives through an iron gate. The wolf ignores the stairs and takes a flying leap after it. In the race, a rider falls, and the elephant chases its man down a watery tunnel, but a gate bars its way."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "The stone gates open, and Bond heads down a long, straight marble corridor. He stops, gets out, and opens the suitcase to reveal a man blinking up at him. Bond is elevated in a beam of light and fires a dart in a super slow-mo burst of mist, with the dart-stream of mist moving over the grass fields. Light surrounds the moon, and a shadowy Bond aims his crossbow, with Bond's shadow passing over the fields. A blue dot travels sideways as a clothed woman is silhouetted by the grass, lying over the fields in the dim light. Bond stands in the low light as fine leaves flow like liquid, and a woman's clothed body emerges from the flowing leaves. Bond turns, aiming his crossbow, while a cloud-shaped veil of lights surrounds the scene. A clothed woman stands in silhouette, and Bond falls into billowing leaves. Leaves and stars swirl amidst the haze of light, and the scaffold flexes, turns, and walks as the leaves billow against the starry darkness. A troupe of clothed women pose in silhouette around the glowing moon, forming circles of bodies that animate into a flickering blur and dissolve away, floating through space. Leaves swirl in the light while posing sneakers form a slowly turning pattern. Bond falls towards the expanding buildings in the horizon, and leaves engulf a crossbow as Bond falls in slow motion onto the grassy ground. He raises his crossbow and fires in super slow-motion, with the dart spinning slowly as it flies. The blue dot travels sideways as the moon flares behind a heap of clothed women, and the dart lands in an explosion of leaves. A blue and green checked kite flutters in the breeze as a procession of animals in bright costumes parades around a plaza, watched by huge crowds. Bond dumps the man from the suitcase onto a bench in a barn, where M and another agent watch. Bond gulps tea while near-tired cyclists enter the plaza, laid out as a racetrack. A bench is dragged across a wooden floor, and Bond sits next to Mr. White, joined by M. Mitchell drops one agent, and as M goes down, the bike race starts. Bond leaps on the man, grabs the slingshot, and the prisoner is hit and goes down. Bond disarms Mitchell and kicks the slingshot away but then gets tripped to the ground. Mitchell goes for the slingshot and runs off as the fast and furious Palio bike race thunders around Siena's main plaza. Mitchell pounds down spiral ramps and into air at the base of a monument, then dives through a wooden gate. Bond ignores the ramps and takes a flying leap after him. In the race, a rider falls, and Bond chases his man down an airy tunnel, but a gate bars his way."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "The wooden gates swing, and Bond strolls through a long, straight brick tunnel. He pauses, stretches out, and inspects the boot to display a man gazing up at him. Bond is perched in a pool of light and tosses a coin in a super slow-mo arc of smoke, with the coin-stream of smoke drifting over the sand dunes. Light encircles the sun, and a shadowy Bond waves his pistol, with Bond's shadow gliding over the dunes. A red dot glides sideways as a naked woman is outlined by the sand, reclining over the dunes in the half-light. Bond lounges in the low light as fine sands drift like mist, and a woman's naked body materializes from the swirling sand. Bond flips, twirling his gun, while a haze-shaped canopy of lights envelops the scene. A naked woman dances in silhouette, and Bond descends into billowing sand. Sand and stars twirl amidst the haze of light, and the grid stretches, spins, and saunters as the sand drifts against the starry darkness. A gathering of naked women parade in silhouette around the blazing sun, creating circles of bodies that transform into a flickering streak and dissolve away, drifting through space. Sand drifts in the light while swaying high-heels create a slowly revolving motif. Bond rises towards the broadening crowd in the eye, and sand envelops a pistol as Bond floats in slow motion onto the sandy ground. He lowers his pistol and tosses it in super slow-motion, with the bullet gliding slowly as it soars. The red dot glides sideways as the sun gleams behind a mound of naked women, and the bullet collides in a flicker of sand. A red and yellow checked flag flutters in the breeze as a troupe of people in bright costumes strolls around a square, cheered by immense crowds. Bond hoists the man from the boot onto a chair in a cellar, where M and another agent observe. Bond sips whiskey while near-tired horsemen exit the square, arranged as a racetrack. A chair is coaxed across a stone floor, and Bond reclines next to Mr. White, flanked by M. Mitchell sets down one agent, and as M descends, the horse race begins. Bond marches toward the man, snatches the gun, and the prisoner stumbles and collapses. Bond divests Mitchell of the gun and nudges the gun away but then gets tripped to the ground. Mitchell lunges for the gun and dashes off as the fast and furious Palio horse race echoes around Siena's main square. Mitchell races down spiral stairs and into water at the base of a tower, then plunges through an iron gate. Bond overlooks the stairs and takes a daring plunge after him. In the race, a rider stumbles, and Bond tracks his man through a watery tunnel, but a gate blocks his advance."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "The steel trapdoors open, and a cat heads down a long, straight granite corridor. It stops, gets out, and opens the trunk to reveal a frog blinking up at it. The cat is elevated in a pool of light and fires an arrow in a super slow-mo burst of mist, with the arrow-stream of mist moving over the mountains. Light surrounds the moon, and a shadowy cat aims its crossbow, with the cat's shadow passing over the mountains. A green light travels sideways as a ghostly bear is silhouetted by the mountains, lying over the peaks in the half-light. The cat stands in the dim glow as fine leaves flow like liquid, and a bear's ghostly form emerges from the flowing leaves. The cat turns, aiming its crossbow, while a gloom-shaped hood of candles surrounds the scene. A ghostly bear stands in silhouette, and the cat falls into billowing leaves. Leaves and comets swirl amidst the gloom of light, and the lattice flexes, turns, and walks as the leaves billow against the starry darkness. A flock of ghostly bears pose in silhouette around the glowing moon, forming circles of forms that animate into a flickering blur and dissolve away, floating through space. Leaves swirl in the glow while posing wings form a slowly turning pattern. The cat falls towards the expanding clouds in the eye, and leaves engulf a crossbow as the cat falls in slow motion onto the leafy ground. It raises its crossbow and fires in super slow-motion, with the arrow spinning slowly as it flies. The green light travels sideways as the moon flares behind a heap of ghostly bears, and the arrow lands in an explosion of leaves. A green and purple striped kite billows in the breeze as a parade of dancers in bright costumes prances around a hexagon, watched by enormous flocks. The cat dumps the frog from the trunk onto a bench in a cellar, where Z and another pilot watch. The cat gulps cider while near-tired musicians enter the hexagon, arranged as a dance floor. A bench is dragged across a wooden floor, and the cat sits next to Mr. Green, joined by Z. Taylor drops one pilot, and as Z goes down, the dance performance starts. The cat leaps on the frog, grabs the bow, and the captive is struck and goes down. The cat disarms Taylor and kicks the bow away but then gets booted to the ground. Taylor goes for the bow and runs off as the fast and furious parade surges around Lyon's central hexagon. Taylor pounds down spiral slides and into oil at the base of a mast, then dives through a gold gate. The cat ignores the slides and takes a flying leap after it. In the parade, a drummer falls, and the cat chases its frog down a oily tunnel, but a gate bars its way."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "The iron gates swing open, and a detective ambles down a narrow, twisting stone passage. He pauses, climbs out, and closes the hood to conceal a dog yawning up at him. The detective is submerged in a pool of shadow and tosses a stone in a super slow-mo arc of mist, with the stone-stream of mist drifting over the grassy hills. Darkness envelops the moon, and a shadowy detective tosses his lasso, with the detective's silhouette gliding over the hills. A white spot drifts upwards as a clothed child is outlined by the grass, lounging over the hills in the twilight. The detective kneels in the bright light as coarse grasses ripple like water, and a child's clothed form materializes from the shimmering grass. The detective spins, throwing his net, while a misty veil of shadows cloaks the scene. A clothed child emerges in outline, and the detective rises into swirling grass. Grass and birds twirl amidst the mist of darkness, and the pattern oscillates, loops, and floats as the grass swells against the twinkling vastness. A troupe of clothed children stand in outline against the shining moon, forming patterns of forms that shimmer into a flickering haze and dissipate, drifting through the ether. Grass eddies in the darkness while assembling boots create a slowly shifting design. The detective rises towards the shrinking animals in the sky, and mist envelops a lasso as the detective rises in slow motion onto the grassy knoll. He drops his lasso and tosses in super slow-motion, with the stone revolving slowly as it travels. The white spot drifts upwards as the moon glows behind a cluster of clothed children, and the stone lands in a burst of grass. A white and blue striped kite flutters in the wind as a line of animals in dark outfits marches around a circle, observed by small groups. The detective lifts the dog from the hood onto a table in a basement, where Q and a different inspector listen. The detective sips lemonade while exhausted dancers leave the circle, arranged like a carousel. A bench is pushed across a wooden floor, and the detective leans next to Mrs. Black, joined by Q. Smith drops another inspector, and as Q leaps up, the carousel spins. The detective jumps over the dog, drops the net, and the suspect is nudged and stands up. The detective distrusts Smith and throws the net aside but then gets lifted into the air. Smith reaches for the net and strolls off as the gentle and graceful donkey parade winds through Rome's central avenue. Smith meanders up spiral ladders and into fog at the top of a mountain, then floats through a wooden door. The detective pursues the ladders and takes a cautious climb after him. In the parade, a walker slips, and the detective calls his dog through a foggy corridor, but a door blocks his path."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "The metal doors slide open, and Bond glides down a narrow, winding gravel path. He pauses, climbs out, and unlocks the trunk to reveal a cat staring up at him. Bond is suspended in a beam of darkness and tosses a pebble in a rapid slow-mo burst of mist, with the pebble-stream of fog drifting over the sea waves. Darkness envelops the moon, and a shadowy Bond fires his slingshot, with Bond's shadow drifting over the waves. A blue spot drifts upwards as a clothed man is outlined by the ocean, reclining over the waves in the twilight. Bond stands in the dim glow as fiery embers flow like streamers, and a man's clothed figure emerges from the glowing embers. Bond swivels, tossing his knife, while a dim-shaped arc of shadows enshrouds the vista. A clothed man stands in outline, and Bond tumbles into swirling embers. Embers and planets spin amidst the dimness of shadows, and the grid stretches, flips, and marches as the embers tumble against the cosmic void. A group of clothed men stance in outline around the dim moon, forming clusters of figures that twinkle into a shimmering mist and vanish away, gliding through the cosmos. Embers twirl in the shadows while stepping sandals create a gently swirling pattern. Bond descends towards the shrinking figures in the eye, and embers engulf a knife as Bond descends in slow motion onto the ember-covered earth. He lifts his knife and tosses in super slow-motion, with the pebble spiraling gradually as it soars. The blue spot drifts upwards as the moon glows behind a heap of clothed men, and the pebble touches down in a flash of embers. A black and green striped banner flutters in the wind as a troupe of animals in muted garments marches around a plaza, observed by small groups. Bond releases the cat from the trunk onto a bench in a basement, where M and another officer observe. Bond sips tea whilst near-weary dancers enter the plaza, set up as a performance stage. A bench is hauled across a wooden floor, and Bond perches beside Mr. White, joined by M. Mitchell strikes one officer, and as M collapses, the dance begins. Bond vaults on the man, picks up the knife, and the detainee is struck and collapses. Bond disables Mitchell and tosses the knife away but then gets toppled to the ground. Mitchell scrambles for the knife and dashes away as the lively and dynamic Palio dance spins around Siena's main plaza. Mitchell rushes down spiral steps and into air at the base of a pillar, then sprints through a wooden fence. Bond bypasses the steps and takes a soaring drop after him. In the dance, a participant stumbles, and Bond pursues his man down a breezy passageway, but a fence blocks his path."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "The metal doors swing open, and Jenkins strolls up a winding, narrow cobblestone corridor. He pauses, steps in, and pries open the trunk to discover a cat staring up at him. Jenkins is lowered in a shaft of shadow and launches a pebble in an ultra quick-mo puff of mist, with the pebble-trail of mist drifting over the grassy knolls. Shadow hides the moon, and a blurry Jenkins points his slingshot, with Jenkins's silhouette drifting over the knolls. An orange speck drifts upwards as a clothed man is outlined by the grass, reclining on the knolls in the dusk. Jenkins sits in the dim glow as coarse grasses flow like water, and a man's clothed figure appears from the rushing grass. Jenkins pivots, holding his slingshot, while a bright-cornered cloud of shadows encircles the moment. A clothed man lingers outlined, and Jenkins rises into swirling grass. Grass and planets twist within the shadow of mist, and the lattice bends, pivots, and climbs as the grass swirls against the cosmic light. A gathering of clothed men stand outlined against the bright moon, assembling chains of bodies that morph into a flickering haze and vanish upwards, drifting through the void. Grass twists in the shadow while standing sneakers create a slowly shifting shape. Jenkins rises towards the shrinking animals in the horizon, and grass envelops a slingshot as Jenkins rises in quick motion onto the grassy hill. He lowers his slingshot and launches in ultra quick-motion, with the pebble spinning swiftly as it glides. The orange speck drifts upwards as the moon bursts before a stack of clothed men, and the pebble strikes in a surge of grass. A blue and green striped banner flutters in the wind as a lineup of creatures in dull attire routes around a circle, observed by tiny groups. Jenkins drops the cat from the trunk onto a bench in an attic, where Z and another worker observe. Jenkins sips soda while exhausted dancers leave the circle, spread out like a trackfield. A bench is shifted across a marble floor, and Jenkins stands beside Mr. Black, accompanied by Z. Lucas lifts one worker, and as Z gets up, the dance begins. Jenkins leaps on the cat, seizes the slingshot, and the feline is tagged and collapses. Jenkins unloads Lucas and kicks the slingshot away but then is nudged to the floor. Lucas reaches for the slingshot and dashes off as the slow and gentle Tango dance glides around Rome's main circle. Lucas crawls up straight ladders and into air at the top of a turret, then squeezes through a wooden grate. Jenkins avoids the ladders and takes a diving sprint after him. In the dance, a performer trips, and Jenkins pursues the cat up an airy tunnel, but a grate blocks his path."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "The wooden gates open, and Bond drives through a long brick tunnel, stopping to reveal a captive man in the trunk. In a pool of light, Bond fires a bullet in slow motion, with smoke streaming over sand dunes. He aims his pistol, casting shadows over the dunes, as naked silhouettes appear amidst swirling sand and light. Sand and stars swirl as Bond falls, firing his gun slowly. A red dot moves sideways while the bullet explodes in sand. A parade with people in bright costumes fills a square. Bond dumps the captive in a cellar where M and another agent await. Bond drinks whiskey, watching near-tired horsemen prepare for the Palio horse race. As the race begins, chaos ensues—Mitchell drops an agent, and Bond engages in a chase, disarming Mitchell but getting knocked down. Mitchell grabs a gun, fleeing as the horse race thunders around the square. He races down stairs into water, diving through a gate. Bond leaps after him, chasing through a watery tunnel until stopped by a gate."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "In the race a rider falls and Bond chases his man down a watery tunnel but a gate bars his way Bond ignores the stairs and takes a flying leap after him  Mitchell pounds down spiral stairs and into water at the base of a tower then dives through an iron gate  Mitchell goes for the gun and runs off as the fast and furious Palio horse race thunders around Siena's main square  Bond disarms Mitchell and kicks the gun away but then gets booted to the ground  the man grabs the gun and the prisoner is hit and goes down  Bond leaps on  Mitchell drops one agent and as M goes down the horse race starts  A chair is dragged across a stone floor and Bond sits next to Mr White joined by M  Bond gulps whiskey while neartired horsemen enter the square laid out as a racetrack  Bond dumps the man from the boot onto a chair in a cellar where M and another agent watch  A red and yellow checked flag billows in the breeze as a procession of people in bright costumes parades around a square watched by huge crowds  The red dot travels sideways as the sun flares behind a pile of naked women and the bullet lands in an explosion of sand  He raises his pistol and fires in super slowmotion with the bullet spinning slowly as it flies  Bond falls towards the expanding people in the eye and sand engulfs a pistol as Bond falls in slow motion onto the sandy ground  Sand swirls in the light while posing highheels form a slowly turning pattern  A crowd of naked women pose in silhouette around the glaring sun forming circles of bodies that animate into a flickering blur and dissolve away floating through space  Sand and stars swirl amidst the gloom of light and the grid flexes turns and walks as the sand billows against the starry darkness  A naked woman stands in silhouette and Bond falls into billowing sand  Bond turns aiming his gun while a gloomshaped hood of lights surrounds the scene  Bond stands in the low light as fine sands flow like liquid and a woman's naked body emerges from the flowing sand  A red dot travels sideways as a naked woman is silhouetted by the sand lying over the dunes in the halflight  Light surrounds the sun and a shadowy Bond aims his pistol with Bond's shadow passing over the dunes  Bond is elevated in a pool of light and fires a bullet in a super slowmo burst of smoke with the bulletstream of smoke moving over the sand dunes  He stops gets out and opens the boot to reveal a man blinking up at him  The wooden gates open and Bond heads down a long straight brick tunnel "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Bond gulps whiskey while neartired horsemen enter the square laid out as a racetrack  In the race a rider falls and Bond chases his man down a watery tunnel but a gate bars his way the man grabs the gun and the prisoner is hit and goes down  A chair is dragged across a stone floor and Bond sits next to Mr White joined by M  Bond leaps on  Bond falls towards the expanding people in the eye and sand engulfs a pistol as Bond falls in slow motion onto the sandy ground  Bond dumps the man from the boot onto a chair in a cellar where M and another agent watch  He stops gets out and opens the boot to reveal a man blinking up at him  A naked woman stands in silhouette and Bond falls into billowing sand  The wooden gates open and Bond heads down a long straight brick tunnel  Bond disarms Mitchell and kicks the gun away but then gets booted to the ground  A crowd of naked women pose in silhouette around the glaring sun forming circles of bodies that animate into a flickering blur and dissolve away floating through space  A red and yellow checked flag billows in the breeze as a procession of people in bright costumes parades around a square watched by huge crowds  Bond ignores the stairs and takes a flying leap after him  Bond stands in the low light as fine sands flow like liquid and a woman's naked body emerges from the flowing sand  Mitchell drops one agent and as M goes down the horse race starts  He raises his pistol and fires in super slowmotion with the bullet spinning slowly as it flies  Bond is elevated in a pool of light and fires a bullet in a super slowmo burst of smoke with the bulletstream of smoke moving over the sand dunes  Light surrounds the sun and a shadowy Bond aims his pistol with Bond's shadow passing over the dunes  Mitchell pounds down spiral stairs and into water at the base of a tower then dives through an iron gate  Bond turns aiming his gun while a gloomshaped hood of lights surrounds the scene  A red dot travels sideways as a naked woman is silhouetted by the sand lying over the dunes in the halflight  Sand and stars swirl amidst the gloom of light and the grid flexes turns and walks as the sand billows against the starry darkness  Sand swirls in the light while posing highheels form a slowly turning pattern  The red dot travels sideways as the sun flares behind a pile of naked women and the bullet lands in an explosion of sand  Mitchell goes for the gun and runs off as the fast and furious Palio horse race thunders around Siena's main square "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "The red dot travels sideways as the sun flares behind a pile of naked women and the bullet lands in an explosion of sand  A red and yellow checked flag billows in the breeze as a procession of people in bright costumes parades around a square watched by huge crowds  Bond dumps the man from the boot onto a chair in a cellar where M and another agent watch  Bond gulps whiskey while neartired horsemen enter the square laid out as a racetrack  A chair is dragged across a stone floor and Bond sits next to Mr White joined by M  Mitchell drops one agent and as M goes down the horse race starts  Bond leaps on  the man grabs the gun and the prisoner is hit and goes down  Bond disarms Mitchell and kicks the gun away but then gets booted to the ground  Mitchell goes for the gun and runs off as the fast and furious Palio horse race thunders around Siena's main square  Mitchell pounds down spiral stairs and into water at the base of a tower then dives through an iron gate  Bond ignores the stairs and takes a flying leap after him  In the race a rider falls and Bond chases his man down a watery tunnel but a gate bars his way The wooden gates open and Bond heads down a long straight brick tunnel  He stops gets out and opens the boot to reveal a man blinking up at him  Bond is elevated in a pool of light and fires a bullet in a super slowmo burst of smoke with the bulletstream of smoke moving over the sand dunes  Light surrounds the sun and a shadowy Bond aims his pistol with Bond's shadow passing over the dunes  A red dot travels sideways as a naked woman is silhouetted by the sand lying over the dunes in the halflight  Bond stands in the low light as fine sands flow like liquid and a woman's naked body emerges from the flowing sand  Bond turns aiming his gun while a gloomshaped hood of lights surrounds the scene  A naked woman stands in silhouette and Bond falls into billowing sand  Sand and stars swirl amidst the gloom of light and the grid flexes turns and walks as the sand billows against the starry darkness  A crowd of naked women pose in silhouette around the glaring sun forming circles of bodies that animate into a flickering blur and dissolve away floating through space  Sand swirls in the light while posing highheels form a slowly turning pattern  Bond falls towards the expanding people in the eye and sand engulfs a pistol as Bond falls in slow motion onto the sandy ground  He raises his pistol and fires in super slowmotion with the bullet spinning slowly as it flies "
        }
      ]
    }
  ]
}