{
  "ground_truth": "As Bond walks calmly down the corridor, Greene and his party are hurrying for an exit, and they come face to face. On stage, guns are drawn, and the hero is shot as men chase Bond. He runs through a crowded restaurant, and shots are fired, taking down a bystander. Bond waits in ambush, and a pursuer engages in a gun battle in the restaurant. Bond escapes into the kitchen area, where a man body checks him, but Bond shoots him pointblank through the body. He ducks as a door flies open in front of him and tips over a pan of oil, which bursts into flames, allowing him to get past the gunman as the hero dies bloodily on stage. He marches the man away with a gun at his neck, holding him at the edge of a roof. Greene gets in his car, and Bond's prisoner tries to break free, but Bond sends him off the roof, and he lands on Greene's car. Bond straightens his tuxedo as the grim driver gets out and finishes him. In London, an operator is looking at Bond's photos, and M stares at her screen, registering surprise. He walks pensively away from the desk, then goes back, grins, and walks off. Bond is in the back of a powerboat flying an Italian flag at the stern, heading towards a promontory topped by a grand villa overlooking the turquoise blue sea. Bond approaches a stout wooden door, but she can't walk off, so he drops photos on the table and helps himself to white wine. Bond grins as Mathis looks up at his glamorous younger woman, and Bond drains a glass. In a bar on a plane, he looks at a picture of the dead Vespa, picks up a necklace from the bar, and sips a martini. Mathis joins him, and Bond slips the photo into his pocket as they study one another. Bond stays at the bar, and then he and Mathis move through immigration where a redhead in a raincoat stands waiting. They get in a taxi which drives through the busy downtown traffic and gets down from the taxi as Fields strides into a rundown hotel. Bond heads back to the taxi and she obeys, tight-lipped. The statue of an eagle spreads its wings beneath a blue sky dusted with clouds as they are still bickering and are led through the airy tile and marble halls. Bond casually tosses the keys on a sofa and strides through the spacious, modern furnishings eyed by Fields. She stands looking lost while he casts a critical eye over the bedroom and marble en-suite bathroom. He takes off his jacket, walks into the bathroom, Fields grins, and goes to the bedroom. Bond answers the door naked.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "As Bond ambles serenely down the hallway, Greene and his entourage are rushing for an outlet, and they encounter directly. On stage, firearms are brandished, and the protagonist is wounded as men pursue Bond. He sprints through a bustling eatery, and bullets are discharged, bringing down a passerby. Bond lies in ambush, and a chaser participates in a gun duel in the restaurant. Bond flees into the cooking area, where a man body checks him, but Bond shoots him pointblank through the torso. He stoops as a portal bursts open in front of him and tips over a skillet of oil, which ignites, permitting him to bypass the gunman as the protagonist expires bloodily on stage. He marches the man away with a firearm at his neck, holding him at the boundary of a roof. Greene gets in his vehicle, and Bond's captive attempts to escape, but Bond sends him off the roof, and he lands on Greene's vehicle. Bond straightens his dinner jacket as the grim chauffeur gets out and finishes him. In London, an operator is gazing at Bond's images, and M regards her screen, registering shock. He strides pensively away from the worktable, then goes back, grins, and walks off. Bond is in the rear of a speedboat flying an Italian pennant at the stern, heading towards a headland topped by a grand residence overlooking the azure blue sea. Bond approaches a stout wooden door, but she can't depart, so he drops images on the table and helps himself to white wine. Bond grins as Mathis looks up at his glamorous younger woman, and Bond drains a glass. In a lounge on a plane, he looks at a picture of the deceased Vespa, picks up a necklace from the counter, and sips a martini. Mathis joins him, and Bond slips the picture into his pocket as they assess one another. Bond stays at the bar, and then he and Mathis move through immigration where a redhead in a raincoat stands waiting. They get in a cab which drives through the busy downtown traffic and gets down from the cab as Fields strides into a shabby hotel. Bond heads back to the taxi and she complies, tight-lipped. The statue of an eagle spreads its wings beneath a blue sky dusted with clouds as they are still quarreling and are led through the airy tile and marble halls. Bond casually tosses the keys on a couch and strides through the spacious, modern furnishings eyed by Fields. She stands looking lost while he casts a critical eye over the bedroom and marble en-suite bathroom. He takes off his coat, walks into the bathroom, Fields grins, and goes to the bedroom. Bond answers the portal naked."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "As Bond walks calmly down the corridor, an exit is hurried for by Greene and his party, and they come face to face. On stage, men draw guns, and the hero is shot as Bond is chased. He runs through a crowded restaurant, and shots are fired, which take down a bystander. Bond waits in ambush, and a pursuer engages him in a gun battle in the restaurant. An escape is made by Bond into the kitchen area, where he is body-checked by a man, but the man is shot pointblank through the body by Bond. He ducks as a door flies open in front of him and tips over a pan of oil, which bursts into flames, allowing him to get past the gunman as the hero dies bloodily on stage. The man is marched away by him with a gun at his neck, holding him at the edge of a roof. Greene gets in his car, and Bond's prisoner tries to break free, but Bond sends him off the roof, and he lands on Greene's car. Bond straightens his tuxedo as the grim driver gets out and finishes him. In London, Bond's photos are looked at by an operator, and M stares at her screen, registering surprise. He walks pensively away from the desk, then goes back, grins, and walks off. Bond is in the back of a powerboat flying an Italian flag at the stern, heading towards a promontory topped by a grand villa overlooking the turquoise blue sea. A stout wooden door is approached by Bond, but she can't walk off, so photos are dropped on the table by him, and he helps himself to white wine. Bond grins as his glamorous younger woman is looked up at by Mathis, and a glass is drained by Bond. In a bar on a plane, a picture of the dead Vespa is looked at by him, a necklace is picked up from the bar by him, and a martini is sipped by him. Mathis joins him, and the photo is slipped into his pocket by Bond as they study one another. The bar is stayed at by Bond, and then he and Mathis move through immigration where a redhead in a raincoat waits. They get in a taxi which drives through the busy downtown traffic and get down from the taxi as Fields strides into a rundown hotel. Bond heads back to the taxi and she obeys, tight-lipped. Beneath a blue sky dusted with clouds, the wings of a statue of an eagle are spread as they still bicker and are led through the airy tile and marble halls. Bond casually tosses the keys on a sofa and strides through the spacious, modern furnishings while Fields eyes them. She stands looking lost while a critical eye is cast by him over the bedroom and marble en-suite bathroom. His jacket is taken off by him, and he walks into the bathroom; Fields grins and goes to the bedroom. The door is answered by Bond while naked."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "As Bond calmly walks down the corridor, Greene and his group hurry toward an exit, confronting him. On stage, guns are drawn, and the hero is shot amid a chase. Bond dashes through a crowded restaurant, where shots hit a bystander. In ambush, Bond engages in a gunfight, escapes into the kitchen, and body checks a man, shooting him point-blank. He ducks as a door swings open, tipping a pan of oil into flames, and evades a gunman as the hero dies on stage. Holding a man at gunpoint on a roof's edge, Bond sends him off onto Greene's car. Bond adjusts his tuxedo as the driver exits and finishes him. In London, an operator examines Bond's photos, surprising M. Bond pensively leaves the desk, returns, grins, and departs. On a powerboat flying an Italian flag, Bond approaches a villa overseeing the sea. He drops photos on a table, helps himself to wine, grinning at Mathis and his younger woman, draining his glass. In a bar on a plane, Bond looks at a photo of the deceased Vespa, picks up a necklace, and sips a martini. Mathis joins him, and Bond slips the photo into his pocket as they size each other up. Bond remains at the bar, then he and Mathis pass through immigration, where a redhead in a raincoat waits. They ride a taxi through downtown traffic, exiting as Fields strides into a rundown hotel. Bond returns to the taxi, complying with tight-lipped Fields. An eagle statue spreads its wings beneath a cloudy sky as they bicker through airy, marble halls. Bond tosses keys on a sofa and inspects the modern furnishings, watched by Fields. She looks lost while he examines the bedroom and en-suite bathroom. He removes his jacket, heads to the bathroom as Fields grins, and walks to the bedroom. Bond answers the door naked."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Bond walks calmly down the corridor as Greene and his party hurry for an exit, meeting face to face. Guns are drawn on stage; then the hero is shot as men chase Bond through a crowded restaurant, firing shots that down a bystander. Bond waits in ambush and engages in a gun battle, escaping into the kitchen. A man body checks him, but Bond shoots him point-blank. He dodges a door, tips over a pan of oil, causing flames, and passes the gunman. The hero dies bloodily on stage. Bond marches a captured man to a roof's edge with a gun at his neck. Greene gets in his car as Bond's prisoner tries to escape, but Bond throws him off the roof onto Greene's car. Bond straightens his tuxedo as the grim driver finishes him. In London, an operator views Bond's photos, and M registers surprise on her screen. Bond walks pensively away, returns grinning, and leaves. In a powerboat flying an Italian flag, Bond approaches a villa overlooking the sea, drops photos on the table, and helps himself to white wine as Mathis looks up from a younger woman. In a plane bar, Bond examines a photo of the dead Vespa, picks up a necklace, and sips a martini. Mathis joins him, and Bond slips the photo into his pocket as they study each other. They move through immigration, where a redhead in a raincoat waits. After downtown traffic, Fields strides into a rundown hotel, and Bond returns to the taxi, tight-lipped. An eagle statue spreads its wings beneath a blue sky as they argue and enter airy halls. Bond tosses keys on a sofa, walks through a modern space, and Fields looks lost. He surveys the bedroom and marble en-suite, removes his jacket, and enters the bathroom. Fields grins and goes to the bedroom. Bond answers the door naked."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "As Bond strides calmly and confidently down the long, narrow corridor, Greene and his party of men, in a frantic rush, are hurrying towards an exit, and they unexpectedly come face to face with Bond. On the main stage, guns are suddenly drawn, and the hero, tragically, is shot as the men continue to chase Bond. In a tense, dramatic moment, he races through a crowded and bustling restaurant, and amid the chaos, shots are fired, tragically taking down an innocent bystander. Bond waits patiently in ambush, cleverly planning his next move, while a determined pursuer engages in a fierce gun battle right there in the restaurant. Bond makes a daring escape into the kitchen area, where a man aggressively body checks him. However, Bond manages to shoot him at point-blank range, the bullet piercing through the man's body. He skillfully ducks as a door unexpectedly flies open right in front of him and deftly tips over a pan of hot oil, which bursts dramatically into flames, creating a fiery distraction that allows him to slip past the persistent gunman as the hero dies bloodily and tragically on stage. He then confidently marches his captive away with a gun held threateningly at the man's neck, holding him precariously at the very edge of a roof. Greene hastily gets into his car, and Bond's prisoner desperately attempts to break free from Bond's grip, but Bond sends him tumbling off the roof, and he crashes onto Greene's car below. Bond, with a sense of calm composure, straightens his tuxedo as the grim-faced driver steps out and finishes the job. Meanwhile, back in London, an operator is intently looking at Bond's photos, and M stands staring at her screen, registering surprised disbelief. He walks pensively away from the desk, reflecting on the situation, then suddenly goes back, grins mischievously, and confidently walks off. Bond is then seen in the back of a powerboat, which is proudly flying an Italian flag at the stern, heading purposefully towards a scenic promontory topped by a grand, elegant villa that overlooks the breathtaking turquoise blue sea. As Bond approaches a stout wooden door, she finds she can't walk off, so he casually drops photos on the table and then helps himself to a glass of crisp white wine. Bond grins broadly as Mathis looks up at his glamorous, younger female companion, and Bond swiftly drains his glass. Later, in a bar on a plane, he looks thoughtfully at a picture of the deceased Vespa, picks up a delicate necklace from the bar, and takes a long sip of his expertly prepared martini. Mathis eventually joins him, and Bond discreetly slips the photo into his pocket as they study and assess each other intently. Bond remains at the bar for a moment longer, and then he and Mathis make their way through immigration, where a redhead clad in a raincoat is standing patiently, waiting. They get into a taxi, which carefully navigates through the busy downtown traffic, and then they alight from the taxi as Fields strides purposefully into a rundown, shabby hotel. Bond heads back to the taxi, and she follows obediently, albeit tight-lipped. A majestic statue of an eagle spreads its grand wings beneath a vibrant blue sky dusted with fluffy clouds as they continue their bickering and are led through airy tile and marble halls. Bond casually tosses the keys onto a plush sofa and confidently strides through the spacious room, with its modern furnishings eyed with interest by Fields. She stands looking somewhat lost while he casts a critical and discerning eye over the elegantly appointed bedroom and luxurious marble en-suite bathroom. He casually removes his jacket, walks into the bathroom, and then Fields grins playfully as she heads to the bedroom. Bond, in a bold and unselfconscious move, answers the door completely naked."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "As Bond confidently strides down the lengthy, narrow corridor with a calm demeanor, Greene and his entourage of men, who are in a state of frantic haste, rush rapidly toward an exit. Unexpectedly, they come face to face with Bond, creating an unexpected confrontation. On the main stage, guns are suddenly whipped out, and tragically, the hero is shot as the men continue their relentless chase after Bond. In a moment filled with tension and drama, he dashes through a crowded, bustling restaurant, and amid the pandemonium, shots are fired, disastrously taking down an innocent bystander. Bond waits with patient determination in ambush, cleverly plotting his next strategic move, while a resolute pursuer engages in a fierce gunfight right in the heart of the restaurant. Bond executes a daring escape into the kitchen area, but a man aggressively body-checks him. Bond, however, manages to shoot him at close range, the bullet piercing decisively through the man's body. He skillfully ducks just as a door unexpectedly flies open in front of him and deftly tips over a pan filled with hot oil, which bursts into dramatic flames, creating a fiery diversion that allows him to slip past the relentless gunman as the hero meets a bloody and tragic end on stage. He then confidently marches his captive away, holding a gun threateningly at the man's neck, precariously keeping him at the very edge of a rooftop. In the meantime, Greene hastily gets into his car, and Bond's prisoner desperately struggles to break free from Bond's firm grip, but Bond sends him tumbling off the roof, causing him to crash onto Greene's car below. Bond, maintaining a sense of calm composure, straightens his tuxedo as the grim-faced driver steps out and finishes the job. Meanwhile, back in London, an operator is intently examining Bond's photos, and M stands staring at her screen, her expression registering surprised disbelief. He walks pensively away from the desk, reflecting deeply on the situation, then suddenly returns, grins mischievously, and confidently walks off. Bond is then observed in the rear of a powerboat, proudly flying an Italian flag at its stern, as it heads purposefully towards a scenic promontory topped by a grand, elegant villa that overlooks the breathtaking expanse of turquoise blue sea. As Bond approaches a stout wooden door, she discovers she can't walk off, so he casually drops photos on the table and indulgently helps himself to a glass of crisp, refreshing white wine. Bond grins broadly as Mathis looks up at his glamorous, younger female companion, and Bond swiftly drains his glass. Later, in a bar on a plane, he gazes thoughtfully at a picture of the deceased Vespa, picks up a delicate necklace from the bar, and takes a lingering sip of his expertly prepared martini. Mathis eventually joins him, and Bond discreetly slips the photo into his pocket as they study and assess each other with intense scrutiny. Bond remains at the bar for a moment longer, and then he and Mathis proceed through immigration, where a redhead, clad in a raincoat, stands patiently waiting. They get into a taxi, which carefully navigates through the congested downtown traffic, and then they alight from the taxi as Fields strides purposefully into a rundown, shabby hotel. Bond heads back to the taxi, and she follows obediently, albeit without a word. A majestic statue of an eagle spreads its grand wings beneath a vibrant blue sky, which is lightly dusted with fluffy clouds as they continue their bickering and are led through spacious tile and marble halls. Bond casually tosses the keys onto a plush sofa and confidently strides through the spacious room, with its modern furnishings eyed with interest by Fields. She stands looking somewhat lost while he casts a critical and discerning eye over the elegantly appointed bedroom and the luxurious marble en-suite bathroom. He casually removes his jacket, walks into the bathroom, and then Fields grins playfully as she heads to the bedroom. Bond, in a bold and unselfconscious move, answers the door completely naked, exuding confidence and bravado."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "As Bond moves with a calm and composed demeanor down the corridor, Greene and his entourage are in a hurry, making their way toward an exit until they suddenly find themselves directly in front of Bond. On stage, the tension escalates as guns are drawn, and amidst the chaos, the hero is shot while several men initiate a pursuit after Bond. He swiftly navigates through the crowded restaurant, where the high-stakes chase results in gunfire that tragically claims the life of a bystander. Bond strategically positions himself in ambush as one of his pursuers engages him in a gun battle amidst the restaurant's commotion. Seizing an opportunity to escape, Bond darts into the kitchen area, where a confrontation ensues with a man who body checks him, only for Bond to respond by firing a shot through the man's body. As he advances, he ducks swiftly to avoid a door that swings open in front of him and, in his quick thinking, tips over a pan of oil, igniting it into flames that provide a diversion. This fiery obstacle allows Bond to outmaneuver the gunman while, on stage, the hero succumbs to his bloody fate. Bond takes charge of the situation by marching a captive away with a gun pressed to the man's neck, bringing him to the edge of a rooftop. As Greene makes his escape in a car, Bond's prisoner attempts a daring escape himself, only to be sent over the roof's edge by Bond, landing on Greene's car in a dramatic fall. With a sense of composure, Bond straightens his tuxedo as the grim driver emerges to finish his task. Meanwhile, in London, an operator examines Bond's photos on her screen, leading to M registering surprise at the images before her. Bond exhibits a thoughtful pause as he walks slowly away from the desk, only to return, flash a grin, and then walk confidently away. Transitioning scenes, Bond is now situated in the back of a powerboat adorned with an Italian flag at the stern, as it speeds towards a scenic promontory crowned by a grand villa overlooking the strikingly turquoise sea. Bond approaches a substantial wooden door but is unable to proceed further, prompting him to casually place photos on a table and indulge in a glass of white wine. He shares a knowing grin with Mathis, who gazes at his glamorous younger companion, while Bond finishes the wine. Aboard a plane's bar, Bond reflects on a picture of the deceased Vespa, and in a moment tinged with nostalgia, he picks up a necklace from the bar and takes a measured sip of his martini. As Mathis joins him, Bond discreetly slips the photo into his pocket, and they exchange studious glances. Remaining at the bar, Bond eventually joins Mathis as they navigate through immigration, where a redhead in a raincoat waits expectantly. They climb into a taxi, which weaves through the bustling downtown traffic before they alight, following Fields into a rundown hotel. Bond decisively returns to the taxi, leading to Fields' reluctant compliance as she follows, tight-lipped. Beneath a blue sky adorned with clouds, an eagle statue majestically spreads its wings as Bond and Fields continue their heated exchange, eventually being ushered through the airy, tile-and-marble-adorned halls. Bond nonchalantly tosses the keys onto a sofa before confidently striding through a room replete with spacious and modern furnishings that capture Fields' curiosity. As she stands feeling somewhat directionless, Bond appraises the bedroom and the adjoining marble en-suite bathroom with a critical eye. He removes his jacket, making his way into the bathroom, prompting Fields to grin as she heads to the bedroom. In a moment of boldness, Bond answers the door without a stitch of clothing."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "As Bond calmly walks down the corridor, he encounters Greene and his party rushing for an exit. Guns are drawn on stage, and the hero is fatally shot. Bond sprints through a crowded restaurant amidst gunfire, resulting in a bystander's injury. He ambushes a pursuer and flees to the kitchen, where he shoots a man after being body checked. After a fiery distraction allows him to evade another gunman, Bond captures a man and holds him at gunpoint on a rooftop edge. As Greene drives away, Bond sends his prisoner off the roof, who lands on Greene's car before Bond adjusts his tuxedo.\n\nIn London, M is surprised to see Bond's photos on her screen. Bond paces pensively, then returns to the desk with a grin and walks away. Later, he is in a powerboat heading towards a villa on a promontory. Upon arrival, he drops photos on a table, helps himself to wine, and shares a moment with Mathis and a younger woman before draining his glass. On a plane, Bond looks at a picture of the deceased Vespa, picks up a necklace, and sips a martini. Mathis joins him, and Bond discreetly pockets the photo as they assess each other.\n\nBond remains at the bar, then moves through immigration with Mathis, where they meet a redhead in a raincoat. They take a taxi through busy downtown traffic and arrive at a rundown hotel, where Fields enters. Bond returns to the taxi, and Fields, after a brief argument, follows. An eagle statue stands beneath a blue sky as they are led through grand halls. Bond throws the keys onto a sofa, surveys the modern furnishings, and evaluates the bedroom and en-suite bathroom. He removes his jacket, heads to the bathroom, and Fields heads to the bedroom, grinning. Bond answers the door unclothed."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "As Bond, the legendary British spy known for his calm demeanor, walks calmly down the corridor, Greene, a notorious environmentalist villain with dubious intentions, and his party are hurrying for an exit, and they come face to face. On stage, guns are drawn, and the hero, likely a key figure in Greene's plot, is shot as men chase Bond. He runs through a crowded restaurant in a bustling European city known for its culinary delights, and shots are fired, taking down a bystander. Bond waits in ambush, reminiscent of his tactical training in MI6, and a pursuer engages in a gun battle in the restaurant. Bond escapes into the kitchen area, where a man body checks him, a technique possibly learned in military combat, but Bond shoots him pointblank through the body. He ducks as a door flies open in front of him and tips over a pan of oil, which bursts into flames, creating a fiery distraction, allowing him to get past the gunman as the hero dies bloodily on stage. He marches the man away with a gun at his neck, holding him at the edge of a roof reminiscent of classic spy thrillers. Greene gets in his car, a sleek vehicle befitting a villain of his status, and Bond's prisoner tries to break free, but Bond sends him off the roof, and he lands on Greene's car with a loud thud. Bond straightens his tuxedo with the nonchalance of a seasoned spy as the grim driver gets out and finishes him. In London, the epicenter of global intelligence operations, an operator is looking at Bond's photos, and M, the head of MI6, stares at her screen, registering surprise. He walks pensively away from the desk, then goes back, grins, and walks off. Bond is in the back of a powerboat flying an Italian flag at the stern, headed towards a picturesque Mediterranean promontory topped by a grand villa overlooking the turquoise blue sea. Bond approaches a stout wooden door, but she can't walk off, so he drops photos on the table and helps himself to white wine, an Italian vintage renowned in the region. Bond grins as Mathis, an old ally with a complex history, looks up at his glamorous younger woman, and Bond drains a glass. In a bar on a plane, he looks at a picture of the dead Vespa, an unresolved chapter in his life, picks up a necklace from the bar, and sips a martini, famously shaken not stirred. Mathis joins him, and Bond slips the photo into his pocket as they study one another. Bond stays at the bar, and then he and Mathis move through immigration where a redhead in a raincoat, possibly a covert contact, stands waiting. They get in a taxi which drives through the busy downtown traffic of a city known for its chaotic streets and gets down from the taxi as Fields, a fellow agent, strides into a rundown hotel. Bond heads back to the taxi and she obeys, tight-lipped, aware of the risks involved. The statue of an eagle, symbolizing power and freedom, spreads its wings beneath a blue sky dusted with clouds as they are still bickering and are led through the airy tile and marble halls, reminiscent of a grand yet secretive government building. Bond casually tosses the keys on a sofa and strides through the spacious, modern furnishings eyed by Fields. She stands looking lost while he casts a critical eye over the bedroom and marble en-suite bathroom, a mark of his discerning taste. He takes off his jacket, walks into the bathroom, Fields grins, and goes to the bedroom. Bond answers the door naked, confident in his vulnerability, a hallmark of his character."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "He takes off his jacket walks into the bathroom As Bond walks calmly down the corridor Greene and his party are hurrying for an exit and they come face to face Bond casually tosses the keys on a sofa and strides through the spacious modern furnishings eyed by Fields On stage guns are drawn and the hero is shot as men chase Bond The statue of an eagle spreads its wings beneath a blue sky dusted with clouds as they are still bickering and are led through the airy tile and marble halls He runs through a crowded restaurant and shots are fired taking down a bystander Bond waits in ambush and a pursuer engages in a gun battle in the restaurant Bond escapes into the kitchen area where a man body checks him but Bond shoots him pointblank through the body Bond waits in ambush and a pursuer engages in a gun battle in the restaurant As Bond walks calmly down the corridor Greene and his party are hurrying for an exit and they come face to face In a bar on a plane he looks at a picture of the dead He ducks as a door flies open in front of him and tips over a pan of oil which bursts into flames allowing him to get past the gunman as the hero dies bloodily on stage He marches the man away with a gun at his neck holding him at the edge of a roof Greene gets in his car and Bond's prisoner tries to break free but Bond sends him off the roof and he lands on Greene's car Bond escapes into the kitchen area where a man body checks him but Bond shoots him pointblank through the body Bond straightens his tuxedo as the grim driver gets out and finishes him Bond stays at the bar and then he and Mathis move through immigration where a redhead in a raincoat stands waiting In London an operator is looking at Bond's photos and M stares at her screen registering surprise He walks pensively away from the desk then goes back grins and walks off Bond grins as Mathis looks up at his glamorous younger woman and Bond drains a glass Bond is in the back of a powerboat flying an Italian flag at the stern heading towards a promontory topped by a grand villa overlooking the turquoise blue sea Bond approaches a stout wooden door but she cannot walk off so he drops photos on the table and helps himself to white wine Bond straightens his tuxedo as the grim driver gets out and finishes him Bond grins as Mathis looks up at his glamorous younger woman and Bond drains a glass In a bar on a plane he looks at a picture of the dead Greene gets in his car and Bond's prisoner tries to break free but Bond sends him off the roof and he lands on Greene's car Vespa picks up a necklace from the bar and sips a martini Mathis joins him and Bond slips the photo into his pocket as they study one another Bond stays at the bar and then he and Mathis move through immigration where a redhead in a raincoat stands waiting They get in a taxi which drives through the busy downtown traffic and gets down from the taxi as Fields strides into a rundown hotel Fields grins and goes to the bedroom He runs through a crowded restaurant and shots are fired taking down a bystander Bond heads back to the taxi and she obeys tightlipped The statue of an eagle spreads its wings beneath a blue sky dusted with clouds as they are still bickering and are led through the airy tile and marble halls Bond casually tosses the keys on a sofa and strides through the spacious modern furnishings eyed by Fields She stands looking lost while he casts a critical eye over the bedroom and marble ensuite bathroom He takes off his jacket walks into the bathroom Fields grins and goes to the bedroom Bond answers the door naked"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "As Bond walks calmly down the corridor Greene and his party are hurrying for an exit and they come face to face. On stage guns are drawn and the hero is shot as men chase Bond. He runs through a crowded restaurant and shots are fired taking down a bystander. Bond waits in ambush and a pursuer engages in a gun battle in the restaurant. Bond escapes into the kitchen area where a man body checks him but Bond shoots him pointblank through the body. He ducks as a door flies open in front of him and tips over a pan of oil which bursts into flames allowing him to get past the gunman as the hero dies bloodily on stage. He marches the man away with a gun at his neck holding him at the edge of a roof. Greene gets in his car and Bond's prisoner tries to break free but Bond sends him off the roof and he lands on Greene's car. Bond straightens his tuxedo as the grim driver gets out and finishes him. In London an operator is looking at Bond's photos and M stares at her screen registering surprise. He walks pensively away from the desk then goes back grins and walks off. Bond is in the back of a powerboat flying an Italian flag at the stern heading towards a promontory topped by a grand villa overlooking the turquoise blue sea. Bond approaches a stout wooden door but she cannot walk off so he drops photos on the table and helps himself to white wine. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. Bond grins as Mathis looks up at his glamorous younger woman and Bond drains a glass. In a bar on a plane he looks at a picture of the dead. Vespa picks up a necklace from the bar and sips a martini. Mathis joins him and Bond slips the photo into his pocket as they study one another. Bond stays at the bar and then he and Mathis move through immigration where a redhead in a raincoat stands waiting. They get in a taxi which drives through the busy downtown traffic and gets down from the taxi as Fields strides into a rundown hotel. Bond heads back to the taxi and she obeys tightlipped. The statue of an eagle spreads its wings beneath a blue sky dusted with clouds as they are still bickering and are led through the airy tile and marble halls. Bond casually tosses the keys on a sofa and strides through the spacious modern furnishings eyed by Fields. She stands looking lost while he casts a critical eye over the bedroom and marble ensuite bathroom. He takes off his jacket walks into the bathroom. Fields grins and goes to the bedroom. Bond answers the door naked."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "As Bond walks calmly down the corridor Greene and his party are hurrying for an exit and they come face to face. On stage guns are drawn and the hero is shot as men chase Bond. He runs through a crowded restaurant and shots are fired taking down a bystander. Bond waits in ambush and a pursuer engages in a gun battle in the restaurant. Bond escapes into the kitchen area where a man body checks him but Bond shoots him pointblank through the body. He ducks as a door flies open in front of him and tips over a pan of oil which bursts into flames allowing him to get past the gunman as the hero dies bloodily on stage. He marches the man away with a gun at his neck holding him at the edge of a roof. Greene gets in his car and Bond's prisoner tries to break free but Bond sends him off the roof and he lands on Greene's car. Bond straightens his tuxedo as the grim driver gets out and finishes him. In London an operator is looking at Bond's photos and M stares at her screen registering surprise. He walks pensively away from the desk then goes back grins and walks off. Bond is in the back of a powerboat flying an Italian flag at the stern heading towards a promontory topped by a grand villa overlooking the turquoise blue sea. Bond approaches a stout wooden door but she cannot walk off so he drops photos on the table and helps himself to white wine. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. Bond grins as Mathis looks up at his glamorous younger woman and Bond drains a glass. In a bar on a plane he looks at a picture of the dead. Vespa picks up a necklace from the bar and sips a martini. Mathis joins him and Bond slips the photo into his pocket as they study one another. Bond stays at the bar and then he and Mathis move through immigration where a redhead in a raincoat stands waiting. They get in a taxi which drives through the busy downtown traffic and gets down from the taxi as Fields strides into a rundown hotel. Bond heads back to the taxi and she obeys tightlipped. The statue of an eagle spreads its wings beneath a blue sky dusted with clouds as they are still bickering and are led through the airy tile and marble halls. Bond casually tosses the keys on a sofa and strides through the spacious modern furnishings eyed by Fields. She stands looking lost while he casts a critical eye over the bedroom and marble ensuite bathroom. He takes off his jacket walks into the bathroom. Fields grins and goes to the bedroom. Bond answers the door naked."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "As Bond walks calmly down the corridor Greene and his party are hurrying for an exit and they come face to face. On stage guns are drawn and the hero is shot as men chase Bond. He runs through a crowded restaurant and shots are fired taking down a bystander. Bond waits in ambush and a pursuer engages in a gun battle in the restaurant. Bond escapes into the kitchen area where a man body checks him but Bond shoots him pointblank through the body. He ducks as a door flies open in front of him and tips over a pan of oil which bursts into flames allowing him to get past the gunman as the hero dies bloodily on stage. He marches the man away with a gun at his neck holding him at the edge of a roof. The statue of an eagle spreads its wings beneath a blue sky dusted with clouds as they are still bickering and are led through the airy tile and marble halls. Bond casually tosses the keys on a sofa and strides through the spacious modern furnishings eyed by Fields. She stands looking lost while he casts a critical eye over the bedroom and marble ensuite bathroom. He takes off his jacket walks into the bathroom. Fields grins and goes to the bedroom. Bond answers the door naked."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "As Bond walks calmly down the corridor Greene and his party are hurrying for an exit and they come face to face. On stage guns are drawn and the hero is shot as men chase Bond. He runs through a crowded restaurant and shots are fired taking down a bystander. He takes off his jacket walks into the bathroom. Fields grins and goes to the bedroom. Bond answers the door naked."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "As a panda walks calmly down the corridor, a dolphin and its party are hurrying for an exit, and they come face to face. On stage, guns are drawn, and a rabbit is shot as squirrels chase the panda. The panda runs through a crowded restaurant, and shots are fired, taking down a bystander. The panda waits in ambush, and a parrot engages in a gun battle in the restaurant. The panda escapes into the kitchen area, where a kangaroo body checks it, but the panda shoots the kangaroo pointblank through the body. The panda ducks as a door flies open in front of it and tips over a pan of oil, which bursts into flames, allowing the panda to get past the gunman as the rabbit dies bloodily on stage. The panda marches the kangaroo away with a gun at its neck, holding it at the edge of a roof. The dolphin gets in its car, and the panda's prisoner tries to break free, but the panda sends the prisoner off the roof, and it lands on the dolphin's car. The panda straightens its tuxedo as the grim driver gets out and finishes the prisoner. In London, a giraffe is looking at the panda's photos, and an owl stares at its screen, registering surprise. The panda walks pensively away from the desk, then goes back, grins, and walks off. The panda is in the back of a powerboat flying an Italian flag at the stern, heading towards a promontory topped by a grand villa overlooking the turquoise blue sea. The panda approaches a stout wooden door, but it can't walk off, so the panda drops photos on the table and helps itself to white wine. The panda grins as a dragon looks up at its glamorous younger woman, and the panda drains a glass. In a bar on a plane, the panda looks at a picture of the dead Vespa, picks up a necklace from the bar, and sips a martini. The dragon joins the panda, and the panda slips the photo into its pocket as they study one another. The panda stays at the bar, and then it and the dragon move through immigration where a redhead in a raincoat stands waiting. They get in a taxi which drives through the busy downtown traffic and gets down from the taxi as a zebra strides into a rundown hotel. The panda heads back to the taxi and the zebra obeys, tight-lipped. The statue of an eagle spreads its wings beneath a blue sky dusted with clouds as the panda and the zebra are still bickering and are led through the airy tile and marble halls. The panda casually tosses the keys on a sofa and strides through the spacious, modern furnishings eyed by the zebra. The zebra stands looking lost while the panda casts a critical eye over the bedroom and marble en-suite bathroom. The panda takes off its jacket, walks into the bathroom, the zebra grins, and goes to the bedroom. The panda answers the door naked."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "As Bond walks calmly down the pathway, Greene and his party are hurrying for an exit, and they come face to face. On stage, bows are drawn, and the hero is shot as men chase Bond. He runs through a crowded marketplace, and shots are fired, taking down a bystander. Bond waits in ambush, and a pursuer engages in a gun battle in the marketplace. Bond escapes into the study area, where a man body checks him, but Bond shoots him pointblank through the torso. He ducks as a curtain flies open in front of him and tips over a jug of water, which bursts into steam, allowing him to get past the gunman as the hero dies bloodily on stage. He marches the man away with a gun at his neck, holding him at the edge of a balcony. Greene gets in his bicycle, and Bond's prisoner tries to break free, but Bond sends him off the balcony, and he lands on Greene's bicycle. Bond straightens his jacket as the grim rider gets out and finishes him. In London, an operator is looking at Bond's sketches, and M stares at her map, registering surprise. He walks pensively away from the table, then goes back, grins, and walks off. Bond is in the back of a helicopter flying an Italian flag at the tail, heading towards a hilltop topped by a grand museum overlooking the turquoise blue river. Bond approaches a stout wooden gate, but she can't walk off, so he drops sketches on the counter and helps himself to white tea. Bond grins as Mathis looks up at his glamorous younger woman, and Bond drains a cup. In a lounge on a train, he looks at a picture of the dead Vespa, picks up a watch from the lounge, and sips a soda. Mathis joins him, and Bond slips the picture into his pocket as they study one another. Bond stays at the lounge, and then he and Mathis move through customs where a redhead in a trench coat stands waiting. They get in a motorcycle which rides through the busy suburban traffic and gets down from the motorcycle as Fields strides into a rundown warehouse. Bond heads back to the motorcycle and she obeys, tight-lipped. The statue of a lion spreads its wings beneath a blue sky dusted with clouds as they are still bickering and are led through the airy brick and stone halls. Bond casually tosses the keys on a chair and strides through the spacious, modern furnishings eyed by Fields. She stands looking lost while he casts a critical eye over the parlor and stone en-suite bathroom. He takes off his watch, walks into the bathroom, Fields grins, and goes to the parlor. Bond answers the door barefoot."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "As Bond strolls indifferently down the corridor, Greene and his party are drifting toward an exit, and they bump into each other. On stage, guns are waved, and the hero is applauded as men trail Bond. He skips through a crowded restaurant and glasses are broken, startling a bystander. Bond hides behind a column, and a pursuer participates in a dance in the restaurant. Bond maneuvers into the kitchen area, where a man high-fives him, but Bond ignores him completely. He crouches as a door swings open in front of him and slides under a table, which shatters into pieces, allowing him to slip past the gunman as the hero bows dramatically on stage. He escorts the man away with a hand on his shoulder, holding him at the edge of a roof. Greene sits in his car, and Bond's prisoner attempts to negotiate, but Bond drops him from the roof, and he bounces off Greene's car. Bond adjusts his cufflinks as the desolate driver gets out and salutes him. In London, an operator is shuffling Bond's photos, and M glances at her screen, exhibited bemusement. He wanders thoughtfully away from the desk, then pauses, smirks, and resumes walking. Bond is in the back of a powerboat displaying an Italian flag at the stern, cruising towards a promontory crowned by a grand villa overlooking the turquoise blue sea. Bond nears a sturdy wooden door, but she can't sit still, so he scatters photos on the table and pours himself white wine. Bond chuckles as Mathis glances up at his glamorous younger woman, and Bond fills a glass. In a bar on a plane, he examines a picture of the late Vespa, retrieves a necklace from the bar, and tastes a martini. Mathis approaches him, and Bond tucks the photo into his pocket as they assess one another. Bond lingers at the bar, and then he and Mathis pass through customs where a redhead in a raincoat stands waiting. They get into a taxi which navigates through the busy downtown traffic and exits the taxi as Fields ambles into a rundown hotel. Bond heads over to the taxi and she complies, stone-faced. The statue of an eagle stretches its wings beneath a blue sky brushed with clouds as they continue debating and are escorted through the airy tile and marble halls. Bond casually tosses the keys on a sofa and wanders through the spacious, modern furnishings eyed by Fields. She stands appearing puzzled while he casts an evaluating eye over the bedroom and marble en-suite bathroom. He removes his jacket, strolls into the bathroom, Fields chuckles, and heads to the bedroom. Bond greets the door shirtless."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "As the saxophone walks calmly down the garden, the refrigerator and its orchestra are hurrying for a window, and they come face to face. On canvas, violins are drawn, and the bicycle is shot as clouds chase the saxophone. It runs through a crowded balloon, and arrows are fired, taking down a lamppost. The saxophone waits in ambush, and a shadow engages in a battle in the balloon. It escapes into the library area, where a chair body checks it, but the saxophone shoots it pointblank through the maze. It ducks as a window flies open in front of it and tips over a pan of honey, which bursts into fireworks, allowing it to get past the cloud as the bicycle dies cheerfully on canvas. It marches the chair away with a violin at its shoulder, holding it at the edge of a flowerpot. The refrigerator gets in its bicycle, and the saxophone's chair tries to break free, but the saxophone sends it off the flowerpot, and it lands on the refrigerator's bicycle. The saxophone straightens its apron as the cheerful umbrella gets out and finishes it. In Paris, a pillow is looking at the saxophone's paintings, and T peers at its rug, registering delight. It walks pensively away from the carton, then goes back, whistles, and walks off. The saxophone is in the back of a hot air balloon flying a Swedish curtain at the mast, heading towards a pancake topped by a grand sculpture overlooking the salmon pink river. The saxophone approaches a slender iron window, but it can't waltz off, so it drops paintings on the chair and helps itself to green tea. The saxophone whistles as the suitcase looks up at its clumsy older tree, and the saxophone drains a mug. In a park on a train, it looks at a painting of the silent grapefruit, picks up a shoelace from the park, and sips a lemonade. The suitcase joins it, and the saxophone slips the painting into its hat as they survey one another. The saxophone stays at the park, and then it and the suitcase move through the aquarium where a squirrel in a swimsuit stands waiting. They get in a tractor which drives through the quiet suburban fields and gets down from the tractor as Leaves strides into a bustling theater. The saxophone heads back to the tractor and it obeys, narrow-eyed. The sculpture of a lion spreads its paws beneath a purple sky dusted with balloons as they are still singing and are led through the wide carpet and wooden bridges. The saxophone casually tosses the maps on a bookshelf and strides through the cramped, cottage furnishings eyed by Leaves. It stands looking found while the saxophone casts a playful eye over the balcony and stone en-suite terrace. It takes off its shirt, glides into the terrace, Leaves whistles, and skips to the balcony. The saxophone answers the window painted."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "As the detective strolls nervously down the corridor, the tourists and their entourage are jogging for an entrance, and they collide face to face. On stage, bows are raised, and the villain is caught as children observe the detective. She dances through a quiet restaurant, and alarms are triggered, scaring a spectator. The detective hides in a nook, and a guard initiates a fistfight in the restaurant. The detective flees into the dining area, where a woman intercepts her, but the detective punches her pointblank through the torso. She crouches as a window slams open in front of her and spills over a pot of water, which erupts into steam, enabling her to slip past the guard as the villain perishes tragically on stage. She escorts the woman out with a knife at her wrist, dragging her to the edge of a balcony. The tourists climb in their bus, and the detective's companion tries to break away, but the detective tosses her off the balcony, and she lands on the tourists' bus. The detective adjusts her coat as the cheerful chauffeur hops out and greets her. In Paris, an engineer is reviewing the detective's documents, and W frowns at her monitor, displaying confusion. She ambles thoughtfully away from the table, then returns, smirks, and ambles off. The detective is in the front of a sailboat waving a British flag at the prow, heading towards a cliffside crowned by a grand mansion overlooking the crystal blue ocean. The detective arrives at a delicate wooden gate, but he can't drift off, so she scatters files on the chair and pours herself some red wine. The detective smirks as Smith glances up at his mysterious older friend, and the detective downs a bottle. In a lounge on a train, she glimpses a picture of the living Pisa, grabs a bracelet from the lounge, and gulps a soda. Smith approaches her, and the detective slides the picture into her folder as they examine one another. The detective lingers at the counter, and then she and Smith navigate through customs where a brunette in a trench coat stands waiting. They hop in a convertible which cruises through the silent suburban lanes and gets out from the convertible as Rivers wanders into a grand hotel. The detective strolls back to the convertible and he follows, open-mouthed. The sculpture of a lion folds its wings beneath a red sky sprinkled with stars as they are gently debating and are escorted through the narrow stone and gravel corridors. The detective gently places the papers on a couch and slips through the cramped, traditional ornaments glanced at by Rivers. He stands appearing confident while she casts an analytic gaze over the kitchen and stone private office. He puts on his vest, marches into the office, Rivers nods, and proceeds to the dining room. The detective opens the window dressed."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "As Bond meanders serenely through the hallway, Greene and his group are scurrying for a portal, and they encounter face to face. On stage, swords are unsheathed, and the hero is wounded as men track Bond. He darts through a bustling library, and arrows are loosed, felling a passerby. Bond lies in wait, and a pursuer dives in a sword clash in the library. Bond slips into the pantry area, where a man shoulder-bumps him, but Bond strikes him down with a blunt object through the chest. He dodges as a window swings open in front of him and spills over a jug of water, which evaporates into steam, allowing him to bypass the swordsman as the hero perishes violently on stage. He escorts the man away with a dagger at his side, holding him at the tip of a balcony. Greene boards his train, and Bond's captive attempts to flee, but Bond sends him off the balcony, and he lands on Greene’s train. Bond adjusts his blazer as the stern conductor exits and concludes the task. In London, an analyst is examining Bond's sketches, and M gazes at her monitor, registering astonishment. He wanders thoughtfully from the workspace, then returns, smirks, and strides away. Bond is in the rear of a sailboat flying a French flag at the bow, heading towards a cliff topped by an opulent mansion overlooking the emerald green ocean. Bond advances to a heavy iron gate, but she can't stray away, so he drops sketches on the counter and pours himself red juice. Bond smirks as Mathis glances up at his chic older companion, and Bond gulps a glass. In a diner on a train, he studies an image of the deceased bicycle, picks up a bracelet from the counter, and savors a smoothie. Mathis approaches him, and Bond tucks the image into his wallet as they examine one another. Bond lingers at the counter, and then he and Mathis proceed through customs where a brunette in a trench coat stands anticipating. They hop in a carriage which glides through the bustling suburban paths and steps down from the carriage as Fields marches into a shabby motel. Bond returns to the carriage, and she complies, tight-lipped. The sculpture of a lion extends its claws beneath a clear sky adorned with stars as they remain arguing and are guided through the lofty stone and granite corridors. Bond nonchalantly flings the pen on a chair and strides through the vast, contemporary decor eyed by Fields. She stands appearing bewildered while he casts a discerning glance over the lounge and limestone en-suite chamber. He removes his hat, wanders into the chamber, Fields chuckles, and goes to the lounge. Bond opens the entrance undressed."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "As the rabbit hops cheerfully down the staircase, Tulip and her orchestra are sprinting for a portal, and they meet face to face. On the catwalk, bows are notched, and the villain is hit as women pursue the rabbit. It hops through a bustling library, and arrows are loosed, striking a passerby. The rabbit pauses in ambush, and a chaser engages in an archery duel in the library. The rabbit hops into the pantry area, where a woman hip-checks it, but the rabbit tosses a carrot pointblank through the arm. It crouches as a curtain flutters open ahead of it and nudges over a bucket of water, which explodes into steam, allowing it to slip past the archer as the villain perishes messily on the catwalk. It strolls the woman away with an umbrella at her knee, guiding her to the rim of a cliff. Tulip leaps into her bicycle, and the rabbit's detainee attempts to wriggle free, but the rabbit nudges her off the cliff, and she descends onto Tulip's bicycle. The rabbit adjusts its apron as the cheerful conductor steps out and finishes her. In Tokyo, a baker is reading the rabbit's journals, and V frowns at her tablet, expressing astonishment. It strolls thoughtfully away from the counter, then returns, chuckles, and skips away. The rabbit is in the center of a hot air balloon hoisting a Japanese banner at the bow, gliding towards a peninsula crowned by a sprawling chalet overlooking the emerald green lagoon. The rabbit approaches a sturdy iron gate, but he can't hop away, so it drops journals on the chair and helps itself to lemonade. The rabbit chuckles as Marcus glances up at his witty elder gentleman, and the rabbit empties a cup. In a lounge on a train, it gazes at an image of the deceased Dove, snatches up a bracelet from the counter, and sips a soda. Marcus joins it, and the rabbit slides the image into its pocket as they scrutinize each other. The rabbit lingers at the lounge, and then it and Marcus proceed through customs where a brunette in a trench coat stands awaiting. They hop into a scooter which zips through the bustling cityscape and hops down from the scooter as Leaves strides into a dilapidated hostel. The rabbit skips back to the scooter and he complies, frowning. The sculpture of a lion extends its paws beneath a crimson sky brushed with mist as they continue squabbling and are led through the breezy brick and granite archways. The rabbit nonchalantly flings the remote on a hammock and prances through the expansive, vintage decorations scrutinized by Leaves. He stands feeling puzzled while it casts a discerning glance over the office and granite kitchenette. It hangs up its scarf, strides into the kitchenette, Leaves chuckles, and wanders to the office. The rabbit answers the window barefoot."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "As Bond calmly walks down the corridor, he encounters Greene and his party trying to flee. Guns are drawn, and a hero on stage is shot. Bond runs through a busy restaurant, engages in a gunfight, and escapes to the kitchen. There, he shoots a man, causing a fiery distraction with spilled oil. Bond captures a pursuer, marches him to a rooftop, and throws him onto Greene's car below. In London, M is surprised by Bond's photos as Bond walks away with a grin. Bond, on a powerboat, approaches a villa and drops photos on a table, sharing wine with Mathis. Later, in a plane bar, he looks at a picture of Vespa and sips a martini. Bond and Mathis then move through immigration, meet a redhead, and are driven to a rundown hotel with Fields. Bond inspects the modern furnishings and bathroom, amusing Fields, before answering the door unclothed."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Bond answers the door naked Fields grins and goes to the bedroom He takes off his jacket walks into the bathroom She stands looking lost while he casts a critical eye over the bedroom and marble ensuite bathroom Bond casually tosses the keys on a sofa and strides through the spacious modern furnishings eyed by Fields The statue of an eagle spreads its wings beneath a blue sky dusted with clouds as they are still bickering and are led through the airy tile and marble halls Bond heads back to the taxi and she obeys tightlipped They get in a taxi which drives through the busy downtown traffic and gets down from the taxi as Fields strides into a rundown hotel Bond stays at the bar and then he and Mathis move through immigration where a redhead in a raincoat stands waiting Mathis joins him and Bond slips the photo into his pocket as they study one another Vespa picks up a necklace from the bar and sips a martini In a bar on a plane he looks at a picture of the dead Bond grins as Mathis looks up at his glamorous younger woman and Bond drains a glass Bond approaches a stout wooden door but she cannot walk off so he drops photos on the table and helps himself to white wine Bond is in the back of a powerboat flying an Italian flag at the stern heading towards a promontory topped by a grand villa overlooking the turquoise blue sea He walks pensively away from the desk then goes back grins and walks off In London an operator is looking at Bond's photos and M stares at her screen registering surprise Bond straightens his tuxedo as the grim driver gets out and finishes him Greene gets in his car and Bond's prisoner tries to break free but Bond sends him off the roof and he lands on Greene's car He marches the man away with a gun at his neck holding him at the edge of a roof He ducks as a door flies open in front of him and tips over a pan of oil which bursts into flames allowing him to get past the gunman as the hero dies bloodily on stage Bond escapes into the kitchen area where a man body checks him but Bond shoots him pointblank through the body Bond waits in ambush and a pursuer engages in a gun battle in the restaurant He runs through a crowded restaurant and shots are fired taking down a bystander On stage guns are drawn and the hero is shot as men chase Bond As Bond walks calmly down the corridor Greene and his party are hurrying for an exit and they come face to face"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Mathis joins him and Bond slips the photo into his pocket as they study one another Bond approaches a stout wooden door but she cannot walk off so he drops photos on the table and helps himself to white wine In London an operator is looking at Bond's photos and M stares at her screen registering surprise Bond answers the door naked Bond heads back to the taxi and she obeys tightlipped He marches the man away with a gun at his neck holding him at the edge of a roof He ducks as a door flies open in front of him and tips over a pan of oil which bursts into flames allowing him to get past the gunman as the hero dies bloodily on stage He walks pensively away from the desk then goes back grins and walks off Vespa picks up a necklace from the bar and sips a martini She stands looking lost while he casts a critical eye over the bedroom and marble ensuite bathroom Bond is in the back of a powerboat flying an Italian flag at the stern heading towards a promontory topped by a grand villa overlooking the turquoise blue sea They get in a taxi which drives through the busy downtown traffic and gets down from the taxi as Fields strides into a rundown hotel On stage guns are drawn and the hero is shot as men chase Bond In a bar on a plane he looks at a picture of the dead He takes off his jacket walks into the bathroom Bond grins as Mathis looks up at his glamorous younger woman and Bond drains a glass He runs through a crowded restaurant and shots are fired taking down a bystander Bond stays at the bar and then he and Mathis move through immigration where a redhead in a raincoat stands waiting Fields grins and goes to the bedroom Bond escapes into the kitchen area where a man body checks him but Bond shoots him pointblank through the body Bond casually tosses the keys on a sofa and strides through the spacious modern furnishings eyed by Fields Greene gets in his car and Bond's prisoner tries to break free but Bond sends him off the roof and he lands on Greene's car Bond straightens his tuxedo as the grim driver gets out and finishes him As Bond walks calmly down the corridor Greene and his party are hurrying for an exit and they come face to face Bond waits in ambush and a pursuer engages in a gun battle in the restaurant The statue of an eagle spreads its wings beneath a blue sky dusted with clouds as they are still bickering and are led through the airy tile and marble halls"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Bond grins as Mathis looks up at his glamorous younger woman and Bond drains a glass In a bar on a plane he looks at a picture of the dead Vespa picks up a necklace from the bar and sips a martini Mathis joins him and Bond slips the photo into his pocket as they study one another Bond stays at the bar and then he and Mathis move through immigration where a redhead in a raincoat stands waiting They get in a taxi which drives through the busy downtown traffic and gets down from the taxi as Fields strides into a rundown hotel Bond heads back to the taxi and she obeys tightlipped The statue of an eagle spreads its wings beneath a blue sky dusted with clouds as they are still bickering and are led through the airy tile and marble halls Bond casually tosses the keys on a sofa and strides through the spacious modern furnishings eyed by Fields She stands looking lost while he casts a critical eye over the bedroom and marble ensuite bathroom He takes off his jacket walks into the bathroom Fields grins and goes to the bedroom Bond answers the door naked As Bond walks calmly down the corridor Greene and his party are hurrying for an exit and they come face to face On stage guns are drawn and the hero is shot as men chase Bond He runs through a crowded restaurant and shots are fired taking down a bystander Bond waits in ambush and a pursuer engages in a gun battle in the restaurant Bond escapes into the kitchen area where a man body checks him but Bond shoots him pointblank through the body He ducks as a door flies open in front of him and tips over a pan of oil which bursts into flames allowing him to get past the gunman as the hero dies bloodily on stage He marches the man away with a gun at his neck holding him at the edge of a roof Greene gets in his car and Bond's prisoner tries to break free but Bond sends him off the roof and he lands on Greene's car Bond straightens his tuxedo as the grim driver gets out and finishes him In London an operator is looking at Bond's photos and M stares at her screen registering surprise He walks pensively away from the desk then goes back grins and walks off Bond is in the back of a powerboat flying an Italian flag at the stern heading towards a promontory topped by a grand villa overlooking the turquoise blue sea Bond approaches a stout wooden door but she cannot walk off so he drops photos on the table and helps himself to white wine"
        }
      ]
    }
  ]
}