{
  "ground_truth": "Mathis hands him an envelope. Tousle-headed Bond puts down his champagne glass and heads back to the bedroom. He kisses her naked back. She smiles and turns her face towards him. He pulls her back down onto a bed. DJ plays under a full moon. Trays are being served and cocktails sipped. A Range Rover pulls up at the entrance. Bond gets out, accompanied by Fields in a glamorous black and gold dress. He moves through the press of glamorous party-goers. He shakes another hand. CIA agent Felix watches from a sofa. They look down from a stone balustrade. She kisses him and he shoves her hard against the crumbling stonework. The thin German arrives. Fields passes. The CIA men are sitting together. He belts up as he goes around to the driver's side of the Range Rover. Motorcyclists follow them. He parks the car. The two motorcycle cops pull up behind. Bond hands over his license to the cop who is wearing dark glasses at night. As he opens it, the cop draws. Mathis is lying in the trunk. Bond pulls the unconscious man out. With his colleague’s gun, throws the other down, calmly shoots him and empties the gun and tosses it aside. Bond cradles him in his arms. Camille watches them. His head slumps against Bond's shoulder. Expressionlessly, Bond feels for a pulse. Camille shifts uneasily. He drops the body in a dumpster, removes Mathis’ wallet from his jacket, takes out the cash, and tosses the wallet aside. They walk off, leaving the body slumped amid the rubbish bags in the dumpster. The Range Rover heads down a desert highway. M stares coldly. The Range Rover drives through the dusty, barren. It arrives at a small airstrip. The man, in a leather jacket and brimmed hat, is. He turns as Bond his jacket to cover a bloodstain on his shirt. Bond looks at an old propeller transport plane as Camille gets out of the car. The ageing DC-3 Dakota lumbers down the runway, raising a cloud of dust in it. The man in a hat is already on the phone as the old plane takes to the air. A fighter streaks past them and banks for another pass. Bond puts the plane into the dive, working the controls furiously as the fighter loops to get behind them. The fighter streaks in. Bond flies down into a valley. Camille looks alarmed, and Bond concentrates hard as they skim the valley floor. He lowers the undercarriage. They hit the ground hard. He pulls the throttle back open. The fighter hurtles down the valley after them, perilously close to a rocky outcrop. Fields gets out of her seat and moves down the plane's fuselage.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Mathis delivers him an envelope. Tousle-haired Bond places down his champagne flute and heads back to the bedroom. He kisses her nude back. She grins and turns her visage towards him. He draws her back down onto a mattress. DJ performs beneath a luminous moon. Platters are being offered and cocktails sipped. A Range Rover arrives at the entrance. Bond exits, accompanied by Fields in a stylish black and gold gown. He navigates through the throng of glamorous party-goers. He clasps another hand. CIA operative Felix observes from a couch. They gaze down from a stone railing. She kisses him and he pushes her firmly against the crumbling masonry. The slender German arrives. Fields passes. The CIA men are seated together. He fastens up as he goes around to the driver's side of the Range Rover. Motorcyclists follow them. He parks the vehicle. The two motorcycle officers pull up behind. Bond hands over his permit to the officer who is wearing dark spectacles at night. As he opens it, the officer draws. Mathis is lying in the trunk. Bond pulls the insentient man out. With his colleague’s firearm, throws the other down, calmly shoots him and empties the firearm and tosses it aside. Bond cradles him in his arms. Camille observes them. His head slumps against Bond's shoulder. Impassively, Bond feels for a pulse. Camille shifts uneasily. He drops the body in a dumpster, removes Mathis’ billfold from his coat, takes out the cash, and tosses the billfold aside. They walk off, leaving the body slumped amid the refuse bags in the dumpster. The Range Rover travels down a desert highway. M gazes coldly. The Range Rover drives through the dusty, barren. It arrives at a small airstrip. The man, in a leather jacket and brimmed cap, is. He turns as Bond his coat to cover a bloodstain on his shirt. Bond looks at an old propeller transport plane as Camille gets out of the car. The ageing DC-3 Dakota lumbers down the runway, raising a cloud of dust in it. The man in a cap is already on the phone as the old plane takes to the air. A fighter darts past them and banks for another pass. Bond puts the plane into the dive, working the controls furiously as the fighter loops to get behind them. The fighter darts in. Bond flies down into a canyon. Camille looks alarmed, and Bond concentrates hard as they skim the canyon floor. He lowers the undercarriage. They hit the ground hard. He pulls the throttle back open. The fighter hurtles down the canyon after them, perilously close to a rocky outcrop. Fields gets out of her seat and moves down the plane's fuselage."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "An envelope is handed to him by Mathis. The champagne glass is put down by tousle-headed Bond as he heads back to the bedroom. Her naked back is kissed by him. A smile is given by her as she turns her face towards him. She is pulled back down onto a bed by him. A full moon is played under by a DJ. Trays are served and cocktails are sipped by guests. At the entrance, a Range Rover is pulled up. Bond, accompanied by Fields in a glamorous black and gold dress, gets out. The press of glamorous party-goers is moved through by him. Another hand is shaken by him. Felix, the CIA agent, watches him from a sofa. Down from a stone balustrade, they look. She is kissed by him and shoved hard against the crumbling stonework. The thin German arrives. Fields passes them. Together, the CIA men sit. The driver's side of the Range Rover is belted up as he goes around. Them are followed by motorcyclists. The car is parked by him. Behind, the two motorcycle cops pull up. The cop, wearing dark glasses at night, is handed Bond's license. As it is opened by him, a draw is made by the cop. Mathis is found lying in the trunk. The unconscious man is pulled out by Bond. With his colleague’s gun, the other man is thrown down, calmly shooting him and emptying the gun, which is tossed aside. He is cradled in Bond's arms. They are watched by Camille. His head slumps against Bond's shoulder. Without expression, a pulse is felt for by Bond. Camille shifts uneasily. The body is dropped in a dumpster and Mathis’ wallet is removed from his jacket, cash is taken out, and the wallet is tossed aside. Off they walk, leaving the body slumped amid the rubbish bags in the dumpster. Down a desert highway, the Range Rover heads. A cold stare is given by M. Through the dusty, barren land, the Range Rover drives. At a small airstrip, it arrives. The man in a leather jacket and brimmed hat turns. Bond covers a bloodstain on his shirt with his jacket. As Camille gets out of the car, Bond looks at an old propeller transport plane. The ageing DC-3 Dakota is lumbered down the runway, raising a cloud of dust in it. On the phone already is the man in a hat as the old plane takes to the air. Past them, a fighter streaks and banks for another pass. Into the dive, Bond puts the plane, working the controls furiously as the fighter loops to get behind them. The fighter streaks in. Down into a valley, Bond flies the plane. With alarm, Camille looks, and hard concentration is maintained by Bond as they skim the valley floor. The undercarriage is lowered by him. The ground is hit hard by them. The throttle is pulled back open by him. Down the valley after them, the fighter hurtles perilously close to a rocky outcrop. Her seat is vacated by Fields, and she moves down the plane's fuselage."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Mathis gives Bond an envelope. Disheveled, Bond sets aside his champagne and returns to the bedroom, kissing her bare back. She smiles, turns to him, and he pulls her onto the bed. Under a full moon, a DJ plays, and trays with cocktails are served. A Range Rover arrives, and Bond exits with Fields in a black and gold dress. Navigating through the crowd, he shakes hands while CIA agent Felix observes from a sofa. They stand at a stone balustrade. She kisses him, and he pushes her against the stonework. A thin German appears, and Fields walks by. CIA agents sit together. Bond gets into the Range Rover, pursued by motorcyclists. He parks, and two motorcycle cops stop behind. Bond hands his license to a sunglass-wearing cop. Opening it, the cop draws a gun. Mathis lies in the trunk. Bond pulls him out, uses the cop's gun to shoot and disarm, and discards the weapon. Bond cradles Mathis's body, Camille watches, and he checks for a pulse. Camille shifts uncomfortably. Bond leaves Mathis in a dumpster, takes cash from his wallet, and they leave. The Range Rover drives through the desert. M looks coldly. It arrives at a small airstrip. A man in a leather jacket is there. Bond covers a bloodstain on his shirt. He eyes an old DC-3 Dakota plane as Camille exits. The plane takes off, raising dust as a fighter jet approaches. Bond pilots the plane into a dive, evading the fighter. Camille is alarmed, but Bond stays focused as they skim the valley floor. He lowers the landing gear, hits the ground hard, and reopens the throttle. The fighter pursues them dangerously close to rocks. Fields leaves her seat and moves down the fuselage."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Mathis hands Bond an envelope. Disheveled, Bond leaves his champagne, kisses her back, and returns to bed. A DJ plays under the full moon; trays and cocktails circulate. A Range Rover arrives with Bond and Fields, who's in a striking black and gold dress. Bond mingles and greets party-goers while CIA agent Felix observes. A German arrives; Fields passes by. CIA agents watch as Bond buckles up and drives the Range Rover, followed by motorcyclists. After parking, Bond hands his license to a cop in sunglasses. The cop draws a gun; Mathis is unconscious in the trunk. Bond disarms and shoots the cops, then holds Mathis, who slumps. Camille watches uneasily. Bond checks for a pulse, takes cash from Mathis' wallet, discards it, and leaves the body in a dumpster. The Range Rover drives through the desert. M watches coldly. At a small airstrip, Bond covers a bloodstain as he and Camille exit. An old DC-3 Dakota takes off, pursued by a fighter. Bond dives, concentrating hard as Camille looks alarmed. The plane hits the valley floor, accelerating to escape a rocky outcrop. Fields moves through the fuselage."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Mathis carefully hands over an envelope to Bond, who is tousle-headed and casually holding a champagne glass. After setting the glass aside, Bond makes his way back to the bedroom. There, he tenderly kisses her bare back. With a delighted smile, she turns her face towards him. Bond gently pulls her back down onto the soft bed. Meanwhile, the DJ is spinning tracks under the enchanting glow of a full moon. Trays laden with delicacies and expertly crafted cocktails are being served as guests sip and mingle. A sleek Range Rover arrives and stops at the entrance. Bond exits, accompanied by Fields, who is elegantly dressed in a striking black and gold gown. He makes his way through the throng of glamorous party-goers with ease. As he moves, he pauses briefly to shake hands with another attendee. At a distance, CIA agent Felix observes the scene from the comfort of a sofa. They gaze down from the ancient stone balustrade. She gives him a passionate kiss, and he responds by pressing her firmly against the weathered stonework. Amidst the activity, a lean German man makes his entrance. Fields casually passes by. The group of CIA men sits together in a quiet corner. Bond fastens his seatbelt as he circles around to the driver's side of the Range Rover. A pair of motorcyclists trail them closely. Bond pulls the car into a stop, and the two motorcycle police officers halt behind him. Bond proceeds to hand over his license to the officer, who oddly enough, wears dark glasses despite it being night. As the officer opens it, he unexpectedly draws his weapon. Mathis is discovered lying unconscious in the trunk. Bond swiftly extracts him from the car. Borrowing his colleague’s gun, Bond decisively dispatches the other officer, empties the weapon, and casually discards it. Cradling Mathis tenderly in his arms, Bond is joined by Camille, who watches with concern. Mathis’ head droops against Bond's shoulder. Without any visible emotion, Bond checks for a pulse. Camille shifts uneasily, her tension evident. With a heavy heart, Bond drops the limp body into a dumpster, removes Mathis' wallet from his jacket, extracts the cash, and tosses the wallet aside with indifference. Together, they walk away, leaving the body slumped among the refuse bags in the dumpster. The Range Rover continues its journey down an isolated desert highway. M observes with a cold, steady gaze. The vehicle drives through the expansive, desolate terrain. Eventually, it reaches a modest airstrip. A man clad in a leather jacket and wearing a brimmed hat stands waiting. As Bond approaches, he discreetly adjusts his jacket to conceal a bloodstain on his shirt. Bond’s eyes land on an aging propeller transport plane as Camille disembarks from the car. The venerable DC-3 Dakota rumbles down the runway, kicking up a swirling cloud of dust in its path. The man in the hat is already on his phone as the old airplane climbs into the sky. Suddenly, a fighter jet streaks by and banks sharply to prepare for another aggressive pass. Bond, piloting the plane, puts it into a steep dive, working the controls with intensity as the fighter loops behind them, closing in. The fighter jet races towards them as Bond maneuvers the plane into a downward path, navigating a narrow valley. Camille shows signs of alarm, yet Bond remains intensely focused as they skim just above the valley floor. Skillfully, he lowers the undercarriage, and they make a rough landing. Without hesitation, he reopens the throttle. The fighter swoops down the valley, frighteningly close to a jagged outcrop of rocks. Inside the plane, Fields rises from her seat and makes her way down the length of the fuselage, amidst the chaos."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Mathis, with measured care and precision, passes an envelope to Bond, who is sporting a tousled head of hair and casually balancing a champagne glass in his hand. After thoughtfully setting the glass aside, Bond strides purposefully back to the bedroom where he gently kisses her bare back. In response, she turns her face toward him with a delighted smile. Bond then tenderly pulls her back down onto the soft bed to join him. Meanwhile, the DJ is energetically spinning tracks beneath the enchanting glow of a full moon, while trays laden with an array of delicacies and expertly crafted cocktails circulate among the guests, who sip and mingle. A sleek, polished Range Rover arrives, coming to a halt right at the entrance. Bond steps out, accompanied by Fields, elegantly dressed in a striking, eye-catching black and gold gown. He navigates his way through the throng of glamorous party-goers with a sense of ease, pausing briefly along the way to shake hands with another attendee. From a distance, CIA agent Felix is calmly observing the entire scene from the comfort of a sofa as they gaze down from the ancient stone balustrade. She gives him a passionate and deeply felt kiss, and he responds by pressing her firmly against the weathered stonework. Amidst all the activity, a lean German man makes his entrance discreetly while Fields casually passes by. The group of CIA men remains seated together in a quiet corner, watching the proceedings. Bond, with deliberate precision, fastens his seatbelt as he makes his way around to the driver’s side of the Range Rover. A pair of motorcyclists are closely trailing them. As Bond pulls the car into a stop, the two motorcycle police officers come to a halt behind him. Bond proceeds to hand over his license to the officer, who, oddly enough, is wearing dark glasses despite the fact it is night. As the officer opens the license, he unexpectedly draws his weapon. Mathis is discovered lying unconscious in the trunk, and Bond swiftly extracts him from the car. Borrowing his colleague’s gun, Bond decisively dispatches the other officer, empties the weapon, and then casually discards it. He cradles Mathis tenderly in his arms, and is soon joined by Camille, who watches the scene unfold with evident concern. Mathis’ head droops gently against Bond's shoulder. Without showing any visible emotion, Bond checks for a pulse, while Camille shifts uneasily, her tension clearly evident. With a heavy heart, Bond drops the limp body into a nearby dumpster, removes Mathis' wallet from his jacket, extracts the cash and tosses the wallet aside with an air of indifference. Together, they walk away, leaving the body slumped among the refuse bags in the dumpster. The Range Rover continues its journey, gliding down an isolated and desolate desert highway. M observes this scene with a cold, steady gaze, as the vehicle drives through the expansive, barren terrain. Eventually, it reaches a modest airstrip, where a man clad in a leather jacket and wearing a brimmed hat stands patiently waiting. As Bond approaches, he discreetly adjusts his jacket to conceal a bloodstain on his shirt. Bond’s eyes land on an aging propeller transport plane, and he watches as Camille disembarks from the car. The venerable DC-3 Dakota, making its presence known, rumbles down the runway, kicking up a swirling cloud of dust in its path. The man in the hat is already on his phone, talking animatedly, as the old airplane climbs steadily into the sky. Suddenly, a fighter jet streaks by with a roar and banks sharply, preparing for another aggressive pass. Bond, now piloting the plane, puts it into a steep dive, working the controls with intense focus as the fighter loops behind them, drawing ever closer. The fighter jet races towards them with alarming speed as Bond maneuvers the plane into a downward path, expertly navigating through a narrow valley. Camille shows signs of alarm and distress, yet Bond remains intensely focused as they skim just above the valley floor. With skillful precision, he lowers the undercarriage, making a rough landing. Without hesitation, he reopens the throttle, maintaining their precarious flight. The fighter swoops down the valley, coming frighteningly close to a jagged outcrop of rocks. Inside the plane, Fields rises unsteadily from her seat and makes her way down the length of the fuselage amidst the chaos."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Mathis extends his hand and places an envelope into Bond's grasp. Tousle-headed Bond, with a motion of casual elegance, sets his champagne glass down on a nearby surface and makes his way back to the bedroom, each step deliberate. Once there, he leans in to press his lips softly against her bare back, eliciting a smile that spreads across her face as she turns towards him with warmth in her eyes. With a gentle but decisive movement, he draws her back down onto the inviting bed. Outside, under the luminous glow of a full moon, a DJ masterfully curates an atmosphere with music, while servers effortlessly maneuver through the crowd, balancing trays laden with delectable offerings and cocktails that guests sip with delight. A Range Rover rolls smoothly to a stop at the entrance, signaling Bond's arrival. He gracefully exits the vehicle, flanked by Fields, who exudes sophistication in her stunning black and gold dress. Together, they weave through the throng of elegantly attired party-goers, Bond seamlessly engaging in the social ritual of shaking hands with one of the attendees. CIA agent Felix, strategically seated on a sofa, observes the scene with focused attention. From the vantage point of a stone balustrade, they survey the bustling festivities below. In a moment charged with intensity, she kisses him passionately, only to be met with his forceful shove against the ancient, crumbling stonework behind her. As the tension mounts, a thin German man makes his presence known, and Fields passes by, unnoticed by the gathering. Nearby, the CIA men sit together, a silent note of camaraderie shared between them. As the scene shifts, Bond secures his seatbelt and moves purposefully around the vehicle to take his place in the driver's seat of the Range Rover. Without delay, motorcyclists shadow their departure. Bond skillfully maneuvers the car into a parking position, and the two motorcycle cops arrive directly behind, engines idling. Bond, maintaining an air of composure, hands over his license to a cop whose dark glasses curiously obscure his eyes in the nighttime setting. As the officer examines the document, tension escalates as he draws his weapon. In a rapid sequence of movements, Bond discovers Mathis lying unconscious in the trunk, retrieves him with care, and acts with precision by using his colleague’s gun, confidently disarming the threat as he fires and then empties the gun before discarding it. Bond cradles Mathis tenderly in his arms, searching for any sign of life, while Camille watches the unfolding drama with keen interest. As Mathis' head rests heavily against Bond's shoulder, expressionless, Bond checks for a pulse, his demeanor calm yet focused. Camille shifts uneasily, sensing the gravity of the moment. Bond, with a sense of finality, lowers the body into a dumpster, extracting Mathis’ wallet from his jacket, removing the cash, and tossing the wallet aside without hesitation. Together, they walk away, leaving the body among the refuse bags in the dumpster, the scene a stark reflection of their unresolved mission. The Range Rover propels down a stark desert highway, with M staring with unyielding resolve. The vehicle traverses the dusty, barren landscape, eventually arriving at a small, secluded airstrip. A man, dressed in a leather jacket and brimmed hat, turns with attention as Bond discreetly adjusts his jacket to obscure a telltale bloodstain on his shirt. Bond's gaze settles on an aged propeller transport plane, poised for its next journey, as Camille emerges from the car, her presence unwavering. The vintage DC-3 Dakota, laden with years of service, roars down the runway, trailing a swirling cloud of dust in its wake. As the plane ascends into the open sky, a man in a hat is already amidst a tense phone call, underscoring the unfolding drama. Above, a fighter jet blazes past, banking sharply as it realigns for another aggressive approach. Bond, resolute in his task, wrestles with the plane's controls with skilled intensity, initiating a steep dive to evade pursuit while the fighter loops determinedly to position itself behind them. The fighter closes in rapidly, and Bond pilots the plane into a valley, flying with precision as Camille’s alarm grows evident beside him. Concentration etched into his features, Bond deftly manipulates the controls to skim mere meters above the valley floor, maneuvering the undercarriage with tactical foresight. A jarring impact ensues as they hit the ground with force, the plane responding to Bond’s command as he reopens the throttle. The fighter, relentless in its pursuit, careens recklessly through the valley, narrowly avoiding collision with a menacing rocky outcrop. In the midst of this aerial duel, Fields unbuckles from her seat and makes her way down the plane’s narrow fuselage, her movements deliberate amid the chaos."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Mathis hands Bond an envelope, prompting him to leave his champagne glass and return to the bedroom, where he kisses her before they fall back onto the bed. At a party under a full moon, with trays being served and cocktails sipped, a Range Rover arrives at the entrance. Bond and Fields, dressed glamorously, navigate through the crowd, exchanging greetings as CIA agent Felix observes from a distance. Bond and Fields share a passionate moment by the stone balustrade before being interrupted by the arrival of a thin German, as Fields passes by the CIA men. Later, Bond drives the Range Rover, tailed by motorcyclists, and stops when police pull up behind them. After a confrontation, Bond finds Mathis unconscious in the trunk, cradles him, checks for a pulse, and ultimately leaves the body behind, taking only his cash. Bond and Camille leave for a desert highway while M watches coldly. They reach a small airstrip, where Bond adjusts his jacket to conceal a bloodstain before he and Camille board an old propeller plane. As the plane takes off, a fighter jet approaches aggressively. Bond expertly maneuvers the plane through a valley to evade the fighter. Camille is visibly concerned as they make a rough landing. Meanwhile, Fields moves down the plane's fuselage."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Mathis hands him an envelope, which is likely full of critical intelligence or currency, a common practice in espionage to facilitate covert operations. Tousle-headed Bond, known for his distinctive disheveled hairstyle that complements his suave demeanor, puts down his champagne glass, a symbol of luxury and sophistication often associated with his character, and heads back to the bedroom. He kisses her naked back, a moment of intimacy in the world of dangerous espionage. She smiles and turns her face towards him, the warmth between them briefly transcending the coldness of their world. He pulls her back down onto a bed, their lives momentarily suspended in a rare peace. DJ plays under a full moon, lighting the night sky with its silvery glow, adding a romantic yet mysterious ambiance. Trays are being served, laden with gourmet delicacies, and cocktails sipped by elegant guests. A Range Rover, a vehicle synonymous with wealth and adventure, pulls up at the entrance. Bond gets out, accompanied by Fields in a glamorous black and gold dress designed by a renowned fashion house, adding to the evening's opulence. He moves through the press of glamorous party-goers, a sea of wealth and influence. He shakes another hand, maintaining his suave cover. CIA agent Felix, known for his strategic mind and calm demeanor, watches from a sofa, assessing every movement. They look down from a stone balustrade that has seen countless years of history unfold. She kisses him, and he shoves her hard against the crumbling stonework, the fragility of their world mirrored in the surroundings. The thin German, possibly a vital player in their mission, arrives. Fields passes, her eyes scanning the room for any signs of trouble. The CIA men are sitting together, exchanging coded glances. He belts up as he goes around to the driver's side of the Range Rover, preparing for another high-speed pursuit. Motorcyclists follow them, their engines roaring like predators in the night. He parks the car with the precision of a seasoned operative. The two motorcycle cops pull up behind, ensuring they maintain surveillance. Bond hands over his license to the cop, who is wearing dark glasses at night, an unusual choice indicating secrecy or perhaps a hidden agenda. As he opens it, the cop draws his weapon, revealing the ever-present danger in Bond's life. Mathis is lying in the trunk, a grim reminder of the risks involved. Bond pulls the unconscious man out, demonstrating his loyalty despite the peril. With his colleague’s gun, he throws the other down, calmly shoots him, displaying his cold efficiency, and empties the gun, tossing it aside. Bond cradles him in his arms, humanizing the relentless spy with a moment of compassion. Camille watches them, her expression conflicted by the violence. His head slumps against Bond's shoulder, lifeless and heavy. Expressionlessly, Bond feels for a pulse, the stoicism masking his inner turmoil. Camille shifts uneasily, the reality of their missions weighing heavily on her. He drops the body in a dumpster, removes Mathis’ wallet from his jacket, takes out the cash—an essential resource in their line of work—and tosses the wallet aside. They walk off, leaving the body slumped amid the rubbish bags in the dumpster, a casualty of their unforgiving world. The Range Rover heads down a desert highway, an endless stretch of isolation. M stares coldly at the distant transmission, a picture of authority making hard decisions. The Range Rover drives through the dusty, barren wasteland, a stark contrast to the luxury Bond often inhabits. It arrives at a small airstrip, a secluded location for clandestine departures. The man, in a leather jacket and brimmed hat, exudes an air of rugged experience. He turns as Bond adjusts his jacket to cover a bloodstain on his shirt, concealing the evidence of their latest skirmish. Bond looks at an old propeller transport plane, the ageing DC-3 Dakota renowned for its reliability, as Camille gets out of the car. The DC-3 Dakota lumbers down the runway, raising a cloud of dust in it, testament to its storied past and resilience. The man in a hat is already on the phone, possibly coordinating the next phase of their dangerous mission, as the old plane takes to the air. A fighter streaks past them, a symbol of military might and precision, and banks for another pass. Bond puts the plane into the dive, his experienced hands working the controls furiously as the fighter loops to get behind them, displaying the aerial combat skills he's honed over years. The fighter streaks in, a relentless threat. Bond flies down into a valley, using the terrain as cover. Camille looks alarmed, aware of the fragility of their situation, while Bond concentrates hard as they skim the valley floor, maneuvering with precision. He lowers the undercarriage, preparing for a risky landing. They hit the ground hard, a testament to Bond's daring nature. He pulls the throttle back open, determined to escape. The fighter hurtles down the valley after them, perilously close to a rocky outcrop, the danger ever present. Fields gets out of her seat and moves down the plane's fuselage, readying herself for whatever comes next, the pulse of adrenaline driving her forward."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "The thin German arrives Mathis hands him an envelope Tousleheaded Bond puts down his champagne glass and heads back to the bedroom He kisses her naked back She smiles and turns her face towards him The two motorcycle cops pull up behind He pulls her back down onto a bed DJ plays under a full moon Trays are being served and cocktails sipped A Range Rover pulls up at the entrance Bond gets out accompanied by Fields in a glamorous black and gold dress A fighter streaks past them and banks for another pass She kisses him and he shoves her hard against the crumbling stonework He drops the body in a dumpster removes Mathis’ wallet from his jacket takes out the cash and tosses the wallet aside He moves through the press of glamorous partygoers M stares coldly He shakes another hand The ageing DC3 Dakota lumbers down the runway raising a cloud of dust in it CIA agent Felix watches from a sofa They look down from a stone balustrade She kisses him and he shoves her hard against the crumbling stonework Bond looks at an old propeller transport plane as Camille gets out of the car The thin German arrives Fields passes Camille watches them Camille looks alarmed and Bond concentrates hard as they skim the valley floor The CIA men are sitting together He belts up as he goes around to the driver's side of the Range Rover Motorcyclists follow them He parks the car The two motorcycle cops pull up behind Bond hands over his license to the cop who is wearing dark glasses at night He kisses her naked back As he opens it the cop draws Mathis is lying in the trunk As he opens it the cop draws Bond pulls the unconscious man out With his colleague’s gun throws the other down calmly shoots him and empties the gun and tosses it aside Bond cradles him in his arms A Range Rover pulls up at the entrance Camille watches them His head slumps against Bond's shoulder Expressionlessly It arrives at a small airstrip Bond feels for a pulse Camille shifts uneasily He drops the body in a dumpster removes Mathis’ wallet from his jacket takes out the cash and tosses the wallet aside They look down from a stone balustrade They walk off leaving the body slumped amid the rubbish bags in the dumpster Fields gets out of her seat and moves down the plane's fuselage The Range Rover heads down a desert highway He pulls the throttle back open Tousleheaded Bond puts down his champagne glass and heads back to the bedroom M stares coldly Bond flies down into a valley The Range Rover drives through the dusty barren DJ plays under a full moon It arrives at a small airstrip The man in a leather jacket and brimmed hat is Bond feels for a pulse He turns as Bond his jacket to cover a bloodstain on his shirt Bond looks at an old propeller transport plane as Camille gets out of the car The ageing DC3 Dakota lumbers down the runway raising a cloud of dust in it The man in a hat is already on the phone as the old plane takes to the air Bond gets out accompanied by Fields in a glamorous black and gold dress A fighter streaks past them and banks for another pass Bond puts the plane into the dive working the controls furiously as the fighter loops to get behind them Trays are being served and cocktails sipped The fighter streaks in He lowers the undercarriage The Range Rover heads down a desert highway Bond flies down into a valley He belts up as he goes around to the driver's side of the Range Rover Camille looks alarmed and Bond concentrates hard as they skim the valley floor He lowers the undercarriage They hit the ground hard Fields passes He pulls the throttle back open The fighter hurtles down the valley after them perilously close to a rocky outcrop Fields gets out of her seat and moves down the plane's fuselage"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Mathis hands him an envelope. Tousleheaded Bond puts down his champagne glass and heads back to the bedroom. He kisses her naked back. She smiles and turns her face towards him. He pulls her back down onto a bed. DJ plays under a full moon. Trays are being served and cocktails sipped. A Range Rover pulls up at the entrance. Bond gets out accompanied by Fields in a glamorous black and gold dress. He moves through the press of glamorous partygoers. He shakes another hand. CIA agent Felix watches from a sofa. They look down from a stone balustrade. She kisses him and he shoves her hard against the crumbling stonework. The thin German arrives. Fields passes. The CIA men are sitting together. He belts up as he goes around to the driver's side of the Range Rover. Motorcyclists follow them. He parks the car. The two motorcycle cops pull up behind. Bond hands over his license to the cop who is wearing dark glasses at night. As he opens it the cop draws. Mathis is lying in the trunk. Bond pulls the unconscious man out. With his colleague’s gun throws the other down calmly shoots him and empties the gun and tosses it aside. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. Bond cradles him in his arms. Camille watches them. His head slumps against Bond's shoulder. Expressionlessly. Bond feels for a pulse. Camille shifts uneasily. He drops the body in a dumpster removes Mathis’ wallet from his jacket takes out the cash and tosses the wallet aside. They walk off leaving the body slumped amid the rubbish bags in the dumpster. The Range Rover heads down a desert highway. M stares coldly. The Range Rover drives through the dusty barren. It arrives at a small airstrip. The man in a leather jacket and brimmed hat is. He turns as Bond his jacket to cover a bloodstain on his shirt. Bond looks at an old propeller transport plane as Camille gets out of the car. The ageing DC3 Dakota lumbers down the runway raising a cloud of dust in it. The man in a hat is already on the phone as the old plane takes to the air. A fighter streaks past them and banks for another pass. Bond puts the plane into the dive working the controls furiously as the fighter loops to get behind them. The fighter streaks in. Bond flies down into a valley. Camille looks alarmed and Bond concentrates hard as they skim the valley floor. He lowers the undercarriage. They hit the ground hard. He pulls the throttle back open. The fighter hurtles down the valley after them perilously close to a rocky outcrop. Fields gets out of her seat and moves down the plane's fuselage."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Mathis hands him an envelope. Tousleheaded Bond puts down his champagne glass and heads back to the bedroom. He kisses her naked back. She smiles and turns her face towards him. He pulls her back down onto a bed. DJ plays under a full moon. Trays are being served and cocktails sipped. A Range Rover pulls up at the entrance. Bond gets out accompanied by Fields in a glamorous black and gold dress. He moves through the press of glamorous partygoers. He shakes another hand. CIA agent Felix watches from a sofa. They look down from a stone balustrade. She kisses him and he shoves her hard against the crumbling stonework. The thin German arrives. Fields passes. The CIA men are sitting together. He belts up as he goes around to the driver's side of the Range Rover. Motorcyclists follow them. He parks the car. The two motorcycle cops pull up behind. Bond hands over his license to the cop who is wearing dark glasses at night. As he opens it the cop draws. Mathis is lying in the trunk. Bond pulls the unconscious man out. With his colleague’s gun throws the other down calmly shoots him and empties the gun and tosses it aside. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. Bond cradles him in his arms. Camille watches them. His head slumps against Bond's shoulder. Expressionlessly. Bond feels for a pulse. Camille shifts uneasily. He drops the body in a dumpster removes Mathis’ wallet from his jacket takes out the cash and tosses the wallet aside. They walk off leaving the body slumped amid the rubbish bags in the dumpster. The Range Rover heads down a desert highway. M stares coldly. The Range Rover drives through the dusty barren. It arrives at a small airstrip. The man in a leather jacket and brimmed hat is. He turns as Bond his jacket to cover a bloodstain on his shirt. Bond looks at an old propeller transport plane as Camille gets out of the car. The ageing DC3 Dakota lumbers down the runway raising a cloud of dust in it. The man in a hat is already on the phone as the old plane takes to the air. A fighter streaks past them and banks for another pass. Bond puts the plane into the dive working the controls furiously as the fighter loops to get behind them. The fighter streaks in. Bond flies down into a valley. Camille looks alarmed and Bond concentrates hard as they skim the valley floor. He lowers the undercarriage. They hit the ground hard. He pulls the throttle back open. The fighter hurtles down the valley after them perilously close to a rocky outcrop. Fields gets out of her seat and moves down the plane's fuselage."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Mathis hands him an envelope. Tousleheaded Bond puts down his champagne glass and heads back to the bedroom. He kisses her naked back. She smiles and turns her face towards him. He pulls her back down onto a bed. DJ plays under a full moon. Trays are being served and cocktails sipped. A Range Rover pulls up at the entrance. Bond gets out accompanied by Fields in a glamorous black and gold dress. He moves through the press of glamorous partygoers. He shakes another hand. CIA agent Felix watches from a sofa. They look down from a stone balustrade. He turns as Bond his jacket to cover a bloodstain on his shirt. Bond looks at an old propeller transport plane as Camille gets out of the car. The ageing DC3 Dakota lumbers down the runway raising a cloud of dust in it. The man in a hat is already on the phone as the old plane takes to the air. A fighter streaks past them and banks for another pass. Bond puts the plane into the dive working the controls furiously as the fighter loops to get behind them. The fighter streaks in. Bond flies down into a valley. Camille looks alarmed and Bond concentrates hard as they skim the valley floor. He lowers the undercarriage. They hit the ground hard. He pulls the throttle back open. The fighter hurtles down the valley after them perilously close to a rocky outcrop. Fields gets out of her seat and moves down the plane's fuselage."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Mathis hands him an envelope. Tousleheaded Bond puts down his champagne glass and heads back to the bedroom. He kisses her naked back. She smiles and turns her face towards him. He pulls her back down onto a bed. Camille looks alarmed and Bond concentrates hard as they skim the valley floor. He lowers the undercarriage. They hit the ground hard. He pulls the throttle back open. The fighter hurtles down the valley after them perilously close to a rocky outcrop. Fields gets out of her seat and moves down the plane's fuselage."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Mathis hands the octopus an envelope. Tousle-headed the rabbit puts down the champagne glass and heads back to the bedroom. The penguin kisses her naked back. The giraffe smiles and turns her face towards the penguin. The penguin pulls the giraffe back down onto a bed. An owl plays under a full moon. Trays are being served and cocktails sipped. A Range Rover pulls up at the entrance. The rabbit gets out, accompanied by a sheep in a glamorous black and gold dress. The rabbit moves through the press of glamorous party-goers. The rabbit shakes another hand. CIA agent the dolphin watches from a sofa. They look down from a stone balustrade. The giraffe kisses the penguin and the penguin shoves the giraffe hard against the crumbling stonework. The thin kangaroo arrives. The sheep passes. The ostrich and the penguin are sitting together. The penguin belts up as the penguin goes around to the driver's side of the Range Rover. Zebras follow them. The penguin parks the car. The two zebra cops pull up behind. The rabbit hands over the rabbit's license to the parrot who is wearing dark glasses at night. As the parrot opens it, the parrot draws. The octopus is lying in the trunk. The rabbit pulls the unconscious kangaroo out. With the ostrich’s gun, throws the other down, calmly shoots the ostrich and empties the gun and tosses it aside. The rabbit cradles the kangaroo in the rabbit's arms. The cheetah watches them. The rabbit’s head slumps against the rabbit's shoulder. Expressionlessly, the rabbit feels for a pulse. The cheetah shifts uneasily. The rabbit drops the body in a dumpster, removes the octopus’ wallet from the kangaroo's jacket, takes out the cash, and tosses the wallet aside. They walk off, leaving the kangaroo slumped amid the rubbish bags in the dumpster. The Range Rover heads down a desert highway. The owl stares coldly. The Range Rover drives through the dusty, barren. It arrives at a small airstrip. The bear, in a leather jacket and brimmed hat, is. The bear turns as the rabbit adjusts the rabbit's jacket to cover a bloodstain on the rabbit's shirt. The rabbit looks at an old propeller transport plane as the cheetah gets out of the car. The ageing DC-3 Dakota lumbers down the runway, raising a cloud of dust in it. The bear in a hat is already on the phone as the old plane takes to the air. A fighter streaks past them and banks for another pass. The rabbit puts the plane into the dive, working the controls furiously as the fighter loops to get behind them. The fighter streaks in. The rabbit flies down into a valley. The cheetah looks alarmed, and the rabbit concentrates hard as they skim the valley floor. The rabbit lowers the undercarriage. They hit the ground hard. The rabbit pulls the throttle back open. The fighter hurtles down the valley after them, perilously close to a rocky outcrop. The sheep gets out of the sheep's seat and moves down the plane's fuselage."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Mathis hands him a newspaper. Tousle-headed Bond puts down his juice glass and heads back to the living room. He kisses her naked shoulder. She smiles and turns her face towards him. He pulls her back down onto a couch. DJ plays under a streetlamp. Platters are being served and teas sipped. A bicycle pulls up at the entrance. Bond gets out, accompanied by Fields in a glamorous red and silver dress. He moves through the press of glamorous concert-goers. He shakes another hand. CIA agent Felix watches from a bean bag. They look down from a wooden railing. She kisses him and he shoves her hard against the crumbling brickwork. The tall Frenchman arrives. Fields passes. The CIA men are sitting together. He belts up as he goes around to the driver's side of the bicycle. Joggers follow them. He parks the scooter. The two jogging officers pull up behind. Bond hands over his ID to the officer who is wearing sunglasses at night. As he opens it, the officer draws. Mathis is lying in the backseat. Bond pulls the unconscious man out. With his colleague’s phone, throws the other down, calmly shoots him and empties the phone and tosses it aside. Bond cradles him in his arms. Camille watches them. His head slumps against Bond's shoulder. Expressionlessly, Bond feels for a pulse. Camille shifts uneasily. He drops the body in a dumpster, removes Mathis’ watch from his jacket, takes out the cash, and tosses the watch aside. They walk off, leaving the body slumped amid the cardboard boxes in the dumpster. The bicycle heads down a coastal path. M stares coldly. The bicycle drives through the dusty, barren. It arrives at a small pier. The man, in a denim jacket and straw hat, is. He turns as Bond his jacket to cover a mud stain on his shirt. Bond looks at an old sailboat as Camille gets out of the car. The ageing schooner lumbers down the river, raising a cloud of mist in it. The man in a hat is already on the phone as the old boat takes to the sea. A speedboat streaks past them and banks for another pass. Bond puts the boat into a turn, working the rudder furiously as the speedboat loops to get behind them. The speedboat streaks in. Bond sails down into a cove. Camille looks alarmed, and Bond concentrates hard as they skim the cove's surface. He lowers the anchor. They hit the water hard. He pulls the sail back open. The speedboat hurtles down the cove after them, perilously close to a rocky outcrop. Fields gets out of her seat and moves down the boat's deck."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Mathis tosses him an envelope. Tousle-headed Bond picks up his champagne glass and strolls back to the bedroom. He whispers sweet nothings to her naked back. She winks and turns her face away from him. He lifts her up off of a bed. DJ dances under a full moon. Trays are being ignored and cocktails spilled. A Range Rover zooms past the entrance. Bond stays inside, accompanied by Fields in a glamorous black and gold dress. He drifts through the press of glamorous party-goers. He pats another hand. CIA agent Felix lounges on a sofa. They gaze out from a stone balustrade. She ignores him and he pulls her gently against the crumbling stonework. The thin German departs. Fields lingers. The CIA men are chatting together. He jumps up as he goes around to the driver's side of the Range Rover. Motorcyclists overtake them. He swerves the car. The two motorcycle cops speed up behind. Bond hands over his license to the cop who is wearing dark glasses at night. As he opens it, the cop surrenders. Mathis is sitting in the trunk. Bond pushes the unconscious man in. With his colleague’s gun, hides the other away, calmly waves it and empties the gun and holds it aside. Bond lifts him in his arms. Camille watches them. His head rests against Bond's shoulder. Expressionlessly, Bond ignores a pulse. Camille watches intently. He lifts the body onto a dumpster, removes Mathis’ wallet from his jacket, takes out the cash, and pockets the wallet. They drive off, leaving the body resting amid the rubbish bags in the dumpster. The Range Rover races down a desert highway. M observes coldly. The Range Rover speeds through the dusty, barren. It arrives at a small airstrip. The man, in a leather jacket and brimmed hat, stands. He turns as Bond hides his jacket to reveal a bloodstain on his shirt. Bond inspects an old propeller transport plane as Camille waits in the car. The ageing DC-3 Dakota waits on the runway, raising a cloud of dust in it. The man in a hat is already sipping coffee as the old plane readies for the air. A fighter zooms past them and turns for another pass. Bond steadies the plane into a dive, working the controls gently as the fighter twists to get beside them. The fighter closes in. Bond glides down into a valley. Camille looks amazed, and Bond focuses hard as they hover the valley floor. He raises the undercarriage. They skid the ground lightly. He thrusts the throttle back open. The fighter shoots down the valley after them, perilously close to a leafy outcrop. Fields climbs out of her seat and strolls down the plane's fuselage."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Lily hands the book an apple. Tousle-headed Lamppost puts down the lemonade jug and heads back to the closet. It kisses the carpet's fuzzy edge. The pillow smiles and turns its face towards the lamp. It pulls the pillow back down onto a shelf. Painter plays under a full moon. Oranges are being served and smoothies sipped. A Scooter pulls up at the library. Lamppost gets out, accompanied by Shoes in a glamorous red and blue hat. It moves through the press of glamorous fruit-sellers. It shakes another feather. Chef watches from a chair. They look down from a wooden fence. The blanket kisses it and it shoves the blanket hard against the crumbling fence. The thin Astronaut arrives. Shoes passes. The Chef's shoes are sitting together. It belts up as it goes around to the driver's side of the Scooter. Sailboats follow them. It parks the bird. The two sailboat lifeguards pull up behind. Lamppost hands over its scarf to the lifeguard who is wearing shiny shoes at midnight. As it opens it, the lifeguard draws. Lily is lying in the shelf. Lamppost pulls the unconscious painting out. With its pillow’s pen, throws the other down, calmly paints it and empties the pen and tosses it aside. Lamppost cradles it in its branches. Tree watches them. Its shadow slumps against Lamppost's branches. Expressionlessly, Lamppost feels for a button. Tree shifts uneasily. It drops the canvas in a vase, removes Lily’s jacket from its table, takes out the coins, and tosses the jacket aside. Lamps walk off, leaving the canvas slumped amid the colored bags in the vase. The Scooter heads down a snowy canyon. Q stares warmly. The Scooter rolls through the snowy, icy. It arrives at a large aquarium. The cat, in a silk robe and wide-brimmed hat, is. It turns as Lamppost its scarf to cover a leaf stain on its shirt. Lamppost looks at a new jet transport kite as Tree gets out of the bird. The youthful DC-9 Gecko lumbers down the runway, raising a cloud of feathers in it. The cat in a hat is already on the trumpet as the new kite takes to the sea. A eagle streaks past them and banks for another ride. Lamppost puts the kite into the glide, working the baskets furiously as the eagle loops to get behind them. The eagle streaks in. Lamppost glides down into a river. Tree looks puzzled, and Lamppost concentrates hard as they skim the river floor. It lowers the ladder. They hit the snow hard. It pulls the rubber band back open. The eagle hurtles down the river after them, perilously close to a tree trunk. Shoes gets out of its shell and moves down the kite's string."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Lucinda hands the dog an envelope. Tousle-headed Roger puts down his lemonade glass and skips back to the kitchen. He taps her naked shoulder. She laughs and turns her gaze towards him. He tugs her back down onto a sofa. The cat sings under a full moon. Newspapers are being delivered and tea sipped. A bicycle rolls up at the entrance. Roger hops out, accompanied by Gloria in a vibrant green and silver dress. He dances through the throng of colorful party-goers. He waves at another face. FBI agent Marvin watches from a chair. They chat down from a wooden shelf. She hugs him and he lifts her gently against the crumbling wall. The tall Frenchman enters. Gloria glides by. The FBI officers are lounging together. He ties his shoes as he goes around to the passenger's side of the bicycle. Skateboarders tag along. He stops the vehicle. The two skateboard cops roll up behind. Roger hands over his camera to the cop who is sporting a cowboy hat under a streetlight. As he clicks it, the cop clicks. Lucinda is lying on the curb. Roger pulls the injured cat out. With his friend's first aid kit, bandages the other quickly, treats him and closes it and tosses it aside. Roger embraces him in his arms. Maria observes them. His head rests against Roger's shoulder. Quietly, Roger checks for a heartbeat. Maria shifts nervously. He places the cat in a basket, removes Lucinda’s watch from her pocket, takes out the change, and tosses the watch aside. They stroll off, leaving the cat nestled amid the trash cans in the basket. The bicycle speeds down a winding path. T stares intently. The bicycle cruises through the dusty, barren. It arrives at a large parking lot. The woman, in a woolen scarf and wide-brimmed hat, is. She waves as Roger his scarf to cover a tear on his coat. Roger glances at an old sailboat while Maria hops out of the cart. The ageing steamboat glides down the river, sending a spray of water behind it. The woman in a hat is already texting as the old vessel sails into the horizon. A bird glides past them and loops for another pass. Roger steers the boat into the ripples, maneuvering the helm deftly as the bird swoops to get above them. The bird swoops in. Roger navigates down into a stream. Maria looks concerned, and Roger focuses intently as they skim the water’s surface. He lowers the mast. They strike the water forcefully. He hoists the sail back up. The bird swoops down the stream after them, dangerously close to a riffle. Gloria rises from her seat and wanders down the vessel's deck."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Mathis tosses him a newspaper. Tousle-headed Bond sets down his teacup and marches back to the balcony. He taps her on the shoulder. She giggles and swivels her head towards him. He lifts her up onto a swing. DJ dances under a bright sun. Plates are being passed around and sodas chugged. A bicycle coasts up to the gate. Bond leaps out, accompanied by Fields in a glamorous green and silver scarf. He drifts through the swarm of elegant dancers. He waves at another person. CIA agent Felix observes from a hammock. They peer over a wooden railing. She hugs him and he nudges her aside against the peeling plaster. The tall Frenchman departs. Fields wanders. The CIA men are lounging together. He buckles in as he strolls to the passenger's side of the bicycle. Skateboarders glide after them. He stops the bicycle. The two skateboard cops roll up beside. Bond presents his notebook to the cop who is wearing a sun hat at night. As he flips it, the cop jumps. Mathis is resting in the cargo hold. Bond pulls the snoozing man out. With his colleague’s book, drops the other, casually flips him and empties the bag and sets it aside. Bond hugs him gently. Camille observes them. His head tilts against Bond's chest. Blankly, Bond checks for a phone. Camille fidgets nervously. He lowers the body in a wheelbarrow, removes Mathis’ watch from his sleeve, takes out the map, and places the watch aside. They stroll away, leaving the body leaning amid the flower pots in the wheelbarrow. The bicycle zips down a grassy lane. M glares icily. The bicycle glides through the lush, verdant. It arrives at a small train station. The woman, with a velvet scarf and a wide-brimmed hat, is. He turns as Bond his sweater to cover a stain on his vest. Bond glances at an old glider as Camille steps out of the vehicle. The ageing glider lurches down the meadow, kicking up a flurry of dandelions in it. The woman in a hat is already on the loudspeaker as the old glider ascends into the sky. A blimp floats past them and tilts for another circle. Bond steers the glider into the rise, handling the controls gently as the blimp spins to get above them. The blimp glides in. Bond swoops down into a gorge. Camille looks worried, and Bond focuses intently as they skim the gorge walls. He lifts the rudder. They land with a soft thump. He pushes the pedal in. The blimp sails down the gorge after them, perilously near to a tree branch. Fields climbs out of her corner and drifts down the glider's aisle."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Ryder gifts him a suitcase. Curly-headed Mason sets down his lemonade mug and strolls back to the gazebo. He nudges her woolen scarf. She giggles and tilts her hat towards him. He lifts her back up onto a hammock. Singer performs under a bright sun. Baskets are being passed and juices gulped. A bicycle rolls up to the outhouse. Mason dismounts, accompanied by Harmony in a vibrant green and silver jacket. He navigates through the crowd of elegant tourists. He taps another shoulder. Detective Rufus observes from a hammock. They peer out from a wooden railing. She mimics him and he tugs her softly against the smooth banister. The tall Spaniard departs. Harmony strolls by. The detectives are reclining together. He stands up as he walks over to the passenger side of the bicycle. Skateboarders trail them. He locks the vehicle. The two skateboarders arrive behind. Mason hands over his notebook to the kid who is wearing a top hat in the afternoon. As he opens it, the kid writes. Ryder is crouching in the basement. Mason drags the sleeping girl out. With his friend's camera, places the other down, happily clicks him and shuts the lens and pushes it under a chair. Mason rocks him in his arms. Lyn watches them. His chin rests against Mason’s arm. Blankly, Mason checks for a heartbeat. Lyn steps awkwardly. He places the mannequin in a crate, picks Ryder’s umbrella from his coat, takes out the coins, and drops the umbrella beside. They wander off, leaving the mannequin nestled among the trash cans in the garage. The bicycle rides down a forest path. O gazes warmly. The bicycle pedals through the leafy, lush. It reaches a small marina. The sailor, in a woolen coat and silk tie, is. He faces Mason his coat to hide a ketchup stain on his tie. Mason gazes at an old cargo sailing ship as Lyn climbs out of the vehicle. The aging schooner sails across the water, raising a cloud of mist in it. The sailor in a tie is already on the horn as the old ship floats to the sea. A schooner sails past them and tilts for another route. Mason steers the ship into the open sea, adjusting the rudder rapidly as the schooner spins to get behind them. The schooner sails in. Mason pilots down into a lagoon. Lyn looks nervous, and Mason concentrates deeply as they drift above the coral reef. He raises the anchor. They touch the water gently. He pushes the rudder open again. The schooner races down the lagoon after them, dangerously close to a coral cliff. Harmony rises from her table and walks down the ship's deck."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Mathis gives Bond an envelope. Bond, tousle-headed, sets aside his champagne and heads to the bedroom, sharing a moment with a woman. At a glamorous party, Bond and Fields arrive in a Range Rover, moving through the crowd as CIA agent Felix observes. Bond, in an intense moment, confronts men who later follow him. He deals with a confrontation involving motorcyclists and cops, discovering Mathis unconscious in the trunk. After a tragic event, Bond discards Mathis' body in a dumpster while Camille watches. The Range Rover journeys down a desert highway to a small airstrip. Bond and Camille board an old plane as a man in a leather jacket, and hat looks on. As they fly, a fighter jet attacks, leading Bond to engage in a tense aerial chase. With Camille alarmed, Bond expertly maneuvers through a valley, narrowly evading the fighter in a thrilling sequence, as Fields moves down the plane's fuselage."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Fields gets out of her seat and moves down the plane's fuselage The fighter hurtles down the valley after them perilously close to a rocky outcrop He pulls the throttle back open They hit the ground hard He lowers the undercarriage Camille looks alarmed and Bond concentrates hard as they skim the valley floor Bond flies down into a valley The fighter streaks in Bond puts the plane into the dive working the controls furiously as the fighter loops to get behind them A fighter streaks past them and banks for another pass The man in a hat is already on the phone as the old plane takes to the air The ageing DC3 Dakota lumbers down the runway raising a cloud of dust in it Bond looks at an old propeller transport plane as Camille gets out of the car He turns as Bond his jacket to cover a bloodstain on his shirt The man in a leather jacket and brimmed hat is It arrives at a small airstrip The Range Rover drives through the dusty barren M stares coldly The Range Rover heads down a desert highway They walk off leaving the body slumped amid the rubbish bags in the dumpster He drops the body in a dumpster removes Mathis’ wallet from his jacket takes out the cash and tosses the wallet aside Camille shifts uneasily Bond feels for a pulse Expressionlessly His head slumps against Bond's shoulder Camille watches them Bond cradles him in his arms With his colleague’s gun throws the other down calmly shoots him and empties the gun and tosses it aside Bond pulls the unconscious man out Mathis is lying in the trunk As he opens it the cop draws Bond hands over his license to the cop who is wearing dark glasses at night The two motorcycle cops pull up behind He parks the car Motorcyclists follow them He belts up as he goes around to the driver's side of the Range Rover The CIA men are sitting together Fields passes The thin German arrives She kisses him and he shoves her hard against the crumbling stonework They look down from a stone balustrade CIA agent Felix watches from a sofa He shakes another hand He moves through the press of glamorous partygoers Bond gets out accompanied by Fields in a glamorous black and gold dress A Range Rover pulls up at the entrance Trays are being served and cocktails sipped DJ plays under a full moon He pulls her back down onto a bed She smiles and turns her face towards him He kisses her naked back Tousleheaded Bond puts down his champagne glass and heads back to the bedroom Mathis hands him an envelope"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "He moves through the press of glamorous partygoers Mathis is lying in the trunk With his colleague’s gun throws the other down calmly shoots him and empties the gun and tosses it aside She smiles and turns her face towards him Bond hands over his license to the cop who is wearing dark glasses at night The man in a leather jacket and brimmed hat is The CIA men are sitting together He turns as Bond his jacket to cover a bloodstain on his shirt He parks the car CIA agent Felix watches from a sofa They hit the ground hard Bond pulls the unconscious man out They walk off leaving the body slumped amid the rubbish bags in the dumpster Expressionlessly Camille shifts uneasily Bond puts the plane into the dive working the controls furiously as the fighter loops to get behind them He pulls her back down onto a bed His head slumps against Bond's shoulder He shakes another hand Bond cradles him in his arms The Range Rover drives through the dusty barren Mathis hands him an envelope The fighter streaks in Motorcyclists follow them The man in a hat is already on the phone as the old plane takes to the air The fighter hurtles down the valley after them perilously close to a rocky outcrop M stares coldly He lowers the undercarriage Bond feels for a pulse The two motorcycle cops pull up behind As he opens it the cop draws They look down from a stone balustrade Fields gets out of her seat and moves down the plane's fuselage He drops the body in a dumpster removes Mathis’ wallet from his jacket takes out the cash and tosses the wallet aside Bond flies down into a valley She kisses him and he shoves her hard against the crumbling stonework The ageing DC3 Dakota lumbers down the runway raising a cloud of dust in it He pulls the throttle back open He kisses her naked back Camille watches them It arrives at a small airstrip DJ plays under a full moon The Range Rover heads down a desert highway A fighter streaks past them and banks for another pass Trays are being served and cocktails sipped Bond gets out accompanied by Fields in a glamorous black and gold dress The thin German arrives Fields passes He belts up as he goes around to the driver's side of the Range Rover Camille looks alarmed and Bond concentrates hard as they skim the valley floor Tousleheaded Bond puts down his champagne glass and heads back to the bedroom A Range Rover pulls up at the entrance Bond looks at an old propeller transport plane as Camille gets out of the car"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Camille watches them His head slumps against Bond's shoulder Expressionlessly Bond feels for a pulse Camille shifts uneasily He drops the body in a dumpster removes Mathis’ wallet from his jacket takes out the cash and tosses the wallet aside They walk off leaving the body slumped amid the rubbish bags in the dumpster The Range Rover heads down a desert highway M stares coldly The Range Rover drives through the dusty barren It arrives at a small airstrip The man in a leather jacket and brimmed hat is He turns as Bond his jacket to cover a bloodstain on his shirt Bond looks at an old propeller transport plane as Camille gets out of the car The ageing DC3 Dakota lumbers down the runway raising a cloud of dust in it The man in a hat is already on the phone as the old plane takes to the air A fighter streaks past them and banks for another pass Bond puts the plane into the dive working the controls furiously as the fighter loops to get behind them The fighter streaks in Bond flies down into a valley Camille looks alarmed and Bond concentrates hard as they skim the valley floor He lowers the undercarriage They hit the ground hard He pulls the throttle back open The fighter hurtles down the valley after them perilously close to a rocky outcrop Fields gets out of her seat and moves down the plane's fuselage Mathis hands him an envelope Tousleheaded Bond puts down his champagne glass and heads back to the bedroom He kisses her naked back She smiles and turns her face towards him He pulls her back down onto a bed DJ plays under a full moon Trays are being served and cocktails sipped A Range Rover pulls up at the entrance Bond gets out accompanied by Fields in a glamorous black and gold dress He moves through the press of glamorous partygoers He shakes another hand CIA agent Felix watches from a sofa They look down from a stone balustrade She kisses him and he shoves her hard against the crumbling stonework The thin German arrives Fields passes The CIA men are sitting together He belts up as he goes around to the driver's side of the Range Rover Motorcyclists follow them He parks the car The two motorcycle cops pull up behind Bond hands over his license to the cop who is wearing dark glasses at night As he opens it the cop draws Mathis is lying in the trunk Bond pulls the unconscious man out With his colleague’s gun throws the other down calmly shoots him and empties the gun and tosses it aside Bond cradles him in his arms"
        }
      ]
    }
  ]
}