{
  "ground_truth": "Joe looks taken aback, but pleasantly so, as a girl, Tina, sits up nearby. They carefully lower the sheriff, who is up on his feet, and Joe, Alice, and Tina follow him through the alien's maze of equipment. The sheriff shines his flashlight ahead, and Cary rounds the corner while being pursued by an alien in a dark tunnel. The alien suddenly stops in its tracks and grabs the sheriff. The others flee, but Tina, bringing up the rear, is snatched by the creature and pulled back into the darkness. The alien comes after Joe and the others, who run down a dark tunnel until they reach a dead end and are forced to stop. The alien emerges from the shadows, and while Alice and Cary cower back, Joe stands his ground as it draws closer. The alien draws itself up to its full height of about 25 feet, and Joe steps towards it. The alien cocks its head and picks Joe up, holding him close to its face to get a look at him. It has a skull-like face with huge mandibles, and its breath ruffles Joe's hair as it breathes on him. The alien leans in close, retracts some protective membranes from over its eyes, and its expression softens. It looks away momentarily upon hearing the machinery, then turns back to Joe. Alice watches warily as the alien puts Joe back on the ground and turns to run away up the tunnel on its many legs, leaving Joe to stare after it, catching his breath. Back on the surface, Joe, Alice, and Cary join troops on a street in town, where a strange magnetic force pulls metal items up off the ground towards the water tower. A bin, oil barrels, a table lamp, a bicycle, and other objects are drawn irresistibly to the tower and stick to its side. A shop window bursts open and television sets are sucked into the air, and a soldier is lifted about 20 feet into the air by his rifle before letting go. A car rises out of the used car lot, and a military container lorry bursts open to release white cubes that flood out. Joe, Alice, and Cary dive to the ground as cubes pass overhead, and these cubes, along with cars and other items, begin to fuse together, forming a gigantic structure on top of the tower.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Joe appears surprised, but contentedly so, as a girl, Tina, rises up nearby. They gently lower the sheriff, who is upright on his feet, and Joe, Alice, and Tina trail him through the alien's labyrinth of apparatus. The sheriff illuminates his flashlight forward, and Cary turns the corner while being chased by an alien in a dim tunnel. The alien abruptly halts in its path and seizes the sheriff. The others escape, but Tina, bringing up the rear, is grabbed by the creature and pulled back into the shadows. The alien pursues Joe and the others, who dash down a dim tunnel until they reach a dead end and are compelled to halt. The alien emerges from the obscurity, and while Alice and Cary shrink back, Joe holds his position as it approaches. The alien elevates itself to its full height of about 25 feet, and Joe steps towards it. The alien tilts its head and lifts Joe up, holding him near to its face to get a glance at him. It has a skull-like visage with enormous mandibles, and its breath tousles Joe's hair as it exhales on him. The alien leans in close, retracts some protective films from over its eyes, and its expression softens. It glances away momentarily upon hearing the machinery, then turns back to Joe. Alice observes cautiously as the alien places Joe back on the ground and turns to flee up the tunnel on its numerous legs, leaving Joe to gaze after it, catching his breath. Back on the surface, Joe, Alice, and Cary join soldiers on a street in town, where a peculiar magnetic force pulls metal objects up off the ground towards the water tower. A bin, oil drums, a table lamp, a bicycle, and other objects are drawn irresistibly to the tower and adhere to its side. A shop window shatters open and television sets are sucked into the air, and a soldier is lifted about 20 feet into the air by his rifle before releasing it. A car ascends out of the used car lot, and a military container truck bursts open to discharge white cubes that flood out. Joe, Alice, and Cary dive to the ground as cubes pass overhead, and these cubes, along with cars and other objects, begin to merge together, forming an enormous structure on top of the tower."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Joe looks taken aback, but pleasantly so, as a girl, Tina, is seen sitting up nearby. The sheriff is carefully lowered by them, who is up on his feet, and he is followed by Joe, Alice, and Tina through the alien's maze of equipment. The flashlight is shone ahead by the sheriff, and Cary rounds the corner while an alien in a dark tunnel pursues him. The sheriff is grabbed by the alien after it suddenly stops in its tracks. The others flee, but the creature snatches Tina, who is bringing up the rear, and she is pulled back into the darkness. Joe and the others are pursued by the alien down a dark tunnel until a dead end is reached, forcing them to stop. The shadows conceal the alien until it emerges, and while Alice and Cary cower back, Joe stands his ground as it draws closer. Joe steps towards the alien, which draws itself up to its full height of about 25 feet. Joe is picked up by the alien, which then holds him close to its face to get a look at him. A skull-like face with huge mandibles belongs to it, and Joe's hair is ruffled by its breath as it breathes on him. Close the alien leans in, retracting some protective membranes from over its eyes, and its expression softens. Upon hearing the machinery, it looks away momentarily, then turns back to Joe. The alien is watched warily by Alice as Joe is put back on the ground by it, and then it turns to run away up the tunnel on its many legs, leaving Joe to stare after it, catching his breath. The surface is reached by Joe, Alice, and Cary, who join troops on a street in town, where metal items are pulled by a strange magnetic force up off the ground towards the water tower. The tower irresistibly draws a bin, oil barrels, a table lamp, a bicycle, and other objects to its side. A shop window bursts open, and television sets are sucked into the air, while his rifle lifts a soldier about 20 feet into the air before he lets go. A car is seen rising out of the used car lot, and white cubes are released as a military container lorry bursts open. Joe, Alice, and Cary dive to the ground as cubes pass overhead, and cars and other items, along with these cubes, are fused together, forming a gigantic structure on top of the tower."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Joe looks pleasantly surprised as Tina sits nearby. They lower the sheriff, who is on his feet, and follow him through the alien's maze of gear. The sheriff lights the way, and Cary rounds a corner, chased by an alien in a tunnel. The alien stops, grabs the sheriff, and the others flee, but Tina is caught and pulled into darkness. The alien chases Joe and the others to a dead end. As it emerges, Alice and Cary cower while Joe stands his ground. The alien, about 25 feet tall, picks Joe up to examine him with a skull-like face and large mandibles. Its breath ruffles his hair, and its expression softens as it leans in, retracting protective membranes from its eyes. Hearing machines, it looks away, then sets Joe down and escapes up the tunnel. On the surface, Joe, Alice, and Cary join troops on a street where a magnetic force pulls metal items to the water tower. A bin, barrels, lamp, bicycle, and more adhere to the tower. A shop window bursts, televisions are sucked out, and a soldier is lifted by his rifle. A car rises, and a military container releases white cubes, which, along with cars and other items, form a gigantic structure on the tower."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Joe is surprised, as Tina sits up nearby. They lower the standing sheriff, and Joe, Alice, and Tina follow him through the alien's maze. The sheriff shines his flashlight, and Cary is pursued by an alien in a dark tunnel. The alien grabs the sheriff, and the others flee, but Tina is caught by the creature. They run until reaching a dead end. The alien emerges, and while Alice and Cary cower, Joe stands firm. The alien, towering at 25 feet, picks Joe up to see him. With a skull-like face and mandibles, it examines Joe, then softly pulls him close. It hears machinery, puts Joe down, and runs away. On the surface, Joe, Alice, and Cary join troops in town as a magnetic force pulls metal towards the water tower. Objects like a bicycle and television sets are drawn to the tower. A soldier is lifted by his rifle, and a car rises. A military lorry releases cubes that form a structure atop the tower."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Joe appears genuinely surprised, but in a pleasantly unexpected way, as a girl named Tina suddenly sits up nearby. Together, they proceed with great care to gently lower the sheriff to the ground, who, despite the circumstances, manages to get back on his feet. As he begins to move forward, Joe, Alice, and Tina trail closely behind him through the intricate maze of equipment crafted by the alien. In the dim light, the sheriff diligently shines his flashlight ahead, illuminating the path, while Cary makes his way around the corner, with an alien in hot pursuit within the dark, ominous tunnel. Suddenly, the alien halts abruptly in its movements and seizes the sheriff with remarkable swiftness. The group immediately scrambles to escape, but unfortunately, Tina, who is at the back of the fleeing group, is grabbed by the creature and dragged back into the pitch darkness. Meanwhile, the alien relentlessly chases after Joe and the remaining group members down a shadowy tunnel, until they reach an impassable dead end and are forced to stop in their tracks. Emerging menacingly from the shadows, the alien approaches, and as Alice and Cary shrink back in fear, Joe courageously stands his ground in the presence of the encroaching creature. The alien unfolds and stretches up to its impressive full height of approximately 25 feet, and Joe bravely steps forward to confront it. Inquisitively, the alien tilts its head and lifts Joe, holding him close to its face for an up-close examination. The alien possesses a skull-like visage adorned with massive mandibles, and its breath tousles Joe's hair as it exhales. Leaning in even closer, the alien retracts protective membranes from its eyes, and its previously stern expression softens noticeably. Momentarily distracted by the sound of machinery, the alien glances away, only to turn its attention back to Joe. Meanwhile, Alice watches with cautious vigilance as the alien gently places Joe back onto the ground, then swiftly turns to scuttle away up the tunnel on its multiple legs, leaving Joe standing there to watch it retreat, trying to catch his breath after the intense encounter. As they return to the surface, Joe, Alice, and Cary join forces with troops stationed on a street in town, where an unusual magnetic force begins to pull metal objects off the ground with incredible strength, drawing them towards the towering water tower. Items such as a large bin, several oil barrels, a table lamp, and even a bicycle are irresistibly attracted to the tower's side, sticking to it as if magnetized. In a dramatic burst, a shop window shatters open, and television sets are pulled into the air, while a soldier is lifted up to a height of approximately 20 feet when his rifle is drawn upwards, forcing him to release it. A car unexpectedly rises from within the used car lot, and a military container lorry explodes open, releasing a multitude of white cubes that spill out in every direction. Reacting swiftly, Joe, Alice, and Cary dive to the ground for safety, as the cubes fly overhead. These white cubes, along with cars and other objects, gradually start to merge together, creating an enormous structure atop the water tower."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Joe, with a look of pure astonishment on his face, seems genuinely taken aback, although in a pleasantly unexpected manner, when a girl named Tina suddenly sits up nearby. With a shared sense of urgency and mutual understanding, they both proceed with great care and attention to detail to gently lower the sheriff to the ground. Despite the dire circumstances, the sheriff remarkably manages to get back on his feet. As he begins to move forward with determination, Joe, Alice, and Tina follow closely behind him as they make their way through the intricate and complex maze of equipment, carefully crafted by the alien. In the dim and shadowy light, the sheriff diligently shines his trusty flashlight ahead, illuminating their path, while Cary cautiously makes his way around the corner, with an alien hot on his trail within the dark and ominous tunnel. All of a sudden, the alien comes to an abrupt halt in its movements and seizes the sheriff with remarkable speed and swiftness. The group immediately scrambles in a desperate attempt to escape, but unfortunately, Tina, who happens to be at the very back of the fleeing group, is grabbed by the creature and dragged back into the pitch-black darkness. Meanwhile, the alien persistently chases after Joe and the remaining group members down a shadowy and foreboding tunnel, until they reach an unavoidable dead end and are forced to come to a complete stop. Emerging menacingly from the shadows, the alien steadily approaches, and as Alice and Cary shrink back in terror and fear, Joe courageously stands his ground in the presence of the encroaching and intimidating creature. The alien unfolds and stretches up to its impressive and intimidating full height of approximately 25 feet, and Joe bravely and boldly steps forward to confront it. Inquisitively, the alien tilts its head and lifts Joe with ease, holding him very close to its face for an up-close and personal examination. The alien possesses a skull-like visage adorned with massive and formidable mandibles, and its breath tousles Joe's hair as it exhales. Leaning in even closer for a better look, the alien retracts the protective membranes from its eyes, and its previously stern and fearsome expression noticeably softens. Momentarily distracted by the sudden sound of nearby machinery, the alien glances away, only to turn its attention back to Joe. Meanwhile, Alice watches with cautious vigilance as the alien gently places Joe back onto the ground, then swiftly turns to scuttle away up the tunnel on its multiple and agile legs, leaving Joe standing there, trying to catch his breath after the intense and nerve-wracking encounter. As they make their way back to the surface, Joe, Alice, and Cary quickly join forces with the troops stationed on a street in town, where an unusual and powerful magnetic force begins to pull metal objects off the ground with incredible and overwhelming strength, drawing them towards the towering and imposing water tower. Items such as a large bin, several oil barrels, a table lamp, and even a bicycle are irresistibly attracted to the side of the tower, sticking to it firmly as if magnetized. In a dramatic and sudden burst, a shop window shatters open, and television sets are pulled into the air, while a soldier is lifted up to an astonishing height of approximately 20 feet when his rifle is drawn upwards, forcing him to release it. A car unexpectedly rises from within the used car lot, and a military container lorry explodes open, releasing a multitude of small white cubes that spill out in every direction. Reacting swiftly and instinctively, Joe, Alice, and Cary dive to the ground for safety, as the cubes fly overhead. These mysterious white cubes, along with cars and other assorted objects, gradually start to merge together, creating an enormous and intricate structure atop the water tower."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Joe looks momentarily startled, his eyes widening and his mouth slightly agape in pleasant surprise, as a girl named Tina sits up nearby, drawing his attention. Together, they focus on the sheriff, who is poised to regain his footing. Carefully and with coordinated effort, they lower the sheriff down until he stands on his feet. With the sheriff now leading the way, Joe, Alice, and Tina follow closely behind him, moving cautiously through the intricate and confusing maze of the alien's equipment. The sheriff, determined to illuminate their path, shines his flashlight ahead, casting a beam of light into the dim surroundings. Meanwhile, in another section of the dark tunnel, Cary rounds a corner, his footsteps quickening as he realizes he is being pursued by the alien that ominously looms behind him. In a swift and intimidating move, the alien halts suddenly and captures the sheriff, its grip firm and unyielding. Instinctively, the others scramble to escape, their feet moving rapidly away from the scene; however, Tina, who is at the end of the fleeing group, is abruptly seized by the creature and dragged back into the enveloping darkness. With adrenaline coursing through them, Joe and the remaining group members dash madly down the dim tunnel until they find themselves abruptly halted by a dead end, forcing them to stop in their tracks. As they pause, gasping for breath, the alien emerges menacingly from the concealing shadows, its form towering and imposing. While Alice and Cary instinctively shrink back, their bodies pressed against the cool wall, Joe defiantly holds his ground. The alien, sensing his bravery, straightens itself to its full, intimidating height of approximately 25 feet. Displaying both courage and curiosity, Joe steps toward it, driven by the strange interaction unfolding. The alien, intrigued by Joe's actions, tilts its head with an air of curiosity and lifts him, bringing him close to its eyes to scrutinize him. The alien's skull-like face, marked by enormous, threatening mandibles, looms ever closer, its breath warm and unsettling as it tousles Joe's hair with each exhalation. Leaning even closer, the alien retracts membranes that guard its eyes, a sign of vulnerability, and its once fierce expression softens in a contemplative manner. The alien's concentration is briefly broken as it hears the distant hum of machinery, prompting it to look away. After a moment of hesitation, it refocuses on Joe, its demeanor shifting from aggression to acknowledgment. Alice, observing the scene with a cautious eye, watches attentively as the alien gently returns Joe to the ground. Without further threat, the alien pivots and retreats quickly, its multiple legs propelling it up the tunnel, leaving Joe to stand there, watching it disappear and taking deep breaths to still his racing heart. Returning to the surface, Joe, Alice, and Cary find themselves amidst troops stationed on a town street, where an inexplicable magnetic force begins to assert its influence. With increasing intensity, metal objects are pulled skyward, gravitating towards the water tower. The irresistible force snatches up various items—a bin, oil barrels, a table lamp, a bicycle—and swiftly adheres them to the tower’s side. The scene intensifies as a shop window shatters outward, releasing television sets that are sucked upward, and a soldier finds himself momentarily elevated about 20 feet into the air, clinging to his rifle until he releases it to descend. As if orchestrated by unseen hands, a car ascends from the used car lot, and concurrently, a military container lorry ruptures explosively to disgorge a stream of white cubes. These cubes flood the area with urgency, prompting Joe, Alice, and Cary to instinctively dive to the ground for safety as the cubes soar overhead. Amidst the controlled chaos, the cubes, along with ascending cars and other attracted items, begin integrating, assembling themselves meticulously into a massive structure that forms atop the tower in a display of otherworldly engineering."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Joe is initially surprised but pleasantly so when Tina joins him. Together with Alice, they help the sheriff to his feet and navigate through the alien's maze of equipment. As the sheriff leads with his flashlight, Cary, pursued by an alien, rounds a corner in a dark tunnel. The alien halts abruptly to seize the sheriff, prompting the group to flee. Tina, unfortunately, is captured by the creature in the chaos. Joe, Alice, and Cary continue down the tunnel until a dead end forces them to stop, where the alien emerges. While Alice and Cary retreat, Joe confronts the towering 25-foot alien. The creature lifts Joe, scrutinizing him up close with its skull-like face and huge mandibles. As it breathes, its breath ruffles Joe's hair. The alien's demeanor softens as it retracts protective membranes from its eyes. Distracted momentarily by machinery sounds, the alien then gently places Joe back on the ground before retreating. Joe watches it disappear into the tunnel, regaining his composure. On the surface, Joe, Alice, and Cary join troops in town where a mysterious magnetic force starts pulling metal objects towards the water tower. Various items, including oil barrels, a bicycle, and even shop window televisions, are drawn toward the tower, sticking to its side. A soldier rises into the air until releasing his rifle, while a car lifts from a lot and a military container releases white cubes. Joe, Alice, and Cary dive as these cubes, along with cars and other items, merge into a massive structure atop the tower."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Joe looks taken aback, but pleasantly so, as a girl, Tina, who is known for her quick thinking in tense situations, sits up nearby. They carefully lower the sheriff, who is up on his feet, and Joe, Alice, and Tina follow him through the alien's maze of equipment, a bewildering array of advanced technology that seems beyond human understanding. The sheriff shines his flashlight ahead, a model issued to law enforcement due to its powerful beam, and Cary rounds the corner while being pursued by an alien in a dark tunnel beneath the town, part of an old mining shaft used in the 19th century. The alien suddenly stops in its tracks and grabs the sheriff, a move demonstrating its lightning-fast reflexes. The others flee, but Tina, bringing up the rear, is snatched by the creature and pulled back into the darkness reminiscent of ancient predator tactics. The alien comes after Joe and the others, who run down a dark tunnel until they reach a dead end and are forced to stop. The alien emerges from the shadows, and while Alice and Cary cower back, Joe stands his ground as it draws closer. The alien draws itself up to its full height of about 25 feet, towering over them like a prehistoric giant. Joe steps towards it with a mix of fear and curiosity. The alien cocks its head and picks Joe up, holding him close to its face to get a look at him. It has a skull-like face with huge mandibles, reminiscent of prehistoric insects, and its breath ruffles Joe's hair as it breathes on him. The alien leans in close, retracts some protective membranes from over its eyes, using a biological mechanism similar to certain deep-sea creatures, and its expression softens. It looks away momentarily upon hearing the machinery, a gentle hum filling the air, then turns back to Joe. Alice watches warily as the alien puts Joe back on the ground and turns to run away up the tunnel on its many legs, leaving Joe to stare after it, catching his breath. Back on the surface, Joe, Alice, and Cary join troops on a street in town, where a strange magnetic force, possibly caused by alien technology, pulls metal items up off the ground towards the water tower. A bin, oil barrels, a table lamp, a bicycle, and other objects are drawn irresistibly to the tower and stick to its side, forming a bizarre collage. A shop window bursts open and television sets are sucked into the air, reminiscent of poltergeist activity, and a soldier is lifted about 20 feet into the air by his rifle before letting go. A car rises out of the used car lot, a surprising spectacle, and a military container lorry bursts open to release white cubes that flood out, similar to experimental military technology. Joe, Alice, and Cary dive to the ground as cubes pass overhead, and these cubes, along with cars and other items, begin to fuse together, forming a gigantic structure on top of the tower that defies architectural logic."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "A bin oil barrels a table lamp a bicycle and other objects are drawn irresistibly to the tower and stick to its side Joe looks taken aback but pleasantly so as a girl Tina sits up nearby The sheriff shines his flashlight ahead and Cary rounds the corner while being pursued by an alien in a dark tunnel Joe Alice and Cary dive to the ground as cubes pass overhead and these cubes along with cars and other items begin to fuse together forming a gigantic structure on top of the tower They carefully lower the sheriff who is up on his feet and Joe Alice and Tina follow him through the alien's maze of equipment The alien suddenly stops in its tracks and grabs the sheriff It looks away momentarily upon hearing the machinery then turns back to Joe They carefully lower the sheriff who is up on his feet and Joe Alice and Tina follow him through the alien's maze of equipment The sheriff shines his flashlight ahead and Cary rounds the corner while being pursued by an alien in a dark tunnel The alien suddenly stops in its tracks and grabs the sheriff The others flee but Tina bringing up the rear is snatched by the creature and pulled back into the darkness The alien comes after Joe and the others who run down a dark tunnel until they reach a dead end and are forced to stop The alien emerges from the shadows and while Alice and Cary cower back Joe stands his ground as it draws closer The alien draws itself up to its full height of about 25 feet and Joe steps towards it The alien cocks its head and picks Joe up holding him close to its face to get a look at him It has a skulllike face with huge mandibles and its breath ruffles Joe's hair as it breathes on him A shop window bursts open and television sets are sucked into the air and a soldier is lifted about 20 feet into the air by his rifle before letting go The alien leans in close retracts some protective membranes from over its eyes and its expression softens It looks away momentarily upon hearing the machinery then turns back to Joe The alien cocks its head and picks Joe up holding him close to its face to get a look at him Alice watches warily as the alien puts Joe back on the ground and turns to run away up the tunnel on its many legs leaving Joe to stare after it catching his breath Back on the surface Joe Alice and Cary join troops on a street in town where a strange magnetic force pulls metal items up off the ground towards the water tower A bin oil barrels a table lamp a bicycle and other objects are drawn irresistibly to the tower and stick to its side A shop window bursts open and television sets are sucked into the air and a soldier is lifted about 20 feet into the air by his rifle before letting go A car rises out of the used car lot and a military container lorry bursts open to release white cubes that flood out Joe looks taken aback but pleasantly so as a girl Tina sits up nearby Joe Alice and Cary dive to the ground as cubes pass overhead and these cubes along with cars and other items begin to fuse together forming a gigantic structure on top of the tower"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Joe looks taken aback but pleasantly so as a girl Tina sits up nearby. They carefully lower the sheriff who is up on his feet and Joe Alice and Tina follow him through the alien's maze of equipment. The sheriff shines his flashlight ahead and Cary rounds the corner while being pursued by an alien in a dark tunnel. The alien suddenly stops in its tracks and grabs the sheriff. The others flee but Tina bringing up the rear is snatched by the creature and pulled back into the darkness. The alien comes after Joe and the others who run down a dark tunnel until they reach a dead end and are forced to stop. The alien emerges from the shadows and while Alice and Cary cower back Joe stands his ground as it draws closer. The alien draws itself up to its full height of about 25 feet and Joe steps towards it. The alien cocks its head and picks Joe up holding him close to its face to get a look at him. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. It has a skulllike face with huge mandibles and its breath ruffles Joe's hair as it breathes on him. The alien leans in close retracts some protective membranes from over its eyes and its expression softens. It looks away momentarily upon hearing the machinery then turns back to Joe. Alice watches warily as the alien puts Joe back on the ground and turns to run away up the tunnel on its many legs leaving Joe to stare after it catching his breath. Back on the surface Joe Alice and Cary join troops on a street in town where a strange magnetic force pulls metal items up off the ground towards the water tower. A bin oil barrels a table lamp a bicycle and other objects are drawn irresistibly to the tower and stick to its side. A shop window bursts open and television sets are sucked into the air and a soldier is lifted about 20 feet into the air by his rifle before letting go. A car rises out of the used car lot and a military container lorry bursts open to release white cubes that flood out. Joe Alice and Cary dive to the ground as cubes pass overhead and these cubes along with cars and other items begin to fuse together forming a gigantic structure on top of the tower."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Joe looks taken aback but pleasantly so as a girl Tina sits up nearby. They carefully lower the sheriff who is up on his feet and Joe Alice and Tina follow him through the alien's maze of equipment. The sheriff shines his flashlight ahead and Cary rounds the corner while being pursued by an alien in a dark tunnel. The alien suddenly stops in its tracks and grabs the sheriff. The others flee but Tina bringing up the rear is snatched by the creature and pulled back into the darkness. The alien comes after Joe and the others who run down a dark tunnel until they reach a dead end and are forced to stop. The alien emerges from the shadows and while Alice and Cary cower back Joe stands his ground as it draws closer. The alien draws itself up to its full height of about 25 feet and Joe steps towards it. The alien cocks its head and picks Joe up holding him close to its face to get a look at him. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. It has a skulllike face with huge mandibles and its breath ruffles Joe's hair as it breathes on him. The alien leans in close retracts some protective membranes from over its eyes and its expression softens. It looks away momentarily upon hearing the machinery then turns back to Joe. Alice watches warily as the alien puts Joe back on the ground and turns to run away up the tunnel on its many legs leaving Joe to stare after it catching his breath. Back on the surface Joe Alice and Cary join troops on a street in town where a strange magnetic force pulls metal items up off the ground towards the water tower. A bin oil barrels a table lamp a bicycle and other objects are drawn irresistibly to the tower and stick to its side. A shop window bursts open and television sets are sucked into the air and a soldier is lifted about 20 feet into the air by his rifle before letting go. A car rises out of the used car lot and a military container lorry bursts open to release white cubes that flood out. Joe Alice and Cary dive to the ground as cubes pass overhead and these cubes along with cars and other items begin to fuse together forming a gigantic structure on top of the tower."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Joe looks taken aback but pleasantly so as a girl Tina sits up nearby. They carefully lower the sheriff who is up on his feet and Joe Alice and Tina follow him through the alien's maze of equipment. The sheriff shines his flashlight ahead and Cary rounds the corner while being pursued by an alien in a dark tunnel. The alien suddenly stops in its tracks and grabs the sheriff. The others flee but Tina bringing up the rear is snatched by the creature and pulled back into the darkness. A bin oil barrels a table lamp a bicycle and other objects are drawn irresistibly to the tower and stick to its side. A shop window bursts open and television sets are sucked into the air and a soldier is lifted about 20 feet into the air by his rifle before letting go. A car rises out of the used car lot and a military container lorry bursts open to release white cubes that flood out. Joe Alice and Cary dive to the ground as cubes pass overhead and these cubes along with cars and other items begin to fuse together forming a gigantic structure on top of the tower."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Joe looks taken aback but pleasantly so as a girl Tina sits up nearby. They carefully lower the sheriff who is up on his feet and Joe Alice and Tina follow him through the alien's maze of equipment. A car rises out of the used car lot and a military container lorry bursts open to release white cubes that flood out. Joe Alice and Cary dive to the ground as cubes pass overhead and these cubes along with cars and other items begin to fuse together forming a gigantic structure on top of the tower."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Bob looks taken aback, but pleasantly so, as a monkey, Sam, sits up nearby. They carefully lower the librarian, who is up on his feet, and Bob, Linda, and Sam follow him through the alien's maze of equipment. The librarian shines his flashlight ahead, and Terry rounds the corner while being pursued by an alien in a dark tunnel. The alien suddenly stops in its tracks and grabs the librarian. The others flee, but Sam, bringing up the rear, is snatched by the creature and pulled back into the darkness. The alien comes after Bob and the others, who run down a dark tunnel until they reach a dead end and are forced to stop. The alien emerges from the shadows, and while Linda and Terry cower back, Bob stands his ground as it draws closer. The alien draws itself up to its full height of about 25 feet, and Bob steps towards it. The alien cocks its head and picks Bob up, holding him close to its face to get a look at him. It has a skull-like face with huge mandibles, and its breath ruffles Bob's hair as it breathes on him. The alien leans in close, retracts some protective membranes from over its eyes, and its expression softens. It looks away momentarily upon hearing the machinery, then turns back to Bob. Linda watches warily as the alien puts Bob back on the ground and turns to run away up the tunnel on its many legs, leaving Bob to stare after it, catching his breath. Back on the surface, Bob, Linda, and Terry join clowns on a street in town, where a strange magnetic force pulls metal items up off the ground towards the water tower. A bin, oil barrels, a table lamp, a bicycle, and other objects are drawn irresistibly to the tower and stick to its side. A shop window bursts open and television sets are sucked into the air, and a plumber is lifted about 20 feet into the air by his rifle before letting go. A car rises out of the used car lot, and a military container lorry bursts open to release white cubes that flood out. Bob, Linda, and Terry dive to the ground as cubes pass overhead, and these cubes, along with cars and other items, begin to fuse together, forming a gigantic structure on top of the tower."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Joe looks taken aback, but pleasantly so, as a girl, Tina, sits up nearby. They carefully lower the pirate, who is up on his feet, and Joe, Alice, and Tina follow him through the dragon's labyrinth of treasures. The pirate shines his lantern ahead, and Cary rounds the corner while being pursued by a dragon in a dark cavern. The dragon suddenly stops in its tracks and grabs the pirate. The others flee, but Tina, bringing up the rear, is snatched by the creature and pulled back into the shadows. The dragon comes after Joe and the others, who run down a dark cavern until they reach a dead end and are forced to stop. The dragon emerges from the darkness, and while Alice and Cary cower back, Joe stands his ground as it draws closer. The dragon draws itself up to its full height of about 25 feet, and Joe steps towards it. The dragon cocks its head and picks Joe up, holding him close to its face to get a look at him. It has a skeletal face with huge fangs, and its breath ruffles Joe's hair as it breathes on him. The dragon leans in close, retracts some protective scales from over its eyes, and its expression softens. It looks away momentarily upon hearing the seagulls, then turns back to Joe. Alice watches warily as the dragon puts Joe back on the ground and turns to scurry away up the cavern on its many legs, leaving Joe to stare after it, catching his breath. Back on the surface, Joe, Alice, and Cary join knights on a bridge in town, where a strange magnetic force pulls metal items up off the ground towards the lighthouse. A trash can, oil drums, a torch, a tricycle, and other objects are drawn irresistibly to the lighthouse and stick to its side. A storefront window bursts open and radios are sucked into the air, and a knight is lifted about 20 feet into the air by his sword before letting go. A wagon rises out of the antique shop, and a supply container truck bursts open to release white spheres that flood out. Joe, Alice, and Cary dive to the ground as spheres pass overhead, and these spheres, along with wagons and other items, begin to fuse together, forming a gigantic monument on top of the lighthouse."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Joe appears startled, but pleasantly so, as a girl, Tina, stands nearby. They gently raise the sheriff, who is up on his feet, and Joe, Alice, and Tina escort him through the alien's maze of equipment. The sheriff brandishes his flashlight ahead, and Cary turns the corner while being observed by an alien in a dark tunnel. The alien abruptly stays in its tracks and nudges the sheriff. The others scatter, but Tina, trailing behind, is pounced on by the creature and swept back into the darkness. The alien advances toward Joe and the others, who dash down a dark tunnel until they reach a cul-de-sac and are compelled to pause. The alien emerges from the shadows, and while Alice and Cary recoil, Joe holds his ground as it advances. The alien extends itself to its full height of about 25 feet, and Joe advances towards it. The alien tilts its head and lifts Joe, holding him near its face to inspect him. It has a skull-like face with huge mandibles, and its breath tousles Joe's hair as it exhales on him. The alien leans in close, retracts some protective membranes from over its eyes, and its demeanor softens. It gazes away briefly upon hearing the machinery, then turns back to Joe. Alice observes cautiously as the alien places Joe back on the ground and pivots to scuttle away up the tunnel on its many legs, leaving Joe to ponder after it, catching his breath. Back on the surface, Joe, Alice, and Cary converge with troops on a street in town, where a strange magnetic force hoists metal items up off the ground towards the water tower. A bin, oil barrels, a table lamp, a bicycle, and other objects are magnetized to the tower and adhere to its side. A shop window shatters open and television sets are whisked into the air, and a soldier is elevated about 20 feet into the air by his rifle before releasing it. A car floats out of the used car lot, and a military container lorry cracks open to release white cubes that spill out. Joe, Alice, and Cary duck to the ground as cubes soar overhead, and these cubes, along with cars and other items, begin to amalgamate, forming a gigantic structure on top of the tower."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Tom looks taken aback, but pleasantly so, as a cat, Lucy, stretches up nearby. They carefully lower the gardener, who is up on his feet, and Tom, Sam, and Lucy follow him through the giraffe's labyrinth of instruments. The gardener shines his lantern ahead, and Max rounds the corner while being pursued by a giraffe in a dim hallway. The giraffe suddenly stops in its tracks and grabs the gardener. The others flee, but Lucy, bringing up the rear, is snatched by the creature and pulled back into the shadows. The giraffe comes after Tom and the others, who run down a dim hallway until they reach a dead end and are forced to stop. The giraffe emerges from the shadows, and while Sam and Max cower back, Tom stands his ground as it draws closer. The giraffe draws itself up to its full height of about 25 feet, and Tom steps towards it. The giraffe cocks its head and picks Tom up, holding him close to its face to get a look at him. It has a skull-like face with huge tendrils, and its breath ruffles Tom's hair as it breathes on him. The giraffe leans in close, retracts some protective coverings from over its eyes, and its expression softens. It looks away momentarily upon hearing the contraptions, then turns back to Tom. Sam watches warily as the giraffe puts Tom back on the ground and turns to run away up the corridor on its many legs, leaving Tom to stare after it, catching his breath. Back on the surface, Tom, Sam, and Max join chefs on a pier in town, where a strange magnetic force pulls metallic bits up off the ground towards the lighthouse. A cart, fuel drums, a desk lamp, a tricycle, and other items are drawn irresistibly to the lighthouse and stick to its side. A warehouse window bursts open and computer monitors are sucked into the air, and a sailor is lifted about 20 feet into the air by his clipboard before letting go. A truck rises out of the parking area, and a shipping crate lorry bursts open to release blue pyramids that flood out. Tom, Sam, and Max dive to the ground as pyramids pass overhead, and these pyramids, along with trucks and other items, begin to fuse together, forming a gigantic structure on top of the lighthouse."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Sam feels baffled, but cheerfully so, as a boy, Mike, stands up nearby. They gently hoist the librarian, who is up on her feet, and Sam, Emily, and Mike shadow her through the dragon's labyrinth of paraphernalia. The librarian flicks her lantern ahead, and Jamie slips around the bend while being tracked by a dragon in a dim cavern. The dragon suddenly halts and seizes the librarian. The others bolt, but Mike, lagging behind, is grabbed by the beast and pulled back into the shadows. The dragon pursues Sam and the others, who sprint down a dim cavern until they reach a cul-de-sac and are compelled to halt. The dragon steps out from the gloom, and while Emily and Jamie shrink back, Sam holds his position as it approaches. The dragon rears up to its full height of about 25 feet, and Sam advances towards it. The dragon inclines its head and lifts Sam up, holding him near to its face to examine him. It has a skeletal visage with vast mandibles, and its breath tousles Sam's hair as it exhales on him. The dragon leans in close, retracts some protective scales from over its eyes, and its demeanor softens. It glances away momentarily upon hearing the machinery, then turns back to Sam. Emily observes cautiously as the dragon sets Sam back on the ground and turns to dash away up the cavern on its many legs, leaving Sam to gaze after it, catching his breath. Back on the surface, Sam, Emily, and Jamie join explorers on a street in town, where a bizarre magnetic force draws metallic objects up off the ground towards the water tower. A trash can, oil drums, a floor lamp, a tricycle, and other items are pulled irresistibly to the tower and adhere to its side. A storefront shatters and computer screens are drawn into the air, and an explorer is hoisted about 20 feet into the air by his camera before releasing it. A truck rises out of the used truck lot, and a delivery container lorry bursts open to release white spheres that flood out. Sam, Emily, and Jamie plummet to the ground as spheres pass overhead, and these spheres, along with trucks and other objects, begin to conjoin, forming a colossal structure atop the tower."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Joe looks astonished, but happily so, as a girl, Tina, stretches out nearby. They cautiously inflate the gardener, who is on his skateboard, and Joe, Alice, and Tina trail him through the butterfly’s labyrinth of gadgets. The gardener waves his lantern forward, and Cary sidles around the corner while being chased by a dinosaur in a bright cave. The dinosaur suddenly halts in its tracks and seizes the gardener. The others scatter, but Tina, lingering at the back, is captured by the creature and whisked back into the brightness. The dinosaur follows Joe and the others, who sprint down a bright cave until they reach a cul-de-sac and are compelled to pause. The dinosaur emerges from the light, and while Alice and Cary retreat, Joe maintains his position as it approaches. The dinosaur stretches to its full height of about 25 feet, and Joe strides towards it. The dinosaur tilts its snout and wraps Joe up, holding him close to its muzzle to inspect him. It has a bone-like muzzle with massive pincers, and its exhalation tousles Joe's hair as it exhales on him. The dinosaur leans in closely, retracts some protective shells from over its lenses, and its demeanor softens. It glances away momentarily upon hearing the contraption, then turns back to Joe. Alice observes cautiously as the dinosaur sets Joe back on the ground and turns to scuttle away up the cave on its numerous feet, leaving Joe to gaze after it, catching his breath. Back on the surface, Joe, Alice, and Cary unite with guards on a street in town, where an odd electrical pull lifts plastic things up off the ground towards the satellite dish. A crate, paint cans, a floor lamp, a scooter, and other objects are drawn irresistibly to the dish and adhere to its side. A market window shatters open and radios are propelled into the sky, and a guard is hoisted about 20 feet into the air by his backpack before releasing it. A truck levitates out of the junkyard, and a military storage raft spills open to unleash red spheres that cascade out. Joe, Alice, and Cary drop to the ground as spheres pass overhead, and these spheres, along with trucks and other items, begin to meld together, forming an enormous edifice on top of the dish."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Fred appears bewildered, yet joyfully so, as a puppy, Lily, hops up nearby. They clumsily elevate the gardener, who is upright on his knees, and Fred, Oliver, and Lily trail him through the wizard's labyrinth of gadgets. The gardener beams his lantern forward, and Sam veers around the pillar while being chased by a wizard in a bright cave. The wizard abruptly halts in its footsteps and snatches the gardener. The rest dash away, but Lily, trailing at the end, is seized by the being and yanked back into the light. The wizard pursues Fred and the group, who sprint through a bright cave until they reach a cul-de-sac and are compelled to halt. The wizard steps from the brightness, and while Oliver and Sam shiver forward, Fred holds his position as it approaches. The wizard stretches itself to its full stature of roughly 12 feet, and Fred lunges towards it. The wizard tilts its hand and lifts Fred up, holding him close to its foot to inspect him. It has a crystal-like foot with tiny antennas, and its whisper shuffles Fred's scarf as it exhales near him. The wizard leans in near, retracts some fragile bubbles from over its toes, and its aura softens. It glances away briefly upon sensing the trapdoor, then shifts focus back to Fred. Oliver observes cautiously as the wizard sets Fred back on the ground and pivots to dash away down the pillar on its several fins, leaving Fred to gaze after it, regaining his poise. Back on the rooftop, Fred, Oliver, and Sam rally farmers on a dock in the village, where an odd electric field lifts wooden things up off the floor towards the lighthouse. A dumpster, washing machines, a candle stand, a tricycle, and other bits are attracted relentlessly to the lighthouse and adhere to its surface. A barn window pops open and radios are sucked into the breeze, and a policeman is elevated about 30 feet into the breeze by his flute before releasing it. A truck floats out of the parking garage, and a civilian cargo ship pops open to emit red spheres that swarm out. Fred, Oliver, and Sam tumble to the floor as spheres glide overhead, and these spheres, along with trucks and other bits, start to meld together, constructing a massive sculpture atop the lighthouse."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Joe is surprised but pleased when Tina joins him, Alice, and the sheriff in navigating an alien's maze. As Cary turns a corner, the alien grabs the sheriff, prompting the group to flee. Tina is captured by the alien, leaving Joe, Alice, and Cary to run until they reach a dead end. As the alien approaches, Joe bravely steps forward; the creature examines him but then retreats. On the surface, Joe, Alice, and Cary witness a magnetic force pulling metal objects, like bicycles and televisions, toward the water tower. Soldiers and various objects are lifted into the air, creating a massive structure atop the tower."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Joe Alice and Cary dive to the ground as cubes pass overhead and these cubes along with cars and other items begin to fuse together forming a gigantic structure on top of the tower A car rises out of the used car lot and a military container lorry bursts open to release white cubes that flood out A shop window bursts open and television sets are sucked into the air and a soldier is lifted about 20 feet into the air by his rifle before letting go A bin oil barrels a table lamp a bicycle and other objects are drawn irresistibly to the tower and stick to its side Back on the surface Joe Alice and Cary join troops on a street in town where a strange magnetic force pulls metal items up off the ground towards the water tower Alice watches warily as the alien puts Joe back on the ground and turns to run away up the tunnel on its many legs leaving Joe to stare after it catching his breath It looks away momentarily upon hearing the machinery then turns back to Joe The alien leans in close retracts some protective membranes from over its eyes and its expression softens It has a skulllike face with huge mandibles and its breath ruffles Joe's hair as it breathes on him The alien cocks its head and picks Joe up holding him close to its face to get a look at him The alien draws itself up to its full height of about 25 feet and Joe steps towards it The alien emerges from the shadows and while Alice and Cary cower back Joe stands his ground as it draws closer The alien comes after Joe and the others who run down a dark tunnel until they reach a dead end and are forced to stop The others flee but Tina bringing up the rear is snatched by the creature and pulled back into the darkness The alien suddenly stops in its tracks and grabs the sheriff The sheriff shines his flashlight ahead and Cary rounds the corner while being pursued by an alien in a dark tunnel They carefully lower the sheriff who is up on his feet and Joe Alice and Tina follow him through the alien's maze of equipment Joe looks taken aback but pleasantly so as a girl Tina sits up nearby"
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Back on the surface Joe Alice and Cary join troops on a street in town where a strange magnetic force pulls metal items up off the ground towards the water tower Alice watches warily as the alien puts Joe back on the ground and turns to run away up the tunnel on its many legs leaving Joe to stare after it catching his breath The others flee but Tina bringing up the rear is snatched by the creature and pulled back into the darkness It has a skulllike face with huge mandibles and its breath ruffles Joe's hair as it breathes on him The alien comes after Joe and the others who run down a dark tunnel until they reach a dead end and are forced to stop The alien draws itself up to its full height of about 25 feet and Joe steps towards it A car rises out of the used car lot and a military container lorry bursts open to release white cubes that flood out The alien emerges from the shadows and while Alice and Cary cower back Joe stands his ground as it draws closer The alien leans in close retracts some protective membranes from over its eyes and its expression softens A shop window bursts open and television sets are sucked into the air and a soldier is lifted about 20 feet into the air by his rifle before letting go They carefully lower the sheriff who is up on his feet and Joe Alice and Tina follow him through the alien's maze of equipment It looks away momentarily upon hearing the machinery then turns back to Joe The sheriff shines his flashlight ahead and Cary rounds the corner while being pursued by an alien in a dark tunnel A bin oil barrels a table lamp a bicycle and other objects are drawn irresistibly to the tower and stick to its side Joe Alice and Cary dive to the ground as cubes pass overhead and these cubes along with cars and other items begin to fuse together forming a gigantic structure on top of the tower The alien cocks its head and picks Joe up holding him close to its face to get a look at him Joe looks taken aback but pleasantly so as a girl Tina sits up nearby The alien suddenly stops in its tracks and grabs the sheriff"
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "It has a skulllike face with huge mandibles and its breath ruffles Joe's hair as it breathes on him The alien leans in close retracts some protective membranes from over its eyes and its expression softens It looks away momentarily upon hearing the machinery then turns back to Joe Alice watches warily as the alien puts Joe back on the ground and turns to run away up the tunnel on its many legs leaving Joe to stare after it catching his breath Back on the surface Joe Alice and Cary join troops on a street in town where a strange magnetic force pulls metal items up off the ground towards the water tower A bin oil barrels a table lamp a bicycle and other objects are drawn irresistibly to the tower and stick to its side A shop window bursts open and television sets are sucked into the air and a soldier is lifted about 20 feet into the air by his rifle before letting go A car rises out of the used car lot and a military container lorry bursts open to release white cubes that flood out Joe Alice and Cary dive to the ground as cubes pass overhead and these cubes along with cars and other items begin to fuse together forming a gigantic structure on top of the tower Joe looks taken aback but pleasantly so as a girl Tina sits up nearby They carefully lower the sheriff who is up on his feet and Joe Alice and Tina follow him through the alien's maze of equipment The sheriff shines his flashlight ahead and Cary rounds the corner while being pursued by an alien in a dark tunnel The alien suddenly stops in its tracks and grabs the sheriff The others flee but Tina bringing up the rear is snatched by the creature and pulled back into the darkness The alien comes after Joe and the others who run down a dark tunnel until they reach a dead end and are forced to stop The alien emerges from the shadows and while Alice and Cary cower back Joe stands his ground as it draws closer The alien draws itself up to its full height of about 25 feet and Joe steps towards it The alien cocks its head and picks Joe up holding him close to its face to get a look at him"
        }
      ]
    }
  ]
}