{
  "ground_truth": "Louis sits up in the driver's seat with his face bloodied, and he looks in his rearview mirror. Alice turns around and sees the creature. Louis tries to get out of the car and tumbles out of the passenger door, then he runs back up the street and trips over Alice's bike. Soldiers watch a colleague using a flamethrower. Charles and Joe pick up their processed film, and as they cycle off past the town's water tower, a vast plume of smoke rises just outside the town. Stuck in an indentation on the side of the water tower tank is the vibrating cube. Their footage from the night of the crash shows just clouds of smoke, but when the smoke clears, they see footage of a giant spider-like creature creeping out of a carriage. Hearing the siren, they look around in confusion, and Joe stops the projector, breaking the film off. Outside, chaos reigns on the streets as people and military personnel hurry to and fro. Joe and Charles walk down the street and see a huge pool of smoke rising above the town, while panicked families load their cars in preparation to evacuate. Troops direct traffic and issue instructions, and Charles and Joe prepare to board a bus as a convoy leaves town led by several military vehicles. They pass military container lorries carrying the white cubes recovered from the crash site on their way into town as the evacuation convoy heads out. Charles and Joe are aboard one of the buses, and the convoy eventually arrives at Greenville Air Force Base, where vehicles queue to get in through the east entrance. Inside, civilians disembark from the buses in a huge hangar, and Air Force personnel shepherd them along. Joe wanders through the hangar looking for Jack and sees Louis lying on a bed in a sickbay area. He goes over to Louis, who looks relieved, and then finds Charles, Preston, Martin, and Carrie. Meanwhile, Donnie, the camera shop guy, looks around as an armed guard opens the door and escorts him along a corridor. Jack punches the guard out, takes his gun, and, now dressed in the guard's uniform and clutching his rifle, trots along a corridor, making his way through a couple of offices. He looks outside, spots a fuel tanker nearby, and shoots it, causing an explosion that distracts the Air Force personnel. Jack then helps himself to a Jeep and drives off along an unmetaled track running through open fields. He pulls up near a grain silo, gets out of the Jeep, and sees a convoy of vehicles traveling along an adjacent road.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "Louis perches up in the driver's perch with his visage bloodied, and he glances in his rearview mirror. Alice rotates around and perceives the creature. Louis attempts to exit the automobile and tumbles out of the passenger portal, then he dashes back up the thoroughfare and stumbles over Alice's bicycle. Soldiers observe a comrade utilizing a flamethrower. Charles and Joe collect their processed film, and as they pedal off past the municipality's aqua tower, an immense plume of smoke ascends just outside the municipality. Stuck in a depression on the flank of the aqua tower tank is the vibrating cube. Their footage from the night of the crash depicts merely clouds of smoke, but when the smoke dissipates, they perceive footage of a gigantic arachnid-like creature creeping out of a carriage. Hearing the siren, they glance about in bewilderment, and Joe halts the projector, rupturing the film off. Outside, mayhem reigns on the streets as individuals and military staff hurry to and fro. Joe and Charles stroll down the street and perceive a massive pool of smoke ascending above the municipality, while panicked families load their automobiles in preparation to evacuate. Troops direct traffic and issue instructions, and Charles and Joe prepare to board a bus as a convoy departs town led by several military transporters. They pass military container lorries transporting the white cubes retrieved from the crash site on their route into town as the evacuation convoy proceeds out. Charles and Joe are aboard one of the buses, and the convoy ultimately arrives at Greenville Air Force Base, where vehicles queue to enter through the east gateway. Inside, civilians disembark from the buses in a colossal hangar, and Air Force personnel shepherd them along. Joe roams through the hangar searching for Jack and perceives Louis reclining on a cot in a sickbay area. He approaches Louis, who appears relieved, and then locates Charles, Preston, Martin, and Carrie. Meanwhile, Donnie, the camera shop guy, glances around as an armed sentry opens the portal and escorts him along a corridor. Jack punches the sentry out, seizes his firearm, and, now attired in the sentry's uniform and clutching his rifle, jogs along a corridor, making his way through a pair of offices. He glances outside, spots a fuel tanker nearby, and shoots it, causing an explosion that diverts the Air Force personnel. Jack then commandeers a Jeep and drives off along an unmetaled path running through open fields. He halts near a grain silo, alights from the Jeep, and perceives a convoy of vehicles traversing along an adjacent road."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "Louis was sat up in the driver's seat with his face bloodied, and his rearview mirror was looked at by him. The creature is seen by Alice when she turns around. Louis tries to get out of the car and tumbles out of the passenger door, then a run is made by him back up the street, and he trips over Alice's bike. A colleague is watched using a flamethrower by soldiers. Processed film is picked up by Charles and Joe, and as they cycle off past the town's water tower, just outside the town a vast plume of smoke rises. The vibrating cube is stuck in an indentation on the side of the water tower tank. Clouds of smoke are shown in their footage from the night of the crash, but when the smoke clears, footage of a giant spider-like creature creeping out of a carriage is seen by them. Hearing the siren, confusion is spread as they look around, and the projector is stopped by Joe, breaking the film off. On the streets, chaos is reigning as people and military personnel hurry to and fro. A huge pool of smoke is seen rising above the town by Joe and Charles as panicked families load their cars in preparation to evacuate. Traffic is directed by troops and instructions are issued, and as a convoy leaves town led by several military vehicles, a bus is prepared to be boarded by Charles and Joe. Military container lorries are passed by them on their way into town, carrying the white cubes recovered from the crash site as the evacuation convoy heads out. Charles and Joe are aboard one of the buses, and Greenville Air Force Base is eventually arrived at by the convoy, where vehicles queue to get in through the east entrance. Inside, the buses are disembarked by civilians in a huge hangar, and they are shepherded along by Air Force personnel. Joe wanders through the hangar looking for Jack and sees Louis lying on a bed in a sickbay area. He goes over to Louis, who looks relieved, and then Charles, Preston, Martin, and Carrie are found by him. Meanwhile, Donnie, the camera shop guy, looks around as an armed guard opens the door and escorts him along a corridor. The guard is punched out by Jack, who takes his gun, and, now dressed in the guard's uniform and clutching his rifle, he trots along a corridor, making his way through a couple of offices. Outside is looked at by him, and a fuel tanker is spotted nearby and shot by him, causing an explosion that distracts the Air Force personnel. A Jeep is then helped to by Jack, and along an unmetaled track running through open fields is driven off by him. Near a grain silo, he pulls up, gets out of the Jeep, and a convoy of vehicles traveling along an adjacent road is seen by him."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Louis, bloodied, sits in the driver's seat and looks in the rearview mirror. Alice turns and sees the creature. Louis exits the car through the passenger door, runs up the street, and trips over Alice's bike. Soldiers watch a colleague with a flamethrower. Charles and Joe collect their film, cycling past the town's water tower as smoke rises nearby. A vibrating cube is stuck on the water tower. Their crash footage shows smoke, then a giant spider-like creature emerging from a carriage. Hearing a siren, they stop the projector, breaking the film. Outside, chaos ensues as people and military personnel rush around. Joe and Charles see smoke above the town while families prepare to evacuate. Troops direct traffic, and Charles and Joe board a bus as a convoy leaves town, passing military lorries carrying white cubes from the crash site. The convoy reaches Greenville Air Force Base, where vehicles queue at the entrance. Inside, civilians disembark in a hangar, guided by Air Force personnel. Joe searches for Jack, finds Louis in a sickbay, and reunites with Charles, Preston, Martin, and Carrie. Meanwhile, Donnie is escorted by an armed guard. Jack knocks out the guard, takes his gun, and, in the guard's uniform, moves through offices. He spots a fuel tanker, shoots it, causing an explosion that distracts Air Force personnel. Jack takes a Jeep, drives along a track, stops near a grain silo, and sees a convoy on an adjacent road."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Louis, bloodied, sits in the driver's seat and checks the rearview mirror. Alice turns and sees the creature. Louis exits through the passenger door, runs up the street, and trips over Alice's bike. Soldiers observe a colleague with a flamethrower. Charles and Joe collect their film, cycling past the water tower as smoke rises outside town. A vibrating cube is stuck on the tower. Their crash footage shows smoke, then a giant spider-like creature. Hearing a siren, Joe stops the projector, breaking the film. Chaos ensues as people and military personnel rush around. Joe and Charles see smoke above town while families prepare to evacuate. Troops direct traffic, and Charles and Joe board a bus as a convoy leaves, passing military lorries with white cubes from the crash site. The convoy reaches Greenville Air Force Base, where civilians disembark in a hangar. Joe searches for Jack, finds Louis in sickbay, and reunites with friends. Meanwhile, Donnie is escorted by a guard. Jack knocks out the guard, takes his gun, and, in uniform, moves through offices. He spots a fuel tanker, shoots it, causing an explosion, and escapes in a Jeep. He stops near a grain silo and sees a convoy on a nearby road."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "Louis, sitting upright in the driver's seat, has a face covered in blood, and he glances into his rearview mirror with a look of concern. Meanwhile, Alice turns around in her seat and catches sight of the menacing creature. In a frantic attempt to escape, Louis struggles to exit the car, eventually tumbling out through the passenger door. He then sprints back up the street, only to trip clumsily over Alice's bike. Nearby, soldiers stand by, observing a colleague who is operating a flamethrower with precision. At the same time, Charles and Joe retrieve their processed film, and as they cycle away, passing the town's prominent water tower, they notice a massive plume of smoke rising ominously just outside the town's limits. Wedged into an indentation on the side of the water tower tank is the mysterious, vibrating cube. Their footage from the night of the crash initially reveals nothing but thick clouds of smoke, but as the smoke gradually dissipates, they capture images of a giant, spider-like creature emerging from a carriage. Upon hearing the blaring siren, they look around in bewilderment, and Joe halts the projector, inadvertently breaking the film. Outside, chaos ensues on the streets as both civilians and military personnel rush back and forth in a state of urgency. Joe and Charles walk down the street, witnessing a massive pool of smoke billowing above the town, while frantic families hastily load their cars, preparing to evacuate. Troops efficiently direct traffic and issue clear instructions, and Charles and Joe get ready to board a bus as part of a convoy that is leaving town, led by several military vehicles. As they depart, they pass by military container lorries transporting the white cubes that were recovered from the crash site, heading into town as the evacuation convoy moves out. Charles and Joe find themselves aboard one of the buses, and the convoy eventually reaches Greenville Air Force Base, where vehicles line up to enter through the east entrance. Inside the base, civilians disembark from the buses within a vast hangar, and Air Force personnel guide them along in an orderly fashion. Joe wanders through the hangar, searching for Jack, and spots Louis lying on a bed in a sickbay area, looking visibly relieved. He approaches Louis and then reunites with Charles, Preston, Martin, and Carrie. Meanwhile, Donnie, the camera shop guy, glances around nervously as an armed guard opens a door and escorts him down a corridor. In a bold move, Jack punches the guard, takes his gun, and, now dressed in the guard's uniform and holding the rifle, makes his way briskly through a couple of offices. He peers outside, notices a fuel tanker nearby, and shoots it, causing a massive explosion that serves as a distraction for the Air Force personnel. Seizing the opportunity, Jack commandeers a Jeep and drives off along an unmetaled track that winds through open fields. He eventually stops near a grain silo, exits the Jeep, and observes a convoy of vehicles traveling along an adjacent road."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "Louis, positioned upright in the driver's seat, has his face noticeably smeared with blood. With a look of deep concern, he glances at his reflection in the rearview mirror. Meanwhile, Alice, seated beside him, twists around in her seat to catch a glimpse of the menacing creature behind them. In a frantic and desperate attempt to flee from this threatening situation, Louis struggles to get out of the car, eventually managing to tumble out awkwardly through the passenger door. He then dashes back up the street with urgency, only to stumble clumsily over Alice's bike, which impedes his escape. Nearby, soldiers stand by, intently watching a colleague who is expertly operating a flamethrower with precise control. At the same time, Charles and Joe are busy collecting their developed film, and as they cycle away from the location, they pass by the town's prominent and towering water tower. It's then that they observe a massive, ominous plume of smoke rising dramatically just outside the town's borders. Wedged securely into an indentation on the side of the water tower tank is the enigmatic, vibrating cube that has garnered so much attention. Initially, their footage from the night of the crash reveals nothing more than thick, swirling clouds of smoke, but as the dense smoke slowly clears, they manage to capture startling images of a giant, spider-like creature emerging from a train carriage. Upon hearing the loud, blaring siren, they glance around in utter bewilderment, and Joe abruptly stops the projector, unintentionally causing the film to break. Outside, chaos reigns on the streets as both civilians and military personnel rush haphazardly back and forth in a state of heightened urgency. Joe and Charles walk along the street, witnessing a massive plume of smoke billowing above the town, while frantic families hurriedly load their cars in preparation for evacuation. Troops are efficiently directing the flow of traffic and issuing clear and concise instructions, and Charles and Joe prepare themselves to board a bus that is part of an organized convoy ready to depart the town, led by several military vehicles. As they make their way out, they pass by military container lorries carrying the white cubes that were recovered from the crash site, heading into town even as the evacuation convoy moves out. Charles and Joe find themselves seated aboard one of the buses, and eventually, the convoy reaches Greenville Air Force Base, where a line of vehicles queues to enter through the east entrance. Inside the expansive base, civilians disembark from the buses within a vast hangar, and Air Force personnel diligently guide them along in an orderly and systematic manner. Joe wanders through the hangar, searching out for Jack, and spots Louis lying on a bed in a nearby sickbay area, appearing visibly relieved at being safe. Approaching Louis, he then reunites with Charles, Preston, Martin, and Carrie. Meanwhile, Donnie, known as the camera shop guy, glances around nervously while an armed guard opens a door and escorts him down a hallway. In a bold and audacious move, Jack punches the guard, snatches the gun, and, now dressed in the guard's uniform and holding the rifle, makes his way confidently through several offices. He peers outside and notices a fuel tanker parked nearby; seizing the chance, he shoots at it, causing a massive and fiery explosion that acts as a strategic distraction for the Air Force personnel. Taking advantage of the ensuing chaos, Jack commandeers a Jeep and drives off along an unmetaled track meandering through wide open fields. He eventually brings the vehicle to a halt near a towering grain silo, steps out of the Jeep, and observes a convoy of vehicles making their way along a nearby road."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "Louis, with his face bloodied, slowly sits up in the driver's seat, feeling the sting of his injuries as he shifts his gaze to the rearview mirror to assess the damage. Meanwhile, Alice, sensing something amiss, turns her head to look behind her and catches sight of the creature, her eyes widening in shock. Louis, driven by urgency, attempts to exit the car, fumbling with the door handle before tumbling out through the passenger door. He scrambles to his feet and begins to run back up the street, his heart pounding, only to trip over Alice's bike, sending him sprawling to the ground. Nearby, soldiers stand in a group, their attention fixed on a colleague who is expertly wielding a flamethrower, the flames casting flickering shadows around them. Elsewhere, Charles and Joe retrieve their processed film, carefully handling the reels, and as they mount their bikes and cycle away, they pass the town's water tower. They glance up to see a vast plume of smoke rising ominously just outside the town, and their eyes are drawn to the vibrating cube stuck in an indentation on the side of the water tower tank. Later, as they review their footage from the night of the crash, they initially see only clouds of smoke obscuring the view, but as the smoke dissipates, they are startled to see a giant spider-like creature emerging from a carriage. The sudden blare of a siren jolts them from their focus, and they exchange confused glances before Joe reaches out to stop the projector, inadvertently breaking the film off. Outside, the streets are a scene of chaos, with people and military personnel moving hurriedly in all directions. Joe and Charles walk down the street, their eyes drawn to a huge pool of smoke rising above the town, while around them, panicked families hastily load their cars, preparing to evacuate. Troops are stationed at key points, directing traffic and issuing instructions to maintain order. Amidst the commotion, Charles and Joe make their way to a bus, ready to board as part of a convoy that is preparing to leave town, led by several military vehicles. As the convoy moves out, they pass military container lorries transporting the white cubes recovered from the crash site, heading into town as the evacuation convoy heads out. Seated aboard one of the buses, Charles and Joe watch the landscape change until the convoy eventually arrives at Greenville Air Force Base. There, vehicles queue up to enter through the east entrance, and once inside, civilians disembark from the buses into a vast hangar, where Air Force personnel efficiently shepherd them along. Joe, feeling a mix of anxiety and determination, wanders through the hangar in search of Jack, his eyes scanning the crowd until he spots Louis lying on a bed in a sickbay area. He approaches Louis, who looks up with a sense of relief, and then continues his search until he finds Charles, Preston, Martin, and Carrie. Meanwhile, Donnie, the camera shop guy, is led by an armed guard along a corridor, his eyes darting around nervously. Suddenly, Jack appears, swiftly punching the guard out and taking his gun. Now dressed in the guard's uniform and clutching the rifle, Jack moves with purpose along a corridor, navigating through a couple of offices. He pauses to look outside, spotting a fuel tanker nearby, and with calculated precision, he shoots it, causing a massive explosion that serves as a distraction for the Air Force personnel. Seizing the opportunity, Jack commandeers a Jeep and drives off along an unmetaled track that winds through open fields. He eventually pulls up near a grain silo, stepping out of the Jeep to observe a convoy of vehicles traveling along an adjacent road, his mind racing with possibilities."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "Louis, bloodied, sits up in the driver's seat and checks the rearview mirror before tumbling out of the passenger door. He runs up the street, tripping over Alice's bike, as Alice turns to see the creature. Soldiers observe a colleague with a flamethrower while Charles and Joe collect their processed film. As they cycle past the town's water tower, they notice a vast plume of smoke and a vibrating cube stuck on the tank. Their footage reveals a giant spider-like creature emerging from a carriage after the smoke clears. Hearing a siren, they stop the projector, breaking the film. Outside, chaos ensues with people and military personnel in a frenzy. Joe and Charles witness a huge smoke pool above the town as panicked families prepare to evacuate. Troops manage traffic and give instructions as Charles and Joe board a bus in a convoy led by military vehicles. They pass military lorries carrying white cubes from the crash site while the convoy heads to Greenville Air Force Base. Upon arrival, civilians disembark in a hangar, guided by Air Force personnel. Joe searches for Jack, finds Louis in a sickbay, and reunites with Charles, Preston, Martin, and Carrie. Meanwhile, Donnie is escorted by an armed guard, but Jack overpowers the guard, takes his gun, and dons the uniform. He shoots a fuel tanker to create a diversion, commandeers a Jeep, and drives through open fields. Stopping near a grain silo, he observes a convoy on an adjacent road."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "Louis sits up in the driver's seat with his face bloodied, a stark reminder of the chaos engulfing their town, and he looks in his rearview mirror. Alice turns around and sees the creature, which had been first sighted near the outskirts where strange occurrences had been reported. Louis tries to get out of the car and tumbles out of the passenger door, then he runs back up the street and trips over Alice's bike, which lay abandoned after she had hurriedly fled the creature earlier. Soldiers watch a colleague using a flamethrower, a tactic they were trained to use specifically for dealing with extraterrestrial threats. Charles and Joe pick up their processed film, developed at the town’s only camera shop, and as they cycle off past the town's water tower, a landmark built in the 1950s, a vast plume of smoke rises just outside the town. Stuck in an indentation on the side of the water tower tank is the vibrating cube, an object of unknown origin discovered at the crash site. Their footage from the night of the crash shows just clouds of smoke, but when the smoke clears, they see footage of a giant spider-like creature creeping out of a carriage that had derailed during the chaotic event. Hearing the siren, signaling an emergency evacuation, they look around in confusion, and Joe stops the projector, breaking the film off. Outside, chaos reigns on the streets as people, alongside military personnel called from nearby bases, hurry to and fro. Joe and Charles walk down the street and see a huge pool of smoke rising above the town, while panicked families load their cars in preparation to evacuate, following the government's emergency broadcast warning. Troops direct traffic and issue instructions, and Charles and Joe prepare to board a bus as a convoy leaves town led by several military vehicles, part of a coordinated evacuation effort. They pass military container lorries carrying the white cubes recovered from the crash site on their way into town as the evacuation convoy heads out. Charles and Joe are aboard one of the buses, and the convoy eventually arrives at Greenville Air Force Base, a facility known for its strategic importance, where vehicles queue to get in through the east entrance. Inside, civilians disembark from the buses in a huge hangar, originally built during the Cold War, and Air Force personnel shepherd them along. Joe wanders through the hangar looking for Jack and sees Louis lying on a bed in a sickbay area, set up to treat those injured in the ongoing crisis. He goes over to Louis, who looks relieved, and then finds Charles, Preston, Martin, and Carrie, all of whom had made it to the base safely. Meanwhile, Donnie, the camera shop guy who had developed their film, looks around as an armed guard opens the door and escorts him along a corridor. Jack punches the guard out, having planned this escape after realizing the need for a diversion, takes his gun, and, now dressed in the guard's uniform and clutching his rifle, trots along a corridor, making his way through a couple of offices. He looks outside, spots a fuel tanker nearby, and shoots it, causing an explosion that distracts the Air Force personnel, a tactic often used in military operations to create diversions. Jack then helps himself to a Jeep and drives off along an unmetaled track running through open fields, a shortcut he knew well from his childhood in the area. He pulls up near a grain silo, a familiar landmark on his family’s old farm, gets out of the Jeep, and sees a convoy of vehicles traveling along an adjacent road, indicating ongoing military movements."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "Louis sits up in the driver's seat with his face bloodied and he looks in his rearview mirror  Alice turns around and sees the creature  Louis tries to get out of the car and tumbles out of the passenger door  Joe and Charles walk down the street and see a huge pool of smoke rising above the town  while panicked families load their cars in preparation to evacuate  Troops direct traffic and issue instructions and Charles and Joe prepare to board a bus as a convoy leaves town led by several military vehicles  They pass military container lorries carrying the white cubes recovered from the crash site on their way into town as the evacuation convoy heads out  Charles and Joe are aboard one of the buses and the convoy eventually arrives at Greenville Air Force Base where vehicles queue to get in through the east entrance  Inside civilians disembark from the buses in a huge hangar and Air Force personnel shepherd them along  Joe wanders through the hangar looking for Jack and sees Louis lying on a bed in a sickbay area  He goes over to Louis who looks relieved and then finds Charles Preston Martin and Carrie  Meanwhile Donnie the camera shop guy looks around as an armed guard opens the door and escorts him along a corridor  Jack punches the guard out takes his gun and now dressed in the guard's uniform and clutching his rifle trots along a corridor making his way through a couple of offices  He looks outside spots a fuel tanker nearby and shoots it causing an explosion that distracts the Air Force personnel  Jack then helps himself to a Jeep and drives off along an unmetaled track running through open fields  then he runs back up the street and trips over Alice's bike  Soldiers watch a colleague using a flamethrower  Charles and Joe pick up their processed film and as they cycle off past the town's water tower a vast plume of smoke rises just outside the town  Stuck in an indentation on the side of the water tower tank is the vibrating cube  Their footage from the night of the crash shows just clouds of smoke but when the smoke clears they see footage of a giant spiderlike creature creeping out of a carriage  Hearing the siren they look around in confusion and Joe stops the projector breaking the film off  Outside chaos reigns on the streets as people and military personnel hurry to and fro  Joe and Charles walk down the street and see a huge pool of smoke rising above the town  while panicked families load their cars in preparation to evacuate  Troops direct traffic and issue instructions and Charles and Joe prepare to board a bus as a convoy leaves town led by several military vehicles  They pass military container lorries carrying the white cubes recovered from the crash site on their way into town as the evacuation convoy heads out  Charles and Joe are aboard one of the buses and the convoy eventually arrives at Greenville Air Force Base where vehicles queue to get in through the east entrance  Inside civilians disembark from the buses in a huge hangar and Air Force personnel shepherd them along  Joe wanders through the hangar looking for Jack and sees Louis lying on a bed in a sickbay area  He goes over to Louis who looks relieved and then finds Charles Preston Martin and Carrie  Meanwhile Donnie the camera shop guy looks around as an armed guard opens the door and escorts him along a corridor  Jack punches the guard out takes his gun and now dressed in the guard's uniform and clutching his rifle trots along a corridor making his way through a couple of offices  He looks outside spots a fuel tanker nearby and shoots it causing an explosion that distracts the Air Force personnel  Jack then helps himself to a Jeep and drives off along an unmetaled track running through open fields  He pulls up near a grain silo gets out of the Jeep and sees a convoy of vehicles traveling along an adjacent road"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "Louis sits up in the driver's seat with his face bloodied and he looks in his rearview mirror. Alice turns around and sees the creature. Louis tries to get out of the car and tumbles out of the passenger door. then he runs back up the street and trips over Alice's bike. Soldiers watch a colleague using a flamethrower. Charles and Joe pick up their processed film and as they cycle off past the town's water tower a vast plume of smoke rises just outside the town. Stuck in an indentation on the side of the water tower tank is the vibrating cube. Their footage from the night of the crash shows just clouds of smoke but when the smoke clears they see footage of a giant spiderlike creature creeping out of a carriage. Hearing the siren they look around in confusion and Joe stops the projector breaking the film off. Outside chaos reigns on the streets as people and military personnel hurry to and fro. Joe and Charles walk down the street and see a huge pool of smoke rising above the town. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. while panicked families load their cars in preparation to evacuate. Troops direct traffic and issue instructions and Charles and Joe prepare to board a bus as a convoy leaves town led by several military vehicles. They pass military container lorries carrying the white cubes recovered from the crash site on their way into town as the evacuation convoy heads out. Charles and Joe are aboard one of the buses and the convoy eventually arrives at Greenville Air Force Base where vehicles queue to get in through the east entrance. Inside civilians disembark from the buses in a huge hangar and Air Force personnel shepherd them along. Joe wanders through the hangar looking for Jack and sees Louis lying on a bed in a sickbay area. He goes over to Louis who looks relieved and then finds Charles Preston Martin and Carrie. Meanwhile Donnie the camera shop guy looks around as an armed guard opens the door and escorts him along a corridor. Jack punches the guard out takes his gun and now dressed in the guard's uniform and clutching his rifle trots along a corridor making his way through a couple of offices. He looks outside spots a fuel tanker nearby and shoots it causing an explosion that distracts the Air Force personnel. Jack then helps himself to a Jeep and drives off along an unmetaled track running through open fields. He pulls up near a grain silo gets out of the Jeep and sees a convoy of vehicles traveling along an adjacent road."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "Louis sits up in the driver's seat with his face bloodied and he looks in his rearview mirror. Alice turns around and sees the creature. Louis tries to get out of the car and tumbles out of the passenger door. then he runs back up the street and trips over Alice's bike. Soldiers watch a colleague using a flamethrower. Charles and Joe pick up their processed film and as they cycle off past the town's water tower a vast plume of smoke rises just outside the town. Stuck in an indentation on the side of the water tower tank is the vibrating cube. Their footage from the night of the crash shows just clouds of smoke but when the smoke clears they see footage of a giant spiderlike creature creeping out of a carriage. Hearing the siren they look around in confusion and Joe stops the projector breaking the film off. Outside chaos reigns on the streets as people and military personnel hurry to and fro. Joe and Charles walk down the street and see a huge pool of smoke rising above the town. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. while panicked families load their cars in preparation to evacuate. Troops direct traffic and issue instructions and Charles and Joe prepare to board a bus as a convoy leaves town led by several military vehicles. They pass military container lorries carrying the white cubes recovered from the crash site on their way into town as the evacuation convoy heads out. Charles and Joe are aboard one of the buses and the convoy eventually arrives at Greenville Air Force Base where vehicles queue to get in through the east entrance. Inside civilians disembark from the buses in a huge hangar and Air Force personnel shepherd them along. Joe wanders through the hangar looking for Jack and sees Louis lying on a bed in a sickbay area. He goes over to Louis who looks relieved and then finds Charles Preston Martin and Carrie. Meanwhile Donnie the camera shop guy looks around as an armed guard opens the door and escorts him along a corridor. Jack punches the guard out takes his gun and now dressed in the guard's uniform and clutching his rifle trots along a corridor making his way through a couple of offices. He looks outside spots a fuel tanker nearby and shoots it causing an explosion that distracts the Air Force personnel. Jack then helps himself to a Jeep and drives off along an unmetaled track running through open fields. He pulls up near a grain silo gets out of the Jeep and sees a convoy of vehicles traveling along an adjacent road."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "Louis sits up in the driver's seat with his face bloodied and he looks in his rearview mirror. Alice turns around and sees the creature. Louis tries to get out of the car and tumbles out of the passenger door. then he runs back up the street and trips over Alice's bike. Soldiers watch a colleague using a flamethrower. Charles and Joe pick up their processed film and as they cycle off past the town's water tower a vast plume of smoke rises just outside the town. He goes over to Louis who looks relieved and then finds Charles Preston Martin and Carrie. Meanwhile Donnie the camera shop guy looks around as an armed guard opens the door and escorts him along a corridor. Jack punches the guard out takes his gun and now dressed in the guard's uniform and clutching his rifle trots along a corridor making his way through a couple of offices. He looks outside spots a fuel tanker nearby and shoots it causing an explosion that distracts the Air Force personnel. Jack then helps himself to a Jeep and drives off along an unmetaled track running through open fields. He pulls up near a grain silo gets out of the Jeep and sees a convoy of vehicles traveling along an adjacent road."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "Louis sits up in the driver's seat with his face bloodied and he looks in his rearview mirror. Alice turns around and sees the creature. He looks outside spots a fuel tanker nearby and shoots it causing an explosion that distracts the Air Force personnel. Jack then helps himself to a Jeep and drives off along an unmetaled track running through open fields. He pulls up near a grain silo gets out of the Jeep and sees a convoy of vehicles traveling along an adjacent road."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "Bianca sits up in the driver's seat with her face bloodied, and she looks in her rearview mirror. Marco turns around and sees the creature. Bianca tries to get out of the car and tumbles out of the passenger door, then she runs back up the street and trips over Marco's bike. Astronauts watch a colleague using a flamethrower. Danielle and Henry pick up their processed film, and as they cycle off past the town's water tower, a vast plume of smoke rises just outside the town. Stuck in an indentation on the side of the water tower tank is the vibrating cube. Their footage from the night of the crash shows just clouds of smoke, but when the smoke clears, they see footage of a giant spider-like creature creeping out of a carriage. Hearing the siren, they look around in confusion, and Henry stops the projector, breaking the film off. Outside, chaos reigns on the streets as people and military personnel hurry to and fro. Henry and Danielle walk down the street and see a huge pool of smoke rising above the town, while panicked families load their cars in preparation to evacuate. Nurses direct traffic and issue instructions, and Danielle and Henry prepare to board a bus as a convoy leaves town led by several military vehicles. They pass military container lorries carrying the white cubes recovered from the crash site on their way into town as the evacuation convoy heads out. Danielle and Henry are aboard one of the buses, and the convoy eventually arrives at Greenville Air Force Base, where vehicles queue to get in through the east entrance. Inside, civilians disembark from the buses in a huge hangar, and firefighters shepherd them along. Henry wanders through the hangar looking for Oliver and sees Bianca lying on a bed in a sickbay area. He goes over to Bianca, who looks relieved, and then finds Danielle, Preston, Martin, and Carrie. Meanwhile, Fiona, the camera shop guy, looks around as an armed veterinarian opens the door and escorts her along a corridor. Oliver punches the veterinarian out, takes the veterinarian's gun, and, now dressed in the veterinarian's uniform and clutching the rifle, trots along a corridor, making his way through a couple of offices. He looks outside, spots a fuel tanker nearby, and shoots it, causing an explosion that distracts the firefighters. Oliver then helps himself to a Jeep and drives off along an unmetaled track running through open fields. He pulls up near a grain silo, gets out of the Jeep, and sees a convoy of vehicles traveling along an adjacent road."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "Louis sits up in the driver's seat with his face bruised, and he looks in his side mirror. Alice turns around and sees the phantom. Louis tries to get out of the helicopter and tumbles out of the cargo door, then he runs back up the alley and trips over Alice's skateboard. Guards watch a colleague using a water cannon. Charles and Joe pick up their old manuscript, and as they skate off past the town's lighthouse, a vast plume of dust rises just outside the town. Stuck in an indentation on the side of the lighthouse tower is the vibrating sphere. Their footage from the night of the mishap shows just clouds of dust, but when the dust clears, they see footage of a giant beetle-like creature creeping out of a trailer. Hearing the horn, they look around in confusion, and Joe stops the slideshow, breaking the film off. Outside, chaos reigns on the docks as people and security personnel hurry to and fro. Joe and Charles walk down the alley and see a huge pool of dust rising above the town, while panicked families load their boats in preparation to evacuate. Patrols direct traffic and issue instructions, and Charles and Joe prepare to board a ferry as a convoy leaves town led by several armored cars. They pass armored container trucks carrying the red spheres recovered from the crash site on their way into town as the evacuation convoy heads out. Charles and Joe are aboard one of the ferries, and the convoy eventually arrives at Greenville Naval Base, where vessels queue to get in through the north entrance. Inside, civilians disembark from the ferries in a huge dockyard, and Naval personnel shepherd them along. Joe wanders through the dockyard looking for Jack and sees Louis lying on a bench in a recovery area. He goes over to Louis, who looks relieved, and then finds Charles, Preston, Martin, and Carrie. Meanwhile, Donnie, the bookstore guy, looks around as an armed officer opens the door and escorts him along a corridor. Jack punches the officer out, takes his radio, and, now dressed in the officer's uniform and clutching his walkie-talkie, trots along a corridor, making his way through a couple of workshops. He looks outside, spots a water tanker nearby, and shoots it, causing an explosion that distracts the Naval personnel. Jack then helps himself to a motorbike and drives off along an unpaved road running through open fields. He pulls up near a windmill, gets out of the motorbike, and sees a convoy of carriages traveling along an adjacent path."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "Louis reclines in the driver's seat with his face bandaged, and he gazes in his rearview mirror. Alice spins around and spots the creature. Louis attempts to climb out of the car and crawls out of the passenger door, then he saunters back up the street and stumbles over Alice's bike. Soldiers observe a colleague assembling a flamethrower. Charles and Joe collect their developed film, and as they stroll past the town's water tower, a vast plume of steam rises just outside the town. Wedged in an indentation on the side of the water tower tank is the humming cube. Their footage from the night of the crash shows just wisps of steam, but when the steam lifts, they glimpse footage of a giant spider-like creature leaping out of a carriage. Hearing the siren, they glance around in bewilderment, and Joe pauses the projector, snapping the film off. Outside, chaos prevails on the streets as people and military personnel amble to and fro. Joe and Charles meander down the street and notice a huge cloud of steam rising above the town, while panicked families pack their cars in readiness to depart. Troops guide traffic and relay instructions, and Charles and Joe prepare to hop on a bus as a convoy exits town led by several military vehicles. They pass military container lorries towing the white cubes recovered from the crash site on their way into town as the evacuation convoy proceeds out. Charles and Joe are seated on one of the buses, and the convoy finally reaches Greenville Air Force Base, where vehicles line up to get in through the north entrance. Inside, civilians exit from the buses in a vast hangar, and Air Force personnel guide them along. Joe ambles through the hangar searching for Jack and notices Louis reclining on a bed in a recovery area. He approaches Louis, who appears relieved, and then locates Charles, Preston, Martin, and Carrie. Meanwhile, Donnie, the camera shop guy, glances around as an armed guard unlatches the door and guides him along a corridor. Jack confronts the guard, snatches his weapon, and, now dressed in the guard's uniform and cradling his rifle, strides along a corridor, gliding his way through several offices. He peers outside, notices a fuel tanker nearby, and taps it, causing a diversion that confuses the Air Force personnel. Jack then commandeers a Jeep and cruises off along a dirt track winding through open fields. He rolls up near a grain silo, exits the Jeep, and observes a convoy of vehicles marching along a neighboring road."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "Rosie lounges up in the pilot's seat with her hands bandaged, and she gazes in the sideview mirror. Oliver rotates around and spots the spaceship. Rosie attempts to exit the submarine and tumbles out of the hatch, then she sprints down the runway and stumbles over Oliver's skateboard. Bakers observe a neighbor using a sprinkler. Ellen and Max collect their printed photos, and as they drive off past the city's windmill, a huge plume of steam rises just outside the city. Lodged in a ditch on the edge of the windmill base is the pulsating sphere. Their images from the night of the collision reveal only layers of fog, but when the mist disperses, they observe images of an enormous octopus-like machine emerging from a trolley. Hearing the whistle, they glance around in bewilderment, and Max stops the slideshow, tearing the image off. Outdoors, disorder prevails on the airfield as creatures and spaceship crew dash to and fro. Max and Ellen stroll down the sidewalk and witness a gigantic fountain of fog ascending above the city, while frightened tourists pack their boats in readiness to escape. Robots manage pedestrians and provide directions, and Ellen and Max get ready to board a helicopter as a squadron departs the city led by several spaceship carriers. They bypass spaceship container trains hauling the black spheres recovered from the collision zone on their way into the city as the evacuation squadron heads out. Ellen and Max are aboard one of the helicopters, and the squadron eventually reaches Riverside Spaceport, where spacecraft queue to enter through the west gate. Inside, travelers dismount from the helicopters in a massive terminal, and spaceport crew usher them along. Max meanders through the terminal searching for Philip and notices Rosie resting on a cot in a treatment room. He approaches Rosie, who seems comforted, and then discovers Ellen, Tyler, Nathan, and Julia. Meanwhile, Leo, the bakery assistant, scans his surroundings as a robotic sentry opens the gate and guides him down a hallway. Philip knocks the sentry out, grabs its laser, and, now outfitted in the sentry's gear and holding its blaster, jogs down a hallway, navigating his path through a few cubicles. He peeks outside, notices a food truck nearby, and zaps it, causing a diversion that draws the spaceport crew. Philip then seizes a motorcycle and speeds off along an unpaved path leading through open meadows. He parks near a water tower, hops off the motorcycle, and observes a fleet of hovercraft cruising along a nearby avenue."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "Francine slouches down in the teacher's seat with her arm bandaged, and she peers into her magnifying glass. Gerald twists sideways and notices the statue. Francine attempts to remain in the room and slides out of the curtain, then she wanders back down the lane and stumbles over Gerald's suitcase. Nurses observe a manager handling a megaphone. Rebecca and Tim collect their painted canvas, and as they glide off past the town's old bridge, a massive blast of water erupts just outside the town. Lodged in a dent on the side of the bridge pillar is the shaking sphere. Their recordings from the evening of the incident reveal just curtains of water, but when the water dissipates, they spot recordings of a colossal dragonfly-like entity emerging from a container. Hearing the whistle, they glance around in disbelief, and Tim pauses the slideshow, snapping the transparency off. Inside, commotion rules in the hallways as residents and emergency workers rush back and forth. Tim and Rebecca stroll down the lane and witness a large cloud of water billowing above the town, while distressed groups pack their bicycles in readiness to flee. Policemen direct pedestrians and give guidance, and Rebecca and Tim prepare to board a train as a procession leaves town escorted by numerous emergency vehicles. They pass emergency storage wagons hauling the red spheres salvaged from the incident site on their journey into town as the evacuation procession heads out. Rebecca and Tim sit on one of the trains, and the procession finally reaches Greenville Fire Station, where vehicles line up to enter through the northern gate. Within, citizens alight from the trains in a vast depot, and fire brigade staff usher them along. Tim meanders through the depot searching for Noah and spots Francine reclining on a bench in a rest area. He approaches Francine, who seems satisfied, and then locates Rebecca, Logan, George, and Maria. Meanwhile, Adrian, the baker, glances around as an unarmed assistant swings the entryway open and guides him down a passage. Noah slaps the assistant down, seizes her radio, and, now wearing the assistant's outfit and gripping her umbrella, dashes down a passage, navigating through a couple of rooms. He peers outside, notices a crop duster nearby, and kicks it, creating a commotion that diverts the fire brigade staff. Noah then commandeers a motorbike and rides off along a gravel path cutting through expansive gardens. He halts near a windmill, dismounts from the motorbike, and observes a parade of bicycles moving along a neighboring path."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "Louis reclines in the conductor's chair with his face bruised, and he peers into his handheld mirror. Alice spins around and notices the phantom. Louis attempts to climb out of the truck and rolls out of the cargo door, then he hurries down the alley and stumbles over Alice's cart. Sailors observe a colleague operating a floodlight. Charles and Joe collect their developed audio tapes, and as they glide past the town's radio tower, a massive column of steam emerges just outside the town. Embedded in a groove on the side of the radio tower mast is the pulsating sphere. Their recordings from the evening of the explosion reveal only foggy mist, but when the mist disperses, they capture images of a giant crab-like phantom crawling out of a trolley. Hearing the bell, they glance around in bewilderment, and Joe halts the projector, tearing the tape off. Outside, disorder erupts on the boulevards as citizens and naval officers dash back and forth. Joe and Charles stroll down the avenue and observe a vast cloud of steam rising above the town, while frantic groups pack their trucks in anticipation to flee. Marines manage pedestrians and announce directives, and Charles and Joe get ready to climb onto a tram as a procession departs town led by several naval trucks. They pass naval container vans transporting the black spheres salvaged from the explosion site on their way into town as the evacuation procession moves out. Charles and Joe are aboard one of the trams, and the procession eventually reaches Greenville Naval Station, where ships line up to sail through the eastern harbor. Inside, civilians disembark from the trams in a colossal garage, and naval staff guide them along. Joe meanders through the garage searching for Jack and notices Louis resting on a mattress in a medical ward. He approaches Louis, who appears reassured, and then locates Charles, Preston, Martin, and Carrie. Meanwhile, Donnie, the audio shop guy, surveys the area as a sentry unlocks the gate and leads him along a passageway. Jack kicks the sentry aside, seizes his baton, and, now attired in the sentry's outfit and gripping the baton, jogs along a hallway, navigating through a pair of chambers. He surveys outside, detects a water tanker nearby, and punctures it, triggering a cascade that diverts the naval staff. Jack then commandeers a bicycle and pedals off along a gravel path meandering through open pastures. He stops near a windmill, dismounts from the bicycle, and spots a procession of wagons traveling along a neighboring trail."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "Rupert lounges back in the subway station with his hat dusty, and he glances in his pocket mirror. Beth spins around and spots the dragon. Rupert attempts to climb out of the elevator and flips out of the hallway window, then he sprints down the avenue and stumbles over Beth's basket. Artists observe a chef utilizing a catapult. Marcus and Jill gather their packaged bread, and as they march past the town's clock tower, a colossal wave of paint splashes just inside the city. Nestled in a crevice on the edge of the clock tower's face is the humming orb. Their snapshots from the night of the party reveal only puffs of steam, but when the steam dissipates, they capture images of a massive octopus-like beast creeping out of a trolley. Hearing the whistle, they glance around bewildered, and Jill halts the projector, tearing the reel apart. Outside, pandemonium sweeps the alleys as animals and police officers rush here and there. Jill and Marcus wander down the boulevard and observe an immense cloud of dust hovering above the village, while frantic tourists pack their wagons in readiness to flee. Wolves regulate crossings and bark orders, and Marcus and Jill get ready to hop on a tram as a parade exits the city led by a fleet of antique cars. They pass naval transport ships carrying the blue spheres salvaged from the celebration site on their way into the hamlet as the exit parade moves out. Marcus and Jill are aboard one of the trams, and the parade ultimately pulls into Maple Creek Naval Base, where machines line up to enter through the southern gate. Within, explorers disembark from the trams in an enormous bunker, and mariners herd them onward. Jill meanders through the bunker searching for Andy and observes Rupert resting on a hammock in a clinic area. She approaches Rupert, who appears content, and then locates Marcus, Oliver, Simon, and Lucy. Meanwhile, Benny, the radio store clerk, glances around as a knight unlocks the hatch and guides him along a hallway. Andy kicks the knight down, snatches her sword, and, now clad in the knight's armor and wielding a lance, gallops along a hallway, making his way through a series of chambers. He peers outside, identifies a water wagon nearby, and hurls a rock at it, prompting a detonation that diverts the mariners. Andy then commandeers a motorcycle and zooms off along a rocky path weaving through open meadows. He halts near a windmill, leaps off the motorcycle, and observes a parade of creatures ambling along a neighboring trail."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "Louis, bloodied, tries to flee a creature after tumbling out of his car, while soldiers standby with a flamethrower. Charles and Joe retrieve film showing a spider-like creature from a crash, amidst chaos and a towering smoke plume. As the town evacuates under military orders, they board a bus leaving for Greenville Air Force Base, passing military trucks carrying recovered cubes. At the base, civilians disembark in a hangar, and Joe finds familiar faces including Louis. Meanwhile, Donnie is escorted by a guard, whom Jack overpowers to escape, causing a diversion by exploding a fuel tanker before taking a Jeep through a field."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "He pulls up near a grain silo gets out of the Jeep and sees a convoy of vehicles traveling along an adjacent road Jack then helps himself to a Jeep and drives off along an unmetaled track running through open fields  He looks outside spots a fuel tanker nearby and shoots it causing an explosion that distracts the Air Force personnel  Jack punches the guard out takes his gun and now dressed in the guard's uniform and clutching his rifle trots along a corridor making his way through a couple of offices  Meanwhile Donnie the camera shop guy looks around as an armed guard opens the door and escorts him along a corridor  He goes over to Louis who looks relieved and then finds Charles Preston Martin and Carrie  Joe wanders through the hangar looking for Jack and sees Louis lying on a bed in a sickbay area  Inside civilians disembark from the buses in a huge hangar and Air Force personnel shepherd them along  Charles and Joe are aboard one of the buses and the convoy eventually arrives at Greenville Air Force Base where vehicles queue to get in through the east entrance  They pass military container lorries carrying the white cubes recovered from the crash site on their way into town as the evacuation convoy heads out  Troops direct traffic and issue instructions and Charles and Joe prepare to board a bus as a convoy leaves town led by several military vehicles  while panicked families load their cars in preparation to evacuate  Joe and Charles walk down the street and see a huge pool of smoke rising above the town  Outside chaos reigns on the streets as people and military personnel hurry to and fro  Hearing the siren they look around in confusion and Joe stops the projector breaking the film off  Their footage from the night of the crash shows just clouds of smoke but when the smoke clears they see footage of a giant spiderlike creature creeping out of a carriage  Stuck in an indentation on the side of the water tower tank is the vibrating cube  Charles and Joe pick up their processed film and as they cycle off past the town's water tower a vast plume of smoke rises just outside the town  Soldiers watch a colleague using a flamethrower  then he runs back up the street and trips over Alice's bike  Louis tries to get out of the car and tumbles out of the passenger door  Alice turns around and sees the creature  Louis sits up in the driver's seat with his face bloodied and he looks in his rearview mirror "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "He goes over to Louis who looks relieved and then finds Charles Preston Martin and Carrie  Their footage from the night of the crash shows just clouds of smoke but when the smoke clears they see footage of a giant spiderlike creature creeping out of a carriage  Jack punches the guard out takes his gun and now dressed in the guard's uniform and clutching his rifle trots along a corridor making his way through a couple of offices  while panicked families load their cars in preparation to evacuate  Soldiers watch a colleague using a flamethrower  Inside civilians disembark from the buses in a huge hangar and Air Force personnel shepherd them along  He pulls up near a grain silo gets out of the Jeep and sees a convoy of vehicles traveling along an adjacent road Outside chaos reigns on the streets as people and military personnel hurry to and fro  Stuck in an indentation on the side of the water tower tank is the vibrating cube  Joe wanders through the hangar looking for Jack and sees Louis lying on a bed in a sickbay area  Alice turns around and sees the creature  Jack then helps himself to a Jeep and drives off along an unmetaled track running through open fields  Troops direct traffic and issue instructions and Charles and Joe prepare to board a bus as a convoy leaves town led by several military vehicles  then he runs back up the street and trips over Alice's bike  Louis tries to get out of the car and tumbles out of the passenger door  He looks outside spots a fuel tanker nearby and shoots it causing an explosion that distracts the Air Force personnel  Joe and Charles walk down the street and see a huge pool of smoke rising above the town  They pass military container lorries carrying the white cubes recovered from the crash site on their way into town as the evacuation convoy heads out  Charles and Joe pick up their processed film and as they cycle off past the town's water tower a vast plume of smoke rises just outside the town  Louis sits up in the driver's seat with his face bloodied and he looks in his rearview mirror  Hearing the siren they look around in confusion and Joe stops the projector breaking the film off  Meanwhile Donnie the camera shop guy looks around as an armed guard opens the door and escorts him along a corridor  Charles and Joe are aboard one of the buses and the convoy eventually arrives at Greenville Air Force Base where vehicles queue to get in through the east entrance "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Troops direct traffic and issue instructions and Charles and Joe prepare to board a bus as a convoy leaves town led by several military vehicles  They pass military container lorries carrying the white cubes recovered from the crash site on their way into town as the evacuation convoy heads out  Charles and Joe are aboard one of the buses and the convoy eventually arrives at Greenville Air Force Base where vehicles queue to get in through the east entrance  Inside civilians disembark from the buses in a huge hangar and Air Force personnel shepherd them along  Joe wanders through the hangar looking for Jack and sees Louis lying on a bed in a sickbay area  He goes over to Louis who looks relieved and then finds Charles Preston Martin and Carrie  Meanwhile Donnie the camera shop guy looks around as an armed guard opens the door and escorts him along a corridor  Jack punches the guard out takes his gun and now dressed in the guard's uniform and clutching his rifle trots along a corridor making his way through a couple of offices  He looks outside spots a fuel tanker nearby and shoots it causing an explosion that distracts the Air Force personnel  Jack then helps himself to a Jeep and drives off along an unmetaled track running through open fields  He pulls up near a grain silo gets out of the Jeep and sees a convoy of vehicles traveling along an adjacent road Louis sits up in the driver's seat with his face bloodied and he looks in his rearview mirror  Alice turns around and sees the creature  Louis tries to get out of the car and tumbles out of the passenger door  then he runs back up the street and trips over Alice's bike  Soldiers watch a colleague using a flamethrower  Charles and Joe pick up their processed film and as they cycle off past the town's water tower a vast plume of smoke rises just outside the town  Stuck in an indentation on the side of the water tower tank is the vibrating cube  Their footage from the night of the crash shows just clouds of smoke but when the smoke clears they see footage of a giant spiderlike creature creeping out of a carriage  Hearing the siren they look around in confusion and Joe stops the projector breaking the film off  Outside chaos reigns on the streets as people and military personnel hurry to and fro  Joe and Charles walk down the street and see a huge pool of smoke rising above the town  while panicked families load their cars in preparation to evacuate "
        }
      ]
    }
  ]
}