{
  "ground_truth": "As the mustached stranger waits to cross a busy intersection, he checks his wristwatch, which reads 7:06. He makes a flicking motion, causing David's coffee to slosh. As the lovely woman wipes coffee off her legs, a taxi hits the stranger, and the cabbie stops his car to rush to the fallen man. The stranger opens the book, revealing a line traveling at right angles across a map. Outside, he watches the bus drive off, and his book shows the line moving towards a pulsing red dot. He runs after the bus, but on board, she tries to tip David's cup. She grabs his phone, answers, and drops it into his coffee, which bubbles as the phone rings. David extracts his phone and she wipes it on her skirt. Outside, the mustached stranger hurries across a street as the bus stops. Elise climbs off and turns to David, who stands in the doorway as the doors close. Elise grins at him through a window and, with a mocking frown, she flips him off. Smiling, he watches her head away, then sits again, placing his coffee in the seat beside him. He eyes Elise's number on the back of one of his business cards and makes a call, then hangs up. Later, he pushes the revolving door of an office building and enters a vacant lobby. As he passes between two waist-high security scanners, he holds his card to the top of one and strides to an elevator. Emerging in a reception area, the receptionist's gaze remains down, her hand holding a phone to her ear. As he steps past another receptionist, her eyes remain ahead. Hurrying past two men standing in a corridor and a third sitting in a waiting area, he enters the conference room. Inside, men in shiny black body suits and visored helmets work on his colleagues, who stand frozen in time. Two men scan Charlie's face with wand-like devices. Two men in hats look over, and one is the mustached stranger's superior. David races out, and glancing back, he sees the helmeted men close behind. Sprinting to the reception area, he passes his frozen coworkers as more men join the chase. David runs up some stairs, finding the lead man at the top. As David races down a corridor, the white-haired boss opens a door off the hall and walks through. Turning a corner, David sees the man in front of him, and taking another corridor, he finds the man waiting at its end. Several of the helmeted men close in, and David doubles back, hurrying into Charlie's office and locking the door. He closes a second door leading to a small conference room, then picks up a phone and waits.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "As the mustachioed outsider stays to traverse a crowded crossroads, he inspects his wristwatch, which displays 7:06. He executes a flicking gesture, prompting David's coffee to splash. As the beautiful lady cleans coffee from her legs, a cab strikes the outsider, and the cabbie halts his vehicle to hurry to the collapsed man. The outsider opens the volume, exposing a line traveling at right angles across a chart. Outdoors, he observes the coach drive away, and his volume shows the line advancing towards a flashing red point. He sprints after the coach, but aboard, she attempts to tip David's mug. She snatches his phone, replies, and drops it into his coffee, which bubbles as the phone rings. David retrieves his phone, and she wipes it on her skirt. Outdoors, the mustachioed outsider rushes across a road as the coach stops. Elise descends and turns to David, who stands in the entry as the doors shut. Elise beams at him through a pane and, with a sarcastic frown, she flips him off. Grinning, he observes her head away, then sits again, placing his coffee in the seat beside him. He glances at Elise's number on the back of one of his business cards and makes a call, then disconnects. Later, he pushes the revolving door of an office edifice and enters an unoccupied lobby. As he passes between two waist-high security scanners, he holds his card to the top of one and strides to an elevator. Emerging in a reception section, the receptionist's gaze remains down, her hand holding a phone to her ear. As he steps past another receptionist, her eyes remain straight. Hurrying past two men standing in a hallway and a third sitting in a waiting area, he enters the meeting room. Inside, men in glossy dark body suits and visored helmets work on his colleagues, who stand frozen in time. Two men scan Charlie's countenance with wand-like devices. Two men in hats look over, and one is the mustachioed outsider's superior. David dashes out, and glancing back, he sees the helmeted men close behind. Sprinting to the reception section, he passes his frozen coworkers as more men join the pursuit. David runs up some stairs, finding the lead man at the top. As David races down a hallway, the white-haired boss opens a door off the hall and walks through. Turning a corner, David sees the man in front of him, and taking another hallway, he finds the man waiting at its end. Several of the helmeted men close in, and David doubles back, hurrying into Charlie's office and locking the door. He closes a second door leading to a small meeting room, then picks up a phone and waits."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "As a busy intersection is waited at by the mustached stranger, his wristwatch, reading 7:06, is checked by him. A flicking motion is made by him, causing David's coffee to slosh. As coffee is wiped off her legs by the lovely woman, the stranger is hit by a taxi, and the cabbie stops his car, rushing to the fallen man. The book is opened by the stranger, revealing a line traveling at right angles across a map. Outside, the bus is watched driving off by him, and the book shows the line moving towards a pulsing red dot. He runs after the bus, but on board, she tries tipping David's cup. She grabs his phone, answers it, and drops it into his coffee, which bubbles as the phone rings. David extracts his phone and she wipes it on her skirt. Outside, a hurry across a street is made by the mustached stranger as the bus stops. Elise climbs off and turns to David, who stands in the doorway as the doors close. He is grinned at by Elise through a window, and with a mocking frown, David is flipped off by her. Smiling, she is watched by him as she heads away, then he sits again, placing his coffee in the seat beside him. Elise's number on the back of one of his business cards is eyed by him and a call is made, then he hangs up. Later, the revolving door of an office building is pushed by him and he enters a vacant lobby. While he passes between two waist-high security scanners, his card is held to the top of one by him, and he strides to an elevator. Emerging in a reception area, the receptionist's gaze remains down, her hand holds a phone to her ear. As another receptionist is stepped past by him, her eyes remain ahead. Hurrying past two men standing in a corridor and a third sitting in a waiting area, the conference room is entered by him. Inside, his colleagues, who stand frozen in time, are worked on by men in shiny black body suits and visored helmets. Charlie's face is scanned with wand-like devices by two men. Two men in hats look over, one of whom is the mustached stranger's superior. David races out, and glancing back, he sees the helmeted men close behind. Sprinting to the reception area, his frozen coworkers are passed by him as more men join the chase. Some stairs are run up by David, finding the lead man at the top. As a corridor is raced down by David, a door off the hall is opened by the white-haired boss and he walks through. Turning a corner, the man in front of him is seen by David, and taking another corridor, the man waiting at its end is found by him. Several of the helmeted men close in, and David doubles back, hurrying into Charlie's office and locking the door. A second door leading to a small conference room is closed by him, then a phone is picked up and he waits."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "As the mustached stranger waits at a busy intersection, he checks his wristwatch, which reads 7:06, and flicks his hand, causing David's coffee to spill. A taxi hits the stranger, and the cabbie rushes to help. The stranger opens a book, revealing a line on a map. He watches a bus leave, and the book shows the line moving toward a red dot. He chases the bus, while on board, she tips David's cup, grabs his phone, answers it, and drops it into his coffee. David retrieves his phone, and she wipes it on her skirt. The mustached stranger crosses the street as the bus stops. Elise exits and turns to David, who stands in the doorway as the doors close. Elise grins and flips him off. Smiling, he watches her leave, then sits, placing his coffee beside him. He sees Elise's number on a business card and calls, then hangs up. Later, he enters an office building, passes security scanners, and heads to an elevator. In the reception area, the receptionist is on the phone. He hurries past two men and enters a conference room where men in black suits and helmets work on his frozen colleagues. Two men scan Charlie's face. David races out, pursued by helmeted men. He runs to the reception area, passing frozen coworkers, and up stairs, finding the lead man at the top. David races down a corridor, sees the white-haired boss, and takes another corridor, finding the man waiting. Helmeted men close in, and David doubles back, locking himself in Charlie's office. He closes a door to a small conference room, picks up a phone, and waits."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "The mustached stranger waits at a busy intersection, checking his watch at 7:06. He flicks, spilling David's coffee. A woman wipes her legs as a taxi hits the stranger, and the cabbie rushes to him. The stranger's book shows a line on a map moving toward a red dot. He chases a bus, while on board, she tries to tip David's cup, grabs his phone, answers, and drops it in his coffee. David retrieves his phone, and she wipes it on her skirt. The stranger crosses the street as the bus stops. Elise exits, turns to David in the doorway, grins, and flips him off. Smiling, he sits, places his coffee beside him, and calls Elise's number on his business card. Later, he enters an office building, passes security scanners, and heads to an elevator. In the reception area, the receptionist is on the phone. He hurries past colleagues and enters a conference room where men in black suits work on his frozen colleagues. Two men scan Charlie's face. David races out, chased by helmeted men, passing frozen coworkers. He runs up stairs, finding the lead man, and down corridors, encountering the man again. Helmeted men close in, and David doubles back, locking himself in Charlie's office, then waits with a phone."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "As the mustached stranger stands patiently at the edge of a bustling intersection, he takes a moment to glance down at his wristwatch, which clearly displays the time as 7:06. With a swift flicking motion of his hand, he inadvertently causes David's coffee to slosh around in its cup. Meanwhile, the lovely woman nearby is busy wiping the spilled coffee off her legs when, suddenly, a taxi collides with the stranger. The cabbie, filled with concern, immediately halts his vehicle and rushes over to assist the fallen man. The stranger, undeterred, opens a book he is carrying, revealing a line that travels at right angles across a map. Observing from outside, he watches as a bus drives away, and his book shows the line moving steadily towards a pulsing red dot. Determined, he runs after the bus, but inside, she attempts to tip David's cup. She swiftly grabs his phone, answers it, and then drops it into his coffee, which begins to bubble as the phone continues to ring. David retrieves his phone from the cup, and she wipes it clean on her skirt. Outside, the mustached stranger hurries across the street just as the bus comes to a stop. Elise steps off the bus and turns to face David, who is standing in the doorway as the doors close behind him. Elise grins at him through the window and, with a playful yet mocking frown, she flips him off. Smiling to himself, he watches her walk away, then sits back down, placing his coffee on the seat beside him. He notices Elise's number written on the back of one of his business cards and decides to make a call, but then hangs up. Later, he pushes through the revolving door of an office building and enters a lobby that is completely vacant. As he walks between two waist-high security scanners, he holds his card to the top of one and strides confidently towards an elevator. Upon emerging in a reception area, he notices that the receptionist's gaze remains fixed downward, her hand holding a phone to her ear. As he steps past another receptionist, her eyes remain focused straight ahead. Hurrying past two men who are standing in a corridor and a third who is seated in a waiting area, he enters the conference room. Inside, men dressed in shiny black body suits and visored helmets are working on his colleagues, who stand frozen in time. Two men are scanning Charlie's face with wand-like devices. Two men in hats look over, and one of them is the mustached stranger's superior. David races out of the room, and as he glances back, he sees the helmeted men close behind him. Sprinting to the reception area, he passes his frozen coworkers as more men join the pursuit. David runs up a flight of stairs, only to find the lead man waiting at the top. As David races down a corridor, the white-haired boss opens a door off the hall and walks through. Turning a corner, David sees the man in front of him, and taking another corridor, he finds the man waiting at its end. Several of the helmeted men close in on him, and David quickly doubles back, hurrying into Charlie's office and locking the door behind him. He then closes a second door leading to a small conference room, picks up a phone, and waits."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "As the mustached stranger stands patiently and calmly at the edge of a bustling, crowded intersection filled with the noise of traffic and people, he takes a deliberate moment to glance downward at his wristwatch, which prominently displays the precise time as 7:06 AM. With a swift and unintended flicking motion of his hand, he inadvertently causes David's cup of coffee to slosh around chaotically within its confines. Meanwhile, a lovely woman situated nearby is busily occupied with the task of wiping away the spilled coffee from her legs when, quite suddenly and without warning, a taxi collides forcefully with the stranger. The cabbie, deeply filled with concern and a sense of responsibility, immediately brings his vehicle to a halt and urgently rushes over to offer assistance to the fallen man. The stranger, seeming undeterred by the incident, opens a book he is holding, revealing a line that intriguingly travels at right angles across a detailed map. Observing attentively from outside, he watches as a bus gradually drives away, and in his book, the line steadily progresses towards a pulsing, inviting red dot. Fueled by determination, he runs with purpose after the bus, while inside, she attempts to tip David's cup. Swiftly, she seizes his phone, answers it hastily, and then drops it into his coffee, which begins to bubble as the phone continues its persistent ringing. David retrieves his phone from the coffee-laden cup, and she wipes it clean on her skirt. Outside, the mustached stranger hurries across the street just as the bus comes smoothly to a stop. Elise steps gracefully off the bus and turns to face David, who is standing poised in the doorway as the doors close securely behind him. Elise grins playfully at him through the window and, with a playful yet somewhat mocking frown, she flips him off. Smiling to himself with a sense of amusement, he watches her walk confidently away, then sinks back comfortably into his seat, placing his coffee gently on the adjacent seat beside him. He notices Elise's phone number neatly written on the back of one of his business cards and decides to make a call, but then abruptly hangs up. Later, he pushes with determination through the revolving door of an imposing office building and steps into a lobby that is eerily vacant and devoid of life. As he walks between two waist-high security scanners, he holds his card to the top of one and strides confidently towards an elevator. Upon emerging in a reception area, he observes that the receptionist's gaze remains fixed and focused downward, her hand holding a phone to her ear. As he steps past yet another receptionist, her eyes maintain a steady focus straight ahead, undisturbed. Hurrying past two men who are standing in a corridor and a third who is seated in a waiting area, he enters the conference room. Inside, men who are dressed in shiny, form-fitting black body suits and visored helmets are busily working on his colleagues, who are standing frozen in time, as if caught in a snapshot. Two men are intently scanning Charlie's face with wand-like devices. Two men in hats look over, and one of them is the mustached stranger's authoritative superior. David races urgently out of the room, and as he glances back, he sees the helmeted men following closely behind him. Sprinting with speed to the reception area, he passes his frozen coworkers as more men join the relentless pursuit. David ascends rapidly up a flight of stairs, only to find the lead man patiently waiting at the top. As David races with determination down a corridor, the white-haired boss opens a door off the hall and walks through. Turning a sharp corner, David sees the man in front of him, and taking yet another corridor, he finds the man waiting at its end. Several of the helmeted men close in swiftly on him, and David quickly doubles back, hurrying into Charlie's office and efficiently locking the door behind him. He then closes a second door leading to a small conference room, picks up a phone, and waits with anticipation."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "As the mustached stranger stands at the edge of a bustling intersection, he glances down at his wristwatch, noting the time as 7:06. With a swift flick of his wrist, he inadvertently causes David's coffee to spill slightly. Meanwhile, the lovely woman nearby hurriedly dabs at the coffee splashes on her legs. In a sudden turn of events, a taxi collides with the stranger, prompting the cabbie to halt his vehicle abruptly and rush over to assist the fallen man. Despite the commotion, the stranger manages to open a book, revealing a line that traverses at right angles across a map. Observing from outside, he watches as a bus departs, his book displaying the line advancing toward a pulsating red dot. Determined, he breaks into a run, chasing after the bus. Onboard, the woman attempts to tip David's cup, then swiftly snatches his phone, answers it, and lets it slip into his coffee, which begins to bubble as the phone continues to ring. David retrieves his phone from the cup, and she nonchalantly wipes it on her skirt. Outside, the mustached stranger hastens across the street just as the bus comes to a stop. Elise disembarks, turning to face David, who stands in the doorway as the bus doors close. Through the window, Elise grins mischievously at him and, with a playful frown, flips him off. Amused, David watches her walk away, then settles back into his seat, placing his coffee on the seat beside him. He notices Elise's number scribbled on the back of one of his business cards and decides to make a call, only to hang up shortly after. Later, he approaches the entrance of an office building, pushing through the revolving door into a deserted lobby. As he moves between two waist-high security scanners, he holds his card to the top of one and strides confidently toward the elevator. Upon emerging in a reception area, he notices the receptionist's gaze fixed downward, her hand holding a phone to her ear. As he walks past another receptionist, her eyes remain focused straight ahead. He hurries past two men engaged in conversation in a corridor and a third seated in a waiting area, making his way into the conference room. Inside, he is met with the sight of men clad in shiny black bodysuits and visored helmets, who are working on his colleagues, all of whom are frozen in time. Two men scan Charlie's face with wand-like devices, while two men in hats glance over, one of whom is the mustached stranger's superior. Realizing the gravity of the situation, David bolts out of the room, glancing back to see the helmeted men in pursuit. He sprints through the reception area, passing his immobilized coworkers as more men join the chase. David ascends a flight of stairs, only to find the lead man waiting at the top. Racing down a corridor, he spots the white-haired boss opening a door off the hall and stepping through. As he turns a corner, David sees the man ahead of him, and upon taking another corridor, he finds the man waiting at its end. With several helmeted men closing in, David quickly doubles back, rushing into Charlie's office and locking the door behind him. He secures a second door leading to a small conference room, then picks up a phone and waits, bracing himself for what comes next."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "As the mustached stranger waits at a busy intersection, he checks his wristwatch, which reads 7:06, and flicks his hand, causing David's coffee to spill. A taxi hits the stranger, prompting the cabbie to rush to his aid. The stranger opens a book, revealing a line moving across a map toward a pulsing red dot. He chases after a departing bus, while on board, a woman attempts to tip David's cup, grabs his phone, answers it, and drops it into his coffee. David retrieves his phone, and she wipes it on her skirt. Outside, the stranger hurries across the street as the bus stops. Elise disembarks, exchanges a playful gesture with David, and walks away. David smiles, sits, and places his coffee beside him, then calls Elise using her number on his business card. Later, he enters an office building, passes through security, and heads to an elevator. In the reception area, he moves past preoccupied receptionists and hurries through a corridor, entering a conference room where men in black suits and helmets work on his frozen colleagues. Spotting the mustached stranger's superior, David flees, pursued by helmeted men. He races through the building, evading them by doubling back and locking himself in Charlie's office, where he waits with a phone in hand."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "As the mustached stranger waits to cross a busy intersection in downtown Chicago, known for its bustling streets and iconic architecture, he checks his vintage wristwatch, which reads 7:06, a time reflecting the city's early morning rush. He makes a flicking motion, causing David's coffee to slosh and spill, a common mishap in crowded urban settings. As the lovely woman wipes coffee off her legs, a taxi, one of the ubiquitous yellow cabs that navigate the city's traffic, hits the stranger, and the concerned cabbie stops his car to rush to the fallen man. The stranger opens the book, a curious artifact that defies typical conventions, revealing a line traveling at right angles across what appears to be a mysterious map. Outside, he watches the bus drive off—a familiar sight of public transportation, and his book shows the line moving towards a pulsing red dot, like a digital beacon guiding him. He runs after the bus, but on board, she mischievously tries to tip David's cup. She grabs his phone, answers unexpectedly, and drops it into his coffee, causing it to bubble as the phone rings with a muffled sound. David extracts his phone, now wet and malfunctioning, and she wipes it on her skirt, a futile attempt at damage control. Outside, the mustached stranger hurriedly crosses another street as the bus stops. Elise, with an air of confidence typical of a city commuter, climbs off and turns to David, who stands in the doorway of the bus as the doors close. Elise grins at him through a window and, with a mocking frown, she flips him off, a gesture reflecting their playful rapport. Smiling, he watches her head away, then sits again, placing his coffee in the seat beside him. He eyes Elise's number, scrawled casually on the back of one of his business cards, and makes a call, then hangs up, contemplating their next encounter. Later, he pushes the revolving door of an office building in the business district and enters a vacant lobby, a stark contrast to the bustling streets outside. As he passes between two waist-high security scanners, he holds his card to the top of one, a common security protocol in modern corporate environments, and strides to an elevator. Emerging in a sleek, minimalist reception area, the receptionist's gaze remains down, her hand holding a phone to her ear, possibly engaged in a routine call. As he steps past another receptionist, her eyes remain ahead, avoiding unnecessary interaction. Hurrying past two men standing in a corridor and a third sitting in a waiting area, he enters the high-tech conference room. Inside, men in shiny black body suits and visored helmets, reminiscent of futuristic security forces, work on his colleagues, who stand frozen in time, an eerie and unsettling sight. Two men scan Charlie's face with wand-like devices, high-tech tools of unknown purpose. Two men in hats look over, and one is the mustached stranger's superior, exuding authority. David races out, and glancing back, he sees the helmeted men close behind, relentless in their pursuit. Sprinting to the reception area, he passes his frozen coworkers as more men join the chase, creating a tense and urgent atmosphere. David runs up some stairs, finding the lead man at the top, seemingly anticipating his move. As David races down a corridor, the white-haired boss, known for his stern leadership, opens a door off the hall and walks through, adding to the intrigue. Turning a corner, David sees the man in front of him, and taking another corridor, he finds the man waiting at its end, suggesting an uncanny ability to predict David's actions. Several of the helmeted men close in, and David doubles back, hurrying into Charlie's office and locking the door, seeking a momentary refuge. He closes a second door leading to a small conference room, then picks up a phone and waits, hoping for a resolution to the chaotic chase."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "The stranger opens the book revealing a line traveling at right angles across a map  Outside he watches the bus drive off and his book shows the line moving towards a pulsing red dot  He runs after the bus but on board she tries to tip David's cup  She grabs his phone answers and drops it into his coffee which bubbles as the phone rings  David extracts his phone and she wipes it on her skirt  Outside the mustached stranger hurries across a street as the bus stops  Elise climbs off and turns to David who stands in the doorway  as the doors close  Elise grins at him through a window and with a mocking frown she flips him off  Smiling he watches her head away then sits again placing his coffee in the seat beside him  He eyes Elise's number on the back of one of his business cards and makes a call then hangs up  Later he pushes the revolving door of an office building and enters a vacant lobby  As he passes between two waisthigh security scanners he holds his card to the top of one and strides to an elevator  Emerging in a reception area the receptionist's gaze remains down her hand holding a phone to her ear  As he steps past another receptionist her eyes remain ahead  As the mustached stranger waits to cross a busy intersection he checks his wristwatch which reads 706  He makes a flicking motion causing David's coffee to slosh  As the lovely woman wipes coffee off her legs a taxi hits the stranger and the cabbie stops his car to rush to the fallen man  The stranger opens the book revealing a line traveling at right angles across a map  Outside he watches the bus drive off and his book shows the line moving towards a pulsing red dot  He runs after the bus but on board she tries to tip David's cup  She grabs his phone answers and drops it into his coffee which bubbles as the phone rings  David extracts his phone and she wipes it on her skirt  Outside the mustached stranger hurries across a street as the bus stops  Elise climbs off and turns to David who stands in the doorway  as the doors close  Elise grins at him through a window and with a mocking frown she flips him off  Smiling he watches her head away then sits again placing his coffee in the seat beside him  He eyes Elise's number on the back of one of his business cards and makes a call then hangs up  Later he pushes the revolving door of an office building and enters a vacant lobby  As he passes between two waisthigh security scanners he holds his card to the top of one and strides to an elevator  Emerging in a reception area the receptionist's gaze remains down her hand holding a phone to her ear  As he steps past another receptionist her eyes remain ahead  Hurrying past two men standing in a corridor and a third sitting in a waiting area he enters the conference room  Inside men in shiny black body suits and visored helmets work on his colleagues who stand frozen in time  Two men scan Charlie's face with wandlike devices  Two men in hats look over and one is the mustached stranger's superior  David races out and glancing back he sees the helmeted men close behind  Sprinting to the reception area he passes his frozen coworkers  as more men join the chase  David runs up some stairs finding the lead man at the top  As David races down a corridor the whitehaired boss opens a door off the hall and walks through  Turning a corner David sees the man in front of him and taking another corridor he finds the man waiting at its end  Several of the helmeted men close in and David doubles back hurrying into Charlie's office and locking the door  He closes a second door leading to a small conference room then picks up a phone and waits"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "As the mustached stranger waits to cross a busy intersection he checks his wristwatch which reads 706. He makes a flicking motion causing David's coffee to slosh. As the lovely woman wipes coffee off her legs a taxi hits the stranger and the cabbie stops his car to rush to the fallen man. The stranger opens the book revealing a line traveling at right angles across a map. Outside he watches the bus drive off and his book shows the line moving towards a pulsing red dot. He runs after the bus but on board she tries to tip David's cup. She grabs his phone answers and drops it into his coffee which bubbles as the phone rings. David extracts his phone and she wipes it on her skirt. Outside the mustached stranger hurries across a street as the bus stops. Elise climbs off and turns to David who stands in the doorway. as the doors close. Elise grins at him through a window and with a mocking frown she flips him off. Smiling he watches her head away then sits again placing his coffee in the seat beside him. He eyes Elise's number on the back of one of his business cards and makes a call then hangs up. Later he pushes the revolving door of an office building and enters a vacant lobby. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. As he passes between two waisthigh security scanners he holds his card to the top of one and strides to an elevator. Emerging in a reception area the receptionist's gaze remains down her hand holding a phone to her ear. As he steps past another receptionist her eyes remain ahead. Hurrying past two men standing in a corridor and a third sitting in a waiting area he enters the conference room. Inside men in shiny black body suits and visored helmets work on his colleagues who stand frozen in time. Two men scan Charlie's face with wandlike devices. Two men in hats look over and one is the mustached stranger's superior. David races out and glancing back he sees the helmeted men close behind. Sprinting to the reception area he passes his frozen coworkers. as more men join the chase. David runs up some stairs finding the lead man at the top. As David races down a corridor the whitehaired boss opens a door off the hall and walks through. Turning a corner David sees the man in front of him and taking another corridor he finds the man waiting at its end. Several of the helmeted men close in and David doubles back hurrying into Charlie's office and locking the door. He closes a second door leading to a small conference room then picks up a phone and waits."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "As the mustached stranger waits to cross a busy intersection he checks his wristwatch which reads 706. He makes a flicking motion causing David's coffee to slosh. As the lovely woman wipes coffee off her legs a taxi hits the stranger and the cabbie stops his car to rush to the fallen man. The stranger opens the book revealing a line traveling at right angles across a map. Outside he watches the bus drive off and his book shows the line moving towards a pulsing red dot. He runs after the bus but on board she tries to tip David's cup. She grabs his phone answers and drops it into his coffee which bubbles as the phone rings. David extracts his phone and she wipes it on her skirt. Outside the mustached stranger hurries across a street as the bus stops. Elise climbs off and turns to David who stands in the doorway. as the doors close. Elise grins at him through a window and with a mocking frown she flips him off. Smiling he watches her head away then sits again placing his coffee in the seat beside him. He eyes Elise's number on the back of one of his business cards and makes a call then hangs up. Later he pushes the revolving door of an office building and enters a vacant lobby. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. In a bustling marketplace in ancient Persia a cunning street thief navigates labyrinthine alleyways and vibrant bazaars. his calculated every move a daring escape from the everwatchful royal guards. As he passes between two waisthigh security scanners he holds his card to the top of one and strides to an elevator. Emerging in a reception area the receptionist's gaze remains down her hand holding a phone to her ear. As he steps past another receptionist her eyes remain ahead. Hurrying past two men standing in a corridor and a third sitting in a waiting area he enters the conference room. Inside men in shiny black body suits and visored helmets work on his colleagues who stand frozen in time. Two men scan Charlie's face with wandlike devices. Two men in hats look over and one is the mustached stranger's superior. David races out and glancing back he sees the helmeted men close behind. Sprinting to the reception area he passes his frozen coworkers. as more men join the chase. David runs up some stairs finding the lead man at the top. As David races down a corridor the whitehaired boss opens a door off the hall and walks through. Turning a corner David sees the man in front of him and taking another corridor he finds the man waiting at its end. Several of the helmeted men close in and David doubles back hurrying into Charlie's office and locking the door. He closes a second door leading to a small conference room then picks up a phone and waits."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "As the mustached stranger waits to cross a busy intersection he checks his wristwatch which reads 706. He makes a flicking motion causing David's coffee to slosh. As the lovely woman wipes coffee off her legs a taxi hits the stranger and the cabbie stops his car to rush to the fallen man. The stranger opens the book revealing a line traveling at right angles across a map. Outside he watches the bus drive off and his book shows the line moving towards a pulsing red dot. He runs after the bus but on board she tries to tip David's cup. She grabs his phone answers and drops it into his coffee which bubbles as the phone rings. David extracts his phone and she wipes it on her skirt. Sprinting to the reception area he passes his frozen coworkers. as more men join the chase. David runs up some stairs finding the lead man at the top. As David races down a corridor the whitehaired boss opens a door off the hall and walks through. Turning a corner David sees the man in front of him and taking another corridor he finds the man waiting at its end. Several of the helmeted men close in and David doubles back hurrying into Charlie's office and locking the door. He closes a second door leading to a small conference room then picks up a phone and waits."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "As the mustached stranger waits to cross a busy intersection he checks his wristwatch which reads 706. He makes a flicking motion causing David's coffee to slosh. As the lovely woman wipes coffee off her legs a taxi hits the stranger and the cabbie stops his car to rush to the fallen man. Turning a corner David sees the man in front of him and taking another corridor he finds the man waiting at its end. Several of the helmeted men close in and David doubles back hurrying into Charlie's office and locking the door. He closes a second door leading to a small conference room then picks up a phone and waits."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "As the singing bird waits to cross a busy intersection, it checks its wristwatch, which reads 7:06. It makes a flicking motion, causing a squirrel's coffee to slosh. As the lovely tree wipes coffee off its legs, a taxi hits the bird, and the river stops its car to rush to the fallen flower. The bird opens the book, revealing a line traveling at right angles across a map. Outside, it watches the bus drive off, and its book shows the line moving towards a pulsing red dot. It runs after the bus, but on board, the mountain tries to tip the squirrel's cup. The lake grabs its phone, answers, and drops it into the squirrel's coffee, which bubbles as the phone rings. The squirrel extracts its phone and the mountain wipes it on its skirt. Outside, the singing bird hurries across a street as the bus stops. A river climbs off and turns to the squirrel, who stands in the doorway as the doors close. The river grins at it through a window and, with a mocking frown, it flips it off. Smiling, it watches the river head away, then sits again, placing its coffee in the seat beside it. It eyes a mountain's number on the back of one of its business cards and makes a call, then hangs up. Later, it pushes the revolving door of an office building and enters a vacant lobby. As it passes between two waist-high security scanners, it holds its card to the top of one and strides to an elevator. Emerging in a reception area, the mountain's gaze remains down, its hand holding a phone to its ear. As it steps past another mountain, its eyes remain ahead. Hurrying past two forests standing in a corridor and a third sitting in a waiting area, it enters the conference room. Inside, forests in shiny black body suits and visored helmets work on its colleagues, who stand frozen in time. Two forests scan the ocean's face with wand-like devices. Two forests in hats look over, and one is the singing bird's superior. The squirrel races out, and glancing back, it sees the helmeted forests close behind. Sprinting to the reception area, it passes its frozen coworkers as more forests join the chase. The squirrel runs up some stairs, finding the lead forest at the top. As the squirrel races down a corridor, the white-haired river opens a door off the hall and walks through. Turning a corner, the squirrel sees the forest in front of it, and taking another corridor, it finds the forest waiting at its end. Several of the helmeted forests close in, and the squirrel doubles back, hurrying into the ocean's office and locking the door. It closes a second door leading to a small conference room, then picks up a phone and waits."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "As the mustached stranger waits to cross a bustling canal, he checks his hourglass, which reads 7:06. He makes a flicking motion, causing David's lemonade to slosh. As the lovely woman wipes lemonade off her legs, a rickshaw hits the stranger, and the driver stops his vehicle to rush to the fallen man. The stranger opens the backpack, revealing a line traveling at right angles across a globe. Outside, he watches the train drive off, and his backpack shows the line moving towards a pulsing blue dot. He runs after the train, but on board, she tries to tip David's teacup. She grabs his calculator, answers, and drops it into his lemonade, which fizzes as the calculator beeps. David extracts his calculator and she wipes it on her blouse. Outside, the mustached stranger hurries across a path as the train stops. Elise climbs off and turns to David, who stands in the doorway as the doors close. Elise grins at him through a porthole and, with a mocking frown, she waves a paper fan. Smiling, he watches her head away, then sits again, placing his lemonade in the seat beside him. He eyes Elise's initials on the back of one of his postcards and sends a message, then hangs up. Later, he pushes the turnstile of a library and enters a vacant atrium. As he passes between two waist-high metal detectors, he holds his card to the top of one and strides to an escalator. Emerging in a lobby area, the receptionist's gaze remains down, her hand holding a gemstone to her ear. As he steps past another receptionist, her eyes remain ahead. Hurrying past two men standing in a garden and a third sitting in a lounge, he enters the exhibition room. Inside, men in shiny black capes and visored helmets work on his colleagues, who stand frozen in time. Two men scan Charlie's face with wand-like telescopes. Two men in turbans look over, and one is the mustached stranger's superior. David races out, and glancing back, he sees the helmeted men close behind. Sprinting to the lobby area, he passes his frozen coworkers as more men join the pursuit. David runs up some ladders, finding the lead man at the top. As David races down a passageway, the white-haired boss opens a hatch off the hall and walks through. Turning a bend, David sees the man in front of him, and taking another passageway, he finds the man waiting at its end. Several of the helmeted men close in, and David doubles back, hurrying into Charlie's chambers and locking the door. He closes a second portal leading to a small exhibition room, then picks up a walkie-talkie and waits."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "As the mustached stranger prepares to run across a busy intersection, he adjusts his wristwatch, which displays 7:06. He makes a waving motion, causing David's coffee to spill. As the lovely woman dabs coffee off her legs, a taxi grazes the stranger, and the cabbie exits his car to stroll to the fallen man. The stranger conceals the book, revealing a line twisting at right angles across a map. Outside, he observes the bus pull away, and his book displays the line veering towards a flashing red dot. He strolls after the bus, but on board, she attempts to spill David's cup. She snatches his phone, listens, and tosses it into his coffee, which fizzes as the phone buzzes. David retrieves his phone, and she rubs it on her skirt. Outside, the mustached stranger wanders across a street as the bus pauses. Elise leaps off and turns to David, who stands in the doorway as the doors shut. Elise winks at him through a window and, with a playful frown, she waves him off. Laughing, he observes her stroll away, then leans back, placing his coffee in the seat beside him. He scans Elise's number on the back of one of his business cards and sends a text, then deletes it. Later, he drags the revolving door of an office building and greets a bustling lobby. As he wanders between two waist-high security scanners, he taps his card on the top of one and strolls to an elevator. Arriving in a reception area, the receptionist's gaze remains up, her hand pointing a phone to her ear. As he moves past another receptionist, her eyes remain below. Strolling past two men leaning in a corridor and a third standing in a waiting area, he surveys the conference room. Inside, men in shiny black body suits and visored helmets interact with his colleagues, who stand frozen in time. Two men tickle Charlie's face with wand-like devices. Two men in hats glance over, and one is the mustached stranger's superior. David saunters out, and glancing back, he notices the helmeted men amble behind. Jogging to the reception area, he passes his frozen coworkers as more men join the pursuit. David climbs down some stairs, spotting the lead man at the bottom. As David jogs down a corridor, the white-haired boss shuts a door off the hall and peeks through. Turning a corner, David notices the man behind him, and taking another corridor, he encounters the man lingering at its end. Several of the helmeted men drift in, and David retreats again, pausing in Charlie's office and leaving the door ajar. He cracks a second door leading to a small conference room, then lifts a phone and listens."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "As the feathered tree waits to cross a busy intersection, it checks its waistband, which reads 7:06. It makes a flicking motion, causing Lucy's apple juice to slosh. As the wooden chair wipes apple juice off its legs, a bicycle hits the tree, and the rider stops its scooter to rush to the fallen table. The tree opens the magazine, revealing a rope traveling at right angles across a blueprint. Outside, it watches the airplane drive off, and its magazine shows the rope moving towards a pulsing green triangle. It runs after the airplane, but on board, the lamp tries to tip Lucy's glass. The lamp grabs its sandwich, answers, and drops it into its apple juice, which bubbles as the sandwich rings. Lucy extracts its sandwich and the lamp wipes it on its curtain. Outside, the feathered tree hurries across a river as the airplane stops. George climbs off and turns to Lucy, who stands in the doorway as the gates close. George grins at it through a window and, with a mocking frown, it flips it off. Smiling, it watches it head away, then sits again, placing its apple juice in the spot beside it. It eyes George's name on the back of one of its postcards and makes a call, then hangs up. Later, it pushes the revolving gate of a museum and enters a vacant patio. As it passes between two waist-high paintings, it holds its postcard to the top of one and strides to a helicopter. Emerging in a gallery, the curator's gaze remains down, its shoe holding a brush to its ear. As it steps past another curator, its eyes remain ahead. Hurrying past two shadows standing in a hall and a third sitting in a waiting area, it enters the laboratory. Inside, shadows in shiny black cloaks and visored masks work on its companions, who stand frozen in time. Two shadows scan Charlie's chin with wand-like devices. Two shadows in helmets look over, and one is the feathered tree's subordinate. Lucy races out, and glancing back, it sees the masked shadows close behind. Sprinting to the gallery, it passes its frozen creatures as more shadows join the chase. Lucy runs up some ladders, finding the lead shadow at the top. As Lucy races down a hall, the bald conductor opens a gate off the yard and walks through. Turning a corner, Lucy sees the shadow in front of it, and taking another hall, it finds the shadow waiting at its end. Several of the masked shadows close in, and Lucy doubles back, hurrying into Charlie's study and locking the gate. It closes a second gate leading to a small gallery, then picks up a napkin and waits."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "As the bearded chicken perches to cross a bustling aquarium, it consults its calendar, which reads 7:06. It makes a swiping gesture, causing Lucy's sandwich to tumble. As the dashing penguin wipes sandwich crumbs off her legs, a scooter taps the chicken, and the rider dismounts to waddle to the toppled bird. The chicken unwraps the sandwich, revealing a worm squirming at sharp angles across a map. Outside, it notices the balloon float away, and its sandwich shows the worm creeping towards a blinking blue star. It hops after the balloon, but on board, she plans to dip Lucy's fries. She snatches his camera, responds, and tosses it into his sandwich, which fizzles as the camera beeps. Lucy removes his camera and she cleans it on her apron. Outside, the bearded chicken skips across a river as the balloon lands. Jerry jumps off and twirls to Lucy, who stands on the porch as the gates close. Jerry winks at him through a fence and, with a playful pout, she waves him off. Grinning, he watches her stride away, then reclines again, placing his sandwich in the tray beside him. He glances at Jerry's doodle on the back of one of his postcards and sends a text, then deletes it. Later, he pulls the sliding door of a library and enters a deserted cafeteria. As he squeezes between two chest-high bookcases, he presses his postcard to the top of one and skips to an escalator. Arriving in an atrium, the usher's attention remains down, her finger holding a microphone to her chin. As he tiptoes past another usher, her focus remains forward. Scurrying past two squirrels lounging in a meadow and a third dozing in a hammock, he enters the auditorium. Inside, creatures in shimmering green cloaks and feathered hats dance around his teammates, who hover paused in motion. Two creatures scan Oscar's back with laser beams. Two creatures in cloaks look over, and one is the bearded chicken's mentor. Lucy sprints out, and peeking back, she sees the cloaked creatures close behind. Dashing to the atrium, she passes her paused friends as more creatures join the pursuit. Lucy sprints down some vines, finding the leader at the base. As Lucy dashes through a meadow, the gray-robed guide opens a gate off the field and strolls through. Turning a brook, Lucy spots the creature in front of her, and taking another meadow, she finds the creature waiting at its edge. Several of the cloaked creatures crowd in, and Lucy circles back, sprinting into Oscar's lounge and bolting the gate. She latches a second gate leading to a snug courtyard, then grabs a microphone and listens."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "As the mustached stranger reclines to cross a bustling market, he glimpses his calendar, which reads 7:06. He makes a waving gesture, causing David's smoothie to leap. As the lovely woman dabs smoothie off her arms, a bicycle taps the stranger, and the cyclist parks his moped to amble to the sprawled man. The stranger flips the magazine, revealing a river flowing in curves across a blueprint. Outside, he observes the helicopter soar away, and his magazine shows the river meandering towards a blinking blue star. He saunters after the helicopter, but on board, she attempts to nudge David's mug. She snatches his tablet, answers, and dunks it into his smoothie, which froths as the tablet buzzes. David retrieves his tablet, and she polishes it on her scarf. Outside, the mustached stranger ambles across a meadow as the helicopter halts. Elise hops off and spins to David, who stands in the archway as the gates swing shut. Elise winks at him through a hatch and, with a teasing grin, she pokes her tongue out. Chuckling, he observes her skip away, then leans again, resting his smoothie on the bench beside him. He gazes at Elise's name on the back of one of his notebooks and sends a text, then signs off. Later, he twirls the turnstile of a shopping complex and enters an empty atrium. As he weaves between two chest-high metal detectors, he presses his notebook to the side of one and strides to an escalator. Emerging in a foyer, the secretary's gaze remains fixed, her hand gripping a pagoda. As he strides past another secretary, her eyes remain ahead. Darting past two women lounging in a hallway and a fourth lying in a reading area, he enters the meeting chamber. Inside, women in gleaming white dresses and translucent masks adjust his colleagues, who sit suspended in space. Two women scan Charlie's hand with stick-like devices. Two women in scarves peer over, and one is the mustached stranger's leader. David trots out, and peering back, he spots the masked women trailing closely. Jogging to the foyer, he passes his suspended coworkers as more women merge in pursuit. David climbs down some ramps, spotting the lead woman at the bottom. As David dashes through a hallway, the bald manager opens a hatch off the corridor and steps in. Wheeling around, David spots the woman beside him, and taking another hallway, he discovers the woman pausing at its edge. Several of the masked women close in, and David circles back, darting into Charlie's cubicle and sealing the gate. He latches a second gate leading to a tiny meeting space, then grabs a pagoda and listens."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "As the bespectacled dog waits to swim across a tranquil lake, it taps its monocle, which displays 12:43. It performs a shaking dance, causing Sally's juice to splash. As the grumpy duck dabs juice off its wings, a bicycle bumps the dog, and the cyclist parks his scooter to amble to the sprawled creature. The dog unrolls the scroll, revealing a path bouncing off the edges of a puzzle. Inside, it notices the train chug away, and its scroll depicts the path inching towards a flashing green triangle. It skips behind the train, but on board, he attempts to tilt Charlie's jug. He snatches her notebook, flips it open, and flings it into her soup, which sizzles as the notebook shakes. Charlie fishes out her notebook and he rubs it against her jacket. Inside, the bespectacled dog dashes across a meadow as the train halts. George flies off and turns to Charlie, who lingers in the corridor as the doors swing open. George chuckles at her through a porthole and, with a playful grin, she claps for him. Chuckling, he observes her soar away, then lounges again, placing his juice on the floor beside him. He gazes at George's doodle on the back of one of her photos and scribbles a note, then erases it. Soon, he pulls the rotating gate of a mansion and strides into an abandoned courtyard. As he ambles between two chest-high flower pots, he places his photo on the top of one and prances to a staircase. Arriving in a gallery, the curator's eyes stay closed, her paw clutching a whistle to her snout. As he ambles past another curator, her ears remain erect. Scurrying past two giraffes lounging in a hallway and a third dozing in a rocking chair, he enters the banquet hall. Inside, dolphins in glittery orange overalls and horned helmets hover over his teammates, who stand frozen in salt. Two dolphins check Fred's feet with spoon-like instruments. Two dolphins in scarves glance over, and one is the bespectacled dog's instructor. Charlie dashes out, and peering back, he sees the helmeted dolphins close alongside. Galloping to the gallery, he surpasses his frozen teammates as more dolphins join the pursuit. Charlie vaults down some ladders, encountering the leading dolphin at the base. As Charlie gallops through a hallway, the blue-furred accountant opens a curtain off the passage and strolls ahead. Swiveling around a post, Charlie spots the dolphin next to him, and twisting around another hall, he discovers the dolphin lounging at its exit. Several of the helmeted dolphins zoom in, and Charlie loops back, scuttling into Fred's den and sealing the entrance. He secures a third entrance leading to a narrow pantry, then plucks up a whistle and lingers."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "As a mustached stranger waits at an intersection, he flicks David's coffee, causing it to spill. A taxi hits the stranger, and the cabbie rushes to him. The stranger opens a book showing a line moving toward a red dot. He chases a bus, while on board, a woman disrupts David by dropping his ringing phone in his coffee. After she disembarks, David watches her, smiles, and calls her number from his business card. Entering an office, David goes through security and reaches a conference room where men in helmets freeze his colleagues in time. Among them is the mustached stranger's superior. As David flees, helmeted men pursue him through the building. He races to his office, locking the doors behind him, and picks up a phone waiting for a response."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "He closes a second door leading to a small conference room then picks up a phone and waits Several of the helmeted men close in and David doubles back hurrying into Charlie's office and locking the door  Turning a corner David sees the man in front of him and taking another corridor he finds the man waiting at its end  As David races down a corridor the whitehaired boss opens a door off the hall and walks through  David runs up some stairs finding the lead man at the top  as more men join the chase  Sprinting to the reception area he passes his frozen coworkers  David races out and glancing back he sees the helmeted men close behind  Two men in hats look over and one is the mustached stranger's superior  Two men scan Charlie's face with wandlike devices  Inside men in shiny black body suits and visored helmets work on his colleagues who stand frozen in time  Hurrying past two men standing in a corridor and a third sitting in a waiting area he enters the conference room  As he steps past another receptionist her eyes remain ahead  Emerging in a reception area the receptionist's gaze remains down her hand holding a phone to her ear  As he passes between two waisthigh security scanners he holds his card to the top of one and strides to an elevator  Later he pushes the revolving door of an office building and enters a vacant lobby  He eyes Elise's number on the back of one of his business cards and makes a call then hangs up  Smiling he watches her head away then sits again placing his coffee in the seat beside him  Elise grins at him through a window and with a mocking frown she flips him off  as the doors close  Elise climbs off and turns to David who stands in the doorway  Outside the mustached stranger hurries across a street as the bus stops  David extracts his phone and she wipes it on her skirt  She grabs his phone answers and drops it into his coffee which bubbles as the phone rings  He runs after the bus but on board she tries to tip David's cup  Outside he watches the bus drive off and his book shows the line moving towards a pulsing red dot  The stranger opens the book revealing a line traveling at right angles across a map  As the lovely woman wipes coffee off her legs a taxi hits the stranger and the cabbie stops his car to rush to the fallen man  He makes a flicking motion causing David's coffee to slosh  As the mustached stranger waits to cross a busy intersection he checks his wristwatch which reads 706 "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Elise climbs off and turns to David who stands in the doorway  As the mustached stranger waits to cross a busy intersection he checks his wristwatch which reads 706  Inside men in shiny black body suits and visored helmets work on his colleagues who stand frozen in time  Two men in hats look over and one is the mustached stranger's superior  Several of the helmeted men close in and David doubles back hurrying into Charlie's office and locking the door  He runs after the bus but on board she tries to tip David's cup  Sprinting to the reception area he passes his frozen coworkers  David runs up some stairs finding the lead man at the top  Two men scan Charlie's face with wandlike devices  Later he pushes the revolving door of an office building and enters a vacant lobby  as more men join the chase  As he passes between two waisthigh security scanners he holds his card to the top of one and strides to an elevator  Emerging in a reception area the receptionist's gaze remains down her hand holding a phone to her ear  David extracts his phone and she wipes it on her skirt  As he steps past another receptionist her eyes remain ahead  He makes a flicking motion causing David's coffee to slosh  As David races down a corridor the whitehaired boss opens a door off the hall and walks through  Hurrying past two men standing in a corridor and a third sitting in a waiting area he enters the conference room  Elise grins at him through a window and with a mocking frown she flips him off  He closes a second door leading to a small conference room then picks up a phone and waits Smiling he watches her head away then sits again placing his coffee in the seat beside him  As the lovely woman wipes coffee off her legs a taxi hits the stranger and the cabbie stops his car to rush to the fallen man  The stranger opens the book revealing a line traveling at right angles across a map  Turning a corner David sees the man in front of him and taking another corridor he finds the man waiting at its end  She grabs his phone answers and drops it into his coffee which bubbles as the phone rings  Outside he watches the bus drive off and his book shows the line moving towards a pulsing red dot  Outside the mustached stranger hurries across a street as the bus stops  as the doors close  He eyes Elise's number on the back of one of his business cards and makes a call then hangs up  David races out and glancing back he sees the helmeted men close behind "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "As he passes between two waisthigh security scanners he holds his card to the top of one and strides to an elevator  Emerging in a reception area the receptionist's gaze remains down her hand holding a phone to her ear  As he steps past another receptionist her eyes remain ahead  Hurrying past two men standing in a corridor and a third sitting in a waiting area he enters the conference room  Inside men in shiny black body suits and visored helmets work on his colleagues who stand frozen in time  Two men scan Charlie's face with wandlike devices  Two men in hats look over and one is the mustached stranger's superior  David races out and glancing back he sees the helmeted men close behind  Sprinting to the reception area he passes his frozen coworkers  as more men join the chase  David runs up some stairs finding the lead man at the top  As David races down a corridor the whitehaired boss opens a door off the hall and walks through  Turning a corner David sees the man in front of him and taking another corridor he finds the man waiting at its end  Several of the helmeted men close in and David doubles back hurrying into Charlie's office and locking the door  He closes a second door leading to a small conference room then picks up a phone and waits As the mustached stranger waits to cross a busy intersection he checks his wristwatch which reads 706  He makes a flicking motion causing David's coffee to slosh  As the lovely woman wipes coffee off her legs a taxi hits the stranger and the cabbie stops his car to rush to the fallen man  The stranger opens the book revealing a line traveling at right angles across a map  Outside he watches the bus drive off and his book shows the line moving towards a pulsing red dot  He runs after the bus but on board she tries to tip David's cup  She grabs his phone answers and drops it into his coffee which bubbles as the phone rings  David extracts his phone and she wipes it on her skirt  Outside the mustached stranger hurries across a street as the bus stops  Elise climbs off and turns to David who stands in the doorway  as the doors close  Elise grins at him through a window and with a mocking frown she flips him off  Smiling he watches her head away then sits again placing his coffee in the seat beside him  He eyes Elise's number on the back of one of his business cards and makes a call then hangs up  Later he pushes the revolving door of an office building and enters a vacant lobby "
        }
      ]
    }
  ]
}