{
  "ground_truth": "A footage of Neil Armstrong's first step on the moon is shown on television, followed by Forrest looking at a man. A large mural of Mao Tse-tung hangs on the wall while Forrest plays ping-pong against a Chinese player as a crowd of communist leaders sit and watch. Dick Cavett stands up to introduce Forrest, who makes his way onto the stage and shakes hands with Cavett. Forrest sits down between John Lennon and Cavett and looks oddly at Lennon, who lights a cigarette. A guard lets Forrest out a side entrance door, and Forrest steps and then stops as he hears a man in a wheelchair speak to him. Forrest looks at Lt. Dan, who is dirty with long hair, as Dan's wheelchair begins to slide down the ramp and spins on the icy ground. Forrest watches as Lt. Dan crashes at the bottom of the ramp. Taxi cabs crowd the street as Forrest pushes Lt. Dan along the sidewalk, with one taxi driver honking as Lt. Dan gets wheeled out in front of it. Another taxi skids to a stop, almost hitting them as they cross the street, and Lt. Dan slaps the bumper of the taxi. A Bob Hope Christmas special in Vietnam plays on television as Lt. Dan and Forrest watch. Lt. Dan chuckles, drinks the rest of a bottle of wine, and tosses it down before looking at Forrest. He wheels himself over to the television and turns it off, picks up another bottle of port wine which is empty, and tosses it onto the floor. Lt. Dan becomes enraged, throws the bottle, and looks at Forrest as a television shows Dick Clark emceeing the Times Square New Year's Eve celebration. Two sleazy women named Lenore and Carla walk up to Lt. Dan. Lenore fixes her makeup and leans to speak into Forrest's ear. The people in the bar cheer, kiss, blow horns, and toss confetti into the air. Forrest looks around as Carla and Lenore lean over and kiss him. Carla removes her top and sits on top of Dan in his wheelchair, and they kiss and play around. Forrest sits in a chair, then Lenore leaps on him and begins to kiss him, reaching down to his crotch. Forrest stands up nervously, causing Lenore to fall to the floor. Lenore stands up, angry, as Lt. Dan throws Carla back onto the bed. Lt. Dan falls out of his wheelchair and lands on the floor as Carla and Lenore laugh and leave the apartment. Forrest tries to help Lt. Dan.",
  "categories": [
    {
      "category": "Word-Level and Grammar",
      "test_cases": [
        {
          "id": "1.1",
          "name": "Synonym Substitution",
          "description": "A recording of Neil Armstrong's initial stride on the moon is presented on television, followed by Forrest glancing at a gentleman. A large painting of Mao Tse-tung hangs on the partition while Forrest plays ping-pong against a Chinese participant as a crowd of communist officials sit and observe. Dick Cavett rises to introduce Forrest, who makes his path onto the platform and shakes hands with Cavett. Forrest sits down between John Lennon and Cavett and gazes oddly at Lennon, who lights a cigarette. A guard permits Forrest out a lateral entrance portal, and Forrest steps and then halts as he hears a person in a wheelchair address him. Forrest glances at Lt. Dan, who is dirty with long hair, as Dan's wheelchair starts to slide down the incline and spins on the frozen surface. Forrest observes as Lt. Dan crashes at the base of the ramp. Taxi cabs congest the avenue as Forrest pushes Lt. Dan along the pavement, with one taxi driver honking as Lt. Dan gets wheeled out in front of it. Another taxi skids to a halt, almost striking them as they cross the road, and Lt. Dan slaps the bumper of the taxi. A Bob Hope Christmas special in Vietnam plays on television as Lt. Dan and Forrest watch. Lt. Dan chuckles, finishes the remainder of a bottle of wine, and tosses it down before glancing at Forrest. He wheels himself over to the television and turns it off, picks up another bottle of port wine which is empty, and tosses it onto the floor. Lt. Dan becomes enraged, hurls the bottle, and glances at Forrest as a television displays Dick Clark emceeing the Times Square New Year's Eve celebration. Two sleazy women named Lenore and Carla approach Lt. Dan. Lenore fixes her makeup and leans to speak into Forrest's ear. The individuals in the bar cheer, kiss, blow horns, and toss confetti into the air. Forrest glances around as Carla and Lenore lean over and kiss him. Carla removes her top and sits on top of Dan in his wheelchair, and they kiss and play around. Forrest sits in a chair, then Lenore leaps on him and begins to kiss him, reaching down to his crotch. Forrest stands up nervously, causing Lenore to fall to the floor. Lenore stands up, angry, as Lt. Dan throws Carla back onto the bed. Lt. Dan falls out of his wheelchair and lands on the floor as Carla and Lenore laugh and leave the apartment. Forrest tries to assist Lt. Dan."
        },
        {
          "id": "1.2",
          "name": "Active <-> Passive Transformation",
          "description": "A footage of Neil Armstrong's first step on the moon was shown on television, followed by a man being looked at by Forrest. The wall is hung with a large mural of Mao Tse-tung while ping-pong is played by Forrest against a Chinese player as a crowd of communist leaders sits and watches. Forrest is introduced by Dick Cavett, who stands up, and the stage is reached by Forrest who shakes hands with Cavett. Between John Lennon and Cavett, Forrest is seated and Lennon is looked at oddly by him, as a cigarette is lit by Lennon. Forrest is let out a side entrance door by a guard, and a stop is made by him as a man in a wheelchair is heard speaking to him. Lt. Dan, who is dirty with long hair, is looked at by Forrest as the ramp is slid down by Dan's wheelchair and it spins on the icy ground. Lt. Dan crashes at the bottom of the ramp and is watched by Forrest. The street is crowded by taxi cabs as Lt. Dan is pushed along the sidewalk by Forrest, with a honk given by one taxi driver as Lt. Dan is wheeled out in front of it. Another taxi almost hits them as it skids to a stop while they cross the street, and the bumper of the taxi is slapped by Lt. Dan. A Bob Hope Christmas special in Vietnam was played on television as it was watched by Lt. Dan and Forrest. The rest of a bottle of wine is drunk by Lt. Dan, who chuckles, and it is tossed down by him before Forrest is looked at. The television is turned off by him as he wheels himself over to it, another bottle of port wine that is empty is picked up, and it is tossed onto the floor. The bottle is thrown by Lt. Dan as he becomes enraged, and Forrest is looked at by him as a television showed Dick Clark emceeing the Times Square New Year's Eve celebration. Two sleazy women named Lenore and Carla walked up to Lt. Dan. Lenore fixes her makeup and leans to speak into Forrest's ear. Cheers, kisses, horns being blown, and confetti being tossed into the air are done by the people in the bar. The room is looked around by Forrest as Carla and Lenore lean over and kiss him. Her top is removed by Carla, and she sits on top of Dan in his wheelchair, and they kiss and play around. A chair is sat in by Forrest, then Lenore leaps on him and begins to kiss him, reaching down to his crotch. Nervously, Forrest stands up, and Lenore is caused to fall to the floor. Lenore stands up, angry, as Carla is thrown back onto the bed by Lt. Dan. Lt. Dan falls out of his wheelchair and lands on the floor, as Carla and Lenore laugh and leave the apartment. Lt. Dan is tried to be helped by Forrest."
        }
      ]
    },
    {
      "category": "Brevity and Verbosity",
      "test_cases": [
        {
          "id": "2.1",
          "name": "Brevity - L1",
          "description": "Footage of Neil Armstrong's first moon step is shown on TV, followed by Forrest looking at a man. A mural of Mao Tse-tung hangs on the wall as Forrest plays ping-pong against a Chinese player, watched by communist leaders. Dick Cavett introduces Forrest, who joins him on stage, sitting between Cavett and John Lennon, who lights a cigarette. A guard lets Forrest out a side door, where he hears a man in a wheelchair—Lt. Dan—speak to him. Lt. Dan, dirty with long hair, slides down a ramp and crashes. Taxi cabs crowd the street as Forrest pushes Lt. Dan on the sidewalk; a taxi honks as Lt. Dan is wheeled in front of it, and another skids to a stop, almost hitting them. Lt. Dan slaps the taxi bumper. A Bob Hope Christmas special in Vietnam plays on TV as Lt. Dan and Forrest watch. Lt. Dan chuckles, finishes a wine bottle, and tosses it, then wheels to the TV, turns it off, and throws an empty port wine bottle. Enraged, he looks at Forrest as Dick Clark emcees the Times Square New Year's Eve celebration on TV. Two women, Lenore and Carla, approach Lt. Dan. Lenore fixes her makeup and whispers to Forrest. The bar crowd cheers, kisses, blows horns, and tosses confetti. Forrest looks around as Carla and Lenore kiss him. Carla sits on Dan in his wheelchair, and they kiss. Forrest sits, then Lenore jumps on him, kissing and reaching down. Nervous, Forrest stands, causing Lenore to fall. Angry, Lenore stands as Lt. Dan throws Carla onto the bed. Lt. Dan falls from his wheelchair, and Carla and Lenore laugh and leave. Forrest tries to help Lt. Dan."
        },
        {
          "id": "2.2",
          "name": "Brevity - L2",
          "description": "Footage of Neil Armstrong's first moon step airs on TV, followed by Forrest looking at a man. A mural of Mao Tse-tung is on the wall as Forrest plays ping-pong against a Chinese player, watched by communist leaders. Dick Cavett introduces Forrest, who joins him on stage, sitting between Cavett and John Lennon, who lights a cigarette. A guard lets Forrest out a side door, where he hears a man in a wheelchair, Lt. Dan, whose wheelchair slides down a ramp and spins on icy ground, crashing at the bottom. Forrest pushes Lt. Dan along a crowded street, narrowly avoiding taxis. A Bob Hope Christmas special in Vietnam plays on TV as Lt. Dan drinks wine, tosses the bottle, and turns off the TV. He throws another bottle, and Dick Clark's New Year's Eve celebration appears on TV. Lenore and Carla approach Lt. Dan; Lenore speaks to Forrest, and the bar cheers as Carla and Lenore kiss him. Carla sits on Dan's lap, and they kiss. Lenore kisses Forrest, reaching for his crotch, but he stands, causing her to fall. Lenore gets angry, and Lt. Dan throws Carla onto the bed, falling from his wheelchair as Carla and Lenore laugh and leave. Forrest tries to help Lt. Dan."
        },
        {
          "id": "2.3",
          "name": "Verbosity - L1",
          "description": "A captivating footage of Neil Armstrong's historic first step on the moon is prominently displayed on television screens, immediately followed by a scene where Forrest is seen intently gazing at a man. In the background, a large and imposing mural of Mao Tse-tung is prominently displayed on the wall, setting the scene as Forrest energetically engages in a game of ping-pong against a skilled Chinese player. A crowd of communist leaders, seated with keen interest, watches the match unfold. The well-known television host, Dick Cavett, stands up to formally introduce Forrest, who confidently makes his way onto the stage, extending his hand to shake Cavett's in a friendly gesture. Forrest then takes a seat between the iconic John Lennon and Cavett, casting an odd glance at Lennon, who nonchalantly lights a cigarette. \n\nA guard then opens a side entrance door, allowing Forrest to exit, and as he steps out, he pauses abruptly upon hearing a voice from a man in a wheelchair speaking to him. Forrest turns to see Lt. Dan, who appears disheveled with long, unkempt hair, as Dan's wheelchair begins to slide precariously down the ramp, spinning uncontrollably on the icy ground. Forrest watches with concern as Lt. Dan crashes at the bottom of the ramp. The bustling street is crowded with taxi cabs as Forrest diligently pushes Lt. Dan along the sidewalk. One impatient taxi driver honks loudly as Lt. Dan is wheeled out in front of it. Another taxi skids to a sudden stop, narrowly avoiding a collision as they cross the street, prompting Lt. Dan to slap the bumper of the taxi in frustration.\n\nMeanwhile, a Bob Hope Christmas special set in Vietnam plays on the television as Lt. Dan and Forrest watch together. Lt. Dan chuckles softly, finishes the remaining wine in a bottle, and casually tosses it aside before glancing at Forrest. He wheels himself over to the television, turns it off, and picks up another bottle of port wine, which is empty, and throws it onto the floor in frustration. Overcome with anger, Lt. Dan hurls the bottle and looks at Forrest as the television shows Dick Clark hosting the Times Square New Year's Eve celebration. Two women, Lenore and Carla, approach Lt. Dan with a sleazy demeanor. Lenore adjusts her makeup and leans in to whisper into Forrest's ear. The bar erupts with cheers as people kiss, blow horns, and toss confetti into the air. Forrest looks around in surprise as Carla and Lenore lean over and kiss him. Carla removes her top and sits provocatively on top of Dan in his wheelchair, and they engage in playful kissing. \n\nForrest, seated in a chair, is suddenly leapt upon by Lenore, who begins to kiss him passionately, reaching down towards his crotch. Startled and nervous, Forrest stands up abruptly, causing Lenore to tumble to the floor. Lenore stands up, visibly angry, as Lt. Dan throws Carla back onto the bed. In the ensuing chaos, Lt. Dan falls out of his wheelchair and lands on the floor, while Carla and Lenore laugh and make their exit from the apartment. Forrest, ever the friend, attempts to assist Lt. Dan."
        },
        {
          "id": "2.4",
          "name": "Verbosity - L2",
          "description": "The captivating and historically significant footage of Neil Armstrong's monumental first step on the moon is prominently displayed across television screens everywhere. Directly following this iconic scene, Forrest Gump is observed with intense focus, gazing intently at a man. In the backdrop of this scenario, a large, imposing mural of Mao Tse-tung is clearly and prominently displayed on the wall, effectively setting the scene as Forrest energetically and enthusiastically engages in a spirited game of ping-pong against a highly skilled Chinese player. Nearby, an attentive crowd of communist leaders, seated with deep interest, watches the unfolding match with great anticipation. The famous and well-known television host, Dick Cavett, stands up and formally introduces Forrest with a flourish. With confidence and friendliness, Forrest makes his way onto the stage, extending his hand in a warm gesture to shake Cavett’s, which he does with enthusiasm. Subsequently, Forrest takes a seat positioned between the iconic John Lennon and Cavett, casting an odd and curious glance over at Lennon, who casually and nonchalantly lights up a cigarette.\n\nA guard then proceeds to open a side entrance door in the venue, permitting Forrest to make his exit. As he steps out, he pauses abruptly, suddenly halting in his tracks, upon hearing a voice emanating from a man in a wheelchair speaking directly to him. Forrest turns around to come face to face with Lt. Dan, who appears quite disheveled, with long, unkempt hair. As this occurs, Dan's wheelchair begins to slide precariously down the ramp, spinning uncontrolled on the icy, slippery ground. Forrest watches with mounting concern as Lt. Dan crashes at the bottom of the ramp. The bustling street outside is crowded with numerous taxi cabs, and Forrest diligently pushes Lt. Dan along the busy sidewalk. An impatient taxi driver honks loudly as Lt. Dan is wheeled out in front of his cab. Another taxi skids abruptly to a sudden stop, narrowly avoiding a collision as they make their way across the street, prompting Lt. Dan to slap the bumper of the taxi in sheer frustration.\n\nMeanwhile, a Bob Hope Christmas special, which is set in Vietnam, plays on the television as Lt. Dan and Forrest sit together watching. Lt. Dan chuckles softly and finishes the remaining wine in his bottle before casually tossing it aside with little regard. He then glances over at Forrest, wheels himself over to the television, turns it off, and subsequently picks up another bottle of port wine, which is unfortunately empty. In frustration, he throws it onto the floor. Overcome with anger, Lt. Dan hurls the bottle forcefully and looks at Forrest just as the television displays Dick Clark hosting the New Year's Eve celebration in Times Square. Two women, Lenore and Carla, approach Lt. Dan with a sleazy demeanor. Lenore, adjusting her makeup, leans in to whisper slyly into Forrest's ear. The bar erupts with cheers as people engage in celebratory kissing, blow party horns, and toss colorful confetti into the air. Forrest looks around, surprised, as Carla and Lenore lean over to kiss him. Carla brazenly removes her top and positions herself provocatively on top of Dan in his wheelchair, and they engage in playful kissing.\n\nForrest, who is seated in a chair, is suddenly leapt upon by Lenore, who begins to kiss him passionately, reaching down towards his crotch. Startled and visibly nervous, Forrest stands up abruptly, causing Lenore to tumble down to the floor. Lenore stands up, visibly angry, while Lt. Dan throws Carla back onto the bed. In the ensuing chaos, Lt. Dan falls out of his wheelchair and lands on the floor, while Carla and Lenore laugh and proceed to make their exit from the apartment. Ever the loyal friend, Forrest attempts to assist Lt. Dan, showing his unwavering support."
        },
        {
          "id": "2.5",
          "name": "Macro-Actions -> Micro-Actions",
          "description": "The footage of Neil Armstrong's first step on the moon flickers on the television screen, capturing the historic moment as Forrest turns his gaze to a man nearby. In the room, a large mural of Mao Tse-tung dominates the wall, setting the scene as Forrest engages in a game of ping-pong against a Chinese player, with a crowd of communist leaders seated and observing the match intently. As the game unfolds, Dick Cavett rises from his seat to introduce Forrest, who then makes his way onto the stage, extending his hand to shake Cavett's in a gesture of greeting. Forrest takes a seat between John Lennon and Cavett, casting an odd glance at Lennon, who nonchalantly lights a cigarette. A guard then opens a side entrance door, allowing Forrest to step outside, where he pauses abruptly upon hearing a voice from a man in a wheelchair. Turning his attention, Forrest sees Lt. Dan, disheveled with long hair, as Dan's wheelchair begins to slide uncontrollably down the ramp, spinning on the icy ground. Forrest watches with concern as Lt. Dan crashes at the bottom of the ramp. The street is crowded with taxi cabs as Forrest pushes Lt. Dan along the sidewalk, navigating through the bustling traffic. A taxi driver honks loudly as Lt. Dan is wheeled out in front of it, and another taxi skids to a halt, narrowly avoiding them as they cross the street, prompting Lt. Dan to slap the taxi's bumper in frustration. Meanwhile, a Bob Hope Christmas special in Vietnam plays on the television, capturing the attention of Lt. Dan and Forrest. Lt. Dan chuckles, finishes the remaining wine in his bottle, and carelessly tosses it aside before glancing at Forrest. He wheels himself over to the television, switches it off, and picks up another bottle of port wine, finding it empty, and throws it onto the floor in frustration. Overcome with anger, Lt. Dan hurls the bottle and looks at Forrest as the television now shows Dick Clark hosting the Times Square New Year's Eve celebration. Two women, Lenore and Carla, approach Lt. Dan with a sleazy demeanor. Lenore adjusts her makeup and leans in to whisper into Forrest's ear. The bar erupts with cheers, kisses, horns blowing, and confetti flying through the air. Forrest looks around, taking in the festive chaos as Carla and Lenore lean over to kiss him. Carla provocatively removes her top and climbs onto Dan in his wheelchair, engaging in playful kisses. Forrest, seated in a chair, is suddenly leapt upon by Lenore, who begins to kiss him and reaches down towards his crotch. Startled and nervous, Forrest stands up abruptly, causing Lenore to tumble to the floor. Lenore rises, visibly angry, as Lt. Dan throws Carla back onto the bed. In the ensuing commotion, Lt. Dan falls out of his wheelchair, landing on the floor as Carla and Lenore laugh and make their exit from the apartment. Forrest, witnessing the scene, attempts to assist Lt. Dan."
        },
        {
          "id": "2.6",
          "name": "Micro-Actions -> Macro-Actions",
          "description": "The footage of Neil Armstrong's first step on the moon plays on television, capturing Forrest's attention before he turns to look at a man. In a room adorned with a large mural of Mao Tse-tung, Forrest plays ping-pong against a Chinese player as communist leaders watch. Dick Cavett introduces Forrest, who joins him on stage, shaking hands before sitting between Cavett and John Lennon, who lights a cigarette. Exiting through a side door, Forrest stops when he hears a man in a wheelchair, Lt. Dan, whose wheelchair slides down a ramp and spins on the icy ground, crashing at the bottom. Forrest then navigates a crowded street, pushing Lt. Dan along the sidewalk amidst honking taxis, narrowly avoiding one that skids to a stop, prompting Lt. Dan to slap its bumper. Later, they watch a Bob Hope Christmas special in Vietnam on TV. Lt. Dan, after finishing a bottle of wine, turns off the TV, throws the empty bottle, and becomes enraged as a New Year's Eve celebration with Dick Clark plays on television. Two women, Lenore and Carla, approach Lt. Dan, with Lenore whispering to Forrest. As the bar erupts in New Year's cheer, Carla and Lenore kiss Forrest, with Carla removing her top and sitting on Lt. Dan's lap. Lenore jumps on Forrest, kissing him and reaching down, causing him to stand up nervously, making her fall. Angrily, Lenore stands as Lt. Dan throws Carla onto the bed, then falls from his wheelchair. Carla and Lenore laugh and leave, while Forrest attempts to help Lt. Dan."
        }
      ]
    },
    {
      "category": "Content Additions & Omissions",
      "test_cases": [
        {
          "id": "3.1",
          "name": "Insert Attributes, Emotions and Scene",
          "description": "A footage of Neil Armstrong's first step on the moon, a historic moment from the 1969 Apollo 11 mission, is shown on television, followed by Forrest looking at a man. A large mural of Mao Tse-tung, the founding father of the People's Republic of China, hangs on the wall while Forrest plays ping-pong against a Chinese player, an activity that became famous due to the U.S.-China ping-pong diplomacy of the 1970s, as a crowd of communist leaders sit and watch. Dick Cavett, a renowned talk show host from the era, stands up to introduce Forrest, who makes his way onto the stage and shakes hands with Cavett. Forrest sits down between John Lennon, a member of the legendary band The Beatles, and Cavett, and looks oddly at Lennon, who lights a cigarette. A guard lets Forrest out a side entrance door, and Forrest steps and then stops as he hears a man in a wheelchair speak to him. Forrest looks at Lt. Dan, who is dirty with long hair, as Dan's wheelchair begins to slide down the ramp and spins on the icy ground, dangerous conditions common in winter. Forrest watches as Lt. Dan crashes at the bottom of the ramp. Taxi cabs crowd the street of New York City as Forrest pushes Lt. Dan along the sidewalk, with one taxi driver honking as Lt. Dan gets wheeled out in front of it. Another taxi skids to a stop, almost hitting them as they cross the street, and Lt. Dan slaps the bumper of the taxi. A Bob Hope Christmas special in Vietnam plays on television, a popular entertainment for troops during the war, as Lt. Dan and Forrest watch. Lt. Dan chuckles, drinks the rest of a bottle of wine, and tosses it down before looking at Forrest. He wheels himself over to the television and turns it off, picks up another bottle of port wine which is empty, and tosses it onto the floor. Lt. Dan becomes enraged, throws the bottle, and looks at Forrest as a television shows Dick Clark emceeing the Times Square New Year's Eve celebration, an annual event watched by millions. Two sleazy women named Lenore and Carla walk up to Lt. Dan. Lenore fixes her makeup and leans to speak into Forrest's ear. The people in the bar cheer, kiss, blow horns, and toss confetti into the air. Forrest looks around as Carla and Lenore lean over and kiss him. Carla removes her top and sits on top of Dan in his wheelchair, and they kiss and play around. Forrest sits in a chair, then Lenore leaps on him and begins to kiss him, reaching down to his crotch. Forrest stands up nervously, causing Lenore to fall to the floor. Lenore stands up, angry, as Lt. Dan throws Carla back onto the bed. Lt. Dan falls out of his wheelchair and lands on the floor as Carla and Lenore laugh and leave the apartment. Forrest tries to help Lt. Dan."
        },
        {
          "id": "3.2",
          "name": "Scattered Segments Repetition (~50%)",
          "description": "A footage of Neil Armstrong's first step on the moon is shown on television followed by Forrest looking at a man  A large mural of Mao Tsetung hangs on the wall while Forrest plays pingpong against a Chinese player  as a crowd of communist leaders sit and watch  A Bob Hope Christmas special in Vietnam plays on television as Lt Dan and Forrest watch  Lt Dan chuckles drinks the rest of a bottle of wine and tosses it down before looking at Forrest  He wheels himself over to the television and turns it off  picks up another bottle of port wine which is empty and tosses it onto the floor  Lt Dan becomes enraged throws the bottle and looks at Forrest  as a television shows Dick Clark emceeing the Times Square  New Year's Eve celebration  Two sleazy women named Lenore and Carla walk up to Lt Dan  Lenore fixes her makeup and leans to speak into Forrest's ear  The people in the bar cheer kiss blow horns and toss confetti into the air  Forrest looks around as Carla and Lenore lean over and kiss him  Carla removes her top and sits on top of Dan in his wheelchair and they kiss and play around  Forrest sits in a chair  then Lenore leaps on him and begins to kiss him reaching down to his crotch  Dick Cavett stands up to introduce Forrest who makes his way onto the stage and shakes hands with Cavett  Forrest sits down between John Lennon and Cavett and looks oddly at Lennon who lights a cigarette  A guard lets Forrest out a side entrance door and Forrest steps and then stops as he hears a man in a wheelchair speak to him  Forrest looks at Lt Dan who is dirty with long hair as Dan's wheelchair begins to slide down the ramp and spins on the icy ground  Forrest watches as Lt Dan crashes at the bottom of the ramp  Taxi cabs crowd the street as Forrest pushes Lt Dan along the sidewalk with one taxi driver honking as Lt Dan gets wheeled out in front of it  Another taxi skids to a stop almost hitting them as they cross the street and Lt Dan slaps the bumper of the taxi  A Bob Hope Christmas special in Vietnam plays on television as Lt Dan and Forrest watch  Lt Dan chuckles drinks the rest of a bottle of wine and tosses it down before looking at Forrest  He wheels himself over to the television and turns it off  picks up another bottle of port wine which is empty and tosses it onto the floor  Lt Dan becomes enraged throws the bottle and looks at Forrest  as a television shows Dick Clark emceeing the Times Square  New Year's Eve celebration  Two sleazy women named Lenore and Carla walk up to Lt Dan  Lenore fixes her makeup and leans to speak into Forrest's ear  The people in the bar cheer kiss blow horns and toss confetti into the air  Forrest looks around as Carla and Lenore lean over and kiss him  Carla removes her top and sits on top of Dan in his wheelchair and they kiss and play around  Forrest sits in a chair  then Lenore leaps on him and begins to kiss him reaching down to his crotch  Forrest stands up nervously causing Lenore to fall to the floor  Lenore stands up angry as Lt Dan throws Carla back onto the bed  Lt Dan falls out of his wheelchair and lands on the floor as Carla and Lenore laugh and leave the apartment  Forrest tries to help Lt Dan"
        },
        {
          "id": "3.3",
          "name": "Addition (~50%)",
          "description": "A footage of Neil Armstrong's first step on the moon is shown on television followed by Forrest looking at a man. A large mural of Mao Tsetung hangs on the wall while Forrest plays pingpong against a Chinese player. as a crowd of communist leaders sit and watch. Dick Cavett stands up to introduce Forrest who makes his way onto the stage and shakes hands with Cavett. Forrest sits down between John Lennon and Cavett and looks oddly at Lennon who lights a cigarette. A guard let us Forrest out a side entrance door and Forrest steps and then stops as he hears a man in a wheelchair speak to him. Forrest looks at Lt Dan who is dirty with long hair as Dan's wheelchair begins to slide down the ramp and spins on the icy ground. Forrest watches as Lt Dan crashes at the bottom of the ramp. Taxi cabs crowd the street as Forrest pushes Lt Dan along the sidewalk with one taxi driver honking as Lt Dan gets wheeled out in front of it. Another taxi skids to a stop almost hitting them as they cross the street and Lt Dan slaps the bumper of the taxi. A Bob Hope Christmas special in Vietnam plays on television as Lt Dan and Forrest watch. Lt Dan chuckles drinks the rest of a bottle of wine and tosses it down before looking at Forrest. He wheels himself over to the television and turns it off. picks up another bottle of port wine which is empty and tosses it onto the floor. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Lt Dan becomes enraged throws the bottle and looks at Forrest. as a television shows Dick Clark emceeing the Times Square. New Year's Eve celebration. Two sleazy women named Lenore and Carla walk up to Lt Dan. Lenore fixes her makeup and leans to speak into Forrest's ear. The people in the bar cheer kiss blow horns and toss confetti into the air. Forrest looks around as Carla and Lenore lean over and kiss him. Carla removes her top and sits on top of Dan in his wheelchair and they kiss and play around. Forrest sits in a chair. then Lenore leaps on him and begins to kiss him reaching down to his crotch. Forrest stands up nervously causing Lenore to fall to the floor. Lenore stands up angry as Lt Dan throws Carla back onto the bed. Lt Dan falls out of his wheelchair and lands on the floor as Carla and Lenore laugh and leave the apartment. Forrest tries to help Lt Dan."
        },
        {
          "id": "3.4",
          "name": "Addition (~80%)",
          "description": "A footage of Neil Armstrong's first step on the moon is shown on television followed by Forrest looking at a man. A large mural of Mao Tsetung hangs on the wall while Forrest plays pingpong against a Chinese player. as a crowd of communist leaders sit and watch. Dick Cavett stands up to introduce Forrest who makes his way onto the stage and shakes hands with Cavett. Forrest sits down between John Lennon and Cavett and looks oddly at Lennon who lights a cigarette. A guard let us Forrest out a side entrance door and Forrest steps and then stops as he hears a man in a wheelchair speak to him. Forrest looks at Lt Dan who is dirty with long hair as Dan's wheelchair begins to slide down the ramp and spins on the icy ground. Forrest watches as Lt Dan crashes at the bottom of the ramp. Taxi cabs crowd the street as Forrest pushes Lt Dan along the sidewalk with one taxi driver honking as Lt Dan gets wheeled out in front of it. Another taxi skids to a stop almost hitting them as they cross the street and Lt Dan slaps the bumper of the taxi. A Bob Hope Christmas special in Vietnam plays on television as Lt Dan and Forrest watch. Lt Dan chuckles drinks the rest of a bottle of wine and tosses it down before looking at Forrest. He wheels himself over to the television and turns it off. picks up another bottle of port wine which is empty and tosses it onto the floor. In the neonlit back alleys of a dystopian metropolis a rogue hacker races against time while being chased by relentless cyborg enforcers their footsteps echoing off rainsoaked pavement. Under the relentless desert sun a lone gunslinger confronts a notorious outlaw at a deserted crossroads both men exchanging steely glances as swirling dust blurs the horizon. On a foggy evening in Victorian London an intrepid detective uncovers a hidden conspiracy among the city’s elite with gaslit streets setting the stage for a race against a mounting darkness. High above a sprawling city skyline a daredevil pilot executes deathdefying maneuvers in a vintage biplane narrowly evading enemy fire as the ground morphs into a dizzying mosaic below. Within the creaking walls of an old countryside manor an estranged family gathers for a mysterious inheritance their hushed whispers and secret glances weaving a tapestry of betrayal and suspense. Amidst the roaring tempest of a stormy ocean a weathered sailor battles nature’s fury on a creaking vessel his resolve as steadfast as the crashing waves that threaten to engulf him. On a bustling 1960s New York street a passionate artist finds unexpected inspiration in the chaotic interplay of urban life capturing moments of love loss and defiant hope on a rainsoaked canvas. Deep in the heart of an enchanted forest a brave knight embarks on a perilous quest to rescue a captive princess facing mythical creatures and treacherous traps with unwavering courage. During a heated political rally in a futuristic city a charismatic leader stokes both hope and dissent. as holographic banners illuminate the night sky and fervent crowds surge with anticipation. In the eerie silence of a postapocalyptic wasteland a hardened survivor scavenges through abandoned ruins haunted by the echoes of a oncethriving civilization now reduced to dust. Beneath the shimmering surface of an underwater kingdom a rebellious mermaid defies ancient traditions to explore forbidden coral reefs and secret caverns brimming with forgotten lore. In the quiet confines of a suburban attic an unassuming teenager stumbles upon a mysterious portal that thrusts him into a surreal world where the very fabric of time and space unravels. On the rugged highlands of Scotland a stoic warrior faces rival clans and ancient curses alike his fierce battle cry resonating across mistcovered moors and turbulent skies. Amid the vibrant chaos of a South American carnival a fearless dancer twirls through streets bursting with color and rhythm each graceful move challenging the rigid boundaries of tradition. During a clandestine meeting in a snowcovered mountain lodge two rival spies exchange cryptic messages hinting at an imminent global conspiracy. their whispered words carried off by the howling wind. Inside a lavish 1920s speakeasy a troubled jazz musician pours his soul into a melancholic melody every note echoing the bittersweet memories of lost love and shattered dreams. In a futuristic space station orbiting a distant planet an intrepid crew confronts bizarre alien phenomena and an enigmatic interstellar threat pushing the limits of human endurance. Amidst the chaos of a raging civil war a compassionate medic races through bombedout streets. his every desperate step a race against time to save lives in the midst of utter devastation. On a sundappled afternoon in a quaint European village an eccentric inventor unveils a groundbreaking contraption that defies conventional physics igniting wonder and skepticism in equal measure. Lt Dan becomes enraged throws the bottle and looks at Forrest. as a television shows Dick Clark emceeing the Times Square. New Year's Eve celebration. Two sleazy women named Lenore and Carla walk up to Lt Dan. Lenore fixes her makeup and leans to speak into Forrest's ear. The people in the bar cheer kiss blow horns and toss confetti into the air. Forrest looks around as Carla and Lenore lean over and kiss him. Carla removes her top and sits on top of Dan in his wheelchair and they kiss and play around. Forrest sits in a chair. then Lenore leaps on him and begins to kiss him reaching down to his crotch. Forrest stands up nervously causing Lenore to fall to the floor. Lenore stands up angry as Lt Dan throws Carla back onto the bed. Lt Dan falls out of his wheelchair and lands on the floor as Carla and Lenore laugh and leave the apartment. Forrest tries to help Lt Dan."
        },
        {
          "id": "3.5",
          "name": "Deletion (~50%)",
          "description": "A footage of Neil Armstrong's first step on the moon is shown on television followed by Forrest looking at a man. A large mural of Mao Tsetung hangs on the wall while Forrest plays pingpong against a Chinese player. as a crowd of communist leaders sit and watch. Dick Cavett stands up to introduce Forrest who makes his way onto the stage and shakes hands with Cavett. Forrest sits down between John Lennon and Cavett and looks oddly at Lennon who lights a cigarette. A guard let us Forrest out a side entrance door and Forrest steps and then stops as he hears a man in a wheelchair speak to him. Forrest looks at Lt Dan who is dirty with long hair as Dan's wheelchair begins to slide down the ramp and spins on the icy ground. Carla removes her top and sits on top of Dan in his wheelchair and they kiss and play around. Forrest sits in a chair. then Lenore leaps on him and begins to kiss him reaching down to his crotch. Forrest stands up nervously causing Lenore to fall to the floor. Lenore stands up angry as Lt Dan throws Carla back onto the bed. Lt Dan falls out of his wheelchair and lands on the floor as Carla and Lenore laugh and leave the apartment. Forrest tries to help Lt Dan."
        },
        {
          "id": "3.6",
          "name": "Deletion (~80%)",
          "description": "A footage of Neil Armstrong's first step on the moon is shown on television followed by Forrest looking at a man. A large mural of Mao Tsetung hangs on the wall while Forrest plays pingpong against a Chinese player. as a crowd of communist leaders sit and watch. Lenore stands up angry as Lt Dan throws Carla back onto the bed. Lt Dan falls out of his wheelchair and lands on the floor as Carla and Lenore laugh and leave the apartment. Forrest tries to help Lt Dan."
        }
      ]
    },
    {
      "category": "Content Corruption",
      "test_cases": [
        {
          "id": "4.1",
          "name": "Subject Corruption",
          "description": "A footage of Buzz Aldrin's first step on the moon is shown on television, followed by a dog looking at a woman. A large mural of Abraham Lincoln hangs on the wall while a cat plays ping-pong against a Chinese player as a crowd of teachers sit and watch. A librarian stands up to introduce a bird, who makes its way onto the stage and shakes hands with the librarian. The bird sits down between a musician and the librarian and looks oddly at the musician, who lights a cigarette. A student lets the bird out a side entrance door, and the bird steps and then stops as it hears a woman in a wheelchair speak to it. The bird looks at a chef, who is dirty with long hair, as the chef's wheelchair begins to slide down the ramp and spins on the icy ground. The bird watches as the chef crashes at the bottom of the ramp. Taxi cabs crowd the street as the bird pushes the chef along the sidewalk, with one taxi driver honking as the chef gets wheeled out in front of it. Another taxi skids to a stop, almost hitting them as they cross the street, and the chef slaps the bumper of the taxi. A Bob Hope Christmas special in Vietnam plays on television as the chef and the bird watch. The chef chuckles, drinks the rest of a bottle of wine, and tosses it down before looking at the bird. The chef wheels herself over to the television and turns it off, picks up another bottle of port wine which is empty, and tosses it onto the floor. The chef becomes enraged, throws the bottle, and looks at the bird as a television shows a comedian emceeing the Times Square New Year's Eve celebration. Two sleazy robots named Lenore and Carla walk up to the chef. Lenore fixes her makeup and leans to speak into the bird's ear. The people in the bar cheer, kiss, blow horns, and toss confetti into the air. The bird looks around as Carla and Lenore lean over and kiss it. Carla removes her top and sits on top of the chef in her wheelchair, and they kiss and play around. The bird sits in a chair, then Lenore leaps on it and begins to kiss it, reaching down to its crotch. The bird stands up nervously, causing Lenore to fall to the floor. Lenore stands up, angry, as the chef throws Carla back onto the bed. The chef falls out of her wheelchair and lands on the floor as Carla and Lenore laugh and leave the apartment. The bird tries to help the chef."
        },
        {
          "id": "4.2",
          "name": "Object Corruption",
          "description": "A footage of Neil Armstrong's first step on Mars is shown on a computer screen, followed by Forrest looking at a woman. A large painting of Albert Einstein hangs on the ceiling while Forrest plays croquet against a Japanese player as a crowd of socialist artists sit and watch. Dick Cavett stands up to introduce Forrest, who makes his way onto the platform and shakes hands with Cavett. Forrest sits down between Bob Dylan and Cavett and looks oddly at Dylan, who lights a candle. A janitor lets Forrest out a side entrance gate, and Forrest steps and then stops as he hears a woman in a stroller speak to him. Forrest looks at Lt. Dan, who is muddy with short hair, as Dan's stroller begins to slide down the hill and spins on the sandy ground. Forrest watches as Lt. Dan crashes at the bottom of the hill. Bicycles crowd the path as Forrest pushes Lt. Dan along the boardwalk, with one cyclist honking as Lt. Dan gets wheeled out in front of it. Another bicycle skids to a stop, almost hitting them as they cross the path, and Lt. Dan slaps the pedal of the bicycle. A Bob Hope Easter special in Cambodia plays on a computer screen as Lt. Dan and Forrest watch. Lt. Dan chuckles, drinks the rest of a bottle of soda, and tosses it down before looking at Forrest. He wheels himself over to the computer screen and turns it off, picks up another bottle of root beer which is empty, and tosses it onto the floor. Lt. Dan becomes enraged, throws the can, and looks at Forrest as a computer screen shows Ryan Seacrest hosting the Times Square Valentine’s Day celebration. Two sleazy men named Lenore and Carla walk up to Lt. Dan. Lenore checks his watch and leans to speak into Forrest's ear. The people in the cafe cheer, kiss, blow whistles, and toss streamers into the air. Forrest looks around as Carla and Lenore lean over and kiss him. Carla removes her jacket and sits on top of Dan in his stroller, and they kiss and joke around. Forrest sits in a recliner, then Lenore leaps on him and begins to kiss him, reaching down to his shoe. Forrest stands up nervously, causing Lenore to fall to the carpet. Lenore stands up, angry, as Lt. Dan throws Carla back onto the couch. Lt. Dan falls out of his stroller and lands on the carpet as Carla and Lenore laugh and leave the hotel room. Forrest tries to help Lt. Dan."
        },
        {
          "id": "4.3",
          "name": "Action Corruption",
          "description": "A footage of Neil Armstrong's first step on the moon is broadcasted on television, followed by Forrest glancing at a man. A large mural of Mao Tse-tung is displayed on the wall while Forrest sketches ping-pong against a Chinese player as a crowd of communist leaders stand and listen. Dick Cavett jumps up to announce Forrest, who strolls onto the stage and nods to Cavett. Forrest reclines between John Lennon and Cavett and blinks oddly at Lennon, who picks up a cigarette. A guard escorts Forrest through a side entrance door, and Forrest pauses and then dances as he hears a man in a wheelchair call to him. Forrest peers at Lt. Dan, who is messy with long hair, as Dan's wheelchair starts to glide down the ramp and twirls on the icy ground. Forrest listens as Lt. Dan arrives at the bottom of the ramp. Taxi cabs occupy the street as Forrest pulls Lt. Dan along the sidewalk, with one taxi driver shouting as Lt. Dan gets rolled out in front of it. Another taxi slides to a stop, nearly touching them as they move across the street, and Lt. Dan taps the bumper of the taxi. A Bob Hope Christmas special in Vietnam airs on television as Lt. Dan and Forrest listen. Lt. Dan giggles, finishes the rest of a bottle of wine, and drops it down before glancing at Forrest. He maneuvers himself over to the television and switches it off, lifts another bottle of port wine which is empty, and hurls it onto the floor. Lt. Dan becomes furious, smashes the bottle, and glances at Forrest as a television displays Dick Clark leading the Times Square New Year's Eve celebration. Two sleazy women named Lenore and Carla approach Lt. Dan. Lenore adjusts her makeup and leans to whisper into Forrest's ear. The people in the bar applaud, embrace, blow horns, and fling confetti into the air. Forrest scans the room as Carla and Lenore lean over and peck him. Carla removes her top and climbs on top of Dan in his wheelchair, and they embrace and jest around. Forrest settles in a chair, then Lenore bounces on him and starts to peck him, reaching down to his knee. Forrest jolts up nervously, causing Lenore to tumble to the floor. Lenore rises up, annoyed, as Lt. Dan pushes Carla back onto the bed. Lt. Dan rolls out of his wheelchair and lands on the floor as Carla and Lenore snicker and exit the apartment. Forrest attempts to support Lt. Dan."
        },
        {
          "id": "4.4",
          "name": "Subject-Object Corruption",
          "description": "A footage of a dolphin's first leap on the trampoline is shown on a computer, followed by a giraffe looking at a toaster. A large sculpture of Cleopatra hangs on the ceiling while the giraffe plays soccer against a Brazilian musician as a group of jazz singers sit and watch. A cactus stands up to introduce the giraffe, who makes its way onto the podium and shakes hands with the cactus. The giraffe sits down between Marie Curie and the cactus and looks oddly at Curie, who lights a campfire. A knight lets the giraffe out a side window, and the giraffe steps and then stops as it hears a penguin in a stroller speak to it. The giraffe looks at Captain Hook, who is muddy with a long beard, as Hook’s stroller begins to slide down the hill and spins on the frosty pathway. The giraffe watches as Captain Hook crashes at the bottom of the hill. Skateboards crowd the bridge as the giraffe pushes Captain Hook along the boardwalk, with one cyclist ringing as Captain Hook gets wheeled out in front of it. Another skateboard skids to a stop, almost hitting them as they cross the bridge, and Captain Hook slaps the wheel of the skateboard. A Shakespearean play in France plays on a tablet as Captain Hook and the giraffe watch. Captain Hook chuckles, drinks the rest of a cup of tea, and tosses it down before looking at the giraffe. He wheels himself over to the tablet and turns it off, picks up another cup of apple juice which is empty, and tosses it onto the rug. Captain Hook becomes enraged, throws the cup, and looks at the giraffe as a tablet shows Jane Austen emceeing the Sydney Opera House concert. Two carnival clowns named Daphne and Ophelia walk up to Captain Hook. Daphne fixes her shoe and leans to speak into the giraffe's ear. The people in the café cheer, hug, blow trumpets, and toss glitter into the air. The giraffe looks around as Ophelia and Daphne lean over and kiss it. Ophelia takes off her hat and sits on top of Hook in his stroller, and they kiss and play around. The giraffe sits on a bench, then Daphne leaps on it and begins to kiss it, reaching down to its knee. The giraffe stands up nervously, causing Daphne to fall to the floor. Daphne stands up, angry, as Captain Hook throws Ophelia back onto the couch. Captain Hook falls out of his stroller and lands on the carpet as Ophelia and Daphne laugh and leave the mansion. The giraffe tries to help Captain Hook."
        },
        {
          "id": "4.5",
          "name": "Subject-Action Corruption",
          "description": "A footage of a spaceship's first orbit around Mars is shown on television, followed by Charlie gazing at a woman. A large mural of Julius Caesar hangs on the wall while Charlie juggles oranges against a magician as a crowd of opera singers sit and observe. Oprah Winfrey stands up to introduce Charlie, who dances his way onto the stage and bows to Winfrey. Charlie sits down between Ringo Starr and Winfrey and gazes quizzically at Starr, who blows bubbles. A butler escorts Charlie out a side entrance door, and Charlie stumbles and then halts as he hears a child in a stroller sing to him. Charlie glances at Capt. Morgan, who is disheveled with curly hair, as Morgan's stroller begins to roll down the hill and spins on the grassy path. Charlie observes as Capt. Morgan collides at the bottom of the hill. Delivery trucks fill the alley as Charlie carries Capt. Morgan across the pavement, with one delivery driver honking as Capt. Morgan gets pushed out in front of it. Another delivery truck screeches to a halt, nearly grazing them as they navigate the crosswalk, and Capt. Morgan taps the mirror of the truck. A Dean Martin holiday special in Paris plays on television as Capt. Morgan and Charlie watch. Capt. Morgan giggles, finishes a glass of lemonade, and sets it down before eyeing Charlie. He rolls himself over to the television and mutes it, grabs another glass of iced tea which is empty, and places it onto the counter. Capt. Morgan becomes irate, smashes the glass, and glares at Charlie as a television shows Ryan Seacrest presenting the Hollywood Oscars ceremony. Two glamorous women named Dorothy and Sylvia walk up to Capt. Morgan. Dorothy adjusts her scarf and leans to whisper into Charlie's ear. The patrons in the lounge applaud, embrace, toot whistles, and scatter streamers into the air. Charlie glances around as Sylvia and Dorothy lean over and embrace him. Sylvia removes her hat and perches on top of Morgan in his stroller, and they embrace and joke around. Charlie reclines in a chair, then Dorothy pounces on him and begins to hug him, reaching down to his knee. Charlie jumps up awkwardly, causing Dorothy to tumble to the floor. Dorothy rises, frustrated, as Capt. Morgan flings Sylvia back onto the sofa. Capt. Morgan topples out of his stroller and settles on the carpet as Sylvia and Dorothy chuckle and exit the apartment. Charlie attempts to assist Capt. Morgan."
        },
        {
          "id": "4.6",
          "name": "Object-Action Corruption",
          "description": "A picture of Neil Armstrong's first leap on the Mars is displayed on a billboard, followed by Forrest waving at a woman. A small sculpture of Mao Tse-tung stands on the ground while Forrest knits a sweater against a French artist as a group of capitalist entrepreneurs stand and whisper. Dick Cavett jumps up to present Forrest, who dances his way onto the podium and waves at Cavett. Forrest lies down between John Lennon and Cavett and listens quietly to Lennon, who ties his shoelace. A cat allows Forrest out a rear entrance gate, and Forrest jumps and then freezes as he notices a child in a tricycle shout to him. Forrest smiles at Lt. Dan, who is clean with short hair, as Dan's tricycle starts to roll up the slope and wobbles on the sandy path. Forrest giggles as Lt. Dan tumbles at the top of the slope. Motorbikes fill the alley as Forrest pulls Lt. Dan beside the road, with one motorcyclist yelling as Lt. Dan gets pushed out in front of it. Another scooter skids to a halt, narrowly dodging them as they pass the alley, and Lt. Dan taps the helmet of the scooter-rider. A Bob Hope cooking show in Australia runs on a projector as Lt. Dan and Forrest giggle. Lt. Dan snorts, sips the last of a glass of juice, and drops it down before glancing at Forrest. He rolls himself away from the television and switches it on, grabs another bottle of soda which is full, and tosses it onto the table. Lt. Dan becomes amused, spins the bottle, and glances at Forrest as a monitor displays Dick Clark hosting the Times Square Halloween Party. Two elegant women named Lenore and Carla stroll up to Lt. Dan. Lenore checks her watch and leans to whisper into Forrest's ear. The crowd in the hall shout, hug, blow bubbles, and throw feathers into the air. Forrest glances around as Carla and Lenore lean over and hug him. Carla removes her scarf and sits on top of Dan in his tricycle, and they laugh and sing along. Forrest stands beside a table, then Lenore dances around him and starts to hug him, reaching up to his shoulder. Forrest hops up awkwardly, causing Lenore to stumble to the ground. Lenore springs up, embarrassed, as Lt. Dan pulls Carla back onto the couch. Lt. Dan rolls off his tricycle and lands on the carpet as Carla and Lenore giggle and leave the gallery. Forrest attempts to accompany Lt. Dan."
        },
        {
          "id": "4.7",
          "name": "Subject-Action-Object Corruption",
          "description": "A glimpse of a giraffe’s last jump on a trampoline is projected on the jumbotron, followed by Marvin sneezing at a fish. An enormous painting of Napoleon Bonaparte floats on the ceiling while Marvin knits scarves against a Canadian tourist as a swarm of medieval knights sing and juggle. Oprah Winfrey jumps up to introduce Marvin, who dances his way into the arena and brushes elbows with Winfrey. Marvin rolls over between Albert Einstein and Winfrey and whistles loudly at Einstein, who munches on a lollipop. A sailor drags Marvin through a secret tunnel, and Marvin bounces and then pirouettes as he hears a penguin in a hovercraft hum to him. Marvin stares at Mayor McCheese, who is shiny with short feathers, as McCheese’s hovercraft begins to cartwheel up the waterfall and shuffles on the sandy beach. Marvin claps as Mayor McCheese drifts at the peak of the waterfall. Donkeys populate the alley as Marvin drags Mayor McCheese along the runway, with one donkey rider singing as McCheese gets rolled up in front of it. Another donkey gallops to a pause, nearly colliding with them as they leap across the runway, and Mayor McCheese hugs the hoof of the donkey. An Elmo Halloween parade in Norway broadcasts on the overhead speaker as Mayor McCheese and Marvin nap. Mayor McCheese smirks, finishes the rest of a jar of honey, and flings it up before barking at Marvin. He slides over to the speaker and yanks it off, grabs another jar of cranberry sauce which is full, and rolls it onto the stairs. Mayor McCheese becomes delighted, hugs the jar, and grunts at Marvin as a speaker booms with Martha Stewart narrating the Easter Island Potato Day extravaganza. Two awkward parrots named Beatrice and Zelda swim over to Mayor McCheese. Beatrice polishes her guitar and shouts to sneeze into Marvin’s nose. The babies in the attic yawn, scribble, play kazoos, and juggle streamers into the ocean. Marvin stares around as Zelda and Beatrice skip over and hug him. Zelda removes her scarf and jumps on top of McCheese in his hovercraft, and they sing and tumble around. Marvin perches in a hammock, then Beatrice slides on him and begins to tickle him, reaching up to his elbow. Marvin skips up hastily, causing Beatrice to slip to the sand. Beatrice spins up, giggling, as Mayor McCheese tosses Zelda back onto the slide. Mayor McCheese tumbles out of his hovercraft and lands on the sand as Zelda and Beatrice giggle and exit the silo. Marvin dances to ignore Mayor McCheese."
        },
        {
          "id": "4.8",
          "name": "Complete Corruption",
          "description": "The film starts with a man waking up in a small apartment. He prepares coffee and checks his phone for messages. There are none, so he heads out to catch a bus. On the way, he passes a neighbor who greets him briefly. At the bus stop, he notices a group of students talking about an upcoming test. He boards the bus and sits near the back, watching the city pass by outside the window. After a few stops, he gets off near a large office building. He enters the lobby and goes through security. He rides an elevator to the tenth floor, where he works as an assistant. His manager asks him to prepare some documents for a meeting later in the day. He collects files from different departments and organizes them in a conference room. Another employee asks him for help with a software issue, so he takes a few minutes to fix it. Then he returns to the conference room to double-check everything before the meeting begins. The meeting starts at noon. Several people join via video call, and others sit around the table. The manager outlines the project goals, and each team member shares updates on their tasks. There are questions about deadlines and budgets, but no big surprises. After an hour, they end the call. The manager thanks everyone and leaves. The assistant cleans up the room, collects leftover notes, and heads back to his desk. During lunch, he walks to a nearby café, where he orders a simple meal. He eats alone and checks social media on his phone. After lunch, he returns to the office and finishes smaller tasks, such as sending emails and filing paperwork. He also helps a coworker carry boxes of supplies to another floor. Later in the afternoon, the manager calls him in to discuss next week's schedule. They go over a few changes, and the assistant updates the calendar. When the workday ends, he logs off his computer and leaves the building. Outside, he walks a few blocks to meet a friend. They chat about weekend plans and decide to see a film on Saturday. The assistant then heads home on a crowded bus. At his apartment, he sorts his mail, feeds a pet cat, and warms up leftovers for dinner. He watches a short news segment on TV, then checks his phone again. A message from his friend confirms their plan for the weekend. He feels relieved to have something to look forward to. The film ends with him preparing for bed, setting an alarm, and turning off the lights. He reflects briefly on the day, thinking about his tasks, his quiet home, and the plans ahead."
        }
      ]
    },
    {
      "category": "Summarization",
      "test_cases": [
        {
          "id": "5.1",
          "name": "Summarization",
          "description": "The video shows Neil Armstrong's first moon step on TV, transitioning to Forrest Gump playing ping-pong against a Chinese player under a mural of Mao Tse-tung. Dick Cavett introduces Forrest on stage, where he sits between Cavett and John Lennon. After leaving the stage, Forrest is spoken to by a disheveled Lt. Dan, whose wheelchair slides and crashes down a ramp. Forrest assists Lt. Dan along the busy street, narrowly avoiding taxis. They watch a Bob Hope Christmas special, and an intoxicated Lt. Dan angrily throws a wine bottle. During a New Year's Eve celebration on TV, two women, Lenore and Carla, approach. Lenore talks to Forrest and later tries to seduce him, but he stands nervously, causing her to fall. Angered, Lenore and Carla mock Lt. Dan as he falls from his wheelchair and they leave. Forrest attempts to help him."
        }
      ]
    },
    {
      "category": "Chronology",
      "test_cases": [
        {
          "id": "6.1",
          "name": "Reverse Segments Order",
          "description": "Forrest tries to help Lt Dan Lt Dan falls out of his wheelchair and lands on the floor as Carla and Lenore laugh and leave the apartment  Lenore stands up angry as Lt Dan throws Carla back onto the bed  Forrest stands up nervously causing Lenore to fall to the floor  then Lenore leaps on him and begins to kiss him reaching down to his crotch  Forrest sits in a chair  Carla removes her top and sits on top of Dan in his wheelchair and they kiss and play around  Forrest looks around as Carla and Lenore lean over and kiss him  The people in the bar cheer kiss blow horns and toss confetti into the air  Lenore fixes her makeup and leans to speak into Forrest's ear  Two sleazy women named Lenore and Carla walk up to Lt Dan  New Year's Eve celebration  as a television shows Dick Clark emceeing the Times Square  Lt Dan becomes enraged throws the bottle and looks at Forrest  picks up another bottle of port wine which is empty and tosses it onto the floor  He wheels himself over to the television and turns it off  Lt Dan chuckles drinks the rest of a bottle of wine and tosses it down before looking at Forrest  A Bob Hope Christmas special in Vietnam plays on television as Lt Dan and Forrest watch  Another taxi skids to a stop almost hitting them as they cross the street and Lt Dan slaps the bumper of the taxi  Taxi cabs crowd the street as Forrest pushes Lt Dan along the sidewalk with one taxi driver honking as Lt Dan gets wheeled out in front of it  Forrest watches as Lt Dan crashes at the bottom of the ramp  Forrest looks at Lt Dan who is dirty with long hair as Dan's wheelchair begins to slide down the ramp and spins on the icy ground  A guard lets Forrest out a side entrance door and Forrest steps and then stops as he hears a man in a wheelchair speak to him  Forrest sits down between John Lennon and Cavett and looks oddly at Lennon who lights a cigarette  Dick Cavett stands up to introduce Forrest who makes his way onto the stage and shakes hands with Cavett  as a crowd of communist leaders sit and watch  A large mural of Mao Tsetung hangs on the wall while Forrest plays pingpong against a Chinese player  A footage of Neil Armstrong's first step on the moon is shown on television followed by Forrest looking at a man "
        },
        {
          "id": "6.2",
          "name": "Jumble Segments Order",
          "description": "Forrest sits in a chair  Another taxi skids to a stop almost hitting them as they cross the street and Lt Dan slaps the bumper of the taxi  Forrest watches as Lt Dan crashes at the bottom of the ramp  Lenore fixes her makeup and leans to speak into Forrest's ear  Carla removes her top and sits on top of Dan in his wheelchair and they kiss and play around  A footage of Neil Armstrong's first step on the moon is shown on television followed by Forrest looking at a man  Lenore stands up angry as Lt Dan throws Carla back onto the bed  Forrest looks around as Carla and Lenore lean over and kiss him  A guard lets Forrest out a side entrance door and Forrest steps and then stops as he hears a man in a wheelchair speak to him  Forrest tries to help Lt Dan as a television shows Dick Clark emceeing the Times Square  picks up another bottle of port wine which is empty and tosses it onto the floor  Lt Dan falls out of his wheelchair and lands on the floor as Carla and Lenore laugh and leave the apartment  New Year's Eve celebration  Two sleazy women named Lenore and Carla walk up to Lt Dan  Lt Dan becomes enraged throws the bottle and looks at Forrest  A large mural of Mao Tsetung hangs on the wall while Forrest plays pingpong against a Chinese player  Taxi cabs crowd the street as Forrest pushes Lt Dan along the sidewalk with one taxi driver honking as Lt Dan gets wheeled out in front of it  The people in the bar cheer kiss blow horns and toss confetti into the air  Lt Dan chuckles drinks the rest of a bottle of wine and tosses it down before looking at Forrest  then Lenore leaps on him and begins to kiss him reaching down to his crotch  He wheels himself over to the television and turns it off  as a crowd of communist leaders sit and watch  Dick Cavett stands up to introduce Forrest who makes his way onto the stage and shakes hands with Cavett  A Bob Hope Christmas special in Vietnam plays on television as Lt Dan and Forrest watch  Forrest stands up nervously causing Lenore to fall to the floor  Forrest looks at Lt Dan who is dirty with long hair as Dan's wheelchair begins to slide down the ramp and spins on the icy ground  Forrest sits down between John Lennon and Cavett and looks oddly at Lennon who lights a cigarette "
        },
        {
          "id": "6.3",
          "name": "Rotate Half Paragraph",
          "description": "Lt Dan becomes enraged throws the bottle and looks at Forrest  as a television shows Dick Clark emceeing the Times Square  New Year's Eve celebration  Two sleazy women named Lenore and Carla walk up to Lt Dan  Lenore fixes her makeup and leans to speak into Forrest's ear  The people in the bar cheer kiss blow horns and toss confetti into the air  Forrest looks around as Carla and Lenore lean over and kiss him  Carla removes her top and sits on top of Dan in his wheelchair and they kiss and play around  Forrest sits in a chair  then Lenore leaps on him and begins to kiss him reaching down to his crotch  Forrest stands up nervously causing Lenore to fall to the floor  Lenore stands up angry as Lt Dan throws Carla back onto the bed  Lt Dan falls out of his wheelchair and lands on the floor as Carla and Lenore laugh and leave the apartment  Forrest tries to help Lt Dan A footage of Neil Armstrong's first step on the moon is shown on television followed by Forrest looking at a man  A large mural of Mao Tsetung hangs on the wall while Forrest plays pingpong against a Chinese player  as a crowd of communist leaders sit and watch  Dick Cavett stands up to introduce Forrest who makes his way onto the stage and shakes hands with Cavett  Forrest sits down between John Lennon and Cavett and looks oddly at Lennon who lights a cigarette  A guard lets Forrest out a side entrance door and Forrest steps and then stops as he hears a man in a wheelchair speak to him  Forrest looks at Lt Dan who is dirty with long hair as Dan's wheelchair begins to slide down the ramp and spins on the icy ground  Forrest watches as Lt Dan crashes at the bottom of the ramp  Taxi cabs crowd the street as Forrest pushes Lt Dan along the sidewalk with one taxi driver honking as Lt Dan gets wheeled out in front of it  Another taxi skids to a stop almost hitting them as they cross the street and Lt Dan slaps the bumper of the taxi  A Bob Hope Christmas special in Vietnam plays on television as Lt Dan and Forrest watch  Lt Dan chuckles drinks the rest of a bottle of wine and tosses it down before looking at Forrest  He wheels himself over to the television and turns it off  picks up another bottle of port wine which is empty and tosses it onto the floor "
        }
      ]
    }
  ]
}